[
  {
    "id": 41863061,
    "title": "Máy tính AI không giỏi về AI: CPU vượt trội hơn NPU",
    "originLink": "https://github.com/usefulsensors/qc_npu_benchmark",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863061",
    "commentBody": "",
    "originSummary": [
      "Đánh giá hiệu suất của Đơn vị Xử lý Thần kinh (NPU) của Qualcomm trên máy tính bảng Microsoft Surface cho thấy chỉ đạt 1,3% so với 45 Teraops/s được quảng cáo, chỉ đạt 573 tỷ phép toán mỗi giây.",
      "Theo các bài kiểm tra, bao gồm các phép nhân ma trận tương tự như trong các mô hình transformer, cho thấy NPU hoạt động chậm hơn CPU, mặc dù đã sử dụng các công cụ như Python, Cmake và Visual Studio.",
      "Những yếu tố khác nhau như cài đặt nguồn, cấu trúc mô hình và lỗi cấu hình đã được xem xét, cho thấy hiệu suất của NPU thấp hơn đáng kể so với tiềm năng được quảng cáo."
    ],
    "commentSummary": [
      "Máy tính AI sử dụng Đơn vị Xử lý Thần kinh (NPU) của Qualcomm không đáp ứng được kỳ vọng về hiệu suất, với CPU thường vượt trội hơn NPU.",
      "Đơn vị xử lý thần kinh (NPU) được thiết kế để tiết kiệm năng lượng hơn là tốc độ, dẫn đến khoảng cách hiệu suất tối thiểu giữa CPU và GPU, cho thấy những tiềm năng không hiệu quả.",
      "Việc triển khai hiện tại của các NPU có thể chưa được tối ưu hóa hoàn toàn, nhấn mạnh nhu cầu cần có sự hỗ trợ và tối ưu hóa tốt hơn để khai thác lợi ích tiết kiệm năng lượng mà chúng mang lại."
    ],
    "points": 460,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1729107842
  },
  {
    "id": 41870040,
    "title": "Chức năng xoay hình ảnh mới của Adobe là một trong những công cụ AI ấn tượng nhất từng thấy",
    "originLink": "https://www.creativebloq.com/design/adobes-new-image-rotation-tool-is-one-of-the-most-impressive-ai-concepts-weve-seen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41870040",
    "commentBody": "",
    "originSummary": [
      "Adobe đã giới thiệu 'Project Turntable' tại hội nghị MAX, một công cụ được điều khiển bởi AI cho phép người dùng xoay nghệ thuật vector 2D trong không gian 3D trong khi vẫn giữ nguyên vẻ ngoài 2D của nó.",
      "Đây là công cụ có thể tự động điền vào các chi tiết còn thiếu, chẳng hạn như thêm chân cho một con ngựa khi hình ảnh được xoay, thể hiện khả năng AI tiên tiến.",
      "Adobe đã công bố hơn 100 tính năng mới trong tuần này, nhấn mạnh một bước tiến đáng kể trong công nghệ AI, mặc dù chưa rõ liệu 'Project Turntable' có được thương mại hóa hay không."
    ],
    "commentSummary": [
      "Adobe đã giới thiệu một công cụ xoay hình ảnh AI mới cho phép đồ họa vector 2D được xoay trong không gian 3D, đáp ứng nhu cầu thực tế của người dùng.",
      "Được khen ngợi vì sự đổi mới, công cụ này tạo sự khác biệt so với các công ty công nghệ khác thường tập trung vào AI để thu hút nhà đầu tư hơn là lợi ích cho người dùng.",
      "Mặc dù có một số chỉ trích về các hoạt động kinh doanh của Adobe, công cụ này được coi là một bước đi thông minh, đặc biệt có lợi cho các họa sĩ minh họa, nhấn mạnh sự cân bằng giữa đổi mới và thiết kế lấy người dùng làm trung tâm trong phát triển AI."
    ],
    "points": 440,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1729175478
  },
  {
    "id": 41864632,
    "title": "Việc sử dụng Cloudflare trên trang web của bạn có thể đang chặn người dùng RSS",
    "originLink": "https://openrss.org/blog/using-cloudflare-on-your-website-could-be-blocking-rss-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41864632",
    "commentBody": "",
    "originSummary": [
      "Chế độ Bot Fight Mode và tính năng chặn AI scraper của Cloudflare có thể vô tình chặn các trình đọc RSS hợp pháp, ảnh hưởng đến chức năng của chúng. - Người dùng có thể đưa các trình đọc RSS vào danh sách trắng bằng cách xác định user agent hoặc địa chỉ IP của chúng trong bảng điều khiển của Cloudflare, mặc dù quá trình này khá rườm rà và không đáng tin cậy. - Open RSS, một tổ chức phi lợi nhuận, đề xuất quyên góp để hỗ trợ dịch vụ của họ, nhấn mạnh sự cần thiết của Cloudflare trong việc cải thiện hệ thống để ngăn chặn việc chặn các trình đọc RSS."
    ],
    "commentSummary": [
      "Biện pháp bảo mật của Cloudflare đang vô tình chặn người dùng RSS, ảnh hưởng đến các dịch vụ như NewsBlur, một trình đọc RSS mã nguồn mở, bằng cách gây ra lỗi 403.",
      "Mặc dù nằm trong danh sách bot đã xác minh của Cloudflare, NewsBlur và các trình đọc RSS khác vẫn gặp phải thách thức do bảo vệ bot của Cloudflare, điều này thường chặn lưu lượng RSS hợp pháp.",
      "Những giải pháp được đề xuất bao gồm đưa vào danh sách trắng các URL RSS hoặc vô hiệu hóa kiểm tra bot cho các nguồn cấp dữ liệu RSS, nhưng các cài đặt mặc định của Cloudflare tiếp tục gây ra vấn đề, làm dấy lên lo ngại về quyền riêng tư và khả năng truy cập web."
    ],
    "points": 415,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1729118797
  },
  {
    "id": 41866802,
    "title": "Thoát khỏi Sandbox của Chrome thông qua DevTools",
    "originLink": "https://ading.dev/blog/posts/chrome_sandbox_escape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866802",
    "commentBody": "",
    "originSummary": [
      "Hai lỗ hổng, CVE-2024-6778 và CVE-2024-5836, đã được phát hiện trong trình duyệt web Chromium, cho phép thoát khỏi sandbox từ một tiện ích mở rộng trình duyệt và cho phép thực thi các lệnh shell trên máy tính của người dùng.",
      "Những lỗ hổng được phát hiện trong hệ thống WebUI và chính sách doanh nghiệp của Chromium, liên quan đến việc thao tác trang chrome://policy và tính năng Browser Switcher, cũng như vượt qua các hạn chế bằng cách sử dụng API chrome.devtools.inspectedWindow.",
      "Google đã phân loại những lỗ hổng này là có mức độ nghiêm trọng cao, thưởng cho nhà nghiên cứu 20.000 đô la và thực hiện các bản sửa lỗi, nhấn mạnh sự cần thiết của việc kiểm tra bảo mật kỹ lưỡng đối với mã cũ và các tính năng không được ghi chép."
    ],
    "commentSummary": [
      "Một học sinh trung học đã phát hiện ra một lỗ hổng trong DevTools của Chrome, cho phép thoát khỏi sandbox của trình duyệt, đây là một cơ chế bảo mật để cô lập nội dung web.",
      "Việc khai thác yêu cầu sự tương tác của người dùng, chẳng hạn như cài đặt một tiện ích mở rộng và mở DevTools, và chỉ ảnh hưởng đến Chromium và Chrome Canary, không ảnh hưởng đến các phiên bản Chrome ổn định.",
      "Vụ việc đã làm dấy lên cuộc tranh luận về các chương trình săn lỗi, với một số người ủng hộ việc tăng tiền thưởng để ngăn chặn việc bán các lỗ hổng trên thị trường chợ đen, trong khi những người khác nhấn mạnh rủi ro đạo đức của việc bán cho tội phạm."
    ],
    "points": 346,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1729144504
  },
  {
    "id": 41866328,
    "title": "Trả đũa của WordPress ảnh hưởng đến cộng đồng",
    "originLink": "https://lwn.net/SubscriberLink/993895/c0438e0ee9382c5f/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866328",
    "commentBody": "",
    "originSummary": [
      "Cuộc xung đột giữa Automattic và WP Engine đang gây ra sự gián đoạn trong cộng đồng WordPress, khi CEO của Automattic, Matt Mullenweg, trả đũa WP Engine bằng cách tạo ra một phiên bản fork thù địch của một plugin.",
      "WP Engine đã đệ đơn kiện Automattic, dẫn đến một bầu không khí chia rẽ nơi các cộng tác viên phải chọn phe, và một số người đối mặt với lệnh cấm vì đặt câu hỏi về các chính sách.",
      "Điều này nhấn mạnh những thách thức về quản trị và thương mại hóa trong các dự án mã nguồn mở, làm dấy lên lo ngại về tương lai của WordPress và động lực cộng đồng."
    ],
    "commentSummary": [
      "Hiện tại, cộng đồng WordPress đang trải qua sự bất ổn do những cáo buộc chống lại Matt Mullenweg về việc sử dụng Quỹ WordPress cho các dự án cá nhân thay vì duy trì tính độc lập của nó.",
      "Những hành động gây tranh cãi của Mullenweg, chẳng hạn như tiếp quản một plugin phổ biến và cấm WP Engine khỏi WordPress.org, đã dẫn đến sự phản đối đáng kể.",
      "Automattic, công ty đứng sau WordPress, đã đề nghị mua lại cổ phần từ các nhân viên không đồng ý với hành động của Mullenweg, dẫn đến các cuộc thảo luận về quản trị mã nguồn mở và mối quan hệ giữa WordPress và Automattic."
    ],
    "points": 221,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1729138011
  },
  {
    "id": 41869460,
    "title": "Phát triển game bằng Lisp. Phần 2: Hầm ngục và Giao diện",
    "originLink": "https://gitlab.com/lockie/cl-fast-ecs/-/wikis/tutorial-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41869460",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bài viết 'Gamedev in Lisp Part 2: Dungeons and Interfaces' trên GitLab được khen ngợi vì sự rõ ràng, chiều sâu và các hướng dẫn toàn diện, bao gồm các mẫu mã và hỗ trợ hình ảnh.",
      "Đoạn văn này đề cập đến việc quản lý các bản dựng trên nhiều hệ điều hành và cung cấp cái nhìn sâu sắc về lịch sử của Lisp cũng như các ứng dụng của nó trong phát triển trò chơi.",
      "Cuộc thảo luận xung quanh bài viết nêu bật tính linh hoạt và phức tạp của Lisp, với độc giả chia sẻ các dự án và kinh nghiệm của họ, và một số bày tỏ sự đánh giá cao mới mẻ đối với ngôn ngữ này."
    ],
    "points": 194,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1729171585
  },
  {
    "id": 41871375,
    "title": "Crokinole",
    "originLink": "https://pudding.cool/2024/10/crokinole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41871375",
    "commentBody": "",
    "originSummary": [
      "Vào tháng 10 năm 2024, Connor Reinman và Jason Slater, những người chơi Crokinole nổi tiếng, đã đạt được hai vòng hoàn hảo tại bán kết Giải vô địch Crokinole thế giới, một kỳ tích hiếm có với tỷ lệ 1 trong 277 vòng.",
      "Crokinole là một trò chơi trên bàn từ Ontario, Canada, tương tự như shuffleboard và curling, nơi người chơi búng đĩa vào các khu vực ghi điểm, nhắm vào một lỗ trung tâm có giá trị 20 điểm.",
      "Trò chơi này đang ngày càng phổ biến trên toàn thế giới, mặc dù nó vẫn chưa được công nhận là một môn thể thao Olympic."
    ],
    "commentSummary": [
      "Crokinole là một trò chơi trên bàn truyền thống với lịch sử phong phú, đặc biệt phổ biến ở Canada, và thường được chơi trên các bàn thủ công được truyền lại qua nhiều thế hệ.",
      "Theo trò chơi có tính chất xúc giác và xã hội, tương tự như shuffleboard hoặc curling, và có thể chơi trên một bàn nhỏ, làm cho nó trở nên dễ tiếp cận và thú vị cho mọi lứa tuổi.",
      "Phiên bản kỹ thuật số và các biến thể, chẳng hạn như Crokicurl, một sự kết hợp giữa Crokinole và curling, đã xuất hiện, mở rộng phạm vi và sức hấp dẫn của nó trong cộng đồng trò chơi board."
    ],
    "points": 160,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1729184089
  },
  {
    "id": 41868683,
    "title": "Các con mèo (gần như) là chất lỏng",
    "originLink": "https://www.cell.com/iscience/fulltext/S2589-0042(24)02024-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41868683",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Các loài mèo có khả năng thích nghi cao, cho phép chúng di chuyển qua các không gian hẹp một cách dễ dàng, không giống như chó.",
      "Râu nhạy cảm của chúng, được gọi là râu xúc giác, và cột sống linh hoạt giúp chúng nhanh nhẹn và có khả năng di chuyển qua các không gian chật hẹp.",
      "Các hành vi và đặc điểm thể chất của mèo được hình thành bởi vai trò kép của chúng là kẻ săn mồi và con mồi, tìm kiếm không gian kín để an toàn và săn bắt, góp phần vào những chuyển động linh hoạt, giống như chất lỏng của chúng."
    ],
    "points": 153,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1729165380
  },
  {
    "id": 41863278,
    "title": "Chúng ta cũng nên trò chuyện chứ? Phân tích bảo mật của giao thức mã hóa Mmtls của WeChat",
    "originLink": "https://citizenlab.ca/2024/10/should-we-chat-too-security-analysis-of-wechats-mmtls-encryption-protocol/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863278",
    "commentBody": "",
    "originSummary": [
      "Theo báo cáo, đây là phân tích công khai đầu tiên về giao thức mã hóa MMTLS của WeChat, xác định những điểm yếu bảo mật đáng kể do các sửa đổi mật mã tùy chỉnh. - Các vấn đề như Vectơ Khởi tạo (IV) xác định và thiếu tính bảo mật tiến về phía trước được nêu bật, cho thấy sự thất bại trong việc áp dụng các thực tiễn tốt nhất về mật mã trong các ứng dụng của Trung Quốc. - Các tác giả khuyến nghị chuyển sang các giao thức mã hóa tiêu chuẩn như TLS hoặc QUIC+TLS để tăng cường bảo mật và cung cấp công cụ và tài liệu cho nghiên cứu thêm về bảo mật của WeChat."
    ],
    "commentSummary": [
      "Bài báo nêu bật những lo ngại về bảo mật với giao thức mã hóa Mmtls của WeChat, chỉ ra những điểm yếu và các lỗ hổng tiềm ẩn.",
      "Điều này cho thấy rằng những lỗ hổng này có khả năng là do các nhà phát triển làm việc quá sức hơn là do chính phủ yêu cầu, mặc dù chính phủ Trung Quốc có quyền truy cập trực tiếp vào hệ thống backend của WeChat.",
      "Cuộc thảo luận nêu lên những vấn đề rộng hơn về việc sử dụng các giao thức mã hóa không tiêu chuẩn và những thách thức trong việc duy trì liên lạc an toàn giữa bối cảnh có thể bị giám sát bởi chính phủ."
    ],
    "points": 150,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1729109218
  },
  {
    "id": 41866742,
    "title": "OpenVMM – Một VMM mới cho Windows và Linux, được viết bằng Rust",
    "originLink": "https://github.com/microsoft/openvmm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866742",
    "commentBody": "",
    "originSummary": [
      "OpenVMM là một Trình giám sát Máy ảo (VMM) mô-đun và đa nền tảng được phát triển bằng ngôn ngữ lập trình Rust.",
      "Khuyến khích đóng góp cho OpenVMM, nhưng hầu hết yêu cầu ký Thỏa thuận Cấp phép Người đóng góp (CLA), được hỗ trợ bởi một bot CLA trong quá trình yêu cầu kéo.",
      "Đề án tuân thủ Quy tắc Ứng xử Mã nguồn Mở của Microsoft, và các thắc mắc có thể được gửi đến opencode@microsoft.com."
    ],
    "commentSummary": [
      "OpenVMM là một Trình Giám Sát Máy Ảo (VMM) mới dành cho Windows và Linux, được phát triển bằng ngôn ngữ Rust, nhấn mạnh các tính năng an toàn hơn so với các ngôn ngữ truyền thống như C/C++.",
      "Dự án tập trung vào OpenHCL như một paravisor nhưng thiếu sự hoàn thiện trong các ngữ cảnh máy chủ truyền thống và không đảm bảo sự ổn định của API.",
      "OpenVMM được các nhân viên Microsoft sử dụng và được tích hợp vào cơ sở hạ tầng Azure, nhấn mạnh tầm quan trọng của nó trong các môi trường điện toán đám mây."
    ],
    "points": 142,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1729143726
  },
  {
    "id": 41863398,
    "title": "Đạo hàm bậc N mượt mà tự động của dữ liệu nhiễu",
    "originLink": "https://github.com/hugohadfield/kalmangrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863398",
    "commentBody": "",
    "originSummary": [
      "Đề án nhằm phân biệt dữ liệu cảm biến để phân tích bằng cách sử dụng bộ lọc Kalman, được biết đến với việc lấy mẫu lại để có tốc độ nhất quán và làm mượt các giá trị ngoại lai.",
      "Một thư viện lọc/làm mịn Bayesian mới dựa trên numpy, có tên là Kalmangrad, đã được phát triển và có sẵn trên GitHub.",
      "The developer sẵn sàng nhận phản hồi, yêu cầu tính năng và báo cáo lỗi để cải thiện thư viện hơn nữa."
    ],
    "commentSummary": [
      "Bài dự án tập trung vào việc phân biệt dữ liệu cảm biến nhiễu bằng cách sử dụng bộ lọc Kalman, được ưa chuộng để làm mịn và lấy mẫu lại.",
      "Một thư viện lọc Bayesian đã được phát triển để giải quyết thách thức này, với tiềm năng mở rộng tính năng dựa trên phản hồi của người dùng.",
      "Theo dõi chất lượng không khí và xe tự lái là những lĩnh vực mà dự án có thể áp dụng, và nó hữu ích cho việc tính toán đạo hàm trong dữ liệu có nhiễu, được lấy mẫu không đồng đều."
    ],
    "points": 137,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729109866
  }
]
