[
  {
    "id": 41863061,
    "title": "AI கணினிகள் AI இல் சிறப்பாக இல்லை: CPU, NPU ஐ மிஞ்சுகிறது",
    "originLink": "https://github.com/usefulsensors/qc_npu_benchmark",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863061",
    "commentBody": "",
    "originSummary": [
      "Qualcomm இன் நியூரல் செயலாக்க அலகை (NPU) மைக்ரோசாஃப்ட் சர்ஃபேஸ் டேப்லெட்டில் ஒப்பிடுகையில், விளம்பரப்படுத்தப்பட்ட 45 டெராப்ஸ்/வினாடிக்கு 1.3% மட்டுமே செயல்திறன் காணப்பட்டது, வினாடிக்கு 573 பில்லியன் செயல்பாடுகளை மட்டுமே அடைந்தது.",
      "பரிசோதனைகள், அவற்றில் மாற்று மாதிரிகளில் உள்ளவற்றைப் போன்ற மேட்ரிக்ஸ் பெருக்கங்கள் அடங்கியிருந்தன, NPU CPU-வினைவிட மெதுவாக செயல்படுவதை காட்டின, Python, Cmake, மற்றும் Visual Studio போன்ற கருவிகளைப் பயன்படுத்தியிருந்தாலும்.",
      "பல்வேறு காரணிகள், உதாரணமாக மின்சார அமைப்புகள், மாதிரி வடிவமைப்பு, மற்றும் கட்டமைப்பு பிழைகள் ஆகியவை பரிசீலிக்கப்பட்டன, இது NPU இன் செயல்திறன் அதன் சந்தைப்படுத்தப்பட்ட திறனை விட குறிப்பிடத்தக்க அளவில் குறைவாக உள்ளது என்பதை குறிக்கிறது."
    ],
    "commentSummary": [
      "AI கணினிகள் Qualcomm இன் நியூரல் செயலாக்க அலகை (NPU) பயன்படுத்தி செயல்திறன் எதிர்பார்ப்புகளை பூர்த்தி செய்யவில்லை, CPUக்கள் பெரும்பாலும் NPUக்களை விட சிறப்பாக செயல்படுகின்றன.",
      "நிபந்தனை செயலி (NPU) வேகத்தை விட ஆற்றல் திறனை முன்னிலைப்படுத்தி வடிவமைக்கப்பட்டுள்ளது, இது CPU மற்றும் GPU இடையிலான செயல்திறன் வித்தியாசத்தை குறைக்கிறது, இது சாத்தியமான செயல்திறன் குறைபாடுகளை குறிக்கிறது.",
      "தற்போதைய NPU களின் செயல்பாடு முழுமையாக மேம்படுத்தப்படாமல் இருக்கலாம், அவற்றின் நோக்கமுள்ள மின்சார சேமிப்பு நன்மைகளைப் பயன்படுத்துவதற்கான மேம்பட்ட ஆதரவு மற்றும் மேம்படுத்தலின் தேவையை வலியுறுத்துகிறது."
    ],
    "points": 460,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1729107842
  },
  {
    "id": 41870040,
    "title": "அடோபியின் புதிய பட சுழற்சி கருவி இதுவரை காணப்பட்ட மிகச் சிறந்த செயற்கை நுண்ணறிவு கருவிகளில் ஒன்றாகும்",
    "originLink": "https://www.creativebloq.com/design/adobes-new-image-rotation-tool-is-one-of-the-most-impressive-ai-concepts-weve-seen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41870040",
    "commentBody": "",
    "originSummary": [
      "அடோப் 'ப்ராஜெக்ட் டர்ன்டேபிள்' என்ற கருவியை MAX மாநாட்டில் அறிமுகப்படுத்தியது, இது ஒரு AI இயக்கப்படும் கருவியாகும், இது பயனர்களுக்கு 2D வெக்டர் கலைப்பணிகளை அதன் 2D தோற்றத்தை பாதுகாத்து 3D இல் சுழற்ற அனுமதிக்கிறது.",
      "TEXT: கருவி, படத்தை சுழற்றும் போது குதிரைக்கு கால்களைச் சேர்ப்பது போன்ற, குறைவான விவரங்களை புத்திசாலித்தனமாக நிரப்ப முடியும், இது மேம்பட்ட செயற்கை நுண்ணறிவு திறன்களை வெளிப்படுத்துகிறது.",
      "அடோப் இந்த வாரம் 100 க்கும் மேற்பட்ட புதிய அம்சங்களை வெளியிட்டுள்ளது, இது AI தொழில்நுட்பத்தில் ஒரு முக்கிய முன்னேற்றத்தை வெளிப்படுத்துகிறது, ஆனால் 'ப்ராஜெக்ட் டர்ன்டேபிள்' வணிக ரீதியாக கிடைக்குமா என்பது தெளிவாக இல்லை."
    ],
    "commentSummary": [
      "அடோப் புதிய AI படத்தை சுழற்றும் கருவியை அறிமுகப்படுத்தியுள்ளது, இது 2D வெக்டர் கிராஃபிக்ஸ்களை 3D இடத்தில் சுழற்ற அனுமதிக்கிறது, இது நடைமுறை பயனர் தேவைகளை தீர்க்கிறது.",
      "இந்த கருவி அதன் புதுமைக்காக பாராட்டப்படுகிறது, இது பெரும்பாலும் பயனர் நன்மையை விட முதலீட்டாளர் ஈர்ப்புக்காக செயற்கை நுண்ணறிவில் கவனம் செலுத்தும் பிற தொழில்நுட்ப நிறுவனங்களுடன் மாறுபடுகிறது.",
      "Adobe நிறுவனத்தின் வணிக நடைமுறைகள் குறித்து சில விமர்சனங்கள் இருந்தாலும், இந்த கருவி ஒரு புத்திசாலித்தனமான நடவடிக்கையாகக் கருதப்படுகிறது, குறிப்பாக வரைகலைஞர்களுக்கு பயனுள்ளதாக உள்ளது, AI மேம்பாட்டில் புதுமை மற்றும் பயனர் மையமான வடிவமைப்புக்கு இடையிலான சமநிலையை வலியுறுத்துகிறது."
    ],
    "points": 440,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1729175478
  },
  {
    "id": 41864632,
    "title": "உங்கள் வலைத்தளத்தில் Cloudflare ஐ பயன்படுத்துவது RSS பயனர்களை தடுக்கக்கூடும்",
    "originLink": "https://openrss.org/blog/using-cloudflare-on-your-website-could-be-blocking-rss-users",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41864632",
    "commentBody": "",
    "originSummary": [
      "கிளவுட்ஃப்ளேர் இன் பாட் ஃபைட் மோடு மற்றும் AI ஸ்க்ரேப்பர் தடுக்கல் அம்சங்கள் தவறுதலாக நியாயமான RSS வாசகர்களை தடுக்கக்கூடும், இது அவற்றின் செயல்பாட்டை பாதிக்கக்கூடும்.- பயனர்கள் கிளவுட்ஃப்ளேர் டாஷ்போர்டில் அவர்களின் பயனர் ஏஜெண்ட் அல்லது IP முகவரியை அடையாளம் காண்பதன் மூலம் RSS வாசகர்களை வெள்ளைப்பட்டியலில் சேர்க்கலாம், ஆனால் இந்த செயல்முறை சிரமமானது மற்றும் நம்பகமற்றது.- ஓபன் RSS, ஒரு இலாப நோக்கமற்ற நிறுவனம், தங்கள் சேவையை ஆதரிக்க நன்கொடை வழங்க பரிந்துரைக்கிறது, RSS வாசகர்களை தடுக்காமல் இருக்க கிளவுட்ஃப்ளேர் தனது அமைப்பை மேம்படுத்த தேவையைக் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "கிளவுட்ஃப்ளேர் பாதுகாப்பு நடவடிக்கைகள் தவறுதலாக RSS பயனர்களை தடுக்கின்றன, இதனால் ஓப்பன்-சோர்ஸ் RSS ரீடர் போன்ற சேவைகள் பாதிக்கப்படுகின்றன, 403 பிழைகளை ஏற்படுத்துகின்றன.",
      "NewsBlur மற்றும் பிற RSS வாசிப்பிகள் Cloudflare இன் சரிபார்க்கப்பட்ட பாட்டுகள் பட்டியலில் இருந்தாலும், Cloudflare இன் பாட்டுகள் பாதுகாப்பு காரணமாக சவால்களை எதிர்கொள்கின்றன, இது பல நேரங்களில் நியாயமான RSS போக்குவரத்தை தடுக்கிறது.",
      "வழங்கப்பட்ட தீர்வுகளில் RSS URL-களை வெள்ளைப்பட்டியலில் சேர்ப்பது அல்லது RSS ஊட்டங்களுக்கு பாட்டுச் சோதனைகளை முடக்குவது ஆகியவை அடங்கும், ஆனால் Cloudflare இன் இயல்புநிலை அமைப்புகள் தொடர்ந்து சிக்கல்களை ஏற்படுத்துகின்றன, இணைய தனியுரிமை மற்றும் அணுகல் வசதி குறித்த கவலைகளை எழுப்புகின்றன."
    ],
    "points": 415,
    "commentCount": 195,
    "retryCount": 0,
    "time": 1729118797
  },
  {
    "id": 41866802,
    "title": "DevTools மூலம் Chrome Sandbox ஐ தப்பிக்கிறது",
    "originLink": "https://ading.dev/blog/posts/chrome_sandbox_escape.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866802",
    "commentBody": "",
    "originSummary": [
      "இரண்டு பாதிப்புகள், CVE-2024-6778 மற்றும் CVE-2024-5836, Chromium வலை உலாவியில் கண்டறியப்பட்டன, இது உலாவி நீட்சியிலிருந்து ஒரு மணல் பெட்டி தப்பிக்க அனுமதிக்கிறது மற்றும் ஒரு பயனரின் கணினியில் ஷெல் கட்டளைகளை இயக்க அனுமதிக்கிறது.",
      "Chromium இன் WebUI மற்றும் நிறுவனக் கொள்கை அமைப்புகளில் பாதிப்புகள் கண்டறியப்பட்டன, chrome://policy பக்கம் மற்றும் Browser Switcher அம்சத்தை மாற்றம் செய்வதையும், chrome.devtools.inspectedWindow API ஐப் பயன்படுத்தி கட்டுப்பாடுகளை மீறுவதையும் உள்ளடக்கியவை.",
      "Google இந்த பாதிப்புகளை அதிக தீவிரத்தன்மையுடன் வகைப்படுத்தியது, ஆராய்ச்சியாளருக்கு $20,000 பரிசு வழங்கியது மற்றும் திருத்தங்களை செயல்படுத்தியது, பழைய குறியீட்டு மற்றும் ஆவணப்படுத்தப்படாத அம்சங்களின் முழுமையான பாதுகாப்பு சோதனைகளின் தேவையை வலியுறுத்தியது."
    ],
    "commentSummary": [
      "ஒரு உயர்நிலை பள்ளி மாணவர் Chrome இன் DevTools இல் ஒரு பாதிப்பை அடையாளம் கண்டார், இது உலாவியின் சாண்ட்பாக்ஸிலிருந்து தப்பிக்க அனுமதிக்கிறது, இது வலை உள்ளடக்கத்தை தனிமைப்படுத்தும் ஒரு பாதுகாப்பு முறைமையாகும்.",
      "பயன்பாட்டைச் செயல்படுத்த பயனர் தொடர்பு தேவைப்படுகிறது, உதாரணமாக ஒரு நீட்டிப்பை நிறுவுதல் மற்றும் DevTools ஐ திறக்குதல் போன்றவை, மேலும் இது ஸ்டேபிள் Chrome பதிப்புகளை அல்லாமல், Chromium மற்றும் Chrome Canary க்கு மட்டுமே பாதிப்பை ஏற்படுத்துகிறது.",
      "இந்தச் சம்பவம் பக் பவுண்டி திட்டங்கள் குறித்து விவாதத்தை தூண்டுகிறது, சிலர் கருப்பு சந்தையில் சுரண்டல்களை விற்பனை செய்வதைத் தடுக்க அதிகமான பரிசுத்தொகைகளை ஆதரிக்கின்றனர், மற்றவர்கள் குற்றவாளிகளுக்கு விற்பனை செய்வதன் நெறிமுறை ஆபத்துகளை வலியுறுத்துகின்றனர்."
    ],
    "points": 346,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1729144504
  },
  {
    "id": 41866328,
    "title": "WordPress பழிவாங்குதல் சமூகத்தை பாதிக்கிறது",
    "originLink": "https://lwn.net/SubscriberLink/993895/c0438e0ee9382c5f/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866328",
    "commentBody": "",
    "originSummary": [
      "Automattic மற்றும் WP Engine இடையிலான மோதல் WordPress சமூகத்தில் குழப்பத்தை ஏற்படுத்துகிறது, Automattic இன் தலைமை நிர்வாக அதிகாரி Matt Mullenweg, WP Engine க்கு எதிராக ஒரு பகைமையான கிளையை உருவாக்குவதன் மூலம் பதிலடி கொடுக்கிறார்.",
      "WP Engine, Automattic மீது வழக்கு தொடர்ந்துள்ளது, இது பங்களிப்பாளர்கள் பக்கங்களைத் தேர்ந்தெடுக்க வேண்டிய பிரிவினை சூழலை உருவாக்கியுள்ளது, மேலும் சிலர் கொள்கைகளை கேள்வி எழுப்புவதற்காக தடைசெய்யப்படுகின்றனர்.",
      "இந்த நிலைமை திறந்த மூல திட்டங்களில் ஆளுமை மற்றும் வணிகமயமாக்கல் சவால்களை வலியுறுத்துகிறது, WordPress இன் எதிர்காலம் மற்றும் சமூக இயக்கவியல் குறித்து கவலைகளை எழுப்புகிறது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். WordPress சமூகத்தில் மாட்ட முல்லன்வெக் மீது குற்றச்சாட்டுகள் காரணமாக கலக்கம் நிலவுகிறது, அவர் WordPress அறக்கட்டளையை அதன் சுயாதீனத்தை பராமரிக்காமல் தனிப்பட்ட திட்டங்களுக்கு பயன்படுத்துவதாக கூறப்படுகிறது.",
      "முல்லன்வெக் எடுத்த சர்ச்சையான நடவடிக்கைகள், உதாரணமாக ஒரு பிரபலமான பிளகினை கைப்பற்றுதல் மற்றும் WP என்ஜினை WordPress.org இல் இருந்து தடை செய்தல் போன்றவை, முக்கியமான எதிர்ப்புகளை ஏற்படுத்தியுள்ளது.",
      "Automattic, WordPress இன் பின்னணியில் உள்ள நிறுவனம், Mullenweg இன் நடவடிக்கைகளுடன் ஒப்புக்கொள்ளாத ஊழியர்களுக்கு வாங்கும் வாய்ப்புகளை வழங்கியது, திறந்த மூல ஆளுமை மற்றும் WordPress-Automattic உறவின் மீதான விவாதங்களை தூண்டியது."
    ],
    "points": 221,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1729138011
  },
  {
    "id": 41869460,
    "title": "லிஸ்பில் கேம்டெவ். பகுதி 2: குகைகள் மற்றும் இடைமுகங்கள்",
    "originLink": "https://gitlab.com/lockie/cl-fast-ecs/-/wikis/tutorial-2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41869460",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "GitLab இல் உள்ள \"Gamedev in Lisp Part 2: Dungeons and Interfaces\" என்ற கட்டுரை அதன் தெளிவிற்கும் ஆழத்திற்கும், குறியீட்டு மாதிரிகள் மற்றும் காட்சிப் உதவிகளுடன் கூடிய விரிவான பயிற்சிகளுக்கும் பாராட்டப்படுகிறது.",
      "இது பல இயக்க முறைமைகளில் கட்டிடங்களை நிர்வகிப்பதையும், லிஸ்பின் வரலாறு மற்றும் கேம் டெவலப்மெண்டில் அதன் பயன்பாடுகள் பற்றிய பார்வைகளை வழங்குவதையும் உள்ளடக்கியது.",
      "கட்டுரையைச் சுற்றியுள்ள விவாதம் Lisp இன் பல்திறன்மையும் சிக்கலுமையை வெளிப்படுத்துகிறது, வாசகர்கள் தங்கள் திட்டங்கள் மற்றும் அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள், மேலும் சிலர் அந்த மொழிக்கு புதிய பாராட்டை வெளிப்படுத்துகிறார்கள்."
    ],
    "points": 194,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1729171585
  },
  {
    "id": 41871375,
    "title": "க்ரோகினோல்",
    "originLink": "https://pudding.cool/2024/10/crokinole/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41871375",
    "commentBody": "",
    "originSummary": [
      "2024 அக்டோபரில், புகழ்பெற்ற க்ரோகினோல் வீரர்களான கானர் ரெயின்மேன் மற்றும் ஜேசன் ஸ்லேட்டர், உலக க்ரோகினோல் சாம்பியன்ஷிப் அரையிறுதியில் இரட்டை சிறந்த சுற்றுகளை அடைந்தனர், இது 277 சுற்றுகளில் 1 என்ற வாய்ப்புகளுடன் அரிதான சாதனையாகும்.",
      "Crokinole என்பது ஒன்டாரியோ, கனடாவில் இருந்து வந்த ஒரு மேசை விளையாட்டு ஆகும், இது ஷஃபிள்போர்டு மற்றும் கர்லிங் போன்றது, இதில் வீரர்கள் புள்ளிகள் பெறும் பகுதிகளுக்குள் வட்டங்களை தட்டுவதன் மூலம் மையத்தில் உள்ள 20 புள்ளிகள் மதிப்புள்ள துளைக்குள் அடிக்க முயலுகிறார்கள்.",
      "இந்த விளையாட்டு இன்னும் ஒலிம்பிக் விளையாட்டாக அங்கீகரிக்கப்படவில்லை என்றாலும், சர்வதேச புகழ் பெறுகிறது."
    ],
    "commentSummary": [
      "Crokinole என்பது பாரம்பரிய பலகை விளையாட்டு ஆகும், இது கனடாவில் மிகவும் பிரபலமாக உள்ளது, மேலும் பெரும்பாலும் தலைமுறைகளுக்கு முந்திய கையால் செய்யப்பட்ட பலகைகளில் விளையாடப்படுகிறது.",
      "விளையாட்டு தொடுதன்மை மற்றும் சமூகத்தன்மை கொண்டது, இது ஷஃபிள்போர்டு அல்லது கர்லிங் போன்றது, மேலும் சிறிய மேசையில் விளையாட முடியும், இதனால் அனைத்து வயதினருக்கும் அணுகக்கூடியதும் மகிழ்ச்சிகரமானதுமானதாக உள்ளது.",
      "TEXT: டிஜிட்டல் பதிப்புகள் மற்றும் மாற்றங்கள், Crokinole மற்றும் கேர்லிங் ஆகியவற்றின் கலவையான Crokicurl போன்றவை தோன்றியுள்ளன, இது பலகை விளையாட்டு சமூகத்தில் அதன் வரம்பையும் கவர்ச்சியையும் விரிவாக்குகிறது."
    ],
    "points": 160,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1729184089
  },
  {
    "id": 41868683,
    "title": "பூனைகள் (கிட்டத்தட்ட) திரவம்",
    "originLink": "https://www.cell.com/iscience/fulltext/S2589-0042(24)02024-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41868683",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பூனைகள் உயர் மட்டத்திலான தழுவும் திறனை கொண்டுள்ளன, இது அவற்றை நாய்களைப் போல அல்லாமல் குறுகிய இடங்களை எளிதாகச் சுழல அனுமதிக்கிறது.",
      "அவர்களின் நுண்ணிய மீசைகள், 'விப்ரிசே' என்று அழைக்கப்படுகின்றன, மற்றும் நெகிழ்வான முள்ளுகள், அவர்களின் சுறுசுறுப்புக்கும், குறுகிய இடங்களில் நகரும் திறனுக்கும் உதவுகின்றன.",
      "பூனைகளின் நடத்தை மற்றும் உடல் பண்புகள், வேட்டையாடுபவர்களாகவும், இரையாகவும் அவர்களின் இரட்டை பாத்திரத்தால் வடிவமைக்கப்படுகின்றன, பாதுகாப்பிற்கும் வேட்டையாடுவதற்கும் மூடப்பட்ட இடங்களைத் தேடுவதால், அவர்களின் திரவம் போன்ற இயக்கங்களுக்கு பங்களிக்கின்றன."
    ],
    "points": 153,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1729165380
  },
  {
    "id": 41863278,
    "title": "நாம் பேச வேண்டுமா? WeChat இன் Mmtls குறியாக்க நெறிமுறையின் பாதுகாப்பு பகுப்பாய்வு",
    "originLink": "https://citizenlab.ca/2024/10/should-we-chat-too-security-analysis-of-wechats-mmtls-encryption-protocol/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863278",
    "commentBody": "",
    "originSummary": [
      "அறிக்கை WeChat இன் MMTLS குறியாக்க நெறிமுறையின் முதல் பொது பகுப்பாய்வாகும், தனிப்பயன் குறியாக்க மாற்றங்களால் முக்கியமான பாதுகாப்பு பலவீனங்களை அடையாளம் காண்கிறது.- தீர்மானமான Initialization Vectors (IVs) மற்றும் முன்னேற்ற ரகசியத்தின்欠பாடு போன்ற பிரச்சினைகள் குறிப்பிடப்படுகின்றன, இது சீன பயன்பாடுகளில் குறியாக்க சிறந்த நடைமுறைகளை ஏற்க தவறியதை குறிக்கிறது.- பாதுகாப்பை மேம்படுத்துவதற்காக TLS அல்லது QUIC+TLS போன்ற நிலையான குறியாக்க நெறிமுறைகளுக்கு மாற பரிந்துரைக்கின்றனர் மற்றும் WeChat இன் பாதுகாப்பு குறித்த மேலும் ஆராய்ச்சிக்கான கருவிகள் மற்றும் ஆவணங்களை வழங்குகின்றனர்."
    ],
    "commentSummary": [
      "கட்டுரை WeChat இன் Mmtls குறியாக்க நெறிமுறையின் பாதுகாப்பு கவலைகளை வெளிப்படுத்துகிறது, அதன் பலவீனங்கள் மற்றும் சாத்தியமான பாதிப்புகளை சுட்டிக்காட்டுகிறது.",
      "இது இந்த பாதிப்புகள் அதிக வேலைச்சுமை கொண்ட டெவலப்பர்களால் ஏற்பட்டிருக்கலாம் என்பதைக் குறிக்கிறது, சீன அரசாங்கத்திற்குத் தன்னிச்சையான அணுகல் இருந்தாலும், அரசாங்கத்தின் கட்டளையால் அல்ல.",
      "இந்த விவாதம், நிலையான அல்லாத குறியாக்க நெறிமுறைகளைப் பயன்படுத்துவது மற்றும் அரசாங்க கண்காணிப்பு சாத்தியமான சூழ்நிலைகளில் பாதுகாப்பான தொடர்புகளை பராமரிக்கும் சவால்கள் பற்றிய பரந்த பிரச்சினைகளை எழுப்புகிறது."
    ],
    "points": 150,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1729109218
  },
  {
    "id": 41866742,
    "title": "OpenVMM – விண்டோஸ் மற்றும் லினக்ஸிற்கான புதிய VMM, ரஸ்ட் மொழியில் எழுதப்பட்டது",
    "originLink": "https://github.com/microsoft/openvmm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41866742",
    "commentBody": "",
    "originSummary": [
      "OpenVMM என்பது ரஸ்ட் நிரல்மொழியில் உருவாக்கப்பட்ட, தொகுதி அடிப்படையிலான மற்றும் பல்வேறு தளங்களில் இயங்கக்கூடிய ஒரு மெய்நிகர் இயந்திர கண்காணிப்பான் (VMM) ஆகும்.",
      "OpenVMM க்கு பங்களிப்புகள் ஊக்குவிக்கப்படுகின்றன, ஆனால் பெரும்பாலானவை பங்களிப்பாளர் உரிமம் ஒப்பந்தத்தில் (CLA) கையொப்பமிடுவதை தேவைப்படும், இது புல் கோரிக்கைகளின் போது CLA பாட்டால் எளிதாக்கப்படுகிறது.",
      "இந்த திட்டம் மைக்ரோசாஃப்ட் திறந்த மூலக் குறியீட்டு நடத்தை விதிமுறைகளை பின்பற்றுகிறது, மேலும் கேள்விகள் opencode@microsoft.com க்கு அனுப்பப்படலாம்."
    ],
    "commentSummary": [
      "OpenVMM என்பது Windows மற்றும் Linux க்கான புதிய மெய்நிகர் இயந்திர கண்காணிப்பான் (VMM) ஆகும், இது Rust இல் உருவாக்கப்பட்டுள்ளது, மற்றும் C/C++ போன்ற பாரம்பரிய மொழிகளுக்கு மேல் பாதுகாப்பு அம்சங்களை முக்கியமாகக் கருதுகிறது.",
      "திட்டம் OpenHCL ஐ ஒரு பராவிசர் ஆக மையமாகக் கொண்டுள்ளது, ஆனால் பாரம்பரிய ஹோஸ்ட் சூழல்களில் பளபளப்பை இழந்துள்ளது மற்றும் API நிலைத்தன்மையை உறுதிப்படுத்தவில்லை.",
      "OpenVMM என்பது மைக்ரோசாஃப்ட் ஊழியர்களால் பயன்படுத்தப்படுகிறது மற்றும் அது Azure கட்டமைப்பில் ஒருங்கிணைக்கப்பட்டுள்ளது, இது மேக கணினி சூழல்களில் அதன் முக்கியத்துவத்தை வெளிப்படுத்துகிறது."
    ],
    "points": 142,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1729143726
  },
  {
    "id": 41863398,
    "title": "இயந்திரமயமாக்கப்பட்ட மென்மையான Nவது வரிசை டெரிவேடிவ்கள் சத்தமுள்ள தரவின்",
    "originLink": "https://github.com/hugohadfield/kalmangrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41863398",
    "commentBody": "",
    "originSummary": [
      "திட்டம், சென்சார் தரவுகளை கல்மான் வடிகட்டிகளைப் பயன்படுத்தி பகுப்பாய்வு செய்வதற்காக வேறுபடுத்துவதை நோக்கமாகக் கொண்டுள்ளது, இது ஒரு நிலையான விகிதத்திற்கு மறுஅமர்த்தல் மற்றும் வெளிப்புறங்களை மிருதுவாக்குவதற்காக அறியப்படுகிறது.",
      "ஒரு புதிய numpy அடிப்படையிலான பேசியன் வடிகட்டி/மென்மையாக்கும் நூலகம், Kalmangrad என பெயரிடப்பட்டுள்ளது, உருவாக்கப்பட்டு GitHub இல் கிடைக்கிறது.",
      "டெவலப்பர் கருத்துக்களை, அம்ச கோரிக்கைகளை மற்றும் பிழை அறிக்கைகளை ஏற்கின்றார், நூலகத்தை மேலும் மேம்படுத்துவதற்காக."
    ],
    "commentSummary": [
      "திட்டம், சலனம் உள்ள சென்சார் தரவுகளை கல்மான் வடிகட்டிகளைப் பயன்படுத்தி வேறுபடுத்துவதில் கவனம் செலுத்துகிறது, அவை மென்மைப்படுத்தல் மற்றும் மீள vzகலனுக்கு விரும்பப்படுகின்றன.",
      "ஒரு பயேசியன் வடிகட்டல் நூலகம் இந்த சவாலுக்கு தீர்வு காண உருவாக்கப்பட்டது, பயனர் கருத்துக்களை அடிப்படையாகக் கொண்டு அம்ச விரிவாக்கத்திற்கான சாத்தியத்துடன்.",
      "இந்த திட்டம் காற்றின் தரம் கண்காணிப்பு மற்றும் சுய இயக்க வாகனங்கள் போன்ற துறைகளில் பொருந்தக்கூடியது, மேலும் சத்தமுள்ள, ஒற்றுமையற்ற மாதிரிகள் கொண்ட தரவுகளில் அடைவுகளை கணக்கிடுவதற்கு பயனுள்ளதாக உள்ளது."
    ],
    "points": 137,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1729109866
  }
]
