[
  {
    "id": 37361947,
    "title": "सबसे खराब प्रोग्रामर मुझे पता है",
    "originLink": "https://dannorth.net/2023/09/02/the-worst-programmer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361947",
    "commentBody": "",
    "originSummary": [
      "डैन नॉर्थ का ब्लॉग पोस्ट डेवलपर उत्पादकता का आकलन करने के जटिल मुद्दे से निपटता है और व्यक्तिगत कार्य पूरा करने से संचयी व्यावसायिक प्रभाव तक एक महत्वपूर्ण परिप्रेक्ष्य बदलाव को रेखांकित करता है।",
      "पोस्ट में टिम मैकिनन की कहानी साझा की गई है, जो एक प्रोग्रामर है, जिसने एकान्त कार्यों के बजाय समूह समस्या-समाधान पर ध्यान केंद्रित करने के कारण पारंपरिक उत्पादकता मैट्रिक्स पर लगातार कम प्रदर्शन किया।",
      "टिम को निष्कासित करने के प्रबंधकीय दबाव के बावजूद, नॉर्थ ने पूरी टीम की प्रभावशीलता और उत्पादकता को बढ़ाने में अपनी महत्वपूर्ण भूमिका का बचाव किया, इस बात पर जोर दिया कि उत्पादकता को जटिल प्रणालियों में मूर्त व्यावसायिक प्रभाव से मापा जाना चाहिए।"
    ],
    "commentSummary": [
      "पोस्ट सॉफ्टवेयर विकास उद्योग में महत्वपूर्ण विषयों की पड़ताल करता है, जैसे ज्ञान साझा करना, आलोचना और कार्यालय की राजनीति का प्रबंधन करना, और यह समझना कि धारणा कैरियर की प्रगति को कैसे प्रभावित कर सकती है।",
      "यह उद्योग में विशिष्ट भूमिकाओं और पद्धतियों के बारे में बात करता है, जिसमें परियोजना प्रबंधन के लिए स्क्रम और जूनियर / वरिष्ठ इंजीनियरों, तकनीकी लीड, उत्पाद मालिकों और उत्पाद प्रबंधकों की भूमिकाएं शामिल हैं।",
      "लेख प्रभावी संचार और सहयोग के महत्व पर भी प्रकाश डालता है, और एक सहायक कार्य वातावरण की खेती करता है। यह कंपनी की राजनीति, संघीकरण पेशेवरों और विपक्षों की पेचीदगियों और कोड योगदान की चुनौतियों पर चर्चा करता है।"
    ],
    "points": 1237,
    "commentCount": 522,
    "retryCount": 0,
    "time": 1693665705
  },
  {
    "id": 37363616,
    "title": "टैक्स तैयारी कंपनियां: मुफ्त कर-फाइलिंग के खिलाफ $ 90 मिलियन लॉबिंग",
    "originLink": "https://www.opensecrets.org/news/2023/09/tax-prep-companies-lobbying-against-free-file-face-scrutiny-from-lawmakers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363616",
    "commentBody": "",
    "originSummary": [
      "टर्बोटैक्स के मालिक इंटुइट और एचएंडआर ब्लॉक जैसी प्रमुख कर तैयारी कंपनियां एक स्वतंत्र, सरकार द्वारा संचालित कर फाइलिंग प्रणाली के खिलाफ लॉबिंग के लिए जांच के दायरे में हैं।",
      "इन कंपनियों ने आईआरएस को अपना टैक्स प्रेप सॉफ्टवेयर विकसित करने से रोकने के लिए 2003 के बाद से लॉबिंग पर सामूहिक रूप से $ 90 मिलियन से अधिक खर्च किए हैं।",
      "दिसंबर 2019 तक, फ्री फाइल एलायंस के समझौता ज्ञापन के एक परिशिष्ट ने उस बाधा को हटा दिया, जिससे आईआरएस को 2024 में मुफ्त कर फाइलिंग सेवा के लिए योजना निर्धारित करने में सक्षम बनाया गया। कर तैयारी उद्योग के लॉबिंग प्रयासों की जांच कई कांग्रेस डेमोक्रेट्स द्वारा की गई है।"
    ],
    "commentSummary": [
      "अमेरिकी कर तैयारी कंपनियों ने मुक्त कर-फाइलिंग विकल्पों के खिलाफ 90 मिलियन डॉलर की लॉबिंग खर्च की है, जिससे कर प्रणालियों की जटिलता और कर तैयार करने वाली कंपनियों की भूमिका के बारे में बहस छिड़ गई है।",
      "लॉबिंग शक्तियों के प्रभाव के बारे में चर्चा है, विशेष रूप से Intuit जैसी कंपनियों के बारे में, और उद्योग व्यवधान की संभावना, साथ ही साथ सरकार द्वारा संचालित कर फाइलिंग प्रणाली के संभावित फायदे भी।",
      "इसके अलावा कर तैयारी फर्मों के राष्ट्रीयकरण के प्रस्ताव, कर कोड को सरल बनाने के निहितार्थ, और रो बनाम वेड मामले पर सुप्रीम कोर्ट के फैसले की प्रासंगिकता और प्रभाव जैसे विषयों से निपटा गया।"
    ],
    "points": 393,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1693675975
  },
  {
    "id": 37364605,
    "title": "PSA: अपने व्यवसाय को Discord.7yr खाते के आसपास आधारित न करें, ASN पोस्ट करने के लिए प्रतिबंधित खाता",
    "originLink": "https://news.ycombinator.com/item?id=37364605",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364605",
    "commentBody": "",
    "originSummary": [
      "लेखक डिस्कॉर्ड के साथ अपनी प्रतिकूल बातचीत पर जोर देता है, यह खुलासा करते हुए कि उनके 7 साल पुराने खाते को मामूली त्रुटि के लिए अचानक प्रतिबंधित कर दिया गया था।",
      "डिस्कॉर्ड के साथ पिछले मुद्दों में एक कम उम्र के प्रतिभागी के कारण लेखक के सर्वर को हटाने के लिए समस्याग्रस्त खतरे शामिल हैं।",
      "लेखक इन अनुभवों के कारण डिस्कॉर्ड पर एक व्यवसाय की स्थापना पर विचार करते समय विवेक की सलाह देता है।"
    ],
    "commentSummary": [
      "बहस व्यवसाय संचालन के लिए डिस्कॉर्ड का उपयोग करने की कमियों और संभावित खतरों पर प्रकाश डालती है, जिसमें खाता प्रतिबंध, मॉडरेशन नीतियों और अपर्याप्त समर्थन के बारे में चिंताएं हैं।",
      "प्रतिभागियों ने वैकल्पिक प्लेटफार्मों और बैकअप रणनीतियों की आवश्यकता का आग्रह किया, तीसरे पक्ष के प्लेटफार्मों पर निर्भरता से जुड़े जोखिमों पर जोर दिया।",
      "सर्वसम्मत आम सहमति डिस्कॉर्ड पर विशेष निर्भरता द्वारा प्रस्तुत पर्याप्त व्यावसायिक जोखिम है।"
    ],
    "points": 358,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1693682335
  },
  {
    "id": 37361462,
    "title": "टेस्ला, रिवियन ने 'मरम्मत के अधिकार' के लिए समर्थन का फर्जी प्रदर्शन किया",
    "originLink": "https://www.techdirt.com/2023/09/01/tesla-rivian-put-on-fake-show-of-support-for-right-to-repair/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361462",
    "commentBody": "",
    "originSummary": [
      "टेस्ला और रिवियन महत्वपूर्ण नए कानूनों के लिए प्रतिबद्ध किए बिना \"मरम्मत के अधिकार\" आंदोलन की वकालत करने के लिए आलोचना ओं के घेरे में हैं।",
      "वाहनों की मरम्मत को महंगा और असुविधाजनक बनाने के लिए दोनों कंपनियों की आलोचना की गई है।",
      "टेक्स्ट में वाल्व/स्टीम के गुणवत्ता नियंत्रण, पॉडकास्ट एपिसोड, गूगल के प्रोग्राम शटडाउन, पिक्सेल फोन और कानूनी मुद्दों सहित विभिन्न अन्य तकनीकी-संबंधित विषयों का भी उल्लेख किया गया है।"
    ],
    "commentSummary": [
      "चर्चा आंदोलन की मरम्मत के अधिकार और इलेक्ट्रिक वाहनों, विशेष रूप से टेस्ला की मरम्मत की जटिलताओं पर केंद्रित है। किट का उपयोग करके पुरानी कारों को इलेक्ट्रिक में परिवर्तित करने की व्यावहारिकता, गैर-मानक घटकों और सॉफ्टवेयर के माध्यम से मरम्मत को जटिल बनाने वाले निर्माताओं जैसे मुद्दों पर प्रकाश डाला गया है।",
      "चर्चा किए गए अन्य विषयों में इलेक्ट्रिक वाहनों (ईवी) के लिए मरम्मत दस्तावेज और भागों की उपलब्धता, अन्य कारों को कूदने में ईवी की सीमाएं और सौर छतों और स्वैपेबल बैटरी की उपयोगिता शामिल है।",
      "समाधान पर प्रतिभागियों के अलग-अलग विचार हैं; जबकि कुछ मरम्मत कानून के अधिकार की वकालत करते हैं, दूसरों का मानना है कि वास्तुशिल्प आरेखों के बिना घटकों को समझने और ठीक करके कार्य को आसान बनाया जा सकता है।"
    ],
    "points": 256,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1693662114
  },
  {
    "id": 37361094,
    "title": "शिल्प पर",
    "originLink": "https://www.drcathicks.com/post/on-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361094",
    "commentBody": "",
    "originSummary": [
      "लेखक शिल्प कौशल पर अपने दादा के समावेशी, व्यावहारिक दृष्टिकोण के प्रभाव को दर्शाता है, इसे सॉफ्टवेयर इंजीनियरिंग उद्योग में कथित विशिष्टता और अभिजातवर्ग के साथ विपरीत करता है।",
      "लेखक सभी श्रम के कुशल श्रम होने की अवधारणा पर जोर देता है, इस धारणा को आगे बढ़ाता है कि शिल्प को समावेशिता और मूल्य प्रयास को प्राथमिकता देनी चाहिए, एक निर्माता स्थान से बहिष्कृत महसूस करने के एक व्यक्तिगत प्रकरण का हवाला देते हुए।",
      "लेखक शिल्प को निर्णय या हथियार के लिए एक उपकरण के बजाय संचार, सहयोग और निर्माण के लिए एक माध्यम के रूप में देखता है, जो टीम के वातावरण और कार्यक्षेत्र को बढ़ाने में अपने दादा के परिप्रेक्ष्य की आवश्यकता का सुझाव देता है।"
    ],
    "commentSummary": [
      "पोस्ट सॉफ्टवेयर इंजीनियरिंग उद्योग में 'बाहरी' होने की भावना पर जोर देता है, ऐसे 'बाहरी' कोडर्स से अप्रत्याशित सफलता की कहानियों को शामिल करने और जश्न मनाने की आवश्यकता को रेखांकित करता है।",
      "यह 'फिक्सिंग' की धारणा को आगे लाता है और शिल्प कौशल के महत्व को रेखांकित करता है और किसी के काम पर गर्व करता है।",
      "लेख उद्योग में शिल्प, गुणवत्ता और कंप्यूटर उपयोग के बीच संबंधों में उतरता है, सॉफ्टवेयर गुणवत्ता पर शिल्प कौशल के प्रभाव का सुझाव देता है।"
    ],
    "points": 233,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1693659311
  },
  {
    "id": 37363362,
    "title": "पुनरावर्ती सारांश एलएलएम में दीर्घकालिक संवाद स्मृति को सक्षम बनाता है।",
    "originLink": "https://arxiv.org/abs/2308.15022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363362",
    "commentBody": "",
    "originSummary": [
      "पेपर बड़े भाषा मॉडल (एलएलएम) का उपयोग करके सारांश या मेमोरी के पुनरावर्ती निर्माण के माध्यम से ओपन-डोमेन संवाद प्रणालियों में दीर्घकालिक स्मृति को बढ़ाने की रणनीति का सुझाव देता है।",
      "यह विधि एलएलएम को छोटे संवाद संदर्भों को बनाए रखने और याद करने के लिए प्रोत्साहित करती है और बाद में पिछली मेमोरी और बाद के संदर्भों का उपयोग करके नई मेमोरी बनाती है।",
      "प्रयोग विधि द्वारा उत्पन्न लंबे समय तक संदर्भ वार्तालापों में अधिक सुसंगत प्रतिक्रियाओं का प्रदर्शन करते हैं। लेखक ों ने बाद की तारीख में कोड और स्क्रिप्ट जारी करने की योजना बनाई है।"
    ],
    "commentSummary": [
      "बहस भाषा मॉडल की बाधाओं और संभावनाओं पर केंद्रित है, मुख्य रूप से तर्क और गणितीय कार्यों में उनकी क्षमता।",
      "प्रवचन में एआई मॉडल की क्षमताएं शामिल हैं, जो प्रदर्शन में सुधार के लिए विशिष्ट उपकरणों या प्रणालियों की आवश्यकता पर सवाल उठाती हैं।",
      "वैकल्पिक रणनीतियों और प्रचलित कार्यान्वयन के साथ-साथ संवादी एआई प्रणालियों में दीर्घकालिक स्मृति की भूमिका और पुनरावर्ती समराइजेशन विधियों की दक्षता भी लाई गई है।"
    ],
    "points": 219,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1693674526
  },
  {
    "id": 37364290,
    "title": "मैंने PyPI से GitHub तक सभी कोड को प्रतिबिंबित किया और इसका विश्लेषण किया।",
    "originLink": "https://py-code.org/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364290",
    "commentBody": "",
    "originSummary": [
      "लेखक ने PyPI से Github तक सभी कोड को मिरर करने के लिए एक स्वचालित प्रणाली विकसित की है, जो वास्तविक समय पैकेज स्कैनिंग, खोज-अनुक्रमण और व्यापक भाषा विश्लेषण की सुविधा प्रदान करती है।",
      "यह पहल किसी को भी एक संक्षिप्त अवधि के भीतर PyPI पर प्रकाशित सभी कोड डाउनलोड और मूल्यांकन करने की अनुमति देती है।",
      "नवाचार उपयोगकर्ताओं को विभिन्न नए अनुप्रयोगों के लिए पायथन कोड कॉर्पस का लाभ उठाने में सक्षम बनाता है।"
    ],
    "commentSummary": [
      "लेखक ने PyPI से कोड की जांच की, Python सॉफ़्टवेयर पैकेजों के लिए एक भंडार, GitHub पर प्रतिबिंबित हुआ, 8 वर्षों के भीतर मनुष्यों की तुलना में अधिक पैकेजों की भविष्यवाणी करने वाले तेजी से विकास पर प्रकाश डाला गया।",
      "जांच ने पायथन उपयोग, कोड में एम्बेडेड क्रेडेंशियल्स और डेटा विश्लेषण की जटिलता, आर्काइविंग कोड और भाषा सुविधाओं की लोकप्रियता जैसे विभिन्न अन्य पहलुओं में अंतर्दृष्टि प्रदान की।",
      "लेखक ने PyPI के साथ चुनौतियों पर भी चर्चा की, जैसे खाता निर्माण पर निराशा, पैकेज की खोज, और लाइसेंस िंग के आसपास के मुद्दे, विशेष रूप से लाइसेंस के बिना माइक्रोसॉफ्ट का उपयोग।"
    ],
    "points": 202,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1693680307
  },
  {
    "id": 37360251,
    "title": "एक जीपीटी -4 क्षमता पूर्वानुमान चुनौती",
    "originLink": "https://nicholas.carlini.com/writing/llm-forecast/question/Capital-of-Paris",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37360251",
    "commentBody": "",
    "originSummary": [
      "पोस्ट का हाइलाइट किया गया टोन एक गेम के चारों ओर घूमता है जिसका उद्देश्य फ्रांस की राजधानी से संबंधित एक प्रश्न का उत्तर देने में एक उन्नत भाषा मॉडल जीपीटी -4 के प्रदर्शन को मापना है।",
      "लेखक का दावा है कि व्यक्ति अक्सर अपनी वास्तविक क्षमता की उचित समझ के बिना भाषा मॉडल की क्षमताओं के बारे में अनुमान लगाते हैं।",
      "पाठकों को अपनी भविष्यवाणी क्षमताओं को सत्यापित करने के लिए प्रोत्साहित किया जाता है, जो भाषा मॉडल के बारे में प्रचलित मान्यताओं को मान्य करने और सुधारने के लिए एक चुनौती को दर्शाता है।"
    ],
    "commentSummary": [
      "लेख का मुख्य फोकस प्रश्नों का सटीक उत्तर देने के मामले में एक भाषा मॉडल जीपीटी -4 की क्षमताओं का आकलन और पूर्वानुमान करने के आसपास है।",
      "प्रतिभागी जीपीटी -4 जैसे भाषा मॉडल का आकलन करने के लिए उपयोग किए जाने वाले स्कोरिंग ढांचे की आलोचना करते हैं, इसकी सीमाओं पर चर्चा करते हैं, और वैकल्पिक मूल्यांकन विधियों का प्रस्ताव करते हैं।",
      "प्रतिभागी जीपीटी -4 और चैटजीपीटी जैसे मॉडलों में बुद्धि की प्रकृति में भी उतरते हैं, सांख्यिकीय प्रसंस्करण की भूमिका पर जोर देते हैं, और विशिष्ट उदाहरणों के साथ अपने अनुभवों को प्रतिबिंबित करते हैं।"
    ],
    "points": 188,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1693651226
  },
  {
    "id": 37366341,
    "title": "Emacs में \"blimpy\" कैसे टाइप करें [वीडियो]",
    "originLink": "https://www.youtube.com/watch?v=2VOnKMJqIL0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37366341",
    "commentBody": "",
    "originSummary": [
      "लेखक एक लोकप्रिय अनुकूलन योग्य पाठ संपादक एमैक में कुशलतापूर्वक \"ब्लिंपी\" शब्द टाइप करने के लिए कई तकनीकों को साझा करता है।",
      "चर्चा की गई विधियों में कोड ब्लॉक की प्रतिलिपि बनाना और चिपकाना, कॉन्फ़िगरेशन युक्तियों का उपयोग करना और विशेष मोड और कमांड को नियोजित करना शामिल है।",
      "पोस्ट का उद्देश्य ईमैक्स में दोहराए जाने वाले शब्दों के लिए तेज और कुशल इनपुट विधियों में पाठकों का मार्गदर्शन करना है।"
    ],
    "commentSummary": [
      "वीडियो ट्यूटोरियल Emacs में \"ब्लिंपी\" टाइप करने के सरल कार्य पर केंद्रित है, जो पाठ संपादक के लचीलेपन और अनुकूलन की क्षमता का प्रदर्शन करता है।",
      "उपयोगकर्ता इस बात पर विभाजित हैं कि वीडियो ने लोकप्रियता क्यों प्राप्त की, चाहे वह संबंध बनाने और सामुदायिक चुटकुले बनाने के लिए एक लाभ है या प्रौद्योगिकी की पेचीदगियों पर आलोचना है।",
      "ट्यूटोरियल Emacs और इसके उपयोगकर्ता समुदाय लक्षणों के लिए एक मजेदार परिचय के रूप में कार्य करता है।"
    ],
    "points": 186,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1693697138
  },
  {
    "id": 37363674,
    "title": "तूफान के बाद बर्निंग मैन के अंदर या बाहर निकलने का कोई रास्ता नहीं",
    "originLink": "https://www.sfgate.com/travel/article/no-access-after-burning-man-rain-storm-18344393.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363674",
    "commentBody": "",
    "originSummary": [
      "भारी बारिश के कारण बर्निंग मैन फेस्टिवल के 70,000 से अधिक आगंतुक मौके पर फंसे हुए हैं, जिससे क्षेत्र मिट्टी के गड्ढे में बदल गया है, गेट और हवाई अड्डे को बंद कर दिया गया है, जिससे आने-जाने में रुकावट आ रही है।",
      "उपस्थित लोगों को संसाधनों को संरक्षित करने की सलाह दी जाती है क्योंकि बारिश रविवार तक जारी रहने की उम्मीद है।",
      "अस्थिर मौसम की स्थिति एक संभावित आपदा पेश करती है जिसमें निरंतर बारिश और आंधी की संभावना है।"
    ],
    "commentSummary": [
      "नेवादा में बर्निंग मैन फेस्टिवल भारी बारिश के कारण जटिलताओं से जूझ रहा है, जिससे कीचड़ की स्थिति पैदा हो रही है और परिवहन में समस्याएं आ रही हैं। हालांकि, पर्याप्त आपूर्ति भुखमरी या निर्जलीकरण का कोई खतरा सुनिश्चित नहीं कर रही है।",
      "चिकित्सा आपात स्थिति के बारे में चिंताएं मौजूद हैं, लेकिन जरूरत पड़ने पर हेलीकॉप्टर निकासी के प्रावधान हैं। दुर्घटनाओं और चोटों को रोकने के लिए सुरक्षा उपायों का पालन करने और आश्रय में रहने का आग्रह किया जाता है।",
      "स्थिति को बढ़ा-चढ़ाकर पेश किया जा सकता था, जिससे अनावश्यक भय पैदा हो सकता था। इस आयोजन की लोकप्रियता, आपूर्ति की उपलब्धता और आत्मनिर्भरता के लोकाचार पर अलग-अलग विचार हैं।"
    ],
    "points": 171,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693676288
  }
]
