[
  {
    "id": 37361947,
    "title": "내가 아는 최악의 프로그래머",
    "originLink": "https://dannorth.net/2023/09/02/the-worst-programmer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361947",
    "commentBody": "",
    "originSummary": [
      "Dan North의 블로그 게시물은 개발자 생산성을 측정하는 복잡한 문제를 다루며 개별 작업 완료에서 누적된 비즈니스 영향에 대한 관점의 전환이 중요하다는 점을 강조합니다.",
      "이 게시물에서는 혼자 하는 작업보다는 그룹 문제 해결에 집중하여 기존의 생산성 지표에서 지속적으로 저조한 성과를 보인 프로그래머 Tim Mackinnon의 이야기를 공유합니다.",
      "노스는 팀을 퇴출시키려는 경영진의 압력에도 불구하고 팀 전체의 효율성과 생산성을 높이는 데 있어 자신의 중추적인 역할을 옹호하며, 생산성은 복잡한 시스템에서 가시적인 비즈니스 영향력으로 측정되어야 한다고 강조했습니다."
    ],
    "commentSummary": [
      "이 게시물에서는 지식 공유, 비판 및 사내 정치 관리, 인식이 경력 발전에 미치는 영향에 대한 이해 등 소프트웨어 개발 업계에서 중요한 주제를 살펴봅니다.",
      "프로젝트 관리를 위한 스크럼, 주니어/시니어 엔지니어, 기술 리드, 제품 소유자 및 제품 관리자의 역할 등 업계에서의 구체적인 역할과 방법론에 대해 설명합니다.",
      "또한 효과적인 커뮤니케이션과 협업의 중요성을 강조하고 서로를 지지하는 업무 환경을 조성합니다. 또한 회사 정치의 복잡성, 노조 설립의 장단점, 코드 기여의 어려움에 대해서도 설명합니다."
    ],
    "points": 1237,
    "commentCount": 522,
    "retryCount": 0,
    "time": 1693665705
  },
  {
    "id": 37363616,
    "title": "세무 준비 회사: 무료 세금 신고에 반대하는 9천만 달러 규모의 로비 활동",
    "originLink": "https://www.opensecrets.org/news/2023/09/tax-prep-companies-lobbying-against-free-file-face-scrutiny-from-lawmakers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363616",
    "commentBody": "",
    "originSummary": [
      "터보택스(TurboTax)의 소유주인 Intuit, H&R Block과 같은 주요 세무 준비 회사들이 정부가 운영하는 무료 세금 신고 시스템에 반대하는 로비 활동을 벌인 혐의로 조사를 받고 있습니다.",
      "이 회사들은 2003년부터 IRS가 자체 세금 준비 소프트웨어를 개발하는 것을 막기 위해 총 9천만 달러 이상을 로비 활동에 지출했습니다.",
      "2019년 12월, 무료 보고 연합의 양해각서 부록이 이러한 장애물을 제거하여 IRS가 2024년에 무료 세금 보고 서비스를 제공할 계획을 수립할 수 있게 되었습니다. 몇몇 하원 민주당 의원들은 세무 대리 업계의 로비 활동에 대한 조사를 요청했습니다."
    ],
    "commentSummary": [
      "미국 세무 준비 회사들이 무료 세금 신고 옵션에 반대하는 로비에 9천만 달러를 지출하면서 세금 제도의 복잡성과 세무 준비 회사의 역할에 대한 논쟁이 촉발되었습니다.",
      "특히 인튜이트와 같은 기업의 로비 세력의 영향력과 업계 혼란의 가능성, 그리고 정부가 운영하는 세금 신고 시스템의 잠재적 이점에 대한 논의가 이루어지고 있습니다.",
      "또한 세무 준비 회사의 국유화 제안, 세법 간소화의 의미, 로 대 웨이드 사건에 대한 대법원 판결의 관련성과 영향과 같은 주제도 다룹니다."
    ],
    "points": 393,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1693675975
  },
  {
    "id": 37364605,
    "title": "참고: Discord를 기반으로 비즈니스를 운영하지 마세요.7년 계정은 ASN 게시가 금지됩니다.",
    "originLink": "https://news.ycombinator.com/item?id=37364605",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364605",
    "commentBody": "",
    "originSummary": [
      "글쓴이는 7년 된 계정이 사소한 오류로 인해 갑자기 금지되었다고 밝히며 Discord와의 좋지 않은 상호 작용을 강조합니다.",
      "이전에 미성년자 참여자 때문에 작성자의 서버를 삭제하겠다는 협박을 받은 적이 있는 Discord의 문제가 있었습니다.",
      "저자는 이러한 경험으로 인해 Discord에서 비즈니스 설립을 고려할 때 신중을 기할 것을 조언합니다."
    ],
    "commentSummary": [
      "이 토론에서는 계정 차단, 중재 정책, 불충분한 지원 등에 대한 우려와 함께 Discord를 비즈니스 운영에 활용할 때의 단점과 잠재적 위험성을 강조합니다.",
      "참가자들은 타사 플랫폼에 대한 의존과 관련된 위험을 강조하면서 대체 플랫폼과 백업 전략의 필요성을 촉구합니다.",
      "만장일치로 일치된 의견은 디스코드에 대한 독점적 의존으로 인한 비즈니스 리스크가 크다는 것입니다."
    ],
    "points": 358,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1693682335
  },
  {
    "id": 37361462,
    "title": "테슬라, 리비안, '수리할 권리'를 지지하는 가짜 쇼를 펼치다",
    "originLink": "https://www.techdirt.com/2023/09/01/tesla-rivian-put-on-fake-show-of-support-for-right-to-repair/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361462",
    "commentBody": "",
    "originSummary": [
      "테슬라와 리비안은 중요한 새로운 법률을 제정하지 않고 '수리할 권리' 운동을 옹호하는 것처럼 보인다는 이유로 비난을 받고 있습니다.",
      "두 회사 모두 차량 수리에 많은 비용이 들고 불편하다는 비판을 받아왔습니다.",
      "이 글에는 Valve/Steam의 품질 관리, 팟캐스트 에피소드, Google의 프로그램 종료, 픽셀폰, 법적 문제 등 다양한 기술 관련 주제에 대한 언급도 포함되어 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 이동 수리에 대한 권리와 전기 자동차, 특히 Tesla 수리의 복잡성에 대해 집중적으로 논의합니다. 키트를 사용하여 구형 자동차를 전기자동차로 개조하는 것의 실용성, 비표준 부품과 소프트웨어로 수리를 복잡하게 만드는 제조업체 등의 문제가 중점적으로 다뤄집니다.",
      "이 밖에도 전기 자동차(EV) 수리 문서 및 부품의 가용성, 다른 자동차의 시동을 걸 때 전기 자동차의 한계, 태양열 지붕과 교체 가능한 배터리의 유용성 등이 논의되었습니다.",
      "일부 참가자는 수리권 법제화를 주장하는 반면, 다른 참가자는 아키텍처 다이어그램 없이 구성 요소를 이해하고 수정함으로써 작업을 더 쉽게 수행할 수 있다고 생각합니다."
    ],
    "points": 256,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1693662114
  },
  {
    "id": 37361094,
    "title": "온 크래프트",
    "originLink": "https://www.drcathicks.com/post/on-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361094",
    "commentBody": "",
    "originSummary": [
      "저자는 장인 정신에 대한 할아버지의 포용적이고 실용적인 관점의 영향을 소프트웨어 엔지니어링 업계에서 인식되는 배타성과 엘리트주의와 대조하면서 반성합니다.",
      "저자는 모든 노동은 숙련된 노동이라는 개념을 주장하며, 메이커스페이스에서 배척당했던 개인적인 에피소드를 예로 들며 공예가 포용성을 우선시하고 노력을 중요시해야 한다고 강조합니다.",
      "저자는 공예를 판단의 도구나 무기가 아닌 소통, 협력, 창조의 매개체로 바라보며 팀 환경과 업무 공간을 개선하는 데 할아버지의 관점이 필요하다고 제안합니다."
    ],
    "commentSummary": [
      "이 게시물은 소프트웨어 엔지니어링 업계에서 '아웃사이더'라는 느낌을 강조하며 포용의 필요성을 강조하고 이러한 '아웃사이더' 코더들의 예상치 못한 성공 사례를 축하합니다.",
      "'수정'이라는 개념을 제시하고 장인 정신과 자신의 작업에 대한 자부심의 중요성을 강조합니다.",
      "이 기사는 업계에서 장인 정신이 소프트웨어 품질에 미치는 영향을 제시하면서 장인 정신, 품질 및 컴퓨터 사용 간의 관계를 자세히 설명합니다."
    ],
    "points": 233,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1693659311
  },
  {
    "id": 37363362,
    "title": "재귀적으로 요약하면 LLM에서 장기 대화 메모리를 사용할 수 있습니다.",
    "originLink": "https://arxiv.org/abs/2308.15022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363362",
    "commentBody": "",
    "originSummary": [
      "이 논문은 대규모 언어 모델(LLM)을 사용하여 요약 또는 메모리를 재귀적으로 생성함으로써 개방형 도메인 대화 시스템에서 장기 기억을 향상시키는 전략을 제안합니다.",
      "이 방법은 LLM이 더 작은 대화 컨텍스트를 유지 및 리콜하고 이전 메모리와 후속 컨텍스트를 활용하여 새로운 메모리를 생성하도록 장려합니다.",
      "실험 결과, 이 방법으로 생성된 긴 문맥의 대화에서 보다 일관된 응답을 확인할 수 있었습니다. 작성자는 추후 코드와 스크립트를 공개할 계획입니다."
    ],
    "commentSummary": [
      "이 토론은 언어 모델의 제약과 가능성, 주로 추론과 수학적 과제에 대한 능력에 초점을 맞추고 있습니다.",
      "담론에는 성능 향상을 위한 특정 도구나 시스템의 필요성에 대한 의문을 제기하는 AI 모델의 기능이 포함됩니다.",
      "대화형 AI 시스템에서 장기 기억의 역할과 재귀적 요약 방법의 효율성에 대한 논의와 함께 대체 전략 및 널리 사용되는 구현 방법도 제기되었습니다."
    ],
    "points": 219,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1693674526
  },
  {
    "id": 37364290,
    "title": "PyPI의 모든 코드를 GitHub에 미러링하고 분석했습니다.",
    "originLink": "https://py-code.org/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364290",
    "commentBody": "",
    "originSummary": [
      "저자는 PyPI의 모든 코드를 Github에 미러링하는 자동화된 시스템을 개발하여 실시간 패키지 스캔, 검색 색인화 및 포괄적인 언어 분석을 용이하게 했습니다.",
      "이 이니셔티브를 통해 누구나 짧은 기간 내에 PyPI에 게시된 모든 코드를 다운로드하고 평가할 수 있습니다.",
      "이 혁신을 통해 사용자들은 다양한 새로운 애플리케이션에 파이썬 코드 말뭉치를 활용할 수 있을 것으로 기대합니다."
    ],
    "commentSummary": [
      "저자는 GitHub에 미러링된 Python 소프트웨어 패키지 저장소인 PyPI의 코드를 조사한 결과, 8년 내에 사람보다 더 많은 패키지가 생성될 것으로 예상되는 빠른 성장세에 주목했습니다.",
      "이 조사를 통해 Python 사용, 코드에 포함된 자격 증명, 데이터 분석의 복잡성, 코드 보관, 언어 기능의 인기도 등 다양한 측면에 대한 인사이트를 얻을 수 있었습니다.",
      "또한 계정 생성, 패키지 검색, 라이선스 관련 문제, 특히 Microsoft의 라이선스 없는 사용에 대한 불만과 같은 PyPI의 문제점에 대해서도 논의했습니다."
    ],
    "points": 202,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1693680307
  },
  {
    "id": 37360251,
    "title": "GPT-4 성능 예측 도전 과제",
    "originLink": "https://nicholas.carlini.com/writing/llm-forecast/question/Capital-of-Paris",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37360251",
    "commentBody": "",
    "originSummary": [
      "이 게시물은 프랑스의 수도와 관련된 질문에 답할 때 고급 언어 모델인 GPT-4의 성능을 측정하기 위한 게임을 중심으로 전개됩니다.",
      "저자는 개인이 언어 모델의 진정한 잠재력을 제대로 이해하지 못한 채 그 기능에 대해 추측하는 경우가 많다고 주장합니다.",
      "독자는 자신의 예측 능력을 스스로 검증하도록 권장되며, 이는 언어 모델에 대한 일반적인 가정을 검증하고 개선하기 위한 도전을 의미합니다."
    ],
    "commentSummary": [
      "이 글의 주요 초점은 질문에 정확하게 답하는 언어 모델인 GPT-4의 기능을 평가하고 예측하는 데 있습니다.",
      "참가자들은 GPT-4와 같은 언어 모델을 평가하는 데 사용되는 채점 프레임워크를 비판하고, 그 한계에 대해 토론하며, 대체 평가 방법을 제안합니다.",
      "또한 참가자들은 통계 처리의 역할에 중점을 두고 GPT-4 및 ChatGPT와 같은 모델에서 지능의 본질을 탐구하고 구체적인 사례를 통해 자신의 경험을 되돌아봅니다."
    ],
    "points": 188,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1693651226
  },
  {
    "id": 37366341,
    "title": "Emac에서 \"blimpy\"를 입력하는 방법 [동영상]",
    "originLink": "https://www.youtube.com/watch?v=2VOnKMJqIL0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37366341",
    "commentBody": "",
    "originSummary": [
      "저자는 사용자 정의가 가능한 인기 텍스트 편집기인 Emacs에서 \"Blimpy\"라는 단어를 효율적으로 입력하는 다양한 기술을 공유합니다.",
      "코드 블록 복사 및 붙여넣기, 구성 팁 사용, 특수 모드 및 명령어 사용 등의 방법이 논의됩니다.",
      "이 글의 목적은 독자들에게 Emacs에서 반복되는 단어를 빠르고 효율적으로 입력하는 방법을 안내하는 것입니다."
    ],
    "commentSummary": [
      "이 비디오 튜토리얼은 Emacs에서 \"blimpy\"를 입력하는 간단한 작업에 중점을 두어 텍스트 편집기의 유연성과 사용자 지정의 잠재력을 보여 줍니다.",
      "이 동영상이 인기를 얻은 이유에 대해 사용자들은 커뮤니티의 유대감을 형성하고 농담을 주고받기 위한 수단인지, 아니면 기술의 복잡성에 대한 비판인지에 대해 의견이 분분합니다.",
      "이 튜토리얼은 Emac과 사용자 커뮤니티 특성을 재미있게 소개하는 역할을 합니다."
    ],
    "points": 186,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1693697138
  },
  {
    "id": 37363674,
    "title": "폭풍 후 버닝맨에 출입할 수 없는 상황",
    "originLink": "https://www.sfgate.com/travel/article/no-access-after-burning-man-rain-storm-18344393.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363674",
    "commentBody": "",
    "originSummary": [
      "폭우로 인해 지역이 진흙 구덩이로 변하고 게이트와 공항이 폐쇄되어 출입이 중단되면서 버닝맨 페스티벌을 찾은 7만 명 이상의 방문객이 현장에 발이 묶였습니다.",
      "일요일까지 비가 지속될 것으로 예상되므로 참석자들은 자원을 절약하는 것이 좋습니다.",
      "불안정한 기상 조건으로 인해 비와 뇌우가 계속될 가능성이 높으며 잠재적인 재해가 발생할 수 있습니다."
    ],
    "commentSummary": [
      "네바다에서 열리는 버닝맨 페스티벌은 폭우로 인한 진흙탕 상황과 교통 문제로 인해 어려움을 겪고 있습니다. 하지만 충분한 물자가 공급되고 있어 굶주림이나 탈수의 위험은 없습니다.",
      "응급 상황에 대한 우려가 있지만, 필요한 경우 헬리콥터로 대피할 수 있는 규정이 마련되어 있습니다. 사고와 부상을 예방하기 위해 안전 수칙을 준수하고 대피소에 머무르실 것을 당부드립니다.",
      "상황이 과장되어 불필요한 공포로 이어질 수 있습니다. 이벤트의 인기, 보급품의 가용성, 자립 정신에 대한 다양한 견해가 있습니다."
    ],
    "points": 171,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693676288
  }
]
