[
  {
    "id": 37361947,
    "title": "Pahin tuntemani ohjelmoija",
    "originLink": "https://dannorth.net/2023/09/02/the-worst-programmer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361947",
    "commentBody": "",
    "originSummary": [
      "Dan Northin blogikirjoituksessa käsitellään monimutkaista kysymystä kehittäjien tuottavuuden mittaamisesta ja korostetaan ratkaisevaa näkökulman siirtymistä yksittäisten tehtävien suorittamisesta kumulatiiviseen liiketoimintavaikutukseen.",
      "Kirjoituksessa kerrotaan Tim Mackinnonin tarina, ohjelmoijan, joka alitti jatkuvasti perinteiset tuottavuusmittarit, koska hän keskittyi ongelmanratkaisuun ryhmässä yksinäisten tehtävien sijaan.",
      "Huolimatta johdon painostuksesta erottaa Tim, North puolusti hänen keskeistä rooliaan koko tiimin tehokkuuden ja tuottavuuden parantamisessa ja korosti, että tuottavuutta olisi mitattava konkreettisilla liiketoimintavaikutuksilla monimutkaisissa järjestelmissä."
    ],
    "commentSummary": [
      "Postauksessa käsitellään ohjelmistokehitysalalla tärkeitä aiheita, kuten tiedon jakamista, kritiikin ja toimistopolitiikan hallintaa sekä sen ymmärtämistä, miten käsitys voi vaikuttaa urakehitykseen.",
      "Siinä kerrotaan alan erityisrooleista ja -menetelmistä, kuten Scrumista projektinhallinnassa sekä nuorempien ja vanhempien insinöörien, teknisten johtajien, tuoteomistajien ja tuotepäälliköiden rooleista.",
      "Artikkelissa korostetaan myös tehokkaan viestinnän ja yhteistyön merkitystä sekä kannustavaa työympäristöä. Siinä käsitellään yrityksen politiikan kiemuroita, ammattiyhdistystoiminnan etuja ja haittoja sekä koodin tuottamiseen liittyviä haasteita."
    ],
    "points": 1237,
    "commentCount": 522,
    "retryCount": 0,
    "time": 1693665705
  },
  {
    "id": 37363616,
    "title": "Tax prep -yritykset: 90 miljoonaa dollaria lobbausta ilmaista veroilmoitusta vastaan",
    "originLink": "https://www.opensecrets.org/news/2023/09/tax-prep-companies-lobbying-against-free-file-face-scrutiny-from-lawmakers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363616",
    "commentBody": "",
    "originSummary": [
      "Johtavat verovalmisteluyritykset, kuten Intuit, joka omistaa TurboTaxin, ja H&R Block, ovat joutuneet tarkastelun kohteeksi, koska ne lobbaavat ilmaista, hallituksen hallinnoimaa veroilmoitusjärjestelmää vastaan.",
      "Nämä yritykset ovat käyttäneet vuodesta 2003 lähtien yhteensä yli 90 miljoonaa dollaria lobbaukseen estääkseen IRS:ää kehittämästä omaa verovalmisteluohjelmistoaan.",
      "Joulukuussa 2019 Free File Alliancen yhteisymmärryspöytäkirjaan tehty lisäys poisti tämän esteen, minkä ansiosta IRS voi laatia suunnitelmia ilmaista veroilmoituspalvelua varten vuonna 2024. Useat kongressin demokraatit ovat vaatineet tutkimuksia veroilmoitusalan lobbausponnisteluista."
    ],
    "commentSummary": [
      "Yhdysvaltalaiset verovalmisteluyritykset ovat käyttäneet 90 miljoonaa dollaria lobbaamiseen ilmaisia veroilmoitusvaihtoehtoja vastaan, mikä on herättänyt keskustelua verojärjestelmien monimutkaisuudesta ja verovalmisteluyritysten roolista.",
      "Keskustelua käydään lobbausvaltaa käyttävien, erityisesti Intuitin kaltaisten yritysten vaikutusvallasta ja mahdollisuudesta aiheuttaa häiriöitä alalla sekä valtion hallinnoiman veroilmoitusjärjestelmän mahdollisista eduista.",
      "Lisäksi käsitellään muun muassa ehdotusta verovalmisteluyritysten kansallistamisesta, verolainsäädännön yksinkertaistamisen vaikutuksia sekä Roe v. Wade -tapausta koskevan korkeimman oikeuden päätöksen merkitystä ja vaikutusta."
    ],
    "points": 393,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1693675975
  },
  {
    "id": 37364605,
    "title": "PSA: Älä perusta liiketoimintaasi Discordin ympärille.7yr account banned for posting ASNs",
    "originLink": "https://news.ycombinator.com/item?id=37364605",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364605",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja korostaa epäsuotuisaa vuorovaikutustaan Discordin kanssa ja paljastaa, että heidän 7 vuotta vanha tilinsä bannattiin äkillisesti pienen virheen vuoksi.",
      "Aiempiin Discordiin liittyviin ongelmiin kuuluu ongelmallisia uhkauksia poistaa tekijän palvelin alaikäisen osallistujan takia.",
      "Kirjoittaja kehottaa varovaisuuteen harkitessaan yrityksen perustamista Discordiin näiden kokemusten vuoksi."
    ],
    "commentSummary": [
      "Keskustelussa korostuvat Discordin hyödyntämisen haitat ja mahdolliset vaarat liiketoiminnassa, kuten tilikiellot, moderointikäytännöt ja riittämätön tuki.",
      "Osallistujat korostavat vaihtoehtoisten alustojen ja varmuuskopiointistrategioiden tarvetta ja korostavat riskejä, jotka liittyvät riippuvuuteen kolmansien osapuolten alustoista.",
      "Yksimielisyys vallitsee siitä, että yksinomainen riippuvuus Discordista aiheuttaa merkittävän liiketoimintariskin."
    ],
    "points": 358,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1693682335
  },
  {
    "id": 37361462,
    "title": "Tesla, Rivian esittävät väärennetyn tuen osoituksen \"korjaamisoikeudelle\".",
    "originLink": "https://www.techdirt.com/2023/09/01/tesla-rivian-put-on-fake-show-of-support-for-right-to-repair/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361462",
    "commentBody": "",
    "originSummary": [
      "Tesla ja Rivian ovat joutuneet tulituksen kohteeksi, koska ne näennäisesti kannattavat \"oikeus korjata\" -liikettä sitoutumatta merkittäviin uusiin lakeihin.",
      "Molempia yrityksiä on arvosteltu siitä, että ne tekevät ajoneuvojen korjauksista kalliita ja hankalia.",
      "Tekstissä mainitaan myös useita muita tekniikkaan liittyviä aiheita, kuten Valve/Steamin laadunvalvonta, podcast-jaksot, Googlen ohjelmien sulkeminen, pikselipuhelimet ja oikeudelliset kysymykset."
    ],
    "commentSummary": [
      "Keskustelun aiheena on oikeus korjaamiseen -liike ja sähköajoneuvojen, erityisesti Teslan, korjaamisen monimutkaisuus. Keskustelussa tuodaan esiin kysymyksiä, kuten vanhojen autojen muuntaminen sähkökäyttöisiksi sarjojen avulla, sekä se, että valmistajat vaikeuttavat korjauksia epätyypillisten komponenttien ja ohjelmistojen avulla.",
      "Muita keskustelunaiheita ovat muun muassa sähköajoneuvojen korjausasiakirjojen ja osien saatavuus, sähköajoneuvojen rajoitukset muiden autojen käynnistämisessä sekä aurinkokattojen ja vaihdettavien akkujen hyödyllisyys.",
      "Osallistujilla on erilaisia näkemyksiä ratkaisusta; jotkut kannattavat korjausoikeutta koskevaa lainsäädäntöä, kun taas toiset uskovat, että tehtävää voidaan helpottaa ymmärtämällä ja korjaamalla komponentteja ilman arkkitehtuurikaavioita."
    ],
    "points": 256,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1693662114
  },
  {
    "id": 37361094,
    "title": "Käsityö",
    "originLink": "https://www.drcathicks.com/post/on-craft",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37361094",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja pohtii isoisänsä osallistavan ja käytännöllisen käsityötaidon vaikutusta ja asettaa sen vastakkain ohjelmistosuunnittelualan yksinoikeuden ja elitismin kanssa.",
      "Kirjoittaja väittää, että kaikki työ on ammattitaitoista työtä, ja ajaa ajatusta, että käsityön tulisi asettaa etusijalle osallisuus ja arvostaa ponnistelua, ja mainitsee henkilökohtaisen episodin, jossa hän tunsi itsensä syrjäytetyksi makerspace-paikasta.",
      "Kirjoittaja näkee käsityön kommunikaation, yhteistyön ja luomisen välineenä eikä tuomitsemisen välineenä tai aseena, mikä viittaa siihen, että heidän isoisänsä näkökulma on tarpeen tiimiympäristöjen ja työtilojen parantamisessa."
    ],
    "commentSummary": [
      "Postauksessa korostetaan ulkopuolisuuden tunnetta ohjelmistosuunnittelualalla, korostetaan osallisuuden tarvetta ja juhlitaan tällaisten ulkopuolelta tulevien koodareiden odottamattomia menestystarinoita.",
      "Se tuo esiin \"kiinnittämisen\" käsitteen ja korostaa käsityötaidon merkitystä ja ylpeyttä omasta työstä.",
      "Artikkelissa tarkastellaan käsityön, laadun ja tietokoneiden käytön välistä suhdetta teollisuudessa, ja siinä ehdotetaan käsityön vaikutusta ohjelmistojen laatuun."
    ],
    "points": 233,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1693659311
  },
  {
    "id": 37363362,
    "title": "Rekursiivinen tiivistäminen mahdollistaa pitkäaikaisen dialogimuistin LLM:ssä.",
    "originLink": "https://arxiv.org/abs/2308.15022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363362",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa ehdotetaan strategiaa, jolla parannetaan pitkäkestoista muistia avoimen alueen dialogijärjestelmissä luomalla rekursiivisesti yhteenvetoja tai muistia suurten kielimallien (LLM) avulla.",
      "Tämä menetelmä kannustaa LLM:iä säilyttämään ja palauttamaan mieleen pienempiä dialogikonteksteja ja myöhemmin luomaan uutta muistia hyödyntäen aiempaa muistia ja myöhempiä konteksteja.",
      "Kokeet osoittavat, että menetelmän avulla syntyneissä pitkäkestoisissa keskusteluissa vastaukset ovat johdonmukaisempia. Kirjoittajat aikovat julkaista koodin ja skriptit myöhemmin."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään kielimallien rajoituksiin ja mahdollisuuksiin, lähinnä niiden pätevyyteen päättelyssä ja matemaattisissa tehtävissä.",
      "Keskustelussa käsitellään tekoälymallien ominaisuuksia ja kyseenalaistetaan erityisten työkalujen tai järjestelmien tarve suorituskyvyn parantamiseksi.",
      "Myös pitkäkestoisen muistin rooli keskustelevissa tekoälyjärjestelmissä ja rekursiivisten yhteenvetomenetelmien tehokkuus sekä vaihtoehtoiset strategiat ja vallitsevat toteutukset on tuotu esiin."
    ],
    "points": 219,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1693674526
  },
  {
    "id": 37364290,
    "title": "Peilasin kaiken koodin PyPI:stä GitHubiin ja analysoin sen.",
    "originLink": "https://py-code.org/stats",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37364290",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja on kehittänyt automatisoidun järjestelmän, joka peilaa kaiken koodin PyPI:stä Githubiin, mikä helpottaa reaaliaikaista pakettien skannausta, hakuindeksointia ja kattavaa kielianalyysiä.",
      "Tämän aloitteen ansiosta kuka tahansa voi ladata ja arvioida kaikki PyPI:ssä koskaan julkaistut koodit lyhyessä ajassa.",
      "Innovaatio antaa käyttäjille mahdollisuuden hyödyntää Python-koodia erilaisissa uusissa sovelluksissa."
    ],
    "commentSummary": [
      "Kirjoittaja tutki GitHubiin peilatun Python-ohjelmistopakettien arkiston PyPI:n koodia ja havaitsi nopean kasvun, joka ennustaa, että paketteja on enemmän kuin ihmisiä kahdeksan vuoden aikana.",
      "Tutkimuksessa saatiin tietoa Pythonin käytöstä, koodiin upotetuista tunnistetiedoista ja monista muista näkökohdista, kuten data-analyysin monimutkaisuudesta, koodin arkistoinnista ja kielen ominaisuuksien suosiosta.",
      "Kirjoittaja käsitteli myös PyPI:n haasteita, kuten turhautumista tilin luomiseen, pakettien etsimiseen ja lisensointiin liittyviä kysymyksiä, erityisesti Microsoftin käyttöä ilman lisenssiä."
    ],
    "points": 202,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1693680307
  },
  {
    "id": 37360251,
    "title": "GPT-4:n valmiuksien ennustamisen haaste",
    "originLink": "https://nicholas.carlini.com/writing/llm-forecast/question/Capital-of-Paris",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37360251",
    "commentBody": "",
    "originSummary": [
      "Postauksen korostettu sävy pyörii pelin ympärillä, jonka tarkoituksena on mitata GPT-4:n, kehittyneen kielimallin, suorituskykyä Ranskan pääkaupunkia koskevaan kysymykseen vastaamisessa.",
      "Kirjoittaja väittää, että yksilöt spekuloivat usein kielimallien kyvyillä ymmärtämättä niiden todellista potentiaalia.",
      "Lukijoita kannustetaan tarkistamaan omat ennustuskykynsä, mikä merkitsee haastetta validoida ja parantaa kielimalleihin liittyviä oletuksia."
    ],
    "commentSummary": [
      "Artikkelin pääpaino on kielimallin GPT-4 kyvykkyyksien arvioinnissa ja ennakoinnissa kysymysten täsmällisen vastaamisen kannalta.",
      "Osallistujat arvostelevat GPT-4:n kaltaisten kielimallien arvioinnissa käytettyä pisteytysjärjestelmää, keskustelevat sen rajoituksista ja ehdottavat vaihtoehtoisia arviointimenetelmiä.",
      "Osallistujat perehtyvät myös älykkyyden luonteeseen GPT-4:n ja ChatGPT:n kaltaisissa malleissa, painottaen tilastollisen prosessoinnin roolia, ja pohtivat kokemuksiaan konkreettisten esimerkkien avulla."
    ],
    "points": 188,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1693651226
  },
  {
    "id": 37366341,
    "title": "Kuinka kirjoittaa \"blimpy\" Emacsissa [video]",
    "originLink": "https://www.youtube.com/watch?v=2VOnKMJqIL0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37366341",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo lukuisista tekniikoista, joilla voit kirjoittaa sanan \"Blimpy\" tehokkaasti Emacsissa, joka on suosittu muokattava tekstieditori.",
      "Käsiteltäviin menetelmiin kuuluvat koodilohkojen kopiointi ja liittäminen, konfigurointivihjeiden käyttäminen sekä erikoistilojen ja -käskyjen käyttäminen.",
      "Postauksen tavoitteena on opastaa lukijoita nopeisiin ja tehokkaisiin syöttömenetelmiin toistuvien sanojen syöttämiseksi Emacsissa."
    ],
    "commentSummary": [
      "Video-opetusohjelma keskittyy yksinkertaiseen tehtävään kirjoittaa \"blimpy\" Emacsissa, mikä osoittaa tekstieditorin joustavuuden ja mukautusmahdollisuudet.",
      "Käyttäjät ovat eri mieltä siitä, miksi video saavutti suosiota, onko se vipuvoima yhteenkuuluvuuden ja yhteisöllisen vitsin luomiseen vai kritiikki teknologian monimutkaisuudesta.",
      "Ohje toimii hauskana johdantona Emacsiin ja sen käyttäjäyhteisön piirteisiin."
    ],
    "points": 186,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1693697138
  },
  {
    "id": 37363674,
    "title": "Burning Manista ei pääse sisään eikä ulos myrskyn jälkeen",
    "originLink": "https://www.sfgate.com/travel/article/no-access-after-burning-man-rain-storm-18344393.php",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37363674",
    "commentBody": "",
    "originSummary": [
      "Yli 70 000 Burning Man -festivaalin kävijää on jäänyt paikan päälle rankkasateiden vuoksi, jotka ovat muuttaneet alueen mutakuopaksi, sulkeneet portin ja lentokentän ja estäneet sisään- ja ulospääsyn.",
      "Osallistujia kehotetaan säästämään resursseja, sillä sateen odotetaan jatkuvan sunnuntaihin asti.",
      "Epävakaat sääolosuhteet aiheuttavat mahdollisen katastrofin, sillä sateiden ja ukkoskuurojen ennustetaan jatkuvan suurella todennäköisyydellä."
    ],
    "commentSummary": [
      "Nevadassa järjestettävän Burning Man -festivaalin kulku on vaikeutunut rankkasateiden vuoksi, mikä on aiheuttanut mutaisia olosuhteita ja ongelmia kuljetuksissa. Riittävät tarvikkeet takaavat kuitenkin, ettei nälänhädän tai nestehukan vaaraa ole.",
      "Lääketieteelliset hätätilanteet aiheuttavat huolta, mutta helikopterievakuointia varten on olemassa tarvittavat määräykset. Onnettomuuksien ja loukkaantumisten välttämiseksi kehotetaan noudattamaan turvatoimenpiteitä ja pysymään suojassa.",
      "Tilannetta olisi voitu liioitella ja aiheuttaa turhaa pelkoa. Tapahtuman suosiosta, tarvikkeiden saatavuudesta ja omavaraisuuden eetoksesta on erilaisia näkemyksiä."
    ],
    "points": 171,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1693676288
  }
]
