[
  {
    "id": 41215727,
    "title": "Verso – Servo web motoru üzerine inşa edilmiş web tarayıcısı",
    "originLink": "https://github.com/versotile-org/verso",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41215727",
    "commentBody": "",
    "originSummary": [
      "Verso, Servo web motoru üzerine inşa edilen ve geliştirilmekte olan bir web tarayıcısıdır. Şu anda özellik taleplerini kabul etmemekte, ancak test yardımlarını memnuniyetle karşılamaktadır.",
      "Windows, macOS, Linux (Flatpak) ve Nix için ayrıntılı kurulum talimatları sağlanmış olup, her platform için gerekli araçlar ve komutlar vurgulanmıştır.",
      "Gelecek geliştirme planları arasında çoklu pencere desteği, çoklu işlem modu, tüm platformlarda sandboxing ve Gstreamer özelliğinin etkinleştirilmesi bulunmaktadır."
    ],
    "commentSummary": [
      "Verso, tarayıcı teknolojisinde yenilik yapmayı amaçlayan Servo web motoru üzerine inşa edilmiş yeni bir web tarayıcısıdır.",
      "Son öneriler arasında, Rust ile yazılmış Unix benzeri bir işletim sistemi olan Redox OS'ye SpiderMonkey (JavaScript motoru) ve WebRender (render motoru) için fon sağlanması yer alıyor.",
      "Rust ve Swift ile geliştirilen tarayıcılar hakkında tartışmalar heyecanı vurguluyor, ancak bazı şüpheler Swift'in Apple ortamları dışındaki kullanışlılığı konusunda var."
    ],
    "points": 422,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1723379681
  },
  {
    "id": 41213053,
    "title": "Rust Kullanarak 175 Yazı Tipi Oluşturdum",
    "originLink": "https://chevyray.dev/blog/creating-175-fonts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41213053",
    "commentBody": "",
    "originSummary": [
      "Aralık 2023'te Chevy Ray, Rust ile oluşturulmuş özel bir araç zinciri kullanarak 175 Piksel Yazı Tipi Megapack'ini ve ardından 42 bireysel paketi piyasaya sürdü.",
      "Proje, yazı tipi kalitesini artırmayı, birden çok dili (EFIGS) desteklemeyi ve kerning, kalite kontrolü ve dağıtım gibi süreçleri otomatikleştirmeyi amaçladı.",
      "Yazı, font sayfaları oluşturma, glifleri konturlama, kerning'i otomatikleştirme, dosyaları dışa aktarma ve itch.io ve butler gibi araçları kullanarak dağıtma dahil olmak üzere adım adım süreci detaylandırıyor."
    ],
    "commentSummary": [
      "Yazar, verimli çok çekirdekli işlemeye vurgu yaparak Rust programlama dilini kullanarak 175 yazı tipi oluşturdu.",
      "Etkin font tasarımlarına rağmen, kısıtlayıcı lisans, açık kaynak yazılımlarda kullanımını sınırlıyor ve bu da bazı eleştiriler almasına neden oldu.",
      "Yazı, karakterler arasındaki boşluk (kerning) ve karakter desteği gibi yazı tipi oluşturmanın karmaşıklıklarına değinerek, bazı diller için eksik karakterler olduğunu belirtiyor."
    ],
    "points": 414,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1723333964
  },
  {
    "id": 41214259,
    "title": "OpenStreetMap 20 Yaşında",
    "originLink": "https://stevecoast.substack.com/p/the-days-are-long-but-the-years-are",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41214259",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenStreetMap (OSM), açık kaynak haritalamaya uzun süredir yaptığı katkıları vurgulayarak 20. yıl dönümünü kutluyor.",
      "StreetComplete gibi mobil uygulamalar, sıradan kullanıcıların katkıda bulunmasını kolaylaştırırken, güncel verilerin korunması için adanmış yerel haritacılar çok önemlidir.",
      "Eski veriler ve ticari ürünlerden gelen rekabet gibi zorluklara rağmen, OSM özellikle yürüyüş ve bisiklet gibi açık hava etkinlikleri için değerli bir kaynak olmaya devam ediyor ve birçok uygulama ve hizmete ilham vermiştir."
    ],
    "points": 342,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1723356017
  },
  {
    "id": 41214762,
    "title": "Firefox Tarayıcısı HaikuOS'a Taşındı",
    "originLink": "https://discuss.haiku-os.org/t/progress-on-porting-firefox/13493?page=7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41214762",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Firefox, başlangıçta yaratılmasına ilham veren bir platform olan HaikuOS'a başarıyla taşındı ve 20 yıl sonra önemli bir dönüm noktasını işaret ediyor.",
      "BeOS topluluğu başlangıçta Mozilla'nın basitleştirilmiş bir versiyonunu oluşturdu, bu da sonunda Firefox'a evrildi ve bu portu tam bir döngü anı haline getirdi.",
      "HaikuOS, duyarlı arayüzü ile övülürken, WiFi desteği gibi modern özelliklerin eksikliği nedeniyle eleştiriliyor, ancak topluluk gelişimine bağlı kalmaya devam ediyor."
    ],
    "points": 326,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1723364623
  },
  {
    "id": 41211540,
    "title": "Çalışmayacağım Şeyler: Dimetilkadmiyum (2013)",
    "originLink": "https://www.science.org/content/blog-post/things-i-won-t-work-dimethylcadmium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41211540",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yazı, belirgin derecede kötü bir kokuya sahip olan kimyasal bileşik dimetilkadmiyumun tehlikeli doğasını ve kimyagerlerin kimyasalları değerlendirmek için güvensiz yöntemler kullandığı tarihsel bağlamı tartışıyor.",
      "Kimyada güvenlik standartlarının evrimini vurguluyor, kimyasalları tatmak ve koklamak gibi geçmiş uygulamaları modern, daha güvenli yöntemlerle karşılaştırıyor.",
      "Konuşma, kimyagerlerin çeşitli kimyasallarla ilgili deneyimlerine dair anekdotları içeriyor, mevcut güvenlik protokollerinin önemini ve geçmiş uygulamaların tehlikelerini vurguluyor."
    ],
    "points": 260,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1723317099
  },
  {
    "id": 41211519,
    "title": "DEF CON'un rozet tartışmasına yanıtı",
    "originLink": "https://old.reddit.com/r/Defcon/comments/1ep00ln/def_cons_response_to_the_badge_controversy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41211519",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "DEF CON ve Entropic Engineering (EE), elektronik rozetlerin üretimi konusunda bir anlaşmazlık yaşıyor. DEF CON, EE'nin bütçeyi %60 aştığını ve kötü niyetli ücretler sunduğunu iddia ediyor.",
      "EE, DEF CON'u proje riskleri konusunda uyardıklarını, bütçe hedeflerine ulaşmak için indirimler teklif ettiklerini, ancak yine de tam olarak tazmin edilmediklerini iddia ediyor.",
      "EE için bağış talep eden yetkisiz bir paskalya yumurtası, DEF CON konuşmasından firmware yazarı Dmitry'nin çıkarılmasına yol açarak tartışmayı artırdı."
    ],
    "points": 247,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1723316843
  },
  {
    "id": 41213711,
    "title": "Flutter aracılığıyla Rust GUI Kütüphanesi",
    "originLink": "https://cjycode.com/posts/rust-ui-flutter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41213711",
    "commentBody": "",
    "originSummary": [
      "Flutter-Rust köprüsünün yeni bir sürümü (v2.0.0) yayınlandı, karmaşık sözdizimlerini otomatik olarak çevirerek Flutter ve Rust arasında sorunsuz entegrasyon sağlıyor.",
      "Bu güncelleme, iki dil arasındaki birlikte çalışabilirliği artırarak keyfi türler, değiştirilebilir referanslar (&mut), eşzamanlı olmayan işlevler (async), özellikler, sonuçlar, kapanışlar ve ömürler için destek içerir.",
      "Proje ayrıca, bu köprünün pratik uygulamalarını vurgulayarak, Flutter kullanarak GUI ile Rust uygulamaları yazmanın nasıl olduğunu da sergiliyor."
    ],
    "commentSummary": [
      "Flutter-Rust köprüsünün yeni bir sürümü (v2.0.0) yayınlandı ve bu, GUI uygulamaları için Flutter ve Rust arasında sorunsuz entegrasyon sağlıyor.",
      "Proje, kullanıcıların sadeliğini ve sıcak yeniden yükleme özelliğini takdir etmesiyle, bazen React'a tercih ederek önemli bir evrim ve katkılar gördü.",
      "Tartışmalar, Flutter'ın Google'ın kontrolü altındaki geleceği hakkındaki endişeleri içeriyor, ancak birçok kullanıcı, Tauri ve Crux gibi çerçevelerle karşılaştırmalar yaparak, kullanım kolaylığı ve performansını değerli buluyor."
    ],
    "points": 237,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1723344920
  },
  {
    "id": 41214180,
    "title": "Gervais İlkesi, ya da “The Office”e Göre Ofis (2009)",
    "originLink": "https://www.ribbonfarm.com/2009/10/07/the-gervais-principle-or-the-office-according-to-the-office/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41214180",
    "commentBody": "",
    "originSummary": [
      "Gervais İlkesi, 'The Office' dizisinden türetilmiş olup, çalışanları Sosyopatlar, Kafasızlar ve Kaybedenler olarak kategorize eder ve yeni bir yönetim teorisi sunar.",
      "Sosyopatlar organizasyonu yönetir, Ne yaptığını bilmeyen bireyler, performans gösteren Kaybedenlerin üzerine terfi ettirilir ve Kaybedenler uzun vadeli potansiyeli kısa vadeli istikrarla değiştirir.",
      "Bu ilke, 'The Office' dizisindeki karakter dinamiklerini açıklar ve Gareth Morgan'ın organizasyonları psişik hapishaneler olarak metaforuyla uyumludur."
    ],
    "commentSummary": [
      "Gervais İlkesi, 'The Office' dizisinden ilham alarak, organizasyonların genellikle katı ve kopuk hale geldiğini, bu durumun da reform yerine nihai çöküşlerine yol açtığını öne sürer.",
      "Eleştirmenler, üniversiteler ve devlet kurumları gibi kurumların rekabet baskısından yoksun olduğunu, bunun sonucunda durgun ve etkisiz \"zombi kurumlar\" haline geldiklerini savunuyorlar.",
      "Bu ilke, bireyleri sosyopatlar, safdiller ve kaybedenler olarak kategorize eder; sosyopatlar, aşırı performans gösteren kaybedenleri orta yönetime terfi ettirir, bu da gerçek dünyadaki uygulanabilirliği hakkında tartışmalara yol açar."
    ],
    "points": 215,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1723354512
  },
  {
    "id": 41212899,
    "title": "Entropik Mühendislik DEFCON 32 Bildirisi",
    "originLink": "https://www.entropicengineering.com/defcon-32-statement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41212899",
    "commentBody": "",
    "originSummary": [
      "Entropic Engineering, DEFCON 32 için henüz piyasaya sürülmemiş Raspberry Pi RP 2350 çipini kullanarak oyun öğesi içeren bir elektronik rozet oluşturmakla görevlendirildi.",
      "Başarılı prototip geliştirme ve devam eden üretime rağmen, DEFCON ödemeleri durdurdu ve işin durdurulmasını talep etti, bu da Entropic Engineering'in tamamlanmış işler ve parçalar için ödenmemiş kalmasına neden oldu.",
      "Makul tazminat için yapılan müzakereler başarısız oldu ve Entropic Engineering, ödeme beklememesine rağmen topluluk bağlılığı nedeniyle projeye katkıda bulunmaya devam etti."
    ],
    "commentSummary": [
      "Entropic Engineering ve DEFCON 32, bütçe sınırları ve bir yazılım geliştiricisinin rolü hakkındaki yanlış anlaşılmalar nedeniyle rozet üretim maliyetleri ve sorumlulukları konusunda bir anlaşmazlık içindeler.",
      "DEFCON, Entropic'in bütçeleri aştığını iddia ederken, Entropic ise eksik ödeme aldıklarını savunuyor; bir yazılım geliştiricisi, resmi bir sözleşme olmadan tartışmalı bir bağış ekranı ekleyerek çatışmayı tırmandırdı.",
      "Olay, proje yönetiminde net anlaşmaların ve iletişimin gerekliliğini vurguluyor, çünkü tüm gerçekler ve sözleşmeler kamuya açık değil."
    ],
    "points": 208,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1723331449
  },
  {
    "id": 41217037,
    "title": "CrowdStrike, defcon'da \"en destansı başarısızlık\" için PwnieAwards'ı kabul ediyor",
    "originLink": "https://twitter.com/singe/status/1822324795645575263",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41217037",
    "commentBody": "",
    "originSummary": [
      "KitleStrike, önde gelen bir siber güvenlik konferansı olan DEF CON sırasında Pwnie Ödülleri'nde \"en epik başarısızlık\" ödülünü aldı.",
      "Pwnie Ödülleri, siber güvenlik endüstrisindeki hem başarıları hem de başarısızlıkları mizahi bir şekilde tanımasıyla bilinir.",
      "Bu olay, topluluğun kendini sorgulama ve hataları neşeli bir şekilde kabul etme yeteneğini vurgulamaktadır."
    ],
    "commentSummary": [
      "CrowdStrike, Defcon'da \"en destansı başarısızlık\" için Pwnie Ödülü'nü aldı ve bu durum geniş çapta eleştirilere yol açtı.",
      "Eleştirmenler, yazılım endüstrisinin sorumluluktan kaçındığını, oysa hastaneler, bankalar, havayolları ve BT operasyonlarını etkileyen diğer sektörlerde bu tür başarısızlıkların ciddi sonuçlara yol açacağını savunuyor.",
      "Yazılım mühendislerinin, inşaat mühendisleri gibi benzer sorumluluk ve hesap verebilirlik ile karşı karşıya kalıp kalmaması gerektiği tartışmanın merkezinde yer alıyor, bazıları CrowdStrike'ın ödülü kabul etmesini, verilen büyük zararlar göz önüne alındığında duyarsız olarak görüyor."
    ],
    "points": 196,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1723391520
  },
  {
    "id": 41212193,
    "title": "Zımba: 32 yıllık klasik bir Macintosh uygulamasını yeniden yaptım",
    "originLink": "https://blog.gingerbeardman.com/2024/08/10/stapler-i-remade-a-32-year-old-classic-macintosh-app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41212193",
    "commentBody": "",
    "originSummary": [
      "Bir geliştirici, orijinal Stapler ve LaunchList'ten ilham alarak, modern macOS için 32 yıllık klasik bir Macintosh uygulaması olan Stapler'ı yeniden oluşturdu.",
      "Yeni uygulama, kullanıcıların belirli görevlerle ilgili uygulamaları, dosyaları ve klasörleri toplamasına ve başlatmasına olanak tanır, sürükle ve bırak ve sıfır tıklama ile otomatik başlatma özelliklerine sahiptir ve GitHub'da mevcuttur.",
      "Swift ve SwiftUI ile yazılmış olan uygulama, macOS 14.0 veya daha yeni bir sürüm gerektirir ve eğlenceli bir hafta sonu projesi olarak geliştirilmiştir."
    ],
    "commentSummary": [
      "Bir kullanıcı, uygulama tabanlı veya belge tabanlı iş akışları yerine görev tabanlı iş akışlarını vurgulayan 32 yıllık klasik Macintosh uygulaması Stapler'ı yeniden oluşturdu.",
      "Bunun aksine, kullanıcıların uygulama merkezli tasarımı nedeniyle sinir bozucu bulduğu modern MacOS, birden fazla pencere ve uygulamayı yönetmede zorluklara yol açmaktadır.",
      "Tartışma, iş akışını geliştirmek için Stay, Moom ve Keyboard Maestro gibi araçlar için öneriler ve Xerox Star & Smalltalk sistemlerine benzer şekilde daha görev odaklı bir işletim sistemi isteğini içeriyor."
    ],
    "points": 182,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1723323784
  },
  {
    "id": 41213151,
    "title": "Gözetlenen toplum: Kim sizi izliyor ve nasıl",
    "originLink": "https://www.rnz.co.nz/news/national/524791/the-surveilled-society-who-is-watching-you-and-how",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41213151",
    "commentBody": "",
    "originSummary": [
      "Yeni Zelanda'daki kamu alanlarında yapay zeka destekli kameraların analizi, gizlilik ve güvenlik etkilerine odaklanarak.",
      "Hukuki zorluklar ve otobüs kameraları, ANPR sistemleri ve havaalanı yüz tanıma gibi çeşitli gözetim teknolojileri hakkındaki kamu endişeleri.",
      "Tartışma, hizmet olarak gözetim ve ilgili gizlilik sorunlarına yönelik küresel eğilim üzerine."
    ],
    "commentSummary": [
      "Yüksek teknolojiye sahip reklam panoları ve kamusal alanlardaki akıllı ekranlar, bireylere yönelik reklamları kişiselleştirmek için plaka tanıma ve ruh hali ölçme gibi gözetim teknolojilerini giderek daha fazla kullanıyor.",
      "Yüz tanıma kameraları, insanları saymak ve yasaklı kişileri tespit etmek amacıyla barlar ve spor mekanları gibi çeşitli yerlere kuruluyor, bu da gizlilik endişelerini artırıyor.",
      "Kredi kartı okuyucuları ve POS (Satış Noktası) sistemleri, ayrıntılı işlem verilerini toplayabilir ve bu veriler gözetim ve veri profilleme için kullanılabilir."
    ],
    "points": 173,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1723335641
  },
  {
    "id": 41212364,
    "title": "ABD FDA, alerjik reaksiyonlar için EpiPen'e alternatif burun spreyi onayladı",
    "originLink": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-fda-approves-first-nasal-spray-allergic-reactions-2024-08-09/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41212364",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ABD FDA, alerjik reaksiyonların tedavisi için EpiPen'e alternatif olarak neffy adlı burun spreyini onayladı.",
      "Neffy, 30 aylık bir raf ömrü sunar, 122°F'ye kadar olan sıcaklıklara dayanabilir ve yanlışlıkla dondurulsa bile kullanılabilir durumda kalarak depolama kolaylığını artırır.",
      "İki doz için 199 dolara fiyatlandırılan ve bazı sigorta planlarının 25 dolara sunduğu neffy'nin, iğne fobisi olan bireylere fayda sağlaması ve tıbbi olmayan personel tarafından daha kolay uygulanmasını kolaylaştırması bekleniyor, bu da potansiyel olarak pazar rekabetini artırabilir ve fiyatları düşürebilir."
    ],
    "points": 160,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1723325446
  },
  {
    "id": 41212271,
    "title": "AMD'nin Strix Point: Zen 5 Mobil Cihazlarda",
    "originLink": "https://chipsandcheese.com/2024/08/10/amds-strix-point-zen-5-hits-mobile/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41212271",
    "commentBody": "",
    "originSummary": [
      "AMD'nin Zen 5 mimarisi, Zen 5 çekirdekleri, RDNA 3.5 iGPU ve yapay zeka yeteneklerine sahip Strix Point APU'larının bir parçası olan Ryzen AI 9 HX 370 ile mobil cihazlarda debut yapıyor.",
      "Strix Point, 128-bit LPDDR5-7500 yapılandırması kullanarak, dört çekirdeği 5.15 GHz'de çalışan yüksek performanslı bir küme ve sekiz çekirdeği 3.3 GHz'de çalışan yoğunluk optimize edilmiş bir küme olmak üzere iki kümede 12 Zen 5 çekirdeği içerir.",
      "Zen 5 mimarisi, dal tahmini, getirme ve çözme aşamaları ve arka uç kaynaklarında önemli iyileştirmeler sunarak saat hızı artışları yerine IPC (Döngü Başına Talimat) kazançlarına odaklanmaktadır."
    ],
    "commentSummary": [
      "AMD'nin Zen 5 mimarisine sahip Strix Point, mobil cihazlar için piyasaya sürüldü ve teknoloji topluluğunda büyük ilgi uyandırdı.",
      "Tartışma, AMD'nin yeni çipleri ile Apple'ın M1'i arasındaki rekabetçi ortamı, performans, güç verimliliği ve mimari farklılıklar üzerine odaklanarak vurguluyor.",
      "Bu sürüm, AMD'nin verimlilik ve performans konusundaki ilerlemelerini gösteren karşılaştırmalarla, Apple'ın mobil CPU pazarındaki hakimiyetine meydan okuma potansiyeli taşıdığı için dikkat çekicidir."
    ],
    "points": 143,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1723324731
  },
  {
    "id": 41217109,
    "title": "70 yaşındaki büyükannem kodlama öğreniyor ve bir kelime oyunu yaptı",
    "originLink": "https://grandmasword.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41217109",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "70 yaşındaki bir büyükanne, hem övgü hem de yapıcı eleştiriler alan bir kelime oyunu olan grandmasword.com'u oluşturdu.",
      "Kullanıcılar, ipuçları ekleme veya bir \"pes et\" düğmesi gibi iyileştirmeler önerdi ve özellikle mobil cihazlarda bazı hatalar bildirdi.",
      "Bu oyun, çeşitli yaş gruplarına ve dil öğrenenlere hitap etme potansiyeli nedeniyle takdir edilmekte ve genel olarak olumlu geri bildirimler almaktadır."
    ],
    "points": 124,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1723392110
  }
]
