[
  {
    "title": "Unlocking Global Opportunities: How Korean Startups Leverage Singapore for International Expansion",
    "originLink": "https://www.chosun.com/economy/smb-venture/2023/11/17/I6H3PAG7UZA4XMB24URZ34SRUQ/",
    "originBody": "",
    "originSummary": [
      "Proof-of-Concept (POC) and Open Innovation are crucial for startups seeking international expansion.",
      "Singapore is highlighted as an ideal testbed for startups due to its open innovation platform, government support, multinational presence, and collaborative opportunities.",
      "LG's recent victory in the Korean Series championship is mentioned, along with the success of Nongshim's spicy snack product.",
      "The article also notes the memorial service for Samsung's founder, Byung-Chul Lee, with Jay Y. Lee's absence as he attends court."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Naver's BeringLab Wins Huawei Startup Competition for AI Legal Tech",
    "originLink": "https://www.yna.co.kr/view/AKR20231117035900017",
    "originBody": "",
    "originSummary": [
      "Naver's AI legal tech startup, BeringLab, has emerged as the winner of Huawei's startup competition. BeringLab specializes in providing translation services for legal contracts and has established partnerships with global companies.",
      "Tragic incidents, including the death of a high school student prior to exams and a child falling to their death, have been reported.",
      "Korean youth are reportedly joining the Russian army in the Donbass conflict, and there are various other news stories covering entertainment controversies, sports victories, court rulings, and government developments.",
      "A law to ban the consumption of dog meat is expected to be implemented in 2027."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Michael Jordan and Howard Wright, AWS VP, emphasize support for Korean startups as lifeline of future industries",
    "originLink": "https://m.hankookilbo.com/News/Read/A2023111710230005817",
    "originBody": "",
    "originSummary": [
      "Former NBA player Michael Jordan and AWS Vice President Howard Wright have expressed their support for Korean startups, emphasizing their importance as the lifeline of future industries.",
      "They have pledged to provide active support to these startups to help them thrive and succeed in their respective fields."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Busan Targets World Expo 2030 with Outdoor Ads, Changwon Addresses Sexual Harassment Case and Forgotten Seasons",
    "originLink": "https://www.newsfreezone.co.kr/news/articleView.html?idxno=528280",
    "originBody": "",
    "originSummary": [
      "The city of Busan in South Korea is vying to host the World Expo 2030 by using outdoor advertisements that highlight the country's natural beauty.",
      "A briefing in Changwon addressed a sexual harassment case at the Geochang county office and the problem of \"forgotten seasons\"."
    ],
    "commentBody": "",
    "commentSummary": ["제공된 정보에는 내용이 없습니다."],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Lotte Ventures supports Vietnamese startup Shark Market to become a leader in local food market",
    "originLink": "https://www.hankyung.com/article/202311174195Y",
    "originBody": "",
    "originSummary": [
      "Shark Market, a Vietnamese startup, is receiving support from Lotte Group to become a leader in the local food market.",
      "Lotte Ventures is providing various forms of support to help Shark Market expand its business, including B2B transactions and lowering the price of Korean food products.",
      "Lotte Group is also known for its active involvement in social contributions and youth development initiatives in Vietnam.",
      "In Indonesia, the country is purchasing fighter jets to support its reliance on air transportation, despite concerns over safety following previous airplane crashes.",
      "In China, Peng Liyuan, the country's top female leader, is emphasizing the importance of women's roles within the family and working towards creating a more child-friendly environment as the leader of the All-China Women's Federation."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "SM Entertainment Collaborates with VUSIC to Launch \"ESPA World\" Metaverse Platform",
    "originLink": "https://news.mt.co.kr/mtview.php?no=2023111710105486210",
    "originBody": "",
    "originSummary": [
      "SM Entertainment and VUSIC have joined forces to develop \"ESPA World,\" a metaverse platform embedded in the ZEPETO app. This collaboration aims to provide users with interactive experiences featuring the popular K-pop group ESPA.",
      "\"ESPA World\" will offer dynamic metaverse content, allowing fans to engage with ESPA and their music in unique ways.",
      "The partnership between SM Entertainment and VUSIC signifies the growing importance of the metaverse in the entertainment industry and further demonstrates the K-pop industry's innovative approach to fan engagement."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "mAy-I's AI Solution \"mAsh\" Wins CES 2024 Innovation Award, Eyes Global Expansion",
    "originLink": "https://news.imaeil.com/page/view/2023111711173018194",
    "originBody": "",
    "originSummary": [
      "South Korean AI startup mAy-I has won the Innovation Award at CES 2024 for its AI-based offline visitor data analysis solution, mAsh.",
      "The company plans to expand its market presence domestically and internationally."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Naver-backed BeringLab wins top prize at Huawei startup event",
    "originLink": "https://www.etnews.com/20231117000034",
    "originBody": "",
    "originSummary": [
      "Naver의 후원을 받고 있는 인공지능 법률 기술 스타트업 BeringLab이 2023년 Huawei Cloud Ignite 스타트업 이벤트에서 최우수상을 수상했습니다.",
      "BeringLab은 법적 계약의 번역 서비스를 제공하며, 마이크로소프트, 소니 음악, 카카오 게임 등의 고객을 보유하고 있습니다.",
      "BeringLab은 Naver의 D2SF 및 서울대학교 기술 보유 회사로부터 초기 단계부터 투자를 받아왔습니다.",
      "BeringLab은 내년 상반기까지 주요 유럽 및 아시아 언어에 대한 언어 엔진의 개발 완료를 계획하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "Bitthumb to Invest $254M in Start-up Funding, Launch $4.2M Competition",
    "originLink": "https://www.fetv.co.kr/news/article.html?no=152525",
    "originBody": "",
    "originSummary": [
      "Bitthumb, a cryptocurrency exchange, will invest 300 billion won ($254 million) in start-up funding and 5 billion won ($4.2 million) for a start-up competition.",
      "The investment and competition are open to companies, individuals, groups, and start-ups that are less than 3 years old.",
      "Winners of the competition will receive cash prizes ranging from 30 million won ($25,400) to 100 million won ($84,700), as well as additional support.",
      "The deadline for participation is November 30th, and the final investment decisions will be made in February.",
      "Bitthumb will not restrict the business fields that can participate in the funding and competition."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  },
  {
    "title": "KDRA showcases 13 innovative pharm/biotech firms, promotes industry collaboration",
    "originLink": "https://www.medifonews.com/news/article.html?no=184980",
    "originBody": "",
    "originSummary": [
      "KDRA hosted an event featuring 13 pharmaceutical/biotech companies, emphasizing the importance of collaboration and innovation in the industry.",
      "The article mentions other events and partnerships involving the KDRA.",
      "Treatment guidelines were released by the KDRA.",
      "A potential treatment discovery is also mentioned."
    ],
    "commentBody": "",
    "commentSummary": ["No information is provided in the given statement."],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700194376279
  }
]
