[
  {
    "id": 37892684,
    "title": "Mastercard debería dejar de vender nuestros datos",
    "originLink": "https://www.eff.org/deeplinks/2023/10/mastercard-should-stop-selling-our-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37892684",
    "commentBody": "",
    "originSummary": [
      "La Electronic Frontier Foundation (EFF) se ha asociado con el Grupo de Investigación de Interés Público de Estados Unidos (U.S. PIRG) en una campaña para instar a Mastercard a que restrinja la recopilación de datos y deje de vender la información de los titulares de tarjetas.",
      "Las actuales estrategias de monetización de Mastercard, que implican el análisis de los datos de las transacciones para categorizar a los titulares de las tarjetas, vulneran al parecer la intimidad y la confianza de los consumidores.",
      "La EFF está presionando a Mastercard para que modifique estas prácticas en materia de datos en un intento de mantener la confianza de los titulares de tarjetas y respetar su privacidad."
    ],
    "commentSummary": [
      "El debate hace hincapié en la preocupación por la privacidad de los datos y el posible uso indebido de los datos de los consumidores por parte de grandes empresas de tarjetas de crédito como Visa y Mastercard.",
      "Se estudian alternativas a estas empresas, como las tarjetas de prepago y el dinero en efectivo, lo que pone de relieve la necesidad de sistemas de pago variados que desafíen el dominio del mercado de Visa y Mastercard.",
      "Se sopesan las ventajas e inconvenientes del uso de tarjetas de crédito, incluidas algunas específicas como la Amex Platinum Card, con especial atención a los recelos sobre la privacidad relacionados con la recopilación y despliegue de datos por parte de las empresas."
    ],
    "points": 508,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1697398415
  },
  {
    "id": 37891886,
    "title": "Finlandia votará en contra de la Directiva de la UE sobre vigilancia masiva y prohibición del cifrado",
    "originLink": "https://dawn.fi/uutiset/2023/10/14/eu-csam-suomi-eduskunta-kanta",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37891886",
    "commentBody": "",
    "originSummary": [
      "La Gran Comisión del Parlamento finlandés expresó sus reservas sobre la propuesta de la UE de prohibir el cifrado fuerte, afirmando que ello podría comprometer la ciberseguridad de extremo a extremo.",
      "Reiteraron su apoyo a la protección de la infancia en línea, pero se mostraron contrarios a cualquier compromiso en materia de cifrado y vigilancia masiva, abogando en cambio por centrarse en personas claramente identificadas.",
      "Se espera que los Estados miembros de la UE tomen pronto una decisión sobre este polémico asunto."
    ],
    "commentSummary": [
      "Finlandia se ha opuesto públicamente a una directiva de la UE destinada a prohibir la vigilancia masiva y la encriptación, alegando que vulnera el derecho a la intimidad y sustituye las órdenes judiciales por un escaneo general.",
      "El debate plantea preocupaciones sobre la aplicabilidad de la prohibición, el posible espionaje de ciudadanos normales y debate las implicaciones de vivir en un mundo totalmente transparente.",
      "Hay discursos sobre el papel fundamental de la encriptación en la preservación de la intimidad, las posibles características inconstitucionales de la ley y las opiniones divergentes de las distintas naciones. También llama la atención la falta de conocimiento popular sobre la estructura y los procesos de toma de decisiones de la UE."
    ],
    "points": 408,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1697392890
  },
  {
    "id": 37889666,
    "title": "Lotus 1-2-3 para Linux",
    "originLink": "https://lock.cmpxchg8b.com/linux123.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37889666",
    "commentBody": "",
    "originSummary": [
      "El autor consiguió portar Lotus 1-2-3, un programa antiguo, a Linux recuperando archivos perdidos y empleando varios hacks.",
      "Se presta especial atención a los problemas de compatibilidad, que implican llamadas al sistema y conversiones de archivos de objetos, junto con la eliminación de símbolos de los archivos de objetos y la escritura de envoltorios para funciones incompatibles.",
      "Se mencionan algunos problemas relacionados con los términos y las licencias, pero, en general, el autor considera que el cambio a Linux ha sido un éxito."
    ],
    "commentSummary": [
      "El artículo anuncia la disponibilidad del programa de hoja de cálculo, Lotus 1-2-3, para Linux, destacando su importancia para preservar los datos.",
      "La conversación también gira en torno a la nostalgia por la escena BBS (Bulletin Board System) del pasado, destacando un resurgimiento de su ethos y la cultura retro de los 80/90.",
      "En el artículo también se abordan cuestiones como la piratería informática, el archivo de manuales de sintetizadores, las anécdotas personales, la publicidad selectiva y la posible manipulación por parte de las empresas tecnológicas."
    ],
    "points": 344,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1697377521
  },
  {
    "id": 37890176,
    "title": "Signtime.apple: Interpretación individual de la lengua de signos por Apple",
    "originLink": "https://www.signtime.apple/applecare/us-EN/asl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890176",
    "commentBody": "",
    "originSummary": [
      "SignTime\", un servicio de interpretación individual en lengua de signos para compras y sesiones de apoyo, no está disponible actualmente.",
      "Se recomienda a los usuarios que vuelvan a intentar acceder al servicio más tarde."
    ],
    "commentSummary": [
      "Apple ha introducido un nuevo servicio llamado Signtime.apple, diseñado para ofrecer interpretación individual en lengua de signos para la atención al cliente, dirigido específicamente a los clientes que utilizan la lengua de signos americana (ASL).",
      "El servicio permite a los clientes sordos o con dificultades auditivas interactuar con los representantes de Apple utilizando ASL a través de videochat, lo que sustituye la necesidad de comunicación escrita o de intérpretes durante las llamadas telefónicas.",
      "Preocupan las posibles llamadas de spam, las pistas de auditoría y los abusos, junto con la confusión sobre los nombres de dominio de Apple y las implicaciones para la seguridad. Aun así, se ha reconocido positivamente el compromiso de Apple con la calidad y la experiencia del cliente."
    ],
    "points": 269,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1697380975
  },
  {
    "id": 37892028,
    "title": "Auditoría SSH: Auditoría de seguridad de servidores y clientes SSH",
    "originLink": "https://github.com/jtesta/ssh-audit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37892028",
    "commentBody": "",
    "originSummary": [
      "El repositorio jtesta/ssh-audit ha sido actualizado con mejoras para auditar las configuraciones de servidores y clientes SSH, ahora soportando Python 3.7-3.11.",
      "Las actualizaciones incluyen recomendaciones, información de seguridad, paquetes preconstruidos, un front-end web, nuevas políticas, corrección de errores y compatibilidad mejorada en Ubuntu 22.04 LTS.",
      "También cuenta con claves de host ampliadas, intercambios de claves, cifrados, MAC, auditoría de software cliente y una opción de salida JSON para una mayor versatilidad."
    ],
    "commentSummary": [
      "La conversación se centra en la importancia de proteger los servidores y clientes SSH, destacando los problemas de seguridad de la configuración por defecto.",
      "Se debaten el uso de distintos algoritmos y la fiabilidad de las claves Ed25519.",
      "Hay opiniones divergentes sobre la seguridad de la confianza en el primer uso (TOFU) en los protocolos criptográficos y sobre si son necesarios más pasos de verificación."
    ],
    "points": 250,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1697393924
  },
  {
    "id": 37890742,
    "title": "Omnivore - App gratuita, de código abierto y de lectura diferida",
    "originLink": "https://omnivore.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890742",
    "commentBody": "",
    "originSummary": [
      "Login Omnivore es una aplicación de código abierto de lectura diferida destinada a lectores extensos, que permite guardar varios tipos de contenidos para leerlos más tarde sin distracciones.",
      "Los usuarios no sólo pueden añadir notas y elementos destacados, sino también organizar y sincronizar sus listas de lectura en todos los dispositivos.",
      "La aplicación incluye funciones de conversión de texto a voz e integración con los conocidos sistemas de gestión personal del conocimiento (PKM), lo que proporciona a los usuarios un control total sobre su biblioteca de lectura."
    ],
    "commentSummary": [
      "Omnivore es una aplicación gratuita y de código abierto que enlaza con RSS y boletines por correo electrónico, pero los usuarios han expresado su preocupación por su futura estrategia de monetización y la falta de algunas funciones.",
      "Actualmente, la aplicación sólo es compatible con iOS, pero los desarrolladores tienen previsto lanzar una versión para Windows. Entre sus características exclusivas se incluye la posibilidad de exportar resúmenes, utilizar plugins para Obsidian y Notion y autoalojar servidores.",
      "Omnivore compite con aplicaciones como Pocket, Raindrop.io, Instapaper y Readwise. Aunque los usuarios encuentran complejas sus instrucciones de autoalojamiento en comparación con sus rivales, y su modelo de financiación sigue siendo ambiguo."
    ],
    "points": 244,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1697384913
  },
  {
    "id": 37890369,
    "title": "Mark Twain en Stormfield (1909) [vídeo].",
    "originLink": "https://www.youtube.com/watch?v=leYj--P4CgQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890369",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "El tema principal es el uso de tecnologías avanzadas como la IA para mejorar películas antiguas, concretamente un clip actualizado de Mark Twain de 1909.",
      "Los puntos de vista divergen entre los partidarios de las mejoras para mejorar la experiencia visual y los defensores de la exactitud histórica y la preservación de la intención artística original.",
      "Junto con la coloración de las películas y la adición de música moderna, el debate se extiende a la aplicación de la IA en la reproducción de personajes históricos en las películas, lo que plantea dudas sobre la precisión y fiabilidad de las imágenes generadas por IA."
    ],
    "points": 209,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1697382519
  },
  {
    "id": 37890685,
    "title": "La inferencia causal como punto ciego de los científicos de datos",
    "originLink": "https://dzidas.com/ml/2023/10/15/blind-spot-ds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890685",
    "commentBody": "",
    "originSummary": [
      "El artículo subraya la importancia de la inferencia causal en la ciencia de datos y la toma de decisiones empresariales.",
      "La comunidad de la ciencia de datos está dando prioridad recientemente a la inferencia causal, implementándola mediante métodos como los modelos gráficos causales, las variables instrumentales y DoubleML.",
      "La narración hace hincapié en contemplar las variables de confusión en la inferencia causal, ofreciendo recursos para un aprendizaje adicional."
    ],
    "commentSummary": [
      "Las conversaciones se centran en la importancia, los obstáculos y las limitaciones de la inferencia causal en la toma de decisiones y el análisis de datos.",
      "Los ensayos controlados aleatorios (ECA) se consideran la regla de oro, pero son costosos y requieren mucho tiempo. La inferencia causal observacional, una alternativa más rápida y menos costosa, aún no está ampliamente aceptada.",
      "Se están haciendo esfuerzos para que la inferencia causal sea más accesible y reproducible, pero siguen pendientes cuestiones como la evaluación de modelos y la escalabilidad. También hay división de opiniones sobre la utilidad y viabilidad de la inferencia causal en la interpretación de datos."
    ],
    "points": 198,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1697384599
  },
  {
    "id": 37891020,
    "title": "¿Por qué Async Rust?",
    "originLink": "https://without.boats/blog/why-async-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37891020",
    "commentBody": "",
    "originSummary": [
      "El artículo investiga la aplicación y evolución de los mecanismos de concurrencia en el lenguaje de programación Rust, centrándose especialmente en la sintaxis async/await.",
      "Profundiza en los retos que plantea la construcción de futuros intrincados, la transición desde los hilos verdes y cómo los iteradores y los futuros se compilan en máquinas de estados.",
      "Con la descripción del uso exitoso de Rust en servicios de red, el autor también plantea su preocupación por la excesiva dependencia del ecosistema Rust de async/await, y propone posibles mejoras al mismo."
    ],
    "commentSummary": [
      "La discusión se refiere a los méritos y complicaciones de la utilización de la programación asíncrona en Rust, haciendo hincapié en su composición más limpia, cancelación más fácil, y la reducción de la sobrecarga de memoria en relación con los hilos.",
      "El diálogo aborda las dificultades del cambio de contexto, la selección de servidores HTTP en Rust y la creciente prevalencia de async/await en el lenguaje.",
      "Se debate sobre el uso de Rust en el desarrollo web y los sistemas seguros, con especial atención a la seguridad de la memoria; la conversación subraya el potencial de Rust para lograr una mayor adopción en distintos ámbitos."
    ],
    "points": 192,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697386709
  },
  {
    "id": 37895446,
    "title": "Cockpit: Interfaz gráfica basada en web para servidores",
    "originLink": "https://cockpit-project.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37895446",
    "commentBody": "",
    "originSummary": [
      "Cockpit es una interfaz gráfica para servidores basada en web y fácil de usar que permite a los usuarios gestionar sus sistemas a través de una interfaz gráfica de usuario, aunque es totalmente compatible con los flujos de trabajo de las herramientas de línea de comandos existentes.",
      "Posee varias funciones, como la configuración de redes, la gestión del almacenamiento, la creación de máquinas virtuales, la resolución de problemas y la mejora de las funciones con aplicaciones y módulos personalizados.",
      "El software utiliza API y comandos del sistema, admite la autenticación de inicio de sesión único, se ejecuta bajo demanda para ahorrar recursos y es compatible con las principales distribuciones y navegadores web."
    ],
    "commentSummary": [
      "El artículo profundiza en las experiencias de los usuarios con Cockpit, una interfaz web para la gestión de servidores, destacando respuestas dispares.",
      "Las críticas giran en torno a su desarrollo relativamente lento y sus menores prestaciones en comparación con herramientas similares, pero otros lo aprecian para la gestión remota de libvirt y KVM.",
      "También se menciona la experiencia personal del autor con el uso de Cockpit, encontrándolo práctico en su Raspberry Pi corriendo Fedora, pero deseando soporte para doas."
    ],
    "points": 191,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697424501
  },
  {
    "id": 37888606,
    "title": "Poesía italiana \"interactiva\" para anglófonos",
    "originLink": "https://italianpoetry.it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37888606",
    "commentBody": "",
    "originSummary": [
      "El autor ha desarrollado una herramienta destinada a hacer digerible la poesía italiana para los angloparlantes, proporcionando traducciones detalladas, notas de uso y contexto adicional.",
      "La herramienta se construyó con una tecnología sencilla, lo que sugiere un potencial de navegación y accesibilidad fáciles para el usuario.",
      "Buscan activamente comentarios sobre su metodología, lo que indica su intención de mejorar continuamente esta herramienta."
    ],
    "commentSummary": [
      "ItalianPoetry.it es una plataforma en línea que permite a los angloparlantes explorar y escuchar poesía italiana, con planes de ampliar su oferta al latín y el alemán.",
      "Los usuarios han valorado positivamente la web y han sugerido mejoras, como mayores opciones de velocidad de reproducción y vídeos de poetas recitando sus obras.",
      "El creador de la web planea hacer público su repositorio de poemas, permitiendo a los usuarios enviar solicitudes de obras específicas, lo que indica un avance hacia una plataforma más colaborativa y receptiva a los usuarios."
    ],
    "points": 174,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1697366233
  },
  {
    "id": 37893555,
    "title": "BIOS con licencia GPL-3.0 para ordenadores basados en Intel 8088",
    "originLink": "https://github.com/skiselev/8088_bios",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37893555",
    "commentBody": "",
    "originSummary": [
      "El repositorio GitHub proporciona una BIOS de código abierto para los sistemas Micro 8088, NuXT y Xi 8088, incluyendo contribuciones, imágenes de la BIOS, instrucciones de compilación y notas de la versión de las diferentes versiones.",
      "El repositorio agradece a los colaboradores que han contribuido decisivamente a su desarrollo y mantenimiento.",
      "El repositorio describe futuras actualizaciones y mejoras, lo que indica que se trata de un proyecto en curso."
    ],
    "commentSummary": [
      "El artículo habla de una BIOS con licencia GPL-3.0 diseñada para ordenadores basados en Intel 8088, mencionando su omisión de ROM BASIC y el potencial para hacer esta BIOS ROM-able.",
      "Compara las CPU 8088 y 8086, resaltando las diferencias, y explora proyectos relacionados, incluida la BIOS de código abierto.",
      "Se menciona a la NASA utilizando sistemas IBM PC y XT, un error en book8088, el proceso de overclocking y la ejecución del entorno GNU en una CPU 8088."
    ],
    "points": 165,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1697405427
  },
  {
    "id": 37889844,
    "title": "La ignorancia crítica como competencia básica de los ciudadanos digitales",
    "originLink": "https://journals.sagepub.com/doi/10.1177/09637214221121570",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37889844",
    "commentBody": "",
    "originSummary": [
      "El artículo subraya el valor de \"ignorar críticamente\", una competencia de ciudadanía digital destinada a filtrar la información inexacta y de baja calidad.",
      "Entre los métodos propugnados figuran el autoengaño, la lectura lateral y la desatención a los actores malintencionados, con sugerencias para la enseñanza de estas habilidades en las instituciones educativas y la aplicación de políticas de moderación de contenidos en las plataformas virtuales.",
      "Haciendo hincapié en el cultivo de nuevos hábitos mentales para defenderse de la desinformación, el artículo ofrece varias referencias sobre distintas facetas de la desinformación y estrategias para contrarrestarla."
    ],
    "commentSummary": [
      "Los debates en Hacker News se centran en la \"ignorancia crítica\" como habilidad crucial para que los ciudadanos digitales eviten conversaciones en línea improductivas.",
      "Se subraya la necesidad de normas sociales sólidas, una comunicación educada sin blasfemias ni sarcasmos y un discurso persuasivo. Se reconocen las limitaciones de los foros en línea.",
      "El debate también hace hincapié en las consecuencias de la economía de la atención y la publicidad, la importancia de la alfabetización mediática, la evaluación crítica de la información, el riesgo de la desinformación en las plataformas sociales y la necesidad de dar prioridad a los contenidos de calidad."
    ],
    "points": 161,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1697378826
  },
  {
    "id": 37894403,
    "title": "MemGPT: Hacia los LLM como sistemas operativos",
    "originLink": "https://arxiv.org/abs/2310.08560",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37894403",
    "commentBody": "",
    "originSummary": [
      "Este artículo presenta MemGPT, un sistema diseñado para mejorar el rendimiento de los grandes modelos lingüísticos (LLM) proporcionándoles un contexto ampliado dentro de su ventana de contexto restringida.",
      "Inspirado en los sistemas de memoria jerárquica de los sistemas operativos tradicionales, MemGPT utiliza la gestión de contextos virtuales para mejorar el rendimiento.",
      "El sistema, evaluado en dominios como el análisis de documentos y el chat multisesión, mostró unas capacidades superiores a las limitaciones de los LLM actuales. El código y los datos de MemGPT ya están disponibles para experimentación pública."
    ],
    "commentSummary": [
      "MemGPT, un proyecto de código abierto, pretende enseñar a los modelos lingüísticos la gestión de la memoria como los sistemas operativos, con un chatbot Discord implementado.",
      "El debate ahonda en la disyuntiva entre que el modelo gestione su propia memoria o que un agente independiente se encargue de esta tarea, explorando opiniones divergentes sobre la eficacia de los modelos lingüísticos.",
      "La conversación también hace hincapié en la necesidad de una comunicación clara en la investigación, introduciendo el concepto de \"gestión del contexto virtual\", un método para superar las limitaciones de los modelos de IA."
    ],
    "points": 156,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1697412795
  },
  {
    "id": 37888948,
    "title": "Restringir el acceso a Internet por piratería es drástico y excesivo",
    "originLink": "https://torrentfreak.com/terminating-internet-access-over-piracy-claims-is-drastic-and-overbroad-231014/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37888948",
    "commentBody": "",
    "originSummary": [
      "Grande Communications, proveedor de servicios de Internet (ISP), se opone a una demanda de 47 millones de dólares por daños y perjuicios causados por la piratería a las discográficas, alegando que los ISP no deben asumir la responsabilidad de las infracciones de derechos de autor basadas en reclamaciones de terceros.",
      "Grande invoca una reciente decisión del Tribunal Supremo favorable a Twitter, afirmando que interrumpir el acceso a Internet por reclamaciones de derechos de autor es excesivamente amplio, afecta a usuarios inocentes y restringe la inversión en infraestructuras de banda ancha.",
      "Varios grupos del sector de las telecomunicaciones que respaldan a Grande también hacen referencia a la sentencia del Tribunal Supremo, sugiriendo que acusar a Grande de responsabilidad por piratería podría haber sido un error."
    ],
    "commentSummary": [
      "El artículo subraya la amenaza de interrumpir el acceso a Internet por reclamaciones de piratería y la necesidad de la neutralidad de la red para mantener un entorno en línea justo.",
      "Llama la atención sobre el controvertido papel de los proveedores de servicios de Internet (ISP) en el control de las transferencias de datos en relación con las leyes de derechos de autor y propiedad intelectual.",
      "El artículo reclama una reevaluación de las actuales políticas de derechos de autor adaptadas a la era digital, junto con debates en torno a la ética de la piratería y las repercusiones para los creadores de contenidos."
    ],
    "points": 154,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1697370217
  }
]
