[
  {
    "id": 37892684,
    "title": "மாஸ்டர் கார்டு எங்கள் தரவை விற்பதை நிறுத்த வேண்டும்",
    "originLink": "https://www.eff.org/deeplinks/2023/10/mastercard-should-stop-selling-our-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37892684",
    "commentBody": "",
    "originSummary": [
      "மின்னணு எல்லைப்புற அறக்கட்டளை (ஈ.எஃப்.எஃப்) அமெரிக்க பொது ஆர்வ ஆராய்ச்சிக் குழுவுடன் (யு.எஸ். பி.ஐ.ஆர்.ஜி) ஒரு பிரச்சாரத்தில் கூட்டு சேர்ந்துள்ளது, இது தரவு சேகரிப்பைக் கட்டுப்படுத்தவும் அட்டைதாரர் தகவல்களை விற்பனை செய்வதை நிறுத்தவும் மாஸ்டர்கார்டை வலியுறுத்துகிறது.",
      "கார்டுதாரர்களை வகைப்படுத்த பரிவர்த்தனை தரவுகளின் பகுப்பாய்வை உள்ளடக்கிய மாஸ்டர்கார்டின் தற்போதைய பணமாக்கல் உத்திகள் நுகர்வோர் தனியுரிமை மற்றும் நம்பிக்கையை மீறுவதாகக் கூறப்படுகிறது.",
      "அட்டைதாரர்களின் நம்பிக்கையைப் பராமரிக்கவும் அவர்களின் தனியுரிமையை மதிக்கவும் இந்த தரவு நடைமுறைகளை மாற்றுமாறு மாஸ்டர்கார்டுக்கு ஈஎஃப்எஃப் அழுத்தம் கொடுக்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் தரவு தனியுரிமை மற்றும் விசா மற்றும் மாஸ்டர் கார்டு போன்ற முக்கிய கிரெடிட் கார்டு நிறுவனங்களால் நுகர்வோர் தரவை தவறாகப் பயன்படுத்துவதற்கான சாத்தியக்கூறுகள் குறித்த கவலைகளை வலியுறுத்துகிறது.",
      "ப்ரீபெய்ட் கார்டுகள் மற்றும் ரொக்கம் போன்ற இந்த நிறுவனங்களுக்கு மாற்று வழிகள் ஆராயப்படுகின்றன, இது விசா மற்றும் மாஸ்டர்கார்டின் சந்தை ஆதிக்கத்தை சவால் செய்ய பல்வேறு கட்டண முறைகளின் அவசியத்தை எடுத்துக்காட்டுகிறது.",
      "அமெக்ஸ் பிளாட்டினம் கார்டு போன்ற குறிப்பிட்டவை உட்பட கிரெடிட் கார்டுகளைப் பயன்படுத்துவதன் நன்மைகள் மற்றும் தீமைகள் எடைபோடப்படுகின்றன, நிறுவனங்களின் தரவு சேகரிப்பு மற்றும் பணியமர்த்தல் தொடர்பான தனியுரிமை அச்சங்களில் கவனம் செலுத்துகின்றன."
    ],
    "points": 508,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1697398415
  },
  {
    "id": 37891886,
    "title": "ஐரோப்பிய ஒன்றியத்தின் வெகுஜன கண்காணிப்பு மற்றும் குறியாக்க தடை உத்தரவுக்கு எதிராக பின்லாந்து வாக்களிக்கும்",
    "originLink": "https://dawn.fi/uutiset/2023/10/14/eu-csam-suomi-eduskunta-kanta",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37891886",
    "commentBody": "",
    "originSummary": [
      "வலுவான குறியாக்கத்தை தடை செய்வதற்கான ஐரோப்பிய ஒன்றியத்தின் முன்மொழிவு குறித்து பின்லாந்து நாடாளுமன்றத்தின் பெரிய குழு ஆட்சேபனைகளை வெளிப்படுத்தியது, இது இறுதி-இறுதி சைபர் பாதுகாப்பை சமரசம் செய்யக்கூடும் என்று கூறியது.",
      "அவர்கள் ஆன்லைன் குழந்தை பாதுகாப்பிற்கான தங்கள் ஆதரவை மீண்டும் வலியுறுத்தினர், ஆனால் குறியாக்கம் மற்றும் மொத்த கண்காணிப்பு ஆகியவற்றில் எந்தவொரு சமரசத்திற்கும் எதிராக வாதிட்டனர், அதற்கு பதிலாக தெளிவாக அடையாளம் காணப்பட்ட நபர்களில் கவனம் செலுத்த வேண்டும் என்று வாதிட்டனர்.",
      "இந்த சர்ச்சைக்குரிய பிரச்சினையில் ஐரோப்பிய ஒன்றியத்தின் உறுப்பு நாடுகளிடமிருந்து விரைவில் முடிவு எடுக்கப்படும் என்று எதிர்பார்க்கப்படுகிறது."
    ],
    "commentSummary": [
      "வெகுஜன கண்காணிப்பு மற்றும் குறியாக்கத்தை தடை செய்வதை நோக்கமாகக் கொண்ட ஐரோப்பிய ஒன்றிய உத்தரவை பின்லாந்து பகிரங்கமாக எதிர்த்துள்ளது, இது தனியுரிமை உரிமைகளை மீறுகிறது மற்றும் நீதித்துறை வாரண்டுகளை பொது ஸ்கேனிங்குடன் மாற்றுகிறது என்று வாதிட்டுள்ளது.",
      "இந்த விவாதம் தடையை அமல்படுத்துவது, வழக்கமான குடிமக்கள் மீது உளவு பார்ப்பது குறித்து கவலைகளை எழுப்புகிறது, மேலும் முற்றிலும் வெளிப்படையான உலகில் வாழ்வதன் தாக்கங்களை விவாதிக்கிறது.",
      "தனியுரிமையைப் பாதுகாப்பதில் குறியாக்கத்தின் முக்கிய பங்கு, சட்டத்தின் அரசியலமைப்பிற்கு முரணான பண்புகள் மற்றும் வெவ்வேறு நாடுகளிலிருந்து மாறுபட்ட கருத்துக்கள் பற்றிய சொற்பொழிவுகள் உள்ளன. இது ஐரோப்பிய ஒன்றியத்தின் கட்டமைப்பு மற்றும் முடிவெடுக்கும் செயல்முறைகள் பற்றிய வெகுஜன விழிப்புணர்வு இல்லாததையும் கவனத்தை ஈர்க்கிறது."
    ],
    "points": 408,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1697392890
  },
  {
    "id": 37889666,
    "title": "தாமரை 1-2-3 லினக்ஸுக்கு",
    "originLink": "https://lock.cmpxchg8b.com/linux123.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37889666",
    "commentBody": "",
    "originSummary": [
      "இழந்த கோப்புகளை மீட்டெடுப்பதன் மூலமும், பல்வேறு ஹேக்குகளைப் பயன்படுத்துவதன் மூலமும் லோட்டஸ் 1-2-3 என்ற பழங்கால மென்பொருளை லினக்ஸுக்கு போர்ட் செய்ய ஆசிரியர் முடிந்தது.",
      "கணினி அழைப்புகள் மற்றும் பொருள் கோப்பு மாற்றங்களை உள்ளடக்கிய பொருந்தக்கூடிய கவலைகளுக்கு கவனம் செலுத்தப்படுகிறது, அத்துடன் பொருள் கோப்புகளிலிருந்து சின்னங்களை அகற்றுதல் மற்றும் பொருந்தாத செயல்பாடுகளுக்கு ரப்பர்களை எழுதுதல்.",
      "டெர்மியோஸ் மற்றும் உரிமங்கள் தொடர்பான சில போராட்டங்கள் குறிப்பிடப்பட்டுள்ளன, ஆனால் ஒட்டுமொத்தமாக, ஆசிரியர் லினக்ஸுக்கு மாறுவதை ஒரு வெற்றியாகக் கருதுகிறார்."
    ],
    "commentSummary": [
      "லினக்ஸிற்கான விரிதாள் நிரலான லோட்டஸ் 1-2-3 கிடைப்பதை இந்த கட்டுரை அறிவிக்கிறது, தரவைப் பாதுகாப்பதில் அதன் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "இந்த உரையாடல் கடந்த கால பொதுபல சேனா (புல்லட்டின் போர்டு சிஸ்டம்) காட்சியின் மீதான ஏக்கத்தையும் சுற்றி சுழல்கிறது, அதன் நெறிமுறைகள் மற்றும் 80/90 களின் ரெட்ரோ கலாச்சாரத்தின் மறுமலர்ச்சியை எடுத்துக்காட்டுகிறது.",
      "மென்பொருள் திருட்டு, தொகுப்பு கையேடுகளின் காப்பகம், தனிப்பட்ட நிகழ்வுகள், இலக்கு விளம்பரங்கள் மற்றும் தொழில்நுட்ப நிறுவனங்களின் சாத்தியமான கையாளுதல் பற்றிய சிக்கல்களும் கட்டுரையில் விவாதிக்கப்படுகின்றன."
    ],
    "points": 344,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1697377521
  },
  {
    "id": 37890176,
    "title": "Signtime.apple: Apple ஆல் ஒன்-ஆன்-ஒன் சைகை மொழி விளக்கம்",
    "originLink": "https://www.signtime.apple/applecare/us-EN/asl",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890176",
    "commentBody": "",
    "originSummary": [
      "ஷாப்பிங் மற்றும் ஆதரவு அமர்வுகளுக்கு ஒருவருக்கொருவர் சைகை மொழி விளக்கத்தை வழங்கும் சேவையான 'சைன்டைம்' தற்போது கிடைக்கவில்லை.",
      "பயனர்கள் பின்னர் சேவையை அணுக மீண்டும் முயற்சிக்க அறிவுறுத்தப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "குறிப்பாக அமெரிக்க சைகை மொழியை (ஏஎஸ்எல்) பயன்படுத்தும் வாடிக்கையாளர்களுக்கு சேவை செய்வதற்காக வாடிக்கையாளர் ஆதரவுக்கான தனிப்பட்ட சைகை மொழி விளக்கத்தை வழங்க வடிவமைக்கப்பட்ட சைன்டைம்.ஆப்பிள் என்ற புதிய சேவையை ஆப்பிள் அறிமுகப்படுத்தியுள்ளது.",
      "காது கேளாத அல்லது காது கேளாத வாடிக்கையாளர்கள் வீடியோ அரட்டை மூலம் ஏஎஸ்எல் பயன்படுத்தி ஆப்பிள் பிரதிநிதிகளுடன் தொடர்பு கொள்ள இந்த சேவை உதவுகிறது, தொலைபேசி அழைப்புகளின் போது எழுத்துப்பூர்வ தகவல்தொடர்பு அல்லது மொழிபெயர்ப்பாளர்களின் தேவையை மாற்றுகிறது.",
      "சாத்தியமான ஸ்பேம் அழைப்புகள், தணிக்கை தடங்கள் மற்றும் துஷ்பிரயோகம் குறித்த கவலைகள் உள்ளன, அத்துடன் ஆப்பிளின் டொமைன் பெயர்கள் மற்றும் பாதுகாப்பு தாக்கங்கள் குறித்த குழப்பங்கள் உள்ளன. இருப்பினும், தரம் மற்றும் வாடிக்கையாளர் அனுபவத்திற்கான ஆப்பிளின் அர்ப்பணிப்பு நேர்மறையாக அங்கீகரிக்கப்பட்டுள்ளது."
    ],
    "points": 269,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1697380975
  },
  {
    "id": 37892028,
    "title": "SSH-தணிக்கை: SSH சேவையகம் மற்றும் கிளையன்ட் பாதுகாப்பு தணிக்கை",
    "originLink": "https://github.com/jtesta/ssh-audit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37892028",
    "commentBody": "",
    "originSummary": [
      "எஸ்.எஸ்.எச் சேவையகம் மற்றும் கிளையன்ட் உள்ளமைவுகளை தணிக்கை செய்வதற்கான மேம்பாடுகளுடன் களஞ்சியம் ஜே.டி.எஸ்.ஏ / எஸ்.எஸ்.எச்-தணிக்கை புதுப்பிக்கப்பட்டுள்ளது, இப்போது பைத்தான் 3.7-3.11 ஐ ஆதரிக்கிறது.",
      "புதுப்பிப்புகளில் பரிந்துரைகள், பாதுகாப்பு தகவல்கள், முன்பே கட்டப்பட்ட தொகுப்புகள், வலை முன்முனை, புதிய கொள்கைகள், பிழை திருத்தங்கள் மற்றும் உபுண்டு 22.04 எல்.டி.எஸ்ஸில் மேம்பட்ட பொருந்தக்கூடிய தன்மை ஆகியவை அடங்கும்.",
      "இது விரிவாக்கப்பட்ட ஹோஸ்ட் விசைகள், முக்கிய பரிமாற்றங்கள், சைபர்கள், எம்ஏசிகள், கிளையன்ட் மென்பொருள் தணிக்கை மற்றும் மேலும் பல்துறைக்கான ஜேஎஸ்ஓஎன் வெளியீடு விருப்பத்தையும் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த உரையாடல் SSH சேவையகங்கள் மற்றும் வாடிக்கையாளர்களைப் பாதுகாப்பதன் முக்கியத்துவத்தை மையமாகக் கொண்டுள்ளது, இயல்புநிலை அமைப்புகளின் பாதுகாப்பில் உள்ள சிக்கல்களை முன்னிலைப்படுத்துகிறது.",
      "வெவ்வேறு வழிமுறைகளின் பயன்பாடு மற்றும் Ed25519 விசைகளின் நம்பகத்தன்மை ஆகியவை விவாதத்திற்கு கொண்டு வரப்படுகின்றன.",
      "கிரிப்டோகிராஃபிக் நெறிமுறைகளில் முதல் பயன்பாட்டின் மீதான நம்பிக்கையின் (டோஃபு) பாதுகாப்பு மற்றும் மேலும் சரிபார்ப்பு நடவடிக்கைகள் தேவையா என்பது குறித்து மாறுபட்ட கருத்து உள்ளது."
    ],
    "points": 250,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1697393924
  },
  {
    "id": 37890742,
    "title": "Omnivore – இலவச, திறந்த மூல, படிக்க-இட்-பிந்தைய பயன்பாடு",
    "originLink": "https://omnivore.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890742",
    "commentBody": "",
    "originSummary": [
      "உள்நுழைவு ஆம்னிவோர் என்பது விரிவான வாசகர்களுக்கான ஒரு திறந்த மூல வாசிப்பு-இட்-பிந்தைய பயன்பாடாகும், இது பிற்கால, கவனச்சிதறல் இல்லாத வாசிப்பிற்காக பல்வேறு வகையான உள்ளடக்கத்தை சேமிக்க அனுமதிக்கிறது.",
      "பயனர்கள் குறிப்புகள் மற்றும் சிறப்பம்சங்களைச் சேர்ப்பது மட்டுமல்லாமல், அனைத்து சாதனங்களிலும் தங்கள் வாசிப்பு பட்டியல்களை ஒழுங்கமைத்து ஒத்திசைக்கலாம்.",
      "பயன்பாட்டில் உரை-க்கு-பேச்சு செயல்பாடு மற்றும் பிரபலமான தனிப்பட்ட அறிவு மேலாண்மை (பி.கே.எம்) அமைப்புகளுடன் ஒருங்கிணைப்பு ஆகியவை உள்ளன, இது பயனர்களுக்கு அவர்களின் வாசிப்பு நூலகத்தின் மீது முழுமையான கட்டுப்பாட்டை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஆம்னிவோர் என்பது ஆர்.எஸ்.எஸ் மற்றும் மின்னஞ்சல் செய்திமடல்களுடன் இணைக்கும் ஒரு இலவச, திறந்த மூல வாசிப்பு-இட்-பிந்தைய பயன்பாடாகும், ஆனால் பயனர்கள் அதன் எதிர்கால பணமாக்கல் மூலோபாயம் மற்றும் சில அம்சங்கள் இல்லாதது குறித்து கவலைகளை எழுப்பியுள்ளனர்.",
      "பயன்பாடு தற்போது ஐஓஎஸ் ஐ மட்டுமே ஆதரிக்கிறது, ஆனால் டெவலப்பர்கள் விண்டோஸ் பதிப்பைத் தொடங்க திட்டமிட்டுள்ளனர். சிறப்பம்சங்களை ஏற்றுமதி செய்யும் திறன், ஒப்சிடியன் மற்றும் நோசினுக்கான செருகுநிரல்களைப் பயன்படுத்துதல் மற்றும் சுய ஹோஸ்ட் சேவையகங்கள் ஆகியவை தனித்துவமான அம்சங்களில் அடங்கும்.",
      "ஆம்னிவோர் பாக்கெட், Raindrop.io, இன்ஸ்டாபேப்பர் மற்றும் ரீட்வைஸ் போன்ற பயன்பாடுகளுடன் போட்டியிடுகிறது. போட்டியாளர்களுடன் ஒப்பிடும்போது பயனர்கள் அதன் சுய ஹோஸ்டிங் வழிமுறைகளை சிக்கலானதாகக் கண்டாலும், அதன் நிதி மாதிரி தெளிவற்றதாகவே உள்ளது."
    ],
    "points": 244,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1697384913
  },
  {
    "id": 37890369,
    "title": "ஸ்டார்ம்ஃபீல்டில் மார்க் ட்வெய்ன் (1909) [வீடியோ]",
    "originLink": "https://www.youtube.com/watch?v=leYj--P4CgQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890369",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பழைய திரைப்படங்களை மேம்படுத்த செயற்கை நுண்ணறிவு போன்ற மேம்பட்ட தொழில்நுட்பங்களைப் பயன்படுத்துவது முக்கிய தலைப்பு, குறிப்பாக 1909 முதல் மார்க் ட்வெயினின் மேம்படுத்தப்பட்ட கிளிப்.",
      "ஒரு சிறந்த பார்வை அனுபவத்திற்கான மேம்பாடுகளுக்கு ஆதரவானவர்களுக்கும், வரலாற்று துல்லியம் மற்றும் அசல் கலை நோக்கத்தைப் பாதுகாப்பதற்கு ஆதரவளிப்பவர்களுக்கும் இடையே கண்ணோட்டங்கள் வேறுபடுகின்றன.",
      "திரைப்பட வண்ணமயமாக்கல் மற்றும் நவீன இசையைச் சேர்ப்பது ஆகியவற்றுடன், திரைப்படங்களில் வரலாற்று நபர்களைப் பிரதிபலிப்பதில் செயற்கை நுண்ணறிவைப் பயன்படுத்துவது வரை விவாதம் விரிவடைகிறது, செயற்கை நுண்ணறிவு உருவாக்கிய படங்களின் துல்லியம் மற்றும் நம்பகத்தன்மை குறித்து கேள்விகளை எழுப்புகிறது."
    ],
    "points": 209,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1697382519
  },
  {
    "id": 37890685,
    "title": "தரவு விஞ்ஞானிகளின் குருட்டு புள்ளியாக காரண அனுமானம்",
    "originLink": "https://dzidas.com/ml/2023/10/15/blind-spot-ds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37890685",
    "commentBody": "",
    "originSummary": [
      "தரவு அறிவியல் மற்றும் வணிக முடிவு எடுப்பதில் காரண அனுமானத்தின் முக்கியத்துவத்தை இந்த கட்டுரை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "தரவு அறிவியல் சமூகம் சமீபத்தில் காரண அனுமானத்திற்கு முன்னுரிமை அளிக்கிறது, காரண வரைகலை மாதிரிகள், கருவி மாறிகள் மற்றும் டபுள்எம்எல் போன்ற முறைகளைப் பயன்படுத்தி அதை செயல்படுத்துகிறது.",
      "காரண அனுமானத்தில் குழப்பமான மாறுபாடுகளைப் பற்றி சிந்திப்பதை கதை வலியுறுத்துகிறது, கூடுதல் கற்றலுக்கான ஆதாரங்களை வழங்குகிறது."
    ],
    "commentSummary": [
      "உரையாடல்கள் முடிவெடுப்பதிலும் தரவு பகுப்பாய்விலும் காரண அனுமானத்தின் முக்கியத்துவம், தடைகள் மற்றும் தடைகளை மையமாகக் கொண்டுள்ளன.",
      "சீரற்ற கட்டுப்பாட்டு சோதனைகள் (ஆர்.சி.டி) தங்க தரமாகக் கருதப்படுகின்றன, ஆனால் அவை விலையுயர்ந்தவை மற்றும் நேரம் தீவிரமானவை. அவதானிப்பு காரண அனுமானம், விரைவான, குறைந்த செலவுடைய மாற்றாக, இன்னும் பரவலாக ஏற்றுக்கொள்ளப்படவில்லை.",
      "காரண அனுமானத்தை மிகவும் அணுகக்கூடியதாகவும் பிரதிபலிக்கக்கூடியதாகவும் மாற்றுவதற்கான முயற்சிகள் நடந்து வருகின்றன, ஆனால் மாதிரி மதிப்பீடு மற்றும் அளவிடுதல் போன்ற சிக்கல்கள் இன்னும் உள்ளன. தரவு விளக்கத்தில் காரண அனுமானத்தின் பயன்பாடு மற்றும் சாத்தியக்கூறு குறித்தும் கருத்து வேறுபாடு உள்ளது."
    ],
    "points": 198,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1697384599
  },
  {
    "id": 37891020,
    "title": "ஏன் அசிங்க் ரஸ்ட்?",
    "originLink": "https://without.boats/blog/why-async-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37891020",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை ரஸ்ட் நிரலாக்க மொழியில் ஒத்திசைவு வழிமுறைகளின் பயன்பாடு மற்றும் பரிணாமத்தை ஆராய்கிறது, குறிப்பாக அசிங்க் / காத்திருப்பு தொடரமைப்பில் கவனம் செலுத்துகிறது.",
      "இது சிக்கலான எதிர்காலங்களை உருவாக்குவதில் உள்ள சவால்கள், பச்சை நூல்களிலிருந்து மாறுதல் மற்றும் ஐட்டரேட்டர்கள் மற்றும் எதிர்காலங்கள் அரசு இயந்திரங்களாக எவ்வாறு தொகுக்கப்படுகின்றன என்பதை ஆராய்கிறது.",
      "நெட்வொர்க் சேவைகளில் ரஸ்ட் வெற்றிகரமாகப் பயன்படுத்தப்படுவது பற்றிய விளக்கத்துடன், ஆசிரியர் ரஸ்ட் சுற்றுச்சூழல் அமைப்பு அசிங்க் / காத்திருப்பை அதிகமாக சார்ந்துள்ளது குறித்த கவலைகளையும் எழுப்புகிறார், மேலும் அதற்கு சாத்தியமான மேம்பாடுகளை முன்மொழிகிறார்."
    ],
    "commentSummary": [
      "இந்த விவாதம் ரஸ்டில் அசிங்க் நிரலாக்கத்தைப் பயன்படுத்துவதன் நன்மைகள் மற்றும் சிக்கல்கள் தொடர்பானது, அதன் தூய்மையான கலவை, எளிதான ரத்து மற்றும் நூல்களுடன் ஒப்பிடும்போது நினைவகம் குறைதல் ஆகியவற்றை வலியுறுத்துகிறது.",
      "இந்த உரையாடல் சூழல் மாற்றத்தின் சிரமங்கள், ரஸ்டில் உள்ள HTTP சேவையகங்களைத் தேர்ந்தெடுப்பது மற்றும் மொழியில் அசிங்க் / காத்திருப்பு அதிகரித்து வரும் பரவல் ஆகியவற்றை நிவர்த்தி செய்கிறது.",
      "நினைவக பாதுகாப்பில் கவனம் செலுத்தும் வலை மேம்பாடு மற்றும் பாதுகாப்பான அமைப்புகளில் ரஸ்ட் பயன்படுத்துவது குறித்து விவாதம் உள்ளது; இந்த உரையாடல் ரஸ்ட் பல்வேறு களங்களில் பரந்த தத்தெடுப்பைப் பெறுவதற்கான சாத்தியத்தை அடிக்கோடிட்டுக் காட்டுகிறது."
    ],
    "points": 192,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1697386709
  },
  {
    "id": 37895446,
    "title": "காக்பிட்: சேவையகங்களுக்கான வலை அடிப்படையிலான வரைகலை இடைமுகம்",
    "originLink": "https://cockpit-project.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37895446",
    "commentBody": "",
    "originSummary": [
      "காக்பிட் என்பது சேவையகங்களுக்கான பயனர் நட்பு, வலை அடிப்படையிலான வரைகலை இடைமுகமாகும், இது பயனர்கள் தங்கள் கணினிகளை GUI வழியாக நிர்வகிக்க அனுமதிக்கிறது, ஆனால் இது ஏற்கனவே உள்ள கட்டளை வரி கருவி பணிப்பாய்வுகளை முழுமையாக ஆதரிக்கிறது.",
      "இது நெட்வொர்க் உள்ளமைவு, சேமிப்பக மேலாண்மை, மெய்நிகர் இயந்திர உருவாக்கம், சரிசெய்தல் மற்றும் பயன்பாடுகள் மற்றும் தனிப்பயன் தொகுதிகளுடன் செயல்பாடுகளை மேம்படுத்துதல் உள்ளிட்ட பல்வேறு அம்சங்களைக் கொண்டுள்ளது.",
      "மென்பொருள் கணினி ஏபிஐக்கள் மற்றும் கட்டளைகளைப் பயன்படுத்துகிறது, ஒற்றை உள்நுழைவு அங்கீகாரத்தை ஆதரிக்கிறது, வளங்களைப் பாதுகாக்க தேவைக்கேற்ப இயங்குகிறது, மேலும் முக்கிய விநியோகங்கள் மற்றும் வலை உலாவிகளில் இணக்கமானது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை சேவையக நிர்வாகத்திற்கான வலை அடிப்படையிலான இடைமுகமான காக்பிட் உடனான பயனர் அனுபவங்களை ஆராய்கிறது, கலவையான பதில்களை முன்னிலைப்படுத்துகிறது.",
      "இதேபோன்ற கருவிகளுடன் ஒப்பிடும்போது அதன் ஒப்பீட்டளவில் மெதுவான வளர்ச்சி மற்றும் குறைந்த அம்சங்களைச் சுற்றி விமர்சனங்கள் சுழல்கின்றன, ஆனால் மற்றவர்கள் லிப்விர்ட் மற்றும் கே.வி.எம் ஆகியவற்றின் தொலைதூர நிர்வாகத்திற்காக இதைப் பாராட்டுகிறார்கள்.",
      "காக்பிட்டைப் பயன்படுத்துவதில் ஆசிரியரின் தனிப்பட்ட அனுபவமும் குறிப்பிடப்பட்டுள்ளது, ஃபெடோராவை இயக்கும் அவர்களின் ராஸ்பெர்ரி பையில் இது எளிதானது, ஆனால் டோஸ் ஆதரவை விரும்புகிறது."
    ],
    "points": 191,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1697424501
  },
  {
    "id": 37888606,
    "title": "ஆங்கிலம் பேசுபவர்களுக்கான \"ஊடாடும்\" இத்தாலிய கவிதைகள்",
    "originLink": "https://italianpoetry.it/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37888606",
    "commentBody": "",
    "originSummary": [
      "விரிவான மொழிபெயர்ப்புகள், பயன்பாட்டுக் குறிப்புகள் மற்றும் கூடுதல் சூழல் ஆகியவற்றை வழங்குவதன் மூலம் இத்தாலிய கவிதையை ஆங்கிலம் பேசுபவர்களுக்கு ஜீரணிக்கக்கூடியதாக மாற்றுவதை நோக்கமாகக் கொண்ட ஒரு கருவியை ஆசிரியர் உருவாக்கியுள்ளார்.",
      "இந்த கருவி எளிய தொழில்நுட்பத்தைப் பயன்படுத்தி உருவாக்கப்பட்டது, இது பயனர் நட்பு வழிசெலுத்தல் மற்றும் அணுகலுக்கான திறனைக் குறிக்கிறது.",
      "இந்த கருவியை தொடர்ந்து மேம்படுத்துவதற்கான அவர்களின் நோக்கத்தை சுட்டிக்காட்டி, அவர்கள் தங்கள் வழிமுறை குறித்து தீவிரமாக கருத்துக்களைத் தேடுகிறார்கள்."
    ],
    "commentSummary": [
      "ItalianPoetry.it என்பது ஒரு ஆன்லைன் தளமாகும், இது ஆங்கிலம் பேசுபவர்களை இத்தாலிய கவிதைகளை ஆராயவும் கேட்கவும் அனுமதிக்கிறது, லத்தீன் மற்றும் ஜெர்மன் ஆகியவற்றை உள்ளடக்கிய அதன் வழங்கலை விரிவுபடுத்தும் திட்டங்களுடன்.",
      "பயனர்கள் வலைத்தளத்திற்கு நேர்மறையான கருத்துக்களை வழங்கியுள்ளனர், மேலும் பின்னணிக்கான மேம்பட்ட வேக விருப்பங்கள் மற்றும் கவிஞர்கள் தங்கள் படைப்புகளை வாசிக்கும் வீடியோக்கள் உள்ளிட்ட மேம்பாடுகளை அவர்கள் பரிந்துரைத்துள்ளனர்.",
      "வலைத்தளத்தின் படைப்பாளி அதன் கவிதை களஞ்சியத்தை பகிரங்கப்படுத்த திட்டமிட்டுள்ளார், பயனர்கள் குறிப்பிட்ட படைப்புகளுக்கான கோரிக்கைகளை சமர்ப்பிக்க அனுமதிக்கிறது, இது மிகவும் ஒத்துழைப்பு, பயனர் பதிலளிக்கும் தளத்தை நோக்கிய நகர்வைக் குறிக்கிறது."
    ],
    "points": 174,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1697366233
  },
  {
    "id": 37893555,
    "title": "இன்டெல் 8088 அடிப்படையிலான கணினிகளுக்கான ஜிபிஎல்-3.0 உரிமம் பெற்ற பயாஸ்",
    "originLink": "https://github.com/skiselev/8088_bios",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37893555",
    "commentBody": "",
    "originSummary": [
      "கிட்ஹப் களஞ்சியம் மைக்ரோ 8088, NuXT மற்றும் Xi 8088 அமைப்புகளுக்கான திறந்த மூல BIOS ஐ வழங்குகிறது, இதில் பங்களிப்புகள், BIOS படங்கள், கட்டுமான வழிமுறைகள் மற்றும் வெவ்வேறு பதிப்பின் வெளியீட்டு குறிப்புகள் ஆகியவை அடங்கும்.",
      "இந்த களஞ்சியம் அதன் வளர்ச்சிக்கும் வாழ்வாதாரத்திற்கும் முக்கிய பங்கு வகித்த பங்களிப்பாளர்களை அங்கீகரிக்கிறது.",
      "இந்த களஞ்சியம் எதிர்கால புதுப்பிப்புகள் மற்றும் செய்ய வேண்டிய மேம்பாடுகளை கோடிட்டுக் காட்டுகிறது, இது ஒரு தொடர்ச்சியான திட்டம் என்பதைக் குறிக்கிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை இன்டெல் 8088 அடிப்படையிலான கணினிகளுக்காக வடிவமைக்கப்பட்ட ஜிபிஎல் -3.0 உரிமம் பெற்ற பயாஸைப் பற்றி விவாதிக்கிறது, இது ரோம் பேசிக்கைத் தவிர்த்தது மற்றும் இந்த பயாஸ் ரோம்-சாத்தியமானதாக மாற்றும் திறனைக் குறிப்பிடுகிறது.",
      "இது 8088 மற்றும் 8086 சிபியூக்களை ஒப்பிடுகிறது, வேறுபாடுகளை முன்னிலைப்படுத்துகிறது, மேலும் திறந்த மூல பயாஸ் உள்ளிட்ட தொடர்புடைய திட்டங்களை ஆராய்கிறது.",
      "நாசா ஐபிஎம் பிசி மற்றும் எக்ஸ்டி அமைப்புகளைப் பயன்படுத்துவது, புத்தகம் 8088 இல் ஒரு பிழை, ஓவர்லாக் செயல்முறை மற்றும் 8088 சிபியுவில் குனு சூழலை இயக்குவது பற்றி குறிப்பிடப்பட்டுள்ளது."
    ],
    "points": 165,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1697405427
  },
  {
    "id": 37889844,
    "title": "டிஜிட்டல் குடிமக்களுக்கான ஒரு முக்கிய திறனாக விமர்சன புறக்கணிப்பு",
    "originLink": "https://journals.sagepub.com/doi/10.1177/09637214221121570",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37889844",
    "commentBody": "",
    "originSummary": [
      "தவறான மற்றும் குறைந்த தரமான தகவல்களை வடிகட்டுவதை நோக்கமாகக் கொண்ட டிஜிட்டல் குடியுரிமை திறனான \"விமர்சன புறக்கணிப்பின்\" மதிப்பை இந்த கட்டுரை அடிக்கோடிட்டுக் காட்டுகிறது.",
      "கல்வி நிறுவனங்களில் இந்த திறன்களை கற்பிப்பதற்கான பரிந்துரைகள் மற்றும் மெய்நிகர் தளங்களில் உள்ளடக்க-மிதப்படுத்தல் கொள்கைகளை செயல்படுத்துவதற்கான பரிந்துரைகளுடன் சுய-தூண்டுதல், பக்கவாட்டு வாசிப்பு மற்றும் தீங்கிழைக்கும் நடிகர்களை புறக்கணிப்பது ஆகியவை பரிந்துரைக்கப்படும் முறைகளில் அடங்கும்.",
      "தவறான தகவல்களிலிருந்து பாதுகாக்க புதிய மனப் பழக்கங்களை வளர்ப்பதை வலியுறுத்தும் கட்டுரை, தவறான தகவல்களின் பல்வேறு அம்சங்கள் மற்றும் அதை எதிர்கொள்வதற்கான உத்திகள் குறித்த பல்வேறு குறிப்புகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸில் உள்ள விவாதங்கள் டிஜிட்டல் குடிமக்களுக்கு உற்பத்தியற்ற ஆன்லைன் உரையாடல்களைத் தவிர்ப்பதற்கான ஒரு முக்கியமான திறனாக \"விமர்சன புறக்கணிப்பு\" மீது கவனம் செலுத்துகின்றன.",
      "வலுவான சமூக விதிமுறைகள், ஆபாசம் மற்றும் கிண்டல் இல்லாத கண்ணியமான தகவல்தொடர்பு மற்றும் இணக்கமான சொற்பொழிவு ஆகியவற்றின் அவசியம் எடுத்துரைக்கப்படுகிறது. ஆன்லைன் மன்றங்களின் வரம்புகள் ஏற்றுக்கொள்ளப்படுகின்றன.",
      "கவன ஈர்ப்பு பொருளாதாரம் மற்றும் விளம்பரத்தின் விளைவுகள், ஊடக எழுத்தறிவின் முக்கியத்துவம், தகவல்களின் விமர்சன மதிப்பீடு, சமூக தளங்களில் தவறான தகவல்களின் ஆபத்து மற்றும் தரமான உள்ளடக்கத்திற்கு முன்னுரிமை அளிக்க வேண்டியதன் அவசியம் ஆகியவற்றையும் விவாதம் முன்னிலைப்படுத்துகிறது."
    ],
    "points": 161,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1697378826
  },
  {
    "id": 37894403,
    "title": "MemGPT: எல்எல்எம்களை இயக்க முறைமைகளாக நோக்கி",
    "originLink": "https://arxiv.org/abs/2310.08560",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37894403",
    "commentBody": "",
    "originSummary": [
      "பெரிய மொழி மாதிரிகளின் (எல்.எல்.எம்) செயல்திறனை மேம்படுத்த வடிவமைக்கப்பட்ட ஒரு அமைப்பான மெம்ஜிபிடியை அவற்றின் கட்டுப்படுத்தப்பட்ட சூழல் சாளரத்திற்குள் நீட்டிக்கப்பட்ட சூழலை வழங்குவதன் மூலம் இந்த கட்டுரை வழங்குகிறது.",
      "பாரம்பரிய இயக்க முறைமைகளில் படிநிலை நினைவக அமைப்புகளால் ஈர்க்கப்பட்ட, மெம்ஜிபிடி மேம்பட்ட செயல்திறனுக்காக மெய்நிகர் சூழல் மேலாண்மையைப் பயன்படுத்துகிறது.",
      "ஆவண பகுப்பாய்வு மற்றும் பல அமர்வு அரட்டை போன்ற களங்களில் மதிப்பிடப்பட்ட இந்த அமைப்பு, தற்போதைய எல்.எல்.எம்களின் வரம்புகளுக்கு அப்பால் சிறந்த திறன்களைக் காட்டியது. MemGPT குறியீடு மற்றும் தரவு இப்போது பொது பரிசோதனைக்கு கிடைக்கிறது."
    ],
    "commentSummary": [
      "மெம்ஜிபிடி, ஒரு திறந்த மூல திட்டம், இயக்க முறைமைகள் போன்ற மொழி மாதிரிகளுக்கு நினைவக மேலாண்மையைக் கற்பிப்பதை நோக்கமாகக் கொண்டுள்ளது, இது செயல்படுத்தப்பட்ட டிஸ்கார்ட் சாட்போட்டைக் கொண்டுள்ளது.",
      "மொழி மாதிரிகளின் செயல்திறன் குறித்த மாறுபட்ட கருத்துக்களை ஆராய்ந்து, மாதிரி அதன் சொந்த நினைவகத்தை நிர்வகிப்பது அல்லது இந்த பணிக்கு ஒரு தனி முகவரைக் கொண்டிருப்பது ஆகியவற்றுக்கு இடையிலான வர்த்தகத்தை இந்த விவாதம் ஆராய்கிறது.",
      "இந்த உரையாடல் ஆராய்ச்சியில் தெளிவான தகவல்தொடர்பின் அவசியத்தையும் வலியுறுத்துகிறது, செயற்கை நுண்ணறிவு மாதிரிகளில் அடையாள வரம்புகளை சமாளிக்கும் ஒரு முறையான \"மெய்நிகர் சூழல் மேலாண்மை\" என்ற கருத்தை அறிமுகப்படுத்துகிறது."
    ],
    "points": 156,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1697412795
  },
  {
    "id": 37888948,
    "title": "'பைரசி கூற்றுக்கள் மூலம் இணைய அணுகலை நிறுத்துவது கடுமையானது மற்றும் மிகைப்படுத்தப்பட்டது'",
    "originLink": "https://torrentfreak.com/terminating-internet-access-over-piracy-claims-is-drastic-and-overbroad-231014/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37888948",
    "commentBody": "",
    "originSummary": [
      "இணைய சேவை வழங்குநர் (ஐஎஸ்பி), கிராண்டே கம்யூனிகேஷன்ஸ், பதிவு செய்யப்பட்ட லேபிள்களுக்கு செலுத்த வேண்டிய 47 மில்லியன் டாலர் பைரசி சேத வழக்கை எதிர்க்கிறது, மூன்றாம் தரப்பு உரிமைகோரல்களின் அடிப்படையில் பதிப்புரிமை மீறல்களுக்கு ஐஎஸ்பிக்கள் பொறுப்பேற்கக்கூடாது என்று வாதிடுகிறது.",
      "பதிப்புரிமை உரிமைகோரல்கள் காரணமாக இணைய அணுகலை நிறுத்துவது மிகவும் பரந்தது, அப்பாவி பயனர்களை பாதிக்கிறது மற்றும் பிராட்பேண்ட் உள்கட்டமைப்பு முதலீட்டை கட்டுப்படுத்துகிறது என்று வலியுறுத்தி, ட்விட்டருக்கு ஆதரவான சமீபத்திய உச்ச நீதிமன்ற தீர்ப்பை கிராண்டே மேற்கோள் காட்டுகிறார்.",
      "கிராண்டேவை ஆதரிக்கும் பல தொலைத் தொடர்புத் துறை குழுக்களும் உச்ச நீதிமன்றத் தீர்ப்பைக் குறிப்பிடுகின்றன, கிராண்டே மீது திருட்டுப் பொறுப்பு சுமத்துவது ஒரு தவறாக இருக்கலாம் என்று கூறுகின்றன."
    ],
    "commentSummary": [
      "பைரசி கூற்றுக்கள் காரணமாக இணைய அணுகல் நிறுத்தப்படும் அச்சுறுத்தலையும், நியாயமான ஆன்லைன் சூழலை பராமரிக்க நெட் நியூட்ராலிட்டியின் அவசியத்தையும் இந்த கட்டுரை எடுத்துக்காட்டுகிறது.",
      "பதிப்புரிமை சட்டங்கள் மற்றும் அறிவுசார் சொத்து தொடர்பான தரவு பரிமாற்றங்களைக் கண்காணிப்பதில் இணைய சேவை வழங்குநர்களின் (ஐஎஸ்பி) சர்ச்சைக்குரிய பங்கை இது கவனத்திற்குக் கொண்டுவருகிறது.",
      "டிஜிட்டல் யுகத்திற்கு ஏற்ற வகையில் தற்போதுள்ள பதிப்புரிமைக் கொள்கைகளை மறுமதிப்பீடு செய்ய வேண்டும் என்றும், திருட்டு நெறிமுறைகள் மற்றும் உள்ளடக்க உருவாக்குநர்கள் மீதான தாக்கங்கள் பற்றிய விவாதங்கள் நடைபெற வேண்டும் என்றும் இக்கட்டுரை கோருகிறது."
    ],
    "points": 154,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1697370217
  }
]
