[
  {
    "id": 38344196,
    "title": "ساتيا ناديلا يؤكد من جديد التزامه بشراكة OpenAI ، ويعرب عن ثقته في خارطة طريق المنتج",
    "originLink": "https://twitter.com/satyanadella/status/1726509045803336122",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38344196",
    "commentBody": "",
    "originSummary": [
      "يؤكد الرئيس التنفيذي لشركة Microsoft ، ساتيا ناديلا ، التزام الشركة القوي بشراكتها مع OpenAI.",
      "يعرب ناديلا عن ثقته في خارطة طريق منتجات OpenAI وقدرتها على دفع الابتكار.",
      "تظل Microsoft مكرسة لدعم عملائها وشركائها ، ويتطلع ناديلا إلى التعرف على Emmett ، الذي لم يتم الكشف عن هويته في النص."
    ],
    "commentSummary": [
      "أثار توظيف مايكروسوفت لشخصيات رئيسية من OpenAI مخاوف بشأن إعطاء الأولوية للربح على الأخلاق واستقلالية OpenAI.",
      "تدور المناقشات حول هيمنة مايكروسوفت ، وانتقادات منتجاتها ، والآثار الاجتماعية والاقتصادية الأوسع.",
      "الدوافع وراء الاستحواذ والتأثير المحتمل على تكنولوجيا وموارد OpenAI هي مواضيع للمناقشة."
    ],
    "points": 782,
    "commentCount": 655,
    "retryCount": 0,
    "time": 1700466973
  },
  {
    "id": 38335255,
    "title": "StyleTTS2: تحقيق توليف تحويل النص إلى كلام شبيه بالإنسان مع نشر الأسلوب والتدريب العدائي",
    "originLink": "https://github.com/yl4579/StyleTTS2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38335255",
    "commentBody": "",
    "originSummary": [
      "StyleTTS 2 هو نموذج لتحويل النص إلى كلام يستخدم نشر النمط والتدريب العدائي مع نماذج لغة الكلام الكبيرة (SLMs) لتحقيق توليف TTS واقعي وشبيه بالإنسان.",
      "يمكن للنموذج إنشاء النمط المناسب للنص بدون خطاب مرجعي ، متجاوزا التسجيلات البشرية على مجموعات البيانات ذات المتحدث الواحد والتسجيلات البشرية المطابقة على مجموعات البيانات متعددة المتحدثين.",
      "كما أنه يتفوق على النماذج السابقة لتكييف مكبر الصوت بدون طلقة ، وتوفر الورقة إرشادات للتدريب والاستدلال ، إلى جانب نماذج مسبقة التدريب قابلة للتنزيل."
    ],
    "commentSummary": [
      "يشارك المستخدمون في محادثة حول StyleTTS2 ، وهو نظام تحويل النص إلى كلام مفتوح المصدر ، ويناقشون أدائه وقيوده وتطبيقاته المحتملة.",
      "كما يتم استكشاف مشكلات الكمون ونماذج التدريب للمحادثة الطبيعية واستخدام الأدوات والتقنيات الأخرى مع StyleTTS2.",
      "تتعمق المحادثة في الاعتبارات الأخلاقية لتقنية TTS ، وتأثيرها على صناعات مثل التمثيل الصوتي ، ومتطلبات الأجهزة ، والتكامل مع Android ، وقيود الترخيص."
    ],
    "points": 588,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1700415633
  },
  {
    "id": 38342643,
    "title": "تعيين إيميت شير رئيسا تنفيذيا مؤقتا لشركة OpenAI مع مغادرة ألتمان",
    "originLink": "https://www.theverge.com/2023/11/20/23967515/sam-altman-openai-board-fired-new-ceo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38342643",
    "commentBody": "",
    "originSummary": [
      "سام ألتمان ، الرئيس التنفيذي السابق لشركة OpenAI ، لن ينضم إلى الشركة.",
      "تم تعيين إيميت شير ، المؤسس المشارك والرئيس التنفيذي السابق لشركة Twitch ، رئيسا تنفيذيا مؤقتا.",
      "ينضم ألتمان والمؤسس المشارك لشركة OpenAI جريج بروكمان إلى Microsoft لرئاسة فريق أبحاث الذكاء الاصطناعي المتقدم الجديد."
    ],
    "commentSummary": [
      "تتضمن المناقشة حول OpenAI موضوعات مثل تغييرات القيادة ، ومغادرة الموظفين ، والمخاوف بشأن تطوير الذكاء الاصطناعي والسلامة.",
      "تختلف الآراء حول أهمية الولاء والثقة والتنظيم الحكومي.",
      "كما تمت مناقشة تأثير Twitter ومشاركة Microsoft والمنافسة المحتملة في صناعة الذكاء الاصطناعي."
    ],
    "points": 496,
    "commentCount": 840,
    "retryCount": 0,
    "time": 1700457597
  },
  {
    "id": 38331200,
    "title": "دورة التعلم العميق: إطار عمل PyTorch ، جامعة جنيف",
    "originLink": "https://fleuret.org/dlc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38331200",
    "commentBody": "",
    "originSummary": [
      "تقدم جامعة جنيف دورة تعليمية عميقة يدرسها فرانسوا فلوريت ، مع التركيز على إطار عمل PyTorch.",
      "تغطي الدورة موضوعات مثل عمليات الموتر ، ونسب التدرج ، وتقنيات التعلم العميق.",
      "يوفر شرائح وتسجيلات وجهازا افتراضيا للتنزيل ، بالإضافة إلى كتاب مصاحب يسمى \"الكتاب الصغير للتعلم العميق\"."
    ],
    "commentSummary": [
      "يقدم المنشور رؤى حول دورة التعلم العميق ويوفر رابطا لسلسلة محاضرات التعلم الآلي في جامعة ستانفورد.",
      "يسلط المشاركون الضوء على أهمية وجود أساس قوي في الجبر الخطي والاحتمالات وحساب التفاضل والتكامل والترميز للتعلم العميق والتعلم الآلي.",
      "يوصى بموارد مختلفة ، بما في ذلك الدورات التدريبية عبر الإنترنت والكتب ومقاطع الفيديو ، لتعزيز الفهم في التعلم العميق ، مع التركيز على الجهد الشخصي والالتزام بأن تصبح خبيرا في ML / DL."
    ],
    "points": 414,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1700389161
  },
  {
    "id": 38340226,
    "title": "الأخطاء الشائعة في تصور البيانات: دليل لرسوم بيانية أفضل",
    "originLink": "https://github.com/cxli233/FriendsDontLetFriends",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38340226",
    "commentBody": "",
    "originSummary": [
      "يناقش المؤلف الأخطاء الشائعة والممارسات السيئة في تصور البيانات ، ويقدم أمثلة وتفسيرات لكل خطأ.",
      "تتضمن أمثلة هذه الأخطاء استخدام مخططات شريطية للفصل المتوسط ، واستخدام مخططات الكمان لأحجام العينات الصغيرة ، واستخدام مقاييس الألوان ثنائية الاتجاه للبيانات أحادية الاتجاه ، وصنع مروج مؤامرة الشريط.",
      "كما يتم تسليط الضوء على أهمية إعادة ترتيب الصفوف والأعمدة في الخرائط الحرارية ، والتحقق من القيم المتطرفة ، والنظر في نطاق البيانات على مستوى كل عامل ، وتجربة تخطيطات مختلفة للرسوم البيانية للشبكة ، وتجنب الخلط بين التصورات المستندة إلى الموضع والطول.",
      "ينصح المؤلف بعدم استخدام المخططات الدائرية أو الكعك متحد المركز ، بالإضافة إلى مقاييس الألوان الحمراء / الخضراء وقوس قزح.",
      "يؤكد الاستنتاج على الحاجة إلى تحسين مخططات الأشرطة المكدسة عن طريق إعادة ترتيب الأشرطة."
    ],
    "commentSummary": [
      "تؤكد المقالة والمنتدى على أهمية إنشاء رسوم بيانية دقيقة وغنية بالمعلومات ، مع انتقاد الخرائط الحرارية غير الفعالة والتلاعب بالبيانات.",
      "يقترح المشاركون موارد مثل كتاب إدوارد توفت وورقة جون توكي لتحسين مهارات تصور البيانات.",
      "تستكشف المناقشة تطبيق مبادئ Tufte وإمكانية تضليل المعلومات في الرسوم البيانية ، مع توصيات لفهم الإدراك البشري للبيانات وإنشاء مخططات ورسوم بيانية فعالة."
    ],
    "points": 352,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1700439204
  },
  {
    "id": 38333116,
    "title": "datetime.utcnow() الإهمال في Python 3.12: احذر من مشكلات المنطقة الزمنية",
    "originLink": "https://blog.miguelgrinberg.com/post/it-s-time-for-a-change-datetime-utcnow-is-now-deprecated",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38333116",
    "commentBody": "",
    "originSummary": [
      "تقوم Python 3.12 بالإهمال والتخطيط لإزالة وظائف معينة في وحدة datetime ، والتي ترجع كائنات datetime بدون منطقة زمنية ، مما قد يتسبب في حدوث مشكلات.",
      "يوصي المؤلف باستخدام وظائف بديلة بسبب الجدل الدائر حول استخدام أوقات التاريخ الساذجة أو الواعية في بايثون.",
      "يتم التأكيد على تخزين أوقات التاريخ بالتوقيت العالمي المنسق والحفاظ على تحديث معلومات المنطقة الزمنية كممارسات حاسمة ، ويعبر العديد من المشاركين في المناقشة عن آرائهم ومخاوفهم بشأن معالجة المنطقة الزمنية بلغات البرمجة."
    ],
    "commentSummary": [
      "تركز المناقشة على المناطق الزمنية ووظائف التاريخ والوقت والتحديات التي تطرحها في البرمجة.",
      "تتم مناقشة الآراء حول كسر التغييرات وترحيل التعليمات البرمجية والتوافق مع الإصدارات السابقة.",
      "تغطي المناقشة أيضا تنسيق الجداول الزمنية عبر المناطق الزمنية وتأثير التوقيت الصيفي."
    ],
    "points": 345,
    "commentCount": 396,
    "retryCount": 0,
    "time": 1700405372
  },
  {
    "id": 38331349,
    "title": "Zero-K: يقدم التحديث الأخير ميزات جديدة وتحسينات في طريقة اللعب",
    "originLink": "https://zero-k.info/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38331349",
    "commentBody": "",
    "originSummary": [
      "Zero-K هي لعبة إستراتيجية مجانية في الوقت الفعلي مع وحدات ومقذوفات تعتمد على الفيزياء ، وتقدم أكثر من 100 وحدة فريدة وخيارات لعب متنوعة.",
      "يجلب التحديث الأخير قاذفات جديدة ، وتعديلات للوحدة ، وتغييرات في التوازن ، وقدرات تعديل موسعة.",
      "بالإضافة إلى ذلك ، يتضمن التحديث إصلاحات وتحسينات على طريقة اللعب ، وخصوم الذكاء الاصطناعي ، وميزات التعديل ، مما يقدم وضع لعبة نقطة تحكم جديد يسمى Artefact Control. تسعى Zero-K جاهدة لتكون اللعبة الإستراتيجية المجانية في الوقت الفعلي الأعلى تصنيفا."
    ],
    "commentSummary": [
      "تقارن المقالة وسلسلة التعليقات ألعاب RTS Zero-K و Beyond All Reason (BAR) كخلفاء للإبادة الكاملة.",
      "يناقشون الاختلافات في طريقة اللعب والاقتصاد والحدود القصوى للسكان بين اللعبتين.",
      "تشمل الموضوعات الأخرى استراتيجيات turtling ، والإحياء المحتمل لنوع RTS ، وطريقة لعب Zero-K ، الذكاء الاصطناعي ، ومتطلبات النظام ، وتطوير الألعاب على Linux ، والآثار الأخلاقية لألعاب الحرب ، وتعريف اللعبة مقابل التعديل."
    ],
    "points": 320,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1700390589
  },
  {
    "id": 38336688,
    "title": "ألعاب هندسية جذابة: خيارات مسلية وتعليمية للجميع",
    "originLink": "https://github.com/arcataroger/awesome-engineering-games",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38336688",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف برعاية قائمة من الألعاب التي تركز على الهندسة والتي تعتبر ممتعة وتعليمية.",
      "تتضمن القائمة أنواعا فرعية مختلفة مثل أتمتة المصانع وبناة المدن وبناة الطرق وألعاب علوم الكمبيوتر.",
      "لعب المؤلف معظم الألعاب ويقدم توصيات ومراجعات شخصية.",
      "القائمة مفتوحة للمساهمات والاقتراحات الإضافية من القراء."
    ],
    "commentSummary": [
      "تتميز مناقشة Hacker News بتوصيات لأنواع مختلفة من الألعاب المتعلقة بالهندسة والترميز والمحاكاة الصناعية.",
      "تتضمن بعض الألعاب المقترحة آلة الموارد البشرية وبرنامج Kerbal Space و Poly Bridge.",
      "تتعمق المحادثة أيضا في موضوعات مثل تعريف ومزايا ألعاب \"الوصول المبكر\" ، بالإضافة إلى تأثير Minecraft على نوع ألعاب المصنع."
    ],
    "points": 275,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1700421742
  },
  {
    "id": 38338635,
    "title": "مزايا LoRA في ضبط LLMs: الرؤى والمقايضات واعتبارات المحسن",
    "originLink": "https://magazine.sebastianraschka.com/p/practical-tips-for-finetuning-llms",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38338635",
    "commentBody": "",
    "originSummary": [
      "يستخدم LoRA (التكيف منخفض الرتبة) لضبط نماذج اللغة المخصصة ، مما يقلل من استخدام الذاكرة والموارد الحسابية عن طريق تحليل تغيرات الوزن.",
      "تتوافق نتائج استخدام LoRA مع الحد الأدنى من الاختلاف بناء على اختيار المحسن ، مع المزايا المحتملة لاستخدام SGD على محسن Adam.",
      "تتضمن الرؤى والدروس المستفادة من التجارب أهمية تطبيق LoRA عبر جميع الطبقات والضبط الدقيق الفعال للطرز الكبيرة ذات ذاكرة GPU المحدودة ، بالإضافة إلى اعتبارات حول تنفيذ LoRA وتأثيرات مجموعة البيانات والفوائد المحتملة لاستخدام خوارزميات التحسين الأخرى."
    ],
    "commentSummary": [
      "تقدم المقالة نصائح عملية لضبط نموذج اللغة (LLMs) باستخدام LoRA (التكيف منخفض الرتبة).",
      "ويقترح النظر في LLMs كسلسلة متصلة بدلا من عتبات متميزة وتجميع الأبحاث بناء على فئات الوزن.",
      "تتم مناقشة أهمية تضمين أمثلة خاصة بالمهمة أثناء ضبط معلمات LoRA وتحسينها لتحسين الأداء."
    ],
    "points": 265,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1700430854
  },
  {
    "id": 38333790,
    "title": "21 نوعا ، بما في ذلك هازجة باخمان ، أعلنت الوكالة الأمريكية انقراضها",
    "originLink": "https://www.pbsnc.org/blogs/science/us-agency-declares-21-species-now-extinct/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38333790",
    "commentBody": "",
    "originSummary": [
      "أكدت الوكالة الأمريكية انقراض 21 نوعا ، بما في ذلك هازجة باخمان.",
      "يسلط هذا الإعلان الضوء على المعدل المقلق لفقدان التنوع البيولوجي والحاجة الملحة لجهود الحفظ.",
      "لن يتم العثور على هازجة باخمان ، إلى جانب الأنواع الأخرى ، في البرية ، مما يؤكد العواقب التي لا رجعة فيها للأنشطة البشرية على أنظمتنا البيئية."
    ],
    "commentSummary": [
      "وتركز المناقشة على انقراض الأنواع وتأثير الأنشطة البشرية على التنوع البيولوجي.",
      "وتعرض وجهات نظر مختلفة، بما في ذلك دور التكنولوجيا في التقليل إلى أدنى حد من الأضرار البيئية وتحديات الحفاظ على التنوع الجيني.",
      "تؤكد المحادثة على أهمية العمل الجماعي لمواجهة التحديات البيئية والحفاظ على التوازن داخل النظم الإيكولوجية."
    ],
    "points": 264,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1700409401
  },
  {
    "id": 38341466,
    "title": "كايل فوغت يستقيل من منصب الرئيس التنفيذي لشركة كروز وسط مخاوف تتعلق بالسلامة",
    "originLink": "https://techcrunch.com/2023/11/19/cruise-co-founder-and-ceo-kyle-vogt-resigns/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38341466",
    "commentBody": "",
    "originSummary": [
      "استقال كايل فوغت ، المؤسس المشارك والرئيس التنفيذي لشركة كروز ، من منصبه.",
      "وسيتولى مو الشناوي، نائب الرئيس التنفيذي الحالي للهندسة في كروز، منصب الرئيس والرئيس التنفيذي للتكنولوجيا.",
      "تأتي الاستقالة في أعقاب تعليق تصاريح كروز من قبل إدارة كاليفورنيا للسيارات ، بسبب حادث تورط فيه أحد المشاة وروبوت كروز. تلقى كروز انتقادات لسوء الإدارة وعدم التركيز على السلامة ، مما أدى إلى انخفاض الروح المعنوية وتسريح العمال. يخطط فوغت لقضاء بعض الوقت مع عائلته واستكشاف مشاريع جديدة ، بينما تؤكد جنرال موتورز على أهمية السلامة والمساءلة لإعادة بناء ثقة الجمهور."
    ],
    "commentSummary": [
      "استقال المؤسس المشارك ورئيس شركة كروز للسيارات ذاتية القيادة المملوكة لشركة جنرال موتورز ، مما أدى إلى تكهنات حول الاتجاه المستقبلي للشركة.",
      "تثير المغادرة مخاوف بشأن السلامة والتجارب السلبية وأوجه التشابه مع جهود أوبر الفاشلة في القيادة الذاتية.",
      "قد يؤثر خروج الرئيس التنفيذي على تطوير برنامج كروز على متن الطائرة ، وقد تواجه الشركة تحديات في جمع الأموال."
    ],
    "points": 261,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1700447415
  },
  {
    "id": 38334084,
    "title": "اخترت العمل من المنزل: تحقيق التوازن بين الرضا الوظيفي والنمو الشخصي",
    "originLink": "https://shavingtheyak.com/2023/10/25/wfh-part1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38334084",
    "commentBody": "",
    "originSummary": [
      "يدافع المؤلف عن فوائد العمل من المنزل ، بما في ذلك زيادة التركيز وتقليل عوامل التشتيت وراحة مساحة العمل المخصصة.",
      "إنهم يتحدون اعتراضات الإدارة على العمل عن بعد ويشككون في ولاء الموظفين المدينين للشركات التي لا تعطي الأولوية لرفاهيتهم أو تطورهم الوظيفي.",
      "يسلط المقال الضوء على الحاجة إلى تحقيق توازن بين الرضا الوظيفي والنمو الشخصي."
    ],
    "commentSummary": [
      "تبحث المناقشة في إيجابيات وسلبيات العمل عن بعد مقارنة بالعمل المكتبي التقليدي.",
      "يتم النظر في عوامل مثل التوازن بين العمل والحياة والتفاعل الاجتماعي والإنتاجية والظروف الفردية.",
      "تؤكد المحادثة على أهمية استيعاب الشركات لتفضيلات العمل المختلفة وخلق بيئة عمل صحية ومرنة."
    ],
    "points": 256,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1700410908
  },
  {
    "id": 38331751,
    "title": "مختبر أبحاث الذكاء الاصطناعي كيوتاي يؤمن تمويلا بقيمة 300 مليون يورو ، وسيجعل كل شيء مفتوح المصدر",
    "originLink": "https://techcrunch.com/2023/11/17/kyutai-is-an-french-ai-research-lab-with-a-330-million-budget-that-will-make-everything-open-source/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38331751",
    "commentBody": "",
    "originSummary": [
      "كشف الملياردير الفرنسي كزافييه نيل النقاب عن خططه ل Kyutai ، وهو مختبر أبحاث الذكاء الاصطناعي غير ربحي في باريس ، يركز على الذكاء الاصطناعي العام.",
      "وقد حصل المختبر على تمويل بنحو 300 مليون يورو (330 مليون دولار) من مصادر متعددة، بما في ذلك الملياردير الفرنسي رودولف سعادة.",
      "استحوذت Kyutai على ألف وحدة معالجة رسومات Nvidia من Scaleway لتلبية متطلباتها الحسابية واستأجرت فريقا علميا قويا مع باحثين بارزين في الذكاء الاصطناعي كمستشارين. يعتزم المختبر إصدار نماذج مفتوحة المصدر وشفرة مصدر التدريب والبيانات. بالإضافة إلى ذلك ، يدعم نيل تنظيم حالات استخدام الذكاء الاصطناعي ، بما يتماشى مع وجهة نظر فرنسا بشأن قانون الذكاء الاصطناعي الأوروبي."
    ],
    "commentSummary": [
      "تدور مناقشة المنتدى حول البرمجيات مفتوحة المصدر ، ونماذج الذكاء الاصطناعي ، وتعلم اللغة ، وبدء الأعمال التجارية الذكاء الاصطناعي في أوروبا ، وأداء نموذج الذكاء الاصطناعي ميسترال.",
      "يتبادل المشاركون وجهات نظرهم حول تعريف وأهمية المصدر المفتوح ، وإمكانية حقوق الطبع والنشر لنماذج الذكاء الاصطناعي ، وتعلم اللغة ، وبدء شركات الذكاء الاصطناعي في أوروبا ، والمخاوف بشأن أداء ميسترال.",
      "كما تناقش بإيجاز مخصصات التمويل والتقدم المحرز في مجال الذكاء الاصطناعي."
    ],
    "points": 255,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1700394498
  }
]
