[
  {
    "id": 38981254,
    "title": "ستيلاريوم: واقعية 3D السماء عرض البرمجيات",
    "originLink": "https://github.com/Stellarium/stellarium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38981254",
    "commentBody": "",
    "originSummary": [
      "Stellarium هو برنامج القبة السماوية الحرة التي توفر وجهة نظر 3D واقعية من السماء.",
      "إنه سهل الاستخدام للمبتدئين ويمكن تثبيته على جهاز الكمبيوتر الخاص بك.",
      "البرنامج مفتوح المصدر ويمكن بناؤه من شفرة المصدر ، بدعم من المساهمين والداعمين والجهات الراعية."
    ],
    "commentSummary": [
      "يشارك المستخدمون في مناقشة حول برنامج Stellarium ، ويسلطون الضوء على رمزه عالي الجودة ويشيدون بوظائفه.",
      "تشمل الموضوعات التي تتم مناقشتها التعديلات ، واستخدام لغة خاصة بالمجال (DSL) ، ومفهوم الديون التقنية المنخفضة.",
      "يناقش المستخدمون أيضا حالات استخدام مختلفة ل Stellarium ، مثل توليد سماء واقعية في ألعاب الويب ، ودراسة مدارات الكواكب ، وتحديد الأقمار الصناعية. إنهم يشاركون تجاربهم مع تطبيق Stellarium على الهواتف ويناقشون خيارات الترخيص وخيارات البرامج البديلة.",
      "تشمل المناقشات الأخرى كتالوجات النجوم ، وإدراج العناصر المرئية في ملفات GitHub التمهيدية ، وأهمية توفير لقطات شاشة ومعلومات واضحة في وثائق المشروع مفتوحة المصدر."
    ],
    "points": 616,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1705162365
  },
  {
    "id": 38983067,
    "title": "الشعور بعدم الوفاء والافتقار إلى الدافع: من آخر يعمل على لا شيء؟",
    "originLink": "https://news.ycombinator.com/item?id=38983067",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38983067",
    "commentBody": "",
    "originSummary": [
      "يشعر المؤلف بعدم الوفاء ويفتقر إلى الدافع في كل من حياته المهنية والشخصية.",
      "إنهم يشتبهون في أن افتقارهم إلى الحافز قد يعزى إلى الشعور بأن جهودهم لا تصل إلى أي شيء.",
      "يعالج المؤلف حاليا القضايا الشخصية ولكنه يرغب في توازن صحي ويتساءل عما إذا كان الآخرون على HN يعانون من شيء مماثل."
    ],
    "commentSummary": [
      "يدور النقاش حول الأفراد الذين يعبرون عن عدم رضاهم عن حياتهم المهنية والشخصية ونقص الحافز في صناعة التكنولوجيا.",
      "هناك مخاوف بشأن الآثار السلبية للتكنولوجيا والرغبة في تحقيق الشخصية والسعادة.",
      "يتم تسليط الضوء على أهمية النمو الشخصي والرفاهية والتأمل الذاتي وممارسة الهوايات ، إلى جانب المناقشات حول الإرهاق وتأثير الوباء على حياة الأفراد."
    ],
    "points": 539,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1705171270
  },
  {
    "id": 38985152,
    "title": "تخصيص مساعد صوت محلي للتحكم في المنزل الذكي",
    "originLink": "https://johnthenerd.com/blog/local-llm-assistant/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38985152",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربتهم في إنشاء مساعد صوتي مخصص لمنزلهم الذكي ، مع التركيز على التخصيص والتحكم المحلي.",
      "لقد واجهوا تحديات مع عمليات الدمج الحالية لكنهم تمكنوا من التغلب عليها من خلال تطوير مساعدهم الخاص.",
      "يتميز النظام بنبرة ساخرة وازدراء ، مع دعم إضافي للتحكم في الأجهزة المختلفة.",
      "يذكر المؤلف حل مشكلات التنسيق ويناقش إمكانية الاحتفال بكعكة وحالة أضواء المكتب.",
      "يختتم الملخص بالإشارة إلى الاستضافة الذاتية و NAT Loopback ، مع الإشارة إلى الجوانب الفنية للمشروع."
    ],
    "commentSummary": [
      "تستكشف المناقشة تطوير مساعد صوتي نموذجي للغة المحلية لأتمتة المنزل ، ومناقشة التحديات والفوائد المحتملة المرتبطة باستخدام LLMs.",
      "ينظر إلى واجهات برمجة التطبيقات الموحدة على أنها ضرورية للتكامل والتوافق السلس بين الأنظمة المختلفة.",
      "تشمل الموضوعات الأخرى التي تمت مناقشتها استخدام نماذج الذكاء الاصطناعي لتحليل تاريخ السجل ، والحاجة إلى عروض توضيحية أوضح لمخرجات النظام ، وتوافق الأجهزة ، والمخاطر الأمنية ، واستخدام نماذج وقواعد الذكاء الاصطناعي المختلفة. تم ذكر واجهة برمجة تطبيقات OpenAI واستخدام GPU والمخاوف بشأن استهلاك الطاقة."
    ],
    "points": 438,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1705183930
  },
  {
    "id": 38980793,
    "title": "يكشف موقع يتتبع سعر Big Macs عبر ماكدونالدز في الولايات المتحدة عن نطاق سعري واسع",
    "originLink": "https://pantryandlarder.com/mccheapest",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38980793",
    "commentBody": "",
    "originSummary": [
      "يمكن أن يختلف سعر Big Mac في مواقع مختلفة ، حيث يبلغ أرخصها 3.49 دولارا في Stigler ، OK والأغلى 8.09 دولارا في Lee ، MA.",
      "من المثير للاهتمام أن نرى مثل هذا الاختلاف الكبير في السعر لنفس المادة الغذائية عبر أماكن مختلفة.",
      "تسلط هذه المعلومات الضوء على كيفية تأثير العوامل الاقتصادية والاختلافات الإقليمية على أسعار المستهلك."
    ],
    "commentSummary": [
      "يغطي موضوع المناقشة مجموعة من الموضوعات المتعلقة بماكدونالدز ، بما في ذلك القدرة على تحمل التكاليف والتسعير واستخدام تطبيق ماكدونالدز في بلدان مختلفة.",
      "يناقش المستخدمون تباين الأسعار بين المواقع وتأثير ملكية الامتياز على التسعير ، بالإضافة إلى المقارنات مع سلاسل الوجبات السريعة الأخرى.",
      "العوامل التي يمكن أن تؤثر على الأسعار ، مثل الضرائب والمنافسة وتكاليف العمالة والموقع ، مذكورة أيضا في المحادثات."
    ],
    "points": 375,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1705159768
  },
  {
    "id": 38984609,
    "title": "الاستخدام المفرط للبيانات في غسالة LG يثير مخاوف أمنية",
    "originLink": "https://www.tomshardware.com/networking/your-washing-machine-could-be-sending-37-gb-of-data-a-day",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38984609",
    "commentBody": "",
    "originSummary": [
      "لاحظ مالك غسالة LG استهلاكا غير طبيعي للبيانات يبلغ 3.66 جيجابايت يوميا وفصله عن شبكة Wi-Fi.",
      "تراوحت التكهنات على وسائل التواصل الاجتماعي من القرصنة وتعدين العملات المشفرة إلى تحميل بيانات الغسيل لتطوير المنتجات.",
      "يعتقد أن خطأ في البرامج الثابتة لجهاز التوجيه Asus هو سبب استخدام البيانات الذي تم الإبلاغ عنه بشكل خاطئ ، مما يؤكد أهمية التدابير الأمنية في الأجهزة الذكية ومخاطر اختراق الأجهزة المتصلة."
    ],
    "commentSummary": [
      "تتعمق المحادثة في جوانب مختلفة من الغسالات المتصلة بالإنترنت ، بما في ذلك المخاوف بشأن الاستخدام المفرط للبيانات والخصوصية والأمان وإساءة الاستخدام المحتملة للبيانات.",
      "يشارك المستخدمون تجاربهم مع الأجهزة الذكية ، ويناقشون فوائد الاتصال ، ويستكشفون تحديات وقيود أجهزة إنترنت الأشياء.",
      "تتطرق المحادثة أيضا إلى الجدل الدائر حول ممارسات جمع البيانات للأجهزة الذكية الأخرى مثل المكانس الكهربائية Roomba المزودة بكاميرات ، بالإضافة إلى الآثار والقضايا المحتملة المرتبطة بإنترنت الأشياء (IoT)."
    ],
    "points": 263,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1705180264
  },
  {
    "id": 38985343,
    "title": "أستاذ الرياضيات يستقيل بسبب تصريحات التنوع القسري",
    "originLink": "https://www.theatlantic.com/ideas/archive/2023/12/professor-american-academia-parallels-soviet-union/676305/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38985343",
    "commentBody": "",
    "originSummary": [
      "استقال ألكسندر بارفينوك ، أستاذ الرياضيات ، من الجمعية الأمريكية للرياضيات (AMS) بسبب فشلهم في معارضة شرط المتقدمين للوظائف لتقديم بيانات التنوع.",
      "يرى بارفينوك أن التصريحات القسرية ، بغض النظر عن محتواها ، هي شكل من أشكال الكلام القسري ويعتقد أنها تفسد جميع المعنيين.",
      "تتأثر معارضة بارفينوك لبيانات التنوع بتجاربه التي نشأ فيها في الاتحاد السوفيتي ، مؤكدا على أهمية أن يتحدث الأكاديميون ضد العقيدة في الحرم الجامعي وحماية الحرية الأكاديمية."
    ],
    "commentSummary": [
      "يدرس المقال بيانات التنوع في الأوساط الأكاديمية ويثير مخاوف بشأن آثارها.",
      "يتم استكشاف مواضيع مختلفة تتعلق بالتنوع والشمول ، بما في ذلك أهمية فهم طرق التصويت ، ومخاطر التطرف ، ودور الليبرالية والمحافظة ، وتحديات مبادرات التنوع.",
      "يسلط المقال الضوء على التأثير على الفئات المهمشة ، ومفهوم المساواة ، والعلاقة بين الطبقة والتنوع العرقي ، والجدل الدائر حول بيانات التنوع ، والتوافق الأيديولوجي القسري ، والحاجة إلى حوار مفتوح في معالجة التمييز والحواجز النظامية."
    ],
    "points": 255,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1705185347
  },
  {
    "id": 38983742,
    "title": "AsmBB: محرك منتدى ويب سريع وآمن وقابل للتخصيص بلغة التجميع",
    "originLink": "https://asmbb.org/what-is-asmbb.1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38983742",
    "commentBody": "",
    "originSummary": [
      "AsmBB هو محرك منتدى ويب تم إنشاؤه بواسطة JohnFound ، مكتوب بلغة التجميع.",
      "يستخدم SQLite كقاعدة بيانات خاصة به وهو معروف بسرعته وتصميمه خفيف الوزن.",
      "محرك المنتدى آمن للغاية وقابل للتخصيص ويمكنه التعامل مع عدد كبير من الزوار دون تأخير."
    ],
    "commentSummary": [
      "تغطي المناقشة مواضيع مختلفة ، بما في ذلك الأمان ونقاط الضعف في محرك منتدى الويب المستند إلى لغة التجميع ، ودور المهندسين في تطوير التعليمات البرمجية ، ومزايا وعيوب استخدام لغة التجميع.",
      "كما يناقش المشاركون أهمية الالتزام بقواعد البرمجة، وكفاءة بعض لغات البرمجة والمكتبات، واصطلاحات الدعوة المختلفة للمعماريات المختلفة.",
      "الموضوعات الأخرى التي تم التطرق إليها في المناقشة هي استخدام مجموعات الرموز التعبيرية على مواقع الويب ، وتصميم الإدخال / الإخراج وقاعدة البيانات ، وقابلية النقل في لغات البرمجة ، ومعماريات المتحكمات الدقيقة المختلفة."
    ],
    "points": 239,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1705174919
  },
  {
    "id": 38982389,
    "title": "Starlink تختبر الفضاء مباشرة إلى خدمة الهاتف المحمول الخلوي",
    "originLink": "https://www.ispreview.co.uk/index.php/2024/01/starlink-successfully-tests-space-direct-to-cell-mobile-service.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38982389",
    "commentBody": "",
    "originSummary": [
      "تختبر Starlink بنجاح خدمة التجوال المتنقلة العالمية المباشرة إلى Cell ، بدءا من الرسائل النصية والتخطيط لإضافة قدرة 4G.",
      "تواجه فودافون المملكة المتحدة اضطرابا في شبكة الهاتف المحمول الخاصة بها.",
      "BT يحاول تحويل خزائن الشوارع إلى شواحن السيارات الكهربائية."
    ],
    "commentSummary": [
      "نجحت Starlink من SpaceX في اختبار خدمة Space Direct to Cell Mobile ، والتي تهدف إلى توفير تغطية الرسائل النصية الخلوية في حالات الطوارئ في جميع أنحاء العالم.",
      "يتم إجراء مقارنات بين نظام SpaceX وميزة الطوارئ SOS من Apple فيما يتعلق بالسرعة والقدرات.",
      "يعبر المعلقون عن أملهم في الحصول على المزيد من الميزات والتغطية ، بالإضافة إلى المخاوف بشأن النطاق الترددي وبرامج المراسلة."
    ],
    "points": 218,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1705167607
  },
  {
    "id": 38987109,
    "title": "إساءة استخدام اتفاقية Shebang: التغليف عبر الأنظمة الأساسية باستخدام عامل ميناء",
    "originLink": "https://gist.github.com/adtac/595b5823ef73b329167b815757bbce9f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38987109",
    "commentBody": "",
    "originSummary": [
      "يتم استخدام اتفاقية shebang في هذا المثال لحزم التطبيقات بطريقة عبر الأنظمة الأساسية.",
      "يجمع مثال Dockerfile بين الواجهة الخلفية وقاعدة البيانات وواجهة المستخدم في ملف واحد ، والذي قد لا يعتبر آمنا أو قابلا للصيانة.",
      "بينما قد يختلف الأداء ، يمكن استخدام الأمر المحدد لتشغيل التطبيق."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول استخدام Docker للتطوير عبر الأنظمة الأساسية ، مع التركيز بشكل خاص على حاويات Windows.",
      "تنقسم الآراء ، حيث يشيد بعض المستخدمين بفوائد Docker لنظام التشغيل Windows ، بينما يفضل البعض الآخر Linux.",
      "هناك ارتباك حول توفر ودعم حاويات Windows على إصدارات Windows المختلفة ، بالإضافة إلى مناقشات حول حزم MSIX وأدوات وقت تشغيل الحاوية البديلة."
    ],
    "points": 215,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1705202405
  },
  {
    "id": 38981639,
    "title": "تبسيط الأنماط في برمجة المصفوفات: فهم دعم صفيف K",
    "originLink": "https://github.com/razetime/ngn-k-tutorial/blob/main/12-thinking-in-k.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38981639",
    "commentBody": "",
    "originSummary": [
      "يغطي المقطع مفهوم برمجة K وتبسيط الأنماط في برمجة المصفوفات.",
      "يتضمن دراسة حالة حول ضرب المصفوفة ويقدم رؤى حول تحسين الكود وتكثيفه.",
      "يعد فهم دعم صفيف K أمرا ضروريا لتنفيذ الخوارزميات بكفاءة في K."
    ],
    "commentSummary": [
      "لغات الصفيف متعددة الاستخدامات ولها اتصالات عالية المستوى ، مما يوفر إمكانات وتحديات في البرمجة.",
      "تشمل الموضوعات التي تمت مناقشتها البرمجة الضمنية وأنظمة الكتابة والشغف داخل مجتمع لغة المصفوفة.",
      "يتم استكشاف فوائد وجماليات لغات البرمجة ، بالإضافة إلى مزايا برمجة الصفيف في سياقات مختلفة."
    ],
    "points": 215,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1705164209
  },
  {
    "id": 38980171,
    "title": "رحلة ANA اليابانية تعود إلى الوراء بسبب تصدع نافذة قمرة القيادة",
    "originLink": "https://www.channelnewsasia.com/asia/japan-all-nippon-airways-flight-1182-boeing-737-cockpit-window-crack-4045796",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38980171",
    "commentBody": "",
    "originSummary": [
      "اضطرت رحلة داخلية لشركة All Nippon Airways (ANA) في اليابان إلى العودة إلى مطار المغادرة بسبب صدع تم العثور عليه في نافذة قمرة القيادة لطائراتهم من طراز بوينج 737-800.",
      "لم يتم الإبلاغ عن أي إصابات ، ولم يؤثر الشق على التحكم في الرحلة أو ضغطها.",
      "هذا الحادث منفصل عن المشكلات المستمرة مع طائرات بوينج 737 MAX 9 ، والتي لا تزال متوقفة إلى أجل غير مسمى."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول مخاوف مختلفة تتعلق بشركة بوينج وصناعة الطيران ، بما في ذلك طائرات 737 MAX ، والأنظمة الحيوية المخفية ، والحاجة إلى اعتماد مكثف وتدريب الطيارين.",
      "يتم توجيه الانتقادات إلى شركة بوينغ لعدم تطوير نماذج جديدة وقضايا سابقة مع طائراتها.",
      "كما تتم مناقشة دور وسائل الإعلام في اختيار وتقديم القصص الإخبارية ، والحاجة إلى التغيير داخل شركات مثل بوينج ، والنقاش بين الرقابة الصارمة وتحقيق التوازن بين الابتكار والسلامة."
    ],
    "points": 204,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1705155919
  },
  {
    "id": 38978665,
    "title": "تصل شوكة الإخطارات العامة GoatCounter إلى هدف التمويل ، وتقدم ميزات وتحسينات جديدة",
    "originLink": "https://github.com/arp242/goatcounter/releases/tag/v2.5.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38978665",
    "commentBody": "",
    "originSummary": [
      "وصلت شوكة الإخطارات العامة goatcounter إلى هدفها التمويلي وسيبدأ المطور العمل عليها الأسبوع المقبل.",
      "يتضمن أحدث إصدار من الشوكة العديد من الميزات والتحسينات الجديدة ، مثل كفاءة الجدول بشكل أفضل ، وعدم تخزين رؤوس وكيل المستخدم ، وخيار وكيل للاتصالات الآمنة ، ووضع مظلم تجريبي ، وعرض اختلافات مشاهدة الصفحة مقارنة بالفترة السابقة على لوحة القيادة ، والإعداد المبسط لعمليات التثبيت الجديدة.",
      "بالإضافة إلى ذلك ، تمت معالجة العديد من الأخطاء وإصلاحها في هذا الإصدار."
    ],
    "commentSummary": [
      "تتضمن المجموعة مناقشات حول مواضيع مثل أهمية التسويق، وتعليم المطورين، والالتزامات الأخلاقية للبرمجيات الحرة، والانزعاج من طلبات التبرع المتكررة.",
      "هناك رؤى حول منشئ GoatCounter وقرارهم بتوفير بديل مجاني ل Google Analytics ، بالإضافة إلى اقتراحات لنماذج التسعير.",
      "يذكر المؤلف أيضا أداة التتبع الخاصة به للمستخدمين الذين لديهم أدوات حظر الإعلانات وكرههم لطلبات التبرع المتكررة على مواقع الويب مثل ويكيبيديا."
    ],
    "points": 191,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1705141508
  },
  {
    "id": 38984096,
    "title": "فهم الاختلافات: وحدة التحكم ، المحطة الطرفية ، TTY ، و Shell في أنظمة Unix",
    "originLink": "https://unix.stackexchange.com/questions/4126/what-is-the-exact-difference-between-a-terminal-a-shell-a-tty-and-a-con",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38984096",
    "commentBody": "",
    "originSummary": [
      "يستكشف النص التعريفات والفروق المختلفة للمصطلحات مثل وحدة التحكم والمحطة الطرفية و TTY و shell في أنظمة Unix.",
      "يوفر السياق التاريخي ويشرح وظائف هذه المصطلحات.",
      "يذكر النص أيضا أهمية المحاكيات الطرفية والمحطات الافتراضية ووحدات التحكم في الحوسبة الحديثة."
    ],
    "commentSummary": [
      "تتعمق المناقشة في الفروق بين المحطة الطرفية والصدفة و TTY ووحدة التحكم التي غالبا ما تستخدم بالتبادل في المصطلحات التقنية.",
      "تتم مناقشة الإحباطات والتجارب السلبية على Stack Overflow ، إلى جانب الاختلافات بين Stack Overflow و Hacker News.",
      "تستكشف المحادثة تعريفات المحطات الطرفية ووحدات التحكم والأصداف ، بالإضافة إلى المصطلحات المتطورة في صناعة التكنولوجيا."
    ],
    "points": 188,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1705176997
  }
]
