[
  {
    "id": 41453237,
    "title": "Yi-Coder: LLM Kecil tapi Perkasa untuk Kode",
    "originLink": "https://01-ai.github.io/blog.html?post=en/2024-09-05-A-Small-but-Mighty-LLM-for-Code.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41453237",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yi-Coder adalah model bahasa (LLM) baru yang kecil namun kuat untuk kode, yang mendapatkan perhatian karena kinerjanya dan efektivitas biayanya.",
      "Meskipun terjangkau, ada kekhawatiran tentang privasi dan penggunaan data, karena ketentuan DeepSeek memungkinkan penggunaan dan penyimpanan data pengguna secara luas, termasuk di China.",
      "Pengguna melaporkan pengalaman yang beragam dengan Yi-Coder, mencatat masalah dengan akurasi dan relevansi dalam pembuatan kode dibandingkan dengan model yang lebih mapan seperti Claude 3.5 Sonnet."
    ],
    "points": 207,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1725507509
  },
  {
    "id": 41451698,
    "title": "Laminar – DataDog + PostHog Sumber Terbuka untuk Aplikasi LLM, Dibangun dengan Rust",
    "originLink": "https://github.com/lmnr-ai/lmnr",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41451698",
    "commentBody": "",
    "originSummary": [
      "Laminar adalah platform observabilitas dan analitik sumber terbuka yang dirancang untuk aplikasi Model Bahasa Besar (LLM) yang kompleks, menggunakan tumpukan teknologi yang mencakup RabbitMQ, Postgres, Clickhouse, Qdrant, dan Rust.",
      "Platform ini membedakan dirinya dengan berfokus pada jejak eksekusi penuh daripada hanya panggilan LLM, menggunakan ingestor Rust untuk span OpenTelemetry dengan konvensi semantik GenAI, dan mengintegrasikan analitik teks langsung dengan jejak eksekusi.",
      "Laminar memiliki fitur Pipeline Builder dengan antarmuka grafis, mendukung pencarian lanjutan atas jejak menggunakan basis data vektor, dan bertujuan menjadi 'Supabase untuk LLMOps,' menawarkan SDK dan dasbor untuk evaluasi."
    ],
    "commentSummary": [
      "Laminar adalah platform observabilitas dan analitik sumber terbuka untuk aplikasi Model Bahasa Besar (LLM) yang kompleks, dibangun menggunakan Rust dan teknologi lainnya seperti RabbitMQ, Postgres, dan Clickhouse.",
      "Ini berfokus pada jejak eksekusi penuh dan menggunakan ingestor Rust untuk span OpenTelemetry, memungkinkan pelacakan dan analisis komprehensif terhadap kinerja dan perilaku LLM.",
      "Laminar menawarkan antarmuka grafis untuk merancang jalur ekstraksi LLM, mendukung evaluasi dengan SDK yang sederhana, dan bertujuan menjadi platform utama untuk operasi LLM (LLMOps)."
    ],
    "points": 180,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1725490339
  },
  {
    "id": 41450824,
    "title": "Kumpulan pustaka standar Python yang kurang dikenal",
    "originLink": "https://www.trickster.dev/post/lesser-known-parts-of-python-standard-library/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41450824",
    "commentBody": "",
    "originSummary": [
      "Artikel tersebut menyoroti bagian-bagian dari pustaka standar Python yang kurang dikenal tetapi berguna, seperti struktur data lanjutan dalam modul `collections` dan pengelola konteks dalam modul `contextlib`.",
      "Ini juga mencakup modul untuk aritmetika presisi (`decimal` dan `fractions`), debugging (`dis`), alat statistik dasar (`statistics`), otomatisasi halaman web (`webbrowser`), dan pengemasan kode Python (`zipapp`).",
      "Keterangan ini sangat berharga bagi pengembang Python yang ingin memanfaatkan potensi penuh dari pustaka standar untuk pengkodean yang lebih efisien dan efektif."
    ],
    "commentSummary": [
      "Perpustakaan standar Python mencakup modul-modul yang kurang dikenal tetapi berguna seperti `OrderedDict`, `ChainMap`, dan `MappingProxyType` untuk operasi kamus tingkat lanjut.",
      "Modul seperti `functools` dan `itertools` menawarkan alat yang kuat, termasuk `lru_cache`, `namedtuples`, dan `deques`, yang meningkatkan fungsionalitas dan kinerja.",
      "The `http.server` module memungkinkan untuk memulai server web lokal dengan cepat, dan modul `array` menyediakan array yang efisien dalam penggunaan memori, membuat Python serbaguna untuk berbagai tugas."
    ],
    "points": 176,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1725484025
  },
  {
    "id": 41452339,
    "title": "TinyStatus: Halaman status kecil yang dihasilkan oleh skrip Python",
    "originLink": "https://github.com/harsxv/tinystatus",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41452339",
    "commentBody": "",
    "originSummary": [
      "TinyStatus adalah generator halaman status yang dapat disesuaikan untuk layanan pemantauan, yang menampilkan pemantauan endpoint HTTP, pemeriksaan ping, dan pemeriksaan port terbuka.",
      "Itu menawarkan desain yang ringan dan responsif dengan pembaruan status otomatis dan pelacakan riwayat insiden, yang dapat dikonfigurasi melalui file YAML.",
      "Instalasi memerlukan Python 3.7+ dan pip, dengan opsi untuk menjalankan skrip secara langsung atau menggunakan Docker untuk penerapan terkontainerisasi."
    ],
    "commentSummary": [
      "Tinystatus adalah skrip Python yang menghasilkan halaman status HTML statis yang sederhana dan responsif untuk layanan yang di-hosting sendiri, memeriksa halaman HTTP, port terbuka, dan melakukan ping ke alamat IP.",
      "Proyek ini telah memicu minat karena kesederhanaannya dan kepatuhannya terhadap filosofi UNIX untuk melakukan satu hal dengan baik, menjadikannya alat yang berguna untuk memantau layanan di homelab.",
      "Pengguna telah menyarankan peningkatan seperti menambahkan tangkapan layar ke README, membuat ubin dapat diklik, dan mengintegrasikan dengan alat lain seperti Uptime Kuma dan ntfy.sh untuk notifikasi."
    ],
    "points": 168,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1725496825
  },
  {
    "id": 41454779,
    "title": "Tentang porting systemd ke Linux yang didukung oleh musl Libc",
    "originLink": "https://catfox.life/2024/09/05/porting-systemd-to-musl-libc-powered-linux/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41454779",
    "commentBody": "",
    "originSummary": [
      "Port awal systemd ke Linux yang didukung musl libc telah selesai, menargetkan rilis terbaru dari systemd dan musl untuk dimasukkan ke hulu.",
      "Proyek ini bertujuan untuk menyediakan sistem yang andal dan cepat booting, mengatasi kesalahan build, kegagalan pengujian, dan masalah kompatibilitas, termasuk terjemahan format %z khusus untuk musl.",
      "Upaya ini, didukung oleh Wilcox Technologies Inc. dan Adélie Linux, mendekati rilis beta publik, dengan pengujian dan kolaborasi yang sedang berlangsung untuk memastikan hasil berkualitas tinggi."
    ],
    "commentSummary": [
      "Memporting systemd ke Linux yang didukung oleh musl libc adalah perkembangan yang signifikan, terutama untuk perangkat tertanam yang mengutamakan waktu boot yang cepat.",
      "Musl libc adalah pustaka standar ringan untuk Linux, sering digunakan di lingkungan di mana sumber daya terbatas, seperti sistem tertanam.",
      "Konektor ini dapat meningkatkan waktu booting dan kinerja untuk perangkat yang tidak selalu aktif, mengatasi masalah umum dalam sistem tertanam."
    ],
    "points": 165,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1725525898
  },
  {
    "id": 41454741,
    "title": "Bangun Server WoW (World of Warcraft) dengan Elixir",
    "originLink": "https://pikdum.dev/posts/thistle-tea/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41454741",
    "commentBody": "",
    "originSummary": [
      "Seorang pengembang sedang membangun server pribadi World of Warcraft bernama \"Thistle Tea\" menggunakan bahasa pemrograman Elixir, mulai dari 2 Juni 2024.",
      "Kegiatan proyek ini melibatkan pembuatan lingkungan permainan yang fungsional di mana pemain dapat masuk, membuat karakter, bergerak, dan melemparkan mantra, dengan sinkronisasi antara pemain.",
      "Pengembang menggunakan proyek ini sebagai pengalaman belajar untuk Elixir, dengan fokus pada berbagai aspek seperti otentikasi, mekanika server game, fungsi obrolan, dan interaksi mob, dengan rencana untuk memperluas fitur dan meningkatkan kinerja serta skalabilitas."
    ],
    "commentSummary": [
      "Kajian tentang membangun server World of Warcraft (WoW) menggunakan bahasa pemrograman Elixir telah memicu minat di kalangan penggemar teknologi dan mantan pemain WoW.",
      "Percakapan tersebut menyoroti tantangan dalam meningkatkan skala server semacam itu dan kompleksitas hukum yang terlibat, termasuk rekayasa balik dan penggunaan aset seni asli.",
      "Thread tersebut juga menyentuh tentang nostalgia dan evolusi WoW, membandingkannya dengan MMORPG (Massively Multiplayer Online Role-Playing Games) modern lainnya seperti Final Fantasy XIV."
    ],
    "points": 165,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1725525416
  },
  {
    "id": 41453300,
    "title": "Anak-anak yang menggunakan ChatGPT sebagai asisten belajar mendapatkan hasil yang lebih buruk pada tes",
    "originLink": "https://hechingerreport.org/kids-chatgpt-worse-on-tests/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41453300",
    "commentBody": "",
    "originSummary": [
      "Studi oleh University of Pennsylvania menemukan bahwa siswa yang menggunakan ChatGPT untuk latihan soal matematika tampil lebih buruk pada tes berikutnya dibandingkan dengan mereka yang tidak menggunakannya.",
      "Studi yang berjudul 'Generative AI Can Harm Learning' menyarankan bahwa chatbot AI dapat bertindak sebagai penopang, menghambat pengembangan keterampilan, dan menyebabkan kepercayaan diri yang berlebihan di kalangan siswa.",
      "Meskipun berhasil menyelesaikan lebih banyak soal latihan dengan benar, pengguna ChatGPT mencetak nilai 17% lebih rendah pada tes, dengan kesalahan dalam aritmetika dan langkah-langkah pemecahan masalah yang berkontribusi pada masalah tersebut."
    ],
    "commentSummary": [
      "Anak-anak yang menggunakan ChatGPT sebagai asisten belajar cenderung mendapatkan hasil yang lebih buruk pada tes, seperti yang disoroti dalam diskusi di Hacker News.",
      "Studi tersebut menemukan bahwa siswa yang menggunakan versi dasar ChatGPT mendapatkan hasil yang lebih buruk pada tes, sementara mereka yang menggunakan versi seperti tutor menunjukkan performa yang serupa dengan mereka yang tidak menggunakan bantuan AI sama sekali.",
      "Konsensusnya adalah bahwa alat AI seperti ChatGPT dapat membantu dalam memahami konsep tetapi harus digunakan dengan hati-hati untuk menghindari ketergantungan berlebihan dan memastikan mereka membantu pembelajaran daripada menggantikan pemikiran kritis."
    ],
    "points": 159,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1725508210
  },
  {
    "id": 41456411,
    "title": "Hacker League – Rocket League Sumber Terbuka di Linux",
    "originLink": "https://github.com/moritztng/hacker-league",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41456411",
    "commentBody": "",
    "originSummary": [
      "\"Hacker League\" saat ini hanya mendukung distribusi berbasis Debian dengan arsitektur x86_64, dan bantuan diperlukan untuk memperluas dukungan ke platform lain.",
      "Pengguna disarankan untuk memastikan driver GPU eksternal terpasang untuk kinerja yang optimal.",
      "Permainan dapat diinstal melalui skrip bash sederhana, dan disarankan untuk menggunakan gamepad untuk pengalaman terbaik."
    ],
    "commentSummary": [
      "Kode sumber terbuka dari Rocket League, yang diberi nama Hacker League, telah dikembangkan untuk Linux dan tersedia di GitHub.",
      "Proyek yang dibangun dalam waktu sekitar dua minggu ini telah menerima umpan balik mengenai masalah teknis seperti sinkronisasi renderer dan fisika, serta penggunaan beberapa perpustakaan matematika.",
      "Pengembang telah membuat server Discord untuk keterlibatan komunitas dan berencana untuk terus membangun proyek ini secara terbuka."
    ],
    "points": 153,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1725542669
  },
  {
    "id": 41452962,
    "title": "Accelerando (2005)",
    "originLink": "https://www.antipope.org/charlie/blog-static/fiction/accelerando/accelerando.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41452962",
    "commentBody": "",
    "originSummary": [
      "\"Accelerando\" adalah sebuah novel karya Charles Stross, diterbitkan pada tahun 2005, dan dilisensikan di bawah Lisensi Creative Commons Attribution-NonCommercial-NoDerivs 2.5, yang memungkinkan distribusi gratis dengan kondisi tertentu.",
      "Kisah ini mengikuti Manfred, seorang pialang meme yang pronoiak, saat ia menavigasi teknologi futuristik, hubungan pribadi, dan tantangan hukum serta keuangan yang kompleks.",
      "Novel ini dibagi menjadi tiga bagian: 'Lepas Landas Perlahan,' 'Titik Infleksi,' dan 'Singularitas,' masing-masing mengeksplorasi fase-fase berbeda dari evolusi teknologi dan pribadi."
    ],
    "commentSummary": [
      "\"Accelerando\" (2005) oleh Charles Stross adalah novel fiksi ilmiah yang membahas tema-tema seperti cryptocurrency, kontrak pintar, dan evolusi teknologi, menjadikannya sangat relevan dengan tren teknologi saat ini.",
      "Buku ini dikenal karena jargon teknisnya yang padat dan sifat spekulatifnya, menarik perbandingan dengan karya-karya berpengaruh lainnya seperti 'Dune' dan 'Neuromancer.'",
      "Partisipasi aktif Stross dengan penggemar di platform seperti Mastodon dan Reddit meningkatkan dampak dan relevansi novel tersebut, mempengaruhi pandangan dunia pembaca."
    ],
    "points": 150,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1725503635
  },
  {
    "id": 41457331,
    "title": "AlphaProteo menghasilkan protein baru untuk penelitian biologi dan kesehatan",
    "originLink": "https://deepmind.google/discover/blog/alphaproteo-generates-novel-proteins-for-biology-and-health-research/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41457331",
    "commentBody": "",
    "originSummary": [
      "AlphaProteo, sebuah sistem AI baru, merancang protein-protein baru yang mengikat molekul target, berpotensi merevolusi desain obat dan pemahaman penyakit.",
      "Itu telah menunjukkan tingkat keberhasilan yang lebih tinggi dan afinitas pengikatan yang lebih baik dibandingkan dengan metode yang ada, dengan validasi eksperimental dari Francis Crick Institute.",
      "Meskipun menghadapi tantangan, seperti kegagalan merancang pengikat untuk TNFɑ, AlphaProteo bertujuan untuk meningkatkan dan memperluas aplikasinya melalui kolaborasi komunitas dan pengembangan yang bertanggung jawab."
    ],
    "commentSummary": [
      "Teknologi AlphaProteo dapat mengikat protein dengan akurat, berpotensi merevolusi dunia kedokteran dengan memungkinkan pembuatan obat yang ditargetkan dan produksi massal organ.",
      "Google mengkomersialkan teknologi ini melalui Isomorphic Labs, dengan fokus pada pengembangan bidang tersebut daripada pengembangan obat secara langsung.",
      "Walaupun teknologi ini menjanjikan untuk pengembangan obat dan desain enzim industri, tantangan seperti efek di luar target, respons imun, dan kekhawatiran etis tentang penyakit prion tetap ada."
    ],
    "points": 144,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725548749
  },
  {
    "id": 41452781,
    "title": "Tuan tanah besar Kanada menggunakan 'skema penetapan harga' AI saat menaikkan sewa",
    "originLink": "https://breachmedia.ca/canadian-mega-landlord-ai-pricing-scheme-hikes-rents/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41452781",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Seorang tuan tanah besar di Kanada menggunakan AI untuk menaikkan sewa, menimbulkan kekhawatiran tentang potensi penetapan sewa kolektif dan manipulasi pasar.",
      "Kecerdasan buatan (AI) yang beroperasi sebagai kotak hitam, menyarankan sewa yang lebih tinggi berdasarkan data dari banyak pemilik properti, yang berpotensi mengarah pada pergeseran pasar dari persaingan bebas ke sewa maksimum yang berkelanjutan.",
      "Kritikus berpendapat bahwa praktik ini dapat memungkinkan kolusi harga tanpa komunikasi langsung di antara para pemilik properti, menyoroti kebutuhan akan regulasi baru untuk mengatasi dampak AI pada pasar perumahan."
    ],
    "points": 132,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1725501563
  },
  {
    "id": 41453557,
    "title": "Desed: Mengungkap dan memperbaiki skrip sed Anda",
    "originLink": "https://github.com/SoptikHa2/desed",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41453557",
    "commentBody": "",
    "originSummary": [
      "Desed adalah alat baris perintah dengan Antarmuka Pengguna Teks (TUI) yang dirancang untuk debugging skrip sed, menawarkan fitur seperti pratinjau variabel, efek perintah substitusi, langkah-langkah skrip, breakpoint, dan pemuatan ulang kode secara langsung.",
      "Ini memerlukan rust, cargo, dan GNU sed, dan dapat diinstal pada berbagai distribusi Linux dan sistem BSD, atau dibangun dari sumber.",
      "Kemungkinan pembaruan di masa depan mungkin mencakup penyorotan sintaks dan inklusi repositori yang lebih luas, meningkatkan kegunaannya bagi para pengembang."
    ],
    "commentSummary": [
      "Desed adalah alat baru yang dirancang untuk membantu pengguna menguraikan dan memperbaiki skrip `sed` mereka, sehingga memudahkan pemahaman dan pemecahan masalah tugas pemrosesan teks yang kompleks.",
      "Alat ini telah menarik minat yang signifikan karena potensinya untuk menyederhanakan sintaks `sed` yang terkenal sulit, yang banyak digunakan dalam sistem mirip Unix untuk manipulasi teks.",
      "Diskusi ini menyoroti relevansi dan tantangan yang terus berlanjut dalam menggunakan alat Unix tradisional seperti `sed`, `awk`, dan `grep`, serta memperkenalkan utilitas alternatif seperti `sd` dan `sad` yang bertujuan untuk menawarkan sintaks dan fitur yang lebih ramah pengguna."
    ],
    "points": 131,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1725511619
  },
  {
    "id": 41457633,
    "title": "AnythingLLM – Asisten AI Desktop Serba Ada dan Sumber Terbuka",
    "originLink": "https://github.com/Mintplex-Labs/anything-llm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41457633",
    "commentBody": "",
    "originSummary": [
      "AnythingLLM adalah asisten desktop sumber terbuka yang dirancang untuk membuat AI dapat diakses dengan pengaturan minimal dan privasi secara default.",
      "Fitur utama termasuk penyedia LLM bawaan, basis data vektor, model embedding, dan integrasi untuk pengambilan data dari situs web, impor repositori GitHub/GitLab, dan lainnya.",
      "Alat ini tersedia sebagai aplikasi yang dapat diinstal secara tunggal untuk Mac, Windows, dan Linux, dengan gambar Docker untuk manajemen multi-pengguna, menjadikannya ideal untuk organisasi."
    ],
    "commentSummary": [
      "AnythingLLM adalah asisten AI desktop serba guna sumber terbuka yang dapat diinstal dan digunakan pada PC kantor standar, membuatnya dapat diakses oleh pengguna non-teknis.",
      "Alat ini mendukung berbagai fungsionalitas di luar hanya Model Bahasa Besar (LLM), termasuk model embedding, basis data vektor, dan teks-ke-ucapan/ucapan-ke-teks (TTS/STT), memungkinkan pembuatan chatbot suara yang sepenuhnya fungsional.",
      "Pengguna menghargai kemudahan instalasi dan penggunaannya, serta fleksibilitasnya dalam memungkinkan kontrol granular atas pengaturan seperti prompt sistem dan pemilihan model, yang melayani baik pengguna kasual maupun pengembang."
    ],
    "points": 108,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1725550845
  },
  {
    "id": 41451431,
    "title": "Array Berfase yang Terinspirasi dari Origami Sedang Membentuk Ulang Masa Depan Antena",
    "originLink": "https://www.viksnewsletter.com/p/origami-inspired-phased-arrays",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41451431",
    "commentBody": "",
    "originSummary": [
      "Array terinspirasi origami dapat menciptakan pola radiasi yang hampir tak terbatas dengan melipat antena menjadi berbagai bentuk, menawarkan kemajuan signifikan dalam teknologi komunikasi nirkabel.",
      "Kotak telur desain array fasa memungkinkan untuk konfigurasi fisik dan pengendalian balok elektronik, menjadikannya serbaguna untuk aplikasi seperti 5G, 6G, dan radar otomotif.",
      "Inovatif sistem interkoneksi lipat sangat penting untuk menjaga kinerja dan stabilitas dalam desain antena baru ini."
    ],
    "commentSummary": [
      "Array bertahap yang terinspirasi dari origami sedang dieksplorasi sebagai pendekatan baru dalam desain antena, yang berpotensi mengubah aplikasi di masa depan.",
      "Antena-antena ini dapat dilipat dan dibuka secara fisik, memungkinkan untuk konfigurasi ulang dan penyebaran yang dinamis, yang sangat berguna dalam aplikasi satelit.",
      "Meskipun desainnya inovatif, ada keraguan tentang kepraktisannya di luar penggunaan khusus berperforma tinggi karena kompleksitas dan potensi masalah dengan bagian yang bergerak."
    ],
    "points": 108,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1725488020
  },
  {
    "id": 41451707,
    "title": "SEC mendenda 6 lembaga pemeringkat kredit besar karena gagal menyimpan catatan elektronik",
    "originLink": "https://www.cnn.com/2024/09/03/business/sec-fines-credit-rating-agencies-over-failure-electronic-records/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41451707",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kantor Sekuritas dan Bursa (SEC) mendenda enam lembaga pemeringkat kredit utama karena gagal memelihara catatan elektronik, dengan Moody’s dan S&P Global masing-masing membayar $20 juta.",
      "Kritikus berpendapat bahwa denda-denda ini kecil dibandingkan dengan pendapatan agensi, sehingga menimbulkan kekhawatiran tentang efektivitas hukuman semacam itu.",
      "Insiden tersebut menyoroti masalah yang lebih luas terkait transparansi dan manajemen data dalam sektor keuangan."
    ],
    "points": 93,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1725490395
  }
]
