[
  {
    "id": 38122061,
    "title": "স্যাম ব্যাংকম্যান-ফ্রাইড দোষী সাব্যস্ত",
    "originLink": "https://www.nytimes.com/live/2023/11/02/business/sam-bankman-fried-trial",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38122061",
    "commentBody": "",
    "originSummary": [
      "এফটিএক্স ক্রিপ্টো এক্সচেঞ্জের প্রতিষ্ঠাতা স্যাম ব্যাংকম্যান-ফ্রাইডকে জালিয়াতি এবং ষড়যন্ত্রের সাতটি অভিযোগে দোষী সাব্যস্ত করা হয়েছে, অভিযোগ করেছেন যে তিনি তার ব্যবহারকারীদের কাছ থেকে প্রায় 10 বিলিয়ন ডলার আত্মসাৎ করেছেন।",
      "এফটিএক্সের পতন এবং পরবর্তী চার্জগুলি ক্রিপ্টোকারেন্সি শিল্পে বিপদ এবং বাড়াবাড়ির উদাহরণ হিসাবে ব্যবহৃত হচ্ছে।",
      "তার প্রাক্তন বান্ধবী এবং প্রাক্তন কর্মচারীসহ সাক্ষীরা বিচার চলাকালীন ব্যাংকম্যান-ফ্রাইডের বিরুদ্ধে সাক্ষ্য দিয়েছিলেন, তার বিরুদ্ধে ব্যক্তিগত ব্যয় এবং রাজনৈতিক অনুদানের জন্য ক্লায়েন্টের তহবিল আত্মসাতের অভিযোগ এনেছিলেন।"
    ],
    "commentSummary": [
      "নিউ ইয়র্ক টাইমসের একটি পোস্টের সাথে যুক্ত অনলাইন বিতর্কগুলিতে ক্রিপ্টো স্পেসে কথিত অসদাচরণের কারণে এফটিএক্সের সিইও স্যাম ব্যাংকম্যান-ফ্রাইডকে (এসবিএফ) দোষী সাব্যস্ত করার বিষয়ে আলোচনা করা হয়েছে।",
      "বিতর্কঅংশগ্রহণকারীরা এসবিএফের আদালতের আচরণ এবং স্পষ্ট প্রতিক্রিয়া সরবরাহ করতে অস্বীকার করে, তার চরিত্র, লালন-পালন এবং ক্রিপ্টো শিল্পের উপলব্ধি এবং নিয়ন্ত্রণের উপর এই মামলার সম্ভাব্য ক্ষতিকারক প্রভাব সম্পর্কিত যুক্তিসহ।",
      "ব্যবহারকারীর কথোপকথনের মধ্যে আইনী পদ্ধতি, ন্যায্যতা নিয়ে প্রশ্ন তোলা এবং অটিজম আদালতের প্রতিক্রিয়াগুলিকে প্রভাবিত করতে পারে এমন সম্ভাবনাগুলিও অন্তর্ভুক্ত রয়েছে, প্রতারণামূলক ব্যবসায়িক অনুশীলনের জন্য লাল পতাকা সম্পর্কে সতর্কতা, স্বচ্ছতা এবং শক্তিশালী অভ্যন্তরীণ নিয়ন্ত্রণের প্রয়োজনীয়তার উপর জোর দেওয়া।"
    ],
    "points": 1276,
    "commentCount": 1021,
    "retryCount": 0,
    "time": 1698968957
  },
  {
    "id": 38111483,
    "title": "ফেসবুক ও ইনস্টাগ্রামে ব্যক্তিগত বিজ্ঞাপন নিষিদ্ধ করল ইইউ ডেটা নিয়ন্ত্রক",
    "originLink": "https://www.reuters.com/technology/facebook-owner-faces-eu-ban-targeted-advertising-norway-says-2023-11-01/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38111483",
    "commentBody": "",
    "originSummary": [
      "ইউরোপীয় ডেটা নিয়ন্ত্রক সংস্থা ফেসবুক এবং ইনস্টাগ্রামে \"আচরণগত বিজ্ঞাপনের\" উপর নিষেধাজ্ঞা বাড়িয়ে ইউরোপীয় ইউনিয়ন এবং ইউরোপীয় অর্থনৈতিক অঞ্চলের সমস্ত দেশকে অন্তর্ভুক্ত করেছে।",
      "এই নিষেধাজ্ঞা, যা মেটা প্ল্যাটফর্মগুলিকে লক্ষ্যযুক্ত বিজ্ঞাপনের জন্য ব্যবহারকারীর ডেটা ব্যবহার করতে বাধা দেয়, যদি তারা মেনে চলতে ব্যর্থ হয় তবে সংস্থাটির বৈশ্বিক টার্নওভারের 4% পর্যন্ত সম্ভাব্য জরিমানা হতে পারে।",
      "ফেসবুকের মালিকানাধীন মেটা প্ল্যাটফর্মগুলি নতুন নিয়মগুলি পূরণের জন্য সাবস্ক্রিপশন মডেল মেনে চলার দিকে কাজ করছে এবং বিবেচনা করছে, যা ইউরোপ জুড়ে প্রায় 250 মিলিয়ন ব্যবহারকারীকে প্রভাবিত করতে পারে।"
    ],
    "commentSummary": [
      "ফেসবুক ও ইনস্টাগ্রামে ব্যক্তিগত বিজ্ঞাপন নিষিদ্ধ করার ইইউ ডেটা নিয়ন্ত্রকের সিদ্ধান্ত ব্যবহারকারীদের মধ্যে বিতর্কের জন্ম দিয়েছে।",
      "সমালোচকরা উদ্বেগ প্রকাশ করেছেন যে বিজ্ঞাপনদাতারা এই বিজ্ঞাপনগুলির জন্য অতিরিক্ত ডেটা ব্যবহার করে, সম্ভাব্য গোপনীয়তা আক্রমণ এবং অপব্যবহারের সম্ভাবনা তৈরি করে, যদিও ফেসবুক ইইউ এবং ইইএ ব্যবহারকারীদের এই অনুশীলনগুলিতে সম্মতি দেওয়ার অনুমতি দেওয়ার পরিকল্পনা করেছে।",
      "আলোচনাগুলি ব্যবহারকারীর গোপনীয়তা এবং ব্যক্তিগতকৃত বিজ্ঞাপনের সুবিধা, লক্ষ্যযুক্ত বিজ্ঞাপনগুলির সামাজিক প্রভাব এবং সংস্থাগুলির উপর অতিরিক্ত নিয়ন্ত্রণের প্রভাবগুলির মধ্যে ট্রেড-অফকেও স্পর্শ করে।"
    ],
    "points": 678,
    "commentCount": 704,
    "retryCount": 0,
    "time": 1698921266
  },
  {
    "id": 38112951,
    "title": "বিভ্রান্তিকর গিট পরিভাষা",
    "originLink": "https://jvns.ca/blog/2023/11/01/confusing-git-terminology/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38112951",
    "commentBody": "",
    "originSummary": [
      "জুলিয়া ইভান্স জটিল গিট পরিভাষাকে সহজ করে তুলছেন, জোর দিয়ে বলেছেন যে সফ্টওয়্যারের পরিবর্তনগুলি ট্র্যাক করার জন্য একটি ওপেন-সোর্স সিস্টেম গিটের কার্যকর ব্যবহারের জন্য এই পদগুলির সম্পূর্ণ বোঝা অত্যাবশ্যক।",
      "তিনি গিটের জটিল শব্দগুলোর মধ্যে গভীরভাবে ডুব দেন, যেমন \"মাথা এবং মাথা\", \"একীভূত করণ বা পুনর্গঠনের সময় আমাদের এবং তাদের\", \"বিচ্ছিন্ন হেড স্টেট\", \"1 প্রতিশ্রুতি দ্বারা 'উত্স / প্রধান' এর চেয়ে এগিয়ে\", এবং তাদের মধ্যে পার্থক্য ব্যাখ্যা করে।",
      "নিবন্ধটি তার বহুমুখী প্রকৃতি এবং জটিলতার কারণে গিটের পরিভাষায় অতিরিক্ত স্পষ্টতার প্রয়োজনীয়তা তুলে ধরেছে, \"রিসেট\", \"প্রত্যাবর্তন\", \"পুনরুদ্ধার\", বিভিন্ন প্রেক্ষাপটে \"ট্র্যাক\" শব্দটি এবং \"মার্জ\", \"রিবেস\" এবং \"চেরি-পিক\" এর মধ্যে পার্থক্যের মতো ধারণাগুলির উপর আলোকপাত করে।"
    ],
    "commentSummary": [
      "একটি হ্যাকার নিউজ থ্রেড জিটের জটিল পরিভাষা, সফ্টওয়্যার বিকাশের একটি প্রচলিত সংস্করণ নিয়ন্ত্রণ ব্যবস্থা এবং এর অন্তর্নিহিত নির্দেশিত অ্যাসাইক্লিক গ্রাফ (ডিএজি) বোঝার ক্ষেত্রে ব্যবহারকারীর অসুবিধাগুলি তুলে ধরেছে।",
      "ব্যবহারকারীরা স্পষ্ট ডকুমেন্টেশন এবং 'গিট রেফলগ' কমান্ডের মূল্যায়ন করার সময় গিট কমান্ড, ডিফল্ট যুক্তি এবং একীভূত হওয়ার জটিলতাগুলি বোঝার জন্য লড়াই করেছিলেন।",
      "এই সমস্যাগুলি সত্ত্বেও, ব্যবহারকারীরা সফ্টওয়্যার বিকাশে গিটের গুরুত্বপূর্ণ ভূমিকা এবং ফসিল, এসভিএন, পারফোর্স এবং মার্কুরিয়ালের মতো বিকল্প সংস্করণ নিয়ন্ত্রণ ব্যবস্থার উপর এর শ্রেষ্ঠত্বের প্রশংসা করেছিলেন।"
    ],
    "points": 528,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1698930333
  },
  {
    "id": 38121250,
    "title": "1886 সালে, মার্কিন যুক্তরাষ্ট্র প্রতিটি পরিচিত ফলের জলরঙের চিত্রগুলি কমিশন করে (2019)",
    "originLink": "https://www.openculture.com/2019/06/the-us-government-commissioned-7500-watercolor-paintings.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38121250",
    "commentBody": "",
    "originSummary": [
      "1886 সালে, মার্কিন সরকার ইউএসডিএ পোমোলজিকাল ওয়াটারকালার সংগ্রহ হিসাবে পরিচিত প্রতিটি পরিচিত ফলের 7,500 জলরঙের ছবি চালু করেছিল।",
      "২০১৫ সালে ইএফএফ অ্যাক্টিভিস্ট পার্কার হিগিন্স কর্তৃক জনসমক্ষে প্রকাশ করা এই সংগ্রহে একটি টুইটার বট রয়েছে যা আর্কাইভ থেকে এলোমেলো চিত্র প্রেরণ করে এবং মিশ্র পর্যালোচনা পেয়েছে।",
      "পাঠ্যটিতে বিভিন্ন ধরণের বিনামূল্যে শিক্ষাগত সংস্থানের পাশাপাশি ওপেন কালচার, এলএলসি, অডিও বই, অনলাইন কোর্স, ভাষা এবং পাঠ্যপুস্তকের মতো পরিষেবা সরবরাহকারী একটি সংস্থাও উল্লেখ করা হয়েছে।"
    ],
    "commentSummary": [
      "মার্কিন যুক্তরাষ্ট্র একসময় জন জেমস অডুবনের পাখির চিত্রকর্মের অনুরূপ প্রতিটি পরিচিত ফলের চিত্রগুলি কমিশন করেছিল, উভয়ই আজ মূল্যবান সংগ্রাহকের আইটেম।",
      "অডুবনের মতো ঐতিহাসিক ব্যক্তিত্বদের সম্পর্কে চলমান বিতর্ক রয়েছে, বিশেষত দাসত্বের মতো বিতর্কিত ইস্যুগুলির সাথে তাদের যোগসূত্র এবং তাদের সাথে যুক্ত সম্মান এবং স্মৃতিস্তম্ভগুলি সংরক্ষণ করা উচিত বা ভেঙে ফেলা উচিত কিনা।",
      "ব্যয়বহুল হওয়া সত্ত্বেও ঐতিহাসিক কাজের ডিজিটাইজেশন উপকারী হিসাবে বিবেচিত হয় কারণ এটি সংরক্ষণ, বিস্তৃত অ্যাক্সেস এবং উচ্চ-রেজোলিউশন অ্যাক্সেস বিক্রয়ের মাধ্যমে মুনাফার সম্ভাবনা সক্ষম করে।"
    ],
    "points": 407,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1698964208
  },
  {
    "id": 38114264,
    "title": "বড় বাড়িওয়ালারা সফটওয়্যার ব্যবহার করে ভাড়ার দাম নিয়ে প্রতারণা করত: ডিসির মামলা",
    "originLink": "https://arstechnica.com/tech-policy/2023/11/14-big-landlords-used-software-to-collude-on-rent-prices-dc-lawsuit-says/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38114264",
    "commentBody": "",
    "originSummary": [
      "ডিসির অ্যাটর্নি জেনারেল ১৪টি বড় বাড়িওয়ালা কোম্পানির বিরুদ্ধে মামলা করেছেন, অভিযোগ করেছেন যে তারা সম্পত্তি ব্যবস্থাপনা সফ্টওয়্যার রিয়েলপেজ ব্যবহার করে ভাড়ার দাম বাড়ানোর জন্য যোগসাজশ করেছে।",
      "সফ্টওয়্যার, একটি অ্যালগরিদম ব্যবহার করে, ভাড়া মূল্য পরামর্শ প্রদান করে। মামলায় অভিযোগ করা হয়েছে যে এই সুপারিশগুলি কৃত্রিমভাবে ভাড়া বাড়িয়ে ছে যার ফলে বাজার দরের তুলনায় বাসিন্দাদের দ্বারা লক্ষ লক্ষ টাকা অতিরিক্ত পরিশোধ করা হয়েছে।",
      "সফ্টওয়্যারটি ব্যাপকভাবে ব্যবহৃত হয়, 30% এরও বেশি মাল্টি-ইউনিট বিল্ডিং এবং 60% বিল্ডিং সহ 50 বা ততোধিক ইউনিট এটি নিযুক্ত করে। রিয়েলপেজ এবং জড়িত সংস্থাগুলি উভয়ই অতীতে একই রকম আইনি তদন্তের মুখোমুখি হয়েছে।"
    ],
    "commentSummary": [
      "একটি অনলাইন আলোচনার মূল বিষয় হ'ল ওয়াশিংটন ডিসিতে বড় বাড়িওয়ালারা ভাড়ার দাম গুলি পরিচালনা করার জন্য সফ্টওয়্যার ব্যবহার করার অভিযোগ, সম্ভাব্যভাবে মূল্য নির্ধারণ, জোরপূর্বক ডিজিটাল মূল্য নির্ধারণ এবং মজুরি দমনের মতো অবৈধ অনুশীলনের দিকে পরিচালিত করে।",
      "অংশগ্রহণকারীরা বিতর্ক করে যে রিয়েলপেজের মতো এই জাতীয় সফ্টওয়্যারগুলি অবৈধ ক্রিয়াকলাপকে উত্সাহিত করে বা সেক্টরের মধ্যে প্রয়োজনীয় স্বচ্ছতা সরবরাহ করে, খালি অ্যাপার্টমেন্টগুলিতে সম্পত্তি করের প্রভাব এবং রিয়েল এস্টেট বাজারের একচেটিয়াকরণের উপর দৃষ্টি নিবদ্ধ করে।",
      "তারা এই অনুশীলনগুলির সম্ভাব্য জটিলতা এবং নৈতিক প্রভাবগুলি মোকাবেলার জন্য আপডেট আইনগুলির প্রয়োজনীয়তা তুলে ধরে, উচ্চতর সম্পত্তি কর, উচ্ছেদের আগে ভাড়াটেদের জন্য আদালতের সহায়তা এবং ভাড়ার হার এবং সম্পত্তির মালিকানা নিয়ন্ত্রণের মতো সমাধানগুলির প্রস্তাব দেয়।"
    ],
    "points": 369,
    "commentCount": 341,
    "retryCount": 0,
    "time": 1698936640
  },
  {
    "id": 38118627,
    "title": "আগামী বছরের শুরুতে একটি পরীক্ষামূলক অ্যান্ড্রয়েড ওয়েবভিউ মিডিয়া ইন্টিগ্রিটি এপিআই",
    "originLink": "https://android-developers.googleblog.com/2023/11/increasing-trust-for-embedded-media.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38118627",
    "commentBody": "",
    "originSummary": [
      "অ্যান্ড্রয়েড দলটি একটি পরীক্ষামূলক অ্যান্ড্রয়েড ওয়েবভিউ মিডিয়া ইন্টিগ্রিটি এপিআই অগ্রণী ভূমিকা পালন করছে, যার লক্ষ্য অ্যান্ড্রয়েড অ্যাপ্লিকেশনগুলিতে এম্বেডেড মিডিয়ার জন্য সুরক্ষা এবং গোপনীয়তা ব্যবস্থা বাড়ানো।",
      "এই এপিআই, আগামী বছর নির্বাচিত এমবেডেড মিডিয়া সরবরাহকারীদের সাথে পরীক্ষার জন্য নির্ধারিত, একটি নিরাপদ পরিবেশ বজায় রেখে এবং সম্ভাব্য জালিয়াতি এবং অপব্যবহার রোধ করার সময় অ্যাপ্লিকেশনগুলির মধ্যে ওয়েব পৃষ্ঠাগুলিতে এম্বেডেড মিডিয়া প্রদর্শন সক্ষম করার চেষ্টা করে।",
      "মিডিয়া সরবরাহকারীদের একটি ডিভাইস এবং অ্যাপ্লিকেশন অখণ্ডতা রায় প্রদান করে, এই এপিআই নিশ্চিত করে যে মিডিয়া স্ট্রিমগুলি কোনও ব্যবহারকারী বা ডিভাইস সনাক্তকারী প্রকাশ না করে একটি বিশ্বস্ত এবং সুরক্ষিত পরিবেশের মধ্যে কাজ করে। উপরন্তু, মিডিয়া সামগ্রী সরবরাহকারীদের আগামী বছর একটি প্রাথমিক অ্যাক্সেস প্রোগ্রামে আমন্ত্রণ জানানো হয়।"
    ],
    "commentSummary": [
      "গুগল আগামী বছর একটি পরীক্ষামূলক অ্যান্ড্রয়েড ওয়েবভিউ মিডিয়া ইন্টিগ্রিটি এপিআই প্রকাশ করতে চায়, যার ফলে সমালোচকদের মধ্যে অ্যাডব্লকারগুলির উপর সম্ভাব্য প্রভাব এবং ওয়েবের উন্মুক্ততা, নামহীনতা এবং বিকেন্দ্রীকরণ সম্পর্কে উদ্বেগ দেখা দেয়।",
      "নিরাপত্তা এবং স্বাধীনতার মধ্যে ভারসাম্য, গুগলকে সিদ্ধান্ত গ্রহণের প্রক্রিয়াগুলি নিয়ন্ত্রণ করা থেকে বিরত রাখা এবং ক্রোমের জন্য গুগলের স্থগিত ওয়েব এনভায়রনমেন্ট ইন্টিগ্রিটি (ডাব্লুইআই) প্রস্তাবের প্রভাবের মতো বিষয়গুলি নিয়ে বিতর্ক চলছে।",
      "প্রযুক্তি জায়ান্ট, ক্রোমের জন্য তার ডাব্লুইআই প্রস্তাব স্থগিত করা সত্ত্বেও, এটি অ্যান্ড্রয়েড ওয়েবভিউ এপিআই-এর জন্য প্রয়োগ করার পরিকল্পনা করেছে, যার ফলে ওয়েবভিউয়ের দুর্বলতা এবং সম্ভাব্য পাল্টা ব্যবস্থা সম্পর্কে আলোচনা শুরু হয়েছে।"
    ],
    "points": 360,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1698952784
  },
  {
    "id": 38117556,
    "title": "আলো তাপ ছাড়াই জল বাষ্পীভূত করতে পারে",
    "originLink": "https://news.mit.edu/2023/surprising-finding-light-makes-water-evaporate-without-heat-1031",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38117556",
    "commentBody": "",
    "originSummary": [
      "এমআইটি গবেষকরা দেখেছেন যে আলো তাপ ছাড়াই জল বাষ্পীভূত করতে পারে, এটি তাপ-প্ররোচিত বাষ্পীভবনের চেয়ে আরও কার্যকর প্রক্রিয়া। এটি জল এবং বায়ুর সংযোগস্থলে ঘটে, প্রায়শই কুয়াশা এবং মেঘ গঠনের মতো প্রাকৃতিক ঘটনাগুলিতে দেখা যায়।",
      "ফটোমোলিকুলার এফেক্ট নামে পরিচিত এই প্রক্রিয়াটি জল এবং বিভিন্ন শিল্প প্রক্রিয়াগুলির সৌর-চালিত ডিস্যালিনেশনে গুরুত্বপূর্ণ ভূমিকা পালন করতে পারে।",
      "গবেষণা দলটি সৌর লবণাক্তকরণ ব্যবস্থার উন্নতি এবং জলবায়ু পরিবর্তনের প্রভাবগুলি পরীক্ষা করার মতো বাস্তব বিশ্বের সমস্যাগুলি মোকাবেলায় নতুন-পাওয়া প্রক্রিয়াটি ব্যবহার করার প্রচেষ্টা চালাচ্ছে।"
    ],
    "commentSummary": [
      "গবেষকরা দেখতে পেয়েছেন যে আলো তাপ ছাড়াই জল বাষ্পীভবনকে প্ররোচিত করতে পারে, সবুজ আলো সবচেয়ে শক্তিশালী প্রভাব দেখায়।",
      "এই আবিষ্কারটি উদ্ভিদ, জলবায়ু এবং পরিষ্কার জল এবং শক্তি প্রযুক্তিতে সালোকসংশ্লেষণ এবং বাষ্পীভবনের উপর প্রভাব ফেলতে পারে, কারণ প্রক্রিয়াটি প্রাকৃতিকভাবে ঘটে এবং হাইড্রোজেলগুলিতে দেখা গেছে।",
      "বিভিন্ন পরিস্থিতিতে জলের অণুগুলির আচরণ এবং এখনও বোঝা যায় না এমন প্রক্রিয়া সম্পর্কে আলোচনা যার মাধ্যমে আলো বাষ্পীভবনকে ট্রিগার করে বৈজ্ঞানিক সম্প্রদায়ের মধ্যে চলছে।"
    ],
    "points": 354,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1698947997
  },
  {
    "id": 38113525,
    "title": "রাস্পবেরি পাই আর্ম থেকে কৌশলগত বিনিয়োগ পেয়েছে",
    "originLink": "https://newsroom.arm.com/news/raspberry-pi-investment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38113525",
    "commentBody": "",
    "originSummary": [
      "সেমিকন্ডাক্টর এবং সফটওয়্যার ডিজাইন ফার্ম আর্ম আইওটি ডেভেলপার সম্প্রদায়ের সেবা য় তাদের দীর্ঘদিনের অংশীদারিত্বকে শক্তিশালী করার জন্য রাস্পবেরি পাইতে একটি সংখ্যালঘু শেয়ার কিনেছে।",
      "আর্ম ২০০৮ সাল থেকে রাস্পবেরি পাইকে উচ্চ-পারফরম্যান্স কম্পিউটিং সমাধান সরবরাহ করছে এবং সম্প্রতি সফ্টওয়্যার-সংজ্ঞায়িত যানবাহনের জন্য একটি গাইড এবং একটি মিউজিক প্লেয়ার টিউটোরিয়াল সহ বিভিন্ন আপডেট প্রকাশ করেছে।",
      "কোম্পানির ভবিষ্যত পরিকল্পনায় নৈতিক এআই অ্যাপ্লিকেশন, এআই গভর্নেন্স এবং অটোমোটিভ শিল্পে উচ্চ-পারফরম্যান্স সফ্টওয়্যারের সম্ভাবনা অন্বেষণের দিকে মনোনিবেশ করা জড়িত।"
    ],
    "commentSummary": [
      "প্রযুক্তি কোম্পানি আর্ম কৌশলগতভাবে রাস্পবেরি পাই-তে বিনিয়োগ করেছে, সম্ভবত আরআইএসসি-ভি প্রযুক্তিতে সম্ভাব্য স্যুইচকে প্রতিহত করার জন্য।",
      "ব্যবহারকারীরা ওয়েফার এলাকার ক্ষেত্রে এর নমনীয়তা এবং ব্যয়-কার্যকারিতা সহ আরআইএসসি-ভি-তে স্যুইচ করার সম্ভাব্য সুবিধাগুলি তুলে ধরেছেন, তবে সফ্টওয়্যার সমর্থন পার্থক্য এবং আরআইএসসি-ভি-এর এআরএম ের ক্ষমতার সাথে মেলে এমন সময় সম্পর্কেও উদ্বেগ প্রকাশ করেছেন।",
      "আপগ্রেড সমর্থনের অভাব এবং অনুপস্থিত বৈশিষ্ট্যগুলির কারণে সর্বশেষ রাস্পবেরি পাই সিরিজ নিয়ে ব্যবহারকারীদের অসন্তুষ্টি রয়েছে।"
    ],
    "points": 326,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1698933164
  },
  {
    "id": 38119861,
    "title": "একটি নিদ্রাহীন রাত ইঁদুরের মধ্যে বেশ কয়েক দিনের জন্য হতাশাকে দ্রুত বিপরীত করতে পারে",
    "originLink": "https://news.northwestern.edu/stories/2023/11/one-sleepless-night-can-rapidly-reverse-depression-for-several-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38119861",
    "commentBody": "",
    "originSummary": [
      "নর্থওয়েস্টার্ন ইউনিভার্সিটির নিউরোবায়োলজিস্টরা আবিষ্কার করেছেন যে একটি নিদ্রাহীন রাত মস্তিষ্কে ডোপামিন নিঃসরণ এবং বর্ধিত সিনাপটিক প্লাস্টিসিটির কারণে হতাশাকে সংক্ষিপ্তভাবে হ্রাস করতে পারে।",
      "এই অনুসন্ধানগুলি মেজাজের রূপান্তর, কার্যকর দ্রুত-অভিনয়কারী এন্টিডিপ্রেসেন্টস এবং এন্টিডিপ্রেসেন্ট ওষুধের জন্য নতুন সম্ভাবনাগুলি বোঝার জন্য মূল্যবান অন্তর্দৃষ্টি অবদান রাখতে পারে।",
      "এই সুবিধাগুলি সত্ত্বেও, গবেষকরা সমাধান হিসাবে উদ্দেশ্যমূলকভাবে ঘুম বঞ্চনাকে প্ররোচিত করার বিরুদ্ধে আহ্বান জানিয়েছেন কারণ দীর্ঘস্থায়ী ঘুম বঞ্চনাসর্বজনীন ক্ষতিকারক প্রভাব ফেলতে পারে।"
    ],
    "commentSummary": [
      "আলোচিত নিবন্ধটি বোঝায় যে অস্থায়ী ঘুমবঞ্চনা ইঁদুরের মধ্যে হতাশার লক্ষণগুলি হ্রাস করতে পারে, যার ফলে অনলাইন সংলাপগুলি নিদ্রাহীন রাতের পরে মেজাজের উন্নতির ব্যক্তিগত উদাহরণগুলি ভাগ করে নেয়।",
      "ব্যবহারকারীদের সিলেক্টিভ সেরোটোনিন রিউপটেক ইনহিবিটারস (এসএসআরআই) সম্পর্কে বিভিন্ন দৃষ্টিভঙ্গি রয়েছে, হতাশা এবং উদ্বেগের জন্য একটি সাধারণ চিকিত্সা, প্রায়শই প্রত্যাহারের প্রভাব এবং সম্ভাব্য নির্ভরতার মতো নেতিবাচক বিষয়গুলিতে মনোনিবেশ করে।",
      "দীর্ঘমেয়াদী স্বাস্থ্যের জন্য ঘুমের গুরুত্বের উপর জোর দেওয়ার পাশাপাশি ঘুমের সহায়তার জন্য গাঁজা, ঘুমের স্বাস্থ্যবিধি পরিচালনা এবং ঘুমের সময়সূচী সামঞ্জস্য করার মতো বিকল্পগুলি নিয়ে আলোচনা করা হয়েছিল এবং ঘুমের বঞ্চনা এবং হতাশার মধ্যে সম্পর্কের উপর শক্তিশালী গবেষণা করা হয়েছিল।"
    ],
    "points": 316,
    "commentCount": 258,
    "retryCount": 0,
    "time": 1698957798
  },
  {
    "id": 38121994,
    "title": "গুগল ওয়েব এনভায়রনমেন্ট ইন্টিগ্রিটি এপিআই পরিত্যাগ করে",
    "originLink": "https://www.theregister.com/2023/11/02/google_abandons_web_environment_integrity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38121994",
    "commentBody": "",
    "originSummary": [
      "গুগল বিতর্কিত ওয়েব এনভায়রনমেন্ট ইন্টিগ্রিটি এপিআই-এর উন্নয়ন বন্ধ করে দিয়েছে, প্রাথমিকভাবে অনলাইন জালিয়াতি রোধের লক্ষ্যে, কারণ এটি ওয়েবসাইটগুলির জন্য ডিজিটাল রাইটস ম্যানেজমেন্টের (ডিআরএম) অনুরূপ, সম্ভাব্য অনলাইন স্বাধীনতা এবং ব্রাউজারের অগ্রাধিকারকে নির্দেশ করে।",
      "এখন, গুগল অ্যান্ড্রয়েড ওয়েবভিউজের জন্য একচেটিয়াভাবে এই প্রযুক্তির আরও সীমাবদ্ধ সংস্করণ ব্যবহার করার পরিকল্পনা করেছে, ক্রোমের একটি সংস্করণ যা অ্যান্ড্রয়েড অ্যাপ্লিকেশনগুলির মধ্যে একীভূত করার জন্য ডিজাইন করা হয়েছে।",
      "ফোকাসের এই পরিবর্তনটি প্রযুক্তি সম্প্রদায়ের কাছ থেকে উল্লেখযোগ্য সমালোচনামূলক প্রতিক্রিয়ার পরে উদ্ভূত হয়েছিল; গুগলের অ্যান্ড্রয়েড টিম নিশ্চিত করেছে যে অ্যান্ড্রয়েড ওয়েবভিউ এবং ইন্টিগ্রেটেড মিডিয়ার বাইরে এই কার্যকারিতা বাস্তবায়নের কোনও পরিকল্পনা নেই।"
    ],
    "commentSummary": [
      "গুগল ওয়েব এনভায়রনমেন্ট ইন্টিগ্রিটি এপিআই এর উন্নয়ন বন্ধ করে দিয়েছে, অ্যান্ড্রয়েড ওয়েবভিউ মিডিয়া ইন্টিগ্রিটি এপিআইতে তার ফোকাস পুনর্নির্দেশ করেছে, যার ফলে সম্ভাব্য নিরাপত্তা উদ্বেগ এবং অন্যায্য ডিজিটাল রাইটস ম্যানেজমেন্ট (ডিআরএম) অনুশীলনের সম্ভাব্য বৃদ্ধি সম্পর্কে অনলাইন বিতর্ক শুরু হয়েছে।",
      "ব্যবহারকারীরা ক্রোমিয়াম দ্বারা বিশ্বস্ত প্ল্যাটফর্ম মডিউল (টিপিএম) প্রয়োগ, বটগুলির বিরুদ্ধে সংগ্রাম এবং ডিআরএম মানের পরিবর্তন, বিশেষত আরও বন্ধ ওয়েব উদ্যোগের দিকে স্থানান্তর নিয়ে আলোচনা করেছেন।",
      "কমিউনিটি যাচাই-বাছাই গুগলের নিজস্ব ব্র্যান্ডের খ্যাতির ব্যবস্থাপনা পর্যন্ত বিস্তৃত, এবং তারা এমন সমাধানের আহ্বান জানাচ্ছে যা উদ্ভাবনকে বাধা না দিয়ে শেষ ব্যবহারকারীর প্রয়োজনকে অগ্রাধিকার দেয়।"
    ],
    "points": 249,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1698968492
  },
  {
    "id": 38112827,
    "title": "সফটওয়্যার ইঞ্জিনিয়ার হিসাবে কীভাবে স্ক্রু করা যায় না [ভিডিও]",
    "originLink": "https://www.ycombinator.com/library/KF-how-to-not-get-screwed-over-as-a-software-engineer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38112827",
    "commentBody": "",
    "originSummary": [
      "ডাল্টন ক্যালডওয়েল এবং মাইকেল সিবেল ডাল্টন অ্যান্ড মাইকেলের একটি পর্বে একটি সংস্থা শুরু করার সময় প্রযুক্তিগত প্রতিষ্ঠাতা এবং প্রাথমিক প্রযুক্তিগত কর্মীদের মুখোমুখি হওয়া অসুবিধাগুলি নিয়ে আলোচনা করেছিলেন।",
      "তারা একজনের মূল্য বোঝা, উপযুক্ত ইক্যুইটি বিতরণ, দায়িত্ব বিভাজন এবং সঠিক সহ-প্রতিষ্ঠাতা নির্বাচন করার মতো গুরুত্বপূর্ণ বিবেচনার বিষয়ে পরামর্শ ভাগ করে নিয়েছিল।",
      "ওয়াইসি সহ-প্রতিষ্ঠাতা ম্যাচিংকে সম্ভাব্য সহ-প্রতিষ্ঠাতাদের সন্ধানের জন্য একটি নির্ভরযোগ্য সংস্থান হিসাবে পরামর্শ দেওয়া হয়েছিল এবং তারা স্টার্টআপ এবং প্রযুক্তি পেশাদারদের জন্য গুরুত্বপূর্ণ বিষয়গুলি কভার করে আসন্ন পর্বগুলির ও ইঙ্গিত দিয়েছিল।"
    ],
    "commentSummary": [
      "হ্যাকার নিউজ আলোচনা স্টার্টআপগুলিতে সফ্টওয়্যার প্রকৌশলীদের তাৎপর্য এবং ফাংশনগুলি নিয়ে আলোচনা করে, ইক্যুইটি, বেতন এবং কাজের সংস্কৃতির দাবির মতো বিষয়গুলি তুলে ধরে।",
      "সংলাপটি বোঝায় যে প্রকৌশলীরা অভিজ্ঞ প্রযুক্তি সংস্থাগুলিতে যোগদান করে বা তাদের নিজস্ব শুরু করে আরও বেশি উপকৃত হতে পারেন, কারণ অনেকে তাদের স্টক বিকল্প লাভসম্পর্কে অসন্তুষ্টি প্রকাশ করে। পরিচালনার ভূমিকা সম্পর্কে ভুল ধারণাগুলিও বিভক্ত করা হয়।",
      "চুক্তি আলোচনার সময় বিশেষজ্ঞদের সাথে পরামর্শের গুরুত্ব নিশ্চিত করার সময় সফ্টওয়্যার প্রকৌশলীদের উভয়কেই তাদের ভূমিকাগুলি আরও ভালভাবে বুঝতে এবং তাদের কাজকে অবমূল্যায়ন করা এড়ানোর জন্য পরামর্শগুলি প্রচুর। উল্লেখযোগ্যভাবে, পদোন্নতি এবং নেতৃত্বের ভূমিকার জন্য নরম দক্ষতার প্রয়োজনীয়তার উপর জোর দেওয়া হয়।"
    ],
    "points": 240,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1698929627
  },
  {
    "id": 38112474,
    "title": "ফাইল নামে ফাইল এক্সটেনশন আবিষ্কার করেন কে?",
    "originLink": "https://retrocomputing.stackexchange.com/questions/27926/who-invented-file-extensions-in-file-names",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38112474",
    "commentBody": "",
    "originSummary": [
      "রেট্রোকম্পিউটিং স্ট্যাক এক্সচেঞ্জ ফোরাম ফাইল নামগুলিতে ফাইল এক্সটেনশনগুলির উত্স অন্বেষণ করে, 1961 সালে এমআইটির সামঞ্জস্যপূর্ণ টাইম-শেয়ারিং সিস্টেমের সাথে এটির সূচনা এবং 1964 সালে পিডিপি -6 এর মাল্টিপ্রসেসিং মনিটর থেকে বিভাজক হিসাবে ডট ব্যবহারের পরামর্শ দেয়।",
      "আলোচনাটি স্টোরেজ সিস্টেম এবং একাধিক অপারেটিং সিস্টেমের বৃদ্ধির সাথে ফাইল এক্সটেনশনগুলির বিবর্তনের উপরও দৃষ্টি নিবদ্ধ করে, সিস্টেমের সীমাবদ্ধতার মধ্যে ঐতিহাসিক সামঞ্জস্যগুলি পরীক্ষা করে।",
      "কম্পিউটিং ইতিহাসের এই কনফিগারেশনগুলি কীভাবে আধুনিক কম্পিউটিং কনভেনশনগুলিকে আকার দিয়েছে তার আলোকসজ্জায় এই পোস্টের গুরুত্ব নিহিত রয়েছে।"
    ],
    "commentSummary": [],
    "points": 235,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1698927590
  },
  {
    "id": 38112515,
    "title": "Cloudflare API Down",
    "originLink": "https://www.cloudflarestatus.com/incidents/hm7491k53ppg",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38112515",
    "commentBody": "",
    "originSummary": [
      "ক্লাউডফ্লেয়ার, একটি ওয়েব পারফরম্যান্স এবং সুরক্ষা সংস্থা, তাদের ডেটা সেন্টারগুলিতে বিদ্যুৎ বিভ্রাটের কারণে লগপুশ, ক্লাউডফ্লেয়ার ড্যাশ, স্ট্রিম এপিআই এবং রাডারের মতো ফাংশনগুলিকে প্রভাবিত করে ব্যাপক পরিষেবা সমস্যার মুখোমুখি হয়েছে।",
      "কিছু পরিষেবা আংশিকভাবে অবনমিত বা পুরোপুরি অফলাইন, এবং লগপুশ লগ এবং বিশ্লেষণ সম্পর্কিত ডেটা ক্ষতির প্রতিবেদন প্রকাশিত হয়েছে। প্রচেষ্টা সত্ত্বেও, অনেক পরিষেবার জন্য সম্পূর্ণ কার্যকারিতা এখনও পুনরুদ্ধার করা হয়নি।",
      "২০২৩ সালের ০২ নভেম্বর এই সমস্যা শুরু হলেও প্রতিষ্ঠানটির কনটেন্ট ডেলিভারি নেটওয়ার্ক (সিডিএন) এবং সিকিউরিটি ফিচারগুলো প্রভাবিত হয়নি, যা এ ধরনের ইস্যুর মুখে এসব দিকগুলোর স্থিতিস্থাপকতা তুলে ধরে।"
    ],
    "commentSummary": [],
    "points": 233,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1698927838
  },
  {
    "id": 38117289,
    "title": "এআই নিরাপত্তা এবং উন্মুক্ততা সম্পর্কিত যৌথ বিবৃতি",
    "originLink": "https://open.mozilla.org/letter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38117289",
    "commentBody": "",
    "originSummary": [
      "31 অক্টোবর, 2023 এ, মোজিলা সম্ভাব্য ক্ষতি রোধ করতে স্বচ্ছতা, উন্মুক্ততা এবং এআই প্রযুক্তিতে বিস্তৃত অ্যাক্সেসযোগ্যতার পক্ষে একটি যৌথ বিবৃতি প্রকাশ করেছে।",
      "বিবৃতিতে মৌলিক এআই মডেলগুলির উপর ব্যক্তিগত আধিপত্যের সমালোচনা করা হয়েছে এবং তাড়াহুড়ো করে প্রবিধানের বিরুদ্ধে সতর্ক করা হয়েছে যা প্রতিযোগিতা এবং উদ্ভাবনকে বাধা গ্রস্ত করতে পারে।",
      "স্বাক্ষরকারীরা, বিভিন্ন ডোমেনের পেশাদাররা, এআই ঝুঁকি বোঝার জন্য ওপেন-সোর্স এবং ওপেন সায়েন্সকে সমর্থন করে, জনসাধারণের জবাবদিহিতা নিশ্চিত করে এবং বাজারে নতুনদের জন্য বাধা হ্রাস করে।"
    ],
    "commentSummary": [
      "হ্যাকার নিউজের একটি অনলাইন ফোরামে এআই নিয়ন্ত্রণ, এআই-এর সম্ভাব্য অপব্যবহার এবং কয়েকটি কর্পোরেশনে ক্ষমতার কেন্দ্রীকরণ নিয়ে আলোচনা এবং বিতর্ক ের সূত্রপাত হয়েছিল।",
      "কমিউনিটি ওপেন-সোর্স এআই এবং এআই উন্নয়নে স্বচ্ছতার পক্ষে সমর্থন ের দিকে অগ্রাধিকারমূলক সম্মতি দেখিয়েছে, অন্যদিকে এআই প্রযুক্তি ভুল হাতে চলে যাওয়ার আশঙ্কা প্রকাশ করেছে, যার মধ্যে রাষ্ট্রীয় স্তরের অভিনেতা এবং হাইপার-ইন্টেলিজেন্ট মেশিনও রয়েছে।",
      "আলোচনাটি মার্কিন যুক্তরাষ্ট্র, চীন এবং ইউরোপ সহ বিভিন্ন দেশের ভূমিকা এবং উদ্বেগের উপর দৃষ্টি নিবদ্ধ করে এবং এআই সুরক্ষা বিধিগুলির তাত্ক্ষণিকতা সম্পর্কে কিছু সন্দেহের সাথে এআই উন্নয়ন এবং ভূ-রাজনৈতিক ইস্যুগুলির বিশ্বব্যাপী প্রভাবগুলি ঘিরেও আবর্তিত হয়েছিল।"
    ],
    "points": 231,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698946897
  },
  {
    "id": 38120097,
    "title": "স্যালি পূর্ববর্তী নির্দেশাবলী উপেক্ষা করুন",
    "originLink": "https://www.haihai.ai/pen15/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38120097",
    "commentBody": "",
    "originSummary": [
      "কুইটকার্বনের সহ-প্রতিষ্ঠাতা বেন স্টেইন এআই টেক্সট অ্যাডভেঞ্চার গেম ব্যবহারের সময় আবিষ্কৃত ল্যাঙ্গুয়েজ লার্নিং মডেলগুলিতে (এলএলএম) তাত্ক্ষণিক ইনজেকশনের বিষয়টি নিয়ে কথা বলেছেন, বলেছেন যে ক্ষতিকারক বা অনুপযুক্ত পিটিশন জিজ্ঞাসা করার জন্য দূষিত অভিনেতারা এই ধরনের অনুপ্রবেশ ব্যবহার করতে পারে।",
      "স্টেইন দেখতে পান যে এলএলএমকে তাদের প্রক্রিয়াকরণের আগে ইনপুটগুলি স্যানিটাইজ করতে বলে, ম্যানিপুলেশন প্রচেষ্টাগুলি কার্যকরভাবে সনাক্ত করা এবং প্রতিহত করা সম্ভব। মডেলটি অনুপযুক্ত অনুরোধগুলি সনাক্ত করতে নির্ভরযোগ্য কর্মক্ষমতা প্রদর্শন করেছে।",
      "আশাব্যঞ্জক প্রাথমিক ফলাফল সত্ত্বেও, স্টেইন স্বীকার করেছেন যে আরও পরীক্ষার প্রয়োজন এবং যুক্তি দেন যে ভবিষ্যতের সমাধানগুলির জন্য ওয়েব অ্যাপ্লিকেশন ফায়ারওয়ালের মতো অ্যাপ্লিকেশন বা পরিমাপগুলিতে অন্তর্নির্মিত প্রতিরক্ষা প্রয়োজন হতে পারে।"
    ],
    "commentSummary": [
      "হ্যাকার নিউজ এনবিএ গেমগুলিতে ফ্যান টেক্সটগুলিতে অনুপযুক্ত সামগ্রী পরিচালনার চ্যালেঞ্জ এবং প্রযুক্তিতে সুরক্ষা, সেন্সরশিপ এবং ভাষা সম্পর্কিত বিস্তৃত উদ্বেগ সম্পর্কে একটি আলোচনা পরিচালনা করেছিল, বড় ভাষা মডেল (এলএলএম) এবং টুরিং-সম্পূর্ণ ভাষা প্রম্পটগুলিতে মনোনিবেশ করেছিল।",
      "বিভিন্ন কৌশল ের পরামর্শ দেওয়া হয়েছিল, যার মধ্যে নির্দিষ্ট প্রম্পটগুলি সীমাবদ্ধ করা, ম্যানিপুলেশনকে আরও শক্ত করা এবং প্রমাণ সহকারী ব্যবহার করা অন্তর্ভুক্ত ছিল, তবে ডেটা থেকে নিয়ন্ত্রণকে আলাদা করার প্রক্রিয়াটি জটিল রয়ে গেছে।",
      "দক্ষ এনকোডিংয়ের প্রয়োজনীয়তা, সম্ভাব্য দুর্বলতা এবং ভুল বা অনিরাপদ কমান্ডের সম্ভাব্য ঝুঁকিগুলিও বিতর্কিত হয়েছিল, যদিও আলোচনায় কোনও নির্দিষ্ট সমাধান বা ঐকমত্য অর্জিত হয়নি।"
    ],
    "points": 223,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1698958954
  }
]
