[
  {
    "id": 38282166,
    "title": "16 वर्षीय ब्लेंडर ने यूके यंग एनिमेटर ऑफ द ईयर प्रतियोगिता जीती",
    "originLink": "https://younganimator.uk/winner/1699875910225x437970782709919500",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38282166",
    "commentBody": "",
    "originSummary": [
      "यंग एनिमेटर ऑफ द ईयर यूके प्रतियोगिता यूके में युवा एनिमेटरों के लिए समर्थन और संसाधन प्रदान करती है।",
      "एनिमेटर्स प्रतियोगिता में शामिल हो सकते हैं और प्रतियोगिता की वेबसाइट के माध्यम से अपना काम जमा कर सकते हैं।",
      "प्रतियोगिता ब्लू चिड़ियाघर एनीमेशन स्टूडियो द्वारा समर्थित है और इसकी एक गोपनीयता नीति है।"
    ],
    "commentSummary": [
      "16 वर्षीय यूआन को उनके ब्लेंडर-निर्मित एनीमेशन के लिए यूके यंग एनिमेटर ऑफ द ईयर पुरस्कार से सम्मानित किया गया।",
      "एनीमेशन को सकारात्मक प्रतिक्रिया मिली, जिसमें विशिष्ट आंदोलनों के बारे में मामूली आलोचना एं थीं।",
      "दर्शक एनीमेशन में प्रदर्शित किशोर की प्रतिभा, कौशल, तकनीकी निष्पादन और रचनात्मकता से प्रभावित थे, जो इयान ह्यूबर्ट के काम की तुलना करते थे।"
    ],
    "points": 1195,
    "commentCount": 155,
    "retryCount": 0,
    "time": 1700080950
  },
  {
    "id": 38276951,
    "title": "पारस्परिक प्रचार की शक्ति: छोटी वेबसाइटों के लिए खोज संकट का समाधान",
    "originLink": "https://www.marginalia.nu/log/19-website-discoverability-crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38276951",
    "commentBody": "",
    "originSummary": [
      "इंटरनेट पर छोटी वेबसाइटों की खोज की कठिनाई पर चर्चा की जाती है।",
      "दिलचस्प वेबसाइटों को बढ़ावा देने और खोजने के लिए बुकमार्क की सूची बनाने और साझा करने का समाधान प्रस्तावित है।",
      "लेखक इस बात पर जोर देता है कि एक-दूसरे की वेबसाइटों को बढ़ावा देने से छोटी वेबसाइटों के समृद्ध समुदाय को बढ़ावा मिल सकता है।"
    ],
    "commentSummary": [
      "लेख और चर्चा छोटी वेबसाइट की खोज की समस्या और अधिक खुले और विविध इंटरनेट अनुभव की इच्छा के आसपास केंद्रित है।",
      "प्रतिभागी सोशल मीडिया प्लेटफार्मों और छोटी वेबसाइटों को बढ़ावा देने की चुनौतियों के साथ निराशा व्यक्त करते हैं।",
      "समाधान के लिए सुझावों में क्यूरेटेड लिंक निर्देशिका, बुकमार्क ब्राउज़र एक्सटेंशन और आरएसएस फ़ीड का उपयोग शामिल है।"
    ],
    "points": 528,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1700058696
  },
  {
    "id": 38277926,
    "title": "जीपीटी की क्षमता को उजागर करना: डिजार्गोनाइज़र से कोड दुभाषियों तक",
    "originLink": "https://simonwillison.net/2023/Nov/15/gpts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38277926",
    "commentBody": "",
    "originSummary": [
      "ओपनएआई डेवडे ने जीपीटी, अनुकूलन योग्य चैट बॉट की शुरूआत का प्रदर्शन किया, जिसे दूसरों के साथ साझा किया जा सकता है।",
      "लेखक द्वारा बनाए गए जीपीटी, जैसे कि डेजार्गोनाइज़र और जावास्क्रिप्ट कोड इंटरप्रेटर, पर प्रकाश डाला गया है।",
      "जीपीटी निजी या सार्वजनिक हो सकते हैं और विशेष रूप से ChatGPT प्लस ग्राहकों के लिए उपलब्ध हैं, जिसमें GPT मॉडल, उनकी चुनौतियों और सीमाओं का उपयोग करके बनाई गई कई परियोजनाओं पर चर्चा होती है।"
    ],
    "commentSummary": [
      "लेख चैटबॉट्स में जीपीटी के उपयोग की पड़ताल करता है और छिपे हुए व्यवहार और संकेतों के बारे में चिंताओं को उठाता है।",
      "प्रतिभागी जीपीटी पर अपने अनुभव और विचार साझा करते हैं, जिसमें एआई मॉडल, पारदर्शिता, विश्वास और नैतिक विचारों पर चर्चा शामिल है।",
      "बातचीत में एआई की तुलना में मनुष्यों की सीमाएं, गोपनीयता संबंधी चिंताएं, कस्टम डेटा का एकीकरण और जीपीटी -3.5 और आरएलएचएफ में सुधार जैसे विषय भी शामिल हैं।"
    ],
    "points": 410,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1700063063
  },
  {
    "id": 38282950,
    "title": "कोड ऑप्टिमाइज़ करना: IFS को ऊपर और नीचे धकेलना",
    "originLink": "https://matklad.github.io/2023/11/15/push-ifs-up-and-fors-down.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38282950",
    "commentBody": "",
    "originSummary": [
      "अधिक कुशल और बग-मुक्त कोड लिखने के लिए, सशर्त कथनों (आईएफएस) को कॉलर फ़ंक्शन के अंदर रखने के बजाय उन्हें कॉलर फ़ंक्शन तक धकेलने पर विचार करें।",
      "अलग-अलग संस्थाओं के बजाय वस्तुओं के बैचों पर संचालन स्टार्टअप लागत को कम करके और प्रसंस्करण क्रम में लचीलापन प्रदान करके बेहतर प्रदर्शन का कारण बन सकता है।",
      "इन दो नियमों के संयोजन से कोड को और अनुकूलित किया जा सकता है और समग्र दक्षता में वृद्धि हो सकती है।"
    ],
    "commentSummary": [
      "लेख प्रदर्शन पर परिवर्तनशीलता और शुद्धता को प्राथमिकता देकर कोड को अनुकूलित करने के विचार की पड़ताल करता है।",
      "यह अच्छे कोड डिजाइन, आर्किटेक्चर और शुरुआती रिटर्न और गार्ड क्लॉज के उपयोग के महत्व पर जोर देता है।",
      "चर्चा में कॉलर तक सशर्त जांच और लूप को स्थानांतरित करने और NULL मानों को संभालने के साथ-साथ कोड में निर्णय लेने और कोडिंग दिशानिर्देशों का पालन करने के पेशेवरों और विपक्षों के व्यापार-बंद शामिल हैं।"
    ],
    "points": 406,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1700084480
  },
  {
    "id": 38276075,
    "title": "वासम: वेब विकास और उससे परे के लिए एक शक्तिशाली उपकरण",
    "originLink": "https://wasmbyexample.dev/home.en-us.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38276075",
    "commentBody": "",
    "originSummary": [
      "वेबसाइट Spotify पर एक लो-फाई हिप हॉप बीट्स प्लेलिस्ट प्रदान करती है।",
      "वेबसाइट WebAssembly (Wasm) का उपयोग करने पर जानकारी और उदाहरण प्रदान करती है, जो एक निम्न-स्तरीय बाइटकोड है जो वेब पर चलता है।",
      "वेबसाइट पर उदाहरण विभिन्न वासम अवधारणाओं को प्रदर्शित करते हैं, बड़े अनुप्रयोगों, पारिस्थितिकी तंत्र उपकरण, भाषा सुविधाओं में सामान्य सुविधाओं का निर्माण करते हैं, और ब्राउज़र के बाहर वासम का उपयोग करते हैं।"
    ],
    "commentSummary": [
      "सैंडबॉक्सिंग और सुरक्षा के लिए संभावित लाभों के साथ, क्रॉस-लैंग्वेज लाइब्रेरी बनाने के लिए वेबअसेंबली (डब्ल्यूएएसएम) पर एक व्यवहार्य विकल्प के रूप में चर्चा की जा रही है।",
      "डब्ल्यूएएसएम और अन्य प्रौद्योगिकियों जैसे सीओएम और लुआ के बीच तुलना की जा रही है।",
      "ब्राउज़र में जावास्क्रिप्ट के प्रतिस्थापन के रूप में डब्ल्यूएएसएम की क्षमता का पता लगाया जा रहा है, जबकि यूआई के लिए वेबजीएल / कैनवास का उपयोग करने की सीमाओं पर भी विचार किया जा रहा है।"
    ],
    "points": 293,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1700052418
  },
  {
    "id": 38279459,
    "title": "बी-ट्रीज: लोकप्रिय गेम फैक्टरियो में एक कार्यान्वयन",
    "originLink": "https://razberry.substack.com/p/btree-factorio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38279459",
    "commentBody": "",
    "originSummary": [
      "लेख एक कारखाने के निर्माण के खेल फैक्टो, खेल में बी-ट्रीज के कार्यान्वयन पर चर्चा करता है।",
      "बी-ट्रीज को कई कुंजियों और पॉइंटर्स के साथ मोटी बाइनरी पेड़ों के रूप में वर्णित किया जाता है, जिसका उपयोग बड़ी मात्रा में जानकारी की कुशल खोज और भंडारण के लिए किया जाता है।",
      "लेखक फैक्टरो में एक द्विआधारी खोज पेड़ और बी-ट्री दोनों के कार्यान्वयन को प्रदर्शित करता है, जो इसकी बड़ी सूचना क्षमता के कारण बी-ट्री बनाने की जटिलता को उजागर करता है।"
    ],
    "commentSummary": [
      "पोस्ट गेम फैक्टोरियो में बेल्ट डिजाइन ों को अनुकूलित करने में कंप्यूटर विज्ञान सिद्धांतों, विशेष रूप से बी-ट्री के आवेदन की जांच करता है।",
      "यह बेल्ट पर वस्तुओं को छांटने और फ़िल्टर करने के लिए स्प्लिटर और इंसर्टर के उपयोग की पड़ताल करता है।",
      "वार्तालाप \"मेटा\" गेमप्ले की अवधारणा में प्रवेश करता है और खेल के भीतर कुछ उपकरणों की सीमाओं पर चर्चा करता है।"
    ],
    "points": 253,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1700069112
  },
  {
    "id": 38277412,
    "title": "अमेरिकी सर्जनों ने सफलतापूर्वक पूरे आंख प्रत्यारोपण का प्रदर्शन किया",
    "originLink": "https://medicalxpress.com/news/2023-11-surgeons-world-eye-transplant.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38277412",
    "commentBody": "",
    "originSummary": [
      "न्यूयॉर्क में सर्जनों ने बिजली के झटके से गंभीर रूप से घायल हुए एक व्यक्ति पर दुनिया का पहला संपूर्ण आंख प्रत्यारोपण पूरा कर लिया है।",
      "इस प्रक्रिया में रक्त की आपूर्ति और ऑप्टिक तंत्रिका सहित पूरी बाईं आंख को दाता से प्राप्तकर्ता तक प्रत्यारोपित करना शामिल था।",
      "हालांकि यह अनिश्चित है कि क्या आदमी प्रत्यारोपित आंख में दृष्टि हासिल कर पाएगा, विशेषज्ञ आशावादी हैं और दृष्टि बहाली को बढ़ाने के लिए ऑप्टिक तंत्रिका पुनर्जनन और जीन थेरेपी जैसी उन्नत तकनीकों पर विचार कर रहे हैं।"
    ],
    "commentSummary": [
      "अमेरिकी सर्जनों ने चेहरे के प्रत्यारोपण ऑपरेशन में पहली बार पूरे आंख प्रत्यारोपण को पूरा किया है, जिसका उद्देश्य क्षतिग्रस्त आंखों और स्वस्थ मस्तिष्क वाले रोगी के लिए दृष्टि बहाल करना है।",
      "यद्यपि रोगी के मस्तिष्क को प्रत्यारोपित आंख से संकेत प्राप्त हुए, लेकिन वह देखने में असमर्थ था, जिससे दृष्टि में अंतर के बारे में पूछताछ हुई और मस्तिष्क दृश्य डेटा की व्याख्या कैसे करता है।",
      "पूरे आंख प्रत्यारोपण अक्सर होते हैं और आमतौर पर अभ्यास नहीं किए जाते हैं; प्रक्रिया के आसपास की चर्चाओं में सर्जन प्रमाणन, आंख प्रत्यारोपण में चुनौतियां, न्यूरोप्लास्टी के संभावित लाभ, आंशिक रूप से काम करने वाली आंखों की उपयोगिता, अंग दान दर और ऑप्टिक तंत्रिका को पुनर्जीवित करने के बारे में संदेह शामिल हैं। प्रक्रिया की सफलता और रोगी की दृष्टि वापस पाने की संभावना अनिश्चित रहती है, अलग-अलग राय के साथ।"
    ],
    "points": 221,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1700060942
  },
  {
    "id": 38278171,
    "title": "माइक्रोसॉफ्ट ने Azure Maia 100 और Azure Cobalt 100 का अनावरण किया: क्लाउड AI और सामान्य क्लाउड सेवाओं को बढ़ाने के लिए कस्टम चिप्स",
    "originLink": "https://www.theverge.com/2023/11/15/23960345/microsoft-cpu-gpu-ai-chips-azure-maia-cobalt-specifications-cloud-infrastructure",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38278171",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट ने अपने क्लाउड इंफ्रास्ट्रक्चर के लिए अपनी खुद की एआई चिप, एज़ूर माइया 100 और एक आर्म-आधारित सीपीयू, एज़ूर कोबाल्ट 100 बनाया है।",
      "इन चिप्स को एआई क्षमताओं की बढ़ती मांग को पूरा करने के लिए प्रदर्शन और शक्ति दक्षता में सुधार करने के लिए डिज़ाइन किया गया है।",
      "Azure Maia 100 चिप विशेष रूप से क्लाउड AI वर्कलोड के लिए बनाया गया है, जबकि Azure कोबाल्ट सीपीयू सामान्य क्लाउड सेवाओं के लिए है। दोनों 2024 में उपलब्ध होंगे, जिसका उद्देश्य ग्राहकों को अधिक बुनियादी ढांचे के विकल्प प्रदान करना और एनवीडिया पर निर्भरता को कम करना है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट अपनी क्लाउड सेवाओं के लिए कस्टम सिलिकॉन चिप्स विकसित करने में गूगल और अमेज़ॅन के साथ शामिल हो रहा है, जो इन-हाउस चिप डिजाइन की ओर एक बदलाव का संकेत है।",
      "लेख अर्धचालक निर्माण उद्योग में प्रवेश करने की चुनौतियों और चिप बनाने वाले बाजार में टीएसएमसी के प्रभुत्व पर चर्चा करता है।",
      "एआई चिप विकास और ओपनएआई के संभावित अधिग्रहण में माइक्रोसॉफ्ट की भागीदारी का उल्लेख किया गया है, जो एआई प्रौद्योगिकी पर कंपनी के फोकस को उजागर करता है।",
      "निंटेंडो का अधिग्रहण करने के माइक्रोसॉफ्ट के असफल प्रयास और गेमिंग उद्योग में एक संघर्षरत स्टूडियो के अधिग्रहण पर चर्चा की गई है।",
      "प्रशिक्षण पर एनवीडिया के एकाधिकार और इंटेल के गौड़ी चिप के साथ इसकी प्रतिस्पर्धा का उल्लेख किया गया है, साथ ही क्लाउड प्लेटफॉर्म का चयन करने में सॉफ्टवेयर के महत्व का उल्लेख किया गया है।",
      "माइक्रोसॉफ्ट के अपने एआई चिप्स, माया और कोबाल्ट, विस्तृत हैं, जो अपने स्वयं के चिप्स विकसित करने के लिए कंपनी की प्रतिबद्धता को प्रदर्शित करते हैं।",
      "अपने स्वयं के चिप्स विकसित करने वाली कंपनियों की प्रवृत्ति और एआरएम प्रोसेसर की क्षमता पर चर्चा की जाती है।",
      "बाजार में एनवीडिया के लाभ का श्रेय इसके सॉफ्टवेयर पारिस्थितिकी तंत्र को दिया जाता है।"
    ],
    "points": 215,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1700064171
  },
  {
    "id": 38277430,
    "title": "एआई मौसम विज्ञान मॉडल ग्राफकास्ट ने मौसम पूर्वानुमान में पारंपरिक तरीकों को पछाड़ दिया: गूगल अध्ययन",
    "originLink": "https://arstechnica.com/science/2023/11/ai-outperforms-conventional-weather-forecasting-for-the-first-time-google-study/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38277430",
    "commentBody": "",
    "originSummary": [
      "गूगल डीपमाइंड के एआई मौसम विज्ञान मॉडल, ग्राफकास्ट ने 10 दिन पहले तक वैश्विक मौसम की स्थिति की भविष्यवाणी करने में पारंपरिक मौसम पूर्वानुमान विधियों को पीछे छोड़ दिया है।",
      "ग्राफकास्ट ने 90% मैट्रिक्स में यूरोपियन सेंटर फॉर मीडियम-रेंज वेदर फोरकास्ट (ईसीएमडब्ल्यूएफ) प्रणाली को पीछे छोड़ दिया, जो बेहतर प्रदर्शन का प्रदर्शन करता है।",
      "एआई मॉडल एक मिनट के भीतर सैकड़ों मौसम चर की भविष्यवाणी कर सकता है, गति और सटीकता दोनों की पेशकश कर सकता है, लेकिन इसे मौजूदा तकनीकों का पूरक माना जाता है, प्रतिस्थापन नहीं। ईसीएमडब्ल्यूएफ और यूके मौसम कार्यालय भी मौसम पूर्वानुमान के लिए अपने एआई मॉडल पर काम कर रहे हैं।"
    ],
    "commentSummary": [
      "गूगल के अध्ययन से पता चलता है कि एआई तकनीक ने पहली बार पारंपरिक मौसम पूर्वानुमान को पीछे छोड़ दिया है।",
      "इससे पता चलता है कि एआई के उपयोग के साथ भविष्य के मौसम की भविष्यवाणियां बहुत अधिक सटीक हो सकती हैं।",
      "अध्ययन मौसम पूर्वानुमान के विभिन्न पहलुओं में सुधार करने में एआई की क्षमता पर प्रकाश डालता है।"
    ],
    "points": 205,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1700061020
  },
  {
    "id": 38281264,
    "title": "फ़ायरफ़ॉक्स आगामी रिलीज में डिफ़ॉल्ट रूप से वेलैंड को सक्षम करेगा",
    "originLink": "https://www.phoronix.com/news/Firefox-Change-Wayland-Release",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38281264",
    "commentBody": "",
    "originSummary": [
      "फ़ायरफ़ॉक्स ब्राउज़र में अब दो साल बाद डिफ़ॉल्ट रूप से वेलैंड सक्षम होगा, एक मोज़िला बग के बंद होने के बाद, जिसने वेलैंड बैकएंड को रिलीज़ के लिए तैयार माना था।",
      "यह परिवर्तन फ़ायरफ़ॉक्स 121 में लागू किया जाएगा, जो 19 दिसंबर को जारी होने वाला है।",
      "यह, वेलैंड में अन्य प्रगति के साथ, इंगित करता है कि 2024 लिनक्स डेस्कटॉप के लिए एक महत्वपूर्ण वर्ष होगा।"
    ],
    "commentSummary": [
      "मोज़िला फ़ायरफ़ॉक्स एक्स विंडो सिस्टम की जगह, लिनक्स डेस्कटॉप वातावरण के लिए डिफ़ॉल्ट प्रोटोकॉल के रूप में वेलैंड को सक्षम करने पर विचार कर रहा है।",
      "वेलैंड के बारे में उपयोगकर्ताओं की अलग-अलग राय है, कुछ इसके प्रदर्शन और प्रतिपादन गुणवत्ता की प्रशंसा करते हैं, जबकि अन्य इसकी जटिलता और अतिरिक्त समाधानों की आवश्यकता की आलोचना करते हैं।",
      "चर्चासॉफ्टवेयर की स्थिरता, विभिन्न अनुप्रयोगों में वेलैंड के साथ अनुभव और वर्तमान में एक्स 11 का उपयोग करने वाले उपयोगकर्ताओं पर स्विच के प्रभाव पर भी ध्यान केंद्रित करती है।"
    ],
    "points": 201,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1700076694
  },
  {
    "id": 38281137,
    "title": "ऑस्ट्रेलिया में एंटीबायोटिक दवाओं के अति प्रयोग से दवा प्रतिरोधी संक्रमण में वृद्धि",
    "originLink": "https://www.theguardian.com/society/2023/nov/16/australia-antibiotics-overuse-drug-resistant-infections",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38281137",
    "commentBody": "",
    "originSummary": [
      "ऑस्ट्रेलिया में एंटीबायोटिक दवाओं के अति प्रयोग के कारण आम संक्रमण दवाओं के प्रतिरोधी बन रहे हैं।",
      "2022 में एक तिहाई से अधिक आबादी को कम से कम एक रोगाणुरोधी नुस्खा मिला, जो पिछले वर्ष से वृद्धि का संकेत देता है।",
      "ऑस्ट्रेलिया में विश्व स्तर पर सातवीं सबसे अधिक रोगाणुरोधी निर्धारित दर है, और एंटीबायोटिक दवाओं का दुरुपयोग और अति प्रयोग दवा प्रतिरोधी संक्रमण के उदय में योगदान देता है। रिपोर्ट में हर समस्या के समाधान के रूप में एंटीबायोटिक दवाओं की सांस्कृतिक अपेक्षा को बदलने की आवश्यकता पर जोर दिया गया है।"
    ],
    "commentSummary": [
      "ऑस्ट्रेलिया में एंटीबायोटिक दवाओं का अति प्रयोग, विशेष रूप से पशुधन उत्पादन में, दवा प्रतिरोधी संक्रमण के उदय में योगदान दे रहा है।",
      "मनुष्यों में एंटीबायोटिक प्रतिरोध पर एंटीबायोटिक दवाओं के प्रभाव के साथ-साथ पशुधन में एंटीबायोटिक उपयोग के आर्थिक और पर्यावरणीय परिणामों के बारे में चिंताएं उठाई जाती हैं।",
      "मांस के सेवन के संभावित स्वास्थ्य जोखिमों और ऑस्ट्रेलिया और अमेरिका में डॉक्टरों की निर्धारित प्रथाओं के आसपास एक बहस है।",
      "एंटीबायोटिक उपयोग के बारे में व्यक्तिगत अनुभव और राय साझा की जाती है, कुछ व्यक्तियों ने आंत के स्वास्थ्य और ओवरप्रिस्क्रिप्शन के बारे में चिंता व्यक्त की है।",
      "एंटीबायोटिक अति प्रयोग के मामले में ऑस्ट्रेलिया 7 वें स्थान पर है, जो बढ़ती दवा प्रतिरोध के कारण किफायती विकल्पों की आवश्यकता पर प्रकाश डालता है।",
      "स्वास्थ्य में सुधार में पानी की प्रभावशीलता और प्लेसबो प्रभाव पर भी चर्चा की जाती है।"
    ],
    "points": 194,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1700076114
  },
  {
    "id": 38277105,
    "title": "एफबीआई निदेशक ने FISA धारा 702 के लिए वारंट की आवश्यकता का विरोध किया",
    "originLink": "https://www.theregister.com/2023/11/15/fbi_director_fisa_section_702/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38277105",
    "commentBody": "",
    "originSummary": [
      "एफबीआई निदेशक क्रिस्टोफर रे ने विवादास्पद प्रावधान, एफआईएसए धारा 702 के माध्यम से एकत्र किए गए डेटा के लिए प्रस्तावित वारंट आवश्यकता का विरोध करते हुए तर्क दिया कि यह प्रभावी रूप से इसके उपयोग पर प्रतिबंध लगाएगा।",
      "धारा 702 अमेरिकी सरकार को अमेरिका के बाहर विदेशियों के संचार की जासूसी करने की अनुमति देती है और दिसंबर के अंत में समाप्त होने वाली है जब तक कि कांग्रेस द्वारा नवीनीकृत नहीं किया जाता है।",
      "अमेरिकी व्यक्तियों के संचार की निगरानी के लिए नई सीमाओं और वारंट आवश्यकताओं के साथ धारा 702 को नवीनीकृत करने के लिए एक द्विदलीय विधेयक पेश किया गया है, लेकिन एफबीआई और व्हाइट हाउस वारंट की आवश्यकता को \"लाल रेखा\" मानते हैं।"
    ],
    "commentSummary": [
      "यह विवाद एफआईएसए धारा 702 के लिए वारंट की आवश्यकता और संभावित दुरुपयोग और जवाबदेही की कमी के बारे में चिंताओं के इर्द-गिर्द घूमता है।",
      "आलोचकों का तर्क है कि वारंट केवल तभी जारी किया जाना चाहिए जब कानूनी मानकों को पूरा किया जाता है, एफबीआई निदेशकों की अखंडता के बारे में संदेह व्यक्त करते हुए।",
      "चर्चा में एफआईएसए अदालतों की प्रभावशीलता और संभावित दुरुपयोग, पारदर्शिता की आवश्यकता और राष्ट्रीय सुरक्षा और गोपनीयता अधिकारों के बीच संतुलन भी शामिल है।"
    ],
    "points": 191,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1700059527
  }
]
