[
  {
    "title": "Upway raises $30M to expand US e-bike marketplace",
    "originLink": "https://www.forbes.com/sites/jonathankeane/2023/11/16/e-bike-marketplace-upway-raises-30-million-for-us-push/",
    "originBody": "",
    "originSummary": [
      "Upway, a French e-bike marketplace, has secured $30 million in Series B funding to expand its presence in the US market.",
      "The funding will be used to open a new warehouse on the West Coast and enhance its online marketplace for electric bikes.",
      "Upway has seen significant growth in the US market since its launch earlier this year and aims to capitalize on the opportunity for further expansion."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228280818
  },
  {
    "title": "Mother saves money on Christmas gifts by buying secondhand items",
    "originLink": "https://www.thesun.co.uk/fabulous/24768700/budget-christmas-present-for-kids/",
    "originBody": "",
    "originSummary": [
      "A mother from Oxfordshire, Jen Toll, buys secondhand gifts for her children at Christmas to save money and promote sustainability.",
      "She spends less than £80 on \"package deals\" from Santa, purchasing secondhand items like books, puzzles, and craft items.",
      "Jen plans to resell or donate the toys her children have received in previous years to make another child's Christmas special."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228280818
  },
  {
    "title": "Nigerian gay asylum seeker faces jail for £220k fraud - Daily Nigerian",
    "originLink": "https://dailynigerian.com/nigerian-gay-asylum-claiming/",
    "originBody": "",
    "originSummary": [
      "Saheed Azeez, a Nigerian man seeking asylum in the UK due to persecution by Boko Haram, is facing a potential jail sentence for his role in a £220,000 fraud scheme.",
      "Azeez helped establish a network of individuals who received parcels from sellers without paying and then sold the goods for profit, resulting in financial losses for 272 victims.",
      "Azeez, who identifies as bisexual, could be sentenced to up to six years in prison, while nine others involved in the scam will be sentenced next year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228280818
  }
]
