[
  {
    "id": 38487359,
    "title": "تقدم Meta نماذج تواصل سلسة الذكاء الاصطناعي للترجمة التعبيرية والسريعة",
    "originLink": "https://ai.meta.com/research/seamless-communication/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487359",
    "commentBody": "",
    "originSummary": [
      "أنشأت Meta مجموعة من نماذج البحث الذكاء الاصطناعي تسمى التواصل السلس لترجمة اللغة.",
      "وتشمل النماذج SeamlessExpressive، الذي يركز على الحفاظ على التعبير والفروق الدقيقة في الكلام، و SeamlessStreaming للترجمات في الوقت الفعلي تقريبا مع زمن انتقال منخفض، و SeamlessM4T v2 كنموذج أساسي للترجمة العالمية.",
      "تعطي Meta الأولوية للبحث المفتوح والتعاون وقد اتخذت خطوات لتقليل السمية في الترجمات. يمكن للمستخدمين الوصول إلى موارد إضافية وتنزيل النماذج."
    ],
    "commentSummary": [],
    "points": 634,
    "commentCount": 316,
    "retryCount": 0,
    "time": 1701442401
  },
  {
    "id": 38489307,
    "title": "مكدس قاعدة البيانات المحسنة للواجهة الأمامية: تبسيط إدارة البيانات في تطبيقات الواجهة الأمامية",
    "originLink": "https://sqlsync.dev/posts/stop-building-databases/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489307",
    "commentBody": "",
    "originSummary": [
      "تتم مناقشة التخزين المؤقت للبيانات من واجهات برمجة التطبيقات في تطوير الواجهة الأمامية كممارسة شائعة.",
      "يتم استكشاف استخدام Redux لإدارة التخزين المؤقت لبيانات واجهة برمجة التطبيقات.",
      "يتم تقديم مفهوم الطفرات المتفائلة وتحديات الحفاظ على الاتساق مع الخادم.",
      "يتم تقديم SQLSync كحل ، باستخدام SQLite كمحرك تخزين مع ميزات مثل ذاكرة التخزين المؤقت الدائمة والاستعلامات التفاعلية.",
      "يهدف SQLSync إلى تبسيط إدارة البيانات في تطبيقات الواجهة الأمامية."
    ],
    "commentSummary": [
      "تغطي هذه المناقشة موضوعات متنوعة في برمجة قواعد البيانات وتطوير الواجهة الأمامية والمزامنة وإدارة البيانات في تطبيقات الويب.",
      "يستكشف استخدام WebAssembly و SQLite للاستعلام عن قاعدة بيانات الواجهة الأمامية وتحديات تنفيذ المزامنة وحل النزاعات.",
      "تسلط المناقشة الضوء أيضا على مزايا وقيود قواعد البيانات العلائقية ، ومدى ملاءمة مناهج تطوير الويب المختلفة ، وإمكانية عمل المتصفح كنظام تشغيل. تشمل الموضوعات الأخرى التي تمت مناقشتها التخزين المؤقت ، والبيانات التعاونية ، والمشغلات ، والمخفضات ، وإيجابيات وسلبيات الأدوات والأطر المختلفة."
    ],
    "points": 450,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1701451168
  },
  {
    "id": 38490811,
    "title": "أفضل شركات التكنولوجيا التي توظف في جميع أنحاء العالم: ديسمبر 2023",
    "originLink": "https://news.ycombinator.com/item?id=38490811",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38490811",
    "commentBody": "",
    "originSummary": [
      "يطلب المنشور قوائم الوظائف التي تلبي متطلبات محددة للموقع ، بما في ذلك الخيارات البعيدة ، وحالة التأشيرة للمرشحين الدوليين.",
      "يسمح فقط للأفراد من شركات التوظيف بنشر قوائم الوظائف.",
      "ينصح الباحثون عن عمل بالبحث عن فرص عمل على المنصات الموصى بها ويمكنهم العثور على مواضيع إضافية ذات صلة حول هذا الموضوع."
    ],
    "commentSummary": [
      "تتميز هذه المجموعة بإعلانات الوظائف من شركات التكنولوجيا المختلفة ، وتقدم وظائف في هندسة البرمجيات ، الذكاء الاصطناعي ، والتعلم الآلي ، وعلوم البيانات ، والمزيد.",
      "توفر الأدوار مزايا مثل العمل عن بعد ، والتعويض التنافسي ، وفرصة العمل في مشاريع مثيرة.",
      "شركات مثل Reef Technologies و ML6 و Rockstar Games و Socket و GitHub و FusionAuth و Continua و Viator من بين أولئك الذين يقومون بالتوظيف."
    ],
    "points": 382,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1701457622
  },
  {
    "id": 38485295,
    "title": "القوة غير المتوقعة لتقنيات ترميز HTML غير التقليدية",
    "originLink": "https://tedium.co/2023/11/24/weird-html-hacks-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38485295",
    "commentBody": "",
    "originSummary": [
      "تستكشف المقالة مجموعة من تقنيات ترميز HTML غير التقليدية التي تتحدى التوقعات ولا تزال قادرة على العمل.",
      "يعرض المؤلف عشر استراتيجيات مختلفة ، تشمل جوانب مختلفة من HTML ، بما في ذلك جداول HTML وتصميم الويب والتصميم سريع الاستجابة.",
      "تقدم هذه المقالة منظورا فريدا وغنيا بالمعلومات حول ترميز HTML ، وتلقي الضوء على التقنيات غير التقليدية التي قد تكون مفيدة لمطوري الويب والمصممين."
    ],
    "commentSummary": [
      "تبحث المقالة في استخدام اختراقات HTML ، وتحديدا الجداول والعوامات ، في تطوير الويب وتناقش مزايا وتحديات كل نهج.",
      "يقدم أدوات أحدث مثل flexbox والشبكة التي تم تطويرها لمعالجة قيود الجداول والعوامات في إنشاء تخطيطات سريعة الاستجابة.",
      "تتطرق المقالة أيضا إلى استخدام العوامات في قوالب البريد الإلكتروني ، والفرق بين W3C و W3Schools ، والمخاطر الأمنية المرتبطة ب HTML ، ودور معايير الويب في تسهيل الابتكار في تطوير الويب."
    ],
    "points": 332,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1701427020
  },
  {
    "id": 38487112,
    "title": "Noiselith: إنشاء الصور في وضع عدم الاتصال بسهولة",
    "originLink": "https://noiselith.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487112",
    "commentBody": "",
    "originSummary": [
      "Noiselith هي أداة طورتها شركة VoyagerX، Inc. تمكن المستخدمين من إنشاء صور على أجهزتهم دون الاعتماد على الاتصال بالإنترنت.",
      "توفر الأداة الخصوصية وتوليد الصور غير المحدود وسرعة المعالجة السريعة.",
      "يحتوي Noiselith على متطلبات نظام محددة ، بما في ذلك Windows أو macOS ، ووحدة معالجة رسومات متوافقة ، وذاكرة وصول عشوائي ومساحة تخزين كافية.",
      "إنه سهل التركيب والاستخدام ، مع خيارات لاختيار وإدارة نماذج مختلفة.",
      "Noiselith حاليا في مرحلة تجريبية ، ولم يتم الإعلان عن تاريخ إصداره الرسمي."
    ],
    "commentSummary": [
      "يشارك المستخدمون في محادثة حول تطبيقات البرامج المختلفة لإنشاء الصور التوليدية ، مثل Easy Stable Diffusion XL و Draw Things و InvokeAI و Auto1111 و ComfyUI و Fooocus و Noiselith و Guernika.",
      "يناقشون إيجابيات وسلبيات هذه التطبيقات ، بما في ذلك الميزات والأداء وتجربة المستخدم والتراخيص ومخاوف الخصوصية.",
      "تتطرق المحادثة أيضا إلى الجوانب الفنية مثل عمليات التثبيت وتوافق الأجهزة (المعالجات وبطاقات الرسومات) ، فضلا عن التوازن بين الوظائف وسهولة الاستخدام. تم ذكر نماذج اللغة أيضا."
    ],
    "points": 316,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1701441290
  },
  {
    "id": 38486907,
    "title": "أصبح العمل عن بعد عنصرا ثابتا في سوق العمل الأمريكي",
    "originLink": "https://www.cnbc.com/2023/11/30/return-to-office-is-dead-stanford-economist-says-heres-why.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486907",
    "commentBody": "",
    "originSummary": [
      "أصبح العمل عن بعد عنصرا ثابتا في سوق العمل الأمريكي ، مع استقرار نسبة العمال الذين يتم استدعاؤهم إلى المكتب.",
      "ظل معدل أيام العمل مدفوعة الأجر من المنزل مرتفعا باستمرار عند حوالي 28٪ ، مقارنة بمستوى ما قبل الوباء البالغ 7٪.",
      "إن التحول نحو العمل عن بعد مدفوع بتفضيلات العمال لعدم التنقل ، والجداول الزمنية المرنة ، وتوازن أفضل بين العمل والحياة ، بينما تتمتع الشركات بتكاليف منخفضة وتحسين الاحتفاظ بالعمال. من المتوقع أن ينمو انتشار العمل عن بعد بشكل أكبر بسبب التقدم التكنولوجي وتفضيلات الرؤساء التنفيذيين الأصغر سنا."
    ],
    "commentSummary": [
      "العمل عن بعد هو موضوع نقاش مع آراء مختلفة حول فعاليته وتحدياته.",
      "تتم مناقشة فوائد الإنتاجية للعمل عن بعد ، ولكن يتم التأكيد على التواصل الفعال باعتباره أمرا بالغ الأهمية.",
      "تتم مناقشة مزايا وعيوب العمل عن بعد مقابل العمل الشخصي."
    ],
    "points": 316,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1701440233
  },
  {
    "id": 38489313,
    "title": "المليارديرات يجمعون ميراثا أكثر من خلق الثروة ، وفقا لتقارير UBS",
    "originLink": "https://www.ft.com/content/3944234e-e3b4-46fa-8c2f-cadec780ecb4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489313",
    "commentBody": "",
    "originSummary": [
      "كشف استطلاع أجراه بنك يو بي إس أن المليارديرات يجمعون الآن المزيد من الثروة من خلال الميراث بدلا من تكوين الثروة.",
      "تم جمع 141 مليار دولار من قبل المليارديرات العصاميين في عام 2023 ، في حين ورث الورثة 151 مليار دولار.",
      "ومن المتوقع أن يمرر أكثر من 1000 ملياردير 5.2 تريليون دولار لأطفالهم في السنوات ال 20 إلى ال 30 المقبلة، مما يشير إلى أن هذا الاتجاه سيستمر."
    ],
    "commentSummary": [
      "تستكشف المجموعة المناقشات حول عدم المساواة في الثروة وتوزيع الثروة والميراث في تراكم الثروة.",
      "تتم مناقشة وجهات نظر مختلفة حول فرض الضرائب على الأثرياء ، وتأثير تركيز الثروة على المجتمع ، وتعريف المليارديرات \"العصاميين\".",
      "كما تمت مناقشة تأثير المليارديرات على السياسة ، واستخدام المؤسسات الخيرية كملاجئ ضريبية ، ووجود المليارديرات السريين."
    ],
    "points": 282,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1701451202
  },
  {
    "id": 38495720,
    "title": "دراسة تكتشف وجود صلة بين طنين الأذن وتلف الأعصاب الخفي",
    "originLink": "https://scitechdaily.com/tinnitus-linked-to-hidden-undetected-auditory-nerve-damage-a-step-towards-a-cure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38495720",
    "commentBody": "",
    "originSummary": [
      "وجد الباحثون في ماساتشوستس للعين والأذن صلة بين طنين الأذن وتلف الأعصاب السمعية غير المكتشف ، مما يتحدى الفهم السابق للحالة.",
      "تظهر الدراسة أن الأفراد الذين لديهم اختبارات سمع طبيعية لا يزال بإمكانهم تجربة فقدان العصب السمعي ، مما يشير إلى إمكانية وجود علاجات جديدة تتمحور حول تجديد الأعصاب.",
      "يمكن أن يكون لطنين الأذن ، الذي يصيب أكثر من 10٪ من البالغين على مستوى العالم ، تأثير كبير على نوعية الحياة ، مما يؤدي إلى اضطرابات النوم والانسحاب الاجتماعي والقلق والاكتئاب. يهدف الباحثون إلى تطوير علاجات تستهدف الأسباب الجذرية لطنين الأذن للتخفيف من أعراضه."
    ],
    "commentSummary": [
      "يناقش المشاركون في المحادثات تجاربهم مع طنين الأذن ، وهي حالة تتميز بالرنين المستمر أو الأزيز في الأذنين.",
      "يتم استكشاف الأسباب المحتملة لطنين الأذن ، بما في ذلك إجراءات العضلات ومشاكل الفك والضرر العصبي.",
      "تم ذكر طرق مختلفة لإدارة طنين الأذن ، مثل الاستماع إلى الضوضاء البيضاء ، والحفاظ على السمع ، واستخدام علاجات محددة."
    ],
    "points": 274,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1701489130
  },
  {
    "id": 38487199,
    "title": "تحدي كفاءة LLM: ضبط أسرع 5x للاما باستخدام QLoRA",
    "originLink": "https://github.com/unslothai/unsloth",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487199",
    "commentBody": "",
    "originSummary": [
      "يقدم المؤلف مشروعا من تحدي كفاءة LLM يتيح ضبط اللاما بشكل أسرع 5 مرات باستخدام QLoRA مقارنة بالتنفيذ الأصلي ل Huggingface.",
      "يتضمن المشروع ميزات مثل محرك autograd اليدوي ، وخوارزميات أسرع ، وكفاءة الذاكرة ، وتوافق نموذج GPU ، وعدم المساومة على الدقة.",
      "يتم توفير الدعم أيضا ل Flash Attention و 4bit / 16bit finening ، مع معلومات إضافية حول Unsloth Pro و Max للتدريب الأسرع المتاح في منشور المدونة."
    ],
    "commentSummary": [
      "يوفر مستودع اللاما على GitHub نماذج تعلم آلي أسرع وأكثر كفاءة في استخدام الذاكرة دون المساس بالدقة.",
      "يخطط منشئو المحتوى لإصدار منتجات الذكاء الاصطناعي إضافية في المستقبل.",
      "تستكشف المحادثة مواضيع مختلفة مثل تحقيق الدخل من التعليمات البرمجية مفتوحة المصدر ، ونماذج الأعمال المحتملة ، ومشاريع قياس الأداء ، وتوافق GPU ، والحد الأدنى من متطلبات الأجهزة."
    ],
    "points": 270,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1701441760
  },
  {
    "id": 38486259,
    "title": "تتسبب الرسوم المتحركة التي تجرها الدواب في Bitbucket في ارتفاع استخدام وحدة المعالجة المركزية أثناء عمليات البناء",
    "originLink": "https://thehftguy.com/2023/11/21/buggy-animation-in-atlassian-bitbucket-is-wasting-half-a-cpu-core-at-all-times/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486259",
    "commentBody": "",
    "originSummary": [
      "تحتوي واجهة مستخدم الويب BitBucket على رسوم متحركة مشوشة تتسبب في ارتفاع استخدام وحدة المعالجة المركزية ووحدة معالجة الرسومات أثناء عمليات الإنشاء.",
      "الرسوم المتحركة ، التي تدور صورة SVG ثابتة ، محسنة بشكل سيئ وتؤثر على أداء النظام.",
      "تؤدي إزالة الرسوم المتحركة إلى حل المشكلة ، ولكن يتم إعادة حساب تخطيط الصفحة بأكملها على كل إطار ، مما يؤدي إلى مشكلات إضافية في الأداء."
    ],
    "commentSummary": [
      "يعبر المستخدمون عن إحباطهم من الرسوم المتحركة التي تجرها الدواب ، والاستخدام العالي لوحدة المعالجة المركزية ، ومشكلات الأداء في Atlassian Bitbucket ومتصفحات الويب ومواقع الويب الأخرى.",
      "تدور المناقشات حول تأثير الرسوم المتحركة على استخدام وحدة المعالجة المركزية ووحدة معالجة الرسومات ، وقيود المتصفحات في عرض أشكال معينة ، وتحديات التحسين.",
      "يستكشف المستخدمون الحلول والتحسينات المحتملة لتقليل استخدام الموارد وتحسين تجربة المستخدم."
    ],
    "points": 247,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1701436285
  },
  {
    "id": 38485596,
    "title": "ravynOS: مزج براعة macOS مع حرية FreeBSD",
    "originLink": "https://ravynos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38485596",
    "commentBody": "",
    "originSummary": [
      "ravynOS هو نظام تشغيل مفتوح المصدر يجمع بين تطور macOS ومرونة FreeBSD.",
      "النظام متوافق مع تطبيقات macOS ولا يحتوي على أي قيود على الأجهزة.",
      "يهدف إلى إنشاء واجهة مستخدم جديدة تتوافق مع أهدافه ، مع دعم ميزات مثل التصميم النظيف والقوائم العالمية وعمليات التثبيت بالسحب والإفلات."
    ],
    "commentSummary": [
      "تستكشف المناقشة أنظمة التشغيل المختلفة ، بما في ذلك RavynOS و FreeBSD و macOS و Linux و GNOME.",
      "يناقش المشاركون تصميم هذه الأنظمة وقابليتها للاستخدام وتوافقها ، معبرين عن تفضيلاتهم لنظام التشغيل macOS أو ينتقدون واجهته وقيوده.",
      "هناك أيضا محادثة حول المحاكيات والأجهزة الافتراضية لتشغيل تطبيقات macOS على أجهزة الكمبيوتر غير التابعة لنظام التشغيل Mac وإمكانات GNUStep كإطار عمل للتطبيقات الشبيهة ب macOS."
    ],
    "points": 220,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1701430163
  },
  {
    "id": 38492378,
    "title": "طلب المساعدة لقضاء العطلات: يقدم مجتمع HN الدعم للاحتياجات المالية",
    "originLink": "https://news.ycombinator.com/item?id=38492378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38492378",
    "commentBody": "",
    "originSummary": [
      "يبدأ الملصق موضوعا مبكرا لتقديم المساعدة لمجتمع Hacker News (HN).",
      "في العام الماضي ، قدموا دعما بقيمة 20 ألف دولار ويخططون لتمويل العملية بأنفسهم هذا العام.",
      "إنهم يطلبون الاحتياجات المالية للأشخاص والغرض العام لمساعدة أكبر عدد ممكن من الأشخاص ، بما في ذلك سكن العطلات أو الهدايا أو الطعام أو المساعدة في السفر أو النفقات الطبية أو الترفيه. إنهم يضمنون الخصوصية ويشجعون المحتاجين على طلب المساعدة."
    ],
    "commentSummary": [
      "يشارك المستخدمون في المنتديات عبر الإنترنت في مناقشات حول المساعدة المالية ومشاركة التحديات الشخصية وطلب المشورة.",
      "تتم مناقشة مواضيع مختلفة ، بما في ذلك دعم العطلات ، وجمع التبرعات للإمدادات الطبية ، والبطالة ، والتشرد ، وفشل الأعمال ، وإيجاد الصناديق المتحركة ، ورسوم معالجة الهجرة.",
      "يقدم المستخدمون المساعدة والاقتراحات والموارد للمحتاجين."
    ],
    "points": 206,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1701464701
  },
  {
    "id": 38486394,
    "title": "القصة الداخلية لشراكة مايكروسوفت مع OpenAI",
    "originLink": "https://www.newyorker.com/magazine/2023/12/11/the-inside-story-of-microsofts-partnership-with-openai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486394",
    "commentBody": "",
    "originSummary": [
      "كانت شراكة Microsoft مع OpenAI في خطر عندما تم طرد الرئيس التنفيذي لشركة OpenAI ، إيليا سوتسكيفر ، بشكل غير متوقع من قبل مجلس إدارة الشركة دون علم Microsoft أو مدخلاتها.",
      "خلقت إقالة الرئيس التنفيذي توترات بين OpenAI و Microsoft وأثارت مخاوف بشأن مخاطر وفوائد الذكاء الاصطناعي وسرعة وسلامة تطوير التكنولوجيا الذكاء الاصطناعي.",
      "استكشفت مايكروسوفت خيارات مختلفة لتحقيق الاستقرار في الوضع ، بما في ذلك دعم الرئيس التنفيذي المؤقت أو إعادة الرئيس التنفيذي المفصول ، ولكن في النهاية أعيد الرئيس التنفيذي بسبب اضطرابات الموظفين والتهديدات بالتمرد."
    ],
    "commentSummary": [
      "يواجه سام ألتمان ، الرئيس التنفيذي السابق لشركة OpenAI ، جدلا حول تكتيكاته للتلاعب بأعضاء مجلس الإدارة وتعزيز السلطة.",
      "يناقش المقال الطبيعة المختلة للوحة ومشاركة Microsoft في هذه المشكلة.",
      "تثار مخاوف بشأن ذكاء ألتمان ، وإمكانية اكتساب قوة مفرطة ، والمخاطر المرتبطة بالذكاء الاصطناعي العام."
    ],
    "points": 191,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1701437200
  },
  {
    "id": 38489533,
    "title": "موزيلا تقدم Llamafile: قم بتشغيل LLMs محليا على جهاز الكمبيوتر الخاص بك",
    "originLink": "http://simonwillison.net/2023/Nov/29/llamafile/#atom-everything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489533",
    "commentBody": "",
    "originSummary": [
      "قامت مجموعة الابتكار في Mozilla و Justine Tunney بإنشاء llamafile ، وهي طريقة جديدة لتشغيل نماذج اللغات الكبيرة (LLMs) على جهاز الكمبيوتر الخاص بك.",
      "ملف llamafile هو ملف متعدد الجيجابايت يحتوي على كل من أوزان النموذج ل LLM والتعليمات البرمجية المطلوبة لتشغيل النموذج.",
      "يمكن للمستخدمين تنفيذ ملف اللاما باستخدام Cosmopolitan Libc ، الذي يجمع ثنائيا واحدا يعمل على أنظمة تشغيل وبنى أجهزة متعددة.",
      "من خلال تشغيل ملف llamafile القابل للتنفيذ ، يمكن للمستخدمين بدء خادم ويب والتفاعل مع النموذج في متصفحهم ، مما يتيح الاستخدام المحلي ل LLMs دون اتصال بالإنترنت."
    ],
    "commentSummary": [
      "Llamafile هي أداة جديدة تتيح للمستخدمين تشغيل نموذج اللغة (LM) على أجهزة الكمبيوتر الخاصة بهم ، مما يوفر نظاما واحدا لتوزيع الملفات وتنفيذها ل LLMs.",
      "على الرغم من أن Llamafile مناسب لبعض المستخدمين ، إلا أنه قد لا يكون أفضل طريقة أداء ، خاصة بالنسبة للطرز التي تتطلب تسريع GPU.",
      "تم اقتراح بدائل مثل ExLLAmA v2 + elx2 الكمي و tensorrt-llm للحصول على أداء أفضل.",
      "يناقش المستخدمون متطلبات الأجهزة وخيارات تشغيل LLMs ، بما في ذلك استخدام Macbook M2 Air و LM Studio.",
      "تختلف الآراء حول أفضل طريقة لتشغيل LLMs ، حيث يقترح البعض أن تضمين النموذج مع الملف القابل للتنفيذ مناسب فقط للعروض التوضيحية ، بينما يفضل البعض الآخر أدوات مثل LM Studio لسهولة استخدامها."
    ],
    "points": 173,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1701452210
  }
]
