[
  {
    "id": 38487359,
    "title": "மெட்டா வெளிப்படையான மற்றும் விரைவான மொழிபெயர்ப்புக்கான தடையற்ற தகவல்தொடர்பு செயற்கை நுண்ணறிவு மாதிரிகளை அறிமுகப்படுத்துகிறது",
    "originLink": "https://ai.meta.com/research/seamless-communication/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487359",
    "commentBody": "",
    "originSummary": [
      "மெட்டா மொழி மொழிபெயர்ப்புக்கான தடையற்ற தகவல்தொடர்பு என்ற செயற்கை நுண்ணறிவு ஆராய்ச்சி மாதிரிகளின் தொகுப்பை உருவாக்கியுள்ளது.",
      "இந்த மாதிரிகளில் பேச்சின் வெளிப்பாடு மற்றும் நுணுக்கங்களை பராமரிப்பதில் கவனம் செலுத்தும் சீம்லெஸ்எக்ஸ்பிரசிவ், குறைந்த தாமதத்துடன் நிகழ்நேர மொழிபெயர்ப்புகளுக்கான தடையற்ற ஸ்ட்ரீமிங் மற்றும் உலகளாவிய மொழிபெயர்ப்பிற்கான அடிப்படை மாதிரியாக சீம்லெஸ்எம் 4 டி வி 2 ஆகியவை அடங்கும்.",
      "மெட்டா திறந்த ஆராய்ச்சி மற்றும் ஒத்துழைப்புக்கு முன்னுரிமை அளிக்கிறது மற்றும் மொழிபெயர்ப்புகளில் நச்சுத்தன்மையைக் குறைக்க நடவடிக்கை எடுத்துள்ளது. பயனர்கள் கூடுதல் ஆதாரங்களை அணுகலாம் மற்றும் மாதிரிகளைப் பதிவிறக்கலாம்."
    ],
    "commentSummary": [],
    "points": 634,
    "commentCount": 316,
    "retryCount": 0,
    "time": 1701442401
  },
  {
    "id": 38489307,
    "title": "Frontend Optimized Database Stack: Frontend Applications இல் தரவு மேலாண்மையை எளிமைப்படுத்துதல்",
    "originLink": "https://sqlsync.dev/posts/stop-building-databases/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489307",
    "commentBody": "",
    "originSummary": [
      "முன்முனை வளர்ச்சியில் ஏபிஐக்களிடமிருந்து தரவைச் சேகரிப்பது ஒரு பொதுவான நடைமுறையாக விவாதிக்கப்படுகிறது.",
      "ஏபிஐ தரவு கேச்சிங்கை நிர்வகிக்க ரெடக்ஸின் பயன்பாடு ஆராயப்படுகிறது.",
      "நம்பிக்கைக்குரிய பிறழ்வுகளின் கருத்து மற்றும் சேவையகத்துடன் நிலைத்தன்மையைப் பராமரிப்பதற்கான சவால்கள் அறிமுகப்படுத்தப்படுகின்றன.",
      "SQLSync ஒரு தீர்வாக வழங்கப்படுகிறது, SQLite ஐ ஒரு சேமிப்பக இயந்திரமாக பயன்படுத்துகிறது, நீடித்த தற்காலிக சேமிப்பகம் மற்றும் எதிர்வினை வினவல்கள் போன்ற அம்சங்களைக் கொண்டுள்ளது.",
      "SQLSync முன்முனை பயன்பாடுகளில் தரவு மேலாண்மையை எளிமைப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த விவாதம் தரவுத்தள நிரலாக்கம், முன்முனை மேம்பாடு, ஒத்திசைவு மற்றும் வலை பயன்பாடுகளில் தரவு மேலாண்மை ஆகியவற்றில் பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "இது முன் தரவுத்தள வினவலுக்கு வெப்அசெம்ப்ளி மற்றும் SQLit இன் பயன்பாடு மற்றும் ஒத்திசைவு மற்றும் மோதல் தீர்வை செயல்படுத்துவதற்கான சவால்களை ஆராய்கிறது.",
      "தொடர்புடைய தரவுத்தளங்களின் நன்மைகள் மற்றும் வரம்புகள், பல்வேறு வலை மேம்பாட்டு அணுகுமுறைகளின் பொருத்தம் மற்றும் உலாவி ஒரு இயக்க முறைமையாக செயல்படுவதற்கான திறன் ஆகியவற்றையும் இந்த விவாதம் எடுத்துக்காட்டுகிறது. விவாதிக்கப்பட்ட பிற தலைப்புகளில் கேச்சிங், கூட்டுத் தரவு, தூண்டுதல்கள், குறைப்பான்கள் மற்றும் வெவ்வேறு கருவிகள் மற்றும் கட்டமைப்புகளின் நன்மை தீமைகள் ஆகியவை அடங்கும்."
    ],
    "points": 450,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1701451168
  },
  {
    "id": 38490811,
    "title": "உலகளவில் பணியமர்த்தப்படும் முன்னணி தொழில்நுட்ப நிறுவனங்கள்: டிசம்பர் 2023",
    "originLink": "https://news.ycombinator.com/item?id=38490811",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38490811",
    "commentBody": "",
    "originSummary": [
      "தொலைதூர விருப்பங்கள் மற்றும் சர்வதேச வேட்பாளர்களுக்கான விசா நிலை உள்ளிட்ட இருப்பிடத்திற்கான குறிப்பிட்ட தேவைகளைப் பூர்த்தி செய்யும் வேலை பட்டியல்களை இந்த இடுகை கோருகிறது.",
      "பணியமர்த்தும் நிறுவனங்களைச் சேர்ந்த நபர்கள் மட்டுமே வேலை பட்டியல்களை இடுகையிட அனுமதிக்கப்படுகிறார்கள்.",
      "வேலை தேடுபவர்கள் பரிந்துரைக்கப்பட்ட தளங்களில் வேலை வாய்ப்புகளைத் தேட அறிவுறுத்தப்படுகிறார்கள், மேலும் தலைப்பில் கூடுதல் தொடர்புடைய நூல்களைக் காணலாம்."
    ],
    "commentSummary": [
      "இந்த தொகுப்பில் மென்பொருள் பொறியியல், செயற்கை நுண்ணறிவு, இயந்திர கற்றல், தரவு அறிவியல் மற்றும் பலவற்றில் பதவிகளை வழங்கும் பல்வேறு தொழில்நுட்ப நிறுவனங்களின் வேலை இடுகைகள் உள்ளன.",
      "பாத்திரங்கள் தொலைதூர வேலை, போட்டி இழப்பீடு மற்றும் உற்சாகமான திட்டங்களில் பணியாற்றுவதற்கான வாய்ப்பு போன்ற நன்மைகளை வழங்குகின்றன.",
      "ரீஃப் டெக்னாலஜிஸ், எம்.எல்.6, ராக்ஸ்டார் கேம்ஸ், சாக்கெட், கிட்ஹப், ஃப்யூஷன் அவுத், கான்டினுவா மற்றும் வியாட்டர் போன்ற நிறுவனங்கள் பணியமர்த்தப்பட்டுள்ளன."
    ],
    "points": 382,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1701457622
  },
  {
    "id": 38485295,
    "title": "வழக்கத்திற்கு மாறான HTML குறியீட்டு நுட்பங்களின் எதிர்பாராத சக்தி",
    "originLink": "https://tedium.co/2023/11/24/weird-html-hacks-history/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38485295",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை எதிர்பார்ப்புகளை மீறும் மற்றும் இன்னும் வேலை செய்யக்கூடிய வழக்கத்திற்கு மாறான எச்.டி.எம்.எல் குறியீட்டு நுட்பங்களின் வரம்பை ஆராய்கிறது.",
      "HTML அட்டவணைகள், வலை வடிவமைப்பு மற்றும் பதிலளிக்கும் வடிவமைப்பு உள்ளிட்ட HTML இன் பல்வேறு அம்சங்களை உள்ளடக்கிய பத்து வெவ்வேறு உத்திகளை ஆசிரியர் காட்சிப்படுத்துகிறார்.",
      "இந்த கட்டுரை எச்.டி.எம்.எல் குறியீட்டில் ஒரு தனித்துவமான மற்றும் தகவல் கண்ணோட்டத்தை வழங்குகிறது, வலை டெவலப்பர்கள் மற்றும் வடிவமைப்பாளர்களுக்கு உதவியாக இருக்கும் வழக்கத்திற்கு மாறான நுட்பங்கள் குறித்து வெளிச்சம் பாய்ச்சுகிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை வலை வளர்ச்சியில் எச்.டி.எம்.எல் ஹேக்குகளின் பயன்பாட்டை ஆராய்கிறது, குறிப்பாக அட்டவணைகள் மற்றும் மிதவைகள் மற்றும் ஒவ்வொரு அணுகுமுறையின் நன்மைகள் மற்றும் சவால்களைப் பற்றி விவாதிக்கிறது.",
      "பதிலளிக்கும் தளவமைப்புகளை உருவாக்குவதில் அட்டவணைகள் மற்றும் மிதவைகளின் வரம்புகளை நிவர்த்தி செய்வதற்காக உருவாக்கப்பட்ட ஃப்ளெக்ஸ்பாக்ஸ் மற்றும் கிரிட் போன்ற புதிய கருவிகளை இது அறிமுகப்படுத்துகிறது.",
      "மின்னஞ்சல் வார்ப்புருக்களில் மிதவைகளின் பயன்பாடு, W3C மற்றும் W3S பள்ளிகளுக்கு இடையிலான வேறுபாடு, HTML உடன் தொடர்புடைய பாதுகாப்பு அபாயங்கள் மற்றும் வலை வளர்ச்சியில் புதுமையை எளிதாக்குவதில் வலை தரநிலைகளின் பங்கு ஆகியவற்றையும் கட்டுரை தொடுகிறது."
    ],
    "points": 332,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1701427020
  },
  {
    "id": 38487112,
    "title": "சத்தலித்: ஆஃப்லைனில் எளிதாக படங்களை உருவாக்கவும்",
    "originLink": "https://noiselith.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487112",
    "commentBody": "",
    "originSummary": [
      "ஒலிஸ்லித் என்பது வாயேஜர்எக்ஸ், இன்க் உருவாக்கிய ஒரு கருவியாகும், இது பயனர்கள் இணைய இணைப்பை நம்பாமல் தங்கள் சாதனங்களில் படங்களை உருவாக்க உதவுகிறது.",
      "கருவி தனியுரிமை, வரம்பற்ற பட உருவாக்கம் மற்றும் விரைவான செயலாக்க வேகத்தை வழங்குகிறது.",
      "விண்டோஸ் அல்லது மேகோஸ், இணக்கமான ஜிபியு மற்றும் போதுமான ரேம் மற்றும் சேமிப்பக இடம் உள்ளிட்ட குறிப்பிட்ட கணினி தேவைகளைக் கொண்டுள்ளது.",
      "வெவ்வேறு மாதிரிகளைத் தேர்ந்தெடுத்து நிர்வகிப்பதற்கான விருப்பங்களுடன் நிறுவவும் பயன்படுத்தவும் எளிதானது.",
      "நியூஸ்லித் தற்போது பீட்டாவில் உள்ளது, அதன் அதிகாரப்பூர்வ வெளியீட்டு தேதி அறிவிக்கப்படவில்லை."
    ],
    "commentSummary": [
      "பயனர்கள் ஈஸி ஸ்டேபிள் டிஃப்யூஷன் எக்ஸ்எல், டிரா திங்ஸ், இன்வெராஏஐ, ஆட்டோ 1111, காம்ஃபியூஐ, ஃபூகஸ், நொய்ஸ்லித் மற்றும் குர்னிகா போன்ற உருவாக்க பட உருவாக்கத்திற்கான பல்வேறு மென்பொருள் பயன்பாடுகளைப் பற்றிய உரையாடலில் ஈடுபடுகிறார்கள்.",
      "அம்சங்கள், செயல்திறன், பயனர் அனுபவம், உரிமங்கள் மற்றும் தனியுரிமை கவலைகள் உள்ளிட்ட இந்த பயன்பாடுகளின் நன்மை தீமைகளை அவர்கள் விவாதிக்கிறார்கள்.",
      "இந்த உரையாடல் நிறுவல் செயல்முறைகள், வன்பொருள் பொருந்தக்கூடிய தன்மை (செயலிகள் மற்றும் கிராபிக்ஸ் அட்டைகள்) மற்றும் செயல்பாடு மற்றும் பயனர் நட்பு ஆகியவற்றுக்கு இடையிலான சமநிலை போன்ற தொழில்நுட்ப அம்சங்களையும் தொடுகிறது. மொழி மாதிரிகளும் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 316,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1701441290
  },
  {
    "id": 38486907,
    "title": "தொலைதூர வேலை அமெரிக்க தொழிலாளர் சந்தையில் நிரந்தர அம்சமாக மாறுகிறது",
    "originLink": "https://www.cnbc.com/2023/11/30/return-to-office-is-dead-stanford-economist-says-heres-why.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486907",
    "commentBody": "",
    "originSummary": [
      "தொலைதூர வேலை அமெரிக்க தொழிலாளர் சந்தையில் ஒரு நிரந்தர அம்சமாக மாறி வருகிறது, அலுவலகத்திற்கு திரும்ப அழைக்கப்படும் தொழிலாளர்களின் விகிதம் குறைந்து வருகிறது.",
      "தொற்றுநோய்க்கு முந்தைய அளவான 7% உடன் ஒப்பிடும்போது, வீட்டிலிருந்து வேலை செய்யும் நாட்களின் விகிதம் தொடர்ந்து சுமார் 28% ஆக உள்ளது.",
      "தொலைதூர வேலையை நோக்கிய மாற்றம் எந்த பயணமும் இல்லாத தொழிலாளர் விருப்பங்கள், நெகிழ்வான அட்டவணைகள் மற்றும் சிறந்த வேலை-வாழ்க்கை சமநிலை ஆகியவற்றால் உந்தப்படுகிறது, அதே நேரத்தில் நிறுவனங்கள் குறைந்த செலவுகள் மற்றும் மேம்பட்ட தொழிலாளர் தக்கவைப்பை அனுபவிக்கின்றன. தொழில்நுட்ப முன்னேற்றங்கள் மற்றும் இளம் தலைமை நிர்வாக அதிகாரிகளின் விருப்பங்கள் காரணமாக தொலைதூர வேலைகளின் பரவல் மேலும் அதிகரிக்கும் என்று எதிர்பார்க்கப்படுகிறது."
    ],
    "commentSummary": [
      "தொலைதூர வேலை என்பது அதன் செயல்திறன் மற்றும் சவால்கள் குறித்து மாறுபட்ட கருத்துக்களைக் கொண்ட விவாதப் பொருளாகும்.",
      "தொலைதூர வேலையின் உற்பத்தித்திறன் நன்மைகள் வாதிடப்படுகின்றன, ஆனால் பயனுள்ள தகவல்தொடர்பு முக்கியமானது என்று வலியுறுத்தப்படுகிறது.",
      "தொலைதூர வேலை மற்றும் தனிப்பட்ட வேலையின் நன்மைகள் மற்றும் தீமைகள் விவாதிக்கப்படுகின்றன."
    ],
    "points": 316,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1701440233
  },
  {
    "id": 38489313,
    "title": "பில்லியனர்கள் செல்வத்தை உருவாக்குவதை விட அதிக சொத்துக்களை குவிக்கின்றனர்: யூபிஎஸ் அறிக்கை",
    "originLink": "https://www.ft.com/content/3944234e-e3b4-46fa-8c2f-cadec780ecb4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489313",
    "commentBody": "",
    "originSummary": [
      "யூபிஎஸ் நடத்திய ஒரு கணக்கெடுப்பு பில்லியனர்கள் இப்போது செல்வத்தை உருவாக்குவதை விட பரம்பரை மூலம் அதிக செல்வத்தை குவிக்கிறார்கள் என்பதை வெளிப்படுத்துகிறது.",
      "2023 ஆம் ஆண்டில் 141 பில்லியன் டாலர் சுயமாக உருவாக்கப்பட்ட பில்லியனர்களால் திரட்டப்பட்டது, அதே நேரத்தில் 151 பில்லியன் டாலர் வாரிசுகளால் மரபுரிமையாக பெறப்பட்டது.",
      "அடுத்த 20 முதல் 30 ஆண்டுகளில் 1,000 க்கும் மேற்பட்ட பில்லியனர்கள் தங்கள் குழந்தைகளுக்கு 5.2 டிரில்லியன் டாலரை அனுப்புவார்கள் என்று எதிர்பார்க்கப்படுகிறது, இது இந்த போக்கு தொடரும் என்பதைக் குறிக்கிறது."
    ],
    "commentSummary": [
      "செல்வச் சமத்துவமின்மை, செல்வப் பகிர்வு மற்றும் செல்வக் குவிப்பில் மரபுரிமை பற்றிய விவாதங்களை இந்தத் தொகுப்பு ஆராய்கிறது.",
      "செல்வந்தர்களுக்கு வரி விதிப்பது குறித்த வெவ்வேறு கண்ணோட்டங்கள், சமூகத்தில் செல்வ குவிப்பின் தாக்கம் மற்றும் \"சுயமாக உருவாக்கப்பட்ட\" பில்லியனர்களின் வரையறை ஆகியவை விவாதிக்கப்படுகின்றன.",
      "அரசியலில் பில்லியனர்களின் செல்வாக்கு, தொண்டு நிறுவனங்களை வரி புகலிடங்களாகப் பயன்படுத்துவது, ரகசிய பில்லியனர்களின் இருப்பு ஆகியவையும் விவாதிக்கப்படுகின்றன."
    ],
    "points": 282,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1701451202
  },
  {
    "id": 38495720,
    "title": "டின்னிடஸ் மற்றும் மறைக்கப்பட்ட நரம்பு சேதம் ஆகியவற்றுக்கு இடையேயான தொடர்பை ஆய்வு கண்டறிந்துள்ளது",
    "originLink": "https://scitechdaily.com/tinnitus-linked-to-hidden-undetected-auditory-nerve-damage-a-step-towards-a-cure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38495720",
    "commentBody": "",
    "originSummary": [
      "மாசசூசெட்ஸ் கண் மற்றும் காது ஆராய்ச்சியாளர்கள் டின்னிடஸ் மற்றும் கண்டறியப்படாத செவிப்புலன் நரம்பு சேதம் ஆகியவற்றுக்கு இடையே ஒரு தொடர்பைக் கண்டறிந்துள்ளனர், இது நிலை குறித்த முந்தைய புரிதல்களுக்கு சவாலாக உள்ளது.",
      "சாதாரண செவிப்புலன் சோதனைகளைக் கொண்ட நபர்கள் இன்னும் செவிவழி நரம்பு இழப்பை அனுபவிக்க முடியும் என்று ஆய்வு காட்டுகிறது, இது நரம்பு மீளுருவாக்கத்தை மையமாகக் கொண்ட புதிய சிகிச்சைகளுக்கான திறனைக் குறிக்கிறது.",
      "உலகளவில் 10% க்கும் அதிகமான பெரியவர்களை பாதிக்கும் டின்னிடஸ், வாழ்க்கைத் தரத்தில் கணிசமான தாக்கத்தை ஏற்படுத்தும், இது தூக்க தொந்தரவுகள், சமூக விலகல், பதட்டம் மற்றும் மனச்சோர்வுக்கு வழிவகுக்கும். டின்னிடஸின் அறிகுறிகளைப் போக்க அதன் மூல காரணங்களை குறிவைக்கும் சிகிச்சைகளை உருவாக்குவதை ஆராய்ச்சியாளர்கள் நோக்கமாகக் கொண்டுள்ளனர்."
    ],
    "commentSummary": [
      "உரையாடல்களில் பங்கேற்பாளர்கள் டின்னிடஸுடனான தங்கள் அனுபவங்களைப் பற்றி விவாதிக்கிறார்கள், இது காதுகளில் தொடர்ந்து ஒலித்தல் அல்லது சலசலப்பு ஆகியவற்றால் குறிக்கப்படுகிறது.",
      "தசை நடவடிக்கைகள், தாடை பிரச்சினைகள் மற்றும் நரம்பியல் தீங்கு உள்ளிட்ட டின்னிடஸின் சாத்தியமான காரணங்கள் ஆராயப்படுகின்றன.",
      "வெள்ளை இரைச்சலைக் கேட்பது, செவிப்புலனைப் பாதுகாப்பது மற்றும் குறிப்பிட்ட சிகிச்சையைப் பயன்படுத்துவது போன்ற டின்னிடஸை நிர்வகிப்பதற்கான பல்வேறு அணுகுமுறைகள் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 274,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1701489130
  },
  {
    "id": 38487199,
    "title": "எல்.எல்.எம் செயல்திறன் சவால்: க்யூலோரா மூலம் லாமாவை 5 மடங்கு வேகமாக நேர்த்தியாக்குதல்",
    "originLink": "https://github.com/unslothai/unsloth",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38487199",
    "commentBody": "",
    "originSummary": [
      "எல்.எல்.எம் செயல்திறன் சவாலில் இருந்து ஆசிரியர் ஒரு திட்டத்தை முன்வைக்கிறார், இது ஹக்கிங்ஃபேஸின் அசல் செயல்படுத்தலுடன் ஒப்பிடும்போது க்யூலோராவைப் பயன்படுத்தி லாமாவை 5 மடங்கு வேகமாக நேர்த்தியாக்க உதவுகிறது.",
      "இந்த திட்டத்தில் மேனுவல் ஆட்டோகிராட் எஞ்சின், வேகமான வழிமுறைகள், நினைவக செயல்திறன், ஜிபியு மாடல் பொருந்தக்கூடிய தன்மை மற்றும் துல்லியத்தில் எந்த சமரசமும் இல்லை போன்ற அம்சங்கள் அடங்கும்.",
      "ஃபிளாஷ் கவனம் மற்றும் 4பிட் / 16பிட் ஃபைன்ட்யூனிங்கிற்கான ஆதரவும் வழங்கப்படுகிறது, ஒரு வலைப்பதிவு இடுகையில் கிடைக்கும் விரைவான பயிற்சிக்கு அன்ஸ்லாத் ப்ரோ மற்றும் மேக்ஸ் பற்றிய கூடுதல் தகவல்கள்."
    ],
    "commentSummary": [
      "கிட்ஹப்பில் உள்ள லாமா களஞ்சியம் துல்லியத்தை சமரசம் செய்யாமல் வேகமான மற்றும் அதிக நினைவக திறன் கொண்ட இயந்திர கற்றல் மாதிரிகளை வழங்குகிறது.",
      "எதிர்காலத்தில் கூடுதல் செயற்கை நுண்ணறிவு தயாரிப்புகளை வெளியிட படைப்பாளிகள் திட்டமிட்டுள்ளனர்.",
      "இந்த உரையாடல் திறந்த மூல குறியீட்டை பணமாக்குதல், சாத்தியமான வணிக மாதிரிகள், பெஞ்ச்மார்க்கிங் திட்டங்கள், ஜிபியு பொருந்தக்கூடிய தன்மை மற்றும் குறைந்தபட்ச வன்பொருள் தேவைகள் போன்ற பல்வேறு தலைப்புகளை ஆராய்கிறது."
    ],
    "points": 270,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1701441760
  },
  {
    "id": 38486259,
    "title": "பிட்பக்கெட்டின் பக்கி அனிமேஷன் கட்டுமானத்தின் போது அதிக சிபியு பயன்பாட்டை ஏற்படுத்துகிறது",
    "originLink": "https://thehftguy.com/2023/11/21/buggy-animation-in-atlassian-bitbucket-is-wasting-half-a-cpu-core-at-all-times/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486259",
    "commentBody": "",
    "originSummary": [
      "பிட்பக்கெட் வலை UI ஒரு குளறுபடி அனிமேஷனைக் கொண்டுள்ளது, இது கட்டமைப்பின் போது அதிக சிபியு மற்றும் ஜிபியு பயன்பாட்டை ஏற்படுத்துகிறது.",
      "நிலையான எஸ்.வி.ஜி படத்தை சுழற்றும் அனிமேஷன், மோசமாக உகந்ததாக இல்லை மற்றும் கணினி செயல்திறனை பாதிக்கிறது.",
      "அனிமேஷனை அகற்றுவது சிக்கலை தீர்க்கிறது, ஆனால் முழு பக்கத்தின் தளவமைப்பு ஒவ்வொரு பிரேமிலும் மீண்டும் கணக்கிடப்படுகிறது, இது கூடுதல் செயல்திறன் சிக்கல்களுக்கு வழிவகுக்கிறது."
    ],
    "commentSummary": [
      "அட்லாசியன் பிட்பக்கெட், வலை உலாவிகள் மற்றும் பிற வலைத்தளங்களில் பக்கி அனிமேஷன்கள், அதிக சிபியு பயன்பாடு மற்றும் செயல்திறன் சிக்கல்களுடன் பயனர்கள் தங்கள் விரக்திகளை வெளிப்படுத்துகிறார்கள்.",
      "விவாதங்கள் சிபியு மற்றும் ஜிபியு பயன்பாட்டில் அனிமேஷன்களின் தாக்கம், சில வடிவங்களைக் காண்பிப்பதில் உலாவிகளின் வரம்புகள் மற்றும் உகந்ததாக்கலின் சவால்கள் ஆகியவற்றைச் சுற்றி வருகின்றன.",
      "வள பயன்பாட்டைக் குறைக்கவும் பயனர் அனுபவத்தை மேம்படுத்தவும் பயனர்கள் சாத்தியமான தீர்வுகள் மற்றும் மேம்பாடுகளை ஆராய்ந்து வருகின்றனர்."
    ],
    "points": 247,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1701436285
  },
  {
    "id": 38485596,
    "title": "ravynOS: மேகோஸ் நுணுக்கத்தை ஃப்ரீபிஎஸ்டி சுதந்திரத்துடன் கலத்தல்",
    "originLink": "https://ravynos.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38485596",
    "commentBody": "",
    "originSummary": [
      "ராவினோஸ் என்பது ஒரு திறந்த மூல இயக்க முறைமையாகும், இது மேகோஸின் அதிநவீனத்தை ஃப்ரீபிஎஸ்டியின் நெகிழ்வுத்தன்மையுடன் இணைக்கிறது.",
      "கணினி மேகோஸ் பயன்பாடுகளுடன் இணக்கமானது மற்றும் எந்த வன்பொருள் கட்டுப்பாடுகளும் இல்லை.",
      "இது அதன் இலக்குகளுடன் பொருந்தக்கூடிய ஒரு புதிய பயனர் இடைமுகத்தை உருவாக்குவதை நோக்கமாகக் கொண்டுள்ளது, அதே நேரத்தில் சுத்தமான வடிவமைப்பு, உலகளாவிய மெனுக்கள் மற்றும் டிராக்-அண்ட் டிராப் நிறுவல்கள் போன்ற அம்சங்களையும் ஆதரிக்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் ராவினோஸ், ஃப்ரீபிஎஸ்டி, மேகோஸ், லினக்ஸ் மற்றும் க்னோம் உள்ளிட்ட பல்வேறு இயக்க முறைமைகளை ஆராய்கிறது.",
      "பங்கேற்பாளர்கள் இந்த அமைப்புகளின் வடிவமைப்பு, பயன்பாடு மற்றும் பொருந்தக்கூடிய தன்மை பற்றி விவாதிக்கிறார்கள், மேகோஸிற்கான விருப்பங்களை வெளிப்படுத்துகிறார்கள் அல்லது அதன் இடைமுகம் மற்றும் வரம்புகளை விமர்சிக்கிறார்கள்.",
      "மேக் அல்லாத கணினிகளில் மேகோஸ் பயன்பாடுகளை இயக்குவதற்கான எமுலேட்டர்கள் மற்றும் மெய்நிகர் இயந்திரங்கள் மற்றும் மேகோஸ் போன்ற பயன்பாடுகளுக்கான கட்டமைப்பாக குனுஸ்டெப்பின் திறன் பற்றிய உரையாடல் உள்ளது."
    ],
    "points": 220,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1701430163
  },
  {
    "id": 38492378,
    "title": "விடுமுறை நாட்களில் உதவி கோருதல்: எச்.என் சமூகம் நிதி தேவைகளுக்கு ஆதரவை வழங்குகிறது",
    "originLink": "https://news.ycombinator.com/item?id=38492378",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38492378",
    "commentBody": "",
    "originSummary": [
      "இந்த சுவரொட்டி ஹேக்கர் நியூஸ் (எச்.என்) சமூகத்திற்கு உதவி வழங்குவதற்காக ஒரு ஆரம்ப நூலைத் தொடங்குகிறது.",
      "கடந்த ஆண்டு, அவர்கள் 20 ஆயிரம் டாலர் மதிப்புள்ள ஆதரவை வழங்கினர், மேலும் இந்த ஆண்டு இந்த அறுவை சிகிச்சைக்கு தாங்களே நிதியளிக்க திட்டமிட்டுள்ளனர்.",
      "விடுமுறை வீட்டுவசதி, பரிசுகள், உணவு, பயண உதவி, மருத்துவ செலவுகள் அல்லது பொழுதுபோக்கு உள்ளிட்ட முடிந்தவரை பலருக்கு உதவ மக்களின் நிதித் தேவைகள் மற்றும் பொது நோக்கத்தை அவர்கள் கேட்கிறார்கள். அவை தனியுரிமைக்கு உத்தரவாதம் அளிக்கின்றன மற்றும் தேவைப்படுபவர்களை உதவி கேட்க ஊக்குவிக்கின்றன."
    ],
    "commentSummary": [
      "ஆன்லைன் மன்றங்களில் பயனர்கள் நிதி உதவி, தனிப்பட்ட சவால்களைப் பகிர்வது மற்றும் ஆலோசனை பெறுவது குறித்த விவாதங்களில் ஈடுபட்டுள்ளனர்.",
      "விடுமுறை உதவி, மருத்துவ பொருட்கள் நிதி திரட்டுதல், வேலையின்மை, வீடற்ற நிலை, வணிக தோல்வி, நகரும் பெட்டிகளைக் கண்டுபிடிப்பது மற்றும் குடியேற்ற செயலாக்க கட்டணம் உள்ளிட்ட பல்வேறு தலைப்புகள் விவாதிக்கப்படுகின்றன.",
      "பயனர்கள் தேவைப்படுபவர்களுக்கு உதவி, ஆலோசனைகள் மற்றும் வளங்களை வழங்குகிறார்கள்."
    ],
    "points": 206,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1701464701
  },
  {
    "id": 38486394,
    "title": "OpenAI உடனான மைக்ரோசாப்டின் கூட்டாண்மையின் உள் கதை",
    "originLink": "https://www.newyorker.com/magazine/2023/12/11/the-inside-story-of-microsofts-partnership-with-openai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38486394",
    "commentBody": "",
    "originSummary": [
      "மைக்ரோசாப்ட்டின் அறிவு அல்லது உள்ளீடு இல்லாமல் ஓபன்ஏஐயின் தலைமை நிர்வாக அதிகாரி இலியா சுட்ஸ்கேவர் எதிர்பாராத விதமாக நிறுவனத்தின் நிர்வாகக் குழுவால் பணிநீக்கம் செய்யப்பட்டபோது ஓபன்ஏஐ உடனான மைக்ரோசாப்டின் கூட்டாண்மை ஆபத்தில் இருந்தது.",
      "தலைமை நிர்வாக அதிகாரியின் பணிநீக்கம் ஓபன்ஏஐ மற்றும் மைக்ரோசாப்ட் இடையே பதட்டங்களை உருவாக்கியது மற்றும் செயற்கை நுண்ணறிவின் அபாயங்கள் மற்றும் நன்மைகள் மற்றும் செயற்கை நுண்ணறிவு தொழில்நுட்ப வளர்ச்சியின் வேகம் மற்றும் பாதுகாப்பு குறித்து கவலைகளை எழுப்பியது.",
      "இடைக்கால தலைமை நிர்வாக அதிகாரியை ஆதரிப்பது அல்லது பணிநீக்கம் செய்யப்பட்ட தலைமை நிர்வாக அதிகாரியை மீண்டும் பணியமர்த்துவது உள்ளிட்ட நிலைமையை உறுதிப்படுத்த மைக்ரோசாஃப்ட் பல்வேறு விருப்பங்களை ஆராய்ந்தது, ஆனால் இறுதியில் ஊழியர் அமைதியின்மை மற்றும் கிளர்ச்சி அச்சுறுத்தல்கள் காரணமாக தலைமை நிர்வாக அதிகாரி மீண்டும் நியமிக்கப்பட்டார்."
    ],
    "commentSummary": [
      "ஓபன்ஏஐயின் முன்னாள் தலைமை நிர்வாக அதிகாரியான சாம் ஆல்ட்மேன், வாரிய உறுப்பினர்களைக் கையாள்வதற்கும் அதிகாரத்தை ஒருங்கிணைப்பதற்கும் தனது தந்திரோபாயங்கள் குறித்து சர்ச்சையை எதிர்கொள்கிறார்.",
      "வாரியத்தின் செயலற்ற தன்மை மற்றும் இந்த பிரச்சினையில் மைக்ரோசாப்டின் ஈடுபாடு குறித்து கட்டுரை விவாதிக்கிறது.",
      "ஆல்ட்மேனின் நுண்ணறிவு, அதிகப்படியான சக்தியைப் பெறுவதற்கான திறன் மற்றும் செயற்கை பொது நுண்ணறிவுடன் தொடர்புடைய அபாயங்கள் குறித்து கவலைகள் எழுப்பப்படுகின்றன."
    ],
    "points": 191,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1701437200
  },
  {
    "id": 38489533,
    "title": "மொஸில்லா லாமாஃபைலை அறிமுகப்படுத்துகிறது: உங்கள் கணினியில் எல்.எல்.எம்களை உள்நாட்டில் இயக்கவும்",
    "originLink": "http://simonwillison.net/2023/Nov/29/llamafile/#atom-everything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38489533",
    "commentBody": "",
    "originSummary": [
      "மொஸில்லாவின் கண்டுபிடிப்பு குழு மற்றும் ஜஸ்டின் டன்னி ஆகியோர் உங்கள் சொந்த கணினியில் பெரிய மொழி மாதிரிகளை (எல்.எல்.எம்) இயக்குவதற்கான புதிய முறையான லாமாஃபைலை உருவாக்கியுள்ளனர்.",
      "லாமாஃபைல் என்பது ஒரு மல்டி-ஜிபி கோப்பு ஆகும், இது எல்.எல்.எம் க்கான மாதிரி எடைகள் மற்றும் மாதிரியை இயக்க தேவையான குறியீடு இரண்டையும் கொண்டுள்ளது.",
      "பயனர்கள் காஸ்மோபாலிட்டன் லிப்சியைப் பயன்படுத்தி லாமாஃபைலை இயக்கலாம், இது பல இயக்க முறைமைகள் மற்றும் வன்பொருள் கட்டமைப்புகளில் செயல்படும் ஒற்றை பைனரியைத் தொகுக்கிறது.",
      "லாமாஃபைல் செயல்படுத்தக்கூடியதை இயக்குவதன் மூலம், பயனர்கள் ஒரு வலை சேவையகத்தைத் தொடங்கி தங்கள் உலாவியில் மாதிரியுடன் தொடர்பு கொள்ளலாம், இது இணைய இணைப்பு இல்லாமல் எல்.எல்.எம்களின் உள்ளூர் பயன்பாட்டை செயல்படுத்துகிறது."
    ],
    "commentSummary": [
      "லாமாஃபைல் என்பது பயனர்கள் தங்கள் சொந்த கணினியில் ஒரு மொழி மாதிரியை (எல்எம்) இயக்க அனுமதிக்கும் ஒரு புதிய கருவியாகும், இது எல்.எல்.எம்களுக்கு ஒற்றை கோப்பு விநியோகம் மற்றும் செயலாக்க அமைப்பை வழங்குகிறது.",
      "லாமாஃபைல் சில பயனர்களுக்கு வசதியானது என்றாலும், இது சிறந்த செயல்திறன் முறையாக இருக்காது, குறிப்பாக ஜிபியு முடுக்கம் தேவைப்படும் மாடல்களுக்கு.",
      "சிறந்த செயல்திறனுக்காக ExLLAMA v2 + elx2 quantization மற்றும் tensorrt-llm போன்ற மாற்றுகள் பரிந்துரைக்கப்படுகின்றன.",
      "மேக்புக் எம் 2 ஏர் மற்றும் எல்எம் ஸ்டுடியோ பயன்பாடு உள்ளிட்ட எல்எல்எம்களை இயக்குவதற்கான வன்பொருள் தேவைகள் மற்றும் விருப்பங்களை பயனர்கள் விவாதிக்கின்றனர்.",
      "எல்.எல்.எம்களை இயக்குவதற்கான சிறந்த வழி குறித்த கருத்துக்கள் வேறுபடுகின்றன, சிலர் செயல்படுத்தக்கூடிய மாடலை டெமோக்களுடன் உட்பொதிப்பது டெமோக்களுக்கு மட்டுமே பொருத்தமானது என்று பரிந்துரைக்கின்றனர், மற்றவர்கள் அவற்றின் பயன்பாட்டின் எளிமைக்கு எல்.எம் ஸ்டுடியோ போன்ற கருவிகளை விரும்புகிறார்கள்."
    ],
    "points": 173,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1701452210
  }
]
