[
  {
    "id": 38655066,
    "title": "Udforskning af grundlæggende databaser: ACID-egenskaber, lagringsmotorer og konfliktløsning",
    "originLink": "https://tontinton.com/posts/database-fundementals/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38655066",
    "commentBody": "",
    "originSummary": [
      "Passagen udforsker centrale emner i databaser såsom ACID-egenskaber, lagringsmotorer, distribuerede systemer, konsistent hashing og konfliktløsning.",
      "Der lægges vægt på betydningen af holdbarhed, ydeevne og tilgængelighed i databaser.",
      "Forskellige strategier til minimering af konflikter diskuteres sammen med eksempler og implementeringer fra det virkelige liv."
    ],
    "commentSummary": [
      "Oversigten giver et overblik over forskellige emner relateret til grundlæggende databaser, herunder teorier, optimeringer, indekser, distribuerede systemer og domænespecifikke databaser.",
      "Den dækker også lagrings- og indekseringsmetoder, der bruges i specifikke databasesystemer.",
      "Diskussioner om at arbejde som databaseingeniør eller -administrator og karrieremuligheder inden for området er også inkluderet."
    ],
    "points": 667,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1702654110
  },
  {
    "id": 38657577,
    "title": "Mistænkte kan nægte politiet adgangskoder til telefoner, fastslår domstol i Utah",
    "originLink": "https://arstechnica.com/tech-policy/2023/12/suspects-can-refuse-to-provide-phone-passcodes-to-police-court-rules/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38657577",
    "commentBody": "",
    "originSummary": [
      "Utahs højesteret har enstemmigt afgjort, at mistænkte har ret til at nægte at udlevere telefonkoder til politiet baseret på det femte forfatningstillægs beskyttelse mod selvinkriminering.",
      "Dommen resulterede i, at en mistænkt blev omstødt, fordi han nægtede at udlevere sin adgangskode.",
      "Denne afgørelse kan få USA's højesteret til at tage stilling til spørgsmålet og skabe klarhed over, hvordan det femte forfatningstillæg gælder for oplåsning af telefoner, og dermed fjerne inkonsekvensen og forvirringen i de lavere domstoles afgørelser."
    ],
    "commentSummary": [
      "Diskussionen udforsker enkeltpersoners rettigheder, når de interagerer med politiet, såsom retten til ikke at udtale sig og brugen af adgangskoder på telefoner.",
      "Der er en debat om domstolsafgørelser og deres indvirkning på privatlivets fred, kryptering og behovet for en ændring af de digitale privatlivsrettigheder.",
      "Bekymringer om politiets magtmisbrug og brugen af dommerkendelser bliver også nævnt i samtalen."
    ],
    "points": 493,
    "commentCount": 343,
    "retryCount": 0,
    "time": 1702667783
  },
  {
    "id": 38657126,
    "title": "Omvendt udvikling af Bluetooth LE LED-lyskontroller: Fra succes med hjemmeautomatisering til utilsigtet ødelæggelse",
    "originLink": "https://www.whizzy.org/2023-12-14-bricked-xmas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38657126",
    "commentBody": "",
    "originSummary": [
      "Forfatteren deler sin erfaring med reverse engineering af LED-lyscontrollere, der bruger Bluetooth LE til kommunikation.",
      "De havde succes med at forbinde billige lamper til deres hjemmeautomatiseringssystem, men havde udfordringer med mere komplekse lamper, der blev styret af appen \"iDeal LED\".",
      "Forfatteren beskriver de trin, de tog for at reverse engineere Bluetooth-kommunikationen, herunder analyse af bytes, genafspilning af angreb, dekompilering af Android-appen og dekryptering af pakker.",
      "De opdagede også yderligere effekter, som ikke var tilgængelige i appen, men kom til at ødelægge lyset i processen.",
      "På trods af tilbageslaget dokumenterede forfatteren protokollen og udviklede en tilpasset komponent til Home Assistant."
    ],
    "commentSummary": [
      "Forfatteren deler sine erfaringer med at fejlfinde julelys og opdage et mønster i hex-dumpen.",
      "Der er en diskussion om LED-lys, strømforsyningsfejl og brug af en Raspberry Pi til at redde LED-strenge.",
      "Samtalen udforsker emner som at teste lys med multimetre, reverse engineering af krypterede lys og genbrug af julelys med alternative mikrocontrollere."
    ],
    "points": 416,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1702665670
  },
  {
    "id": 38653456,
    "title": "Sådan designede en maskiningeniørstuderende et Lego Polaroid-kamerasæt",
    "originLink": "https://www.theverge.com/c/23991049/lego-ideas-polaroid-onestep-behind-the-scenes-price",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38653456",
    "commentBody": "",
    "originSummary": [
      "Lego har valgt designet til et Lego Polaroid-kamera skabt af maskiningeniørstuderende Marc Corfmat som et officielt sæt, efter at det fik 10.000 stemmer på Lego Ideas-platformen.",
      "Udviklingsprocessen involverede streng kvalitetskontrol og testning, og der var udfordringer med at skabe en fungerende udløserknap og vælge materialet til billedet.",
      "Det endelige design ligner meget den originale Polaroid OneStep-model, men nogle af de ønskede funktioner, såsom en kamerarem og garantiklistermærker, blev ikke inkluderet. Selvom Marc ikke var direkte involveret i designprocessen, er han begejstret for at se sin idé blive til virkelighed og vil modtage 10 gratis eksemplarer af Lego-sættet."
    ],
    "commentSummary": [
      "En Reddit-tråd giver en omfattende diskussion om forskellige emner relateret til Lego-sæt, herunder typer af Lego-klodser, størrelseskompatibilitet, udfordringer ved at indsende design og indflydelsen af kunstig intelligens i Lego-skabelse.",
      "Samtalen kommer også ind på ændringer i Legos produktstrategi, meninger om Legos tiltrækningskraft og miljøpåvirkning, nostalgi for ældre sæt og oplevelsen af at bygge Lego som voksen.",
      "Diskussionen fremhæver Lego-entusiasternes forskellige meninger og erfaringer og viser den brede vifte af tanker om Legos egnethed til kreativ leg."
    ],
    "points": 362,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1702643126
  },
  {
    "id": 38652887,
    "title": "Oxlint: En hurtigere og mere effektiv JavaScript Linter til forbedret kodekvalitet",
    "originLink": "https://oxc-project.github.io/blog/2023-12-12-announcing-oxlint.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38652887",
    "commentBody": "",
    "originSummary": [
      "Oxlint, en JavaScript linter, er blevet frigivet og er nu generelt tilgængelig.",
      "Målet er at forbedre ESLint ved at tilbyde hurtigere feedback og bedre diagnostik.",
      "Oxlint er designet til ydeevne, med en hastighed, der er 50-100 gange hurtigere end ESLint, og det fokuserer på at identificere fejl i koden. Derudover kræver det ingen konfiguration at bruge.",
      "Værktøjet konsoliderer regler fra populære plugins og har planer om at udvikle et pluginsystem i fremtiden."
    ],
    "commentSummary": [
      "Diskussionen omfatter forskellige emner som linters, programmeringssprog og værktøjer inden for softwareudvikling.",
      "Der er debat om linternes anvendelighed og kompleksitet med forslag til forbedring af ESLint og TypeScript linting.",
      "Sammenligninger mellem forskellige formatters og linters, diskussioner om JavaScript-økosystemet og alternative sprog som Rust og Go er også en del af samtalen, der fremhæver udfordringerne og overvejelserne ved brug af linters og valg af programmeringssprog."
    ],
    "points": 280,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1702637304
  },
  {
    "id": 38653110,
    "title": "WebP's komprimering er ikke nok til professionelt fotografi: Webdesignerens kritik",
    "originLink": "https://eng.aurelienpierre.com/2021/10/webp-is-so-great-except-its-not/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38653110",
    "commentBody": "",
    "originSummary": [
      "Forfatteren, en ansvarlig webdesigner, udtrykker frustration over at konvertere sit fotobibliotek fra JPEG til WebP-format og sætter spørgsmålstegn ved effektiviteten af WebP's tabsfri komprimering til professionel fotografering.",
      "Forfatteren argumenterer imod brugen af gennemsnit og målinger til at evaluere billedkvalitet og foreslår, at man i stedet holder sig til JPEG-filer af høj kvalitet.",
      "Der anbefales alternativer til at forbedre indlæsningshastigheden og brugeroplevelsen, herunder brug af et hurtigt CDN, responsive billedstørrelser og lazy loading af billeder, samt samarbejde med kunstnere og prioritering af deres udfordringer og prioriteter."
    ],
    "commentSummary": [
      "Artiklen undersøger bekymringer om kvaliteten af WebP-billedformatet og sammenligner det med formater som JPEG og PNG med hensyn til filstørrelse og visningskvalitet.",
      "Den diskuterer brugen af tabsfrie WebP-filer som et alternativ til PNG og fremhæver den varierende understøttelse af WebP i forskellige browsere.",
      "Artiklen nævner, at udviklingen af WebP2 er stoppet, og introducerer alternative formater som AVIF og JPEG XL, samt Mozillas mozjpeg-projekt."
    ],
    "points": 265,
    "commentCount": 376,
    "retryCount": 0,
    "time": 1702639964
  },
  {
    "id": 38657029,
    "title": "CSS-stilarter, JavaScript-manipulation og HTML Append: En omfattende guide til websideteknik",
    "originLink": "https://platform.openai.com/docs/guides/prompt-engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38657029",
    "commentBody": "",
    "originSummary": [
      "Det første uddrag indeholder CSS-stilarter til en webside, herunder skrifttype, layout, animation, farver og medieforespørgsler.",
      "Det andet og tredje uddrag består af JavaScript-kode, der ændrer browserhistorikken og tilføjer script- og HTML-elementer til et HTML-dokument.",
      "Disse snippets indeholder instruktioner til styling og forbedring af funktionaliteten på en webside."
    ],
    "commentSummary": [
      "Diskussionerne er centreret omkring prompt engineering og sprogmodellernes begrænsninger, og deltagerne deler deres erfaringer og strategier for at opnå de ønskede resultater.",
      "Klare instruktioner og strukturerede data fremhæves som afgørende for at opnå de ønskede resultater.",
      "Sprogmodellernes potentielle indvirkning på menneskelig kommunikation og vigtigheden af specifikke prompts for at forbedre modeloutput diskuteres også. Diskussionerne giver indsigt i udfordringerne og de potentielle fremskridt inden for sprogmodeller."
    ],
    "points": 254,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1702665030
  },
  {
    "id": 38653212,
    "title": "Supabase og Fly.io lancerer sammen Fly Postgres, et Managed Postgres-tilbud på Edge Computing-platformen",
    "originLink": "https://supabase.com/blog/postgres-on-fly-by-supabase",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38653212",
    "commentBody": "",
    "originSummary": [
      "Supabase og Fly.io er gået sammen om at introducere Fly Postgres, en administreret Postgres-løsning, der muliggør implementering af Postgres-databaser på Fly.ios edge computing-platform.",
      "Fly Postgres tilbyder fordele som udvidelser, pgVector-understøttelse, connection pooling, backups og observerbarhed, hvilket gør det ideelt til applikationer med store datamængder.",
      "Supabase har udviklet en strømlinet proces til at interagere med Fly API, og dette samarbejde markerer Supabases skift mod at blive en multi-cloud-udbyder.",
      "Udfordringer som netværksbegrænsninger og backups i Fly er ved at blive løst, og interesserede brugere kan tilmelde sig previewet, som inkluderer et gratis projekt.",
      "Prisoplysninger for Fly Postgres vil blive annonceret i fremtiden, men det forventes at forblive relativt uændret i forhold til den nuværende prisstruktur."
    ],
    "commentSummary": [
      "Supabase har indgået et samarbejde med Fly.io om at levere en managed version af Flys unmanaged Postgres med planer om at introducere high availability-funktioner.",
      "Diskussionen omfatter emner som cloud-infrastrukturens udfordringer med hensyn til pålidelighed og ydeevne, forskellen mellem Fly.io og Supabases databasetilbud, sammenligninger med andre Postgres-tjenester og bekymringer vedrørende IP-adresser og netværksbegrænsninger.",
      "Supabase er også i gang med at udvikle blob storage-funktioner til deres tjenester, og integrationen af Supabase og Fly.io betragtes som en positiv udvikling."
    ],
    "points": 240,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1702641176
  },
  {
    "id": 38654805,
    "title": "Databrud hos Delta Dental afslører personlige oplysninger om 7 mio. patienter",
    "originLink": "https://www.bleepingcomputer.com/news/security/delta-dental-says-data-breach-exposed-info-of-7-million-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38654805",
    "commentBody": "",
    "originSummary": [
      "Delta Dental of California og dets datterselskaber blev udsat for et databrud, der kompromitterede de personlige oplysninger om næsten 7 millioner patienter.",
      "Bruddet skyldtes en sårbarhed i MOVEit Transfer-softwaren.",
      "Virksomheden er i gang med at undersøge og reagere på hændelsen, herunder at underrette de berørte personer."
    ],
    "commentSummary": [
      "Tandforsikringsselskabet Delta Dental oplevede et databrud, der kompromitterede 7 millioner personers personlige oplysninger, herunder navne, finansielle kontonumre og kredit-/hævekortnumre.",
      "Bruddet kan føre til alvorlige konsekvenser for Delta Dental, hvilket potentielt kan resultere i, at de bliver frataget muligheden for at behandle kreditkort.",
      "Denne hændelse understreger vigtigheden af robuste datasikkerhedsforanstaltninger og de potentielle risici og konsekvenser, der er forbundet med et brud. Diskussioner omkring bruddet involverer bekymringer om datasikkerhedspraksis, overholdelse af PCI-regler og beskyttelse af kredit- og betalingskortoplysninger."
    ],
    "points": 233,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1702652377
  },
  {
    "id": 38658262,
    "title": "Øg produktiviteten inden for softwareudvikling med 4 vigtige vaner",
    "originLink": "https://read.engineerscodex.com/p/simple-software-engineering-habits",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38658262",
    "commentBody": "",
    "originSummary": [
      "Fire vigtige vaner diskuteres for at forbedre softwareudviklingens produktivitet: at lade arbejdet være lidt ufærdigt, at lære genveje, at vedligeholde en liste over kommandoer og links og at sige \"nej\" til ikke-væsentlige opgaver.",
      "Begrebet \"flow\" introduceres som en tilstand, der kan opnås ved at lade arbejdet være lidt ufærdigt, hvilket giver bedre fokus og produktivitet.",
      "Vigtigheden af at lære tastatur- og musegenveje understreges for at reducere afhængigheden af musen og øge effektiviteten.",
      "Det anbefales at have en liste over søgbare kommandoer og links, så man hurtigt kan få adgang til vigtige ressourcer og spare tid.",
      "Artiklen foreslår, at man lærer at sige \"nej\" til ikke-væsentlige opgaver for at prioritere vigtigt arbejde og undgå unødvendige distraktioner.",
      "En software engineering-quiz nævnes som et værktøj til at forbedre viden og selvtillid i jobsamtaler."
    ],
    "commentSummary": [
      "Hacker News er vært for en diskussion om konceptet med at lade arbejdet være lidt ufærdigt sidst på dagen for at øge produktiviteten og fokus.",
      "Deltagerne deler strategier til at forstå opgaver fuldt ud og fremhæver fordelene ved at begynde den næste dag med en frisk start.",
      "Samtalen dykker ned i effektiviteten af at lade opgaver være ufærdige som et produktivitetshack, implementering af standardinstruktioner og vedtagelse af effektive vaner inden for softwareudvikling."
    ],
    "points": 207,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1702671237
  },
  {
    "id": 38658497,
    "title": "DIY USB-C MIDI-synth: Den mindste og mest overkommelige mikrocontroller-skabelse",
    "originLink": "https://mitxela.com/projects/smsc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38658497",
    "commentBody": "",
    "originSummary": [
      "Forfatteren deler sin erfaring med at skabe en USB-C MIDI-synthesizer ved hjælp af en billig mikrocontroller.",
      "De diskuterer brugen af eksisterende USB-stakke, lodning af et breakoutboard til test og oprettelse af et lille udviklingsboard til fremtidige projekter.",
      "Forfatteren fortæller også om udfordringerne ved at designe en printplade til et vertikalt monteret USB-C-stik, designprocessen og panelisering.",
      "De ændrede USB-stikkets fodaftryk, samlede kortet og designede et stik til en telefon- eller tabletdock.",
      "Andre emner, der nævnes, er brug af USB-C-forlængerkabler, blinkende synthesizere og potentielle problemer med en USB-C-port.",
      "Forfatteren afslutter med at nævne tilgængeligheden af projektets kildekode."
    ],
    "commentSummary": [
      "En hacker har udviklet verdens mindste USB-C MIDI Synth, en synthesizer, der kan sættes i en USB-C-port.",
      "Projektet blev gennemført på blot et par dage og krævede materialer, der kostede mellem 50 og 200 dollars.",
      "Hackeren fremhæver fordelene ved at arbejde på personlige projekter uden de begrænsninger, som virksomheder pålægger.",
      "Synthesizeren kan generere firkantbølger og betragtes som en rigtig synthesizer på grund af dens evne til at generere bølgeformer med audiohastighed.",
      "Udfordringerne i forbindelse med USB-C-kabler og -stik diskuteres også."
    ],
    "points": 205,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1702672616
  },
  {
    "id": 38654533,
    "title": "Sårbarhed i Writer.com muliggør datatyveri via manipulation af sprogmodel",
    "originLink": "https://promptarmor.substack.com/p/data-exfiltration-from-writercom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38654533",
    "commentBody": "",
    "originSummary": [
      "Indlægget diskuterer en sårbarhed i Writer.com-applikationen, der gør det muligt for angribere at få adgang til en brugers private dokumenter.",
      "Angribere kan udnytte denne sårbarhed ved hjælp af et angreb kaldet indirect prompt injection, hvor sprogmodellen manipuleres til at sende private oplysninger til angriberen.",
      "Writer.com har endnu ikke rettet denne sårbarhed, selv om den er blevet afsløret.",
      "Indlægget præsenterer en angrebskæde, der viser, hvordan sårbarheden kan udnyttes, og deler eksempler på dataekfiltrering.",
      "Tidligere lignende angreb på sprogmodeller nævnes sammen med yderligere ressourcer om emnet.",
      "Indlægget giver også en tidslinje over ansvarlig offentliggørelse til Writer.com-teamet."
    ],
    "commentSummary": [
      "En hacker brugte en indirekte prompt injection-teknik til at udtrække data fra Writer.com ved at udnytte en sårbarhed i chatbottens håndtering af subliminale kommandoer indlejret i et dokument.",
      "Dette angreb udvisker grænsen mellem teknisk hacking og social engineering og understreger den voksende tendens til at bruge menneskeligt sprog i computerinteraktioner.",
      "Hændelsen giver anledning til bekymring om krav til adgangskontrol, risici ved social engineering og potentialet for, at maskinlæringsmodeller kan generere overbevisende menneskelignende svar. Det er yderst vigtigt at sikre beskyttelsen af brugerdata."
    ],
    "points": 203,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1702650660
  },
  {
    "id": 38652794,
    "title": "At optrævle mønstre: En interaktiv guide til Fourier-transformationen",
    "originLink": "https://betterexplained.com/articles/an-interactive-guide-to-the-fourier-transform/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38652794",
    "commentBody": "",
    "originSummary": [
      "Fourier-transformationen er et matematisk værktøj, der nedbryder mønstre i individuelle komponenter til analyse.",
      "Den ser signaler som cirkulære baner og gør det muligt at filtrere, adskille komponenter, komprimere data og analysere lyd- og radiobølger.",
      "Artiklen giver ressourcer og eksempler til at lære om Fourier-transformationen og fremhæver dens evne til at forstå cyklusser og skabe komplekse former ved at kombinere dem."
    ],
    "commentSummary": [
      "Fourier-transformationen er et matematisk værktøj, der bruges til at konvertere signaler mellem tidsdomænet og frekvensdomænet, hvilket muliggør analyse, komprimering og filtrering.",
      "Det finder anvendelse i billed- og lydkomprimering, telekommunikation og medicinsk udstyr som cochlear-implantater.",
      "Diskussionen giver indsigt i definitionen, egenskaberne og intuitive forklaringer af Fourier-transformationen og tilbyder yderligere ressourcer til yderligere forståelse."
    ],
    "points": 197,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1702636180
  },
  {
    "id": 38652736,
    "title": "Tips til at indhente det forsømte med AI/ML: Fra R-CNN til \"Attention is All You Need\" og videre endnu",
    "originLink": "https://news.ycombinator.com/item?id=38652736",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38652736",
    "commentBody": "",
    "originSummary": [
      "Vedkommende er interesseret i at genoptage arbejdet med maskinlæring og har samlet en liste over emner, han eller hun gerne vil udforske.",
      "De nævnte emner som \"opmærksomhed er alt, hvad du behøver\", qlora, lamaer og q-læring.",
      "De søger forslag til yderligere områder at udforske inden for maskinlæring."
    ],
    "commentSummary": [
      "Samtalen handler om ressourcer til at lære om kunstig intelligens (AI), maskinlæring (ML) og dyb læring, med vægt på praktisk anvendelse og hands-on erfaring frem for blot at læse artikler.",
      "Forskellige kategorier af AI-forskningsartikler diskuteres sammen med specifikke emner og artikler inden for hver kategori.",
      "Der er også en omtale af at finde og forstå artikler inden for nye områder af AI, værktøjer til notationsforklaringer og anbefalinger til yderligere læringsressourcer."
    ],
    "points": 193,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1702635554
  },
  {
    "id": 38657192,
    "title": "Kytch afslører 'rygende pistol' e-mail i sagen om hacking af McDonald's ismaskine",
    "originLink": "https://www.wired.com/story/kytch-taylor-mcdonalds-ice-cream-machine-smoking-gun/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38657192",
    "commentBody": "",
    "originSummary": [
      "Startup-virksomheden Kytch har fundet en e-mail, som de mener viser, at McDonald's og Taylor, producenten af de ismaskiner, som Kytch forsøgte at reparere, har aftalt et samarbejde.",
      "E-mailen, der er sendt af Taylors CEO, foreslår, at man sender en besked til McDonald's franchisetagere for at fraråde brugen af Kytchs enhed.",
      "Kytch mener, at denne e-mail er bevis på Taylors hensigt om at skade en potentiel konkurrent, og han er i gang med at lægge sag an mod Taylor og McDonald's."
    ],
    "commentSummary": [
      "Der diskuteres forskellige problemer i forbindelse med McDonald's ismaskiner, såsom bevidste funktionsfejl og personaleproblemer.",
      "Automatiseringens indvirkning på forskellige typer arbejde bliver også diskuteret sammen med de udfordringer, som McDonald's medarbejdere står over for.",
      "Der er indgivet klager mod McDonald's over ødelagte ismaskiner, og kontroverser omkring Kytch-enheden er blevet nævnt, hvilket rejser spørgsmål om motiverne bag de hyppige nedbrud."
    ],
    "points": 192,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1702666052
  }
]
