[
  {
    "id": 38681861,
    "title": "ஒழுங்குமுறை மறுஆய்வுக்குப் பிறகு ஃபிக்மா மற்றும் அடோப் இணைப்பைக் கைவிடுகின்றன",
    "originLink": "https://www.figma.com/blog/figma-adobe-abandon-proposed-merger/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681861",
    "commentBody": "",
    "originSummary": [
      "நீண்ட ஒழுங்குமுறை மறுஆய்வு செயல்முறைக்குப் பிறகு ஃபிக்மா மற்றும் அடோப் தங்கள் திட்டமிடப்பட்ட இணைப்பை நிறுத்தியுள்ளன.",
      "ஃபிக்மா அதன் சுயாதீன அந்தஸ்தை பராமரிக்கும் மற்றும் அடோப் உடனான கூட்டாண்மை வாய்ப்புகளை ஆராய திறந்திருக்கும்.",
      "டிஜிட்டல் தயாரிப்புகளின் வடிவமைப்பு மற்றும் வளர்ச்சியை எளிதாக்குவதில் வலுவான கவனம் செலுத்தி, கடந்த 15 மாதங்களில் ஃபிக்மா கணிசமான முன்னேற்றங்களை அடைந்துள்ளது. தலைமை நிர்வாக அதிகாரி டிலான் ஃபீல்ட் நிறுவனத்தின் எதிர்காலம் குறித்த நம்பிக்கையையும் சமூகத்தின் ஆதரவுக்கு நன்றியையும் வெளிப்படுத்தினார்."
    ],
    "commentSummary": [
      "ஃபிக்மா மற்றும் அடோப் இடையேயான சாத்தியமான இணைப்பு நிறுத்தப்பட்டுள்ளது, இதன் பின்னணியில் உள்ள காரணங்கள் மற்றும் ஃபிக்மா ஊழியர்கள் மீதான அதன் தாக்கம் குறித்த விவாதங்களுக்கு வழிவகுத்தது.",
      "ஃபிக்மா போன்ற வடிவமைப்பு கருவிகளின் நன்மைகள் மற்றும் வரம்புகள் உரையாடலில் ஆராயப்படுகின்றன, அத்துடன் வடிவமைப்பு துறையில் செயற்கை நுண்ணறிவின் சாத்தியமான இடையூறு.",
      "ஸ்டார்ட்அப் கலாச்சாரத்தில் ஒருங்கிணைப்பு மற்றும் ஐபிஓக்கள், ஒழுங்குமுறை மேற்பார்வை, நீண்டகால நிலைத்தன்மை மற்றும் டிஜிட்டல் சந்தைகளில் நம்பிக்கை எதிர்ப்பு சட்டத்தின் பங்கு பற்றிய கவலைகளையும் இந்த விவாதம் தொடுகிறது."
    ],
    "points": 1934,
    "commentCount": 877,
    "retryCount": 0,
    "time": 1702904674
  },
  {
    "id": 38681672,
    "title": "ரஷ்ய படையெடுப்புக்கு மத்தியில் வாஸ்ம் 3 பராமரிப்பு கட்டத்தில் நுழைகிறது",
    "originLink": "https://github.com/wasm3/wasm3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681672",
    "commentBody": "",
    "originSummary": [
      "தங்கள் நாட்டின் மீது படையெடுக்கும் ரஷ்யர்களால் டெவலப்பரின் வீடு அழிக்கப்பட்டதால், வெப்அசெம்ப்ளி மொழிபெயர்ப்பாளரான வாஸ்ம் 3 க்கான புதிய அம்சங்களின் வளர்ச்சி தற்காலிகமாக நிறுத்தப்படுகிறது.",
      "டெவலப்பர் தொடர்ந்து திட்டத்தைப் பராமரிப்பார், மதிப்பாய்வு செய்வார் மற்றும் புல் கோரிக்கைகளை இணைப்பார்.",
      "வாஸ்ம் 3 என்பது ஒரு பல்துறை மொழிபெயர்ப்பாளர் ஆகும், இது பல்வேறு தளங்கள் மற்றும் கட்டமைப்புகளில் பயன்படுத்தப்படலாம் மற்றும் வெப்அசெம்ப்ளி ஸ்பெக் டெஸ்டுவைட்டில் தேர்ச்சி பெறுகிறது. இது பெயர்வுத்திறன், பாதுகாப்பு, செயல்படுத்தக்கூடிய அளவு, நினைவக பயன்பாடு மற்றும் தொடக்க தாமதம் ஆகியவற்றின் அடிப்படையில் நன்மைகளை வழங்குகிறது. உட்பொதிக்கப்பட்ட சாதனங்களில் வெப்செம்ப்ளியை இயக்குவதில் இது சாத்தியமான பயன்பாடுகளைக் கொண்டுள்ளது. இந்த திட்டம் எம்ஐடி உரிமத்தின் கீழ் வெளியிடப்படுகிறது."
    ],
    "commentSummary": [
      "உக்ரைன் வரலாறு, தேசியவாதம், பிரச்சாரம், வளங்களை பிரித்தெடுத்தல், பொருளாதாரத் தடைகள் மற்றும் அணு ஆயுதங்கள் போன்ற ரஷ்யா-உக்ரைன் மோதல் தொடர்பான பல்வேறு விஷயங்களை இந்த உரையாடல் ஆராய்கிறது.",
      "உக்ரைனை ஆதரிப்பதா, ரஷ்யாவின் நோக்கங்களை ஆராய்வது மற்றும் வெவ்வேறு நிரலாக்க மொழிகளின் செயல்திறனைப் பற்றி விவாதிப்பது ஆகியவை இதில் அடங்கும்.",
      "இந்த உரையாடல் குறியீட்டில் வளக் கசிவுகளைத் தணிப்பதற்கான நுட்பங்களையும் பேசுகிறது மற்றும் நடந்து வரும் மோதல் மற்றும் அதன் விளைவுகள் குறித்து பரந்த அளவிலான கருத்துக்களையும் கவலைகளையும் வெளிப்படுத்துகிறது."
    ],
    "points": 512,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1702903418
  },
  {
    "id": 38681450,
    "title": "\"நான் 2024 ஷெவி தாஹோவை $ 1 க்கு வாங்கினேன்\" - ட்விட்டர் பயனரின் ஆச்சரியமான கார் வாங்குதல்",
    "originLink": "https://twitter.com/ChrisJBakke/status/1736533308849443121",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681450",
    "commentBody": "",
    "originSummary": [
      "ட்விட்டர் பயனர் கிறிஸ் பாக்கே 2024 ஷெவி டாஹோவை வெறும் 1 டாலருக்கு வாங்கியதாக குற்றம் சாட்டியுள்ளார்.",
      "மிகவும் வழக்கத்திற்கு மாறான அல்லது தவறான வழியில் பக்கே வாகனத்தைப் பெற்றிருக்கலாம் என்பதை இந்த கூற்று குறிக்கிறது.",
      "இந்த கூற்று நியாயமானதா அல்லது இது வெறும் சமூக ஊடக கட்டுக்கதையா என்பது தெளிவாகத் தெரியவில்லை."
    ],
    "commentSummary": [
      "சட்டக் கவலைகள், நிறுவனத்தின் பொறுப்புகள் மற்றும் கையாளுதல் மற்றும் நேர்மையின்மை பற்றிய கவலைகள் உள்ளிட்ட வாடிக்கையாளர் சேவையில் சாட்போட்களின் சிக்கல்கள் மற்றும் வரம்புகளைச் சுற்றி விவாதம் சுழல்கிறது.",
      "மனித பிரதிநிதிகளுடன் ஒப்பிடும்போது சாட்போட் செயல்திறன் குறித்த பார்வைகள் வேறுபடுகின்றன, சில பங்கேற்பாளர்கள் வாடிக்கையாளர் ஆதரவுடன் எதிர்மறையான அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள்.",
      "மொழி மாறுபாடு, வாடிக்கையாளர் சேவையில் ஆட்டோமேஷன் மற்றும் செயற்கை நுண்ணறிவு மொழி மாதிரிகளின் பயன்பாடு போன்ற தலைப்புகளும் விவாதிக்கப்படுகின்றன, மேலும் மாற்று தீர்வுகள் பரிந்துரைக்கப்படுகின்றன."
    ],
    "points": 403,
    "commentCount": 327,
    "retryCount": 0,
    "time": 1702901331
  },
  {
    "id": 38691025,
    "title": "ஆசிரியரின் மேக்புக் பூட்டப்பட்டது, டிம் குக் அதைத் திறக்கிறார்",
    "originLink": "https://www.tokyodev.com/articles/unbricking-my-macbook-took-an-email-to-tim-cook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38691025",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியரின் மேக்புக் ஒரு செயல்படுத்தல் பூட்டுடன் அவர்களுக்கு திருப்பி அனுப்பப்பட்டது, சாதனத்திற்கான அணுகலைத் தடுக்கிறது.",
      "ஆப்பிள் ஆரம்பத்தில் மேக்புக்கைத் திறக்க மறுத்தது, ஆனால் ஆசிரியர் மின்னஞ்சல் மூலம் டிம் குக்கை அணுகி இறுதியில் அதைத் திறந்தார்.",
      "புதிதாக உருவாக்கப்பட்ட ஐக்ளவுட் கணக்கால் மேக்புக் அழிக்கப்பட்டு தொலைந்துவிட்டதாக தெரிவிக்கப்பட்டது, இது ஒரு கடைக்கு எடுத்துச் செல்லப்பட்டு, மீட்டமைக்கப்பட்டு, பணம் பறிக்க தொலைந்ததாக தெரிவிக்கப்பட்டது.",
      "ஃபைண்ட்மை அமைக்காததன் விளைவுகளை சிறப்பாகத் தெரிவிக்க ஆப்பிள் தங்கள் அமைப்பு பணிப்பாய்வை மாற்றியமைக்க வேண்டியதன் அவசியத்தை ஆசிரியர் எடுத்துக்காட்டுகிறார், ஏனெனில் நேர்மையற்ற கடைகள் இந்த சூழ்நிலையைப் பயன்படுத்தக்கூடும்.",
      "ஆசிரியர் இந்த சிக்கலை ஆப்பிள் செக்யூரிட்டி ரிசர்ச்சிடம் புகாரளித்தார், ஆனால் அது நிராகரிக்கப்பட்டது."
    ],
    "commentSummary": [
      "ஆப்பிள் தயாரிப்புகளில் கவனம் செலுத்தி, சாதன பாதுகாப்பு, உரிமையாளர் மற்றும் வாடிக்கையாளர் ஆதரவு ஆகியவற்றைச் சுற்றி விவாதங்கள் சுழல்கின்றன.",
      "பயனர்கள் தங்கள் சாதனங்கள் மீதான ஆப்பிளின் கட்டுப்பாடு குறித்து விரக்தியை வெளிப்படுத்துகிறார்கள், சிலர் திருட்டு எதிர்ப்பு அம்சங்களை பாராட்டுகிறார்கள்.",
      "பாதுகாப்பு நடவடிக்கைகளை மேம்படுத்துவதற்கும், திருட்டு தடுப்பு மற்றும் பயனர் தேவைகளுக்கு இடையில் ஒரு சமநிலையைக் கண்டுபிடிப்பதற்கும் பரிந்துரைகள் முன்மொழியப்பட்டுள்ளன."
    ],
    "points": 361,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1702952361
  },
  {
    "id": 38684925,
    "title": "புதிய வேர்ட்2வெக் மாடல்கள் முந்தைய அணுகுமுறைகளை விட சிறந்தவை",
    "originLink": "https://openreview.net/forum?id=idpCdOWtqXd60",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684925",
    "commentBody": "",
    "originSummary": [
      "பெரிய தரவுத்தொகுப்புகளைப் பயன்படுத்தி, திசையன் இடத்தில் சொல் பிரதிநிதித்துவங்களை உருவாக்குவதற்கான இரண்டு புதுமையான மாதிரி கட்டமைப்புகளை இந்த கட்டுரை முன்வைக்கிறது.",
      "கணக்கீட்டு வளத் தேவைகளைக் குறைக்கும் அதே வேளையில் துல்லியத்தில் குறிப்பிடத்தக்க மேம்பாடுகளை ஆசிரியர்கள் காட்டுகிறார்கள்.",
      "திசையன் பிரதிநிதித்துவங்கள் சொல் ஒற்றுமைகளை அளவிடுவதில் அதிநவீன செயல்திறனை அடைந்தன, அவற்றின் செயல்திறனை நிரூபித்தன.",
      "ஆசிரியர்கள் தங்கள் சோதனைத் தொகுப்பை மேலதிக ஆய்வுக்காக மற்ற ஆராய்ச்சியாளர்களுக்கு கிடைக்கச் செய்ய விரும்புகிறார்கள்."
    ],
    "commentSummary": [
      "இந்த சுருக்கம் வேர்ட்2வெக் தொடர்பான பல்வேறு அம்சங்கள், கல்வி மாநாடுகள், சக மதிப்பாய்வு மற்றும் அறிவியல் ஆராய்ச்சியின் பின்னணியில் தரப்படுத்தப்பட்ட நேர்காணல்கள் ஆகியவற்றை ஆராய்கிறது.",
      "இது வெளியீட்டு அமைப்புகளில் உள்ள வரம்புகள் மற்றும் செயற்கை நுண்ணறிவுத் துறையின் விமர்சனங்கள் உள்ளிட்ட ஆராய்ச்சித் துறையில் எதிர்கொள்ளும் சவால்களை நிவர்த்தி செய்கிறது.",
      "சுருக்கம் ஆராய்ச்சியில் தெளிவு மற்றும் கடினத்தன்மையின் முக்கியத்துவத்தை வலியுறுத்துகிறது, காகித மதிப்பாய்வில் சார்புகளை முன்னிலைப்படுத்துகிறது, மேலும் மிகவும் வெளிப்படையான மற்றும் கூட்டு ஆராய்ச்சி சூழலை ஆதரிக்கிறது."
    ],
    "points": 342,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1702918118
  },
  {
    "id": 38686967,
    "title": "கார்களில் இயற்பியல் பொத்தான்களை மீண்டும் அறிமுகப்படுத்துவதன் மூலம் வோக்ஸ்வாகன் புகார்களுக்கு பதிலளிக்கிறது",
    "originLink": "https://www.thedrive.com/news/vw-is-putting-buttons-back-in-cars-because-people-complained-enough",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38686967",
    "commentBody": "",
    "originSummary": [
      "ஃபோக்ஸ்வேகன் தனது கார்களின் உட்புறங்களில் இயற்பியல் பொத்தான்களை மீண்டும் அறிமுகப்படுத்துவதன் மூலம் ஏமாற்றமளிக்கும் தொடுதிரை கட்டுப்பாடுகள் குறித்த வாடிக்கையாளர் மற்றும் விமர்சகர்களின் புகார்களுக்கு பதிலளிக்கிறது.",
      "இந்த முடிவு பின்னூட்டங்களை அடிப்படையாகக் கொண்டது மற்றும் தற்போதைய டச் ஸ்லைடர்களின் செயலற்ற மற்றும் செயல்படாத தன்மையை நிவர்த்தி செய்வதை நோக்கமாகக் கொண்டுள்ளது.",
      "எச்.வி.ஏ.சி மற்றும் சாளர செயல்பாடுகளுக்கான இயற்பியல் கட்டுப்பாடுகளைச் சேர்ப்பது ஒட்டுமொத்த பயனர் அனுபவத்தை மேம்படுத்தும் என்று எதிர்பார்க்கப்படுகிறது, அதே நேரத்தில் தொடுதிரைகள் இன்னும் இருக்கும்."
    ],
    "commentSummary": [
      "இந்த விவாதம் கார்கள் மற்றும் உபகரணங்களில் இயற்பியல் பொத்தான்கள் மற்றும் தொடுதிரைகளுக்கு இடையிலான தேர்வை மையமாகக் கொண்டுள்ளது, பயனர்கள் ஒவ்வொரு விருப்பத்திற்கும் விருப்பங்களை வெளிப்படுத்துகிறார்கள்.",
      "பயனர்கள் இயற்பியல் பொத்தான்கள் வழங்கும் உள்ளுணர்வு மற்றும் சீரான அனுபவத்தை பாராட்டுகிறார்கள், மற்றவர்கள் தொடுதிரைகளின் எளிமை மற்றும் நேர்த்தியான தன்மையை மதிக்கிறார்கள்.",
      "மோசமாக வடிவமைக்கப்பட்ட இடைமுகங்களிலிருந்து விரக்திகள் எழுகின்றன மற்றும் அழகியல் மற்றும் செயல்பாட்டிற்கு இடையில் ஒரு சமநிலையின் அவசியத்தை வலியுறுத்துகின்றன. மஸ்டா மற்றும் டெஸ்லா போன்ற குறிப்பிட்ட கார் மாடல்கள் குறிப்பிடப்பட்டுள்ளன, பயனர்கள் தனிப்பயனாக்கக்கூடிய மற்றும் பயனர் நட்பு இடைமுகங்களுக்கு அழைப்பு விடுக்கின்றனர். இறுதியில், நுகர்வோர் கருத்து மற்றும் விருப்பத்தேர்வுகள் ஆட்டோமொபைல் துறையில் வடிவமைப்பு முடிவுகளை இயக்க வேண்டும் என்பதில் உடன்பாடு உள்ளது."
    ],
    "points": 334,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1702927451
  },
  {
    "id": 38684102,
    "title": "ஜி.சி.சி உடன் ஒருங்கிணைக்கப்பட்ட ரஸ்ட் கம்பைலரை நோக்கிய முன்னேற்றம்",
    "originLink": "https://lwn.net/SubscriberLink/954787/41470c731eda02a4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684102",
    "commentBody": "",
    "originSummary": [
      "ரஸ்ட் பதிப்பு 1.49 ஐ குறிவைத்து ஜி.சி.சி 14 வெளியீட்டில் சேர்க்க ஒரு ரஸ்ட் கம்பைலரை உருவாக்க ஜி.சி.சி.ஆர் திட்டம் செயல்படுகிறது.",
      "இந்த திட்டம் தற்போது கோர் மற்றும் அலோக் கிரேட்டுகளின் தொகுப்பை ஆதரிப்பதில் கவனம் செலுத்துகிறது, ஆனால் மேக்ரோ தெளிவுத்திறன் மற்றும் அலங்கார மேக்ரோக்களுடன் சவால்களை எதிர்கொள்கிறது.",
      "இந்த திட்டம் ரஸ்ட் குறியீட்டை ஜி.சி.சி பயன்படுத்தி தொகுக்க உதவுவதை நோக்கமாகக் கொண்டுள்ளது, இது ரஸ்ட் வளர்ச்சிக்கு பங்களிக்கிறது மற்றும் உட்பொதிக்கப்பட்ட அமைப்புகளை ஆதரிக்கிறது. மற்றொரு மேம்பட்ட திட்டமான rustc_codegen_gcc, ஏற்கனவே ரஸ்ட் திட்டுக்கள் இல்லாமல் லினக்ஸுக்கு தொகுக்க அனுமதிக்கிறது, மேலும் விவாதத்தில் ரஸ்ட் கம்பைலரில் பொலோனியஸை ஒருங்கிணைப்பது மற்றும் பிழை வெளிப்பாடு மற்றும் பூட்ஸ்டிராப்பிங் போன்ற ஜி.சி.சி அடிப்படையிலான ரஸ்ட் கம்பைலரை செயல்படுத்துவதன் நன்மைகள் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "ஜி.சி.சி அடிப்படையிலான ரஸ்ட் கம்பைலரான ஜி.சி.சி.ஆர்ஸின் வளர்ச்சி தொழில்நுட்ப சமூகத்தில் விவாதிக்கப்படுகிறது.",
      "பல ரஸ்ட் செயல்படுத்தல்களைக் கொண்டிருப்பது குறித்து ஒரு விவாதம் உள்ளது, சிலர் இது பிழைகளைக் கண்டறியவும் மொழியை மேம்படுத்தவும் உதவும் என்று வாதிடுகின்றனர், மற்றவர்கள் பொருந்தக்கூடிய தன்மை மற்றும் நகல் பற்றி கவலைப்படுகிறார்கள்.",
      "கம்பைலர்கள் மொழி தரநிலைகளைப் பராமரிப்பதில் சவால்களை எதிர்கொள்கின்றனர், மேலும் பல தொகுப்பாளர்களைப் பயன்படுத்துவது குறியீடு தரத்தை மேம்படுத்தவும் பிழைகளைக் கண்டறியவும் உதவும். இந்த உரையாடல் ரஸ்டிற்கான முறையான விவரக்குறிப்பின் தேவையையும் தரப்படுத்தலின் சாத்தியமான நன்மைகள் மற்றும் குறைபாடுகளையும் ஆராய்கிறது."
    ],
    "points": 319,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1702914666
  },
  {
    "id": 38688453,
    "title": "ஐ லவ் ரூபி: நிரலாக்கத்தில் மகிழ்ச்சியையும் சமூகத்தையும் தழுவுதல்",
    "originLink": "https://eliseshaffer.com/2023/12/18/i-love-ruby/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38688453",
    "commentBody": "",
    "originSummary": [
      "ரூபி நிரலாக்க மொழி மீதான அவர்களின் அன்பை ஆசிரியர் எடுத்துக்காட்டுகிறார் மற்றும் சமீபத்திய காலங்களில் அது பெற்ற விமர்சனங்களை நிவர்த்தி செய்கிறார்.",
      "புரோகிராமர் மகிழ்ச்சியையும் அதன் வெளிப்பாட்டையும் ஊக்குவிப்பதில் ரூபியின் முக்கியத்துவத்தை அவை வலியுறுத்துகின்றன.",
      "ரூபி அவர்களுக்கு எவ்வாறு தனிப்பட்டதாக உணர்கிறார் என்பதையும், ரூபி சமூகத்திற்குள் சமூகத்தின் வலுவான உணர்வையும் ஆசிரியர் பேசுகிறார்."
    ],
    "commentSummary": [
      "பங்கேற்பாளர்கள் ரூபி நிரலாக்க மொழியின் பல்வேறு அம்சங்களைப் பற்றி விவாதிக்கிறார்கள், இதில் அதன் வெளிப்பாடு, வாசிப்புத்திறன் மற்றும் சிக்கலான தன்மை ஆகியவை அடங்கும்.",
      "இந்த உரையாடல் ரயில்ஸ் கட்டமைப்பில் மெட்டாபிரோகிராமிங் மற்றும் சுருக்கத்தின் பயன்பாட்டை ஆராய்கிறது மற்றும் ரூபியை பைத்தான் மற்றும் ஜாவா போன்ற பிற மொழிகளுடன் ஒப்பிடுகிறது.",
      "அளவிடக்கூடிய சிக்கல்கள் மற்றும் தட்டச்சு செய்யும் திறன்கள், அத்துடன் டெவலப்பர் அனுபவத்தின் முக்கியத்துவம், மொழி புகழ் மற்றும் டொமைன்-குறிப்பிட்ட மொழிகளின் (டி.எஸ்.எல்) பயன்பாடு உள்ளிட்ட ரூபியின் நன்மைகள் மற்றும் குறைபாடுகள் ஆராயப்படுகின்றன.",
      "ரூபி குறியீட்டில் கருத்துகள் தேவையா என்பது குறித்து மாறுபட்ட கருத்துக்கள் உள்ளன, சிலர் சூழல் மற்றும் விளக்கத்தை வழங்குவதில் அவற்றின் முக்கியத்துவத்திற்காக வாதிடுகின்றனர், மற்றவர்கள் குறியீடு தெளிவாக இருக்கும்போது அவை தேவையற்றவை என்று நம்புகிறார்கள்.",
      "அர்த்தமுள்ள உள்ளடக்கம் இல்லை."
    ],
    "points": 299,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1702934332
  },
  {
    "id": 38681437,
    "title": "சிக்கன வலை: மலிவு மற்றும் நிலையான வடிவமைப்பைத் தழுவுதல்",
    "originLink": "https://potato.cheap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681437",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை \"மலிவான\" வலையின் கருத்தை முன்னிலைப்படுத்துகிறது, மலிவு மற்றும் நிலையான வலை வடிவமைப்பை ஊக்குவிக்கிறது.",
      "இது HTML / CSS இல் படைப்பாளிகள் மற்றும் நேர்மையான கட்டிடக்கலையை ஆதரிப்பதன் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "தனிப்பட்ட தளங்கள், தரமான உள்ளடக்கத்தைக் கண்டுபிடிப்பதில் சிரமம், ஸ்பேம், ஜாவாஸ்கிரிப்ட், படங்கள், அணுகல், பணம் செலுத்துதல் மற்றும் மையப்படுத்தப்பட்ட தளங்கள் உள்ளிட்ட வலை எதிர்கொள்ளும் பல்வேறு சவால்களை இந்த கட்டுரை நிவர்த்தி செய்கிறது. இது பராமரிக்க, அணுக, பங்கேற்க, ஆராய மற்றும் பங்களிக்க மலிவான வலையை ஆதரிக்கிறது."
    ],
    "commentSummary": [
      "புத்தக தோற்றத்தின் மீதான பயனர் கட்டுப்பாடு, வலை உலாவல் சிக்கல், ஆன்லைனில் மருத்துவ பதிவுகளை அணுகுதல், வலை மேம்பாட்டு ஏமாற்றங்கள் மற்றும் பிரபலமான சமூக ஊடக தளங்களுக்கான மாற்றுகள் உள்ளிட்ட வலை மற்றும் இணைய பயன்பாடு தொடர்பான பல்வேறு தலைப்புகளை விவாதங்கள் உள்ளடக்குகின்றன.",
      "பயனர்கள் இந்த தலைப்புகளில் தங்கள் கருத்துக்களையும் பரிந்துரைகளையும் பகிர்ந்து கொள்கிறார்கள், பலவிதமான கண்ணோட்டங்களை உருவாக்குகிறார்கள்.",
      "தற்போதைய வலை முன்னுதாரணத்தின் சவால்கள் மற்றும் வரம்புகளை முன்னிலைப்படுத்தும் ஒரு எளிய மற்றும் அதிக பயனர் நட்பு வலை தரத்தின் தேவை உள்ளது."
    ],
    "points": 288,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702901167
  },
  {
    "id": 38687997,
    "title": "HTML செய்ய வேண்டிய பட்டியல் பயன்பாட்டை உருவாக்க போஸ்ட்ஜிரெஸ்ட் மற்றும் htmx ஐப் பயன்படுத்துதல்",
    "originLink": "https://postgrest.org/en/stable/how-tos/providing-html-content-using-htmx.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38687997",
    "commentBody": "",
    "originSummary": [
      "போஸ்ட்கிரெஸ்ட் மற்றும் எச்.டி.எம்.எல் உள்ளடக்கத்துடன் எச்.டி.எம்.எக்ஸ் நூலகத்தைப் பயன்படுத்தி செய்ய வேண்டிய பட்டியல் பயன்பாட்டை எவ்வாறு உருவாக்குவது என்பதை இந்த டுடோரியல் விளக்குகிறது.",
      "பயன்பாட்டை உள்ளமைக்கவும், எச்.டி.எம்.எல் பதில்களை உருவாக்கவும், பட்டியலிடுதல், உருவாக்குதல், திருத்துதல் மற்றும் நீக்குதல் போன்ற செயல்களைச் செய்வதற்கான படிப்படியான வழிமுறைகளை இது வழங்குகிறது.",
      "இந்த டுடோரியல் தரவுத்தளத்தில் செய்ய வேண்டியவற்றை மாற்றுவதற்கும் நீக்குவதற்கும் செயல்பாடுகள் மற்றும் இறுதி புள்ளிகளையும் உள்ளடக்கியது."
    ],
    "commentSummary": [
      "Htmx ஐப் பயன்படுத்தி HTML உள்ளடக்கத்தை உருவாக்குவதற்கான போஸ்ட்க்ரெஸ்ட் கட்டமைப்பைப் பற்றி பயனர்கள் தங்கள் கருத்தில் பிளவுபட்டுள்ளனர், சிலர் அதை மட்டுப்படுத்தப்பட்டதாகவும் ஆதரவு இல்லாததாகவும் கருதுகின்றனர், மற்றவர்கள் அதை சுபாபேஸ் தளத்தின் ஒரு முக்கிய அங்கமாகக் கருதுகின்றனர்.",
      "ஆஸ்டர் மற்றும் எச்.டி.எம்.எக்ஸ் போன்ற மாற்று தொழில்நுட்பங்களுடன் வலை மேம்பாட்டு அடுக்குகளை எளிமைப்படுத்துதல் மற்றும் திறந்த மூல தரவுத்தளங்கள் மற்றும் சேவையகமற்ற லாம்ப்டாக்களைப் பயன்படுத்துவதில் உள்ள சவால்களை இந்த விவாதம் ஆராய்கிறது.",
      "வலை மேம்பாடு, உள்ளீட்டு சரிபார்ப்பு, பாதுகாப்பு வழிமுறைகள் மற்றும் எச்.டி.எம்.எல் வார்ப்புருவுக்கு SQL செயல்பாடுகள் மற்றும் நூலகங்களைப் பயன்படுத்துதல் ஆகியவற்றிற்கு போஸ்ட்க்ரெஸ்ட்டைப் பயன்படுத்துவதைச் சுற்றி விவாதம் சுழல்கிறது. சொத்துக்களுக்கு சேவை செய்ய போஸ்ட்கிர்ஸைப் பயன்படுத்துவது மற்றும் பொருள் சேமிப்பின் நன்மைகள் குறித்தும் விவாதிக்கப்படுகிறது."
    ],
    "points": 275,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1702932456
  },
  {
    "id": 38687809,
    "title": "கால்குலஸ் கருத்துகளுக்கான காட்சி அறிமுகங்கள்: வழித்தோன்றல்கள், ஒருங்கிணைந்தவை மற்றும் பல",
    "originLink": "https://www.3blue1brown.com/topics/calculus",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38687809",
    "commentBody": "",
    "originSummary": [
      "இந்த தொகுப்பு கால்குலஸில் உள்ள முக்கிய கருத்துகளுக்கு காட்சி அறிமுகங்களை வழங்குகிறது, இது வடிவியல் மற்றும் உள்ளுணர்வு கண்ணோட்டங்கள் மூலம் அவற்றை மிகவும் அணுகக்கூடியதாகவும் உள்ளுணர்வு கொண்டதாகவும் ஆக்குகிறது.",
      "டெரிவேட்டிவ்கள், ஒருங்கிணைந்தவை, வரம்புகள், சங்கிலி விதி, அதிவேக செயல்பாடுகள், மறைமுக வேறுபாடு, எல்'ஹோபிட்டலின் விதி மற்றும் பலவற்றை உள்ளடக்கிய தலைப்புகள் அடங்கும்.",
      "இந்த தொகுப்பு வழித்தோன்றல்கள் மற்றும் ஒருங்கிணைப்பு, உயர் வரிசை வழித்தோன்றல்கள், டெய்லர் தொடர் மற்றும் வழித்தோன்றல்களைக் காட்சிப்படுத்துவதற்கான மாற்று வழிகள் ஆகியவற்றுக்கு இடையிலான தலைகீழ் உறவுகளையும் ஆராய்கிறது."
    ],
    "commentSummary": [
      "இந்த இடுகை பிரபலமான மற்றும் மிகவும் பாராட்டப்பட்ட 3ப்ளூ 1பிரவுன் சேனலுக்கு முக்கியத்துவம் அளித்து பல்வேறு யூடியூப் கணித சேனல்களை ஆராய்கிறது.",
      "இது 3Blue1Brown இன் விளக்கங்கள் மற்றும் கற்பித்தல் முறைகளின் செயல்திறன் மற்றும் பாராட்டுதல் பற்றி விவாதிக்கிறது.",
      "பிற கணித சேனல்கள் மற்றும் வளங்கள் பரிந்துரைக்கப்படுகின்றன, மேலும் கோலே குறியீடுகள் மற்றும் கணித பொருட்களுடன் அவற்றின் தொடர்பு பற்றிய குறிப்பு உள்ளது.",
      "இந்த இடுகை கணிதத்தில் உள்ளுணர்வு மற்றும் புரிதலின் முக்கியத்துவத்தை வலியுறுத்துகிறது மற்றும் கோவிட் -19 ஊரடங்கு நடவடிக்கைகளின் தாக்கத்தையும் குறிப்பிடுகிறது."
    ],
    "points": 268,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1702931658
  },
  {
    "id": 38685393,
    "title": "Fly.io பறக்கும் குபேர்நெட்டுகளை அறிமுகப்படுத்துகிறது: குபேர்நெட்ஸ் ஆர்கெஸ்ட்ரேஷனுக்கு ஒரு புதிய அணுகுமுறை",
    "originLink": "https://fly.io/blog/fks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38685393",
    "commentBody": "",
    "originSummary": [
      "கிளவுட் உள்கட்டமைப்பு வழங்குநரான Fly.io, குபர்நெட்ஸ் (கே 8 எஸ்) ஆதரிக்கும் ஃப்ளை குபர்நெட்ஸ் (எஃப்.கே.எஸ்) என்ற புதிய சலுகையை அறிமுகப்படுத்தியுள்ளது.",
      "எஃப்.கே.எஸ் என்பது ஃப்ளை.ஐ.ஓவின் தளத்தின் மேல் இயங்கும் குபர்நெட்ஸின் செயல்படுத்தலாகும்.",
      "உலகளாவிய ஒழுங்கமைப்பிற்கான ஃப்ளை.ஐ.ஓவின் தனித்துவமான அணுகுமுறை உலகளாவிய ஒருமித்த கருத்துக்கு பதிலாக சந்தை அடிப்படையிலான முறையைப் பயன்படுத்துவதை உள்ளடக்குகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் குபேர்நெட்டுகள் தொடர்பான பல்வேறு தலைப்புகளை உள்ளடக்கியது, இதில் பல்வேறு விருப்பங்கள், நன்மைகள் மற்றும் குறைபாடுகள் ஆகியவை அடங்கும்.",
      "பயனர்கள் ஜி.கே.இ ஆட்டோபைலட் மற்றும் ஃப்ளை குபர்நெட்ஸின் அம்சங்கள் மற்றும் விலையைப் பற்றி விவாதிக்கின்றனர்.",
      "கிளவுட் சூழலில் ஃப்ளை குபெர்நெட்டுகள் பற்றிய செயல்படுத்தல், செயல்பாடு, சவால்கள் மற்றும் பின்னூட்டங்களும் விவாதங்களில் அடங்கும்.",
      "மெய்நிகர்-குபெலெட், சைட்கார்கள் மற்றும் வெவ்வேறு சூழல்களில் குபெர்நெட்டுகளின் பயன்பாடு போன்ற தலைப்புகள் ஆராயப்படுகின்றன.",
      "தரவு இழப்பு, ஸ்திரத்தன்மை, அளவிடுதல் மற்றும் பிற அமைப்புகளுடன் பொருந்தக்கூடிய தன்மை குறித்து பயனர்கள் கவலைகளை வெளிப்படுத்துகிறார்கள்.",
      "சில பயனர்கள் குபெர்நெட்களின் எளிமையையும் நம்பகத்தன்மையையும் பாராட்டுகிறார்கள், மற்றவர்கள் மாற்று தீர்வுகளைக் கருதுகின்றனர்.",
      "தெளிவான தகவல்தொடர்பு, தரப்படுத்தல் மற்றும் ஒருங்கிணைந்த தீர்வு ஆகியவற்றின் தேவை குறிப்பிடப்பட்டுள்ளது."
    ],
    "points": 256,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1702920094
  },
  {
    "id": 38681463,
    "title": "2024 ஆம் ஆண்டிற்கான லட்சிய இலக்குகளை நிர்ணயித்த செர்வோ திட்டம் 1000 புல் கோரிக்கைகளை தாண்டியது",
    "originLink": "https://servo.org/blog/2023/12/18/this-year-in-servo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681463",
    "commentBody": "",
    "originSummary": [
      "முந்தைய ஆண்டுடன் ஒப்பிடும்போது பங்களிப்பாளர்கள், இழுக்கும் கோரிக்கைகள் மற்றும் அர்ப்பணிப்புகளில் அதிகரிப்புடன், 2023 ஆம் ஆண்டில் செர்வோ திட்டம் குறிப்பிடத்தக்க முன்னேற்றத்தைக் கண்டுள்ளது.",
      "இந்த திட்டம் பல மாநாடுகளில் இடம்பெற்றுள்ளது மற்றும் பல்வேறு அம்சங்களுக்கான மேம்பட்ட ஆதரவு உட்பட அதன் தளவமைப்பு இயந்திரத்தில் முன்னேற்றங்களைச் செய்துள்ளது.",
      "வலை தள சோதனைகளில் தேர்ச்சி விகிதங்களும் முன்னேற்றத்தைக் காட்டியுள்ளன.",
      "இந்த திட்டத்திற்கான எதிர்கால திட்டங்களில் செர்வோவைப் பராமரித்தல், ஆண்ட்ராய்டில் இரவுநேரங்களை வெளியிடுதல் மற்றும் அட்டவணைகளை செயல்படுத்துதல் மற்றும் மிதவைகள் மற்றும் லத்தீன் அல்லாத உரைக்கான சிறந்த ஆதரவு ஆகியவை அடங்கும்.",
      "திட்டத்தின் வளர்ச்சிக்கு ஆதரவளிக்க சாத்தியமான ஸ்பான்சர்கள் அழைக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "செர்வோ திட்டம் என்பது உலாவி இயந்திர பன்முகத்தன்மையை மேம்படுத்த மொஸில்லாவால் உருவாக்கப்பட்ட ஒரு உலாவி இயந்திரமாகும், ஆனால் மேலும் வளர்ச்சி மொஸில்லாவால் கைவிடப்பட்டுள்ளது.",
      "பயனர்கள் மொஸில்லா மீதான அதிருப்தியைப் பற்றி விவாதிக்கிறார்கள் மற்றும் சந்தையில் கூகிளின் ஆதிக்கத்தை சவால் செய்ய மாற்று உலாவி விருப்பங்களை முன்மொழிகிறார்கள்.",
      "விவாதம் செர்வோவின் திறன்கள், உட்பொதிக்கும் திறன் மற்றும் பி.டபிள்யூ.ஏ, எலக்ட்ரான், டௌரி மற்றும் நியூட்ரலினோ.js போன்ற பிற உலாவி விருப்பங்களுடன் ஒப்பீடுகளை உள்ளடக்கியது."
    ],
    "points": 253,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1702901388
  },
  {
    "id": 38684309,
    "title": "பேஸ்புக்கின் செயற்கை நுண்ணறிவு உருவாக்கிய திருட்டு படங்களின் வெள்ளம் கவலையைத் தூண்டுகிறது",
    "originLink": "https://www.404media.co/facebook-is-being-overrun-with-stolen-ai-generated-images-that-people-think-are-real/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684309",
    "commentBody": "",
    "originSummary": [
      "திருடப்பட்ட படங்கள் உட்பட பேஸ்புக்கில் செயற்கை நுண்ணறிவு உருவாக்கிய உள்ளடக்கம், செயற்கை நுண்ணறிவு உருவாக்கப்பட்டவை என்று அடையாளம் காண சரியான நடவடிக்கைகள் இல்லாமல், உண்மையானவை என்று பதிவிடப்படுகின்றன.",
      "பிரபலமான மற்றும் ஈர்க்கக்கூடிய செயற்கை நுண்ணறிவு உருவாக்கிய இடுகைகள் கருத்து பிரிவுகளில் ஸ்பேம் இணைப்புகளைப் பெறுகின்றன.",
      "பேஸ்புக்கின் போதுமான பதில் மற்றும் நடவடிக்கைகள் இல்லாதது பயனர்கள் செயற்கை நுண்ணறிவு உருவாக்கிய உள்ளடக்கத்தின் வருகைக்கு தயாராக இல்லை, இது உணர்திறன் இல்லாத படங்கள் மற்றும் தவறான தகவல்கள் குறித்த கவலைகளை எழுப்புகிறது."
    ],
    "commentSummary": [
      "பேஸ்புக் போன்ற தளங்களில் செயற்கை நுண்ணறிவு உருவாக்கிய படங்கள், மோசடிகள் மற்றும் டீப்ஃபேக் வீடியோக்களின் பரவல் ஒரு குறிப்பிடத்தக்க கவலையாகும்.",
      "இந்த பிரச்சினைகளுக்கு தீர்வு காண்பதற்கு யார் பொறுப்பேற்க வேண்டும் மற்றும் போட்டியின் மீது ஒழுங்குமுறையின் சாத்தியமான தாக்கம் குறித்து ஒரு விவாதம் உள்ளது.",
      "விவாதங்கள் உள்ளடக்க சந்தையின் நிலைத்தன்மை, விளம்பரங்களின் பங்கு மற்றும் உள்ளடக்கத்திற்கு பணம் செலுத்த பயனர்களின் விருப்பம் ஆகியவற்றில் கவனம் செலுத்துகின்றன."
    ],
    "points": 239,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1702915513
  },
  {
    "id": 38682631,
    "title": "அமெரிக்காவில் ஆப்பிள் வாட்ச் சீரிஸ் 9 மற்றும் அல்ட்ரா 2 விற்பனையை நிறுத்தியது ஆப்பிள்",
    "originLink": "https://9to5mac.com/2023/12/18/apple-halting-apple-watch-series-9-and-apple-watch-ultra-2-sales/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38682631",
    "commentBody": "",
    "originSummary": [
      "ஆப்பிள் நிறுவனம் ஆப்பிள் வாட்ச் சீரிஸ் 9 மற்றும் ஆப்பிள் வாட்ச் அல்ட்ரா 2 ஆகியவற்றின் விற்பனையை அமெரிக்காவில் நிறுத்துகிறது.",
      "இந்த நிறுத்தத்திற்கான காரணம் கட்டுரையில் குறிப்பிடப்படவில்லை.",
      "ஆப்பிள் வாட்ச்சின் புதிய பதிப்பை எதிர்காலத்தில் வெளியிட ஆப்பிள் திட்டமிட்டுள்ளதா என்பது தெளிவாகத் தெரியவில்லை."
    ],
    "commentSummary": [
      "ஆப்பிள் வாட்ச்சில் பயோமெட்ரிக் கண்காணிப்பு தொழில்நுட்பம் தொடர்பான காப்புரிமைகளை மீறியதாக மாசிமோ நிறுவனம் ஆப்பிள் மீது வழக்கு தொடர்ந்துள்ளது.",
      "ஆப்பிள் நிறுவனம் மாசிமோ ஊழியர்களை வேலைக்கு அமர்த்தியதாகவும், கூட்டாண்மையை உருவாக்காமல் அவர்களின் தொழில்நுட்பத்தைப் பெற்றதாகவும் அந்த வழக்கு கூறுகிறது.",
      "காப்புரிமைகளின் செல்லுபடியாகும் தன்மை மற்றும் காப்புரிமை அமைப்பு பற்றிய கவலைகள், அத்துடன் ஆப்பிளின் காப்புரிமைகளின் ஆக்கிரமிப்பு பயன்பாடு மற்றும் பிற நிறுவனங்களுடன் சட்டப் போராட்டங்கள் குறித்த விவாதங்கள் உள்ளன."
    ],
    "points": 229,
    "commentCount": 356,
    "retryCount": 0,
    "time": 1702908192
  }
]
