[
  {
    "id": 38681861,
    "title": "تتخلى Figma وAdobe عن الاندماج بعد المراجعة التنظيمية",
    "originLink": "https://www.figma.com/blog/figma-adobe-abandon-proposed-merger/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681861",
    "commentBody": "",
    "originSummary": [
      "ألغت Figma و Adobe اندماجهما المخطط له بعد عملية مراجعة تنظيمية طويلة.",
      "ستحافظ Figma على وضعها المستقل وهي منفتحة على استكشاف فرص الشراكة مع Adobe.",
      "حققت Figma خطوات كبيرة في الأشهر ال 15 الماضية ، مع تركيز قوي على تبسيط تصميم وتطوير المنتجات الرقمية. أعرب الرئيس التنفيذي ديلان فيلد عن تفاؤله بمستقبل الشركة وامتنانه لدعم المجتمع."
    ],
    "commentSummary": [
      "تم إلغاء الاندماج المحتمل بين Figma و Adobe ، مما أدى إلى مناقشات حول الأسباب الكامنة وراءه وتأثيره على موظفي Figma.",
      "يتم استكشاف مزايا وقيود أدوات التصميم مثل Figma في المحادثة ، بالإضافة إلى الاضطراب المحتمل الذكاء الاصطناعي في صناعة التصميم.",
      "كما تتطرق المناقشة إلى المخاوف المتعلقة بالدمج والاكتتابات العامة الأولية في ثقافة الشركات الناشئة، والرقابة التنظيمية، والاستدامة طويلة الأجل، ودور قانون مكافحة الاحتكار في الأسواق الرقمية."
    ],
    "points": 1934,
    "commentCount": 877,
    "retryCount": 0,
    "time": 1702904674
  },
  {
    "id": 38681672,
    "title": "Wasm3 يدخل مرحلة الصيانة وسط الغزو الروسي",
    "originLink": "https://github.com/wasm3/wasm3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681672",
    "commentBody": "",
    "originSummary": [
      "تم إيقاف تطوير ميزات جديدة ل Wasm3 ، مترجم WebAssembly ، مؤقتا حيث تم تدمير منزل المطور من قبل الروس الذين غزوا بلادهم.",
      "سيستمر المطور في الحفاظ على المشروع ومراجعة ودمج طلبات السحب.",
      "Wasm3 هو مترجم متعدد الاستخدامات يمكن استخدامه على منصات وبنى مختلفة ويجتاز مجموعة اختبار مواصفات WebAssembly. يوفر مزايا من حيث قابلية النقل والأمان والحجم القابل للتنفيذ واستخدام الذاكرة وزمن انتقال بدء التشغيل. كما أن لديها تطبيقات محتملة في تشغيل WebAssembly على الأجهزة المضمنة. تم إصدار المشروع بموجب ترخيص معهد ماساتشوستس للتكنولوجيا."
    ],
    "commentSummary": [
      "تتعمق المحادثة في مواضيع مختلفة تتعلق بالصراع الروسي الأوكراني ، مثل التاريخ الأوكراني ، والقومية ، والدعاية ، واستخراج الموارد ، والعقوبات الاقتصادية ، والأسلحة النووية.",
      "ويتضمن مناقشات حول ما إذا كان ينبغي دعم أوكرانيا، ودراسة نوايا روسيا، ومناقشة فعالية لغات البرمجة المختلفة.",
      "تتناول المحادثة أيضا تقنيات التخفيف من تسرب الموارد في التعليمات البرمجية وتعرض مجموعة واسعة من الآراء والمخاوف المتعلقة بالصراع المستمر وعواقبه."
    ],
    "points": 512,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1702903418
  },
  {
    "id": 38681450,
    "title": "\"لقد اشتريت للتو سيارة تشيفي تاهو 2024 مقابل 1 دولار\" - شراء سيارة مفاجئ لمستخدم Twitter",
    "originLink": "https://twitter.com/ChrisJBakke/status/1736533308849443121",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681450",
    "commentBody": "",
    "originSummary": [
      "يزعم مستخدم Twitter كريس باك أنه حصل على سيارة تشيفي تاهو 2024 مقابل 1 دولار فقط.",
      "تشير المطالبة إلى أن Bakke ربما تكون قد حصلت على السيارة من خلال وسيلة غير تقليدية للغاية أو يحتمل أن تكون خاطئة.",
      "لا يزال من غير الواضح ما إذا كان الادعاء مشروعا أم أنه مجرد تلفيق على وسائل التواصل الاجتماعي."
    ],
    "commentSummary": [
      "تدور المناقشة حول قضايا وقيود روبوتات المحادثة في خدمة العملاء ، بما في ذلك المخاوف القانونية ومسؤوليات الشركة والمخاوف بشأن التلاعب وخيانة الأمانة.",
      "تختلف وجهات النظر حول فعالية chatbot عند مقارنتها بالممثلين البشريين ، حيث يشارك بعض المشاركين تجارب سلبية مع دعم العملاء.",
      "كما تتم مناقشة موضوعات مثل اختلاف اللغة ، والأتمتة في خدمة العملاء ، واستخدام نماذج اللغة الذكاء الاصطناعي ، ويتم اقتراح حلول بديلة."
    ],
    "points": 403,
    "commentCount": 327,
    "retryCount": 0,
    "time": 1702901331
  },
  {
    "id": 38691025,
    "title": "ماك بوك المؤلف مقفلة ، تيم كوك يفتحها",
    "originLink": "https://www.tokyodev.com/articles/unbricking-my-macbook-took-an-email-to-tim-cook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38691025",
    "commentBody": "",
    "originSummary": [
      "تم إرجاع جهاز MacBook الخاص بالمؤلف إليهم بقفل تنشيط ، مما يمنع الوصول إلى الجهاز.",
      "رفضت Apple في البداية إلغاء قفل جهاز MacBook ، لكن المؤلف تواصل مع Tim Cook عبر البريد الإلكتروني وقام في النهاية بإلغاء قفله.",
      "تم مسح جهاز MacBook والإبلاغ عن فقده بواسطة حساب iCloud تم إنشاؤه حديثا ، مما يشير إلى أنه ربما تم نقله إلى متجر وإعادة تعيينه والإبلاغ عن فقدانه لابتزاز الأموال.",
      "يسلط المؤلف الضوء على حاجة Apple إلى مراجعة سير عمل الإعداد الخاص بها لتوصيل عواقب عدم إعداد FindMy بشكل أفضل ، حيث يمكن للمتاجر عديمي الضمير استغلال هذا الموقف.",
      "أبلغ المؤلف عن هذه المشكلة إلى Apple Security Research ولكن تم رفضها."
    ],
    "commentSummary": [
      "تدور المناقشات حول أمان الجهاز والملكية ودعم العملاء ، مع التركيز على منتجات Apple.",
      "يعبر المستخدمون عن إحباطهم من سيطرة Apple على أجهزتهم ، بينما يقدر البعض ميزات مكافحة السرقة.",
      "وتقترح اقتراحات لتعزيز التدابير الأمنية وإيجاد توازن بين منع السرقة ومتطلبات المستعملين."
    ],
    "points": 361,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1702952361
  },
  {
    "id": 38684925,
    "title": "نماذج Word2Vec الجديدة تتفوق على الأساليب السابقة",
    "originLink": "https://openreview.net/forum?id=idpCdOWtqXd60",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684925",
    "commentBody": "",
    "originSummary": [
      "تقدم هذه الورقة معماريتين نموذجيتين جديدتين لتوليد تمثيلات الكلمات في الفضاء المتجه ، باستخدام مجموعات البيانات الكبيرة.",
      "يعرض المؤلفون تحسينات جديرة بالملاحظة في الدقة مع تقليل متطلبات الموارد الحسابية.",
      "حققت تمثيلات المتجهات أداء متطورا في قياس أوجه التشابه بين الكلمات ، مما يدل على فعاليتها.",
      "يعتزم المؤلفون إتاحة مجموعة اختباراتهم للباحثين الآخرين لمزيد من الاستكشاف."
    ],
    "commentSummary": [
      "يستكشف الملخص الجوانب المختلفة المتعلقة ب Word2Vec والمؤتمرات الأكاديمية ومراجعة الأقران والمقابلات الموحدة في سياق البحث العلمي.",
      "ويتناول التحديات التي تواجه مجال البحث، بما في ذلك القيود المفروضة على أنظمة النشر والانتقادات الموجهة إلى مجال الذكاء الاصطناعي.",
      "يؤكد الملخص على أهمية الوضوح والصرامة في البحث ، ويسلط الضوء على التحيزات في مراجعة الأوراق ، ويدعو إلى بيئة بحثية أكثر انفتاحا وتعاونا."
    ],
    "points": 342,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1702918118
  },
  {
    "id": 38686967,
    "title": "فولكس فاجن تستجيب للشكاوى بإعادة إدخال الأزرار المادية في السيارات",
    "originLink": "https://www.thedrive.com/news/vw-is-putting-buttons-back-in-cars-because-people-complained-enough",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38686967",
    "commentBody": "",
    "originSummary": [
      "تستجيب فولكس فاجن لشكاوى العملاء والنقاد حول أدوات التحكم المحبطة في الشاشة التي تعمل باللمس من خلال إعادة إدخال الأزرار المادية في التصميمات الداخلية لسياراتها.",
      "يعتمد القرار على التعليقات ويهدف إلى معالجة الطبيعة الصعبة وغير الوظيفية لمنزلقات اللمس الحالية.",
      "من المتوقع أن تؤدي إضافة عناصر التحكم المادية لوظائف التدفئة والتهوية وتكييف الهواء والنوافذ إلى تعزيز تجربة المستخدم بشكل عام ، بينما ستظل شاشات اللمس موجودة."
    ],
    "commentSummary": [
      "يتمحور النقاش حول الاختيار بين الأزرار المادية وشاشات اللمس في السيارات والأجهزة ، حيث يعبر المستخدمون عن تفضيلاتهم لكل خيار.",
      "يقدر المستخدمون التجربة البديهية والمتسقة التي توفرها الأزرار المادية ، بينما يقدر الآخرون بساطة ونعومة شاشات اللمس.",
      "تنشأ الإحباطات من واجهات سيئة التصميم وتؤكد على الحاجة إلى التوازن بين الجماليات والوظائف. تم ذكر طرازات سيارات معينة مثل Mazda و Tesla ، حيث يدعو المستخدمون إلى واجهات قابلة للتخصيص وسهلة الاستخدام. في نهاية المطاف ، هناك اتفاق على أن ملاحظات المستهلكين وتفضيلاتهم يجب أن تقود قرارات التصميم في صناعة السيارات."
    ],
    "points": 334,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1702927451
  },
  {
    "id": 38684102,
    "title": "التقدم نحو مترجم Rust متكامل مع دول مجلس التعاون الخليجي",
    "originLink": "https://lwn.net/SubscriberLink/954787/41470c731eda02a4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684102",
    "commentBody": "",
    "originSummary": [
      "يعمل مشروع GCCRRS على إنشاء مترجم Rust لتضمينه في إصدار GCC 14 ، مستهدفا الإصدار 1.49 من Rust.",
      "يركز المشروع حاليا على دعم تجميع الصناديق الأساسية والمخصصة ، ولكنه يواجه تحديات في الدقة الكلية ووحدات الماكرو للديكور.",
      "يهدف هذا المشروع إلى تمكين تجميع كود Rust باستخدام GCC ، مما يساهم في تطوير Rust ويدعم الأنظمة المدمجة. مشروع متقدم آخر ، rustc_codegen_gcc ، يسمح بالفعل بتجميع Rust لنظام Linux بدون تصحيحات ، وتتضمن المناقشة دمج Polonius في مترجم Rust وفوائد تنفيذ مترجم Rust في دول مجلس التعاون الخليجي مثل التعرض للأخطاء والتمهيد."
    ],
    "commentSummary": [
      "تتم مناقشة تطوير GCCRS ، وهو مترجم Rust مقره دول مجلس التعاون الخليجي ، في مجتمع التكنولوجيا.",
      "هناك جدل حول وجود تطبيقات Rust متعددة ، حيث يجادل البعض بأنه يمكن أن يساعد في الكشف عن الأخطاء وتحسين اللغة ، بينما يشعر البعض الآخر بالقلق إزاء التوافق والازدواجية.",
      "يواجه المترجمون تحديات في مواكبة معايير اللغة ، ويمكن أن يساعد استخدام برامج تحويل مسار متعددة في تحسين جودة التعليمات البرمجية واكتشاف الأخطاء. تستكشف المحادثة أيضا الحاجة إلى مواصفات رسمية ل Rust والفوائد والعيوب المحتملة للتوحيد القياسي."
    ],
    "points": 319,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1702914666
  },
  {
    "id": 38688453,
    "title": "أنا أحب روبي: احتضان الفرح والمجتمع في البرمجة",
    "originLink": "https://eliseshaffer.com/2023/12/18/i-love-ruby/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38688453",
    "commentBody": "",
    "originSummary": [
      "يسلط المؤلف الضوء على عاطفتهم للغة برمجة روبي ويتناول الانتقادات التي تلقتها في الآونة الأخيرة.",
      "يؤكدون على تركيز روبي على تعزيز سعادة المبرمج وتعبيرها.",
      "يتحدث المؤلف أيضا عن شعور روبي بالتخصيص تجاههم ويسلط الضوء على الإحساس القوي بالمجتمع داخل مجتمع روبي."
    ],
    "commentSummary": [
      "يناقش المشاركون جوانب مختلفة من لغة برمجة روبي ، بما في ذلك تعبيرها وسهولة قراءتها وتعقيدها.",
      "تستكشف المحادثة استخدام البرمجة الفوقية والتجريد في إطار عمل Rails وتقارن روبي بلغات أخرى مثل Python و Java.",
      "يتم فحص مزايا وعيوب Ruby ، بما في ذلك مشكلات قابلية التوسع وقدرات تلميح النوع ، بالإضافة إلى أهمية تجربة المطور وشعبية اللغة واستخدام اللغات الخاصة بالمجال (DSLs).",
      "هناك آراء مختلفة حول ما إذا كانت التعليقات ضرورية في كود روبي ، حيث يجادل البعض بأهميتها في توفير السياق والشرح ، بينما يعتقد البعض الآخر أنها غير ضرورية عندما تكون المدونة واضحة.",
      "لا يوجد محتوى ذي معنى."
    ],
    "points": 299,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1702934332
  },
  {
    "id": 38681437,
    "title": "The Thrifty Web: تبني تصميم مستدام وبأسعار معقولة",
    "originLink": "https://potato.cheap",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681437",
    "commentBody": "",
    "originSummary": [
      "يسلط المقال الضوء على مفهوم الويب \"الرخيص\" ، مما يعزز تصميم الويب بأسعار معقولة ومستدامة.",
      "ويؤكد على أهمية دعم المبدعين والبنية الصادقة في HTML / CSS.",
      "تتناول المقالة التحديات المختلفة التي يواجهها الويب ، بما في ذلك الأنظمة الأساسية غير الشخصية ، وصعوبة العثور على محتوى عالي الجودة ، والبريد العشوائي ، وجافا سكريبت ، والصور ، وإمكانية الوصول ، والمدفوعات ، والمنصات المركزية. إنه يدعو إلى شبكة ويب رخيصة للصيانة والوصول والمشاركة فيها واستكشافها والمساهمة فيها."
    ],
    "commentSummary": [
      "تغطي المناقشات مجموعة واسعة من الموضوعات المتعلقة باستخدام الويب والإنترنت ، بما في ذلك تحكم المستخدم في مظهر الكتاب ، وتعقيد تصفح الويب ، والوصول إلى السجلات الطبية عبر الإنترنت ، وإحباطات تطوير الويب ، وبدائل منصات التواصل الاجتماعي الشهيرة.",
      "يشارك المستخدمون آرائهم واقتراحاتهم حول هذه الموضوعات ، مما يخلق مجموعة متنوعة من وجهات النظر.",
      "هناك حاجة إلى معيار ويب أبسط وأكثر سهولة في الاستخدام ، مع تسليط الضوء على تحديات وقيود نموذج الويب الحالي."
    ],
    "points": 288,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1702901167
  },
  {
    "id": 38687997,
    "title": "استخدام PostgREST و htmx لإنشاء تطبيق HTML لقائمة المهام",
    "originLink": "https://postgrest.org/en/stable/how-tos/providing-html-content-using-htmx.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38687997",
    "commentBody": "",
    "originSummary": [
      "يوضح البرنامج التعليمي كيفية إنشاء تطبيق قائمة مهام باستخدام PostgREST ومكتبة htmx مع محتوى HTML.",
      "يوفر إرشادات خطوة بخطوة لتكوين التطبيق وإنشاء استجابات HTML وتنفيذ إجراءات مثل سرد المهام وإنشائها وتحريرها وحذفها.",
      "يغطي البرنامج التعليمي أيضا الوظائف ونقاط النهاية لتعديل وحذف المهام في قاعدة البيانات."
    ],
    "commentSummary": [
      "ينقسم المستخدمون في رأيهم حول إطار عمل PostgREST لإنشاء محتوى HTML باستخدام Htmx ، حيث يجد البعض أنه محدود ويفتقر إلى الدعم بينما يرى البعض الآخر أنه عنصر حاسم في منصة Supabase.",
      "تستكشف المناقشة تبسيط مكدسات تطوير الويب وتحديات استخدام قواعد البيانات مفتوحة المصدر و lambdas بدون خادم ، إلى جانب التقنيات البديلة مثل Astor و HTMX.",
      "يدور النقاش حول استخدام PostgREST لتطوير الويب ، والتحقق من صحة الإدخال ، وآليات الأمان ، واستخدام وظائف ومكتبات SQL لقالب HTML. كما تمت مناقشة استخدام Postgres لخدمة الأصول ومزايا تخزين الكائنات."
    ],
    "points": 275,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1702932456
  },
  {
    "id": 38687809,
    "title": "مقدمات مرئية لمفاهيم حساب التفاضل والتكامل: المشتقات والتكاملات والمزيد",
    "originLink": "https://www.3blue1brown.com/topics/calculus",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38687809",
    "commentBody": "",
    "originSummary": [
      "يقدم هذا التجميع مقدمات بصرية للمفاهيم الأساسية في حساب التفاضل والتكامل ، مما يجعلها أكثر سهولة وبديهية من خلال وجهات نظر هندسية وبديهية.",
      "تشمل الموضوعات التي يتم تناولها المشتقات والتكاملات والنهايات وقاعدة السلسلة والدوال الأسية والتمايز الضمني وقاعدة L'Hôpital والمزيد.",
      "يستكشف التجميع أيضا العلاقات العكسية بين المشتقات والتكامل ، والمشتقات ذات الترتيب الأعلى ، وسلسلة تايلور ، والطرق البديلة لتصور المشتقات."
    ],
    "commentSummary": [
      "يستكشف المنشور قنوات الرياضيات المختلفة على YouTube ، مع التركيز على قناة 3Blue1Brown الشهيرة والمشهود لها للغاية.",
      "يناقش فعالية ومدح تفسيرات 3Blue1Brown وطرق التدريس.",
      "يوصى باستخدام قنوات وموارد رياضية أخرى ، وهناك ذكر لرموز Golay وعلاقتها بالكائنات الرياضية.",
      "يؤكد المنشور أيضا على أهمية الحدس والفهم في الرياضيات ويذكر تأثير تدابير إغلاق COVID-19."
    ],
    "points": 268,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1702931658
  },
  {
    "id": 38685393,
    "title": "Fly.io تكشف النقاب عن Fly Kubernetes: نهج جديد لتنسيق Kubernetes",
    "originLink": "https://fly.io/blog/fks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38685393",
    "commentBody": "",
    "originSummary": [
      "قدمت Fly.io ، وهي مزود للبنية التحتية السحابية ، عرضا جديدا يسمى Fly Kubernetes (FKS) يدعم Kubernetes (K8s).",
      "FKS هو تطبيق ل Kubernetes يعمل على قمة منصة Fly.io.",
      "يتضمن نهج Fly.io الفريد للتنسيق العالمي استخدام نظام قائم على السوق بدلا من الإجماع العالمي."
    ],
    "commentSummary": [
      "تغطي المناقشة العديد من الموضوعات المتعلقة ب Kubernetes، بما في ذلك الخيارات والفوائد والعيوب المختلفة.",
      "يناقش المستخدمون ميزات وأسعار GKE Autopilot و Fly Kubernetes.",
      "تتضمن المناقشات أيضا التنفيذ والوظائف والتحديات والتعليقات المتعلقة ب Fly Kubernetes في بيئة سحابية.",
      "يتم استكشاف موضوعات مثل kubelet الافتراضي والسيارات الجانبية واستخدام Kubernetes في بيئات مختلفة.",
      "يعبر المستخدمون عن مخاوفهم بشأن فقدان البيانات والاستقرار وقابلية التوسع والتوافق مع الأنظمة الأخرى.",
      "يقدر بعض المستخدمين بساطة Kubernetes وموثوقيتها، بينما يفكر آخرون في حلول بديلة.",
      "تم ذكر الحاجة إلى اتصال واضح وتوحيد وحل موحد."
    ],
    "points": 256,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1702920094
  },
  {
    "id": 38681463,
    "title": "مشروع سيرفو يتجاوز 1000 طلب سحب ، ويضع أهدافا طموحة لعام 2024",
    "originLink": "https://servo.org/blog/2023/12/18/this-year-in-servo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38681463",
    "commentBody": "",
    "originSummary": [
      "شهد مشروع Servo تقدما كبيرا في عام 2023 ، مع زيادة في المساهمين وطلبات السحب والالتزامات مقارنة بالعام السابق.",
      "تم عرض المشروع في مؤتمرات متعددة وحقق تقدما في محرك التخطيط الخاص به ، بما في ذلك الدعم المحسن للميزات المختلفة.",
      "كما أظهرت معدلات النجاح في اختبارات منصة الويب تحسنا.",
      "تتضمن الخطط المستقبلية للمشروع صيانة Servo ، وإصدار السراويل الليلية على Android ، وتنفيذ الجداول ودعم أفضل للعوامات والنصوص غير اللاتينية.",
      "الرعاة المحتملون مدعوون لدعم تطوير المشروع."
    ],
    "commentSummary": [
      "مشروع Servo هو محرك متصفح طورته Mozilla لتعزيز تنوع محرك المتصفح ، ولكن تم إسقاط المزيد من التطوير بواسطة Mozilla.",
      "يناقش المستخدمون عدم الرضا عن Mozilla ويقترحون خيارات متصفح بديلة لتحدي هيمنة Google في السوق.",
      "تغطي المناقشة قدرات Servo ، وإمكانات التضمين ، والمقارنات مع خيارات المتصفح الأخرى مثل PWA و Electron و Tauri و Neutralino.js."
    ],
    "points": 253,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1702901388
  },
  {
    "id": 38684309,
    "title": "سيل فيسبوك من الصور المسروقة التي تم إنشاؤها بواسطة الذكاء الاصطناعي يثير المخاوف",
    "originLink": "https://www.404media.co/facebook-is-being-overrun-with-stolen-ai-generated-images-that-people-think-are-real/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38684309",
    "commentBody": "",
    "originSummary": [
      "يتم نشر المحتوى الذي تم إنشاؤه الذكاء الاصطناعي على Facebook ، بما في ذلك الصور المسروقة ، على أنه حقيقي ، دون اتخاذ تدابير مناسبة لتحديده على أنه تم إنشاؤه الذكاء الاصطناعي.",
      "تتلقى المشاركات الشائعة والجذابة التي يتم إنشاؤها بواسطة الذكاء الاصطناعي روابط غير مرغوب فيها في أقسام التعليقات.",
      "إن استجابة فيسبوك غير الكافية وافتقارها إلى التدابير تجعل المستخدمين غير مستعدين لتدفق المحتوى الذي يتم إنشاؤه الذكاء الاصطناعي ، مما يثير مخاوف بشأن الصور والمعلومات المضللة غير التوافقية."
    ],
    "commentSummary": [
      "يعد انتشار الصور التي تم إنشاؤها بواسطة الذكاء الاصطناعي وعمليات الاحتيال ومقاطع الفيديو المزيفة العميقة على منصات مثل Facebook مصدر قلق كبير.",
      "وهناك نقاش حول من ينبغي أن يتحمل مسؤولية معالجة هذه القضايا والأثر المحتمل للتنظيم على المنافسة.",
      "تركز المناقشات أيضا على استدامة سوق المحتوى ، ودور الإعلانات ، واستعداد المستخدمين للدفع مقابل المحتوى."
    ],
    "points": 239,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1702915513
  },
  {
    "id": 38682631,
    "title": "أبل توقف مبيعات Apple Watch Series 9 و Ultra 2 في الولايات المتحدة",
    "originLink": "https://9to5mac.com/2023/12/18/apple-halting-apple-watch-series-9-and-apple-watch-ultra-2-sales/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38682631",
    "commentBody": "",
    "originSummary": [
      "توقف Apple مبيعات Apple Watch Series 9 و Apple Watch Ultra 2 في الولايات المتحدة.",
      "لم يتم ذكر سبب هذا التوقف في المقالة.",
      "من غير الواضح ما إذا كانت Apple تخطط لإصدار إصدار جديد من Apple Watch في المستقبل القريب."
    ],
    "commentSummary": [
      "يتم مقاضاة شركة Apple من قبل Masimo بزعم انتهاكها لبراءات الاختراع المتعلقة بتكنولوجيا المراقبة البيومترية في Apple Watch.",
      "تزعم الدعوى أن شركة آبل استأجرت موظفين من \"ماسيمو\" وحصلت على تقنيتهم دون تشكيل شراكة.",
      "هناك مناقشات حول صلاحية براءات الاختراع ومخاوف بشأن نظام براءات الاختراع ، بالإضافة إلى مناقشات حول استخدام Apple العدواني لبراءات الاختراع والمعارك القانونية مع الشركات الأخرى."
    ],
    "points": 229,
    "commentCount": 356,
    "retryCount": 0,
    "time": 1702908192
  }
]
