[
  {
    "id": 41261986,
    "title": "الرؤساء التنفيذيون يديرون الشركات عن بُعد حتى مع عودة الموظفين إلى المكاتب",
    "originLink": "https://www.bloomberg.com/news/articles/2024-08-15/starbucks-victoria-s-secret-are-part-of-broader-trend-of-remote-ceos",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41261986",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يدير الرؤساء التنفيذيون الشركات عن بُعد بينما يتوقعون من موظفيهم العودة إلى المكتب، مما يؤدي إلى انفصال وإحباط محتمل.",
      "غالبًا ما تنشأ التناقضات في سياسات العمل من المنزل من تصورات المديرين الذاتية بدلاً من القرارات المستندة إلى البيانات.",
      "النقاش المستمر حول العمل عن بُعد يبرز أهمية خلق بيئات مكتبية أفضل وتقديم جداول مرنة لتشجيع الحضور."
    ],
    "points": 363,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1723768876
  },
  {
    "id": 41262691,
    "title": "مناطق شبكة CSS",
    "originLink": "https://ishadeed.com/article/css-grid-area/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41262691",
    "commentBody": "",
    "originSummary": [
      "دعم شبكة CSS متاح في جميع المتصفحات الرئيسية منذ مارس 2017، لكن ميزة مناطق قالب الشبكة لا تزال غير مستغلة بشكل كافٍ في عام 2024.",
      "تقدم المقالة دليلًا شاملاً حول استخدام مناطق قوالب الشبكة في CSS، بما في ذلك الصياغة والقواعد والأمثلة العملية لتخطيطات متنوعة.",
      "يسلط الضوء على حالات الاستخدام المتقدمة مثل التخطيطات الشرطية باستخدام CSS :has() ودعم متعدد اللغات، بهدف تشجيع المزيد من المطورين على الاستفادة من هذه الميزة القوية."
    ],
    "commentSummary": [
      "يُبرز نظام الشبكة في CSS لمزاياه في إنشاء تخطيطات معقدة ومتجاوبة، مما يكمل قدرات Flexbox.",
      "تؤكد المناقشة على فائدة `grid-template-columns` و `grid-gap` ومناطق القالب الشبكي لتعديلات التخطيط، خاصة في التصميم المتجاوب.",
      "تُوصى باستخدام الأدوات التفاعلية والموارد، مثل Grid Garden ومقالات CSS Tricks، لتعلم وإتقان CSS Grid وFlexbox."
    ],
    "points": 307,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1723776572
  },
  {
    "id": 41263143,
    "title": "حديث إريك شميدت، الرئيس التنفيذي السابق لجوجل، المسرب في جامعة ستانفورد",
    "originLink": "https://github.com/ociubotaru/transcripts/blob/main/Stanford_ECON295%E2%A7%B8CS323_I_2024_I_The_Age_of_AI%2C_Eric_Schmidt.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41263143",
    "commentBody": "",
    "originSummary": [
      "تغطي محاضرة إريك شميدت في صف ECON295/CS323 بجامعة ستانفورد في عام 2024 التقدم السريع في مجال الذكاء الاصطناعي، مثل نوافذ السياق الكبيرة، ووكلاء الذكاء الاصطناعي، وقدرات تحويل النص إلى فعل.",
      "يشير شميدت إلى هيمنة شركة NVIDIA بفضل تحسينات CUDA ويتناول التأثير المجتمعي للذكاء الاصطناعي، والفجوة بين النماذج المتقدمة والشركات الصغيرة، ودور الجامعات في أبحاث الذكاء الاصطناعي.",
      "تختتم الجلسة بجلسة أسئلة وأجوبة تتناول مواضيع مثل الذكاء الاصطناعي العام (AGI) والمزايا المقارنة بين البشر والآلات."
    ],
    "commentSummary": [
      "اقترح الرئيس التنفيذي السابق لشركة جوجل، إريك شميدت، أن جوجل خسرت أمام شركة OpenAI في مجال الذكاء الاصطناعي التوليدي بسبب إعطاء الأولوية لتوازن الحياة العملية والعمل عن بُعد على حساب النجاح التنافسي.",
      "يجادل النقاد بأن وجهة نظر شميت تتغاضى عن قضايا أعمق مثل القيادة والسياسة والبيروقراطية داخل جوجل.",
      "كما تناولت المناقشة الديناميكيات التنافسية بين الولايات المتحدة والصين، وتأثير الثقافة المؤسسية على الابتكار."
    ],
    "points": 305,
    "commentCount": 407,
    "retryCount": 0,
    "time": 1723782087
  },
  {
    "id": 41260345,
    "title": "سعي رجل واحد لاستعادة أول طائرة رئاسية على الإطلاق",
    "originLink": "https://www.atlasobscura.com/articles/first-air-force-one",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260345",
    "commentBody": "",
    "originSummary": [
      "كارل ستولتزفوس، المهتم بتاريخ الطيران، يقوم بترميم الطائرة الأصلية للرئيس دوايت د. أيزنهاور، المعروفة باسم كولومبين الثانية، وهي طائرة لوكهيد سي-121 كونستليشن تعود لعام 1948.",
      "يتضمن مشروع الترميم، الذي بدأ بعد أن اشترى ستولتزفوس الطائرة المهملة بمبلغ 1.5 مليون دولار في عام 2015، إصلاحات واسعة ودقة تاريخية، بتكلفة حوالي 500,000 دولار سنويًا.",
      "تسعى شركة دايناميك أفييشن، من خلال منظمة غير ربحية تُدعى فيرست إير فورس ون، إلى إكمال عملية الترميم في غضون ثلاث سنوات بمبلغ إضافي قدره 12 مليون دولار، بهدف عرض الطائرة كولومبين الثانية في العروض الجوية كرمز للتاريخ الأمريكي وإرث الرئاسة."
    ],
    "commentSummary": [
      "يجري حاليًا مشروع ترميم لجعل أول طائرة نفاثة تابعة لسلاح الجو الأمريكي صالحة للطيران من أجل العروض الجوية، وهي موجودة حاليًا في متحف الطيران في سياتل.",
      "تتضمن الطائرة ميزات فريدة مثل غرف الاجتماعات، ومعدات الاتصال، وجهاز تحكم في درجة الحرارة مزيف تم تركيبه للرئيس جونسون.",
      "تعرض متاحف أخرى، مثل متحف القوات الجوية في أوهايو ومكتبة رونالد ريغان الرئاسية، أيضًا طائرات القوات الجوية الأولى المبكرة والسيارات الرئاسية."
    ],
    "points": 223,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1723755875
  },
  {
    "id": 41263951,
    "title": "أرسطو - كيف تعيش حياة جيدة",
    "originLink": "https://ralphammer.com/aristotle-how-to-live-a-good-life/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41263951",
    "commentBody": "",
    "originSummary": [
      "يحدد كتاب \"الأخلاق النيقوماخية\" لأرسطو كيفية عيش حياة جيدة من خلال تحقيق الوظيفة الفريدة للفرد عبر عقل واضح وشخصية نبيلة.",
      "تشمل فضائل العقل الفن، والذكاء، والمعرفة العلمية، والحكمة، بينما تتضمن فضائل الشخصية موازنة العواطف والأفعال من خلال التعود.",
      "السعادة، وفقًا لأرسطو، هي حياة مليئة بالنشاط الفاضل، مشددًا على أن التفوق يتحقق من خلال الممارسة المستمرة وليس مجرد سمة فطرية."
    ],
    "commentSummary": [
      "تركز فلسفة أرسطو حول العيش حياة جيدة على الفضيلة والإشباع بدلاً من مجرد المتعة، مع التأكيد على شعور أعمق بالازدهار.",
      "يجادل النقاد بأن آرائه قد لا تنطبق على أولئك الذين يكافحون من أجل تلبية احتياجاتهم الأساسية، لكن يتم الاستشهاد بأمثلة مثل إبيكتيتوس، العبد السابق، لدحض هذا الرأي.",
      "على الرغم من الخلفية المتميزة لأرسطو، فإن تعاليمه توفر رؤى قيمة حول تطوير الشخصية وتوجيه المجتمع نحو تلبية احتياجات الجميع الأساسية."
    ],
    "points": 201,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1723792802
  },
  {
    "id": 41263843,
    "title": "PyScript: منصة مفتوحة المصدر لبايثون في المتصفح",
    "originLink": "https://pyscript.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41263843",
    "commentBody": "",
    "originSummary": [
      "PyScript هو منصة مفتوحة المصدر تُمكّن من تشغيل بايثون مباشرة في المتصفح، مما يجمع بين سهولة الوصول إلى الويب والاستخدام الواسع لبايثون.",
      "تشمل الميزات الرئيسية سهولة الاستخدام، والتعبير، والقابلية للتوسع، والمشاركة، والعالمية، والأمان، والقوة، مما يجعلها مناسبة لمختلف التطبيقات.",
      "تم تطوير PyScript بواسطة شركة Anaconda, Inc. في عام 2022، ويهدف إلى جعل لغة بايثون متاحة في أي مكان يتوفر فيه متصفح، مع وثائق شاملة لجميع مستويات المهارة."
    ],
    "commentSummary": [
      "PyScript هو منصة مفتوحة المصدر تُمكّن المستخدمين من تشغيل كود Python مباشرة في المتصفح، باستخدام Pyodide أو MicroPython.",
      "قام مستخدم بعرض لوحة تحكم لإحصائيات الجريمة في دالاس، مشيرًا إلى تأخيرات في بدء التشغيل الأولي بسبب تثبيت المكتبات وتحميل مجموعة البيانات، ولكن الأداء كان سريع الاستجابة بعد ذلك.",
      "تركزت المناقشات على استخدام الذاكرة، اختناقات الأداء، والمقارنات مع أدوات مثل Tableau وBlazor، مع آراء متباينة حول أداء PyScript وتطبيقاته العملية."
    ],
    "points": 194,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1723791709
  },
  {
    "id": 41261426,
    "title": "ImRAD هو منشئ واجهة المستخدم الرسومية لمكتبة ImGui",
    "originLink": "https://github.com/tpecholt/imrad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41261426",
    "commentBody": "",
    "originSummary": [
      "ImRAD هو منشئ واجهات رسومية لمكتبة ImGui، قادر على توليد وتحليل كود C++ للاستخدام المباشر في التطبيقات عبر أنظمة التشغيل ويندوز، لينكس، وماك.",
      "تشمل الميزات الرئيسية تصميم أنواع مختلفة من النوافذ، تكامل GLFW، قوالب نوافذ نشاط Android، مجموعة واسعة من الأدوات، توليد التخطيطات، ربط الخصائص، معالجات الأحداث، وأنماط النوافذ القابلة للتخصيص.",
      "الشفرة المصدرية مرخصة بموجب رخصة GPL، ولكن يمكن استخدام الشفرة المولدة في أي مشروع، مع توفر الملفات التنفيذية للتنزيل أو إمكانية بنائها من المستودع باستخدام CMake."
    ],
    "commentSummary": [
      "ImRAD هو منشئ واجهات رسومية لمكتبة ImGui، يتميز بمحلل مخصص لجزء من لغة C++ ومُنفذ في ترويسة واحدة.",
      "يناقش المستخدمون إمكانياته، بما في ذلك فكرة بنائه كتطبيق WebAssembly (wasm) HTML5 لتسهيل إنشاء واجهات المستخدم الرسومية في المتصفحات.",
      "تُجرى مقارنات مع أدوات RAD (تطوير التطبيقات السريع) القديمة مثل Visual Basic وDelphi، مع ذكر بدائل مثل Lazarus وU++."
    ],
    "points": 192,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1723763166
  },
  {
    "id": 41260050,
    "title": "تنظيف الدماغ المتقدم في العمر: العلماء يستعيدون نظام التخلص من النفايات في الدماغ",
    "originLink": "https://www.sciencedaily.com/releases/2024/08/240815124156.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260050",
    "commentBody": "",
    "originSummary": [
      "استعاد العلماء في مركز جامعة روتشستر الطبي عملية تنظيف المخ من الفضلات في الفئران المسنة، مما قد يوفر علاجات جديدة لمرضى الزهايمر وباركنسون باستخدام أدوية موجودة بالفعل.",
      "تُظهر الأبحاث المنشورة في مجلة Nature Aging أن استعادة وظيفة الأوعية اللمفاوية العنقية يمكن أن تحسن بشكل كبير قدرة الدماغ على إزالة النفايات السامة، التي تتباطأ مع التقدم في العمر.",
      "استخدم الفريق بروستاغلاندين F2α، وهو دواء يساعد في انقباض العضلات الملساء، لإحياء الجهاز اللمفاوي في الفئران الأكبر سنًا، مما عزز تدفق السائل النخاعي وإزالة الفضلات إلى مستويات مماثلة لتلك التي تُرى في الفئران الأصغر سنًا."
    ],
    "commentSummary": [
      "نجح العلماء في استعادة نظام التخلص من النفايات في أدمغة المسنين، مما قد يطيل من أعمارهم.",
      "تسلط هذه الأبحاث، إلى جانب دراسات الدكتور ديفيد سينكلير حول مكافحة الشيخوخة، الضوء على تقدم كبير في علم طول العمر، رغم الجدل حول مصداقية سينكلير.",
      "يُذكر الكرياتين والميلاتونين لفوائدهما المعرفية، كما يُوصى بالتمارين الرياضية والنوم الجيد والنظام الغذائي للحفاظ على صحة الدماغ."
    ],
    "points": 183,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1723753884
  },
  {
    "id": 41260679,
    "title": "RP2350 عرض مسبق PicoDVI",
    "originLink": "https://github.com/Wren6991/PicoDVI/commit/ca941baf37e3f04738b8e641896d85feb3430385",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260679",
    "commentBody": "",
    "originSummary": [
      "تم تحديث مشروع PicoDVI ليشمل دعم المتحكم الدقيق RP2350، بما في ذلك بنية RISC-V.",
      "تشمل التغييرات الهامة نقل كود التجميع الخاص بمعمارية Arm في `libdvi` و `libsprite` إلى RISC-V، وتعديلات الأداء لمعالج Cortex-M33.",
      "يتم الآن تعيين ترميز RGB افتراضيًا لاستخدام مشفرات SIO TMDS على RP2350، مع وجود خيار لتعطيله عبر التكوين."
    ],
    "commentSummary": [
      "يقدم RP2350 واجهة HSTX، مستهدفًا إخراج الفيديو بأقل استخدام لوحدة المعالجة المركزية، وهو ترقية كبيرة عن طريقة DVI بالبتات في RP2040.",
      "يتضمن HSTX مشفر TMDS (إشارة تفاضلية ذات انتقالات مصغرة) مدمج يدعم تنسيقات بكسل مختلفة، مما يجعله مناسبًا لمخرجات الدقة العالية مثل 720p عند 60 هرتز مع زيادة سرعة التشغيل.",
      "يدعم RP2350 أيضًا نوى RV32، ويهدف المشروع إلى تعليم تعقيدات ترميز TMDS، مما يوفر مرجعًا مفتوحًا للمطورين."
    ],
    "points": 180,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1723758173
  },
  {
    "id": 41260098,
    "title": "نجونا من 10 آلاف طلب في الثانية: التحول إلى عناوين URL للأصول الموقعة في حالة الطوارئ",
    "originLink": "https://hardcover.app/blog/how-we-survived-10k-requests-second-switching-to-signed-urls",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260098",
    "commentBody": "",
    "originSummary": [
      "شهدت شركة Hardcover زيادة كبيرة في نفقات تخزين Google Cloud بسبب قيام شخص ما بتنزيل ما يصل إلى 10,000 صورة في الثانية لمدة 7 ساعات، مما أدى إلى زيادة في التكاليف بنسبة 2,098%.",
      "للتخفيف من ذلك، قاموا بالتحول إلى استخدام عناوين URL موقعة، والتي تنتهي صلاحيتها بعد فترة محددة وتتطلب معايير معينة للوصول، وطبقوا تحديد المعدل باستخدام مكتبة rack-attack.",
      "يحد الإعداد الجديد من طلبات API إلى 60 طلبًا في الدقيقة وطلبات الموقع إلى 500 طلب في الدقيقة، مع خطط لتحسين تحديد المعدل، والتقارير، والوصول إلى API بشكل أكبر."
    ],
    "commentSummary": [
      "واجه مطور زيادة في الطلبات بلغت 10,000 طلب في الثانية إلى دلو تخزين Google Cloud الخاص به، مما أدى إلى تكاليف عالية والحاجة إلى حل فوري.",
      "تتناول المقالة تنفيذ عناوين URL الموقعة للتحكم في الوصول والتخفيف من تأثير معدلات الطلب العالية، موضحةً مفهوم وفوائد عناوين URL الموقعة.",
      "تسلط المناقشة الضوء على استراتيجيات وأدوات متنوعة، مثل استخدام شبكات توصيل المحتوى (CDNs) وتحديد معدل الطلبات، للتعامل مع مشكلات مماثلة وتحسين الأمان والأداء."
    ],
    "points": 139,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1723754201
  },
  {
    "id": 41260040,
    "title": "هيرميس 3: أول نموذج لاما 3.1 مضبوط بدقة بحجم 405 مليار",
    "originLink": "https://lambdalabs.com/blog/unveiling-hermes-3-the-first-fine-tuned-llama-3.1-405b-model-is-on-lambdas-cloud",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260040",
    "commentBody": "",
    "originSummary": [
      "قدمت Nous Research Hermes 3، وهو أول ضبط كامل للمعلمات لنموذج Llama 3.1 405B من Meta، والمتاح على مجموعة Lambda بنقرة واحدة.",
      "هرمس 3 هو نموذج عام محايد يتمتع بقدرات متقدمة على الاستدلال، ويمكن الوصول إليه مجانًا عبر واجهة Lambda Chat Completions API وLambda Chat.",
      "يتم تحسين النموذج باستخدام تقنيات مثل RLHF وFP8 quantization، مما يقلل من متطلبات VRAM والقرص بنسبة 50%، ويمكنه التوسع من عقدة واحدة إلى مجموعة عقد متعددة."
    ],
    "commentSummary": [
      "أصدرت شركة Lambda Labs النموذج Hermes 3، وهو أول نسخة محسنة من نموذج Llama 3.1، ويتميز بوجود 405 مليار معلمة.",
      "يهتم المستخدمون بـ Hermes 3 لإمكانيته في التعامل مع المواضيع الحساسة دون رقابة، وهي مشكلة شائعة مع النماذج الأخرى مثل OpenAI وAnthropic.",
      "النموذج متاح على Hugging Face ويمكن اختباره في Discord الخاص بـ Nous Research أو في الدردشة الجديدة لـ Lambda Labs، على الرغم من أنه يتطلب موارد حاسوبية كبيرة لتشغيله محليًا."
    ],
    "points": 137,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1723753837
  },
  {
    "id": 41260603,
    "title": "البطء هو السلاسة، والسلاسة هي السرعة: سر الكفاءة لدى قوات البحرية الخاصة (Navy SEALs)",
    "originLink": "https://www.navyseal.com/slow-is-smooth-smooth-is-fast/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41260603",
    "commentBody": "",
    "originSummary": [
      "العبارة \"البطء هو السلاسة، والسلاسة هي السرعة\" هي شعار رئيسي لقوات البحرية الخاصة (Navy SEALs)، حيث تؤكد على الدقة بدلاً من السرعة لتجنب الأخطاء أثناء المهام الحساسة.",
      "يمكن تطبيق هذا المبدأ، الذي تمثل في عمليات مثل رمح نبتون، في الأعمال وإدارة المشاريع لتعزيز الكفاءة ومنع الأخطاء.",
      "اعتماد هذا النهج يعزز ديناميكيات الفريق بشكل أفضل ويقلل من التوتر، مما يوضح أن تخصيص الوقت لضمان الدقة يمكن أن يؤدي إلى تقدم أسرع بشكل عام."
    ],
    "commentSummary": [
      "الشعار \"البطء هو السلاسة، والسلاسة هي السرعة\" يبرز أهمية الكفاءة ويُستخدم في مختلف التخصصات، بما في ذلك تدريب قوات البحرية الخاصة (Navy SEAL) والجيو جيتسو البرازيلية.",
      "غالبًا ما يعاني المبتدئون في الجيو جيتسو البرازيلية بسبب التوتر والتنفس السطحي، مما يبرز الحاجة إلى الهدوء وتقنيات التنفس الصحيحة.",
      "ينطبق هذا المبدأ في مجالات متنوعة مثل رفع الأثقال والملاكمة ونفخ الزجاج، حيث يؤدي النهج الثابت والمنهجي إلى نتائج أفضل من خلال تجنب الأخطاء الناجمة عن التسرع."
    ],
    "points": 129,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1723757670
  },
  {
    "id": 41264070,
    "title": "تم تسليم هواتف Pixel الذكية مع صيانة عن بُعد سرية ولكن غير نشطة",
    "originLink": "https://www.heise.de/en/news/Pixel-smartphones-delivered-with-secret-but-inactive-remote-maintenance-9836887.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41264070",
    "commentBody": "",
    "originSummary": [
      "تم شحن هواتف Pixel الذكية مع برنامج صيانة عن بُعد غير نشط بناءً على طلب Verizon، مما يشكل خطرًا محتملاً للتجسس إذا تم تفعيله.",
      "تم اكتشاف الثغرة، الموجودة منذ عام 2017، بواسطة iVerify وتم تتبعها إلى حزمة أندرويد مخفية، دون وجود استغلال نشط معروف.",
      "تخطط شركة Verizon لإصدار تحديث لإزالة البرنامج الذي تم تطويره في الأصل بواسطة شركة Smith Micro لعروض المتاجر، مع التأكيد على الحاجة إلى الشفافية حول التطبيقات التابعة لجهات خارجية في أنظمة التشغيل."
    ],
    "commentSummary": [
      "تحتوي هواتف Pixel الذكية على ميزة صيانة عن بُعد مخفية وغير نشطة، مما أثار جدلاً حول طريقة تفعيلها وإمكانية إساءة استخدامها.",
      "تشمل المخاوف وجود برامج مثبتة مسبقًا وغير ضرورية، بالإضافة إلى القضايا الأوسع المتعلقة بالثقة والسيطرة على الأجهزة الشخصية.",
      "يتم الترويج لبدائل تركز على الخصوصية مثل GrapheneOS، والتي لا تتضمن مثل هذه التطبيقات الخاصة بمشغلي الشبكات، من قبل بعض المستخدمين."
    ],
    "points": 119,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1723793964
  },
  {
    "id": 41262439,
    "title": "تجنب البنوك – اختر صناديق سوق المال والسندات الحكومية",
    "originLink": "https://thefinancebuff.com/goodbye-banks-credit-unions.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41262439",
    "commentBody": "",
    "originSummary": [
      "تقدم البنوك والاتحادات الائتمانية معدلات فائدة أقل على حسابات التوفير وشهادات الإيداع مقارنة بصناديق السوق النقدي وسندات الخزانة التي يقدمها الوسطاء مثل فانجارد وفيديليتي وشواب.",
      "تقدم صناديق سوق المال وسندات الخزانة عمومًا معدلات أفضل مع تقلبات أقل، مما يوفر عوائد أكثر استقرارًا وشفافية.",
      "التحول إلى صناديق سوق المال وسندات الخزانة يمكن أن يحقق عوائد أعلى ويضمن معدلات السوق، مما يجعلها خيارًا مفضلًا للنمو المالي المنخفض الصيانة والعادل."
    ],
    "commentSummary": [
      "تتناول المقالة إيجابيات وسلبيات استخدام صناديق سوق المال والسندات الحكومية مقابل حسابات التوفير التقليدية في البنوك لإدارة الشؤون المالية الشخصية.",
      "تشمل النقاط الرئيسية إمكانية تحقيق عوائد أعلى مع صناديق سوق المال والسندات الحكومية، ولكن أيضًا مخاطر تقلبات السوق وغياب تأمين الودائع مقارنة بالحسابات المصرفية.",
      "تسلط المحادثة الضوء على مختلف المنتجات والاستراتيجيات المالية، مثل سلالم السندات، وأذون الخزانة قصيرة الأجل، وفوائد استخدام شركات الوساطة مثل فيديليتي وفانجارد للحصول على معدلات فائدة أفضل ومزايا ضريبية."
    ],
    "points": 117,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1723773803
  },
  {
    "id": 41264270,
    "title": "صناعة لعبة بحجم 13 كيلوبايت: قصة Space Huggers",
    "originLink": "https://frankforce.com/space-huggers-how-i-made-a-game-in-13-kilobytes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41264270",
    "commentBody": "",
    "originSummary": [
      "شارك فرانك في مسابقة Js13kGames، حيث أنشأ لعبة \"Space Huggers\"، وهي لعبة منصات من نوع run-and-gun roguelike بحجم 13 كيلوبايت مستوحاة من Broforce وContra.",
      "تتميز اللعبة، التي تم بناؤها باستخدام محرك جافا سكريبت المخصص من فرانك LittleJS، ببيئات مولدة إجرائيًا، وفن البكسل، وتدعم اللعب التعاوني لما يصل إلى 4 لاعبين.",
      "احتل \"Space Huggers\" المركز الثامن من بين 223 مشاركة وحصل لاحقًا على نسخة محسنة على موقع Newgrounds، محققًا أكثر من 100 ألف لعب وتقييمات إيجابية."
    ],
    "commentSummary": [
      "قام مطور بإنشاء لعبة تسمى \"Space Huggers\" بحجم 13 كيلوبايت فقط، مما يعرض مهاراته المذهلة في التحسين والبرمجة.",
      "اللعبة جزء من مسابقة js13kGames، التي تتحدى المطورين لإنشاء ألعاب بحجم أقل من 13 كيلوبايت، مما يعزز الإبداع والبرمجة الفعالة.",
      "على الرغم من صغر حجمه، يتميز \"Space Huggers\" بعناصر متقدمة مثل عرض الرسوم المتحركة والخرائط المربعة باستخدام WebGL، مما يهدف إلى تحقيق أداء عالٍ."
    ],
    "points": 112,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1723795848
  }
]
