[
  {
    "id": 39793044,
    "title": "Boom Supersonic'in XB-1 Uçağı Başarılı Uçuşunu Tamamladı",
    "originLink": "https://boomsupersonic.com/flyby/inaugural-first-flight-xb1-supersonic-demonstrator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793044",
    "commentBody": "",
    "originSummary": [
      "Boom Supersonic, XB-1 gösteri uçağının ilk uçuşunu tamamlayarak önemli bir kilometre taşına ulaştı ve süpersonik yolculuğa umut verici bir dönüşün sinyalini verdi.",
      "En son teknolojiler ve modern tasarımla donatılan uçak, Boom'un Overture süpersonik uçağının önünü açarak sivil süpersonik uçakların yeniden canlanmasına işaret ediyor.",
      "Sektör uzmanları, daha hızlı ve çevre dostu bir ulaşım alternatifi vaat eden süpersonik seyahati sürdürülebilir bir şekilde yenileme potansiyeli nedeniyle programı takdir ediyor."
    ],
    "commentSummary": [
      "Haberde Boom Aerospace'in XB-1 uçağının son uçuş testinin yanı sıra iddialı hedeflerine yönelik kuşkular da yer alıyor.",
      "Yeni uçak motorlarının geliştirilmesinde karşılaşılan zorluklar ele alınırken, Çin ve Hindistan'ın bu alandaki mücadeleleri vurgulanmaktadır.",
      "SpaceX'in Starship'inin uzun mesafeli seyahatler için pratikliğine ilişkin şüpheler, süpersonik ticari hava yolculuğunun fizibilitesi ve pazar potansiyeli ile gürültü kirliliği ve çevresel etkilere ilişkin endişeler de ele alınmaktadır."
    ],
    "points": 440,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1711129553
  },
  {
    "id": 39796550,
    "title": "Google'a Belirli YouTube Videolarının İzleyicileri Hakkında Bilgi Vermesi Emredildi",
    "originLink": "https://www.forbes.com/sites/thomasbrewster/2024/03/22/feds-ordered-google-to-unmask-certain-youtube-users-critics-say-its-terrifying/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796550",
    "commentBody": "",
    "originSummary": [
      "Federal hükümetin Google'dan belirli YouTube videolarını izleyenlerle ilgili ayrıntıları açıklamasını talep etmesi, gizlilik savunucuları arasında potansiyel anayasa ihlalleri ve masum izleyicilerin gizlilik haklarına yönelik riskler konusunda endişelere yol açtı.",
      "Mahkeme kararları, kolluk kuvvetlerinin suç soruşturmalarında kullanıcı verilerine yönelik taleplerini sergiliyor ve mahremiyet, ifade özgürlüğü ve makul olmayan aramalarla ilgili endişeleri vurguluyor.",
      "Eleştirmenler bu kararların, devlet kurumlarının dijital gözetimde yasal sınırları aştığına dair endişe verici bir modele işaret ettiği konusunda uyarırken, Google kullanıcı verilerini korumaya ve haksız veri taleplerine direnmeye olan bağlılığını vurguluyor."
    ],
    "commentSummary": [
      "Makale, Google'ın belirli YouTube videolarının izleyicilerini ifşa etmeye zorlanmasıyla ilgili gizlilik hakları ve anayasal meseleler hakkındaki tartışmaları inceliyor ve kitlesel gözetim, veri etiği ve hükümet denetimi gibi konulara değiniyor.",
      "Dijital çağda mahremiyetin ve anonimliğin korunmasına vurgu yapan kitap, kişisel haklar, kanun uygulama gereklilikleri ve artan devlet gözetimi riskleri arasındaki hassas dengeyi tartışıyor.",
      "Ayrıca, teknoloji çözümlerini, bilgi yayma üzerindeki hükümet etkisini ve Google gibi kuruluşlar tarafından veri toplama ve izlemenin etkilerini ele almaktadır."
    ],
    "points": 307,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1711156554
  },
  {
    "id": 39793754,
    "title": "Mozilla, CEO'nun Kişi Arama Ağları Nedeniyle Onerep Ortaklığını Sonlandırdı",
    "originLink": "https://krebsonsecurity.com/2024/03/mozilla-drops-onerep-after-ceo-admits-to-running-people-search-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793754",
    "commentBody": "",
    "originSummary": [
      "Mozilla, CEO'nun çeşitli kişi arama ağlarıyla olan bağları nedeniyle Firefox ile entegre bir kimlik koruma hizmeti olan Onerep ile işbirliğini sonlandırıyor.",
      "Onerep'in CEO'su, bir veri simsarı olan Nuwber ile ilişkisini doğrulayarak, tüketici verilerinin düzenlenmesi ve denetimin artırılması gerekliliğine ilişkin endişelerin altını çizdi.",
      "KrebsOnSecurity, Rus kuruluşlarla bağlantılar ve şüpheli sektör uygulamaları da dahil olmak üzere veri aracıları arasındaki diğer bağlantıları araştırırken, gizlilik savunucuları gözetimin önemini vurguluyor."
    ],
    "commentSummary": [
      "Mozilla, CEO'nun şüpheli uygulamaları kabul etmesi nedeniyle Onerep ile işbirliğini sonlandırarak veri gizliliği ve ortaklıkların gizlilik hakları üzerindeki etkileri konusunda tartışmalara yol açtı.",
      "Tartışmalar veri silme hizmetlerinin etkinliği, arşivlemede etik standartların önemi ve güvenlik önlemlerinin güvenilirliği konularına odaklandı.",
      "Ayrıca, Mozilla ve Google Chrome'un itibarlarına ilişkin tartışmalar ortaya çıkmış ve iş ittifaklarında şeffaf iletişimin gerekliliği vurgulanmıştır."
    ],
    "points": 284,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1711134365
  },
  {
    "id": 39797176,
    "title": "Emad Mostaque Stability AI CEO'luğundan Ayrıldı",
    "originLink": "https://stability.ai/news/stabilityai-announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39797176",
    "commentBody": "",
    "originSummary": [
      "Emad Mostaque, merkezi olmayan yapay zekaya odaklanmak için Stability AI CEO'luğundan istifa etti; Shan Shan Wong ve Christian Laforte geçici eş CEO'lar olarak atandı.",
      "Mostaque yeni liderliğe ve şirketin geleceğine güven duyduğunu gösterirken, Yönetim Kurulu ve yatırımcılar da Stability AI'nın ekibini, teknolojisini ve topluluğunu önümüzdeki genişleme aşamasında da koruyacaklarına söz veriyor.",
      "Bu geçiş, şirket içinde merkezi olmayan yapay zekaya doğru stratejik bir kayma anlamına geliyor ve potansiyel yenilikler ve büyüme için zemin hazırlıyor."
    ],
    "commentSummary": [
      "Emad Mostaque, şirketin yapay zeka pazarındaki ekonomik değerden, özellikle de görüntü oluşturma yapay zekasının ticarileştirilmesinden yararlanamaması nedeniyle Stability AI CEO'luğundan istifa etti.",
      "Şirketin performansını artırmak için ücretli, kullanıcı dostu arayüzlerin uygulanması ve imaj oluşturmak için ünlülerin benzerliklerinden yararlanılması gibi öneriler sunulmuştur.",
      "Etik çıkarımlar, teknik gereksinimler, YZ modeli sınırlamaları, iş stratejileri, finansal istikrar, açık kaynaklı YZ ve teknoloji endüstrisindeki tartışmaların ele alındığı tartışma, Stability AI gibi YZ şirketlerinin karşılaştığı zorluklara ışık tuttu."
    ],
    "points": 276,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1711164797
  },
  {
    "id": 39789920,
    "title": "Muhalefetin Ortasında Havalimanı İnşaatının Zorlukları",
    "originLink": "https://www.construction-physics.com/p/why-is-it-so-hard-to-build-an-airport",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39789920",
    "commentBody": "",
    "originSummary": [
      "Havaalanı inşaatı gürültü kirliliği, çevresel kaygılar ve 1950'lerde jet motoru gürültüsüyle ilgili şikayetlere kadar uzanan kentsel muhalefet gibi zorluklarla karşılaşmaktadır.",
      "Yönetmelikler ve teknoloji yoluyla gürültüyü azaltma çabaları, uçuşların yeniden yönlendirilmesi ve gürültüyü en aza indiren prosedürler gibi stratejilere rağmen sınırlı başarı elde etmiştir.",
      "Havaalanları yeni pistler ve daha büyük uçaklarla verimlilik için çabalarken, inşaat etkilerine karşı toplum direnci devam etmekte, bu da artan hava trafiğine rağmen yoğun bölgelerde tıkanıklık sorunlarının devam etmesine yol açmaktadır."
    ],
    "commentSummary": [
      "Tartışma, havalimanı inşası, ulaşım seçenekleri ve kentsel gelişimin çeşitli yönlerini incelemekte, havalimanı inşası, ulaşımın önemi ve havalimanı-şehir organizasyonundaki zorluklara vurgu yapmaktadır.",
      "Havalimanı genişletme karmaşıklıkları, yeşil alan mevcudiyeti ve ABD ile Avrupa'daki farklı ulaşım tercihleri gibi konuları ele alan kitap, pratiklik, çevre ve ulaşım erişimi gibi havalimanı kararlarını etkileyen faktörlere değiniyor.",
      "Kötü havalimanı yönetimi örnekleri, inşaat engelleri ve Olimpiyatlar gibi etkinliklere ev sahipliği yapmanın altyapı üzerindeki etkileri, bölgelerdeki havalimanlarının karşılaştırılması ve ulusal demiryolu ağlarına bağlantıları da dahil olmak üzere tartışılmaktadır."
    ],
    "points": 244,
    "commentCount": 530,
    "retryCount": 0,
    "time": 1711109918
  },
  {
    "id": 39793293,
    "title": "2'lik Enflasyon Hedefinin Öneminin Araştırılması",
    "originLink": "https://sites.lsa.umich.edu/mje/2023/09/04/why-the-2-inflation-target/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793293",
    "commentBody": "",
    "originSummary": [
      "Federal Rezerv, fiyatları istikrara kavuşturmak ve ekonomik büyümeyi artırmak için 1989 yılında Yeni Zelanda merkez bankasından etkilenerek %2'lik bir hedef enflasyon oranı belirlemiştir.",
      "Deflasyonu caydırmak ve ekonomik gerileme dönemlerinde harcamaları canlandırmak için daha yüksek enflasyon hedefleri tercih edilmekte, bu da Fed'in kredibilitesini etkilemekte ve değiştirilmesi halinde enflasyon döngülerini tetiklemektedir.",
      "Doğru enflasyon hedefinin belirlenmesi, güçlü ve gelişen bir ekonominin sürdürülebilmesi için hayati önem taşımaktadır."
    ],
    "commentSummary": [
      "Metin, %2'lik enflasyon hedefinin çalışanların satın alma gücünü nasıl etkilediğini incelemekte, varlıklı ve düşük gelirli gruplar arasındaki farklılıklara vurgu yapmaktadır.",
      "Bu durum, sosyal yardımları, maaşları, servet dağılımını, konut maliyetlerini ve borç seviyelerini etkileyen enflasyon hesaplamalarının kesinliği konusunda endişelere yol açmaktadır.",
      "Ekonomik büyüme, servet algısı, ekonomik ilerlemenin ölçülmesi, enflasyonun servet eşitsizliğindeki rolü, avantajları, dezavantajları ve finansal istikrar stratejileri üzerine çeşitli bakış açıları incelenmektedir."
    ],
    "points": 223,
    "commentCount": 500,
    "retryCount": 0,
    "time": 1711131600
  },
  {
    "id": 39790365,
    "title": "Bulma CSS 1.0 Güncellemesi: Yeni Özellikler ve Geçiş Kolaylığı",
    "originLink": "https://github.com/jgthms/bulma/releases/tag/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790365",
    "commentBody": "",
    "originSummary": [
      "Bulma çerçevesi, artık Dart Sass tarafından desteklenen ve Temalar, Renk Paletleri ve İskelet yükleyiciler gibi yeni öğeler içeren 1.0.0 sürümüne yenilendi.",
      "Güncellemeler, değişmezlerden CSS Değişkenlerine geçişi içeriyor ve Sass değişkenleri aracılığıyla kişiselleştirmeye yeni bir yaklaşım sağlıyor.",
      "Bu sürüm, HTML parçacıklarında değişiklik gerektirmeden geçiş sürecini kolaylaştırıyor ve Bulma'yı yalnızca CSS kullanarak uyarlama esnekliği sunuyor."
    ],
    "commentSummary": [
      "Bulma CSS çerçevesi, sözdizimi ve bileşen odaklı tasarımıyla övgü toplayan 1.0 sürümünü kısa bir süre önce yayınladı ve kumar şirketleri arasındaki popülerliği ile erişilebilirlik ve lisanslama konusundaki endişelere ilişkin tartışmalara yol açtı.",
      "Kullanıcılar Bulma ve Pure.css gibi daha küçük çerçeveler arasında tartışıyor, bazıları Bulma'nın basitliğine değer verirken diğerleri Bootstrap gibi alternatifleri tercih ediyor ve bir CSS çerçevesi seçerken farklı tercihleri ortaya koyuyor.",
      "Tartışmalar, Bulma'nın dokümantasyonu, karanlık mod ve derleme hattı uyumluluğu ile ilgili sorunların yanı sıra Sass işlevlerinin uygulanması, CSS'deki özel özellikler, kodlamadaki numeronimler ve çeşitli kullanıcı ilgi ve endişelerini vurgulayan konuşmalara kadar uzanıyor."
    ],
    "points": 223,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1711113163
  },
  {
    "id": 39793912,
    "title": "OpenCat: Robot Evcil Hayvan Yaratımında Devrim Yaratıyor",
    "originLink": "https://www.petoi.com/pages/opencat-open-source-robot-pet-framework",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793912",
    "commentBody": "",
    "originSummary": [
      "OpenCat, dört ayaklı robotik evcil hayvanlar inşa etmek için açık kaynaklı bir çerçevedir ve bireylerin dinamik yürüyen robotları uygun maliyetli ve kolay bir şekilde inşa etmelerini sağlar.",
      "Hareket görevleri için hobi amaçlı servoları, Arduino ve Raspberry Pi gibi yaygın olarak kullanılan kontrolörleri ve açık kaynaklı kontrol kodlarını kullanır.",
      "Rongzhong Li tarafından 2016 yılında başlatılan proje, Nybble ve Bittle gibi ticari robot evcil hayvanlara güç vermekle kalmıyor, aynı zamanda küresel DIY robot projelerini besliyor, işbirliğini teşvik ediyor, eğitim kaynakları sunuyor ve robotik yapay zeka ve IoT yeniliklerine ilgi uyandırıyor."
    ],
    "commentSummary": [
      "Konuşma, OpenCat çerçevesine, gözetleme ve askeri operasyonlardaki potansiyel kullanımlara, yapay zeka firmalarının etik kurallarına, gerçek ve robot kediler arasındaki maliyet karşılaştırmalarına ve evcil hayvan tıbbi bakımının karşılanabilirliğine değinerek robotik evcil hayvan gelişimini inceliyor.",
      "Şeffaflık, açık kaynak ilkeleri ve etik yansımalar tartışma boyunca vurgulanan ana temalardır."
    ],
    "points": 214,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1711135559
  },
  {
    "id": 39793513,
    "title": "Magick.css: Kolay, Özelleştirilebilir Web Tasarımı için Minimalist CSS",
    "originLink": "https://css.winterveil.net",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793513",
    "commentBody": "",
    "originSummary": [
      "magick.css, TTRPG kural kitaplarından ve brutalizmden esinlenen, JavaScript olmadan tek bir dosyada tipografi, formlar, medya öğeleri ve daha fazlasını sunan sınıfsız bir CSS çerçevesidir.",
      "Kullanıcılar çerçeveyi kolayca özelleştirebilir ve yan notlar ve kod / ön satır numaralandırma gibi ekstra özellikler ekleyebilir, bu da onu çeşitli projeler için çok yönlü hale getirir.",
      "Bir CDN aracılığıyla veya dosyayı depodan indirerek projelere zahmetsizce entegre edilebilir."
    ],
    "commentSummary": [
      "Kullanıcılar, minimalist bir CSS çerçevesi olan magick.css'i kendine özgü yazı tipi stili ve tasarımı nedeniyle övüyor.",
      "Tartışmalar, gizlilik odaklı araçlar ve platformlar için önerilerin yanı sıra gizlilik endişelerini ve yazı tipleriyle ilgili izleme sorunlarını da içeriyor.",
      "Bazı kullanıcılar magick.css'nin tasarımını ve özelliklerini takdir etmekte ve potansiyel geliştirmeler için yapıcı geri bildirimler sağlamaktadır."
    ],
    "points": 207,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1711132992
  },
  {
    "id": 39796216,
    "title": "Scarfolk'u Keşfetmek: 1970'lerin Distopyası Hayat Buldu",
    "originLink": "https://www.collectorsweekly.com/articles/visiting-scarfolk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796216",
    "commentBody": "",
    "originSummary": [
      "Richard Littler, 1970'lerin banliyö İngiltere'sinde yetişme tarzına dayanarak kurgusal Scarfolk kasabasını geliştirdi ve 1970'lerin otantik tasarımlarını kullanarak korku ve paranoyayı keşfetti.",
      "Scarfolk, sosyal normlardaki değişimleri yansıtan benzersiz bir tarih anlayışını sergileyen bir İngiliz TV dizisi planlarıyla popüler hale geliyor.",
      "Littler'ın yaratımı, dönem markalarını yansıtan, gözetim, sivil haklar ve güncel politika gibi temaları ele alan ve genellikle gerçek tarihi öğelerle karıştırılan grafikler içeriyor. \"Discovering Scarfolk\" kitabına ve sosyal medya hesaplarına da atıfta bulunuluyor."
    ],
    "commentSummary": [
      "Tartışma, 1970'lerden kurgusal bir distopik kasaba olan Scarfolk etrafında dönüyor ve Birleşik Krallık hükümetindeki güncel olaylarla paralellikler kurarak ürkütücü eğitim filmleri ve kasvetli mimariyi vurguluyor.",
      "Scarfolk'un kara mizahı ve sosyal yorumları övülmekte, ABD'deki benzer eserlerle karşılaştırmalar yapılmakta, ürünlere, kitaplara ve ilgili içeriklere bağlantılar verilmektedir.",
      "Konuşma, okul davranış problemleri için amfetamin reçeteleri gibi toplumsal konuları ele alıyor ve distopik temaların medya ve toplumdaki etkisini yansıtıyor."
    ],
    "points": 189,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1711153273
  },
  {
    "id": 39792136,
    "title": "DryMerge: Sade İngilizce Otomasyon ile İş Akışlarını Basitleştirme",
    "originLink": "https://news.ycombinator.com/item?id=39792136",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792136",
    "commentBody": "",
    "originSummary": [
      "DryMerge, Edward ve Sam tarafından oluşturulan ve kullanıcıların Google E-Tablolara veri ekleme ve metin gönderme gibi görevleri yerine getirmelerine olanak tanıyan, düz İngilizce komutlar aracılığıyla iş akışlarını otomatikleştiren bir araçtır.",
      "Araç, kullanıcı taleplerini yorumlamak, iş akışı otomasyonunu kolaylaştırmak ve manuel kurulum ihtiyacını ortadan kaldırmak için yapay zeka kullanıyor; talepleri anlamak için semantik bir katman ve iş akışlarını yürütmek için bir veri düzlemi bulunuyor.",
      "Bu uygulama 14 popüler hizmetle sorunsuz bir şekilde entegre olmaktadır ve ilgilenen kullanıcılar denemek için drymerge.com/app adresinden bu uygulamaya erişebilirler."
    ],
    "commentSummary": [
      "DryMerge, sade İngilizce komutlar aracılığıyla iş akışlarını otomatikleştiren, popüler hizmetlerle entegre olan ve teknoloji kullanmayan kullanıcılar için basitliğe öncelik veren kullanıcı dostu bir araçtır.",
      "Kullanıcılar, bağlantı uygulamaları, mobil optimizasyon ve netliği artırmak için olası entegrasyonlar hakkında geri bildirimde bulunuyor ve çeşitli abonelik planları mevcut.",
      "DryMerge'i geliştirmek için Büyük Dil Modelleri (LLM'ler) kullanan startup, otomasyon sektöründeki potansiyeli, zorlukları ve rekabet avantajları konusunda iyimser olduğunu ifade ediyor."
    ],
    "points": 150,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1711124153
  },
  {
    "id": 39790003,
    "title": "Webtag ile tanışın: Ücretsiz Metin Tabanlı Yer İşaretleme",
    "originLink": "https://webtag.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790003",
    "commentBody": "",
    "originSummary": [
      "Webtag, kullanıcıların yer imlerini etiketlerle kategorize etmelerine, paylaşmalarına ve diğer hizmetlerden yer imlerini aktarmalarına olanak tanıyan ücretsiz bir metin tabanlı yer imi web sitesidir.",
      "Varsayılan özel yer imleri, tek tıklamayla yer imi ekleme, sınırsız depolama ve internete bağlı herhangi bir cihazdan erişim sağlar."
    ],
    "commentSummary": [
      "Kullanıcılar Miitla, Webtag, Pinboard ve Buku gibi farklı yer imi uygulamalarını keşfediyor, semantik arama ve yapay zeka organizasyonu gibi gelişmiş özelliklere ilgi duyduklarını ifade ediyor.",
      "Firefox gibi geleneksel tarayıcı yer imi yöntemleriyle ilgili endişeler, kullanıcıları Linkhut, Notado, Readwise ve Buku gibi alternatifleri değerlendirmeye sevk ediyor.",
      "Konuşma, kendi kendine barındırılan yer imi araçlarına, yer imleri için dosya depolamanın kullanılmasına ve alışılmadık işlevler için API'lerin yeniden tasarlanmasına kadar uzanıyor."
    ],
    "points": 145,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1711110526
  },
  {
    "id": 39793805,
    "title": "Paket: Yüksek verimli dosya sıkıştırma için yeni nesil konteyner formatı",
    "originLink": "https://pack.ac/note/pack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793805",
    "commentBody": "",
    "originSummary": [
      "Pack, dosyaları yüksek sıkıştırma ve modern donanım optimizasyonu ile verimli bir şekilde paketlemeye odaklanan ve en iyi sıkıştırma-zaman oranını hedefleyen bir konteyner formatıdır.",
      "Belirli dosya veya klasörleri keşfetme ve açma gibi özellikler sunar, kişisel verileri toplamayarak kullanıcı gizliliğini vurgular.",
      "Pack açık kaynaklıdır, Apache 2.0 ile lisanslanmıştır, SQLite3 ve Zstandard tabanlıdır ve gelecekte şifreleme, grafik arayüz ve platform desteği planlanmaktadır."
    ],
    "commentSummary": [
      "Tartışma, tar ve zip gibi eski formatların yerini almayı amaçlayan, zstd sıkıştırma, hızlı tek dosya açma ve çapraz uyumluluğu vurgulayan yeni kapsayıcı formatı Pack'i tanıtıyor.",
      "Tar gibi mevcut dosya formatları, daha iyi veri yönetimi için tartışılan sınırlamalarla karşı karşıyadır ve SQLite, bazı kullanıcılar tarafından belirtilen sınırlamalara ve dezavantajlara rağmen bir dosya ve değişim formatı olarak önerilmiştir.",
      "Genel olarak konuşma, arşiv formatlarının karmaşıklığını, uyumluluğunu ve performansını Pack gibi daha verimli ve kullanıcı dostu bir formata doğru geliştirmeye odaklanıyor."
    ],
    "points": 141,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1711134705
  },
  {
    "id": 39792383,
    "title": "Kanada Açıklarında Benzeri Görülmemiş 2 Bin Deprem Tespit Edildi",
    "originLink": "https://www.livescience.com/planet-earth/earthquakes/2000-earthquakes-in-1-day-off-canada-coast-suggest-the-ocean-floor-is-ripping-apart-scientists-say",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792383",
    "commentBody": "",
    "originSummary": [
      "Vancouver Adası açıklarında bir gün içinde kaydedilen yaklaşık 2.000 deprem, Juan de Fuca Sırtı'ndaki Endeavour bölgesinde deniz tabanı parçalandıkça yeni okyanus kabuğunun oluştuğuna işaret ediyor.",
      "Sismik aktivite, magmanın yükselmesini ve taze kabuk oluşturmasını sağlayarak okyanus kabuğu oluşumu hakkında değerli bilgiler sunan deniz tabanının gerilmesine bağlanmaktadır.",
      "2011'den beri devam eden izleme, araştırmacıların bu doğal sürece ışık tutarak fenomeni yakından incelemelerine olanak tanıyor."
    ],
    "commentSummary": [
      "Kanada açıklarındaki Juan de Fuca Sırtı'nda bulunan hidrotermal bacaların yakınlarında, 20 yıllık bir döngünün parçası olan ve büyük bir olay riski taşımayan çok sayıda küçük deprem tespit edildi.",
      "Tartışmalar, bu depremlerin sınıflandırılmasının yanı sıra levha hareketi ve tektonik ilişkilerle ilgili tartışmaları da çevrelemektedir.",
      "Gemi yakıt emisyonlarının neden olduğu bulut örtüsünün azalmasıyla bağlantılı okyanus ısınmasının iklim değişikliğini ve dünya çapındaki sıcaklıkları etkilemesinden endişe ediliyor."
    ],
    "points": 131,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1711125603
  }
]
