[
  {
    "id": 39793044,
    "title": "붐 슈퍼소닉의 XB-1 항공기, 성공적인 비행 완료",
    "originLink": "https://boomsupersonic.com/flyby/inaugural-first-flight-xb1-supersonic-demonstrator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793044",
    "commentBody": "",
    "originSummary": [
      "붐 슈퍼소닉은 XB-1 시범 항공기의 첫 비행을 완료하며 초음속 여행으로의 복귀를 알리는 중요한 이정표를 세웠습니다.",
      "최첨단 기술과 현대적인 디자인으로 무장한 이 항공기는 민간 초음속 비행기의 부활을 알리며 붐의 오버추어 초음속 여객기를 위한 길을 열었습니다.",
      "업계 전문가들은 이 프로그램이 초음속 여행을 지속 가능하게 혁신할 수 있는 잠재력을 가지고 있으며, 더 빠르고 친환경적인 교통 대안을 제시할 것이라고 평가합니다."
    ],
    "commentSummary": [
      "붐 에어로스페이스의 최근 XB-1 항공기 비행 테스트와 함께 그들의 야심찬 목표에 대한 회의론도 다룹니다.",
      "새로운 항공기 엔진 개발의 도전 과제에 대해 논의하며 이 분야에서 중국과 인도의 어려움을 강조합니다.",
      "장거리 여행에 대한 SpaceX의 스타십의 실용성, 초음속 상용 항공 여행의 타당성 및 시장 잠재력, 소음 공해 및 환경 영향에 대한 우려도 다뤄집니다."
    ],
    "points": 440,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1711129553
  },
  {
    "id": 39796550,
    "title": "특정 YouTube 동영상 시청자에 대한 정보를 제공하라는 Google의 명령",
    "originLink": "https://www.forbes.com/sites/thomasbrewster/2024/03/22/feds-ordered-google-to-unmask-certain-youtube-users-critics-say-its-terrifying/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796550",
    "commentBody": "",
    "originSummary": [
      "연방 정부는 Google에 특정 YouTube 동영상 시청자에 대한 세부 정보를 공개할 것을 요구했으며, 개인정보 보호 옹호자들은 잠재적인 헌법 위반과 무고한 시청자의 개인정보 보호권에 대한 위험에 대한 우려를 제기하고 있습니다.",
      "법원 명령은 사법당국이 범죄 수사에서 사용자 데이터를 요청할 때 프라이버시, 언론의 자유, 부당한 검색에 대한 우려를 강조하는 내용을 담고 있습니다.",
      "비평가들은 이러한 명령이 정부 기관이 디지털 감시에서 법적 한계를 넘어서는 우려스러운 패턴을 보여주는 것이라고 경고하는 반면, 구글은 사용자 데이터를 보호하고 부당한 데이터 요청에 저항하는 데 전념하고 있다고 강조합니다."
    ],
    "commentSummary": [
      "이 기사에서는 대규모 감시, 데이터 윤리, 정부 감독과 같은 주제를 다루면서 구글이 특정 YouTube 동영상의 시청자를 공개하도록 강요하는 것과 관련된 프라이버시 권리와 헌법적 문제에 대한 논쟁을 살펴봅니다.",
      "디지털 시대의 프라이버시와 익명성 보호를 강조하면서 개인의 권리, 법 집행 요건, 국가 감시 강화의 위험성 사이의 미묘한 균형에 대해 논의합니다.",
      "또한 기술 솔루션, 정보 유포에 대한 정부의 영향력, Google과 같은 기업의 데이터 수집 및 모니터링의 영향에 대해서도 다룹니다."
    ],
    "points": 307,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1711156554
  },
  {
    "id": 39793754,
    "title": "모질라, CEO의 인력 검색 네트워크에 대한 Onerep 파트너십 종료",
    "originLink": "https://krebsonsecurity.com/2024/03/mozilla-drops-onerep-after-ceo-admits-to-running-people-search-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793754",
    "commentBody": "",
    "originSummary": [
      "Mozilla는 다양한 사람 검색 네트워크에 대한 CEO의 관계로 인해 Firefox와 통합된 신원 보호 서비스인 Onerep과의 협력을 종료합니다.",
      "Onerep의 CEO는 데이터 브로커인 Nuwber와의 관계를 확인하면서 소비자 데이터 규제에 대한 우려와 감독 강화의 필요성을 강조했습니다.",
      "개인 정보 보호 옹호자들은 크렙스온시큐리티가 러시아 단체와의 연결 및 의심스러운 업계 관행을 포함하여 데이터 브로커 간의 추가 연결을 조사함에 따라 감독의 중요성을 강조하고 있습니다."
    ],
    "commentSummary": [
      "모질라는 모호한 관행에 대한 CEO의 인정으로 Onerep과의 협력을 종료했으며, 이는 데이터 프라이버시와 파트너십이 프라이버시 권리에 미치는 영향에 대한 논의를 촉발시켰습니다.",
      "토론에서는 데이터 삭제 서비스의 효율성, 아카이빙에서 윤리 기준의 중요성, 보안 조치의 신뢰성에 대한 논의가 집중적으로 이루어졌습니다.",
      "또한, 모질라와 구글 크롬의 평판에 관한 논쟁이 벌어지면서 비즈니스 제휴에 있어 투명한 커뮤니케이션의 필요성이 강조되었습니다."
    ],
    "points": 284,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1711134365
  },
  {
    "id": 39797176,
    "title": "에마드 모스탁, 안정성 AI CEO에서 물러나다",
    "originLink": "https://stability.ai/news/stabilityai-announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39797176",
    "commentBody": "",
    "originSummary": [
      "에마드 모스타크가 탈중앙화 AI에 집중하기 위해 Stability AI의 CEO에서 물러나고, 샨 샨 웡과 크리스티안 라포르테가 임시 공동 CEO로 임명되었습니다.",
      "모스탁은 새로운 리더십과 회사의 미래에 대한 신뢰를 표명했으며, 이사회와 투자자들은 다가오는 확장 단계에서도 Stability AI의 팀, 기술, 커뮤니티를 유지할 것을 다짐했습니다.",
      "이러한 전환은 회사 내에서 분산형 AI로의 전략적 전환을 의미하며, 잠재적인 혁신과 성장을 위한 발판을 마련합니다."
    ],
    "commentSummary": [
      "에마드 모스타크는 AI 시장, 특히 이미지 생성 AI 상용화에 있어 경제적 가치를 제대로 활용하지 못해 Stability AI의 CEO 자리에서 물러났습니다.",
      "사용자 친화적인 유료 인터페이스 구현, 유명인의 모습을 이미지 생성에 활용하는 등 회사의 성과를 높이기 위한 제안이 제시되었습니다.",
      "이 토론에서는 윤리적 의미, 기술적 요구 사항, AI 모델의 한계, 비즈니스 전략, 재무 안정성, 오픈소스 AI, 기술 업계 내 논란 등을 다루며 Stability AI와 같은 AI 기업이 직면한 과제를 조명했습니다."
    ],
    "points": 276,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1711164797
  },
  {
    "id": 39789920,
    "title": "반대에 부딪힌 공항 건설의 과제",
    "originLink": "https://www.construction-physics.com/p/why-is-it-so-hard-to-build-an-airport",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39789920",
    "commentBody": "",
    "originSummary": [
      "공항 건설은 1950년대 제트 엔진 소음에 대한 불만으로 거슬러 올라가는 소음 공해, 환경 문제, 도시의 반대와 같은 문제에 직면해 있습니다.",
      "규제와 기술을 통해 소음을 완화하려는 노력은 비행 경로 변경, 소음 최소화 절차 등의 전략에도 불구하고 제한적인 성공을 거두었습니다.",
      "공항이 새로운 활주로와 더 큰 비행기로 효율성을 높이기 위해 노력하는 동안, 건설 영향에 대한 지역사회의 저항은 지속되어 항공 교통량 증가에도 불구하고 혼잡한 지역에서 지속적인 혼잡 문제가 발생하고 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 공항 건설, 교통 수단 선택, 도시 개발의 다양한 측면을 살펴보고 공항 건설의 과제, 교통의 중요성, 공항-도시 조직에 대해 강조합니다.",
      "이 보고서는 공항 확장의 복잡성, 녹지 공간 가용성, 미국과 유럽의 뚜렷한 교통 선호도 등의 주제를 다루며 실용성, 환경, 교통 접근성 등 공항 결정에 영향을 미치는 요인에 대해 다룹니다.",
      "공항의 잘못된 관리, 건설 장애물, 올림픽과 같은 이벤트 개최가 인프라에 미치는 영향 등 여러 지역의 공항과 국가 철도망과의 연결성 비교를 통해 공항의 잘못된 관리 사례를 살펴봅니다."
    ],
    "points": 244,
    "commentCount": 530,
    "retryCount": 0,
    "time": 1711109918
  },
  {
    "id": 39793293,
    "title": "2% 인플레이션 목표의 중요성 살펴보기",
    "originLink": "https://sites.lsa.umich.edu/mje/2023/09/04/why-the-2-inflation-target/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793293",
    "commentBody": "",
    "originSummary": [
      "뉴질랜드 중앙은행은 1989년 물가를 안정시키고 경제 성장을 촉진하기 위해 연방준비제도의 영향을 받아 목표 인플레이션율을 2%로 설정했습니다.",
      "더 높은 인플레이션 목표는 디플레이션을 억제하고 경기 침체기에 지출을 촉진하기 위해 선호되며, 변경 시 연준의 신뢰도에 영향을 미치고 인플레이션 사이클을 촉발합니다.",
      "적절한 인플레이션 목표를 설정하는 것은 견고하고 번영하는 경제를 유지하는 데 필수적입니다."
    ],
    "commentSummary": [
      "이 글에서는 2% 인플레이션 목표가 근로자의 구매력에 어떤 영향을 미치는지 살펴보고 부유층과 저소득층 간의 차이를 강조합니다.",
      "이는 혜택, 급여, 부의 분배, 주거 비용, 부채 수준에 영향을 미치는 인플레이션 계산의 정확성에 대한 우려를 불러일으킵니다.",
      "경제 성장, 부의 인식, 경제 발전의 측정, 부의 불평등에서 인플레이션의 역할, 장점과 단점, 금융 안정을 위한 전략에 대한 다양한 관점을 살펴봅니다."
    ],
    "points": 223,
    "commentCount": 500,
    "retryCount": 0,
    "time": 1711131600
  },
  {
    "id": 39790365,
    "title": "Bulma CSS 1.0 업데이트: 새로운 기능 및 전환의 용이성",
    "originLink": "https://github.com/jgthms/bulma/releases/tag/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790365",
    "commentBody": "",
    "originSummary": [
      "불마 프레임워크는 이제 테마, 색상 팔레트, 스켈레톤 로더와 같은 새로운 요소를 갖춘 Dart Sass 기반의 1.0.0 버전으로 개선되었습니다.",
      "업데이트에는 리터럴에서 CSS 변수로의 전환이 포함되며, Sass 변수를 통한 개인화에 대한 새로운 접근 방식을 제공합니다.",
      "이 버전은 HTML 스니펫을 수정할 필요 없이 전환 프로세스를 간소화하여 CSS만으로 Bulma를 맞춤 설정할 수 있는 유연성을 제공합니다."
    ],
    "commentSummary": [
      "불마 CSS 프레임워크는 최근 버전 1.0을 출시하여 구문과 컴포넌트 중심의 디자인으로 호평을 받으며 겜블링 회사들 사이에서 인기와 접근성 및 라이선스에 대한 우려를 불러일으키고 있습니다.",
      "사용자들은 Bulma와 Pure.css와 같은 소규모 프레임워크 사이에서 논쟁을 벌이고 있으며, 일부는 Bulma의 단순성을 높이 평가하고 다른 일부는 부트스트랩을 비롯한 대안을 선호하여 CSS 프레임워크 선택에 있어 다양한 선호도를 드러내고 있습니다.",
      "토론은 Bulma의 문서, 다크 모드, 빌드 파이프라인 호환성 문제와 함께 Sass 함수 구현, CSS의 사용자 지정 기능, 코딩의 숫자 이름, 다양한 사용자 관심사 및 우려 사항에 대한 강연으로 확장됩니다."
    ],
    "points": 223,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1711113163
  },
  {
    "id": 39793912,
    "title": "OpenCat: 로봇 반려동물 제작의 혁신",
    "originLink": "https://www.petoi.com/pages/opencat-open-source-robot-pet-framework",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793912",
    "commentBody": "",
    "originSummary": [
      "OpenCat은 네 발로 걷는 로봇 애완동물을 만들기 위한 오픈 소스 프레임워크로, 개인이 경제적이고 쉽게 역동적인 보행 로봇을 만들 수 있도록 지원합니다.",
      "취미용 서보, Arduino 및 Raspberry Pi와 같이 널리 사용되는 컨트롤러, 모션 작업을 위한 오픈 소스 제어 코드를 사용합니다.",
      "2016년 리롱중이 시작한 이 프로젝트는 나이블과 비틀 같은 상업용 로봇 애완동물을 지원할 뿐만 아니라 글로벌 DIY 로봇 프로젝트를 촉진하고, 협업을 촉진하며, 교육 리소스를 제공하고, 로봇 AI 및 IoT 혁신에 대한 관심을 불러일으키고 있습니다."
    ],
    "commentSummary": [
      "이 대화에서는 로봇 반려동물 개발, OpenCat 프레임워크, 감시 및 군사 작전에서의 잠재적 활용, AI 기업의 윤리, 실제 고양이와 로봇 고양이의 비용 비교, 반려동물 의료 서비스 경제성 등에 대해 다룹니다.",
      "투명성, 오픈소스 원칙, 윤리적 성찰은 토론 내내 강조된 핵심 주제입니다."
    ],
    "points": 214,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1711135559
  },
  {
    "id": 39793513,
    "title": "Magick.css: 쉽고 사용자 정의 가능한 웹 디자인을 위한 미니멀리스트 CSS",
    "originLink": "https://css.winterveil.net",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793513",
    "commentBody": "",
    "originSummary": [
      "magick.css는 TTRPG 규칙집과 브루탈리즘에서 영감을 얻은 클래스 없는 CSS 프레임워크로, 타이포그래피, 양식, 미디어 요소 등을 자바스크립트 없이 단일 파일로 제공합니다.",
      "사용자는 프레임워크를 쉽게 사용자 정의하고 사이드노트 및 코드/줄 번호 지정과 같은 추가 기능을 추가할 수 있어 다양한 프로젝트에 다양하게 활용할 수 있습니다.",
      "CDN을 통해 또는 리포지토리에서 파일을 다운로드하여 프로젝트에 손쉽게 통합할 수 있습니다."
    ],
    "commentSummary": [
      "사용자들은 독특한 글꼴 스타일과 디자인으로 인해 미니멀리즘 CSS 프레임워크인 magick.css를 칭찬하고 있습니다.",
      "개인정보 보호 문제 및 글꼴 추적 문제와 함께 개인정보 보호에 중점을 둔 도구 및 플랫폼에 대한 권장 사항을 논의합니다.",
      "일부 사용자는 magick.css의 디자인과 기능을 높이 평가하여 잠재적인 개선 사항에 대한 건설적인 피드백을 제공하기도 합니다."
    ],
    "points": 207,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1711132992
  },
  {
    "id": 39796216,
    "title": "스카포크 탐험: 1970년대 디스토피아가 살아 숨 쉬다",
    "originLink": "https://www.collectorsweekly.com/articles/visiting-scarfolk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796216",
    "commentBody": "",
    "originSummary": [
      "리처드 리틀러는 1970년대 영국 교외에서 자란 배경을 바탕으로 가상의 마을 스카포크를 개발했으며, 1970년대풍 디자인을 사용하여 공포와 편집증을 탐구했습니다.",
      "스카포크는 사회 규범의 변화를 반영하는 독특한 역사관을 보여주는 영국 TV 시리즈가 제작될 계획으로 인기를 끌고 있습니다.",
      "리틀러의 작품에는 감시, 시민권, 현재 정치와 같은 주제를 다루는 시대적 브랜딩을 반영한 그래픽이 포함되어 있으며, 종종 진짜 역사적 아이템으로 오인되기도 합니다. \"스카포크의 발견\" 책과 소셜 미디어 계정도 참고했습니다."
    ],
    "commentSummary": [
      "이 토론은 1970년대 가상의 디스토피아 마을인 스카포크를 중심으로 진행되며, 섬뜩한 교육 영화와 황량한 건축물을 강조하면서 영국 정부의 현재 상황과 유사점을 도출합니다.",
      "스카포크의 어두운 유머와 사회적 논평은 미국의 유사한 작품과 비교하여 상품, 서적 및 관련 콘텐츠에 대한 링크와 함께 칭찬을 받고 있습니다.",
      "이 대화에서는 학교 행동 문제에 대한 암페타민 처방과 같은 사회적 문제를 탐구하고 미디어와 사회에서 디스토피아적 주제가 미치는 영향에 대해 생각해봅니다."
    ],
    "points": 189,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1711153273
  },
  {
    "id": 39792136,
    "title": "DryMerge: 일반 영어 자동화를 통한 워크플로 간소화",
    "originLink": "https://news.ycombinator.com/item?id=39792136",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792136",
    "commentBody": "",
    "originSummary": [
      "DryMerge는 Edward와 Sam이 만든 도구로, 일반 영어 명령을 통해 워크플로우를 자동화하여 사용자가 Google 스프레드시트에 데이터를 추가하고 문자를 보내는 등의 작업을 수행할 수 있도록 해줍니다.",
      "이 도구는 AI를 사용하여 사용자 요청을 해석함으로써 워크플로 자동화를 간소화하고 수동 설정의 필요성을 없애며, 요청을 이해하기 위한 시맨틱 레이어와 워크플로 수행을 위한 데이터 플레인을 제공합니다.",
      "14개의 인기 서비스와 원활하게 통합되며, 관심 있는 사용자는 drymerge.com/app에 접속하여 사용해 볼 수 있습니다."
    ],
    "commentSummary": [
      "DryMerge는 일반 영어 명령을 통해 워크플로를 자동화하는 사용자 친화적인 도구로, 인기 있는 서비스와 통합되며 기술 전문가가 아닌 사용자를 위해 단순성을 우선시합니다.",
      "사용자들은 다양한 구독 플랜을 통해 연결 사례, 모바일 최적화, 명확성 향상을 위한 통합 가능성에 대한 피드백을 제공하고 있습니다.",
      "이 스타트업은 대규모 언어 모델(LLM)을 사용하여 DryMerge를 개발했으며, 사용자들은 자동화 부문에서의 잠재력, 과제, 경쟁 우위에 대해 낙관적인 평가를 내리고 있습니다."
    ],
    "points": 150,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1711124153
  },
  {
    "id": 39790003,
    "title": "웹태그를 소개합니다: 무료 텍스트 기반 북마크",
    "originLink": "https://webtag.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790003",
    "commentBody": "",
    "originSummary": [
      "Webtag는 사용자가 태그를 사용하여 북마크를 분류하고, 공유하고, 다른 서비스에서 북마크를 전송할 수 있는 무료 텍스트 기반 북마크 웹사이트입니다.",
      "기본 비공개 북마크, 원클릭 북마크, 무제한 저장 공간, 인터넷에 연결된 모든 장치에서 액세스할 수 있는 기능을 제공합니다."
    ],
    "commentSummary": [
      "사용자들은 미틀라, 웹태그, 핀보드, 부쿠 등 다양한 북마크 앱을 탐색하며 시맨틱 검색과 AI 정리 같은 고급 기능에 관심을 표하고 있습니다.",
      "Firefox와 같은 기존 브라우저의 북마크 방식에 대한 우려로 인해 사용자들은 Linkhut, Notado, Readwise, Buku와 같은 대안을 고려하고 있습니다.",
      "이 대화는 자체 호스팅 북마크 도구, 북마크에 파일 저장소 사용, 색다른 기능을 위한 API 용도 변경으로 확장됩니다."
    ],
    "points": 145,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1711110526
  },
  {
    "id": 39793805,
    "title": "Pack: 고효율 파일 압축을 위한 차세대 컨테이너 형식",
    "originLink": "https://pack.ac/note/pack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793805",
    "commentBody": "",
    "originSummary": [
      "Pack은 고압축과 최신 하드웨어 최적화를 통해 파일을 효율적으로 압축하는 데 중점을 둔 컨테이너 포맷으로, 최고의 압축률을 목표로 합니다.",
      "특정 파일 또는 폴더 탐색 및 압축 해제와 같은 기능을 제공하며, 개인 데이터를 수집하지 않아 사용자 프라이버시를 강조합니다.",
      "Pack은 SQLite3 및 Zstandard를 기반으로 하는 Apache 2.0 라이선스의 오픈 소스이며 암호화, 그래픽 인터페이스 및 플랫폼 지원은 향후 계획되어 있습니다."
    ],
    "commentSummary": [
      "이 토론에서는 타르와 zip과 같은 구형 포맷을 대체하기 위한 새로운 컨테이너 포맷인 팩을 소개하며, zstd 압축, 빠른 단일 파일 압축 해제, 상호 호환성을 강조합니다.",
      "타르와 같은 기존 파일 형식은 더 나은 데이터 관리를 위해 논의된 한계에 직면해 있으며, 일부 사용자들이 지적한 한계와 단점에도 불구하고 파일 및 교환 형식으로 SQLite가 제안되었습니다.",
      "전반적으로 아카이브 형식의 복잡성, 호환성, 성능을 팩과 같은 보다 효율적이고 사용자 친화적인 형식으로 개선하는 데 중점을 두고 논의가 이루어지고 있습니다."
    ],
    "points": 141,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1711134705
  },
  {
    "id": 39792383,
    "title": "캐나다 해안에서 전례 없는 2K 지진 감지",
    "originLink": "https://www.livescience.com/planet-earth/earthquakes/2000-earthquakes-in-1-day-off-canada-coast-suggest-the-ocean-floor-is-ripping-apart-scientists-say",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792383",
    "commentBody": "",
    "originSummary": [
      "밴쿠버 섬 해안에서 하루 동안 약 2,000건의 지진이 기록되었으며, 이는 후안 데 푸카 능선의 엔데버 지점에서 해저가 갈라지면서 새로운 해양 지각이 형성되고 있음을 암시합니다.",
      "지진 활동은 해저가 늘어나면서 마그마가 상승하여 새로운 지각을 생성하는 것으로, 해저 지각 형성에 대한 귀중한 지식을 제공합니다.",
      "2011년부터 지속적인 모니터링을 통해 연구자들은 이 현상을 면밀히 연구하여 자연스러운 과정을 밝혀내고 있습니다."
    ],
    "commentSummary": [
      "캐나다 연안의 후안 데 푸카 능선에 있는 열수 분출구 근처에서 수많은 소규모 지진이 감지되었는데, 이는 20년 주기의 일부로 즉각적인 대형 지진의 위험은 없었습니다.",
      "이러한 지진의 분류와 판의 이동 및 지각의 연관성에 대한 논의에 대한 논쟁은 계속되고 있습니다.",
      "선박 연료 배출로 인한 구름 덮개 감소로 인한 해양 온난화가 기후 변화와 전 세계 기온에 영향을 미친다는 우려가 제기되고 있습니다."
    ],
    "points": 131,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1711125603
  }
]
