[
  {
    "id": 39793044,
    "title": "طائرة XB-1 من Boom أسرع من الصوت تكمل رحلتها الناجحة",
    "originLink": "https://boomsupersonic.com/flyby/inaugural-first-flight-xb1-supersonic-demonstrator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793044",
    "commentBody": "",
    "originSummary": [
      "حققت Boom Supersonic إنجازا مهما من خلال إكمال الرحلة الافتتاحية لطائرتها التجريبية XB-1 ، مما يشير إلى عودة واعدة إلى السفر الأسرع من الصوت.",
      "تشير الطائرة ، المجهزة بأحدث التقنيات والتصميم الحديث ، إلى عودة ظهور الطائرات المدنية الأسرع من الصوت ، مما يمهد الطريق لطائرة Boom's Overture الأسرع من الصوت.",
      "يثني خبراء الصناعة على البرنامج لقدرته على ابتكار السفر الأسرع من الصوت بشكل مستدام ، مما يعد ببديل نقل أسرع وأكثر صداقة للبيئة."
    ],
    "commentSummary": [
      "تشمل التغطية اختبار الطيران الأخير لشركة Boom Aerospace لطائرة XB-1 ، إلى جانب الشكوك حول أهدافها الطموحة.",
      "وتناقش التحديات في تطوير محركات الطائرات الجديدة ، وتسليط الضوء على نضالات الصين والهند في هذا المجال.",
      "كما يتم تناول الشكوك حول التطبيق العملي لمركبة الفضاء الفضائية التابعة لشركة SpaceX للسفر لمسافات طويلة ، والجدوى وإمكانات السوق للسفر الجوي التجاري الأسرع من الصوت ، والمخاوف بشأن التلوث الضوضائي والآثار البيئية."
    ],
    "points": 440,
    "commentCount": 375,
    "retryCount": 0,
    "time": 1711129553
  },
  {
    "id": 39796550,
    "title": "أمرت Google بتقديم معلومات عن مشاهدي مقاطع فيديو معينة على YouTube",
    "originLink": "https://www.forbes.com/sites/thomasbrewster/2024/03/22/feds-ordered-google-to-unmask-certain-youtube-users-critics-say-its-terrifying/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796550",
    "commentBody": "",
    "originSummary": [
      "طالبت الحكومة الفيدرالية Google بالكشف عن تفاصيل حول مشاهدي مقاطع فيديو معينة على YouTube ، مما أثار مخاوف بين المدافعين عن الخصوصية بشأن الانتهاكات الدستورية المحتملة والمخاطر على حقوق خصوصية المشاهدين الأبرياء.",
      "تعرض أوامر المحكمة طلبات إنفاذ القانون للحصول على بيانات المستخدم في التحقيقات الجنائية، وتسلط الضوء على المخاوف بشأن الخصوصية وحرية التعبير وعمليات التفتيش غير المعقولة.",
      "يحذر النقاد من أن هذه الأوامر تشير إلى نمط مقلق من الكيانات الحكومية التي تتجاوز الحدود القانونية في المراقبة الرقمية ، بينما تؤكد Google على تفانيها في حماية بيانات المستخدم ومقاومة طلبات البيانات غير العادلة."
    ],
    "commentSummary": [
      "يستكشف المقال المناقشات حول حقوق الخصوصية والقضايا الدستورية المتعلقة بإجبار Google على الكشف عن مشاهدي مقاطع فيديو محددة على YouTube ، ويتطرق إلى مواضيع مثل المراقبة الجماعية وأخلاقيات البيانات والرقابة الحكومية.",
      "مع التأكيد على حماية الخصوصية وعدم الكشف عن الهوية في العصر الرقمي ، يناقش التوازن الدقيق بين الحقوق الشخصية ومتطلبات إنفاذ القانون ومخاطر زيادة مراقبة الدولة.",
      "علاوة على ذلك ، فإنه يتناول الحلول التكنولوجية ، وتأثير الحكومة على نشر المعلومات ، وتأثيرات جمع البيانات ومراقبتها من قبل كيانات مثل Google."
    ],
    "points": 307,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1711156554
  },
  {
    "id": 39793754,
    "title": "موزيلا تنهي شراكة Onerep عبر شبكات البحث عن الأشخاص التابعة للرئيس التنفيذي",
    "originLink": "https://krebsonsecurity.com/2024/03/mozilla-drops-onerep-after-ceo-admits-to-running-people-search-networks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793754",
    "commentBody": "",
    "originSummary": [
      "تنهي موزيلا تعاونها مع Onerep ، وهي خدمة حماية الهوية المدمجة مع Firefox ، بسبب علاقات الرئيس التنفيذي بشبكات البحث عن الأشخاص المختلفة.",
      "أكد الرئيس التنفيذي لشركة Onerep مشاركته مع Nuwber ، وسيط البيانات ، مما يؤكد المخاوف بشأن تنظيم بيانات المستهلك وضرورة زيادة الإشراف.",
      "يؤكد المدافعون عن الخصوصية على أهمية الرقابة حيث تحقق KrebsOnSecurity في المزيد من الروابط بين وسطاء البيانات ، بما في ذلك الروابط مع الكيانات الروسية وممارسات الصناعة المشكوك فيها."
    ],
    "commentSummary": [
      "أنهت موزيلا تعاونها مع Onerep بسبب اعتراف الرئيس التنفيذي بالممارسات المشكوك فيها ، مما أثار محادثات حول خصوصية البيانات وآثار الشراكات على حقوق الخصوصية.",
      "وركزت المناقشات على فعالية خدمات حذف البيانات، وأهمية المعايير الأخلاقية في الأرشفة، وموثوقية التدابير الأمنية.",
      "علاوة على ذلك ، ظهرت مناقشات بشأن سمعة Mozilla و Google Chrome ، مما يسلط الضوء على ضرورة التواصل الشفاف في التحالفات التجارية."
    ],
    "points": 284,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1711134365
  },
  {
    "id": 39797176,
    "title": "عماد مستكم يتنحى عن منصبه كرئيس تنفيذي لشركة الذكاء الاصطناعي الاستقرار",
    "originLink": "https://stability.ai/news/stabilityai-announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39797176",
    "commentBody": "",
    "originSummary": [
      "عماد مستكم يتنحى عن منصبه كرئيس تنفيذي لشركة Stability الذكاء الاصطناعي للتركيز على الذكاء الاصطناعي اللامركزية. تم تعيين شان شان وونغ وكريستيان لافورتي مديرين تنفيذيين مشاركين مؤقتين.",
      "يظهر موستاك ثقته في القيادة الجديدة ومستقبل الشركة بينما يتعهد مجلس الإدارة والمستثمرون بدعم فريق Stability الذكاء الاصطناعي والتكنولوجيا والمجتمع خلال مرحلة التوسع القادمة.",
      "ويشير هذا التحول إلى تحول استراتيجي نحو الذكاء الاصطناعي اللامركزية داخل الشركة، مما يمهد الطريق للابتكارات والنمو المحتمل."
    ],
    "commentSummary": [
      "استقال عماد مستكم من منصبه كرئيس تنفيذي لشركة Stability الذكاء الاصطناعي لأن الشركة لم تستطع الاستفادة من القيمة الاقتصادية في السوق الذكاء الاصطناعي ، خاصة في تسويق الذكاء الاصطناعي توليد الصور.",
      "تم اقتراح اقتراحات ، مثل تنفيذ واجهات مدفوعة وسهلة الاستخدام واستخدام أوجه التشابه بين المشاهير لتوليد الصور لتحسين أداء الشركة.",
      "غطت المناقشة الآثار الأخلاقية ، والمتطلبات الفنية ، وقيود نموذج الذكاء الاصطناعي ، واستراتيجيات الأعمال ، والاستقرار المالي ، الذكاء الاصطناعي مفتوحة المصدر ، والخلافات داخل صناعة التكنولوجيا ، وتسليط الضوء على التحديات التي تواجهها شركات الذكاء الاصطناعي مثل Stability الذكاء الاصطناعي."
    ],
    "points": 276,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1711164797
  },
  {
    "id": 39789920,
    "title": "تحديات بناء المطارات وسط المعارضة",
    "originLink": "https://www.construction-physics.com/p/why-is-it-so-hard-to-build-an-airport",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39789920",
    "commentBody": "",
    "originSummary": [
      "يواجه بناء المطار تحديات مثل التلوث الضوضائي ، والمخاوف البيئية ، والمعارضة الحضرية ، التي يعود تاريخها إلى الشكاوى المتعلقة بضوضاء المحرك النفاث في خمسينيات القرن العشرين.",
      "حققت الجهود المبذولة للتخفيف من الضوضاء من خلال اللوائح والتكنولوجيا نجاحا محدودا على الرغم من استراتيجيات مثل تغيير مسار الرحلات وإجراءات تقليل الضوضاء.",
      "بينما تسعى المطارات جاهدة لتحقيق الكفاءة مع مدارج جديدة وطائرات أكبر ، تستمر مقاومة المجتمع لتأثيرات البناء ، مما يؤدي إلى مشاكل الازدحام المستمرة في المناطق المزدحمة على الرغم من زيادة الحركة الجوية."
    ],
    "commentSummary": [
      "تستكشف المناقشة الجوانب المختلفة لبناء المطارات وخيارات النقل والتنمية الحضرية ، مع التركيز على التحديات في بناء المطار ، وأهمية النقل ، وتنظيم المطار والمدينة.",
      "يتعمق في موضوعات مثل تعقيدات توسيع المطار ، وتوافر المساحات الخضراء ، وتفضيلات النقل المتميزة في الولايات المتحدة مقابل أوروبا ، ومعالجة العوامل التي تؤثر على قرارات المطار مثل التطبيق العملي والبيئة والوصول إلى وسائل النقل.",
      "وتناقش أمثلة على سوء إدارة المطارات، وعقبات البناء، وآثار استضافة أحداث مثل الألعاب الأولمبية على البنية التحتية، بما في ذلك مقارنة المطارات عبر المناطق واتصالها بشبكات السكك الحديدية الوطنية."
    ],
    "points": 244,
    "commentCount": 530,
    "retryCount": 0,
    "time": 1711109918
  },
  {
    "id": 39793293,
    "title": "استكشاف أهمية هدف التضخم بنسبة 2٪",
    "originLink": "https://sites.lsa.umich.edu/mje/2023/09/04/why-the-2-inflation-target/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793293",
    "commentBody": "",
    "originSummary": [
      "حدد الاحتياطي الفيدرالي معدل تضخم مستهدف بنسبة 2٪ متأثرا بالبنك المركزي النيوزيلندي في عام 1989 لتحقيق الاستقرار في الأسعار وتعزيز النمو الاقتصادي.",
      "يفضل استهداف التضخم الأعلى لردع الانكماش وتحفيز الإنفاق في فترات الانكماش الاقتصادي ، مما يؤثر على مصداقية بنك الاحتياطي الفيدرالي ويطلق دورات التضخم إذا تم تغييره.",
      "يعد تحديد هدف التضخم الصحيح أمرا حيويا للحفاظ على اقتصاد قوي ومزدهر."
    ],
    "commentSummary": [
      "يدرس النص كيف يؤثر هدف التضخم بنسبة 2٪ على القوة الشرائية للعمال ، مع التركيز على الاختلافات بين المجموعات الغنية وذات الدخل المنخفض.",
      "ويثير مخاوف بشأن دقة حسابات التضخم التي تؤثر على الفوائد والرواتب وتوزيع الثروة وتكاليف الإسكان ومستويات الديون.",
      "يتم استكشاف وجهات نظر مختلفة حول النمو الاقتصادي ، وتصور الثروة ، وقياس التقدم الاقتصادي ، ودور التضخم في عدم المساواة في الثروة ، والمزايا ، والعيوب ، واستراتيجيات الاستقرار المالي."
    ],
    "points": 223,
    "commentCount": 500,
    "retryCount": 0,
    "time": 1711131600
  },
  {
    "id": 39790365,
    "title": "تحديث Bulma CSS 1.0: ميزات جديدة وسهولة الانتقال",
    "originLink": "https://github.com/jgthms/bulma/releases/tag/1.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790365",
    "commentBody": "",
    "originSummary": [
      "تم تجديد إطار عمل Bulma إلى الإصدار 1.0.0 ، المدعوم الآن بواسطة Dart Sass ، ويضم عناصر جديدة مثل السمات ولوحات الألوان ولوادر الهيكل العظمي.",
      "تتضمن التحديثات التحول إلى متغيرات CSS من الحرفية ، مما يوفر نهجا جديدا للتخصيص من خلال متغيرات Sass.",
      "يعمل هذا الإصدار على تبسيط عملية الانتقال دون الحاجة إلى إجراء تعديلات على مقتطفات HTML ، مما يوفر المرونة لتخصيص Bulma باستخدام CSS فقط."
    ],
    "commentSummary": [
      "أطلق إطار عمل Bulma CSS مؤخرا الإصدار 1.0 ، الذي تم الإشادة به لتصميمه الموجه نحو التركيب والمكونات ، مما أثار مناقشات حول شعبيته بين شركات المقامرة والمخاوف المتعلقة بإمكانية الوصول والترخيص.",
      "يناقش المستخدمون بين Bulma والأطر الأصغر مثل Pure.css ، حيث يقدر البعض بساطة Bulma ويفضل البعض الآخر البدائل ، بما في ذلك Bootstrap ، مما يكشف عن تفضيلات متنوعة في اختيار إطار عمل CSS.",
      "تمتد المناقشات إلى المشكلات المتعلقة بوثائق Bulma ، والوضع المظلم ، وتوافق خط أنابيب البناء ، إلى جانب المحادثات حول تنفيذ وظائف Sass ، والميزات المخصصة في CSS ، والأسماء الرقمية في الترميز ، وتسليط الضوء على اهتمامات المستخدمين واهتماماتهم المختلفة."
    ],
    "points": 223,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1711113163
  },
  {
    "id": 39793912,
    "title": "OpenCat: إحداث ثورة في إنشاء الأليفة الروبوتية",
    "originLink": "https://www.petoi.com/pages/opencat-open-source-robot-pet-framework",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793912",
    "commentBody": "",
    "originSummary": [
      "OpenCat هو إطار عمل مفتوح المصدر لبناء أليفة روبوتية رباعية الأرجل ، مما يمكن الأفراد من بناء روبوتات المشي الديناميكية بتكلفة معقولة وسهولة.",
      "إنها تستخدم أجهزة الهواة ، وأجهزة التحكم المستخدمة على نطاق واسع مثل Arduino و Raspberry Pi ، ورموز التحكم مفتوحة المصدر لمهام الحركة.",
      "لا يعمل المشروع ، الذي بدأه Rongzhong Li في عام 2016 ، على تشغيل الأليفة الروبوتية التجارية مثل Nybble و Bittle فحسب ، بل يغذي أيضا مشاريع الروبوت العالمية DIY ، ويعزز التعاون ، ويقدم الموارد التعليمية ، ويثير الاهتمام بابتكارات الذكاء الاصطناعي الروبوتية وإنترنت الأشياء."
    ],
    "commentSummary": [
      "تتعمق المحادثة في تطوير الأليفة الروبوتية ، وتطرق إلى إطار عمل OpenCat ، والاستخدامات المحتملة في المراقبة والعمليات العسكرية ، وأخلاقيات الشركات الذكاء الاصطناعي ، ومقارنات التكلفة بين القطط الحقيقية والروبوتية ، والقدرة على تحمل تكاليف الرعاية الطبية للحيوانات الأليفة.",
      "الشفافية ومبادئ المصادر المفتوحة والتأملات الأخلاقية هي الموضوعات الرئيسية التي تم تسليط الضوء عليها خلال المناقشة."
    ],
    "points": 214,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1711135559
  },
  {
    "id": 39793513,
    "title": "Magick.css: CSS الحد الأدنى لتصميم ويب سهل وقابل للتخصيص",
    "originLink": "https://css.winterveil.net",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793513",
    "commentBody": "",
    "originSummary": [
      "magick.css هو إطار عمل CSS غير طبقي مستوحى من كتب قواعد TTRPG والوحشية ، ويقدم الطباعة والنماذج وعناصر الوسائط والمزيد في ملف واحد بدون JavaScript.",
      "يمكن للمستخدمين تخصيص إطار العمل بسهولة وإضافة ميزات إضافية مثل التعليقات الجانبية وترقيم الكود / ما قبل السطر ، مما يجعله متعدد الاستخدامات لمشاريع مختلفة.",
      "يمكن دمجه في المشاريع دون عناء إما من خلال CDN أو عن طريق تنزيل الملف من المستودع."
    ],
    "commentSummary": [
      "يثني المستخدمون على magick.css ، وهو إطار عمل CSS بسيط ، لأسلوب الخط والتصميم المميزين.",
      "تتضمن المناقشات مخاوف الخصوصية وتتبع المشكلات المتعلقة بالخطوط ، إلى جانب توصيات للأدوات والأنظمة الأساسية التي تركز على الخصوصية.",
      "يقدر بعض المستخدمين تصميم magick.css وميزاته ، مما يوفر ملاحظات بناءة للتحسينات المحتملة."
    ],
    "points": 207,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1711132992
  },
  {
    "id": 39796216,
    "title": "استكشاف Scarfolk: سبعينيات القرن العشرين ديستوبيا تأتي إلى الحياة",
    "originLink": "https://www.collectorsweekly.com/articles/visiting-scarfolk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39796216",
    "commentBody": "",
    "originSummary": [
      "طور ريتشارد ليتلر مدينة سكارفولك الخيالية بناء على نشأته في ضواحي بريطانيا عام 1970 ، واستكشاف الخوف وجنون العظمة باستخدام تصميمات أصيلة في سبعينيات القرن العشرين.",
      "أصبح Scarfolk شائعا ، مع خطط لمسلسل تلفزيوني بريطاني ، يعرض نظرة فريدة على التاريخ تعكس التحولات في الأعراف الاجتماعية.",
      "يتضمن إنشاء Littler رسومات تعكس العلامة التجارية للفترة ، وتتناول موضوعات مثل المراقبة والحقوق المدنية والسياسة الحالية ، والتي غالبا ما يتم الخلط بينها وبين العناصر التاريخية الحقيقية. كما تمت الإشارة إلى كتاب \"اكتشاف Scarfolk\" وحسابات وسائل التواصل الاجتماعي."
    ],
    "commentSummary": [
      "يدور النقاش حول سكارفولك ، وهي مدينة بائسة خيالية من سبعينيات القرن العشرين ، ورسم أوجه التشابه مع الأحداث الجارية في حكومة المملكة المتحدة ، وتسليط الضوء على الأفلام التعليمية المخيفة والهندسة المعمارية القاتمة.",
      "تمت الإشادة بروح الدعابة السوداء والتعليقات الاجتماعية ل Scarfolk ، مع مقارنتها بأعمال مماثلة في الولايات المتحدة ، تتضمن روابط للبضائع والكتب والمحتوى ذي الصلة.",
      "تتعمق المحادثة في القضايا المجتمعية مثل وصفات الأمفيتامين للمشاكل السلوكية المدرسية ، مما يعكس تأثير الموضوعات البائسة في وسائل الإعلام والمجتمع."
    ],
    "points": 189,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1711153273
  },
  {
    "id": 39792136,
    "title": "DryMerge: تبسيط سير العمل باستخدام أتمتة اللغة الإنجليزية البسيطة",
    "originLink": "https://news.ycombinator.com/item?id=39792136",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792136",
    "commentBody": "",
    "originSummary": [
      "DryMerge هي أداة أنشأها إدوارد وسام تعمل على أتمتة سير العمل من خلال أوامر اللغة الإنجليزية البسيطة ، مما يسمح للمستخدمين بأداء مهام مثل إضافة البيانات إلى جداول بيانات Google وإرسال الرسائل النصية.",
      "تستخدم الأداة الذكاء الاصطناعي لتفسير طلبات المستخدم ، وتبسيط أتمتة سير العمل وإزالة الحاجة إلى الإعداد اليدوي ، مع طبقة دلالية لفهم الطلبات ومستوى بيانات لتنفيذ سير العمل.",
      "يتكامل بسلاسة مع 14 خدمة شائعة ، ويمكن للمستخدمين المهتمين الوصول إليه في drymerge.com/app لتجربته."
    ],
    "commentSummary": [
      "DryMerge هي أداة سهلة الاستخدام تعمل على أتمتة سير العمل من خلال أوامر اللغة الإنجليزية البسيطة ، والتكامل مع الخدمات الشائعة وإعطاء الأولوية للبساطة للمستخدمين غير التقنيين.",
      "يقدم المستخدمون ملاحظات حول ممارسات الربط ، وتحسين الأجهزة المحمولة ، وعمليات الدمج الممكنة لتعزيز الوضوح ، مع توفر خطط اشتراك مختلفة.",
      "توظف الشركة الناشئة نماذج اللغة الكبيرة (LLMs) لتطوير DryMerge ، حيث يعبر المستخدمون عن تفاؤلهم بشأن إمكاناتها وتحدياتها ومزاياها التنافسية في قطاع الأتمتة."
    ],
    "points": 150,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1711124153
  },
  {
    "id": 39790003,
    "title": "تقديم علامة الويب: إشارة مرجعية مجانية تستند إلى النص",
    "originLink": "https://webtag.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39790003",
    "commentBody": "",
    "originSummary": [
      "Webtag هو موقع ويب مجاني للإشارات المرجعية يعتمد على النص يمكن المستخدمين من تصنيف الإشارات المرجعية بعلامات ومشاركتها ونقل الإشارات المرجعية من خدمات أخرى.",
      "يوفر إشارات مرجعية خاصة افتراضية ، وإشارة مرجعية بنقرة واحدة ، وتخزين غير محدود ، والوصول على أي جهاز متصل بالإنترنت."
    ],
    "commentSummary": [
      "يستكشف المستخدمون تطبيقات إشارات مرجعية مختلفة مثل Miitla و Webtag و Pinboard و Buku ، معربين عن اهتمامهم بالميزات المتقدمة مثل البحث الدلالي وتنظيم الذكاء الاصطناعي.",
      "تدفع المخاوف بشأن طرق الإشارات المرجعية التقليدية للمتصفح ، كما هو الحال في Firefox ، المستخدمين إلى التفكير في بدائل مثل Linkhut و Notado و Readwise و Buku.",
      "تمتد المحادثة إلى أدوات الإشارات المرجعية المستضافة ذاتيا ، باستخدام تخزين الملفات للإشارات المرجعية ، وإعادة تخصيص واجهات برمجة التطبيقات للوظائف غير التقليدية."
    ],
    "points": 145,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1711110526
  },
  {
    "id": 39793805,
    "title": "حزمة: تنسيق حاوية من الجيل التالي لضغط الملفات عالي الكفاءة",
    "originLink": "https://pack.ac/note/pack",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39793805",
    "commentBody": "",
    "originSummary": [
      "Pack هو تنسيق حاوية يركز على تعبئة الملفات بكفاءة مع ضغط عالي وتحسين الأجهزة الحديثة ، بهدف الحصول على أفضل نسبة ضغط إلى الوقت.",
      "يوفر ميزات مثل استكشاف وتفريغ ملفات أو مجلدات معينة ، مع التركيز على خصوصية المستخدم من خلال عدم جمع البيانات الشخصية.",
      "Pack مفتوح المصدر ، مرخص بموجب Apache 2.0 ، استنادا إلى SQLite3 و Zstandard ، مع التشفير والواجهة الرسومية ودعم النظام الأساسي المخطط له في المستقبل."
    ],
    "commentSummary": [
      "تقدم المناقشة حزمة تنسيق الحاوية الجديدة ، بهدف استبدال التنسيقات القديمة مثل tar و zip ، مع التركيز على ضغط zstd ، وتفريغ ملف واحد سريع ، والتوافق المتبادل.",
      "تمت مناقشة تنسيقات الملفات الحالية مثل tar Face القيود من أجل إدارة البيانات بشكل أفضل ، مع اقتراح SQLite كتنسيق ملف وتبادل على الرغم من القيود والعيوب التي لاحظها بعض المستخدمين.",
      "بشكل عام ، تركز المحادثة على تعزيز التعقيد والتوافق والأداء لتنسيقات الأرشيف نحو تنسيق أكثر كفاءة وسهولة في الاستخدام مثل Pack."
    ],
    "points": 141,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1711134705
  },
  {
    "id": 39792383,
    "title": "اكتشاف زلازل غير مسبوقة بقوة 2K قبالة سواحل كندا",
    "originLink": "https://www.livescience.com/planet-earth/earthquakes/2000-earthquakes-in-1-day-off-canada-coast-suggest-the-ocean-floor-is-ripping-apart-scientists-say",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39792383",
    "commentBody": "",
    "originSummary": [
      "تم تسجيل ما يقرب من 2000 زلزال قبالة ساحل جزيرة فانكوفر في يوم واحد ، مما يشير إلى تكوين قشرة محيطية جديدة في موقع إنديفور على سلسلة جبال خوان دي فوكا مع انتشار قاع البحر.",
      "ويعزى النشاط الزلزالي إلى امتداد قاع البحر، مما يمكن الصهارة من الصعود وتوليد قشرة جديدة، مما يوفر معرفة قيمة عن تكوين قشرة المحيطات.",
      "تسمح المراقبة المستمرة منذ عام 2011 للباحثين بدراسة الظاهرة عن كثب ، وإلقاء الضوء على هذه العملية الطبيعية."
    ],
    "commentSummary": [
      "تم اكتشاف العديد من الزلازل الصغيرة بالقرب من الفتحات الحرارية المائية على سلسلة جبال خوان دي فوكا قبالة سواحل كندا ، وهي جزء من دورة مدتها 20 عاما دون وجود خطر فوري لوقوع حدث كبير.",
      "يحيط النقاش بتصنيف هذه الزلازل ، بالإضافة إلى المناقشات حول حركة الصفائح والارتباطات التكتونية.",
      "تنشأ مخاوف بشأن ارتفاع درجة حرارة المحيطات المرتبطة بتناقص الغطاء السحابي الناجم عن انبعاثات وقود السفن ، مما يؤثر على تغير المناخ ودرجات الحرارة في جميع أنحاء العالم."
    ],
    "points": 131,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1711125603
  }
]
