[
  {
    "title": "Ethereum-Based Blockchain Kinto Secures $5 Million Funding to Develop Compliant Layer-2 Network for DeFi Access",
    "originLink": "https://www.coindesk.com/business/2023/11/15/blockchain-startup-kinto-plans-first-kycd-ethereum-layer-2-blockchain-after-raising-5m/",
    "originBody": "Finance Blockchain Startup Kinto Plans 'First KYC'd' Ethereum Layer-2 Network After Raising $5M Ethereum layer 2 Kinto network features native know-your-customer (KYC) checks and investor accreditation mechanism to help onboard regulated financial institutions. By Krisztian Sandor Nov 15, 2023 at 12:00 p.m. UTC Ramon Recuero, Kinto CEO and co-founder (Kinto) 10 Years of Decentralizing the Future May 29-31, 2024 - Austin, Texas The biggest and most established global hub for everything crypto, blockchain and Web3. Register Now Ethereum-focused blockchain project Kinto disclosed it has raised $5 million in fundraising rounds this year to develop a layer-2 network that's fully compliant with anti-money-laundering laws, aiming to connect financial institutions and real-world assets with decentralized finance (DeFi) rails. The project is built using the OP Stack, which is a set of software tools created by the developer OP Labs that companies can use to easily spin up their own customized layer-2 networks. The technology derives from Optimism, the second-biggest layer-2 network atop Ethereum. Coinbase, the big U.S. crypto exchange, famously relied on OP Stack to build its own layer-2 blockchain, Base. Kinto secured $1.5 million in a pre-seed investment earlier this year from Kyber Capital Crypto, according to a press release on Tuesday. It received another $3.5 million recently in a round led by Kyber Capital Crypto, Spartan Group and Parafi. SkyBridge Capital, Kraynos, Soft Holdings, Deep Ventures, Modular, Tane and Robot Ventures also participated in the round. The Kinto network features native know-your-customer (KYC) checks – a type of anti-money-laundering prevention – and investor accreditation mechanism to help onboard regulated financial institutions – solving a major headache for them if they want to access blockchain-based protocols, Kinto co-founder Alan Keegan said in an interview with CoinDesk. According to the press release, Kinto becomes the \"first KYC'd layer 2 (L2) blockchain capable of supporting both modern financial institutions and decentralized protocols.\" Kinto litepaper (Kinto) Only KYC'd entities can transact on the network, so this way Kinto can eliminate anonymous exploits and scams that proliferate on DeFi platforms, Keegan added. The network also offers insurance and developer incentives to build applications from transaction fees. \"We believe that a fully KYC'd layer 2 on top of Ethereum is an inevitability, and we have extremely strong conviction that Kinto is the right team to execute this vision,\" Alex Klokus, co-founder and managing partner at Kyber Capital Crypto, said in a statement. Kinto plans to open the onboarding and KYC process later this month. Edited by Bradley Keoun. A D V E R T I S E M E N T A D V E R T I S E M E N T DISCLOSURE Please note that our privacy policy, terms of use, cookies, and do not sell my personal information has been updated. The leader in news and information on cryptocurrency, digital assets and the future of money, CoinDesk is a media outlet that strives for the highest journalistic standards and abides by a strict set of editorial policies. CoinDesk is an independent operating subsidiary of Digital Currency Group, which invests in cryptocurrencies and blockchain startups. As part of their compensation, certain CoinDesk employees, including editorial employees, may receive exposure to DCG equity in the form of stock appreciation rights, which vest over a multi-year period. CoinDesk journalists are not allowed to purchase stock outright in DCG. Krisztian Sandor Krisztian Sandor is a reporter on the U.S. markets team focusing on stablecoins and institutional investment. He holds BTC and ETH. Follow @sndr_krisztian on Twitter Learn more about Consensus 2024, CoinDesk’s longest-running and most influential event that brings together all sides of crypto, blockchain and Web3. Head to consensus.coindesk.com to register and buy your pass now. Read more about Decentralized Finance DeFi KYC Optimism Ethereum Real World Assets Layer 2s",
    "originSummary": [
      "Blockchain startup Kinto has raised $5 million in funding to develop a fully compliant layer-2 network on Ethereum.",
      "The network will include native KYC checks and an investor accreditation mechanism to facilitate access for regulated financial institutions to DeFi platforms.",
      "Kinto aims to prevent anonymous exploits and scams by only allowing transactions from KYC'd entities on the network."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "Blockchain.com Raises $110M in Funding Round, Valuation Cut in Half",
    "originLink": "https://cointelegraph.com/news/blockchaincom-series-e-round-halves-valuation",
    "originBody": "TOM MITCHELHILL 14 HOURS AGO Blockchain.com $110M funding round halves its 2022 valuation: Report Despite new investment in the crypto exchange, Blockchain.com’s valuation has more than halved from its $14-billion peak. 1987 Total views 59 Total shares Listen to article 0:00 NEWS Join us on social networks Crypto exchange and wallet provider Blockchain.com closed a $110-million Series E financing round, an investment that more than halves its previous 2022 valuation of $14 billion. In a Nov. 14 blog post, Blockchain.com said the closing of its Series E round was led by the United Kingdom-based venture capital firm Kingsway Capital. It also saw participation from Baillie Gifford, Lakestar and Coinbase Ventures, among others. A Nov. 14 Bloomberg report citing sources familiar with the matter said the $110-million round places Blockchain.com at less than half of its $14 billion valuation from March 2022. On March 30, 2022, Blockchain.com closed a funding round that saw its valuation spike from $5.2 billion to $14 billion, less than two months before the collapse of Do Kwon’s Terra ecosystem triggered a liquidity cascade that bankrupted hedge fund Three Arrows Capital (3AC) and a slew of high profile crypto lenders. Blockchain.com’s March 2022 funding round was led by global venture capital firm Lightspeed Ventures and Baillie Gifford, an investment management firm renowned for its early involvement in growth stocks such as Tesla. Related: Goldman Sachs leads $95M funding round for blockchain payment firm Fnality: Report While the new investment saw the firm’s valuation dip, the funding activity hints at a newfound investment appetite for crypto firms, buoyed by a continued uptick in digital asset prices more broadly. The broader market enthusiasm for crypto assets is tied to multiple pending applications for spot Bitcoin exchange-traded fund products from financial firms such as BlackRock and Fidelity. Bitcoin (BTC) is currently up 116% in the last year, while other major cryptocurrencies such as Ether (ETH) and Solana (SOL) are up 61% and 300%, respectively, over the last 12 months. Founded in 2011, Blockchain.com has 37 million verified users, 82 million wallets and over $1 trillion in total transaction value across its platform. Magazine: Exclusive — 2 years after John McAfee’s death, widow Janice is broke and needs answers #Cryptocurrencies #Business #Funding #Venture Capital #Investments #Adoption #Cryptocurrency Exchange Add reaction READ MORE 3 theses that will drive Ethereum and Bitcoin in the next bull market History tells us we’re in for a strong bull market with a hard landing Crypto reshapes the American dream for younger generations: Report",
    "originSummary": [
      "Blockchain.com, a crypto exchange and wallet provider, has raised $110 million in funding.",
      "The funding round led by Kingsway Capital and involved participation from Baillie Gifford, Lakestar, and Coinbase Ventures.",
      "The funding round has resulted in a valuation decrease from $14 billion to less than half, reflecting the growing investment appetite in the crypto industry."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "Record High Exposure to Bitcoin ETPs as ETF Approval Deadline Approaches",
    "originLink": "https://www.theblock.co/post/263079/blockchain-com-raises-110-million-in-series-e-funding",
    "originBody": "Bitcoin ETP exposure hits all-time highs as approval window for spot ETFs nears end: K33 November 15, 2023, 8:22AM EST MARKET UPDATES",
    "originSummary": [
      "The exposure to Bitcoin exchange-traded products (ETPs) has reached a record high.",
      "This surge comes as the deadline for approving Bitcoin exchange-traded funds (ETFs) approaches.",
      "The growing interest in Bitcoin ETPs indicates a strong demand for regulated investment vehicles tied to cryptocurrency."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "UBS, SBI, and DBS Utilize Blockchain for Cross-Border Repo Transactions",
    "originLink": "https://www.ledgerinsights.com/ubs-sbi-dbs-blockchain-cross-border-repo/",
    "originBody": "Capital markets • News UBS, SBI, DBS use blockchain for cross border repo 5 hours ago by Ledger Insights As part of Singapore’s Project Guardian tokenization trials, UBS, SBI and DBS Bank executed a repurchase transaction (repo) of a natively issued digital bond on a public blockchain. The transactions spanned three jurisdictions, Japan, Singapore and Switzerland. Regulators are still wary about the institutional use of public blockchain. One of the aims of Project Guardian is to show what’s possible. Additionally, this transaction demonstrated real-time atomic settlement and capital efficiencies. “With this pioneering transaction, we proved the feasibility of executing a fully automated and instantly settled transaction across several jurisdictions by leveraging a public DLT network under a strict compliance framework,” said Mike Dargan, UBS Group’s Chief Operations and Technology Officer. Repo is widely used by banks for short term finance in which they sell a bond and agree to repurchase it a day or week later. In this transaction, a JPY bond was natively issued on a public blockchain using the UBS Tokenize platform. The settlement was instant using a JPY stablecoin issued by SBI’s Shinsei Trust & Banking. The repo transaction involved borrowing Japanese yen against the bond, with the proceeds used to buy more bonds. Eventually, it was unwound and the bond was redeemed. That part of the process – paying the principal and interest at maturity were all executed on chain. Hence the entire lifecycle took place on the public blockchain. Fernando Luis Vázquez Cao, CEO of SBI Digital Asset Holdings (SBI DAH) said the transactions were “an example of the strength of partnerships SBI DAH has with large global institutions and across the SBI group, with SBI SECURITIES as counterparty to the repo transaction and Shinsei Trust & Banking as the issuer of JPY stablecoin.” As an aside, Japan supports different types of stablecoins, including those directly issued by a bank or ones issued by a trust bank on behalf of an issuer holding the reserve assets in trust. UBS and SBI tokenization activities UBS Asset Management conducted another pilot under Project Guardian for a tokenized money market fund as previously reported. This involved a collaboration with SBI Digital Markets. Meanwhile, SBI has a wide array of blockchain activities. One of the features of blockchain is they are global and linking jurisdictions is part of SBI’s goals. Hence this Project Guardian use case’s international dimension is typical. SBI recently invested in Standard Chartered’s Zodia Custody. Plus, Zodia formed a digital asset custody joint venture with SBI DAH in Japan, SBI Zodia Custody. SBI Digital Markets provides advisory, tokenization and custody services. And AsiaNext is a joint venture with Switzerland’s SIX. With an institutional focus, it aims to create cross broder secondary markets for crypto and digital securities. You will note there was little mention of DBS Bank. Because of several banking outages, the Monetary Authority of Singapore has banned DBS from participating in certain activities for six months, including innovation. Image Copyright: Composite Ledger Insights blockchain cross border DBS Bank digital assets distributed ledger DLT Monetary Authority of Singapore Project Guardian repo SBI SBI Digital Asset Singapore stablecoin tokenization UBS FacebookXRedditEmailLinkedInWhatsApp",
    "originSummary": [
      "UBS, SBI, and DBS Bank have successfully completed a digital bond repurchase transaction using a public blockchain in Singapore's Project Guardian tokenization trials.",
      "The transaction involved parties in Singapore, Japan, and Switzerland, demonstrating real-time settlement and capital efficiencies.",
      "The use of public blockchain for institutional purposes is still subject to caution from regulators, but this transaction aims to showcase its potential."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "Shrapnel: The Game Changer for First-Person Shooters with Transmedia and Blockchain Integration",
    "originLink": "https://www.cointrust.com/market-news/shrapnel-revolutionizing-first-person-shooters-through-transmedia-and-blockchain",
    "originBody": "Market NewsNovember 15, 2023 by Kelly Cromley Shrapnel: Revolutionizing First-Person Shooters through Transmedia and Blockchain The landscape of first-person shooter games is undergoing a significant transformation with the advent of Shrapnel, a pioneering blockchain-driven transmedia experience. Shrapnel seamlessly integrates comics, live-action shorts, and interactive gameplay, ushering players into an immersive and enriching gaming realm. Transmedia Storytelling: Crafting Complexity and Engagement Shrapnel is at the forefront of transmedia storytelling, where narratives unfold across various platforms and media formats. Marc Mercuri, Shrapnel’s Chief Blockchain Officer, underscores the significance of transmedia storytelling in elevating player engagement. Through diverse entry points like reading comics or watching videos, Shrapnel establishes a profound connection between players and the unfolding narrative. In today’s gaming milieu, where players seek narratives transcending the game itself, mediocre storytelling or game development falls short. Building on Success: Lessons from Franchises Successful franchises such as Halo and Assassin’s Creed illustrate the impact of transmedia storytelling. Expanding narratives through novels, movies, and comics not only brings players closer to the game world but also captivates a broader audience beyond the gaming community. Challenges of Transmedia Gaming: Coordination and Cohesion Creating a transmedia gaming universe like Shrapnel poses challenges. Coordinating a complex story across multiple platforms demands meticulous planning. Each story element must uniquely contribute to the overarching narrative while providing a satisfying standalone experience. Shrapnel confronts these challenges by incorporating a series of comics and live-action shorts delving into the origins of its world and characters. Utilizing a virtual production stage akin to techniques seen in shows like The Mandalorian, Shrapnel seamlessly blends game assets with live-action elements, delivering an immersive experience. Blockchain Integration: Empowering Creators and Players Shrapnel distinguishes itself with the incorporation of blockchain technology. The game leverages blockchain to empower creators and enable players to create and trade unique in-game items like stickers and skins. Shrapnel’s assets are designed to be transferable and tradable, providing players with complete ownership and control over their virtual possessions. Shrapnel’s Impact: A New Era in First-Person Shooters In conclusion, Shrapnel heralds a new era for first-person shooter games, converging transmedia storytelling and blockchain technology to craft a genuinely immersive and interconnected gaming experience. By embracing this innovative approach, developers can cultivate profound connections with players and construct expansive, immersive worlds extending far beyond the confines of the game itself.",
    "originSummary": [
      "Shrapnel is a groundbreaking transmedia experience in the first-person shooter genre, integrating comics, live-action shorts, and interactive gameplay for an immersive gaming realm.",
      "Transmedia storytelling is crucial for player engagement, as seen in successful franchises like Halo and Assassin’s Creed. Shrapnel addresses challenges in creating a transmedia gaming universe through meticulous planning and a virtual production stage.",
      "Shrapnel stands out by integrating blockchain technology, giving creators and players complete ownership and control over in-game items. This marks a new era in first-person shooters, offering a truly immersive and interconnected gaming experience."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "Nanotech Wearable Raises $5.1 Million to Fight Cardiovascular Disease",
    "originLink": "https://techfundingnews.com/amid-crypto-winter-blockchain-com-scoops-110m-but-at-a-lower-valuation/",
    "originBody": "June 13, 2023 World’s smallest wearable rakes in $5.1M funding to combat cardiovascular diseasebyVignesh R",
    "originSummary": [
      "A wearable device has obtained $5.1 million in funding for combating cardiovascular disease.",
      "The device is recognized as the world's smallest wearable and focuses on early detection and prevention of cardiovascular diseases."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  },
  {
    "title": "Blockchain.com Raises $110M Funding at Lower Valuation: Strategic Financing",
    "originLink": "https://blockworks.co/news/blockchain-com-raise-110m",
    "originBody": "home news Business Blockchain.com raises $110M funding round at lower valuation: BBG The round was reportedly led by Kingsway, with Lightspeed, Baillie Gifford and Lakestar also taking part by Michael McSweeney / November 14, 2023 09:52 pm photo_gonzo/Shutterstock modified by Blockworks share Crypto exchange and wallet service Blockchain.com has reportedly raised a $110 million funding round. The Series E round was led by Kingsway, which led a funding round for the company in October 2022, according to Bloomberg. The outlet characterized the funding round as “strategic financing.” Blockchain.com scored a $14 billion valuation in an early 2022 funding round, as Bloomberg reported at the time. According to the outlet, the new Kingsway-led round was raised at “less than half” of that amount. The potential for a down round — wherein a company raises at a valuation lower than a previous fundraise — was previously reported by Bloomberg. With the fresh capital in hand, Blockchain.com has raised as much as $600 million since its founding in 2011, according to Crunchbase data. Lightspeed Venture Partners, Coinbase Ventures, Lakestar and Baillie Gifford also took part in the round. Lightspeed Venture Partners led the early 2022 deal. Baillie Gifford, an early backer of Tesla, contributed $100 million to Blockchain.com’s $300 million Series C round in 2021. Don’t miss the next big story – join our free daily newsletter. Tags Blockchain.com Funding",
    "originSummary": [
      "Blockchain.com has raised $110 million in a funding round led by Kingsway, with participation from Lightspeed, Baillie Gifford, and Lakestar.",
      "The funding round is described as \"strategic financing\" and values the company at \"less than half\" of its previous valuation of $14 billion in early 2022.",
      "This brings the total funding raised by Blockchain.com since its founding in 2011 to $600 million."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700054572134
  }
]
