[
  {
    "id": 42102506,
    "title": "IMG_0416",
    "originLink": "https://ben-mini.github.io/2024/img-0416",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42102506",
    "commentBody": "",
    "originSummary": [
      "بين عامي 2009 و2012، تضمنت أجهزة آيفون وآيبود تاتش من أبل خيار \"الإرسال إلى يوتيوب\"، مما أدى إلى زيادة كبيرة في تحميلات يوتيوب بنسبة 1700% في أوائل عام 2009. - سمحت هذه الميزة للمستخدمين بتحميل الفيديوهات مباشرة من تطبيق الصور، مما نتج عنه ملايين الفيديوهات بعناوين افتراضية مثل \"IMG_XXXX\"، مقدمة لمحات حقيقية وغير محررة عن الحياة اليومية. - أزالت أبل هذه الميزة في عام 2012، لكن الفيديوهات تبقى كخلاصة اجتماعية خامة وأصيلة، تعرض لحظات متنوعة وصريحة من تلك الحقبة."
    ],
    "commentSummary": [
      "موقع Astronaut.io هو موقع يعرض مقاطع فيديو حديثة على يوتيوب ذات مشاهدات منخفضة وأسماء ملفات افتراضية، مما يوفر للمستخدمين لمحة عن محتوى عالمي متنوع وغير محرر.",
      "تستحضر المنصة الحنين إلى عصر الإنترنت المبكر، مما يثير النقاشات حول شبكة أقل تجارية ومخاوف الخصوصية.",
      "تستكشف المحادثات أيضًا تطور وسائل التواصل الاجتماعي، وتأثير الخوارزميات على مصداقية المحتوى، والمقارنات مع المنصات السابقة مثل بيريسكوب ويوتيوب في بداياته."
    ],
    "points": 1892,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1731271533
  },
  {
    "id": 42105869,
    "title": "إعادة بناء Visual Basic 6 باستخدام C# - متكامل مع مصمم النماذج وبيئة التطوير المتكاملة في المتصفح",
    "originLink": "https://bandysc.github.io/AvaloniaVisualBasic6/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42105869",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم إعادة إنشاء Visual Basic 6 بلغة C# مع مصمم نماذج وبيئة تطوير متكاملة (IDE) يمكن الوصول إليها من خلال متصفح الويب، مما أثار الحنين بين المطورين الذين بدأوا مع VB6.",
      "يعرض المشروع قدرات Avalonia، مما يمكّن التطبيق من العمل على منصات متعددة، بما في ذلك الويب عبر WebAssembly، مسلطًا الضوء على التطور من أدوات البرمجة البسيطة إلى المعقدة.",
      "تعكس المناقشة التوازنات بين بساطة بيئات البرمجة المرئية في الماضي والقيود التي فرضتها على إنشاء التطبيقات الديناميكية."
    ],
    "points": 397,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1731319330
  },
  {
    "id": 42105190,
    "title": "أرسلت حزمة إيثرنت",
    "originLink": "https://github.com/francisrstokes/githublog/blob/main/2024%2F11%2F1%2Fsending-an-ethernet-packet.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42105190",
    "commentBody": "",
    "originSummary": [
      "تناقش مدونة الكاتب رحلته في إنشاء مكدس TCP/IP من الصفر على متحكم دقيق، باستخدام STM32F401 ورقاقة W5100 تحديدًا.",
      "تضمنت التحديات الرئيسية مشكلات في الاتصال عبر SPI ومشكلات في التوقيت، والتي تم حلها من خلال إعادة توجيه الاتصالات وإضافة تأخيرات، على التوالي.",
      "يؤكد المؤلف على أهمية تصحيح الأخطاء كعملية علمية، باستخدام أدوات مثل Wireshark ونصوص Python المخصصة لتحديد وإصلاح أخطاء الشيفرة، مما يؤدي إلى نجاح في نقل الحزم."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على أهمية استكشاف وإنشاء الأدوات في تطوير البرمجيات، على الرغم من أن بعض البيئات تثبط ذلك بسبب العمليات الصارمة مثل JIRA.",
      "يفحص مفهوم \"المطورين 10x\"، الذين يُنظر إليهم بشكل مختلف من قبل المديرين ومصممي الأنظمة، مما يشير إلى وجود فجوة في فهم قيمتهم.",
      "تتضمن المحادثة رؤى تقنية في الشبكات، مثل بناء مكدس TCP/IP من الصفر واستخدام المتحكمات الدقيقة مثل STM32 وRP2040، مع التأكيد على أهمية فهم الأساسيات في التكنولوجيا."
    ],
    "points": 279,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1731310528
  },
  {
    "id": 42103257,
    "title": "إغلاق شبكة 3G في أستراليا - لماذا تم حظر هاتفك 4G/5G الآن",
    "originLink": "https://medium.com/@jamesdwho/australias-3g-shutdown-why-your-4g-5g-phone-is-now-blocked-5900cd5361e2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42103257",
    "commentBody": "",
    "originSummary": [
      "تسبب إغلاق شبكة الجيل الثالث في أستراليا في اضطرابات كبيرة، مما منع العديد من هواتف الجيل الرابع والخامس من إجراء المكالمات، بما في ذلك المكالمات الطارئة، بسبب سوء الإدارة ونقص الرقابة الحكومية. - الانتقال، الذي تأخر في البداية لأسباب تتعلق بالسلامة، ترك العديد من المستهلكين غير مستعدين، مما أبرز مشكلات في التوافق والتوحيد القياسي لتقنية VoLTE (الصوت عبر LTE)، مما أثر على السكان المحليين والسياح على حد سواء. - وُجهت انتقادات للحكومة وشركات الاتصالات بسبب تعاملهم مع الوضع، حيث يواجه المستهلكون تكاليف عالية وخيارات محدودة لحل المشكلة."
    ],
    "commentSummary": [
      "تسبب إغلاق شبكة 3G في أستراليا في حدوث اضطرابات، حيث لم تتمكن بعض هواتف 4G/5G من إجراء المكالمات بسبب متطلبات مكالمات الطوارئ.",
      "لقد أثرت الانتقالية على أنظمة النقل العام والبنية التحتية التي اعتمدت على تقنية الجيل الثالث، مما أثار مخاوف بشأن الإشراف التنظيمي غير الكافي والاتصالات.",
      "تؤكد الحالة على التحديات المتمثلة في موازنة التقدم التكنولوجي مع احتياجات المستهلكين وسلامتهم، مما يتناقض مع مطلب المملكة المتحدة لدعم VoLTE لتجنب مشكلات مماثلة."
    ],
    "points": 247,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1731280233
  },
  {
    "id": 42104762,
    "title": "هددت شركة آبل العمال بسبب حديثهم عن الأجور والعمل عن بُعد، وفقًا لما وجهته السلطات الفيدرالية.",
    "originLink": "https://www.mercurynews.com/2024/11/06/apple-threatened-workers-over-talk-about-pay-remote-work-feds-charge/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42104762",
    "commentBody": "",
    "originSummary": [
      "تم تقديم اتهامات فيدرالية ضد شركة آبل، تزعم أن الشركة هددت الموظفين الذين ناقشوا الأجور وظروف العمل عن بُعد. - تشير شير سكارليت، وهي مهندسة برمجيات، إلى أنها أُجبرت على مغادرة آبل، مما يبرز قضايا محتملة مع سياسات الشركة الداخلية بشأن مناقشات الأجور. - أفاد مدير بأنه أبلغ موظفًا أن آبل تثني عن المحادثات حول الأجور أو المساواة في الأجور، مما يثير مخاوف بشأن الشفافية وحقوق الموظفين."
    ],
    "commentSummary": [
      "اتهمت السلطات الفيدرالية شركة آبل بتهديد الموظفين فيما يتعلق بمناقشات حول الأجور والعمل عن بُعد، مما أدى إلى نزاع قانوني. - أثارت القضية نقاشات حول حقوق الموظفين في مناقشة القضايا المتعلقة بالعمل مقابل السيطرة المؤسسية على مثل هذه المناقشات على منصاتهم. - يبرز هذا الوضع التوتر المستمر بين حقوق العمال والسياسات المؤسسية في صناعة التكنولوجيا."
    ],
    "points": 233,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1731302940
  },
  {
    "id": 42104224,
    "title": "تقنية Krita RGBA – إحياء المعدن الواقعي في الفن مفتوح المصدر",
    "originLink": "https://github.com/Draneria/Metallics-by-Draneria_Krita-Brushes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42104224",
    "commentBody": "",
    "originSummary": [
      "تقدم نسخة كريتا 4.2 وما فوقها رؤوس فرشاة RGBA، مما يتيح تأثيرات رسم ثلاثية الأبعاد غير متوفرة في أدوبي فوتوشوب. يمكن لهذه الرؤوس محاكاة اتجاه الضوء، مما يمنح ضربات الفرشاة مظهرًا ثلاثي الأبعاد، مما يعزز من إنشاء الفن الرقمي. تم تطوير مجموعة جديدة من الفرش المعدنية لفنانين البرمجيات الحرة والمفتوحة المصدر (FOSS) للتجربة، على الرغم من أن المبدع يشير إلى احتمالية وجود أخطاء في المستودع بسبب قلة خبرته مع GitHub."
    ],
    "commentSummary": [
      "تقدم نسخة كريتا 4.2 وما فوقها رؤوس فرشاة RGBA، مما يسمح للفنانين بإنشاء ضربات فرشاة بمظهر ثلاثي الأبعاد عن طريق محاكاة اتجاه الضوء، وهي ميزة غير موجودة في فوتوشوب.",
      "تم تطوير مجموعة جديدة من الفُرَش المعدنية التي تستخدم هذه التقنية، مما يشجع الفنانين الذين يستخدمون البرمجيات الحرة والمفتوحة المصدر (FOSS) على تجربتها.",
      "لقد لاقت الفُرَش، المستوحاة من عمل Memileo مع برنامج Blender، استحسان المجتمع، مما يبرز إمكاناتها في تعزيز الإبداع في الفن الرقمي."
    ],
    "points": 213,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1731293126
  },
  {
    "id": 42105098,
    "title": "تكشف السلوكيات عن استخدام أدوات متطورة و\"مزاح\" محتمل بين الفيلة",
    "originLink": "https://www.science.org/content/article/elephant-learned-use-hose-shower-then-her-rival-sought-revenge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42105098",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تظهر الأفيال استخدامًا متقدمًا للأدوات وسلوكيات عاطفية، مثل استخدام الخراطيم للاستحمام والتعبير عن الامتنان أو الاحتفاظ بالضغائن.",
      "توضح الحكايات من جنوب الهند أن الأفيال تترك هدايا لمنقذها وتسعى للانتقام من الأفراد المرتبطين بالصيد الجائر، مما يبرز تفاعلاتها الاجتماعية المعقدة.",
      "تتحدى هذه السلوكيات الفكرة القائلة بأن البشر يتميزون بتعقيد فريد، مما يشير إلى فهم أوسع لذكاء ووعي الحيوانات."
    ],
    "points": 186,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1731309423
  },
  {
    "id": 42102262,
    "title": "MdBook - أداة سطر الأوامر لإنشاء الكتب باستخدام Markdown",
    "originLink": "https://rust-lang.github.io/mdBook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42102262",
    "commentBody": "",
    "originSummary": [
      "mdBook هو أداة سطر أوامر مصممة لإنشاء كتب باستخدام Markdown، وهي مناسبة للتوثيق والدروس والمواد التعليمية.",
      "يتضمن ميزات مثل البحث المدمج، تمييز الصيغة، السمات القابلة للتخصيص، ويدعم تنسيقات إخراج متعددة، مما يعزز تجربة المستخدم والمرونة.",
      "مكتوب بلغة Rust، يعد mdBook مفتوح المصدر، مما يضمن السرعة والأمان ومساهمات المجتمع، مع توفر شفرته على GitHub تحت رخصة Mozilla العامة الإصدار 2.0."
    ],
    "commentSummary": [
      "MdBook هو أداة سطر أوامر مصممة لإنشاء الكتب باستخدام Markdown، وغالبًا ما تُستخدم لبناء مواقع توثيق.",
      "Typst هو بديل أسرع لـ LaTeX، مناسب لتنسيق الأوراق البحثية، لكنه يفتقر حاليًا إلى دعم الويب، وهو ما يمثل قيدًا كبيرًا للعديد من المستخدمين.",
      "من المتوقع أن يكون هناك مخرجات HTML لـ Typst في المستقبل، بينما تُعتبر أدوات مثل Zola وHugo وJekyll شائعة للمدونات الثابتة المعتمدة على Markdown، ويوصى باستخدام Asciidoctor وAntora لإنشاء الكتب نظرًا لميزاتها المتقدمة في التنسيق."
    ],
    "points": 177,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1731268858
  },
  {
    "id": 42102235,
    "title": "هل يتم عرقلة الطباعة ثلاثية الأبعاد بسبب براءة اختراع غير صالحة؟",
    "originLink": "https://news.ycombinator.com/item?id=42102235",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42102235",
    "commentBody": "",
    "originSummary": [
      "تظهر الأجزاء المنتجة باستخدام عملية تصنيع الخيوط المنصهرة (FFF) قوة متباينة بسبب التصاق الطبقات غير المثالي، مما يؤثر على سلامتها الهيكلية. توفر براءة اختراع منتهية الصلاحية لشركة Stratasys من عام 1997 طريقة للتخفيف من هذه المشكلة، ومع ذلك لم يتم اعتمادها في برامج التقطيع مفتوحة المصدر على الرغم من كونها في المجال العام منذ عام 2017. يبدو أن براءة اختراع لعام 2023 تكرر ادعاءات عام 1997، مما قد يكون قد تم منحها عن طريق الخطأ، مما يبرز فرصة لتعزيز قوة الطباعة للمستخدمين."
    ],
    "commentSummary": [
      "تواجه عملية تصنيع الخيوط المنصهرة (FFM) في الطباعة ثلاثية الأبعاد مشاكل في القوة بسبب ضعف التصاق الطبقات.",
      "قدمت براءة اختراع لشركة ستراتاسيس في عام 1997، والتي انتهت صلاحيتها الآن، حلاً محتملاً، ولكن قد تكون براءة اختراع مشابهة في عام 2023 قد مُنحت عن طريق الخطأ، مما يعقد تبنيها.",
      "تسلط الحالة الضوء على العيوب المحتملة في نظام براءات الاختراع، حيث قد تقوم الشركات بتسجيل براءات اختراع لاختراعات واضحة، مما يؤدي إلى تحديات قانونية ويستلزم تقديم المشورة القانونية للأطراف المتضررة."
    ],
    "points": 174,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1731268560
  },
  {
    "id": 42104531,
    "title": "كمبيوتر افتراضي بنظام ويندوز 3.11",
    "originLink": "https://pieter.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42104531",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تعكس مناقشة على موقع Hacker News بساطة وتصميم واجهة المستخدم الرسومية الرمادية لنظام Windows 3.11، وتتناقض مع الواجهات الحديثة الأكثر تعقيدًا.",
      "يعبر المشاركون عن الحنين إلى وضوح وكفاءة الأنظمة القديمة، بينما يعترفون بالتقدم في تصميم أنظمة التشغيل الحديثة.",
      "تشمل المحادثة مواضيع مثل إمكانية الوصول، وتطور تصميم واجهة المستخدم (UI)، وإمكانية استخدام الثيمات لمحاكاة الطابع القديم في البرمجيات الحالية."
    ],
    "points": 149,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1731298085
  },
  {
    "id": 42104144,
    "title": "مرحبًا بكم في إدارة الإطفاء في القارة القطبية الجنوبية",
    "originLink": "http://www.antarcticfire.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42104144",
    "commentBody": "",
    "originSummary": [
      "يوفر قسم الإطفاء في القارة القطبية الجنوبية (AFD) خدمات الإطفاء والإنقاذ في القارة القطبية الجنوبية، داعمًا العمليات العلمية في محطة ماكموردو، ومحطة أموندسن-سكوت، ومطارات القوات الجوية الأمريكية. يعمل AFD في ظل ظروف قاسية جنوب خط العرض 60°، مع فريق من الأفراد المتنوعين والمثابرين، مقدماً أدواراً مثل رجل إطفاء/مسعف وموزع طوارئ. الموقع معلوماتي وليس مرتبطًا رسميًا بمؤسسة العلوم الوطنية (NSF)، أو برنامج الولايات المتحدة في القارة القطبية الجنوبية (USAP)، أو عقد دعم القارة القطبية الجنوبية لشركة لوكهيد مارتن (ASC)."
    ],
    "commentSummary": [
      "تعمل إدارة الإطفاء في القارة القطبية الجنوبية في البيئة النائية لأنتاركتيكا، وتحديدًا في محطة ماكموردو، حيث تمتلك شركة أمنتوم عقود مكافحة الحرائق.",
      "على الرغم من الظروف الجليدية، يمكن أن تحدث الحرائق بسبب الأنشطة البشرية، وتستخدم المحطة مطفآت الحريق الكيميائية الجافة من بين طرق أخرى لإدارة الحرائق.",
      "تقدم الوظائف في القارة القطبية الجنوبية رواتب مجزية بالإضافة إلى الإقامة والطعام، ويتميز موقع الدائرة بتصميم بسيط يذكرنا بجماليات الويب في أوائل العقد الأول من القرن الحادي والعشرين."
    ],
    "points": 149,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1731291949
  },
  {
    "id": 42103761,
    "title": "قد يكون المكتب القائم سيئًا مثل الجلوس طوال اليوم",
    "originLink": "https://www.sciencealert.com/your-standing-desk-might-actually-be-as-bad-as-sitting-all-day",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42103761",
    "commentBody": "",
    "originSummary": [
      "تشير دراسة من أستراليا وهولندا إلى أن الوقوف لفترات طويلة قد يكون ضارًا مثل الجلوس طوال اليوم، حيث يزيد كلاهما من خطر الإصابة بأمراض الدورة الدموية. - تحليل البيانات من 83,013 بالغًا لم يجد أي ارتباط بين وقت الوقوف وانخفاض خطر الإصابة بأمراض القلب والأوعية الدموية، حيث يزيد الوقوف لأكثر من ساعتين يوميًا الخطر بنسبة 11% لكل نصف ساعة إضافية. - تبرز الدراسة ضرورة دمج الحركة في الروتين اليومي، حيث إن الوقوف فقط ليس علاجًا فعالًا لنمط الحياة الخامل."
    ],
    "commentSummary": [
      "يمكن أن يكون الوقوف والجلوس لفترات طويلة ضارًا، مما يبرز أهمية الحركة للحفاظ على الصحة.",
      "يقترح باحثو علم الأرجونوميات في جامعة كورنيل استخدام صينية لوحة مفاتيح قابلة لتعديل الارتفاع وأخذ فترات راحة كل 20-30 دقيقة للوقوف والتحرك لفترة وجيزة.",
      "يُعتبر دمج الحركة المنتظمة في روتينك، بدلاً من ممارسة التمارين الشاقة، هو المفتاح لتعزيز الدورة الدموية والإنتاجية."
    ],
    "points": 147,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1731287182
  },
  {
    "id": 42105274,
    "title": "قد يكون ساعي شركة آبل قد سرق جهازين ماك بوك، ... شركة آبل لن تقدم المساعدة",
    "originLink": "https://forums.macrumors.com/threads/apple-courier-uber-may-have-stolen-2-macbooks-i-bought-and-its-looking-like-apple-is-not-going-to-help.2441932/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42105274",
    "commentBody": "",
    "originSummary": [
      "طلب عميل جهازين ماك بوك من شركة أبل كندا مع توصيل في نفس اليوم عبر أوبر، لكن حالة التوصيل أظهرت \"تم التوصيل\" رغم أن العميل لم يستلمهما.",
      "رفضت شركة آبل في البداية استرداد المبلغ أو استبدال المنتج، مشيرة إلى تأكيد أوبر على التسليم، مما دفع العميل إلى تقديم بلاغ للشرطة والاتصال بآبل مرة أخرى.",
      "بعد تصعيد المشكلة عن طريق إرسال بريد إلكتروني إلى الرئيس التنفيذي لشركة أبل، بدأ أحد أعضاء الفريق في التحقيق، لكن علاقات التنفيذ في أبل ريتيل حافظت على قرارها، مما دفع العميل إلى متابعة استرداد المبلغ."
    ],
    "commentSummary": [
      "يُزعم أن ساعي من شركة آبل سرق جهازي ماك بوك، مما أثار مخاوف بشأن موثوقية خدمات التوصيل من طرف ثالث مثل أوبر، التي قد توظف عمالًا غير مدققين بشكل كافٍ.",
      "يتردد العملاء في إصدار عمليات استرداد بسبب مخاوف من أن يتم حظرهم من حساباتهم على Apple، مما يبرز العواقب المحتملة وقضايا حقوق المستهلك.",
      "يؤكد الحادث على الحاجة إلى تحسين المساءلة من الشركات مثل أبل في التعامل مع السرقة وموثوقية خدمات التوصيل."
    ],
    "points": 132,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1731311759
  }
]
