[
  {
    "id": 38933999,
    "title": "Hakkeri paljastaa massiivisen tietomurron Yhdysvaltain pikaruokaketjujen vuokrauspalveluissa",
    "originLink": "https://mrbruh.com/chattr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38933999",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja paljasti tietoturva-aukon Chattr.ai:ssa, joka tarjoaa tekoälypalveluja pikaruokaketjuille ja muille työnantajille Yhdysvalloissa.",
      "Haavoittuvuutta hyödyntämällä tekijä sai luvattoman pääsyn arkaluonteisiin tietoihin, kuten henkilötietoihin, salasanoihin, toimipisteiden sijainteihin, luottamuksellisiin viesteihin ja työvuoroihin.",
      "Kirjoittaja sai myös hallinnollisen pääsyn Chattrin kojelautaan, jolloin hän pystyi hallitsemaan järjestelmää paremmin.",
      "Haavoittuvuus havaittiin 6. tammikuuta ja korjattiin 10. tammikuuta, mutta Chattr.ai ei vastannut tai kuittannut sitä."
    ],
    "commentSummary": [
      "Tiivistelmä kattaa keskustelut hakkeroinnista, tietomurroista, vastuullisesta tiedonantovelvollisuudesta, tietoturvasta ja häpäisyn tehokkuudesta.",
      "Se sisältää myös näkemyksiä bugipalkkioista ja vertailee Firebasea ja Postgresia tietokannanhallintavaihtoehtoina.",
      "Tiivistelmässä käsitellään henkilötietojen turvallisuuteen liittyviä huolenaiheita, tietoturvatutkijoiden vastuuvelvollisuuden tarvetta sekä Firebasen monimutkaisuutta ja rajoituksia koskevaa kritiikkiä."
    ],
    "points": 580,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1704843698
  },
  {
    "id": 38928951,
    "title": "Tarkista, onko lentosi Boeing 737 MAX -lentokoneella: Tarkista varauksesi.",
    "originLink": "https://www.ismyplanea737max.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38928951",
    "commentBody": "",
    "originSummary": [
      "Tämän työkalun avulla käyttäjät voivat tarkistaa, onko lento Boeing 737 MAX.",
      "On suositeltavaa tarkistaa varaukset uudelleen, jotta saat viimeisimmät tiedot lentokonetyypistä.",
      "Työkalu tarjoaa arvokasta tietoa matkustajille, jotka ovat huolissaan lentämisestä Boeing 737 MAX -lentokoneella."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään Boeing 737 MAX -lentokoneisiin liittyviin turvallisuusongelmiin ja tarkastellaan aiempia vaaratilanteita ja mahdollisia riskejä.",
      "Osallistujat keskustelevat Boeingin ja lentoyhtiöiden roolista turvallisuuden varmistamisessa ja vertailevat Boeingin ja Airbusin lentokoneiden turvallisuustilastoja.",
      "Jotkut epäröivät lentää 737 MAX -lentokoneella ja ehdottavat kuluttajatoimia, kun taas toiset korostavat lentomatkustamisen yleistä turvallisuutta. Korostetaan vastuullisuuden, laadunvalvonnan ja alan valvonnan tehostamisen tärkeyttä."
    ],
    "points": 496,
    "commentCount": 523,
    "retryCount": 0,
    "time": 1704821418
  },
  {
    "id": 38924300,
    "title": "Google korjaa tyhjän kotisivun ongelman Firefox Mobile for Androidissa",
    "originLink": "https://github.com/webcompat/web-bugs/issues/131916",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38924300",
    "commentBody": "",
    "originSummary": [
      "Käyttäjät, jotka käyttivät Googlen etusivua Firefox Mobile -ohjelmalla Androidissa, raportoivat tyhjästä sivusta.",
      "Ongelma tunnistettiin palvelinpuolen user agent (UA) sniffingiksi.",
      "Google on laatinut korjauksen ja ottaa parhaillaan käyttöön korjauksen, vaikka ongelma katsotaankin ratkaistuksi useimmille käyttäjille."
    ],
    "commentSummary": [
      "Käyttäjät keskustelevat teknisistä ongelmista, joita he kohtaavat Googlen tuotteissa, erityisesti Firefoxia käytettäessä.",
      "Jotkut arvelevat, että Google saattaa tahallaan heikentää Firefoxin kaltaisia kilpailijoita, kun taas toiset uskovat, että syynä voi olla huolimattomuus tai Chromen priorisointi.",
      "Vaihtoehdot, kuten DuckDuckGo ja Kagi, mainitaan, ja keskustellaan myös virheiden seurannan ja käyttäjäpalautteen merkityksestä."
    ],
    "points": 430,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1704794689
  },
  {
    "id": 38925307,
    "title": "Turing Complete: Turing: Peli, joka opettaa tietotekniikkaa koodauspelien avulla.",
    "originLink": "https://turingcomplete.game/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38925307",
    "commentBody": "",
    "originSummary": [
      "\"Turing Complete\" on peli, jonka tarkoituksena on opettaa pelaajille tietotekniikan käsitteitä, kuten loogisia portteja, komponentteja, arkkitehtuuria ja kokoonpanoa.",
      "Pelaajilla on mahdollisuus rakentaa omia tietokoneitaan ja ratkaista ohjelmointihaasteita binäärikoodien ja kokoonpano-ohjeiden avulla.",
      "Peli tarjoaa interaktiivisen ja käytännönläheisen oppimiskokemuksen henkilöille, jotka ovat kiinnostuneita ymmärtämään tietotekniikan perusteita."
    ],
    "commentSummary": [
      "Tiivistelmässä käsitellään keskusteluja tietotekniikkapeleistä, kuten Turing Complete ja Shenzhen I/O.",
      "Käyttäjät jakavat kokemuksiaan peleistä, suosittelevat vastaavia vaihtoehtoja ja vertailevat pelattavuutta ja ominaisuuksia.",
      "Jotkin käyttäjät ovat huolissaan tai tyytymättömiä tiettyihin osa-alueisiin, mutta yleisesti ottaen pelejä pidetään opettavaisina ja miellyttävinä."
    ],
    "points": 347,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1704802962
  },
  {
    "id": 38935205,
    "title": "Atuinin luoja lopettaa työnsä keskittyäkseen täysipäiväisesti avoimen lähdekoodin projektiin",
    "originLink": "https://ellie.wtf/posts/i-quit-my-job-to-work-full-time-on-my-open-source-project",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38935205",
    "commentBody": "",
    "originSummary": [
      "Atuin on tuottavuustyökalu, jonka avulla käyttäjät voivat tallentaa ja synkronoida kuorihistoriansa eri laitteilla.",
      "Luoja on jättänyt työnsä työskennelläkseen Atuinin parissa täysipäiväisesti ja aikoo lisätä uusia premium-ominaisuuksia ja tukea yrityskäyttöä.",
      "Koska käyttäjäkunta ja käyttö ovat kasvaneet merkittävästi, tekijä keskittyy entistä enemmän Atuinin kehittämiseen ja on perustanut GitHub-sponsoreita kattamaan palvelinkustannuksia."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään avoimen lähdekoodin hankkeisiin liittyviin eri näkökohtiin, mukaan lukien rahaksi muuttamisen vaihtoehdot, avoimiin ydinhankkeisiin liittyvät huolenaiheet ja avustusten saatavuus.",
      "Käyttäjät jakavat ja keskustelevat erilaisista työkaluista ja menetelmistä komentotulkkihistorian hallintaan, kuten Atuin ja DuckDB.",
      "Kirjoittaja kertoo kokemuksistaan ja rahaksi muuttamisen strategiastaan Atuin-työkalulleen sekä suunnitelmistaan lisätä maksullisia ominaisuuksia verkkosivustolleen. Käyttäjät ilmaisevat kiinnostuksensa Atuinia kohtaan ja keskustelevat sen eduista ja turvallisuusongelmista."
    ],
    "points": 332,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1704852044
  },
  {
    "id": 38932509,
    "title": "SEC:n Twitter-tili hakkeroitu, Ei hyväksyntää Bitcoin Spot ETF:lle",
    "originLink": "https://en.bitcoinsistemi.com/breaking-gary-gensler-says-secs-x-account-hacked-bitcoin-spot-etfs-not-yet-approved/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38932509",
    "commentBody": "",
    "originSummary": [
      "SEC:n virallinen Twitter-tili hakkeroitiin, ja siinä julkaistiin väärennetty viesti, jossa ilmoitettiin virheellisesti Bitcoin Spot ETF:ien hyväksymisestä.",
      "SEC:n puheenjohtaja Gary Gensler vahvisti, että viesti oli luvaton, ja selvensi, että Bitcoin Spot ETF:iä ei ole virallisesti hyväksytty.",
      "SEC on poistanut viestin ja selventänyt, että he eivät ole hyväksyneet tuotteiden listaamista ja kaupankäyntiä Bitcoin-pörssissä."
    ],
    "commentSummary": [
      "SEC:n X-tili on vaarantunut, mikä herättää huolta arkaluonteisten tietojen turvallisuudesta.",
      "Bitcoin Spot ETF:ien hyväksyntä on vielä kesken, mikä luo epävarmuutta kryptovaluuttamarkkinoilla.",
      "Hakkerointitapaus osoittaa, että SEC:ssä tarvitaan vahvempia turvatoimia ja valvontaa."
    ],
    "points": 325,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1704836406
  },
  {
    "id": 38932603,
    "title": "Tulevaisuuden rakentaminen: WikiHouse mullistaa kestävän suunnittelun",
    "originLink": "https://www.wikihouse.cc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38932603",
    "commentBody": "",
    "originSummary": [
      "WikiHouse on modulaarinen rakennusjärjestelmä, joka mahdollistaa tehokkaiden rakennusten helpon suunnittelun, valmistuksen ja kokoamisen.",
      "Tarkasti valmistetut osat sopivat täydellisesti toisiinsa ja luovat suorat ja tarkat rakennukset.",
      "Kevyet ja vahvat harkot ovat kestäviä ja hyvin eristettyjä, ja niiden avulla saadaan erittäin matalaenergiarakennuksia.",
      "Järjestelmä on hiilinegatiivinen, sillä puu sitoo ja varastoi hiiltä ilmakehästä.",
      "WikiHouse pyrkii demokratisoimaan kestävää rakentamista tarjoamalla avoimen lähdekoodin piirustuksia ja antamalla kenelle tahansa, jolla on CNC-kone, mahdollisuuden ryhtyä valmistajaksi.",
      "Hanketta ylläpitää voittoa tavoittelematon Open Systems Lab -yritys."
    ],
    "commentSummary": [
      "Wikihouse on avoimen lähdekoodin hanke, joka keskittyy kestävään ja esteettömään asumiseen, jossa etusijalla ovat kestävyys, alhainen energiankulutus ja suunnittelutietojen saatavuus.",
      "Keskustelua käydään nykyisen lähestymistavan rajoituksista ja rakentamisen standardoinnin tarpeesta sekä eri materiaalien ja menetelmien käytöstä ja näiden vaihtoehtojen kustannustehokkuudesta.",
      "Euroopassa suuntaus on kohti valmiita moduulirakenteisia koteja, ja Yhdysvalloissa kierrätysmateriaalien kysyntä on suurta, mutta valmiiden järjestelmien kestävyys ja korjausprosessit herättävät huolta, ja vanerin käytön kustannuksiin ja etuihin suhtaudutaan epäilevästi.",
      "Jotkut kyseenalaistavat avoimen lähdekoodin rakentamisen käsitteen ja väittävät, että muut järjestelmät ovat kypsempiä ja helpommin koulutettavissa, ja modulaarisen rakennusjärjestelmän väitteitä arvostellaan erityisesti puutavaran käytön, asennuksen helppouden ja yleisen laadun osalta.",
      "Kestävässä asumisessa pidetään tärkeinä tekijöitä, kuten pitkäikäisyyttä, sopeutumiskykyä ja kaunista muotoilua, ja keskustelua käydään myös puristetusta maatiiliteknologiasta, myrskynkestävistä kodeista ja avoimien rakennusjärjestelmien mahdollisuuksista monikerrostaloasumisessa.",
      "Wikihousen piirustukset ovat avoimen lähdekoodin järjestelmiä, jotka mahdollistavat yksityishenkilöiden rajoittamattoman käytön ja muokkaamisen."
    ],
    "points": 295,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1704836885
  },
  {
    "id": 38928277,
    "title": "Luominen e-ink-kuvakehyksen, joka synkronoi iCloud-valokuva-albumien kanssa, luominen",
    "originLink": "https://ben.page/eink",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38928277",
    "commentBody": "",
    "originSummary": [
      "Ben Borgers kirjoitti blogikirjoituksen iCloud-valokuva-albumien käänteismuokkauksesta ja Nook-lukulaitteen juurruttamisesta dynaamisen e-ink-kuvakehyksen tekemiseen.",
      "Kuvakehys päivittyy automaattisesti jaetun iCloud-valokuva-albumin kuvilla.",
      "Tämän DIY-projektin avulla käyttäjät voivat käyttää sähköistä lukulaitettaan henkilökohtaisena valokuvakehyksenä."
    ],
    "commentSummary": [
      "Käyttäjät keskustelevat kokemuksistaan ja turhautumisestaan iCloudin valokuva-albumien synkronointi- ja latausominaisuuksiin erityisesti Windows-koneilla.",
      "On kysyntää yksinkertaiselle, laadukkaalle e-ink-kuvakehykselle, joka on helppo synkronoida iCloudin kanssa ja näyttää albumeita.",
      "Keskustelussa käsitellään myös vaihtoehtoisia vaihtoehtoja valokuvien näyttämiseen ja jakamiseen sekä sellaisten tuotteiden toteutettavuutta ja markkinakysyntää, jotka helpottavat kuvien jakamista isovanhempien kanssa. Keskustelua käydään myös DIY-hankkeista, kuten räätälöidyistä wlan-asennuksista ja aurinkoenergialla toimivista kehyksistä."
    ],
    "points": 272,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1704818758
  },
  {
    "id": 38926476,
    "title": "Apple tuo Vision Pro -teknologian vähittäismyymälöihin helmikuusta 2024 alkaen",
    "originLink": "https://9to5mac.com/2024/01/09/five-different-app-stores/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38926476",
    "commentBody": "",
    "originSummary": [
      "Apple alkaa esitellä Vision Pro -teknologiaansa vähittäismyymälöissä 2. helmikuuta 2024 alkaen.",
      "Vision Pro -teknologia on Applen uusi tuote, jota asiakkaat voivat kokeilla myymälässä.",
      "Tämä siirto korostaa Applen sitoutumista innovointiin ja huipputeknologian tarjoamiseen asiakkaille."
    ],
    "commentSummary": [
      "Apple on selventänyt, että sillä on viisi eri sovelluskauppaa, mutta käyttäjät väittävät, että heillä ei silti ole riittävästi valinnanvaraa, koska he voivat käyttää laitteillaan vain yhtä kauppaa.",
      "Joillakin MacBook-käyttäjillä on vaikeuksia tiettyjen sovellusten asentamisessa, ja kehittäjät voivat estää iOS-sovellusten asentamisen Apple Silicon -mac-tietokoneisiin.",
      "Se, että Apple on lopettanut Minecraftin 7 dollarin hintaisen tablettiversion, on herättänyt huolta käyttäjien valinnanvapaudesta ja Applen App Storeen kohdistuvan määräysvallan vaikutuksesta.",
      "Keskustelua käydään siitä, pitäisikö Applen App Storea käsitellä oikeudellisesti yhtenä vai useampana kauppana ja onko se monopoli, mikä on herättänyt keskustelua kilpailunrajoitustoimien tarpeellisuudesta.",
      "Keskustelua käydään myös Applen asettamista rajoituksista ohjelmistojen asentamiselle ja mahdollisista eduista, joita ekosysteemin avaaminen kolmansien osapuolten sovelluskaupoille voisi tuoda.",
      "Tutustutaan iMessagen ja WhatsAppin käyttöön ja rajoituksiin sekä keskustellaan siitä, pitäisikö iMessagen olla yhteentoimiva muiden viestialustojen kanssa.",
      "Myös viestisovellusten oikeudenmukaisuus ja yhteensopivuus sekä EU:n kanta viestisovellusten monopoleihin ovat osa keskustelua.",
      "Yleisesti ottaen keskitytään Applen App Storeen kohdistuvan määräysvallan merkitykseen ja EU:n sääntelyn mahdollisiin vaikutuksiin Applen laitteisiin."
    ],
    "points": 249,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1704810111
  },
  {
    "id": 38935605,
    "title": "Teinien mielenterveysongelmien maailmanlaajuinen lisääntyminen: Anglosphere-maita tarkemmin tarkastellen.",
    "originLink": "https://www.afterbabel.com/p/international-mental-illness-part-one",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38935605",
    "commentBody": "",
    "originSummary": [
      "Teini-ikäisten mielenterveysongelmat ovat lisääntymässä Englannin maissa, ja ne vaikuttavat erityisesti tyttöihin ja nuorempaan sukupolveen.",
      "Zach Rauschin tutkimus osoittaa, että mielenterveysongelmat, itsensä vahingoittaminen ja psykiatriset sairaalahoitojaksot ovat lisääntyneet merkittävästi Yhdysvalloissa, Yhdistyneessä kuningaskunnassa, Kanadassa, Australiassa ja Uudessa-Seelannissa.",
      "Artikkelissa tarkastellaan tämän suuntauksen mahdollisia syitä, kuten älypuhelinten ja sosiaalisen median vaikutusta, ja ehdotetaan lisätutkimuksia vastaavien suuntausten ymmärtämiseksi muissa kehittyneissä maissa."
    ],
    "commentSummary": [
      "Tutkimuksessa selvitetään nuorten mielenterveysongelmien epidemian syitä, kuten sosiaalisen median roolia, kulttuurisia muutoksia, perherakennetta, taloutta ja epävarmuutta tulevaisuudesta.",
      "Keskustellaan media-alustojen kielteisistä vaikutuksista ja sosiaalisen median riippuvuutta aiheuttavista ominaisuuksista sekä tunnustetaan kapitalismin kielteiset vaikutukset.",
      "Tutkimuksessa tarkastellaan hallituksen sääntelyn vaikutusta, varallisuuden keskittymistä sekä suurten hallitusten, suuryritysten ja suuren rahoituksen välistä suhdetta. Lisäksi käsitellään sosiaalisen median ja jatkuvan verkkoläsnäolon kielteisiä vaikutuksia mielenterveyteen, erityisesti tyttöjen ja naisten kohdalla."
    ],
    "points": 222,
    "commentCount": 284,
    "retryCount": 0,
    "time": 1704855598
  },
  {
    "id": 38935048,
    "title": "Gmailin ja Yahoon vuoden 2024 postilaatikon suojaukset: Mitä se tarkoittaa sähköpostiohjelmille",
    "originLink": "https://www.mailgun.com/blog/deliverability/gmail-and-yahoo-inbox-updates-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38935048",
    "commentBody": "",
    "originSummary": [
      "Gmail ja Yahoo aikovat toteuttaa muutoksia vuonna 2024 parantaakseen käyttäjäkokemusta ja vähentääkseen ei-toivottuja sähköposteja, jolloin lähettäjien on todennettava sähköpostinsa, tarjottava helppoja peruutusmahdollisuuksia ja lähetettävä asiaankuuluvaa sisältöä.",
      "Nämä muutokset vaikuttavat massalähettäjiin, joiden on varmistettava uusien vaatimusten noudattaminen.",
      "Sinch Mailgun tarjoaa työkaluja, jotka auttavat lähettäjiä valmistautumaan tuleviin muutoksiin ja parantamaan sähköpostin toimitettavuutta, mukaan lukien sähköpostin todennusprotokollat ja toimitettavuusanalyysi."
    ],
    "commentSummary": [
      "Gmail ja Yahoo aikovat ottaa käyttöön postilaatikoiden suojaukset vuonna 2024, millä voi olla vaikutuksia sähköpostiohjelmiin.",
      "Huolta herättävät vaikutukset transaktiosähköposteihin ja tilauksen peruutuspainikkeen käyttäytymiseen.",
      "Artikkelissa käsitellään eri aiheita, kuten sähköpostien luokittelua, aitojen laskujen merkitsemistä roskapostiksi, sähköpostin todentamista, transaktiosähköposteja ja IP-lämmityksen haasteita."
    ],
    "points": 210,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1704850796
  },
  {
    "id": 38932398,
    "title": "Linux 6.8 -ydin parantaa TCP-suorituskykyä jopa 40 %.",
    "originLink": "https://www.phoronix.com/news/Linux-6.8-Networking",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38932398",
    "commentBody": "",
    "originSummary": [
      "Linux 6.8 -ydin sisältää merkittäviä parannuksia keskeiseen verkkokoodiin, minkä ansiosta suorituskyky paranee jopa 40 prosenttia useiden samanaikaisten yhteyksien osalta.",
      "Näihin parannuksiin kuuluu verkkorakenteiden optimointi välimuistirivin kulutuksen minimoimiseksi, ja Google osallistuu niihin, mikä hyödyttää erityisesti AMD EPYC -palvelimia.",
      "Linux 6.8 lisää myös tuen uusille Ethernet- ja Bluetooth-ajureille, poistaa vanhentuneet WiFi -ajurit, päivittää verkkoajurit ja tarjoaa laiteohjelmistopäivitykset NVIDIA Mellanox Ethernet -kytkimille. Käynnissä olevaan työhön kuuluu WiFi 7:n ja Extremely High Throughput (EHT) -parannuksia."
    ],
    "commentSummary": [
      "Linux 6.8:n verkko-optimointien on havaittu lisäävän TCP-suorituskykyä noin 40 %.",
      "Tämä parannus on erityisen hyödyllinen AMD EPYC -prosessoreille, mutta sillä on vain vähäinen vaikutus Intelin prosessoreihin.",
      "Lisäksi päivitys merkitsee tuen lopettamista Orinocolle, joka on suosittu langaton verkkotekniikka varhaisissa yhteisöverkoissa."
    ],
    "points": 193,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1704835938
  },
  {
    "id": 38930928,
    "title": "Tähtää, ammu, skannaa: Isojen projektien hallitseminen tehokkaalla suunnittelulla ja toteutuksella.",
    "originLink": "https://www.indiehackers.com/post/aim-fire-scan-the-80-20-of-executing-on-big-projects-571580cd0a",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38930928",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja kertoo kokemuksestaan, jonka hän sai romaanin kirjoittamisesta sitoutumissopimuksen avulla, ja kertoo iterointiprosessista, jota kutsutaan nimellä \"suunnittele, tee, opi\".",
      "Tehokkaan suunnittelun ja toteutuksen keskeiset käsitteet selitetään lyhenteillä AIM (Plan) ja FIRE (Do).",
      "Improvisaation, kekseliäisyyden ja keskittymisen merkitystä onnistuneiden tulosten saavuttamisessa korostetaan, samoin kuin henkisten voimavarojen käyttöä ja objektiivista pisteytystä suorituksen mittaamiseksi. Kirjoittaja käsittelee myös henkilökohtaista pisteytysjärjestelmäänsä ja oman suorituksen arvostelun ja mukauttamisen arvoa."
    ],
    "commentSummary": [
      "Kirjoituksessa tarjotaan strategioita suurten projektien tehokkaaseen toteuttamiseen, mukaan lukien standardien asettaminen, keskeneräisten töiden luovuttaminen, alkuun pääseminen, hauskojen aktiviteettien harrastaminen ja tapojen luominen.",
      "Postauksessa käsitellään erilaisia projektin toteuttamiseen liittyviä aiheita, kuten kuntosalilla käyntiä ja välipäiväkirjojen kirjoittamista.",
      "Strategioiden ja keskustelujen tavoitteena on tarjota näkemyksiä ja ohjeita hankkeiden onnistuneeseen toteuttamiseen."
    ],
    "points": 188,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1704829363
  }
]
