[
  {
    "id": 39142748,
    "title": "الواحة: نظام لينكس مرتبط بشكل ثابت يؤكد على البساطة والتخصيص",
    "originLink": "https://github.com/oasislinux/oasis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39142748",
    "commentBody": "",
    "originSummary": [
      "Oasis هو نظام تشغيل قائم على Linux يشبه BSD ويؤكد على البساطة والتخصيص.",
      "يستخدم برامج مرتبطة بشكل ثابت تماما ، وبنيات سريعة وقابلة للتكرار ، والحد الأدنى من تبعيات التمهيد.",
      "لا تحتوي Oasis على مدير حزم ولكنها متوافقة مع pkgsrc و nix ، وتستخدم BearSSL كمكتبة TLS ومكتبة تشفير خاصة بها."
    ],
    "commentSummary": [
      "تغطي المناقشة الموضوعات المتعلقة بأنظمة Linux ، بما في ذلك استخدام Oasis لإنشاء صور نظام تشغيل غير قابلة للتغيير وفوائد الربط الثابت والديناميكي في تطوير البرمجيات.",
      "يستكشف المستخدمون إدارة التبعية والتجميع الموزع وتحديات دعم وحدة معالجة الرسومات.",
      "تتم مناقشة المكتبات المختلفة والمترجمين والحلول البديلة مثل Docker و Nix ، مع آراء واقتراحات مختلفة حول تحسين المكتبات والثنائيات وإدارة التبعيات وتحسين استقرار النظام."
    ],
    "points": 463,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1706278296
  },
  {
    "id": 39143043,
    "title": "محكمة العدل الدولية تأمر إسرائيل بمنع الإبادة الجماعية في غزة وتفشل في إصدار أوامر بوقف إطلاق النار",
    "originLink": "https://apnews.com/article/israel-gaza-genocide-court-south-africa-27cf84e16082cde798395a95e9143c06",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143043",
    "commentBody": "",
    "originSummary": [
      "قضت المحكمة العليا في الأمم المتحدة بأن على إسرائيل التزاما قانونيا بمنع الموت والدمار والإبادة الجماعية في غزة، لكنها لم تأمر صراحة بإنهاء الهجوم العسكري المستمر.",
      "وينظر إلى قرار المحكمة على أنه انتقاد لسلوك إسرائيل خلال الصراع وكثف الضغوط الدولية لوقف الهجوم.",
      "ورفض رئيس الوزراء الإسرائيلي بنيامين نتنياهو الحكم وتعهد بمواصلة الحرب، مما أثار حالة من عدم اليقين بشأن ما إذا كانت إسرائيل ستمتثل للقرار الملزم قانونا.",
      "كما دعت المحكمة حماس إلى إطلاق سراح الرهائن وحثت المجتمع الدولي على ضمان امتثال إسرائيل للحكم.",
      "ويتزامن هذا الحكم مع اليوم الدولي لإحياء ذكرى محرقة اليهود."
    ],
    "commentSummary": [
      "يغطي الملخص المناقشات المختلفة المتعلقة بالصراع الإسرائيلي الفلسطيني، بما في ذلك الخسائر في صفوف المدنيين، وأعمال الجيش الإسرائيلي، ودور محكمة العدل الدولية.",
      "يتم عرض وجهات نظر مختلفة ، بما في ذلك المناقشات حول أرقام الضحايا وتأثير العوامل الخارجية.",
      "يستكشف الملخص أيضا التحديات في إيجاد حل، ودور حماس، واحتمال وقوع هجمات في المستقبل."
    ],
    "points": 443,
    "commentCount": 1147,
    "retryCount": 0,
    "time": 1706279706
  },
  {
    "id": 39144906,
    "title": "استغلال ثغرة أمنية: اختراق Chess.com باستخدام XSS",
    "originLink": "https://skii.dev/rook-to-xss/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144906",
    "commentBody": "",
    "originSummary": [
      "يروي المؤلف تجربتهم في اكتشاف واستغلال ثغرة أمنية على Chess.com.",
      "سمحت الثغرة الأمنية للمؤلف بإضافة نفسه تلقائيا كصديق عن طريق الوصول إلى عنوان URL محدد.",
      "استخدم المؤلف وظيفة تحميل الصور لمحرر نص منسق لحقن كود HTML الخام في وصف ملفه الشخصي وتنفيذ جافا سكريبت ضارة.",
      "يناقشون التأثير المحتمل لهجوم البرمجة النصية عبر المواقع والتحديات التي واجهوها مع استغلال OSRF.",
      "يقدم المؤلف اقتراحات حول كيفية منع نقاط الضعف المماثلة في المستقبل."
    ],
    "commentSummary": [
      "نجح طالب بريطاني يبلغ من العمر 17 عاما في اختراق chess.com ، مما أثار مناقشات حول الفرص الوظيفية والتدريب المهني في Facebook.",
      "يثير الحادث مخاوف بشأن تحديات تحليل HTML وهجمات XSS المحتملة على مواقع الويب.",
      "كما تسلط المحادثة الضوء على التنافس بين chess.com و lichess.org والآراء المختلطة حول تجربة المستخدم عبر منصات مختلفة."
    ],
    "points": 341,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1706288620
  },
  {
    "id": 39151937,
    "title": "Rclone: أداة متعددة الاستخدامات لإدارة الملفات على التخزين السحابي",
    "originLink": "https://rclone.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39151937",
    "commentBody": "",
    "originSummary": [
      "Rclone هو برنامج سطر أوامر لإدارة الملفات على التخزين السحابي مع دعم لأكثر من 70 مزودا.",
      "يوفر ميزات مثل التشفير والضغط والتجزئة ، مما يجعله مناسبا للنسخ الاحتياطي واستعادة البيانات والترحيل ومزامنة الملفات.",
      "يحافظ Rclone على الطوابع الزمنية ، ويتحقق من المجاميع الاختبارية ، ويمكن استخدامه كقرص للوصول إلى التخزين السحابي ، ويقدم الملفات عبر بروتوكولات مختلفة. إنه مفتوح المصدر ولديه مجتمع مفيد."
    ],
    "commentSummary": [
      "يناقش المستخدمون فوائد وقيود استخدام Rclone ، وهي أداة مزامنة التخزين السحابي ، للنسخ الاحتياطي للملفات.",
      "تم ذكر أدوات المزامنة البديلة وخيارات التشفير للتخزين السحابي.",
      "تغطي المحادثة أيضا قيود واجهة برمجة تطبيقات Google ، باستخدام Rclone مع أدوات النسخ الاحتياطي الأخرى ، والتكلفة والمفاضلات لخيارات النسخ الاحتياطي المختلفة مثل Amazon S3 Glacier و Backblaze."
    ],
    "points": 263,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1706323819
  },
  {
    "id": 39144978,
    "title": "النمو الهائل للبطاريات: إطلاق العنان لمستقبل مستدام",
    "originLink": "https://rmi.org/the-rise-of-batteries-in-six-charts-and-not-too-many-numbers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144978",
    "commentBody": "",
    "originSummary": [
      "يتزايد الطلب على البطاريات بسرعة ، مما يؤدي إلى انخفاض محتمل في الطلب العالمي على الوقود الأحفوري بمقدار النصف.",
      "تتضاعف مبيعات البطاريات كل سنتين إلى ثلاث سنوات ، مدفوعة بنمو السيارات الكهربائية.",
      "يتيح تحسين جودة البطارية وخفض التكاليف تطبيقات جديدة في مختلف القطاعات ، بما في ذلك النقل وتخزين الطاقة. لقد قلل المحللون باستمرار من نمو البطاريات.",
      "ومن المتوقع أن يؤدي انخفاض التكاليف وزيادة دعم السياسات إلى زيادة اعتماد البطاريات.",
      "يمكن أن يسهل النشر السريع للبطاريات التخلص التدريجي من الوقود الأحفوري في النقل البري والشحن والطيران وقطاع الكهرباء ، مما يؤدي إلى تخفيضات كبيرة في انبعاثات الكربون.",
      "هناك حاجة إلى مزيد من الجهود لتسريع الانتقال إلى البطاريات من أجل مستقبل أسرع وأكثر استدامة."
    ],
    "commentSummary": [
      "تغطي المناقشة مواضيع مختلفة تتعلق بتوليد الطاقة وتخزينها واستهلاكها ، مع التركيز على السيارات الكهربائية (EVs) ومصادر الطاقة المتجددة.",
      "تستكشف المحادثة استخدام البطاريات لمعالجة التفاوت في التوقيت بين ذروة الطلب وتوليد الطاقة الشمسية وتناقش الانخفاض في تطبيقات الطاقة الشمسية على الأسطح في كاليفورنيا.",
      "هناك نقاش حول توليد الكهرباء وتخزينها في المناطق السكنية ، والحاجة إلى تحسين البنية التحتية لشحن المركبات الكهربائية ، وتحديات تنفيذ المركبات الكهربائية في المناطق الريفية. تناقش المحادثة أيضا كفاءة المركبات الكهربائية مقارنة بمركبات البنزين وإمكانية تخزين الهيدروجين والرحلات التي تعمل بالطاقة الكهربائية."
    ],
    "points": 255,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1706289028
  },
  {
    "id": 39144710,
    "title": "غير قابل للترجمة: احتضان التنوع اللغوي في العالم",
    "originLink": "https://untranslatable.co/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144710",
    "commentBody": "",
    "originSummary": [
      "Untranslatable هو قاموس متعدد اللغات على الإنترنت يسمح للمستخدمين بالمساهمة بكلمات وتعبيرات من لغات وثقافات مختلفة.",
      "يهدف المشروع إلى تقديم أكثر من مجرد ترجمات ، وتقديم رؤى حول السياق والأهمية الثقافية.",
      "يرحب بالإدخالات بأي لغة أو لهجة ويدعمه المشرفون وتصويت المستخدم للحفاظ على الجودة والدقة."
    ],
    "commentSummary": [],
    "points": 242,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1706287648
  },
  {
    "id": 39143958,
    "title": "رحلة مهندس البرمجيات إلى تأشيرة O-1: موافقة سريعة ونصائح الخبراء",
    "originLink": "https://blog.awais.io/o1-visa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143958",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف ، وهو مهندس برمجيات تحول إلى CTO / مؤسس مشارك ، تجربته في الحصول على تأشيرة O-1 كمؤسس شركة ناشئة.",
      "لقد حصلوا على تأشيرتهم في أسبوع واحد فقط مع معالجة متميزة واستوفوا أربعة من أصل ثمانية معايير قدرة غير عادية.",
      "ينصح المؤلف بالتشاور مع محامي الهجرة قبل التقديم ويقدم توصيات للمحامين والموارد لمقدمي الطلبات O-1."
    ],
    "commentSummary": [
      "تركز المناقشة على نظام الهجرة الأمريكي والصعوبات التي يواجهها الأفراد الذين يتقدمون بطلب للحصول على تأشيرات وبطاقات خضراء.",
      "هناك جدل حول متطلبات التأشيرة ، والعيوب في نظام الهجرة ، ومعاملة المهاجرين غير الشرعيين.",
      "تناقش المحادثة أيضا تأشيرة O-1 للأفراد ذوي القدرات الاستثنائية ، وقيود العمل ، وأهمية تسليط الضوء على الإنجازات."
    ],
    "points": 218,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706283950
  },
  {
    "id": 39143768,
    "title": "تقديم cssfact: ضاغط CSS ضياع لتقليل التكرار في التعليمات البرمجية",
    "originLink": "https://blog.danieljanus.pl/2024/01/26/lossy-css-compression/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143768",
    "commentBody": "",
    "originSummary": [
      "يقدم منشور المدونة ضاغط CSS يسمى cssfact والذي يقلل من كود CSS باستخدام عامل المصفوفة الثنائية.",
      "تساعد تقنية تقليل مصفوفات CSS في تحديد التكرار في قواعد كود CSS.",
      "يهدف cssfact إلى إخراج نسخة مضغوطة من كود CSS بقواعد أقل."
    ],
    "commentSummary": [
      "يقدم منشور المدونة مفهوم الضغط المفقود ل CSS ومزاياه المحتملة في تقليل حجم الملف.",
      "يقترح المؤلف النظر في تكرار استخدام القاعدة لتعزيز عملية الضغط.",
      "يشارك المعلقون أدوات وأفكارا إضافية تتعلق بضغط CSS ، وهناك آراء مختلفة حول التطبيق العملي وفائدة المفهوم. يتضمن المنشور أمثلة حية ورمزا لمزيد من التجارب."
    ],
    "points": 218,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1706283064
  },
  {
    "id": 39148336,
    "title": "تقوم الأداة بإنشاء أسئلة اختبار وبطاقات تعليمية من مقاطع فيديو YouTube التعليمية",
    "originLink": "https://www.platoedu.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39148336",
    "commentBody": "",
    "originSummary": [
      "طور الفرد أداة تنشئ أسئلة اختبار أو بطاقات تعليمية من مقاطع فيديو YouTube التعليمية.",
      "تتضمن الأداة تقنية التكرار المتباعد لتعزيز الاحتفاظ بالذاكرة.",
      "يسعى الفرد للحصول على تعليقات حول الأداة وعلى استعداد لتقديم معلومات إضافية عند الطلب."
    ],
    "commentSummary": [
      "طور المؤلف تطبيقا يولد أسئلة اختبار من مقاطع فيديو YouTube التعليمية ويستخدم التكرار المتباعد.",
      "يجد المستخدمون التطبيق مفيدا ويقترحون إضافة ميزات مثل مناقشة المجتمع وتدوين الملاحظات الشخصية.",
      "هناك جدل حول قيمة مقاطع الفيديو الترفيهية التعليمية والرغبة في مزيد من التحكم في توصيات YouTube لإعطاء الأولوية للتعليم الفعلي."
    ],
    "points": 197,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1706303078
  },
  {
    "id": 39142560,
    "title": "تم تحديث tinySA Wiki بمعلومات حول tinySA Ultra: محلل الطيف الصغير ومولد الإشارة",
    "originLink": "https://www.tinysa.org/wiki/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39142560",
    "commentBody": "",
    "originSummary": [
      "تم تحديث tinySA Wiki ليشمل معلومات حول tinySA Ultra ، وهو محلل طيف صغير ومولد إشارة.",
      "يعد tinySA Ultra و tinySA4 نفس الجهاز ، حيث يتميز Ultra بشاشة أكبر مقاس 4 بوصات ويعمل ضمن نطاقات تردد أوسع.",
      "يحتوي tinySA Basic على شاشة مقاس 2.8 بوصة ويعمل ضمن نطاقات تردد محددة ، بينما يحتوي Ultra على ميزات إضافية مثل فتحة LNA وبطاقة microSD مدمجة."
    ],
    "commentSummary": [
      "يستخدم الجيش الأوكراني TinySA ، وهو محلل طيف مدمج ومولد إشارة ، للكشف عن الطائرات الروسية بدون طيار بشكل فعال.",
      "تتعمق المحادثة في تكنولوجيا انتشار الطيف والأساليب البديلة لاكتشاف الطائرات بدون طيار واعتراضها.",
      "تتم مناقشة أدوات مختلفة لمراقبة وتحليل الطيف ، مثل NanoVNA و TinySA ، إلى جانب اقتراحات لشراء راسمات الذبذبات بأسعار معقولة وقياس الترددات المنخفضة وتحديد مصادر تداخل الترددات الراديوية."
    ],
    "points": 169,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1706277073
  },
  {
    "id": 39145701,
    "title": "PinePhone: حقيبة مختلطة من مشكلات الأداء والهاتف ، وفقا للمراجعة",
    "originLink": "https://yaky.dev/2024-01-25-pinephone-post-daily-driver-review/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39145701",
    "commentBody": "",
    "originSummary": [
      "PinePhone هو جهاز Linux محمول ذو أداء جيد ولكن لديه مشكلات في قدرات الهاتف.",
      "يحتوي على ميزات قياسية وشاشة لائقة ، ولكن يصعب رؤيته في الضوء الساطع ويبلغ متوسط عمر البطارية.",
      "تتم مناقشة بيئات سطح المكتب Phosh و SXMO ، ولكل منها نقاط القوة والضعف الخاصة بها.",
      "هناك قيود على تحرير ملفات YAML واستخدام wvkbd للاستخدام الطرفي.",
      "أبلغ المستخدمون عن مشكلات في المودم ، خاصة مع VoLTE ، مما أدى إلى حدوث أعطال وصعوبات في المكالمات.",
      "تمت تجربة إصدارات مختلفة من البرامج الثابتة وأنظمة التشغيل ، لكن المشكلات لا تزال قائمة.",
      "تعمل الكاميرا ولكن لديها معالجة لاحقة بطيئة وقدرات محدودة لتصوير الفيديو.",
      "تطبيقات التنقل في وضع عدم الاتصال محدودة أيضا.",
      "هناك تحديات مع تشغيل Spotify على عملاء Linux للجوال والاستخدام الموصى به ل Firefox ESR كمتصفح افتراضي.",
      "بشكل عام ، يعد PinePhone عمليا للمهام اليومية ولكن له قيود كهاتف."
    ],
    "commentSummary": [
      "يناقش المستخدمون تجاربهم مع الأجهزة المحمولة التي تعمل على Linux ، بما في ذلك PinePhone و Librem 5 و Ubuntu Touch ، مع التركيز على مجالات مثل أداء البرامج وقيود الأجهزة وواجهات المستخدم.",
      "يتم تسليط الضوء على تحديات إنشاء أجهزة ميسورة التكلفة ومفتوحة المصدر بالكامل ، فضلا عن المخاوف بشأن موثوقيتها واعتمادها السائد.",
      "تغطي المناقشات أيضا موضوعات مثل مشاركة الملفات ومزامنة الصور والوصول إلى الجذر على أجهزة Android وتكلفة خدمات الرسائل القصيرة وتوافرها."
    ],
    "points": 165,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1706292304
  },
  {
    "id": 39148544,
    "title": "جوجل TPU v5p يتفوق على نفيديا H100 لأعباء العمل الذكاء الاصطناعي",
    "originLink": "https://www.techradar.com/pro/google-is-rapidly-turning-into-a-formidable-opponent-to-bff-nvidia-the-tpu-v5p-ai-chip-powering-its-hypercomputer-is-faster-and-has-more-memory-and-bandwidth-than-ever-before-beating-even-the-mighty-h100",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39148544",
    "commentBody": "",
    "originSummary": [
      "أصدرت Google TPU v5p ، وهي نسخة مطورة من رقاقة الذكاء الاصطناعي وحدة معالجة الموتر ، مع سرعة وذاكرة ونطاق ترددي محسن مقارنة بسابقتها.",
      "يتم استخدام TPU v5p في الكمبيوتر الفائق الذكاء الاصطناعي من Google ويتميز بتدريب أسرع بما يصل إلى 2.8 مرة لنماذج اللغات الكبيرة.",
      "يتم استخدام وحدات TPU المخصصة من Google داخليا ، ويعتبر TPU v5p الجديد منافسا قويا لوحدة معالجة الرسومات H100 من Nvidia لمهام الذكاء الاصطناعي ، على الرغم من ضرورة إجراء مزيد من المعايير لإجراء مقارنة دقيقة للأداء."
    ],
    "commentSummary": [
      "تغطي المناقشة أجهزة TPU من Google ووحدات معالجة الرسومات من Nvidia ، مما يسلط الضوء على أهميتها في الذكاء الاصطناعي.",
      "يتم استكشاف المنافسة بين أطر العمل مثل PyTorch و CUDA ، مع التأكيد على أهمية الأجهزة.",
      "تتم مناقشة إمكانات TPUs في التعلم الآلي وتحديات وقيود استخدام الأجهزة المتخصصة لمهام الذكاء الاصطناعي."
    ],
    "points": 157,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1706303923
  },
  {
    "id": 39144740,
    "title": "يواجه مالكو Pixel مشكلات بعد تحديث Google Play في كانون الثاني (يناير) 2024",
    "originLink": "https://www.bleepingcomputer.com/news/google/google-pixel-phones-unusable-after-january-2024-system-update/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144740",
    "commentBody": "",
    "originSummary": [
      "واجه مالكو الهواتف الذكية من Google Pixel مشكلات مختلفة بعد تحديث النظام في يناير 2024 ، بما في ذلك مشكلات الوصول إلى وحدة التخزين الداخلية واستخدام الكاميرا والتقاط لقطات الشاشة وفتح التطبيقات.",
      "حاول بعض المستخدمين حل المشكلات عن طريق إعادة ضبط المصنع لأجهزتهم ، ولكن هذا أدى إلى فقدان البيانات.",
      "تدرك Google المشكلة وتقوم حاليا بالتحقيق فيها ، مما يثير مخاوف بشأن بروتوكولات ضمان الجودة والاختبار الخاصة بالشركة. تتضمن المعلومات الواردة في المقالة قواعد من المنتديات عبر الإنترنت وتفاصيل من مواقع الويب وشفرة جافا سكريبت المتعلقة بموقع ويب يسمى BleepingComputer."
    ],
    "commentSummary": [
      "واجه مستخدمو هواتف Pixel مشكلات بعد تثبيت تحديث Google Play لشهر يناير 2024 ، وتحديدا مشكلات التخزين.",
      "تشير التكهنات إلى أن الأجهزة ، وليس التحديث ، قد تكون سبب هذه المشكلات.",
      "يتم التعبير عن عدم الرضا عن Google و Apple ، حيث يفكر بعض المستخدمين في تبديل العلامات التجارية. هناك أيضا تقارير عن مشكلات في الاقتران بين ساعات Garmin وهواتف Pixel ، مما يؤدي إلى شكوك حول المشكلات المتعمدة التي تسببها Google.",
      "تتطرق المناقشة أيضا إلى التوازن بين الراحة والأمن في التكنولوجيا والمخاوف المتعلقة بضمان جودة البرمجيات.",
      "الموضوع العام للمحادثة هو الإحباط من شركات التكنولوجيا وتحديثات برامجها."
    ],
    "points": 157,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1706287779
  },
  {
    "id": 39146385,
    "title": "يتسبب انقطاع Microsoft Teams في حدوث مشكلات في الاتصال ومشكلات في تسجيل الدخول وتأخير الرسائل",
    "originLink": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-outage-causes-connection-issues-message-delays/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39146385",
    "commentBody": "",
    "originSummary": [
      "تحقق Microsoft في انقطاع واسع النطاق يؤثر على مستخدمي منصة اتصالات Teams الخاصة بها ، مما يتسبب في حدوث مشكلات في الاتصال وصعوبات في تسجيل الدخول وتأخير الرسائل.",
      "تعمل الشركة بنشاط على حل المشكلة وقد لاحظت علامات التحسن بعد تنفيذ تجاوز الفشل في منطقة أوروبا والشرق الأوسط وأفريقيا.",
      "يتضمن المنشور أيضا مقتطفات التعليمات البرمجية التي توضح وظائف JavaScript ومعالجات الأحداث للتحكم في سلوك صفحة الويب ، مثل الطباعة والتمرير والقوائم المنسدلة والنوافذ المنبثقة."
    ],
    "commentSummary": [
      "يشعر المستخدمون بالإحباط من Microsoft Teams بسبب مشاكل الاتصال وتأخير الرسائل ومواطن الخلل.",
      "تشمل الشكاوى أوقات التحميل البطيئة والأعطال ونقص الميزات مقارنة بالبدائل مثل Slack.",
      "اعتاد بعض المستخدمين على الأداء الضعيف ل Teams على الرغم من المشكلات والانقطاعات المستمرة."
    ],
    "points": 156,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1706295044
  }
]
