[
  {
    "id": 39142748,
    "title": "Oasis: מערכת לינוקס מקושרת סטטית המדגישה פשטות והתאמה אישית",
    "originLink": "https://github.com/oasislinux/oasis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39142748",
    "commentBody": "",
    "originSummary": [
      "Oasis היא מערכת הפעלה מבוססת לינוקס הדומה ל-BSD ושמה דגש על פשטות והתאמה אישית.",
      "הוא משתמש בתוכנה מקושרת סטטית לחלוטין, בונים מהירים וניתנים לשחזור, ותלות מינימלית ב- bootstrap.",
      "לאואזיס אין מנהל חבילות אבל הוא תואם pkgsrc ו-nix, והיא משתמשת ב-BearSSL כספריית TLS וקריפטו שלה."
    ],
    "commentSummary": [
      "הדיון עוסק בנושאים הקשורים למערכות לינוקס, כולל השימוש באואזיס ליצירת תמונות מערכת הפעלה בלתי ניתנות לשינוי והיתרונות של קישור סטטי ודינמי בפיתוח תוכנה.",
      "משתמשים חוקרים ניהול תלות, קומפילציה מבוזרת ואת האתגרים של תמיכה במעבדים גרפיים.",
      "ספריות שונות, מהדרים ופתרונות חלופיים כמו Docker ו- Nix נדונים, עם דעות והצעות שונות לגבי אופטימיזציה של ספריות וקבצים בינאריים, ניהול יחסי תלות ושיפור יציבות המערכת."
    ],
    "points": 463,
    "commentCount": 215,
    "retryCount": 0,
    "time": 1706278296
  },
  {
    "id": 39143043,
    "title": "בית הדין הבינלאומי לצדק הורה לישראל למנוע רצח עם בעזה, לא הורה על הפסקת אש",
    "originLink": "https://apnews.com/article/israel-gaza-genocide-court-south-africa-27cf84e16082cde798395a95e9143c06",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143043",
    "commentBody": "",
    "originSummary": [
      "בית המשפט העליון של האו\"ם פסק כי לישראל יש חובה חוקית למנוע מוות, הרס ורצח עם ברצועת עזה, אך לא הורה במפורש על הפסקת המתקפה הצבאית המתמשכת.",
      "פסיקת בית הדין נתפסת כביקורת על התנהלותה של ישראל במהלך הסכסוך והגבירה את הלחץ הבינלאומי להפסיק את המתקפה.",
      "ראש הממשלה בנימין נתניהו דחה את הפסיקה והתחייב להמשיך במלחמה, מה שמעלה את אי הוודאות האם ישראל תעמוד בהחלטה המחייבת מבחינה משפטית.",
      "בית הדין גם קרא לחמאס לשחרר בני ערובה והפציר בקהילה הבינלאומית להבטיח את ציות ישראל לפסיקה.",
      "פסיקה זו עולה בקנה אחד עם יום השואה הבינלאומי."
    ],
    "commentSummary": [
      "הסיכום מכסה דיונים שונים הקשורים לסכסוך הישראלי-פלסטיני, לרבות נפגעים אזרחיים, פעולות הצבא הישראלי ותפקידו של בית הדין הבינלאומי לצדק.",
      "מוצגות נקודות מבט שונות, כולל דיונים על נתוני הנפגעים והשפעתם של גורמים חיצוניים.",
      "הסיכום בוחן גם את האתגרים במציאת פתרון, את תפקידו של חמאס ואת הפוטנציאל לפיגועים עתידיים."
    ],
    "points": 443,
    "commentCount": 1147,
    "retryCount": 0,
    "time": 1706279706
  },
  {
    "id": 39144906,
    "title": "ניצול פרצת אבטחה: פריצה Chess.com באמצעות XSS",
    "originLink": "https://skii.dev/rook-to-xss/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144906",
    "commentBody": "",
    "originSummary": [
      "המחבר מספר על החוויה שלהם של גילוי וניצול פגיעות אבטחה על Chess.com.",
      "הפגיעות אפשרה למחבר להוסיף את עצמו באופן אוטומטי כחבר על-ידי גישה לכתובת URL ספציפית.",
      "המחבר השתמש בפונקציית העלאת התמונות של עורך טקסט עשיר כדי להזריק קוד HTML גולמי לתיאור הפרופיל שלהם ולבצע JavaScript זדוני.",
      "הם דנים בהשפעה הפוטנציאלית של מתקפת סקריפטים חוצת אתרים ובאתגרים שעמדו בפניהם עם ניצול לרעה של OSRF.",
      "המחבר מספק הצעות כיצד למנוע פגיעויות דומות בעתיד."
    ],
    "commentSummary": [
      "סטודנט בריטי בן 17 פרץ בהצלחה chess.com, והצית דיונים על הזדמנויות קריירה וחניכות לתואר בפייסבוק.",
      "התקרית מעלה חששות לגבי אתגרי ניתוח HTML והתקפות XSS פוטנציאליות על אתרי אינטרנט.",
      "השיחה גם מדגישה את היריבות בין chess.com ל-lichess.org ודעות מעורבות על חוויית המשתמש בפלטפורמות שונות."
    ],
    "points": 341,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1706288620
  },
  {
    "id": 39151937,
    "title": "Rclone: כלי רב-תכליתי לניהול קבצים באחסון בענן",
    "originLink": "https://rclone.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39151937",
    "commentBody": "",
    "originSummary": [
      "Rclone היא תוכנית שורת פקודה לניהול קבצים באחסון ענן עם תמיכה עבור למעלה מ -70 ספקים.",
      "הוא מציע תכונות כמו הצפנה, דחיסה וגיבוב, מה שהופך אותו מתאים לגיבוי, שחזור נתונים, העברה וסנכרון קבצים.",
      "Rclone משמר חותמות זמן, מאמת סיכומי המחאות, וניתן להשתמש בו כדיסק כדי לגשת לאחסון בענן, ומגיש קבצים בפרוטוקולים שונים. זהו קוד פתוח ויש לו קהילה מועילה."
    ],
    "commentSummary": [
      "משתמשים דנים ביתרונות ובמגבלות של השימוש ב- Rclone, כלי סנכרון אחסון בענן, לגיבוי קבצים.",
      "מוזכרים כלי סנכרון חלופיים ואפשרויות הצפנה לאחסון בענן.",
      "השיחה מכסה גם את המגבלות של Google API, שימוש ב- Rclone עם כלי גיבוי אחרים, ואת העלות והפשרות של אפשרויות גיבוי שונות כמו Amazon S3 Glacier ו- Backblaze."
    ],
    "points": 263,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1706323819
  },
  {
    "id": 39144978,
    "title": "הצמיחה הנפיצה של סוללות: פותחים עתיד בר-קיימא",
    "originLink": "https://rmi.org/the-rise-of-batteries-in-six-charts-and-not-too-many-numbers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144978",
    "commentBody": "",
    "originSummary": [
      "הביקוש לסוללות גדל במהירות, מה שמוביל לירידה פוטנציאלית בביקוש העולמי לדלקי מאובנים בחצי.",
      "מכירות הסוללות מכפילות את עצמן כל שנתיים-שלוש, הודות לצמיחתן של מכוניות חשמליות.",
      "איכות סוללה משופרת ועלויות מופחתות מאפשרות יישומים חדשים במגזרים שונים, כולל תחבורה ואחסון אנרגיה. אנליסטים העריכו בעקביות את צמיחת הסוללות.",
      "ירידה בעלויות והגדלת התמיכה במדיניות צפויים להניע עוד יותר את אימוץ הסוללות.",
      "פריסה מהירה של סוללות יכולה להקל על הפסקה הדרגתית של דלקי מאובנים בתחבורה בכבישים, בספנות, בתעופה ובמשק החשמל, ולהוביל להפחתה משמעותית בפליטת הפחמן.",
      "נדרשים מאמצים נוספים כדי להאיץ את המעבר לסוללות לעתיד מהיר ובר קיימא יותר."
    ],
    "commentSummary": [
      "הדיון עוסק בנושאים שונים הקשורים לייצור אנרגיה, אגירה וצריכה, תוך התמקדות בכלי רכב חשמליים (EV) ובמקורות אנרגיה מתחדשים.",
      "השיחה בוחנת שימוש בסוללות כדי להתמודד עם פער העיתוי בין ביקוש שיא לייצור חשמל סולארי ודנה בירידה ביישומים סולאריים על גגות בקליפורניה.",
      "יש ויכוח על ייצור ואגירה של חשמל למגורים, הצורך בשיפור תשתיות לטעינת ר\"ח והאתגרים ביישום כלי רכב חשמליים באזורים כפריים. השיחה דנה גם ביעילות של כלי רכב חשמליים בהשוואה לרכבי בנזין ובפוטנציאל לאגירת מימן וטיסות המונעות בחשמל."
    ],
    "points": 255,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1706289028
  },
  {
    "id": 39144710,
    "title": "בלתי ניתן לתרגום: אימוץ המגוון הלשוני של העולם",
    "originLink": "https://untranslatable.co/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144710",
    "commentBody": "",
    "originSummary": [
      "Untranslatable הוא מילון מקוון רב לשוני המאפשר למשתמשים לתרום מילים וביטויים משפות ותרבויות שונות.",
      "הפרויקט נועד לספק יותר מאשר רק תרגומים, להציע תובנות על הקשר ומשמעות תרבותית.",
      "הוא מקבל בברכה ערכים בכל שפה או ניב ונתמך על ידי מנהלים והצבעות משתמשים כדי לשמור על איכות ודיוק."
    ],
    "commentSummary": [],
    "points": 242,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1706287648
  },
  {
    "id": 39143958,
    "title": "המסע של מהנדס תוכנה לוויזת O-1: אישור מהיר וטיפים של מומחים",
    "originLink": "https://blog.awais.io/o1-visa/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143958",
    "commentBody": "",
    "originSummary": [
      "המחבר, מהנדס תוכנה שהפך ל-CTO/מייסד שותף, חולק את ניסיונו בקבלת ויזת O-1 כמייסד סטארט-אפ.",
      "הם השיגו את הוויזה שלהם תוך שבוע אחד בלבד עם עיבוד פרימיום ועמדו בארבעה מתוך שמונה קריטריונים של יכולת יוצאת דופן.",
      "המחבר מייעץ להתייעץ עם עורך דין הגירה לפני הגשת הבקשה ומספק המלצות לעורכי דין ומשאבים למבקשי O-1."
    ],
    "commentSummary": [
      "הדיון מתמקד במערכת ההגירה של ארה\"ב ובקשיים העומדים בפני אנשים המבקשים ויזות וגרין קארד.",
      "יש ויכוח סביב דרישות הוויזה, הפגמים במערכת ההגירה והיחס למהגרים לא מתועדים.",
      "השיחה דנה גם בוויזת O-1 לאנשים עם יכולת יוצאת דופן, מגבלות עבודה והמשמעות של הדגשת הישגים."
    ],
    "points": 218,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1706283950
  },
  {
    "id": 39143768,
    "title": "היכרות עם cssfact: מדחס CSS אבוד להפחתת יתירות בקוד",
    "originLink": "https://blog.danieljanus.pl/2024/01/26/lossy-css-compression/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39143768",
    "commentBody": "",
    "originSummary": [
      "רשומת הבלוג מציגה מדחס CSS בשם cssfact המפחית קוד CSS באמצעות פירוק לגורמים של מטריצה בינארית.",
      "הטכניקה של הפחתת מטריצות CSS מסייעת בזיהוי יתירות בבסיסי קוד CSS.",
      "CSSFACT שואפת להפיק גרסה דחוסה של קוד CSS עם פחות כללים."
    ],
    "commentSummary": [
      "הפוסט בבלוג מציג את הרעיון של דחיסה מאבדת עבור CSS ואת היתרונות הפוטנציאליים שלו בהקטנת גודל הקובץ.",
      "המחבר מציע לשקול את תדירות השימוש בכללים כדי לשפר את תהליך הדחיסה.",
      "המגיבים חולקים כלים ורעיונות נוספים הקשורים לדחיסת CSS, ויש דעות שונות על המעשיות והשימושיות של המושג. הפוסט כולל דוגמאות חיות וקוד לניסויים נוספים."
    ],
    "points": 218,
    "commentCount": 39,
    "retryCount": 0,
    "time": 1706283064
  },
  {
    "id": 39148336,
    "title": "הכלי מייצר שאלות חידון וכרטיסיות מסרטוני YouTube חינוכיים",
    "originLink": "https://www.platoedu.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39148336",
    "commentBody": "",
    "originSummary": [
      "הפרט פיתח כלי שמייצר שאלות חידון או כרטיסיות מסרטוני YouTube חינוכיים.",
      "הכלי משלב טכניקת חזרה במרווחים כדי לשפר את שימור הזיכרון.",
      "האדם מחפש משוב על הכלי ומוכן לספק מידע נוסף על פי בקשה."
    ],
    "commentSummary": [
      "המחבר פיתח אפליקציה שמייצרת שאלות חידון מסרטוני YouTube חינוכיים ומשתמשת בחזרות מרווחות.",
      "משתמשים מוצאים את האפליקציה מועילה ומציעים להוסיף תכונות כמו דיון קהילתי ורישום הערות אישי.",
      "יש ויכוח לגבי הערך של סרטוני בידור חינוכיים ורצון לשליטה רבה יותר בהמלצות יוטיוב כדי לתעדף חינוך בפועל."
    ],
    "points": 197,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1706303078
  },
  {
    "id": 39142560,
    "title": "tinySA Wiki מעודכן עם מידע על tinySA Ultra: מנתח ספקטרום קטן מחולל אותות",
    "originLink": "https://www.tinysa.org/wiki/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39142560",
    "commentBody": "",
    "originSummary": [
      "הוויקי של tinySA עודכן כדי לכלול מידע על tinySA Ultra, שהוא מנתח ספקטרום קטן ומחולל אותות.",
      "ה-tinySA Ultra וה-tinySA4 הם אותו מכשיר, כאשר ה-Ultra כולל מסך גדול יותר בגודל 4 אינץ' ופועל בטווחי תדרים רחבים יותר.",
      "ל-tinySA Basic יש מסך בגודל 2.8 אינץ' והוא פועל בטווחי תדרים ספציפיים, בעוד שלאולטרה יש תכונות נוספות כמו LNA מובנה וחריץ לכרטיס microSD."
    ],
    "commentSummary": [
      "הצבא האוקראיני משתמש ב-TinySA, מנתח ספקטרום קומפקטי ומחולל אותות, כדי לאתר מל\"טים רוסיים ביעילות.",
      "השיחה מתעמקת בטכנולוגיית ספקטרום מפוזר ובגישות חלופיות לגילוי ויירוט רחפנים.",
      "כלי ניטור וניתוח ספקטרום שונים, כגון NanoVNA ו- TinySA, נדונים, יחד עם הצעות לרכישת אוסצילוסקופים במחיר סביר ומדידת תדרים נמוכים וזיהוי מקורות הפרעה לתדרי רדיו."
    ],
    "points": 169,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1706277073
  },
  {
    "id": 39145701,
    "title": "PinePhone: שקית מעורבת של בעיות ביצועים וטלפון, על פי סקירה",
    "originLink": "https://yaky.dev/2024-01-25-pinephone-post-daily-driver-review/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39145701",
    "commentBody": "",
    "originSummary": [
      "ה- PinePhone הוא מכשיר לינוקס נייד עם ביצועים טובים אך יש לו בעיות עם יכולות הטלפון.",
      "יש לו תכונות סטנדרטיות ותצוגה הגונה, אך קשה לראות אותו באור בהיר ויש לו חיי סוללה ממוצעים.",
      "סביבות שולחן העבודה Phosh ו- SXMO נדונות, כל אחת עם נקודות החוזק והחולשה שלה.",
      "קיימות מגבלות בעריכת קבצי YAML ושימוש ב- wvkbd לשימוש מסוף.",
      "משתמשים דיווחו על בעיות במודם, במיוחד עם VoLTE, וכתוצאה מכך קריסות וקשיים בשיחות.",
      "גרסאות שונות של קושחה ומערכת הפעלה נוסו, אך הבעיות נמשכות.",
      "המצלמה עובדת אך יש לה עיבוד איטי לאחר עיבוד ויכולות צילום וידאו מוגבלות.",
      "אפליקציות ניווט לא מקוונות מוגבלות גם הן.",
      "ישנם אתגרים עם הפעלת Spotify בלקוחות Linux ניידים והשימוש המומלץ ב- Firefox ESR כדפדפן ברירת המחדל.",
      "בסך הכל, PinePhone הוא מעשי עבור משימות יומיומיות אבל יש מגבלות כמו טלפון."
    ],
    "commentSummary": [
      "משתמשים דנים בחוויות שלהם עם מכשירים ניידים הפועלים על לינוקס, כולל PinePhone, Librem 5 ו- Ubuntu Touch, תוך התמקדות בתחומים כמו ביצועי תוכנה, מגבלות חומרה וממשקי משתמש.",
      "האתגרים של יצירת התקני קוד פתוח מלאים במחיר סביר מודגשים, כמו גם חששות לגבי אמינותם ואימוצם המיינסטרים.",
      "הדיונים מכסים גם נושאים כגון שיתוף קבצים, סנכרון תמונות, גישת שורש במכשירי Android והעלות והזמינות של שירותי SMS."
    ],
    "points": 165,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1706292304
  },
  {
    "id": 39148544,
    "title": "Google TPU v5p עולה בביצועיו על Nvidia H100 עבור עומסי עבודה של בינה מלאכותית",
    "originLink": "https://www.techradar.com/pro/google-is-rapidly-turning-into-a-formidable-opponent-to-bff-nvidia-the-tpu-v5p-ai-chip-powering-its-hypercomputer-is-faster-and-has-more-memory-and-bandwidth-than-ever-before-beating-even-the-mighty-h100",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39148544",
    "commentBody": "",
    "originSummary": [
      "גוגל השיקה את TPU v5p, גרסה משודרגת של שבב הבינה המלאכותית של יחידת עיבוד הטנזור שלה, עם מהירות, זיכרון ורוחב פס משופרים בהשוואה לקודמו.",
      "TPU v5p נמצא בשימוש בהיפר-מחשב AI של גוגל ומתגאה באימון מהיר עד פי 2.8 עבור מודלי שפה גדולים.",
      "המעבדים הגרפיים המותאמים אישית של גוגל משמשים באופן פנימי, וה-TPU v5p החדש נחשב למתחרה חזק למעבד הגרפי H100 של Nvidia למשימות AI, אם כי יש צורך בהשוואת ביצועים נוספת כדי ליצור השוואת ביצועים מדויקת."
    ],
    "commentSummary": [
      "הדיון סוקר את חומרת ה-TPU של גוגל ואת המעבדים הגרפיים של Nvidia, ומדגיש את חשיבותם בתחום הבינה המלאכותית.",
      "התחרות בין מסגרות כמו PyTorch ו-CUDA נבדקת, ומדגישה את חשיבות החומרה.",
      "נדונים הפוטנציאל של TPUs בלמידת מכונה והאתגרים והמגבלות של שימוש בחומרה מיוחדת למשימות AI."
    ],
    "points": 157,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1706303923
  },
  {
    "id": 39144740,
    "title": "בעלי פיקסל נתקלים בבעיות לאחר עדכון Google Play בינואר 2024",
    "originLink": "https://www.bleepingcomputer.com/news/google/google-pixel-phones-unusable-after-january-2024-system-update/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39144740",
    "commentBody": "",
    "originSummary": [
      "בעלי סמארטפונים מסוג Google Pixel נתקלו בבעיות שונות לאחר עדכון מערכת בינואר 2024, כולל בעיות בגישה לאחסון הפנימי, שימוש במצלמה, צילום צילומי מסך ופתיחת אפליקציות.",
      "משתמשים מסוימים ניסו לפתור את הבעיות על ידי איפוס היצרן של המכשירים שלהם, אך הדבר הוביל לאובדן נתונים.",
      "גוגל מודעת לבעיה וחוקרת בימים אלה, מה שמעלה חששות לגבי פרוטוקולי אבטחת האיכות והבדיקות של החברה. המידע המסופק במאמר כולל כללים מפורומים מקוונים, פרטים מאתרי אינטרנט וקוד JavaScript הקשור לאתר אינטרנט בשם BleepingComputer."
    ],
    "commentSummary": [
      "משתמשי טלפון פיקסל נתקלו בבעיות לאחר התקנת עדכון Google Play בינואר 2024, במיוחד בעיות אחסון.",
      "ספקולציות מצביעות על כך שהחומרה, ולא העדכון, עשויה להיות הגורם לבעיות אלה.",
      "חוסר שביעות רצון מגוגל ואפל בא לידי ביטוי, כאשר חלק מהמשתמשים שוקלים להחליף מותגים. ישנם גם דיווחים על בעיות צימוד בין שעוני Garmin לטלפונים של Pixel, מה שמוביל לחשדות לבעיות מכוונות שנגרמו על ידי Google.",
      "הדיון נוגע גם באיזון בין נוחות ואבטחה בטכנולוגיה לבין חששות לגבי אבטחת איכות תוכנה.",
      "הנושא הכללי של השיחה הוא תסכול מחברות הטכנולוגיה ומעדכוני התוכנה שלהן."
    ],
    "points": 157,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1706287779
  },
  {
    "id": 39146385,
    "title": "השבתה של Microsoft Teams גורמת לבעיות חיבור, בעיות התחברות ועיכובים בהודעות",
    "originLink": "https://www.bleepingcomputer.com/news/microsoft/microsoft-teams-outage-causes-connection-issues-message-delays/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39146385",
    "commentBody": "",
    "originSummary": [
      "Microsoft חוקרת השבתה נרחבת המשפיעה על משתמשים בפלטפורמת התקשורת Teams שלה, וגורמת לבעיות קישוריות, קשיי כניסה ועיכובים בהודעות.",
      "החברה פועלת באופן פעיל כדי לתקן את הבעיה והבחינה בסימני שיפור לאחר יישום מעבר לגיבוי בעת כשל באזור EMEA.",
      "הפוסט כולל גם קטעי קוד המדגימים פונקציות JavaScript ומטפלים באירועים לשליטה בהתנהגות דפי אינטרנט, כגון הדפסה, גלילה, תפריטים נפתחים וחלונות קופצים."
    ],
    "commentSummary": [
      "המשתמשים מתוסכלים מ- Microsoft Teams עקב בעיות חיבור, עיכובים בהודעות ותקלות.",
      "התלונות כוללות זמני טעינה איטיים, קריסות והיעדר תכונות בהשוואה לאלטרנטיבות כמו סלאק.",
      "חלק מהמשתמשים התרגלו לביצועים הגרועים של Teams למרות בעיות מתמשכות והשבתות."
    ],
    "points": 156,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1706295044
  }
]
