[
  {
    "id": 41534716,
    "title": "크라우드스트라이크 전 직원들: '품질 관리는 우리의 과정에 포함되지 않았다'",
    "originLink": "https://www.semafor.com/article/09/12/2024/ex-crowdstrike-employees-detail-rising-technical-errors-before-july-outage",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41534716",
    "commentBody": "",
    "originSummary": [
      "전직 크라우드스트라이크 직원들은 속도를 품질보다 우선시한 것이 소프트웨어 실패로 이어져 항공사와 은행 서비스를 방해하고, 850만 대의 컴퓨터에 영향을 미치며 54억 달러의 손실을 초래했다고 주장했습니다.",
      "급한 마감일과 과도한 업무량에 대한 불만이 1년 넘게 무시되었고, 그 결과 코딩 오류가 증가하고 교육이 불충분해졌습니다.",
      "그 사건은 예상 거래에서 6천만 달러의 손실과 CrowdStrike의 주식 시장 가치의 상당한 하락을 초래하여, CEO 조지 커츠가 향후 예방 조치를 약속하게 만들었다."
    ],
    "commentSummary": [
      "전직 CrowdStrike 직원들은 개발에서 속도를 안전보다 우선시하는 회사의 방침이 주요 글로벌 중단 및 기타 문제를 초래했다고 주장합니다.",
      "그들은 품질 관리가 우선시되지 않았다고 주장하며, 이는 철저한 테스트보다 신속한 코드 배포를 중시하는 더 넓은 기술 산업의 경향을 반영한다고 말합니다.",
      "일부는 비판이 편향적일 수 있다고 주장하며 CrowdStrike를 옹호하지만, 회사의 최근 중대한 실패는 이러한 주장에 신빙성을 더해준다."
    ],
    "points": 513,
    "commentCount": 264,
    "retryCount": 0,
    "time": 1726258638
  },
  {
    "id": 41534474,
    "title": "OpenAI는 사고 과정에 대해 묻는 것에 대해 o1 접근 권한을 철회하겠다고 위협합니다",
    "originLink": "https://twitter.com/SmokeAwayyy/status/1834641370486915417",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41534474",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenAI는 사고 과정에 대해 문의하는 사용자들의 접근을 철회하는 것을 고려하고 있으며, 이는 투명성과 경쟁력에 대한 우려를 불러일으키고 있습니다.",
      "추측에 따르면 OpenAI는 독점 기술을 보호하거나 대중 관계 문제를 피하기 위해 그렇게 할 수 있으며, 다른 사람들은 경쟁자가 그들의 기술을 복제하는 것을 방지하기 위한 것이라고 믿고 있습니다.",
      "이 상황은 AI 안전, 투명성, 상업적 이익 간의 지속적인 긴장을 강조합니다."
    ],
    "points": 484,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1726256614
  },
  {
    "id": 41536088,
    "title": "10년 동안 드라이브 고장 없이 운영된 71 TiB ZFS NAS",
    "originLink": "https://louwrentius.com/my-71-tib-zfs-nas-after-10-years-and-zero-drive-failures.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41536088",
    "commentBody": "",
    "originSummary": [
      "24개의 4TB 드라이브로 구성된 4U 71 TiB ZFS NAS는 사용하지 않을 때 서버를 꺼두는 덕분에 10년 넘게 드라이브 고장 없이 운영되었습니다.",
      "NAS는 마더보드와 전원 공급 장치를 교체했지만 여전히 신뢰할 수 있으며, 정기적인 스크럽 동안 체크섬 오류 없이 1페타바이트 이상의 데이터를 처리하고 있습니다.",
      "네트워킹 업그레이드는 쿼드 포트 기가비트에서 인피니밴드로, 이후 10기가비트 이더넷 카드로 성능을 향상시켰으며, 맞춤형 팬 제어 스크립트는 시스템을 조용하게 유지합니다."
    ],
    "commentSummary": [
      "한 사용자가 71 TiB ZFS NAS를 10년 동안 드라이브 고장 없이 운영한 경험을 공유하면서 드라이브 신뢰성과 저장 전략에 대한 논의를 촉발시켰습니다.",
      "유사한 마모로 인한 동시 드라이브 고장 위험과 배치 관련 문제를 피하기 위해 드라이브 구매를 다양화하는 것의 중요성에 대한 우려가 제기되었습니다.",
      "대화는 또한 소음을 줄이고 전력 소비를 줄이기 위해 NAS 냉각에 대형 저속 팬을 사용하는 것의 이점에 대해 다루었으며, 일부 사용자는 특정 팬 구성에 대한 긍정적인 경험을 공유했습니다."
    ],
    "points": 386,
    "commentCount": 269,
    "retryCount": 0,
    "time": 1726269670
  },
  {
    "id": 41539125,
    "title": "Meet.hn – 당신의 도시에서 해커 뉴스 커뮤니티를 만나보세요",
    "originLink": "https://news.ycombinator.com/item?id=41539125",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41539125",
    "commentBody": "",
    "originSummary": [
      "새로운 플랫폼 https://meet.hn이(가) 출시되어 사용자가 자신의 위치와 관심사를 지도에 추가하여 자신의 도시에서 해커를 찾고 연결할 수 있도록 도와줍니다.",
      "창작자는 툴루즈와 같이 산업 중심이 강한 도시에서 특히 해커 뉴스(HN) 커뮤니티 내의 커뮤니티 연결을 촉진하는 것을 목표로 합니다.",
      "이 프로젝트는 오픈 소스이며 다른 HN 도구와 통합되어 사용자들이 피드백을 공유하고 개발에 기여하도록 장려합니다."
    ],
    "commentSummary": [
      "새로운 플랫폼 meet.hn이 출시되어 Hacker News(HN) 사용자들이 자신의 위치와 관심사를 지도에 추가하여 같은 도시에 있는 다른 사용자들과 연결될 수 있도록 도와줍니다.",
      "사용자는 사용자 이름, 도시 및 국가를 입력하는 양식을 작성한 후 생성된 텍스트를 HN 설명에 붙여넣어 지도에 자신을 추가할 수 있습니다.",
      "플랫폼은 마스토돈 지원, 발음 구별 기호 처리, 더 나은 도시 이름 구분과 같은 추가 기능 요청을 포함하여 상당한 관심과 피드백을 받았습니다."
    ],
    "points": 345,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1726313760
  },
  {
    "id": 41535354,
    "title": "러스트 매크로로 구현된 리스프",
    "originLink": "https://github.com/RyanWelly/lisp-in-rs-macros",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41535354",
    "commentBody": "",
    "originSummary": [
      "**lisp-in-rs-macros**는 Rust의 선언적 매크로로만 작성된 Lisp 인터프리터로, 컴파일 시간에 Lisp 코드를 평가할 수 있게 해줍니다.",
      "`lisp!` 매크로는 Lisp 코드를 계산된 값의 문자열 표현으로 확장하여, 250줄 이하의 코드로 Rust의 매크로 기능을 보여줍니다.",
      "주요 기능으로는 `DEFINE`, `QUOTE`, `LAMBDA`, `PROGN`과 같은 기본적인 Lisp 형식을 지원하지만, 명시적인 재귀는 지원하지 않으며, 이는 자기 적용을 위한 람다 함수를 사용하여 해결할 수 있습니다."
    ],
    "commentSummary": [
      "러스트 매크로를 사용하여 리스프 구현이 만들어져 기술 커뮤니티에서 큰 관심과 논의를 불러일으켰습니다.",
      "이 프로젝트는 대시 기호가 있는 기호를 처리하는 등의 몇 가지 제한 사항에도 불구하고 Rust의 매크로 시스템의 유연성과 강력함을 강조합니다.",
      "논의는 또한 Greenspun의 열 번째 규칙에 대해 다루고 있는데, 이는 충분히 복잡한 프로그램은 결국 Common Lisp의 절반을 구현하게 된다는 유머러스한 제안을 통해 프로그래밍 복잡성의 본질을 반영하고 있습니다."
    ],
    "points": 272,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1726263073
  },
  {
    "id": 41540795,
    "title": "기만의 정도: 미국 대학들이 어떻게 부채 공장이 되었는가",
    "originLink": "https://anandsanwal.me/college-student-debt-deception/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41540795",
    "commentBody": "",
    "originSummary": [
      "미국의 학자금 대출 시스템은 1.7조 달러의 부채 거품을 만들어냈으며, 대출금은 파산 시에도 탕감되지 않아 차용자들에게 심각한 재정적 결과를 초래하고 있습니다.",
      "잘못된 인센티브와 규제 포획으로 인해 대학들은 교육의 질을 향상시키지 않고도 학비를 인상할 수 있으며, 그 결과 높은 미취업률과 낮은 졸업률이 발생합니다.",
      "제안된 해결책으로는 파산 시 대출을 면제해주는 것, 학위 가치에 대출을 연계하는 것, 그리고 기관에 책임을 묻는 것이 포함되지만, 강력한 기득권 때문에 이를 실행하기는 어렵습니다."
    ],
    "commentSummary": [
      "미국의 대학들은 경력 외주화, 학위 취득 압박, 느슨한 공공 자금 지원 기준을 통해 학생 부채에 기여하고 있다는 비판을 받고 있다.",
      "학비 상승과 대출자의 위험을 제거하는 정부 지원 대출은 특히 재정적 문해력이 낮은 학생들에게 부채 문제를 악화시킵니다.",
      "제안된 해결책에는 파산 시 학생 대출을 탕감할 수 있도록 하고 고등 교육 자금 조달을 개혁하는 것이 포함됩니다."
    ],
    "points": 193,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1726331130
  },
  {
    "id": 41534483,
    "title": "자넷 잭슨은 노트북 컴퓨터를 다운시킬 수 있는 능력을 가지고 있었다 (2022)",
    "originLink": "https://devblogs.microsoft.com/oldnewthing/20220816-00/?p=106994",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41534483",
    "commentBody": "",
    "originSummary": [
      "Raymond Chen이 작성한 상세 시리즈에서 AArch64 프로세서, 즉 arm64에 대해 다루고 있으며, 16부에서는 조건부 실행에 대해 논의하고 있습니다.",
      "조건부 실행은 특정 조건에 따라 특정 명령이 실행되도록 하여 arm64 아키텍처에서 효율성과 성능을 향상시킵니다.",
      "이 시리즈는 저수준 프로그래밍과 현대 프로세서 아키텍처의 복잡성을 이해하는 데 관심이 있는 사람들에게 중요합니다."
    ],
    "commentSummary": [
      "자넷 잭슨의 음악은 공진 주파수로 인해 특정 노트북 하드 드라이브를 고장낼 수 있어, 이는 특이한 기술 현상을 부각시킨다.",
      "사용자들은 파울리 효과와 '시연 효과'를 포함한 기술 오작동에 대한 개인적인 경험담을 공유했습니다.",
      "논의는 또한 HVAC 장치에 있는 노트북과 같은 하드웨어에 영향을 미치는 외부 요인에 대해 다루었으며, 공명 문제를 설명하기 위해 타코마 내로스 다리 붕괴를 언급했습니다."
    ],
    "points": 193,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1726256685
  },
  {
    "id": 41535694,
    "title": "OpenAI o1 ARC-AGI-Pub 결과",
    "originLink": "https://arcprize.org/blog/openai-o1-results-arc-prize",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41535694",
    "commentBody": "",
    "originSummary": [
      "OpenAI는 새로운 o1-preview 및 o1-mini 모델을 도입했으며, 이 모델들은 중간 단계가 있는 작업에서 실수를 줄이는 연쇄적 사고(Chain-of-Thought, CoT) 추론에서 유망한 성과를 보이고 있습니다.",
      "이 모델들은 ARC Prize 리더보드에서 GPT-4o보다 뛰어난 성능을 보이지만 Claude 3.5 Sonnet보다 시간이 더 걸리며, 이는 정확성과 계산 시간 간의 균형을 강조합니다.",
      "OpenAI의 새로운 강화 학습 알고리즘과 합성 CoT는 훈련을 향상시키지만, 계산 효율성은 여전히 도전 과제로 남아 있으며, AGI를 발전시키기 위한 새로운 아이디어의 필요성을 시사합니다."
    ],
    "commentSummary": [
      "OpenAI의 o1 모델은 ARC-AGI 벤치마크에서 이전 모델들이 어려움을 겪었던 과제를 해결하며 성능이 향상되었음을 보여주지만, 여전히 Anthropic의 Claude 3.5 Sonnet보다 속도가 느립니다.",
      "토론은 인간 피드백의 중요성, 현재 AI 벤치마크의 한계, 그리고 AI 발전에 있어 멀티모달 모델의 잠재력을 강조합니다.",
      "ARC-AGI 벤치마크가 AGI에 대한 의미 있는 테스트인지에 대한 논쟁이 있으며, 일반 지능을 이해하는 데 미치는 영향에 대해 의견이 분분하다."
    ],
    "points": 183,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1726265666
  },
  {
    "id": 41539235,
    "title": "극단적인 인간 노화에 대한 데이터는 내부에서부터 썩어가고 있다",
    "originLink": "https://theconversation.com/the-data-on-extreme-human-ageing-is-rotten-from-the-inside-out-ig-nobel-winner-saul-justin-newman-239023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41539235",
    "commentBody": "",
    "originSummary": [
      "UCL의 연구원인 사울 저스틴 뉴먼은 105세 이상의 나이에 대한 보고된 부정확성을 강조하며 극단적인 인간 노화에 대한 주장을 반박한 공로로 이그 노벨상을 수상했습니다.",
      "뉴먼의 연구는 높은 장수로 유명한 블루 존으로 알려진 지역들이 기록 보존이 부실하고 연금 사기로 인해 종종 의심스러운 데이터를 가지고 있다고 지적합니다.",
      "그는 현재 데이터가 자주 오류와 부정확성으로 인해 결함이 있기 때문에 나이를 측정하는 더 신뢰할 수 있는 방법을 만들기 위해 물리학자를 참여시키는 것을 제안합니다."
    ],
    "commentSummary": [
      "극단적인 인간 노화에 대한 논의는 데이터의 결함을 드러내며, 사용자들은 개인적인 일화를 공유하고 활동적인 생활 방식과 악습을 피하는 것이 주요 요인이라고 강조합니다.",
      "논쟁에는 건물의 높은 층이 신체 활동을 촉진하는 것과 같은 생활 조건의 영향과 노화에 있어 유전적 및 환경적 요인의 역할이 포함됩니다.",
      "일부 지역에서 나이 기록의 정확성에 대한 회의론은 극단적인 나이 주장 검증의 복잡성과 장수의 다면적인 특성을 강조합니다."
    ],
    "points": 177,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1726315049
  },
  {
    "id": 41536131,
    "title": "인텔, 군사용 칩 제조를 위한 35억 달러 계약 확정",
    "originLink": "https://www.bloomberg.com/news/articles/2024-09-13/intel-solidifies-3-5-billion-deal-to-make-chips-for-us-military",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41536131",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "인텔은 1997년에 방위 산업에서 철수한 후 다시 방위 산업에 복귀하며 35억 달러 규모의 군용 칩 생산 계약을 체결했습니다.",
      "이 조치는 TSMC와 삼성과 같은 기업들로부터의 경쟁 압력 속에서 수익원을 다각화하려는 인텔의 전략적 변화를 반영합니다.",
      "이 거래는 안전한 공급망을 보장하기 위해 국내 반도체 생산을 추진하는 미국 정부의 노력과 일치합니다."
    ],
    "points": 166,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1726270180
  },
  {
    "id": 41540902,
    "title": "테렌스 타오가 O1에 대해",
    "originLink": "https://mathstodon.xyz/@tao/113132502735585408",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41540902",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "이 O1 모델은 벡터 유사성 프로젝트를 위한 최적화된 Rust 코드에서 상당한 속도 향상을 보여주었으며, 특정 작업에서 GPT-4o와 Claude3.5를 능가했습니다.",
      "사용자들은 O1이 새로운 통계적 의존성 측정 방법을 구상하는 데 도움이 되며, 초기에는 약간의 디버깅이 필요할 수 있지만 정규화된 상호 정보의 빠른 구현을 제공한다고 보고했습니다.",
      "이 논의는 코딩 및 연구에서 대형 언어 모델(LLM)의 진화하는 유용성을 강조하며, 효과적인 프롬프트의 중요성과 복잡한 문제 해결 작업에서 LLM이 도움을 줄 수 있는 잠재력을 강조합니다."
    ],
    "points": 157,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1726332064
  },
  {
    "id": 41536961,
    "title": "Void는 백만 개 이상의 안드로이드 TV 박스를 포획합니다",
    "originLink": "https://news.drweb.com/show/?i=14900",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41536961",
    "commentBody": "",
    "originSummary": [
      "닥터 웹 전문가들은 197개국에서 약 130만 대의 안드로이드 TV 박스에 영향을 미치는 악성코드 감염, Android.Vo1d를 확인했습니다.",
      "악성 소프트웨어는 서드파티 소프트웨어를 설치하고 시스템 파일을 수정하여 자동 실행을 보장하며, 패치되지 않은 취약점이 있는 구형 안드로이드 버전을 대상으로 합니다.",
      "Dr.Web 안티바이러스는 Android.Vo1d의 모든 알려진 변종을 탐지하고 치료할 수 있어, 영향을 받은 사용자들에게 해결책을 제공합니다."
    ],
    "commentSummary": [
      "백만 개 이상의 안드로이드 TV 박스가 해킹되어, 구형 안드로이드 버전을 실행하는 기기의 취약성이 부각되고 있습니다.",
      "문제는 제조업체가 업데이트를 제공하지 않아 패치되지 않은 보안 결함과 강제적인 노후화로 이어지는 데서 비롯됩니다.",
      "이 상황은 잠긴 장치의 더 넓은 문제와 장기적인 지원 및 보안을 보장하기 위한 오픈 소스 펌웨어 또는 대체 운영 체제의 필요성을 강조합니다."
    ],
    "points": 133,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1726279961
  },
  {
    "id": 41540362,
    "title": "Rust로 운영체제 작성하기",
    "originLink": "https://github.com/phil-opp/blog_os",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41540362",
    "commentBody": "",
    "originSummary": [
      "‘Rust로 운영체제 작성하기’ 시리즈는 os.phil-opp.com에서 호스팅되며, Rust 프로그래밍 언어를 사용하여 운영체제를 구축하는 단계별 튜토리얼을 제공합니다.",
      "각 튜토리얼의 소스 코드는 별도의 git 브랜치로 구성되어 있으며, 사용자는 `git worktree`를 사용하여 \"post-10\"과 같은 특정 브랜치를 체크아웃할 수 있습니다. 예를 들어 Heap Allocation을 위한 브랜치가 있습니다.",
      "이 프로젝트는 독립 실행형 Rust 바이너리 생성, 커널 개발, VGA 텍스트 모드, 테스트, 인터럽트, 메모리 관리 및 멀티태스킹을 포함한 다양한 주제를 다룹니다."
    ],
    "commentSummary": [
      "이 게시물은 많은 개발자들에게 영감을 준 Phil Opp의 튜토리얼을 강조하며 Rust 프로그래밍 언어를 사용한 운영 체제(OS) 개발에 대해 논의합니다.",
      "여러 운영 체제 프로젝트와 자원이 언급되었으며, Tock-OS, Oxid-OS, Hubris, Redox가 포함되어 있습니다. 실시간 운영 체제(RTOS)와 Embassy 및 RTIC와 같은 프레임워크에 중점을 두고 있습니다.",
      "커뮤니티 피드백은 Phil Opp의 튜토리얼의 가치와 특히 메모리 안전성과 자원 관리와 관련하여 OS 개발에서 Rust의 광범위한 영향을 강조합니다."
    ],
    "points": 122,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1726327190
  },
  {
    "id": 41536003,
    "title": "성검의 전설: 집중력 향상을 위한 몰입형 경험",
    "originLink": "https://arxiv.org/abs/2408.16782",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41536003",
    "commentBody": "",
    "originSummary": [
      "연구자들은 성검을 뽑는 몰입형 경험을 통해 집중력을 향상시키기 위해 '성검의 전설'이라는 VR 시스템을 개발했습니다.",
      "시스템은 사용자가 집중력을 의식적으로 조절하는 능력을 향상시키기 위해 시각, 청각, 촉각을 포함한 다중 모드 피드백을 제공합니다.",
      "이 혁신적인 접근법은 인간-컴퓨터 상호작용 카테고리로 arXiv에 제출된 논문에 자세히 설명되어 있으며, 집중력 향상 기술에 미칠 잠재적 영향을 강조하고 있습니다."
    ],
    "commentSummary": [
      "새로운 몰입형 경험인 '성검의 전설'은 집중력을 향상시키는 것을 목표로 하며, 아서 왕 전설에서 아서가 힘이 아닌 자격으로 돌에서 검을 뽑아내는 이야기에 영감을 받았습니다.",
      "이 논의는 파탄잘라 아쉬탕가 요가의 명상 연습과 스포츠에서 사용되는 '조용한 눈' 기법을 포함하여 집중력을 향상시키기 위한 다양한 기술들을 강조합니다.",
      "이 경험이 집중력에 미치는 효과를 측정하는 연구에 대한 기대가 있지만, 진행하기 위해서는 추가 자금이 필요합니다."
    ],
    "points": 122,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1726268844
  },
  {
    "id": 41536137,
    "title": "미국, 전자상거래 그룹 Temu와 Shein이 사용하는 무역 허점을 겨냥하다",
    "originLink": "https://www.ft.com/content/2f07510b-d2c6-4bae-bae3-aa5dfa8bd796",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41536137",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "미국은 전자상거래 회사인 Temu와 Shein이 악용한 무역 허점을 해결하고 있으며, 이는 결함 있는 제품과 펜타닐과 같은 불법 약물의 차단을 복잡하게 만듭니다.",
      "관계자들은 많은 양의 소포로 인해 이러한 배송을 가로채는 것이 어렵다고 주장하지만, 일부는 대부분의 펜타닐이 중국이 아닌 멕시코를 통해 미국에 들어온다고 믿고 있습니다.",
      "그 논쟁은 국제 무역, 마약 밀수 및 지역 경제에 영향을 미치는 의도치 않은 결과 없이 무역 허점을 막는 복잡성을 강조한다."
    ],
    "points": 112,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1726270271
  }
]
