[
  {
    "title": "중국의 빅 테크 기업, 화웨이의 하모니OS 앱 빌더 모집에 참여하다",
    "originLink": "https://www.scmp.com/tech/big-tech/article/3241371/chinese-big-tech-firms-jdcom-netease-and-meituan-rush-hire-harmonyos-based-app-developers-huawei",
    "originBody": "",
    "originSummary": [
      "JD.com, 넷이즈, 메이투안 등 중국의 거대 인터넷 기업들이 화웨이의 하모니OS 모바일 플랫폼에서 프로젝트를 수행할 앱 개발자를 적극적으로 채용하고 있습니다.",
      "이번 채용은 중국 본토에서 하모니OS를 구글 안드로이드 생태계의 유력한 대안으로 자리매김하려는 화웨이의 전략과도 일치합니다.",
      "현재 7억 대 이상의 디바이스에서 하모니OS를 실행하고 있으며, 220만 명 이상의 타사 개발자가 이 플랫폼용 앱을 개발하고 있습니다. 곧 출시될 하모니OS 넥스트는 더 이상 안드로이드 기반 앱을 지원하지 않습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "신호 손실과 업계 혼란에 대한 우려가 커지면서 애드테크 기업들이 직면한 과제들",
    "originLink": "https://digiday.com/media/independent-ad-tech-continues-to-tick-along-even-as-storm-clouds-gather-overhead/",
    "originBody": "",
    "originSummary": [
      "2023년 3분기 퍼블릭 애드테크 기업들의 실적이 엇갈리면서 투자자들 사이에서 신호 손실, 애드테크 공급망의 혼란, 미디어 시장 약화에 대한 우려가 커지고 있습니다.",
      "더 트레이드 데스크의 매출이 전년 대비 25% 증가했음에도 불구하고 일부 애드테크 기업의 주가는 하락했습니다.",
      "매그나이트, 펍매틱, 크리테오는 소폭의 매출 증가를 보였지만, 크리테오는 홀리데이 시즌의 시작이 더뎠다고 밝혔습니다. 업계의 경쟁 심화로 인해 수익이 감소할 수 있습니다. 애드 테크 기업들은 또한 구글의 써드파티 쿠키 단계적 폐지의 영향에 대비하고 있습니다. 전반적으로 애드테크 업계에서는 신중한 태도를 취하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "이스라엘 기술 산업, 위기 속에서도 회복력을 발휘하다",
    "originLink": "https://www.alleywatch.com/2023/11/down-but-not-out-amidst-its-biggest-crisis-in-50-years-some-are-rooting-for-the-demise-of-israeli-tech-dont-bet-on-it/",
    "originBody": "",
    "originSummary": [
      "이스라엘 기술 산업은 정치적, 군사적 도전에 직면했지만 회복력과 강인함을 보여주었습니다.",
      "이스라엘 기술 기업들을 고립시키려는 시도에도 불구하고 이스라엘 기술 기업들은 글로벌 기술 발전에서 중요한 역할을 계속하고 있습니다.",
      "최근의 분쟁과 예비군 소집으로 인해 기술 기업들은 인력 손실, 투자 및 M&A 거래 동결 등의 어려움을 겪고 있습니다.",
      "긴급 자금, 신규 투자 자금, 정부 지원으로 이스라엘 기술 생태계가 지원되고 있습니다.",
      "현재 위기의 결과는 불확실하지만 이스라엘 기술 산업은 어려움을 딛고 다시 일어선 역사를 가지고 있으며 이번 위기도 극복할 의지를 가지고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "중국의 하이테크 제조업 대출로 과잉 생산 능력과 저가 수출에 대한 우려 제기",
    "originLink": "https://www.reuters.com/world/china/with-manufacturing-loans-rising-can-china-avoid-new-supply-glut-2023-11-12/",
    "originBody": "",
    "originSummary": [
      "중국은 반도체 및 전기 자동차(EV)와 같은 첨단 제조업에 대출을 우선적으로 제공하고 있어 과잉 생산과 값싼 수출품의 유입 가능성에 대한 우려가 제기되고 있습니다.",
      "제조업 부문에 대한 대출은 크게 증가한 반면, 문제가 있는 부동산 부문에 대한 대출은 감소했습니다.",
      "이러한 추세로 인해 특히 중국의 전기차 보조금에 대한 조사를 시작한 유럽의 일부 무역 파트너들은 우려하고 있습니다.",
      "중국의 목표는 첨단 제조업의 글로벌 리더가 되는 것이지만, 비평가들은 제조업에 대한 이러한 집중이 국내 소비를 희생시킬 수 있다고 주장합니다.",
      "하이테크 제조업에 대한 투자가 증가하면서 리튬 이온 배터리 및 자동차 제조업체와 같은 산업에서 과잉 생산에 대한 우려도 커지고 있습니다.",
      "그러나 중국 생산은 글로벌 인플레이션을 안정시키고 경쟁력을 높이는 데 도움이 될 수 있습니다.",
      "각국이 자국 첨단 산업을 우선시함에 따라 무역 긴장이 지속될 수 있으며, 시장의 힘으로 인해 일부 기업이 문을 닫을 수도 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "아르메니아 미국 진출을 노리는 유럽 스타트업의 성장 허브, 아르메니아",
    "originLink": "https://tech.eu/2023/11/13/from-yerevan-to-silicon-valley-the-rise-of-armenias-collaborative-startup-ecosystem/",
    "originBody": "",
    "originSummary": [
      "아르메니아는 번성하는 스타트업 생태계로 부상하고 있으며, 미국으로 진출하려는 유럽 스타트업과 투자자들을 끌어들이고 있습니다.",
      "아르메니아의 내수 시장이 작기 때문에 스타트업은 더 나은 성장 전망을 위해 미국에서 규모를 확장하는 경우가 많습니다.",
      "아르메니아의 협업과 공유 문화는 혁신을 장려하고 초기 단계의 창업자들이 성공적인 비즈니스 리더에게 조언을 구할 수 있게 해줍니다.",
      "아르메니아에서 주목할 만한 성공적인 스타트업으로는 ServiceTitan, Picsart, Krisp, 팟캐슬, 코드시그널, Sololearn 등이 있습니다.",
      "아르메니아 정부는 스타트업에 세금 인센티브를 제공하여 기술 기업가 정신을 지원합니다.",
      "이 나라는 과학 혁신의 역사가 깊고 다양한 기술 기업과 혁신 센터의 본거지입니다.",
      "아르메니아의 재능 있는 개인과 미국 간의 이주 경로를 통해 무역 혜택을 누릴 수 있습니다.",
      "아르메니아는 또한 TUMO와 같은 무료 방과 후 교육 프로그램을 통해 차세대 혁신가를 양성하는 데 주력하고 있습니다.",
      "주목할 만한 아르메니아 스타트업으로는 Softr, Expper Technologies, Zoomerang, Lucky Carrot, Prelaunch, Wordbook 등이 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "새로운 보고서에 따르면, 기술 기업이 직원들의 급여 만족도에서 선두를 달리고 있습니다.",
    "originLink": "https://www.cnbc.com/2023/11/12/workers-at-these-15-companies-are-happiest-with-their-pay-says-comparably-2023-report.html",
    "originBody": "",
    "originSummary": [
      "Comparably의 직원 리뷰에 따르면 기술 회사, 특히 사이버 보안 회사가 직원들의 급여 만족도 측면에서 선두를 달리고 있습니다.",
      "근로자가 급여에 대해 가장 행복하다고 느끼는 상위 3개 기업은 Workday, Boston Consulting Group, Uber입니다.",
      "Workday, Adobe, AT&T와 같이 급여 투명성과 급여 형평성을 우선시하는 기업은 평균 만족도 점수가 87.5점으로 전체 평균 점수인 63.5점보다 높아 직원들의 긍정적인 반응을 얻었습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  },
  {
    "title": "Microsoft 직원, OpenAI의 ChatGPT 사용이 일시적으로 차단되었지만 협업은 계속됩니다.",
    "originLink": "https://techwireasia.com/2023/11/is-microsoft-blocking-openai-or-is-it-just-a-testing-error/",
    "originBody": "",
    "originSummary": [
      "Microsoft 직원들은 테스트 오류로 인해 일시적으로 OpenAI의 ChatGPT 사용이 차단되는 문제를 경험했지만 이 문제는 빠르게 해결되었습니다.",
      "소셜 미디어에서 소문과 우려가 제기되었지만 OpenAI의 CEO는 Microsoft에 대한 OpenAI의 보복은 없었다고 확인했습니다.",
      "이 사건에도 불구하고 Microsoft와 OpenAI는 여전히 AI 기술 개발을 위해 협력하고 있으며, 기업들은 제너레이티브 AI 챗봇의 데이터 보안 문제로 인해 대체 솔루션을 모색하고 자체 AI 도구를 개발하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699880830125
  }
]
