[
  {
    "id": 40782130,
    "title": "জুলিয়ান অ্যাসাঞ্জ যুক্তরাষ্ট্রের সাথে একটি আপস চুক্তিতে পৌঁছেছেন, যা তাকে মুক্তি পেতে সহায়তা করবে",
    "originLink": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782130",
    "commentBody": "",
    "originSummary": [
      "উইকিলিকসের প্রতিষ্ঠাতা জুলিয়ান অ্যাসাঞ্জ পাঁচ বছর পর ব্রিটিশ কারাগার থেকে মুক্তি পেয়েছেন এবং একটি মার্কিন যুক্তরাষ্ট্রের আপস চুক্তির অংশ হিসেবে ষড়যন্ত্রের অভিযোগে দোষ স্বীকার করতে নর্দার্ন মারিয়ানা দ্বীপপুঞ্জের দিকে যাচ্ছেন।",
      "দরখাস্তের চুক্তি, যা ৬২ মাসের সাজা এবং ইতিমধ্যে কারাভোগ করা সময়ের জন্য ক্রেডিট অন্তর্ভুক্ত করে, শ্রেণীবদ্ধ নথি প্রকাশের উপর আইনি লড়াই শেষ করবে, অনুমোদনের পর আসাঞ্জকে মুক্তি দেবে।",
      "আসাঞ্জের প্রত্যাশা করা হচ্ছে যে তিনি প্রক্রিয়া শেষে অস্ট্রেলিয়ায় ফিরে যাবেন, যেখানে তার স্ত্রী স্টেলা এবং তাদের দুই সন্তান তার প্রত্যাবর্তনের অপেক্ষায় রয়েছেন।"
    ],
    "commentSummary": [
      "জুলিয়ান অ্যাসাঞ্জ যুক্তরাষ্ট্রের সাথে একটি আপস চুক্তিতে পৌঁছেছেন, যার ফলে ১৯০১ দিন পর বেলমার্শ কারাগার থেকে তার মুক্তি ঘটেছে।",
      "এই ফলাফলটি একটি বৈশ্বিক প্রচারাভিযান এবং মার্কিন যুক্তরাষ্ট্রের বিচার বিভাগের সাথে আলোচনার মাধ্যমে অর্জিত হয়েছিল, যা তার যুক্তরাজ্য ত্যাগের দিকে নিয়ে যায়।",
      "উইকিলিকসের প্রকাশনার মাধ্যমে সরকারী দুর্নীতি উন্মোচনকারী অ্যাসাঞ্জ শীঘ্রই তার পরিবারের সাথে পুনর্মিলিত হবেন।"
    ],
    "points": 2291,
    "commentCount": 1174,
    "retryCount": 0,
    "time": 1719270607
  },
  {
    "id": 40786425,
    "title": "স্থানীয় প্রথম, চিরকাল",
    "originLink": "https://tonsky.me/blog/crdt-filesync/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786425",
    "commentBody": "",
    "originSummary": [
      "লোকাল-ফার্স্ট সফটওয়্যার ব্যবহারকারীর ডিভাইসে ডেটা রাখাকে অগ্রাধিকার দেয় এবং মাঝে মাঝে অনলাইনে সিঙ্ক করে, ডেটার উপর নিয়ন্ত্রণ এবং মালিকানা প্রদান করে।",
      "চ্যালেঞ্জগুলির মধ্যে রয়েছে সিঙ্ক করার জন্য অনলাইন উপাদানগুলির উপর নির্ভরতা, যা ড্রপবক্স, আইক্লাউড ড্রাইভ, ওয়ানড্রাইভ, গুগল ড্রাইভ বা সিনকথিংয়ের মতো ব্যাপকভাবে উপলব্ধ ক্লাউড পরিষেবাগুলি ব্যবহার করে কমানো যেতে পারে।",
      "বিরোধ-মুক্ত ডেটা মার্জিং অর্জন করা যেতে পারে CRDTs (বিরোধ-মুক্ত প্রতিলিপি ডেটা প্রকার) ব্যবহার করে, যার ব্যবহারিক বাস্তবায়ন Automerge এর মতো সরঞ্জাম ব্যবহার করে GitHub এ প্রদর্শিত হয়েছে।"
    ],
    "commentSummary": [
      "আলোচনাটি \"স্থানীয়-প্রথম\" সফটওয়্যার ধারণার চারপাশে কেন্দ্রীভূত, যা ক্লাউড পরিষেবার উপর নির্ভর করার পরিবর্তে ব্যবহারকারীদের ডিভাইসে স্থানীয়ভাবে ডেটা সংরক্ষণকে অগ্রাধিকার দেয়।",
      "একটি মূল বিষয় হল স্থানীয়-প্রথম অ্যাপ্লিকেশনগুলিকে অর্থায়নের চ্যালেঞ্জ, কারণ প্রচলিত সাবস্ক্রিপশন মডেলগুলি কম প্রযোজ্য, এবং ডেভেলপারদের বিকল্প রাজস্ব উৎস খুঁজে বের করতে হবে।",
      "আলোচনাটি দীর্ঘমেয়াদী ডেটা অ্যাক্সেসযোগ্যতা এবং নিয়ন্ত্রণ নিশ্চিত করার জন্য স্ব-হোস্টিং ব্যাকএন্ড সিঙ্ক সার্ভারের গুরুত্বকে তুলে ধরে, বর্তমান প্রকল্পগুলির উদাহরণ এবং সম্ভাব্য সমাধান সহ।"
    ],
    "points": 573,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1719308830
  },
  {
    "id": 40786644,
    "title": "মাইক্রোসফট উইন্ডোজ ১১-এ স্থানীয় অ্যাকাউন্টে স্যুইচ করার ডকুমেন্টেশন সরিয়ে দিয়েছে",
    "originLink": "https://arstechnica.com/gadgets/2024/06/microsoft-removes-documentation-for-switching-to-a-local-account-in-windows-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786644",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফট উইন্ডোজ ১১-এ স্থানীয় অ্যাকাউন্টে স্যুইচ করার ডকুমেন্টেশন সরিয়ে ফেলেছে, তবে বেশিরভাগ বিকল্প পদ্ধতি এখনও কার্যকর।",
      "উইন্ডোজ ১১ হোম এবং প্রো সংস্করণগুলি সেটআপের সময় একটি মাইক্রোসফট অ্যাকাউন্ট প্রয়োজন, যা ওয়ানড্রাইভ বা মাইক্রোসফট ৩৬৫ এর মতো পরিষেবাগুলির জন্য সুবিধা প্রদান করে।",
      "একটি স্থানীয় অ্যাকাউন্ট ব্যবহার করার পদ্ধতিগুলির মধ্যে রয়েছে সেটআপের সময় Shift+F10 চাপা, Rufus টুল ব্যবহার করা, অথবা একটি মাইক্রোসফট অ্যাকাউন্ট দিয়ে সেটআপ করা এবং পরে সাইন আউট করা।"
    ],
    "commentSummary": [
      "মাইক্রোসফট উইন্ডোজ ১১-এ স্থানীয় অ্যাকাউন্টে স্যুইচ করার ডকুমেন্টেশন সরিয়ে ফেলেছে, যা ব্যবহারকারীদের হতাশা এবং গোপনীয়তা ও বাল্কওয়্যার নিয়ে উদ্বেগ সৃষ্টি করেছে।",
      "ব্যবহারকারীরা উইন্ডোজ ১১-কে অনধিকার প্রবেশকারী, বিজ্ঞাপন-ভর্তি সিস্টেমের সাথে তুলনা করছেন এবং কিছু ব্যবহারকারী লিনাক্স বা ম্যাকওএস-এর মতো বিকল্পগুলিতে স্যুইচ করছেন।",
      "স্থানীয় অ্যাকাউন্ট ব্যবহার করার প্রচেষ্টা সত্ত্বেও, ব্যবহারকারীরা আপডেটের পরে সমস্যা এবং সেটিংস পুনরায় সেট হওয়ার কথা জানিয়েছেন, যা মাইক্রোসফটের দিকনির্দেশনা নিয়ে বিস্তৃত অসন্তোষকে প্রতিফলিত করে।"
    ],
    "points": 550,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1719310933
  },
  {
    "id": 40781838,
    "title": "গোলাকার আয়তক্ষেত্র সর্বত্র রয়েছে",
    "originLink": "https://www.folklore.org/Round_Rects_Are_Everywhere.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781838",
    "commentBody": "",
    "originSummary": [
      "স্টিভ জবস বিল অ্যাটকিনসনকে কুইকড্রতে গোলাকার আয়তক্ষেত্র প্রয়োগ করতে অনুপ্রাণিত করেছিলেন, দৈনন্দিন বস্তুতে তাদের সাধারণ উপস্থিতি তুলে ধরে।",
      "প্রাথমিকভাবে সন্দিহান, বিল অ্যাটকিনসন দ্রুত একটি নতুন ডেমো তৈরি করেন যা প্রায় সাধারণ আয়তক্ষেত্রের মতো দ্রুত বৃত্তাকার আয়তক্ষেত্র আঁকতে সক্ষম হয়, যার ফলে \"রাউন্ডরেক্টস\" বৈশিষ্ট্যটি ম্যাকিন্টশ ব্যবহারকারী ইন্টারফেসের একটি গুরুত্বপূর্ণ অংশ হয়ে ওঠে।",
      "এই গল্পটি ব্যবহারকারী ইন্টারফেস ডিজাইনের গুরুত্ব এবং মূল ম্যাকিন্টশের উন্নয়নের সময় অ্যাপলের উদ্ভাবনী মনোভাবকে তুলে ধরে।"
    ],
    "commentSummary": [
      "আলোচনা কেন্দ্রীভূত হয়েছে উইন্ডোজ ইউআই ডিজাইনের বিবর্তন নিয়ে, বিশেষ করে বিভিন্ন সংস্করণে গোলাকার বনাম বর্গাকার কোণ ব্যবহারের উপর।",
      "অনেক ব্যবহারকারী পুরানো উইন্ডোজ সংস্করণ যেমন উইন্ডোজ ২০০০ এবং উইন্ডোজ সার্ভার ২০০৩-এর জন্য নস্টালজিয়া প্রকাশ করেন, তাদের সরলতা এবং সামঞ্জস্যের কথা উল্লেখ করে।",
      "আলোচনা প্রসারিত হয় বিভিন্ন প্রেক্ষাপটে, যেমন স্থাপত্য এবং পণ্য নকশায় গোলাকার কোণগুলির ব্যবহারিক এবং নান্দনিক কারণগুলি নিয়ে।"
    ],
    "points": 390,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1719268711
  },
  {
    "id": 40781048,
    "title": "উইন্ডোজ ১১ এখন অনুমতি না চেয়ে ওয়ানড্রাইভ ফোল্ডার ব্যাকআপ সক্ষম করছে",
    "originLink": "https://www.neowin.net/news/windows-11-is-now-automatically-enabling-onedrive-folder-backup-without-asking-permission/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781048",
    "commentBody": "",
    "originSummary": [
      "ফোরজা হরাইজন ৪ ১৪ ডিসেম্বর থেকে স্টোর থেকে সরিয়ে ফেলা হবে, যার মানে এটি আর কেনার জন্য উপলব্ধ থাকবে না।",
      "গেমের প্লেলিস্টগুলি ২২ আগস্ট শেষ হবে, যা নতুন কন্টেন্ট আপডেট বা ইভেন্টের সমাপ্তি নির্দেশ করে।"
    ],
    "commentSummary": [
      "উইন্ডোজ ১১ এখন স্বয়ংক্রিয়ভাবে ব্যবহারকারীর সম্মতি ছাড়াই ওয়ানড্রাইভ ফোল্ডার ব্যাকআপ সক্রিয় করে, যার ফলে ধীর ইন্টারনেট গতি এবং পরিবর্তিত ডিরেক্টরি পথের মতো সমস্যা দেখা দেয়।",
      "ব্যবহারকারীরা এই পরিবর্তনগুলি উল্টাতে চ্যালেঞ্জের সম্মুখীন হচ্ছেন, যার ফলে হতাশা এবং মাইক্রোসফটের প্রতি ক্রমবর্ধমান অবিশ্বাস দেখা দিচ্ছে, কিছু ব্যবহারকারী বিকল্প হিসেবে লিনাক্স বা ম্যাকওএস বিবেচনা করছেন।",
      "স্বয়ংক্রিয় ব্যাকআপ গোপনীয়তার উদ্বেগ উত্থাপন করে, বিশেষ করে সংবেদনশীল ডেটার জন্য, যা ব্যবহারকারীদের এই ধরনের কার্যকলাপের রিপোর্ট এফটিসি-এর মতো কর্তৃপক্ষের কাছে জমা দিতে উদ্বুদ্ধ করে।"
    ],
    "points": 294,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1719264643
  },
  {
    "id": 40779785,
    "title": "পরী কাহিনীকে স্যানিটাইজ না করার পক্ষে যুক্তি",
    "originLink": "https://www.plough.com/en/topics/culture/literature/the-case-for-not-sanitizing-fairy-tales",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779785",
    "commentBody": "",
    "originSummary": [
      "রূপকথার গল্প শিশুদেরকে মন্দ, সহিংসতা এবং বিপদের অস্তিত্ব সম্পর্কে শেখায়, যা জীবনের কঠিন বাস্তবতাগুলি বোঝার জন্য গুরুত্বপূর্ণ পাঠ।",
      "হ্যালি স্টুয়ার্ট যুক্তি দেন যে এই গল্পগুলিকে পরিষ্কার-পরিচ্ছন্ন করা, যেমনটি আধুনিক অভিযোজনগুলিতে দেখা যায় যেমন ডিজনির সংস্করণগুলি, শিশুদের তাদের ভয়গুলি প্রক্রিয়া করার এবং বুঝতে পারার সুযোগ থেকে বঞ্চিত করে যে সৎতা বিজয়ী হতে পারে।",
      "স্টুয়ার্ট পরী কাহিনির মূল, অপরিবর্তিত সংস্করণ সংরক্ষণের পক্ষে সমর্থন করেন যাতে শিশুরা দৃঢ়তা বিকাশ করতে পারে এবং বিশ্বের জটিলতাগুলি মোকাবেলা করতে পারে।"
    ],
    "commentSummary": [
      "রূপকথার গল্পগুলোকে জীবাণুমুক্ত করার বিতর্কে সমসাময়িক মূল্যবোধের সাথে মূল বার্তা এবং সাংস্কৃতিক প্রাসঙ্গিকতা সংরক্ষণের মধ্যে ভারসাম্য রক্ষা করা জড়িত।",
      "ডিজনির অভিযোজনগুলি, যেমন \"দ্য লিটল মারমেইড,\" প্রায়ই পুরানো গল্পগুলিকে আধুনিকীকরণের উদাহরণ হিসাবে উল্লেখ করা হয়, যা এই পরিবর্তনগুলি প্রয়োজনীয় কিনা বা এটি সেন্সরশিপের অন্তর্ভুক্ত কিনা তা নিয়ে আলোচনা উস্কে দেয়।",
      "পক্ষসমর্থকরা যুক্তি দেন যে বিবর্তিত গল্পগুলি আধুনিক দর্শকদের জন্য আরও প্রবেশযোগ্য এবং প্রভাবশালী হতে পারে, যখন সমালোচকরা তাদের মূল উদ্দেশ্য এবং সাংস্কৃতিক গুরুত্ব হ্রাস পাওয়ার বিষয়ে উদ্বিগ্ন।"
    ],
    "points": 268,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1719257752
  },
  {
    "id": 40783598,
    "title": "SIMD-ত্বরান্বিত কম্পিউটার ভিশন একটি $2 মাইক্রোকন্ট্রোলারে",
    "originLink": "https://shraiwi.github.io/read.html?md=blog/simd-fast-esp32s3.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783598",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "একটি $2 মাইক্রোকন্ট্রোলার, যেমন ESP32-S3, এখন SIMD-অ্যাক্সিলারেটেড (সিঙ্গেল ইনস্ট্রাকশন, মাল্টিপল ডেটা) কম্পিউটার ভিশন সম্পাদন করতে পারে, যা রিয়েল-টাইম কাজের জন্য কর্মক্ষমতা উল্লেখযোগ্যভাবে বৃদ্ধি করে।",
      "এজ ইম্পালস মাইক্রোকন্ট্রোলারের জন্য ডিপ লার্নিং এবং কম্পিউটার ভিশন মডেলগুলি অপ্টিমাইজ করার সরঞ্জাম সরবরাহ করে, যা ব্যবহারকারীদের মডেল আপলোড করতে এবং অপ্টিমাইজড সি++ লাইব্রেরি পেতে সক্ষম করে।",
      "আলোচনাগুলিতে সাশ্রয়ী মূল্যের TPU (টেনসর প্রসেসিং ইউনিট), FPGA (ফিল্ড-প্রোগ্রামেবল গেট অ্যারে) বোর্ড এবং ESP32 উন্নয়নের জন্য রাস্ট প্রোগ্রামিং ভাষার ব্যবহারের সম্ভাবনাও অন্তর্ভুক্ত রয়েছে।"
    ],
    "points": 260,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719281440
  },
  {
    "id": 40782541,
    "title": "iDOS ৩ অ্যাপল দ্বারা প্রত্যাখ্যাত",
    "originLink": "https://litchie.com/2024/04/new-hope",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782541",
    "commentBody": "",
    "originSummary": [
      "অ্যাপল iDOS 2 কে কালো তালিকাভুক্ত করেছে, ডেভেলপারকে এটি \"iDOS 3\" হিসাবে পুনরায় জমা দিতে বাধ্য করেছে, যা প্রাথমিকভাবে তার পূর্বসূরীর সাথে খুব বেশি মিল এবং \"ডিজাইন স্প্যাম\" এর জন্য প্রত্যাখ্যান করা হয়েছিল।",
      "বিকাশকারীর ব্যাখ্যা সত্ত্বেও, অ্যাপল সমস্যাটি সমাধান করেনি, এবং অ্যাপটি পর্যালোচনার অধীনে রয়েছে, যেখানে অ্যাপল একটি রেট্রো গেম কনসোল কী তা নিয়ে অস্পষ্ট নির্দেশিকা প্রদান করছে।",
      "ডেভেলপার আরও আপডেটের অপেক্ষায় আছেন এবং শীঘ্রই ব্যবহারকারীদের কাছে সংস্করণ বৃদ্ধির যৌক্তিকতা প্রমাণ করার আশা করছেন।"
    ],
    "commentSummary": [
      "অ্যাপল iDOS 3 অ্যাপটি প্রত্যাখ্যান করেছে, দাবি করেছে এটি একটি রেট্রো গেম কনসোল নয়, এবং প্রয়োজনীয় পরিবর্তনের জন্য অস্পষ্ট নির্দেশনা প্রদান করেছে।",
      "এই ঘটনা অ্যাপলের অ্যাপ রিভিউ প্রক্রিয়ার চলমান সমালোচনাগুলিকে জোরালো করে, যা অনেক ডেভেলপারদের কাছে স্বেচ্ছাচারী এবং অসামঞ্জস্যপূর্ণ বলে মনে হয়।",
      "ডিজিটাল মার্কেটস অ্যাক্ট (ডিএমএ) ভবিষ্যতে এই সমস্যাগুলি সমাধান করতে পারে, তবে এটি তাৎক্ষণিক সমাধান নয়।"
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719273189
  },
  {
    "id": 40783229,
    "title": "০/১০ থেকে ৮/১০: মাইক্রোসফট মেরামতকে সামনে এবং কেন্দ্রে রাখছে",
    "originLink": "https://www.ifixit.com/News/96998/from-0-10-to-8-10-microsoft-puts-repair-front-and-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783229",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফট তার সারফেস ডিভাইসগুলির মেরামতযোগ্যতা ব্যাপকভাবে উন্নত করেছে, যেখানে সারফেস ল্যাপটপ ৭ এর স্কোর ০/১০ থেকে ৮/১০ এ উন্নীত হয়েছে।",
      "এই উন্নতির জন্য অবদান রাখছে এমন মূল বৈশিষ্ট্যগুলির মধ্যে রয়েছে পরিষেবা ম্যানুয়ালের জন্য কিউআর কোড এবং সহজ বিচ্ছেদের জন্য ওয়েফাইন্ডার প্রতীক।",
      "সারফেস প্রো ১১-তেও উল্লেখযোগ্য মেরামতযোগ্যতার অগ্রগতি দেখা যায়, যেখানে সহজলভ্য উপাদান এবং কোনো আঠা ব্যবহার করা হয়নি, যা রাইট টু রিপেয়ার আন্দোলনের দ্বারা প্রভাবিত মাইক্রোসফটের প্রতিশ্রুতিকে প্রতিফলিত করে।"
    ],
    "commentSummary": [
      "মাইক্রোসফট তার সারফেস ডিভাইসগুলির মেরামতযোগ্যতা উন্নত করেছে, iFixit থেকে ৮/১০ স্কোর অর্জন করেছে, যা সম্ভবত ইইউ নিয়মাবলীর দ্বারা প্রভাবিত হয়েছে।",
      "হ্যাকার নিউজে আলোচনাগুলো মাইক্রোসফটের উদ্দেশ্য নিয়ে সন্দেহ প্রকাশ করে, যা প্রকৃত সদিচ্ছার পরিবর্তে নিয়ন্ত্রক চাপের ইঙ্গিত দেয়।",
      "আলোচনাটি বৃহত্তর বিষয়গুলিও অন্তর্ভুক্ত করে যেমন কর্পোরেট আচরণ, বাজার নিয়ন্ত্রণ এবং বৈশ্বিক মানদণ্ডে ইইউ আইন প্রণয়নের প্রভাব।"
    ],
    "points": 213,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719278395
  },
  {
    "id": 40787842,
    "title": "মাইক্রোসফট টিমসের সাথে বান্ডল করার জন্য ইইউ অ্যান্টিট্রাস্ট লঙ্ঘনের অভিযোগে অভিযুক্ত",
    "originLink": "https://www.theverge.com/2024/6/25/24185467/microsoft-teams-eu-bundling-antitrust-violations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40787842",
    "commentBody": "",
    "originSummary": [
      "মাইক্রোসফটকে ইউ নিয়ন্ত্রকদের দ্বারা অ্যান্টিট্রাস্ট লঙ্ঘনের অভিযোগ আনা হয়েছে কারণ তারা তাদের টিমস চ্যাট অ্যাপটি অফিস ৩৬৫ এবং মাইক্রোসফট ৩৬৫ সাবস্ক্রিপশনের সাথে বান্ডল করেছে।",
      "এটি ১৫ বছরে প্রথম এমন অভিযোগ, যা পূর্ববর্তী উইন্ডোজ মিডিয়া প্লেয়ার এবং ইন্টারনেট এক্সপ্লোরার সম্পর্কিত মামলাগুলির পরে এসেছে এবং ২০২০ সালে স্ল্যাকের একটি অভিযোগ থেকে উদ্ভূত হয়েছে।",
      "দোষী প্রমাণিত হলে, মাইক্রোসফটকে তার বার্ষিক বিশ্বব্যাপী টার্নওভারের ১০% পর্যন্ত জরিমানা এবং তার সফটওয়্যার পণ্য পরিবর্তন করতে হতে পারে।"
    ],
    "commentSummary": [
      "মাইক্রোসফট ইউরোপীয় ইউনিয়নের কাছ থেকে অ্যান্টিট্রাস্ট অভিযোগের সম্মুখীন হচ্ছে কারণ তারা তাদের টিমস সফটওয়্যারটি অন্যান্য পণ্যের সাথে একত্রিত করছে।",
      "অভিযোগগুলি ইঙ্গিত দেয় যে এই বান্ডলিং প্র্যাকটিসটি প্রতিযোগিতাবিরোধী হতে পারে, যা বাজারে অন্যান্য কোম্পানিগুলির ক্ষতি করতে পারে।",
      "এই উন্নয়নটি গুরুত্বপূর্ণ কারণ এটি ইইউতে প্রধান প্রযুক্তি কোম্পানিগুলির ব্যবসায়িক অনুশীলনের উপর চলমান নিয়ন্ত্রক নজরদারিকে তুলে ধরে।"
    ],
    "points": 206,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719319214
  },
  {
    "id": 40782101,
    "title": "এমটিভি নিউজ ওয়েবসাইট অন্ধকারে চলে যায়, আর্কাইভগুলি অফলাইনে টানা হয়েছে",
    "originLink": "https://variety.com/2024/digital/news/mtv-news-website-archives-pulled-offline-1236047163/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782101",
    "commentBody": "",
    "originSummary": [
      "এমটিভি এমটিভিনিউজ.কম থেকে দুই দশকেরও বেশি কন্টেন্ট সরিয়ে নিয়েছে, যা দর্শকদের প্রধান এমটিভি সাইটে পুনঃনির্দেশ করছে, যার মধ্যে উল্লেখযোগ্য সঙ্গীত সাংবাদিকতা এবং হিপ-হপ আর্কাইভ অন্তর্ভুক্ত রয়েছে।",
      "শাটডাউনটি ২০২৩ সালে প্যারামাউন্ট গ্লোবাল মূল কোম্পানির আর্থিক সমস্যার কারণে এমটিভি নিউজ বন্ধ হওয়ার পর আসে, যেখানে প্রাক্তন কর্মীরা সামাজিক মাধ্যমে হতাশা প্রকাশ করেছেন।",
      "প্যারামাউন্ট গ্লোবাল সিএমটি'র সাইট থেকে কন্টেন্টও সরিয়ে নিয়েছে, এবং যদিও কিছু লোক ইন্টারনেট আর্কাইভিং পরিষেবা ব্যবহারের পরামর্শ দেয়, পুরানো নিবন্ধগুলি হয়তো উপলব্ধ নাও থাকতে পারে।"
    ],
    "commentSummary": [
      "এমটিভি নিউজ ওয়েবসাইটটি অফলাইনে চলে গেছে এবং এর আর্কাইভগুলি সরিয়ে ফেলা হয়েছে, যা ডিজিটাল সাংবাদিকতা এবং সাংস্কৃতিক ইতিহাস সংরক্ষণ নিয়ে উদ্বেগ সৃষ্টি করেছে।",
      "ঘটনাটি সাংবাদিকদের আর্কাইভাল অধিকারগুলির বৃহত্তর সমস্যাটিকে তুলে ধরে, স্থায়ী ক্রেডিট এবং তাদের কাজের অ্যাক্সেসের প্রয়োজনীয়তাকে জোর দেয়, যেমন প্রধান সংবাদপত্রগুলি পুনর্মুদ্রণ এবং ডিজিটাল আর্কাইভ সরবরাহ করে।",
      "আলোচনাটি শক্তিশালী এবং সহজলভ্য ডিজিটাল আর্কাইভের গুরুত্বকে জোর দেয়, যেখানে কিছু লোক ইন্টারনেট আর্কাইভের মতো সংস্থাগুলিকে সমর্থন করার পরামর্শ দেয় যাতে বিশ্বব্যাপী সংরক্ষিত ডেটার স্থায়িত্ব নিশ্চিত করা যায়।"
    ],
    "points": 206,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1719270382
  },
  {
    "id": 40783777,
    "title": "গবেষকরা ১০০% বায়োডিগ্রেডেবল 'বার্লি প্লাস্টিক' আবিষ্কার করেছেন",
    "originLink": "https://phys.org/news/2024-06-biodegradable-barley-plastic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783777",
    "commentBody": "",
    "originSummary": [
      "কোপেনহেগেন বিশ্ববিদ্যালয়ের গবেষকরা বার্লি স্টার্চ এবং চিনি বিটের বর্জ্য থেকে ১০০% বায়োডিগ্রেডেবল প্লাস্টিক তৈরি করেছেন, যা দুই মাসের মধ্যে সম্পূর্ণভাবে পচে যায়।",
      "এই নতুন বায়োপ্লাস্টিক, যা অ্যামাইলোজ এবং ন্যানোসেলুলোজের একটি বায়োকম্পোজিট, শক্তিশালী, জল-প্রতিরোধী এবং খাদ্য প্যাকেজিংয়ের মতো প্রয়োগের জন্য উপযুক্ত, বর্তমান বায়োপ্লাস্টিকের বিপরীতে যা শিল্প কম্পোস্টিং প্রয়োজন।",
      "দলটি উপাদানটির পেটেন্ট করাচ্ছে এবং প্রোটোটাইপগুলি বিকাশের জন্য কোম্পানিগুলির সাথে সহযোগিতা করছে, এক থেকে পাঁচ বছরের মধ্যে বাজারে উপলব্ধ করার লক্ষ্যে।"
    ],
    "commentSummary": [
      "গবেষকরা বার্লি থেকে ১০০% বায়োডিগ্রেডেবল প্লাস্টিক তৈরি করেছেন, যা পরিবেশের ক্ষতি করে এমন প্রচলিত প্লাস্টিকের পরিবর্তে ব্যবহার করার লক্ষ্য।",
      "চিকিৎসা পণ্যে এর ব্যবহার এবং এর সামগ্রিক স্থায়িত্ব নিয়ে উদ্বেগ রয়েছে, যা প্লাস্টিক বর্জ্য এবং বায়োডিগ্রেডেবল বিকল্পগুলি নিয়ে একটি বিস্তৃত আলোচনার সূচনা করেছে।",
      "বিতর্কে এই বিকল্পগুলির কার্যকারিতা এবং বৃহৎ পরিসরে বাস্তবায়নের চ্যালেঞ্জগুলি, পাশাপাশি পুনঃব্যবহারযোগ্য ব্যাগের পরিবেশগত প্রভাব অন্তর্ভুক্ত রয়েছে।"
    ],
    "points": 199,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1719282877
  },
  {
    "id": 40789672,
    "title": "আমি একটি জাভাস্ক্রিপ্ট-চালিত ফ্লিপডিসপ্লে তৈরি করেছি",
    "originLink": "https://flipdisc.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40789672",
    "commentBody": "",
    "originSummary": [
      "ফ্লিপডিস্কস, যা ৮০ বছরের পুরনো একটি প্রযুক্তি যা ইলেক্ট্রোম্যাগনেটিক পালস ব্যবহার করে ডিস্কগুলিকে দুটি রঙের মধ্যে উল্টাতে সক্ষম, একটি বড় ইন্টারেক্টিভ ওয়াল আর্ট প্রকল্পের জন্য নির্বাচিত হয়েছিল তাদের পাঠযোগ্যতা, দীর্ঘস্থায়িত্ব এবং অনন্য শব্দের কারণে।",
      "প্রকল্পটি ৩x৩ গ্রিডে ৯টি আলফাজেটা প্যানেল ব্যবহার করে, যা ২৪ভি ১০এ মীনওয়েল পাওয়ার সাপ্লাই দ্বারা চালিত, এবং এনভিডিয়া ওরিন ন্যানো দ্বারা নিয়ন্ত্রিত, বিভিন্ন ওয়েব প্রযুক্তি ব্যবহার করে রেন্ডারিং এবং অ্যানিমেশনের জন্য।",
      "দলটি ফ্লিপডিস্ক স্ক্রিনের জন্য একটি Node.js লাইব্রেরি এবং ব্যবহারকারীর ইন্টারঅ্যাকশনের জন্য একটি এক্সপো অ্যাপ তৈরি করেছে, যা শখের জন্য ফ্লিপডিস্ককে আরও সহজলভ্য করতে এবং সাশ্রয়ী মূল্যের হার্ডওয়্যারে সহযোগিতা উৎসাহিত করতে চায়।"
    ],
    "commentSummary": [
      "একটি জাভাস্ক্রিপ্ট-চালিত ফ্লিপডিসপ্লে তৈরি করা হয়েছিল, যা ফ্লিপ ডিস্ক ব্যবহার করে যা যান্ত্রিক সমস্যার প্রবণ হতে পারে কিন্তু কার্যকরী অবস্থায় অত্যন্ত আকর্ষণীয়।",
      "প্যানেলগুলি ইবে এবং আলফাজেটা থেকে সংগ্রহ করা হয়েছিল, যদিও সেগুলি ব্যয়বহুল হতে পারে, এবং ডিসপ্লের শব্দ নেটওয়ার্ক অপারেশন সেন্টার (এনওসি) এর মতো পরিবেশে মনোযোগ আকর্ষণ করতে পারে।",
      "প্রকল্পটি উৎস, স্থায়িত্ব এবং সম্ভাব্য প্রয়োগ সম্পর্কে আগ্রহ এবং আলোচনা সৃষ্টি করেছে।"
    ],
    "points": 176,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719328448
  },
  {
    "id": 40779643,
    "title": "কিন্ডল এআই নরকের যাত্রা",
    "originLink": "https://maxread.substack.com/p/my-kindle-thinks-im-stupid-now",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779643",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "রয়্যাল রোডের ইন্ডি লেখকরা রিপোর্ট করেছেন যে তাদের কাজ চুরি হচ্ছে, এআই-এর মাধ্যমে চালানো হচ্ছে এবং কিন্ডলে প্রকাশিত হচ্ছে, যা প্লেজারিজম এবং মেধাস্বত্ব নিয়ে উদ্বেগ বাড়াচ্ছে।",
      "লেখকরা তাদের কাজ চুরি রোধ করতে ওয়াটারমার্ক যোগ করার চেষ্টা করেছেন, কিন্তু এই পদ্ধতির কার্যকারিতা অনিশ্চিত রয়ে গেছে।",
      "কভার আর্ট তৈরির জন্য এআই ব্যবহারে ঐতিহ্যবাহী শিল্পীরা ক্ষুব্ধ হয়েছেন, যারা মনে করেন যে লেখকদের মানব শিল্পীদের সাথে সহযোগিতা করা উচিত।"
    ],
    "points": 173,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1719256746
  },
  {
    "id": 40780940,
    "title": "আপনাদের মধ্যে যারা SWE (সফটওয়্যার ইঞ্জিনিয়ারিং) জগৎ ছেড়েছেন, তারা কোন ক্ষেত্রে পরিবর্তিত হয়েছেন?",
    "originLink": "https://news.ycombinator.com/item?id=40780940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40780940",
    "commentBody": "",
    "originSummary": [
      "একজন অভিজ্ঞ সফটওয়্যার ইঞ্জিনিয়ার, যার ১৩ বছরের অভিজ্ঞতা রয়েছে, তিনি বার্নআউট এবং প্রচলিত ভূমিকার প্রতি অসন্তোষের কারণে শিল্পটি ছেড়ে দেওয়ার কথা ভাবছেন।",
      "বর্তমানে চুক্তিভিত্তিক কাজ করছেন এবং উদ্যোক্তা হিসেবে নতুন কিছু চেষ্টা করছেন, তবে তাদের উদ্যোগ ব্যর্থ হলে ভবিষ্যৎ নিয়ে অনিশ্চিত এবং আয়ের সম্ভাবনার জন্য প্রযুক্তি বিক্রয়ে স্থানান্তরিত হওয়ার কথা ভাবছেন।",
      "পোস্টটি অভিজ্ঞ প্রকৌশলীদের মধ্যে শিল্প ক্লান্তি এবং আরও পরিপূর্ণ বা লাভজনক ক্যারিয়ার পথের সন্ধানের বিষয়ে একটি সাধারণ অনুভূতির উপর আলোকপাত করে।"
    ],
    "commentSummary": [
      "১৩ বছর সফটওয়্যার ইঞ্জিনিয়ারিংয়ে কাটানোর পর, লেখক ঐতিহ্যবাহী ৯-৫ কোডিং চাকরি থেকে সরে এসে উদ্যোক্তা এবং কন্ট্রাক্টিংয়ের দিকে ঝুঁকছেন।",
      "লেখকের ইঞ্জিনিয়ারিং ম্যানেজার এবং সিনিয়র/স্টাফ ইঞ্জিনিয়ার হিসেবে অভিজ্ঞতা রয়েছে, কিন্তু শিল্পের গতিশীলতায় হতাশ এবং মানুষের সাথে কাজ করা ও কৌশলগত দক্ষতাকে কাজে লাগানোর মতো ভূমিকা খুঁজছেন।",
      "লেখক একটি প্রযুক্তি কোম্পানিতে বিক্রয় বিভাগে যোগ দেওয়ার কথা বিবেচনা করছেন এবং যারা একই ধরনের পরিবর্তন করেছেন তাদের পরামর্শ বা গল্প খুঁজছেন।"
    ],
    "points": 165,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1719264031
  }
]
