[
  {
    "id": 40782130,
    "title": "जूलियन असांजे ने अमेरिका के साथ एक याचिका समझौता किया है, जिससे उन्हें रिहा होने की अनुमति मिल गई है",
    "originLink": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782130",
    "commentBody": "",
    "originSummary": [
      "जूलियन असांजे, विकीलीक्स के संस्थापक, को पांच साल बाद एक ब्रिटिश जेल से रिहा कर दिया गया है और वह उत्तरी मारियाना द्वीप समूह की ओर जा रहे हैं ताकि एक अमेरिकी याचिका समझौते के हिस्से के रूप में साजिश के आरोप में दोषी ठहराया जा सके।",
      "दलील सौदा, जिसमें समय की सेवा के लिए क्रेडिट के साथ 62 महीने की सजा शामिल है, गोपनीय दस्तावेजों के प्रकाशन पर कानूनी लड़ाई को समाप्त कर देगा, जिससे अनुमोदन के बाद असांजे को स्वतंत्रता मिल जाएगी।",
      "कार्यवाही के बाद असांजे के ऑस्ट्रेलिया लौटने की उम्मीद है, जहां उनकी पत्नी स्टेला और उनके दो बच्चे उनकी वापसी का इंतजार कर रहे हैं।"
    ],
    "commentSummary": [
      "जूलियन असांजे ने अमेरिका के साथ एक याचिका समझौता किया है, जिसके परिणामस्वरूप उन्हें 1901 दिनों के बाद बेलमार्श जेल से रिहा कर दिया गया है।",
      "यह परिणाम एक वैश्विक अभियान और अमेरिकी न्याय विभाग के साथ वार्ताओं के माध्यम से प्राप्त किया गया, जिसके परिणामस्वरूप वह यूके से प्रस्थान कर गया।",
      "विकीलीक्स के प्रकाशनों के माध्यम से सरकारी भ्रष्टाचार को उजागर करने के लिए जाने जाने वाले असांजे जल्द ही अपने परिवार से मिलेंगे।"
    ],
    "points": 2291,
    "commentCount": 1174,
    "retryCount": 0,
    "time": 1719270607
  },
  {
    "id": 40786425,
    "title": "स्थानीय पहले, हमेशा के लिए",
    "originLink": "https://tonsky.me/blog/crdt-filesync/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786425",
    "commentBody": "",
    "originSummary": [
      "स्थानीय-प्रथम सॉफ़्टवेयर उपयोगकर्ता के डिवाइस पर डेटा को प्राथमिकता देता है जबकि कभी-कभी ऑनलाइन सिंक करता है, जिससे डेटा पर नियंत्रण और स्वामित्व मिलता है।",
      "चुनौतियों में सिंकिंग के लिए ऑनलाइन घटकों पर निर्भरता शामिल है, जिसे ड्रॉपबॉक्स, आईक्लाउड ड्राइव, वनड्राइव, गूगल ड्राइव, या सिंकथिंग जैसी व्यापक रूप से उपलब्ध क्लाउड सेवाओं का उपयोग करके कम किया जा सकता है।",
      "विवाद-मुक्त डेटा मर्जिंग को CRDTs (विवाद-मुक्त प्रतिकृत डेटा प्रकार) का उपयोग करके प्राप्त किया जा सकता है, जिसका व्यावहारिक कार्यान्वयन GitHub पर Automerge जैसे उपकरणों का उपयोग करके प्रदर्शित किया गया है।"
    ],
    "commentSummary": [
      "चर्चा 'स्थानीय-प्रथम' सॉफ़्टवेयर की अवधारणा के इर्द-गिर्द घूमती है, जो क्लाउड सेवाओं पर निर्भर रहने के बजाय उपयोगकर्ताओं के उपकरणों पर डेटा को स्थानीय रूप से संग्रहीत करने को प्राथमिकता देता है।",
      "एक महत्वपूर्ण बिंदु स्थानीय-प्रथम अनुप्रयोगों को मुद्रीकृत करने की चुनौती है, क्योंकि पारंपरिक सदस्यता मॉडल कम लागू होते हैं, और डेवलपर्स को वैकल्पिक राजस्व स्रोत खोजने पड़ते हैं।",
      "यह बातचीत दीर्घकालिक डेटा पहुंच और नियंत्रण सुनिश्चित करने के लिए स्व-होस्टिंग बैकएंड सिंक सर्वरों के महत्व को उजागर करती है, वर्तमान परियोजनाओं और संभावित समाधानों के उदाहरणों के साथ।"
    ],
    "points": 573,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1719308830
  },
  {
    "id": 40786644,
    "title": "माइक्रोसॉफ्ट ने विंडोज 11 में स्थानीय खाता स्विच करने के लिए दस्तावेज़ हटाए",
    "originLink": "https://arstechnica.com/gadgets/2024/06/microsoft-removes-documentation-for-switching-to-a-local-account-in-windows-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786644",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट ने विंडोज 11 में लोकल अकाउंट पर स्विच करने के लिए दस्तावेज़ीकरण हटा दिया है, लेकिन अधिकांश वैकल्पिक उपाय अभी भी काम करते हैं।",
      "Windows 11 होम और प्रो संस्करणों को सेटअप के दौरान एक माइक्रोसॉफ्ट खाते की आवश्यकता होती है, जो OneDrive या Microsoft 365 जैसी सेवाओं के लिए लाभ प्रदान करता है।",
      "स्थानीय खाता उपयोग करने के तरीके में सेटअप के दौरान Shift+F10 दबाना, Rufus टूल का उपयोग करना, या Microsoft खाते के साथ सेटअप करना और बाद में साइन आउट करना शामिल है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट ने विंडोज 11 में लोकल अकाउंट पर स्विच करने के लिए दस्तावेज़ हटा दिए हैं, जिससे उपयोगकर्ताओं में निराशा और गोपनीयता तथा ब्लोटवेयर को लेकर चिंताएं बढ़ गई हैं।",
      "उपयोगकर्ता विंडोज 11 की तुलना घुसपैठी, विज्ञापन-भरे सिस्टम से कर रहे हैं और कुछ विकल्पों जैसे लिनक्स या मैकओएस पर स्विच कर रहे हैं।",
      "स्थानीय खातों का उपयोग करने के प्रयासों के बावजूद, उपयोगकर्ता अपडेट के बाद समस्याओं और सेटिंग्स के रीसेट होने की रिपोर्ट करते हैं, जो माइक्रोसॉफ्ट की दिशा के प्रति व्यापक असंतोष को दर्शाता है।"
    ],
    "points": 550,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1719310933
  },
  {
    "id": 40781838,
    "title": "गोल आयत हर जगह हैं",
    "originLink": "https://www.folklore.org/Round_Rects_Are_Everywhere.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781838",
    "commentBody": "",
    "originSummary": [
      "स्टीव जॉब्स ने बिल एटकिन्सन को क्विकड्रॉ में गोल कोनों वाले आयतों को लागू करने के लिए प्रेरित किया, यह बताते हुए कि वे रोजमर्रा की वस्तुओं में आमतौर पर पाए जाते हैं।",
      "शुरुआत में संदेहपूर्ण, बिल एटकिंसन ने जल्दी ही एक नया डेमो विकसित किया जो साधारण आयतों की तुलना में लगभग उतनी ही तेजी से गोल आयतें खींचता था, जिसके परिणामस्वरूप \"राउंडरेक्ट्स\" फीचर मैकिन्टोश यूजर इंटरफेस का एक प्रमुख हिस्सा बन गया।",
      "यह कहानी उपयोगकर्ता इंटरफ़ेस डिज़ाइन के महत्व और मूल मैकिन्टोश के विकास के दौरान एप्पल में नवाचार की भावना को रेखांकित करती है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु विंडोज यूआई डिज़ाइन का विकास है, विशेष रूप से विभिन्न संस्करणों में गोल और चौकोर कोनों के उपयोग के बारे में।",
      "कई उपयोगकर्ता पुराने विंडोज संस्करणों जैसे विंडोज 2000 और विंडोज सर्वर 2003 के लिए उदासीनता व्यक्त करते हैं, उनकी सरलता और स्थिरता का हवाला देते हुए।",
      "वार्तालाप में विभिन्न संदर्भों में गोल कोनों के व्यावहारिक और सौंदर्य कारणों पर चर्चा की जाती है, जिसमें वास्तुकला और उत्पाद डिजाइन शामिल हैं।"
    ],
    "points": 390,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1719268711
  },
  {
    "id": 40781048,
    "title": "विंडोज 11 अब बिना अनुमति मांगे वनड्राइव फ़ोल्डर बैकअप सक्षम कर रहा है",
    "originLink": "https://www.neowin.net/news/windows-11-is-now-automatically-enabling-onedrive-folder-backup-without-asking-permission/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781048",
    "commentBody": "",
    "originSummary": [
      "फोर्ज़ा होराइजन 4 को 14 दिसंबर से स्टोर्स से हटा दिया जाएगा, जिसका मतलब है कि यह अब खरीदने के लिए उपलब्ध नहीं होगा।",
      "खेल की प्लेलिस्ट 22 अगस्त को समाप्त हो जाएगी, जो नए सामग्री अपडेट या घटनाओं की समाप्ति का संकेत देती है।"
    ],
    "commentSummary": [
      "विंडोज 11 अब बिना उपयोगकर्ता की सहमति के स्वचालित रूप से वनड्राइव फ़ोल्डर बैकअप सक्षम कर देता है, जिससे धीमी इंटरनेट गति और परिवर्तित निर्देशिका पथ जैसी समस्याएं उत्पन्न हो रही हैं।",
      "उपयोगकर्ताओं को इन परिवर्तनों को उलटने में कठिनाई हो रही है, जिससे निराशा और माइक्रोसॉफ्ट के प्रति बढ़ती अविश्वास की भावना उत्पन्न हो रही है, और कुछ लोग लिनक्स या मैकओएस जैसे विकल्पों पर विचार कर रहे हैं।",
      "स्वचालित बैकअप गोपनीयता संबंधी चिंताओं को बढ़ाता है, विशेष रूप से संवेदनशील डेटा के लिए, जिससे उपयोगकर्ता इन प्रथाओं की रिपोर्ट FTC जैसी प्राधिकरणों को करते हैं।"
    ],
    "points": 294,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1719264643
  },
  {
    "id": 40779785,
    "title": "परियों की कहानियों को सैनिटाइज न करने का मामला",
    "originLink": "https://www.plough.com/en/topics/culture/literature/the-case-for-not-sanitizing-fairy-tales",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779785",
    "commentBody": "",
    "originSummary": [
      "परियों की कहानियाँ बच्चों को बुराई, हिंसा, और खतरे के अस्तित्व के बारे में सिखाती हैं, जो जीवन की कठोर वास्तविकताओं को समझने के लिए महत्वपूर्ण पाठ हैं।",
      "हेली स्टीवर्ट का तर्क है कि इन कहानियों को आधुनिक रूपांतरणों, जैसे कि डिज्नी के संस्करणों में देखा गया, को साफ-सुथरा बनाने से बच्चों को अपने डर को समझने और यह समझने का अवसर छीन लिया जाता है कि अच्छाई जीत सकती है।",
      "स्टीवर्ट बच्चों को सहनशीलता विकसित करने और दुनिया की जटिलताओं को समझने में मदद करने के लिए परियों की कहानियों के मूल, अपरिवर्तित संस्करणों को संरक्षित करने की वकालत करते हैं।"
    ],
    "commentSummary": [
      "परियों की कहानियों को स्वच्छ बनाने पर बहस में समकालीन मूल्यों को संतुलित करना और मूल संदेशों और सांस्कृतिक प्रासंगिकता को संरक्षित करना शामिल है।",
      "डिज़्नी के अनुकूलन, जैसे कि 'द लिटिल मरमेड', अक्सर पुराने कहानियों को आधुनिक बनाने के उदाहरण के रूप में उद्धृत किए जाते हैं, जिससे यह चर्चा होती है कि क्या ये परिवर्तन आवश्यक हैं या सेंसरशिप का हिस्सा हैं।",
      "समर्थक तर्क देते हैं कि विकसित होती कहानियाँ उन्हें आधुनिक दर्शकों के लिए अधिक सुलभ और प्रभावशाली बना सकती हैं, जबकि आलोचक उनकी मूल मंशा और सांस्कृतिक महत्व को कमजोर करने की चिंता करते हैं।"
    ],
    "points": 268,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1719257752
  },
  {
    "id": 40783598,
    "title": "SIMD-त्वरित कंप्यूटर दृष्टि एक $2 माइक्रोकंट्रोलर पर",
    "originLink": "https://shraiwi.github.io/read.html?md=blog/simd-fast-esp32s3.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783598",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एक $2 माइक्रोकंट्रोलर, जैसे कि ESP32-S3, अब SIMD-त्वरित (सिंगल इंस्ट्रक्शन, मल्टीपल डेटा) कंप्यूटर विज़न कर सकता है, जो वास्तविक समय के कार्यों के लिए प्रदर्शन को महत्वपूर्ण रूप से बढ़ाता है।",
      "एज इम्पल्स माइक्रोकंट्रोलर्स के लिए डीप लर्निंग और कंप्यूटर विज़न मॉडल्स को अनुकूलित करने के उपकरण प्रदान करता है, जिससे उपयोगकर्ता मॉडल अपलोड कर सकते हैं और अनुकूलित C++ लाइब्रेरी प्राप्त कर सकते हैं।",
      "चर्चाओं में किफायती TPUs (टेंसर प्रोसेसिंग यूनिट्स), FPGA (फील्ड-प्रोग्रामेबल गेट एरे) बोर्ड्स, और ESP32 विकास के लिए रस्ट प्रोग्रामिंग भाषा के उपयोग की संभावनाओं को भी शामिल किया गया है।"
    ],
    "points": 260,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719281440
  },
  {
    "id": 40782541,
    "title": "iDOS 3 को Apple द्वारा अस्वीकार कर दिया गया",
    "originLink": "https://litchie.com/2024/04/new-hope",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782541",
    "commentBody": "",
    "originSummary": [
      "एप्पल ने iDOS 2 को ब्लैकलिस्ट कर दिया है, जिससे डेवलपर को इसे \"iDOS 3\" के रूप में फिर से सबमिट करने के लिए मजबूर होना पड़ा, जिसे शुरू में इसके पूर्ववर्ती के समान होने और \"डिज़ाइन स्पैम\" के कारण अस्वीकार कर दिया गया था।",
      "डेवलपर की व्याख्याओं के बावजूद, Apple ने इस मुद्दे का समाधान नहीं किया है, और ऐप अभी भी समीक्षा के अधीन है, जिसमें Apple ने यह स्पष्ट नहीं किया है कि रेट्रो गेम कंसोल क्या होता है।",
      "डेवलपर आगे के अपडेट का इंतजार कर रहा है और जल्द ही उपयोगकर्ताओं को संस्करण वृद्धि को सही ठहराने की उम्मीद कर रहा है।"
    ],
    "commentSummary": [
      "एप्पल ने iDOS 3 ऐप को अस्वीकार कर दिया, यह दावा करते हुए कि यह एक रेट्रो गेम कंसोल नहीं है, और आवश्यक बदलावों के लिए अस्पष्ट मार्गदर्शन प्रदान किया।",
      "यह घटना ऐप्पल के ऐप समीक्षा प्रक्रिया की चल रही आलोचनाओं को उजागर करती है, जिसे कई डेवलपर्स मनमाना और असंगत मानते हैं।",
      "डिजिटल मार्केट्स अधिनियम (डीएमए) भविष्य में इन मुद्दों को संबोधित कर सकता है, लेकिन यह तत्काल समाधान नहीं है।"
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719273189
  },
  {
    "id": 40783229,
    "title": "0/10 से 8/10 तक: Microsoft ने मरम्मत को प्रमुखता दी",
    "originLink": "https://www.ifixit.com/News/96998/from-0-10-to-8-10-microsoft-puts-repair-front-and-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783229",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट ने अपने सरफेस डिवाइसों की मरम्मत योग्यता को काफी बढ़ा दिया है, जिसमें सरफेस लैपटॉप 7 की मरम्मत योग्यता 0/10 से बढ़कर 8/10 हो गई है।",
      "इस सुधार में योगदान देने वाली प्रमुख विशेषताओं में सेवा मैनुअल के लिए क्यूआर कोड और आसान विघटन के लिए वेफाइंडर प्रतीक शामिल हैं।",
      "सर्फेस प्रो 11 में भी महत्वपूर्ण मरम्मत योग्यता में सुधार दिखता है, जिसमें सुलभ घटक हैं और कोई गोंद का उपयोग नहीं किया गया है, जो राइट टू रिपेयर वकालत से प्रभावित माइक्रोसॉफ्ट की प्रतिबद्धता को दर्शाता है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट ने अपने सरफेस उपकरणों की मरम्मत योग्यता को बढ़ाया है, जिससे इसे iFixit से 8/10 का स्कोर प्राप्त हुआ है, जो संभवतः यूरोपीय संघ के नियमों से प्रभावित है।",
      "हैकर न्यूज़ पर चर्चाओं में माइक्रोसॉफ्ट की मंशा पर संदेह व्यक्त किया गया है, यह सुझाव देते हुए कि यह वास्तविक सद्भावना के बजाय नियामक दबाव हो सकता है।",
      "बातचीत में व्यापक विषयों जैसे कॉर्पोरेट व्यवहार, बाजार विनियम, और वैश्विक मानकों पर यूरोपीय संघ के कानूनों के प्रभाव को भी शामिल किया गया है।"
    ],
    "points": 213,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719278395
  },
  {
    "id": 40787842,
    "title": "माइक्रोसॉफ्ट पर टीम्स को बंडल करने के लिए यूरोपीय संघ के प्रतिस्पर्धा कानूनों के उल्लंघन का आरोप लगाया गया",
    "originLink": "https://www.theverge.com/2024/6/25/24185467/microsoft-teams-eu-bundling-antitrust-violations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40787842",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट पर ईयू नियामकों द्वारा एंटीट्रस्ट उल्लंघनों का आरोप लगाया गया है क्योंकि उसने अपनी Teams चैट ऐप को Office 365 और Microsoft 365 सब्सक्रिप्शनों के साथ बंडल किया है।",
      "यह 15 वर्षों में पहला ऐसा आरोप है, जो विंडोज मीडिया प्लेयर और इंटरनेट एक्सप्लोरर से संबंधित पिछले मामलों के बाद आया है, और यह स्लैक द्वारा 2020 में की गई शिकायत से उत्पन्न हुआ है।",
      "यदि दोषी पाया जाता है, तो माइक्रोसॉफ्ट को अपनी वार्षिक वैश्विक टर्नओवर का 10% तक का जुर्माना भरना पड़ सकता है और अपने सॉफ्टवेयर उत्पादों में बदलाव करने की आवश्यकता हो सकती है।"
    ],
    "commentSummary": [
      "माइक्रोसॉफ्ट यूरोपीय संघ से अपने टीम्स सॉफ़्टवेयर को अन्य उत्पादों के साथ बंडल करने के लिए प्रतिस्पर्धा-विरोधी आरोपों का सामना कर रहा है।",
      "आरोपों से संकेत मिलता है कि यह बंडलिंग प्रथा प्रतिस्पर्धा-विरोधी हो सकती है, जो संभावित रूप से बाजार में अन्य कंपनियों को नुकसान पहुंचा सकती है।",
      "यह विकास महत्वपूर्ण है क्योंकि यह यूरोपीय संघ में प्रमुख तकनीकी कंपनियों के व्यापारिक प्रथाओं पर चल रही नियामक जांच को उजागर करता है।"
    ],
    "points": 206,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719319214
  },
  {
    "id": 40782101,
    "title": "एमटीवी न्यूज़ वेबसाइट बंद हो गई, संग्रह ऑफ़लाइन खींचे गए",
    "originLink": "https://variety.com/2024/digital/news/mtv-news-website-archives-pulled-offline-1236047163/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782101",
    "commentBody": "",
    "originSummary": [
      "एमटीवी ने MTVNews.com से दो दशकों से अधिक की सामग्री हटा दी है, जिससे आगंतुकों को मुख्य एमटीवी साइट पर पुनर्निर्देशित किया जा रहा है, जिसमें महत्वपूर्ण संगीत पत्रकारिता और हिप-हॉप अभिलेखागार शामिल हैं।",
      "शटडाउन पैरामाउंट ग्लोबल की मूल कंपनी में वित्तीय समस्याओं के कारण 2023 में एमटीवी न्यूज़ के बंद होने के बाद हुआ, जिसमें पूर्व कर्मचारियों ने सोशल मीडिया पर निराशा व्यक्त की।",
      "पैरामाउंट ग्लोबल ने CMT की साइट से सामग्री भी हटा दी है, और जबकि कुछ लोग इंटरनेट आर्काइविंग सेवाओं का उपयोग करने का सुझाव देते हैं, पुराने लेख उपलब्ध नहीं हो सकते हैं।"
    ],
    "commentSummary": [
      "एमटीवी न्यूज़ वेबसाइट ऑफ़लाइन हो गई है, और इसके अभिलेख हटा दिए गए हैं, जिससे डिजिटल पत्रकारिता और सांस्कृतिक इतिहास के संरक्षण के बारे में चिंताएँ बढ़ गई हैं।",
      "यह घटना पत्रकारों के लिए अभिलेखीय अधिकारों के व्यापक मुद्दे को उजागर करती है, जिसमें उनके कार्य के लिए स्थायी श्रेय और पहुंच की आवश्यकता पर जोर दिया गया है, जैसे प्रमुख समाचार पत्र पुनर्मुद्रण और डिजिटल अभिलेखागार की पेशकश करते हैं।",
      "चर्चा में मजबूत और सुलभ डिजिटल अभिलेखागारों के महत्व को रेखांकित किया गया है, जिसमें कुछ लोग इंटरनेट आर्काइव जैसी संगठनों का समर्थन करने का सुझाव देते हैं ताकि वैश्विक स्तर पर संग्रहीत डेटा की स्थायित्व सुनिश्चित की जा सके।"
    ],
    "points": 206,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1719270382
  },
  {
    "id": 40783777,
    "title": "शोधकर्ताओं ने 100% बायोडिग्रेडेबल 'जौ प्लास्टिक' का आविष्कार किया",
    "originLink": "https://phys.org/news/2024-06-biodegradable-barley-plastic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783777",
    "commentBody": "",
    "originSummary": [
      "कोपेनहेगन विश्वविद्यालय के शोधकर्ताओं ने जौ के स्टार्च और चुकंदर के कचरे से 100% बायोडिग्रेडेबल प्लास्टिक बनाया है, जो दो महीनों के भीतर पूरी तरह से विघटित हो जाता है।",
      "यह नया बायोप्लास्टिक, जो एमाइलोज और नैनोसेलुलोज का बायोकॉम्पोजिट है, मजबूत, जलरोधक है और खाद्य पैकेजिंग जैसी अनुप्रयोगों के लिए उपयुक्त है, वर्तमान बायोप्लास्टिक के विपरीत जिसे औद्योगिक कंपोस्टिंग की आवश्यकता होती है।",
      "टीम इस सामग्री का पेटेंट करा रही है और कंपनियों के साथ मिलकर प्रोटोटाइप विकसित करने के लिए सहयोग कर रही है, जिसका उद्देश्य एक से पांच वर्षों के भीतर बाजार में उपलब्धता सुनिश्चित करना है।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने जौ से 100% बायोडिग्रेडेबल प्लास्टिक बनाया है, जिसका उद्देश्य पर्यावरण को नुकसान पहुंचाने वाले पारंपरिक प्लास्टिक की जगह लेना है।",
      "चिकित्सा उत्पादों में इसके उपयोग और इसकी समग्र स्थायित्व के बारे में चिंताएँ हैं, जो प्लास्टिक कचरे और जैव-अवक्रमणीय विकल्पों पर व्यापक चर्चा को प्रेरित कर रही हैं।",
      "बहस में इन विकल्पों की प्रभावशीलता और बड़े पैमाने पर कार्यान्वयन की चुनौतियों के साथ-साथ पुन: प्रयोज्य बैग के पर्यावरणीय प्रभाव शामिल हैं।"
    ],
    "points": 199,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1719282877
  },
  {
    "id": 40789672,
    "title": "मैंने एक जावास्क्रिप्ट-संचालित फ्लिपडिस्प्ले बनाया",
    "originLink": "https://flipdisc.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40789672",
    "commentBody": "",
    "originSummary": [
      "फ्लिपडिस्क्स, जो 80 साल पुरानी तकनीक है और विद्युतचुंबकीय दालों का उपयोग करके डिस्क को दो रंगों के बीच पलटती है, को उनकी पठनीयता, दीर्घायु और अनूठी ध्वनि के कारण एक बड़े इंटरैक्टिव दीवार कला परियोजना के लिए चुना गया।",
      "इस परियोजना में 3x3 ग्रिड में 9 अल्फाजेटा पैनलों का उपयोग किया गया, जिसे 24V 10A मीनवेल पावर सप्लाई द्वारा संचालित किया गया, और एनवीडिया ओरिन नैनो के माध्यम से विभिन्न वेब तकनीकों का उपयोग करके रेंडरिंग और एनिमेशन को नियंत्रित किया गया।",
      "टीम ने फ्लिपडिस्क स्क्रीन के लिए एक Node.js लाइब्रेरी और उपयोगकर्ता इंटरैक्शन के लिए एक एक्सपो ऐप बनाया, जिसका उद्देश्य शौकियों के लिए फ्लिपडिस्क को अधिक सुलभ बनाना और किफायती हार्डवेयर पर सहयोग को प्रोत्साहित करना है।"
    ],
    "commentSummary": [
      "जावा स्क्रिप्ट-संचालित फ्लिपडिस्प्ले बनाया गया, जिसमें फ्लिप डिस्क का उपयोग किया गया जो यांत्रिक समस्याओं के प्रति संवेदनशील हो सकते हैं लेकिन संचालन में होने पर आकर्षक होते हैं।",
      "पैनल्स को eBay और AlfaZeta से प्राप्त किया गया था, हालांकि वे महंगे हो सकते हैं, और डिस्प्ले का शोर नेटवर्क ऑपरेशंस सेंटर्स (NOCs) जैसे वातावरण में ध्यान आकर्षित कर सकता है।",
      "इस परियोजना ने स्रोत, आयु और संभावित अनुप्रयोगों के बारे में रुचि और चर्चाओं को उत्पन्न किया है।"
    ],
    "points": 176,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719328448
  },
  {
    "id": 40779643,
    "title": "किंडल एआई की अव्यवस्था के नरक में एक यात्रा",
    "originLink": "https://maxread.substack.com/p/my-kindle-thinks-im-stupid-now",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779643",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "रॉयल रोड पर इंडी लेखक अपनी रचनाओं के चोरी होने, एआई के माध्यम से चलाए जाने और किंडल पर प्रकाशित होने की रिपोर्ट कर रहे हैं, जिससे साहित्यिक चोरी और बौद्धिक संपदा के बारे में चिंताएं बढ़ रही हैं।",
      "लेखकों ने अपनी रचनाओं की चोरी को रोकने के लिए उन पर वॉटरमार्क जोड़ने का प्रयास किया है, लेकिन इस विधि की प्रभावशीलता अभी भी अनिश्चित है।",
      "कवर आर्ट बनाने के लिए एआई के उपयोग ने पारंपरिक कलाकारों को नाराज कर दिया है, जो महसूस करते हैं कि लेखकों को इसके बजाय मानव कलाकारों के साथ सहयोग करना चाहिए।"
    ],
    "points": 173,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1719256746
  },
  {
    "id": 40780940,
    "title": "आपमें से जिन्होंने सॉफ्टवेयर इंजीनियरिंग की दुनिया छोड़ दी, आपने किस क्षेत्र में परिवर्तन किया?",
    "originLink": "https://news.ycombinator.com/item?id=40780940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40780940",
    "commentBody": "",
    "originSummary": [
      "एक अनुभवी सॉफ्टवेयर इंजीनियर, जिसके पास 13 वर्षों का अनुभव है, पारंपरिक भूमिकाओं से जलन और असंतोष के कारण उद्योग छोड़ने पर विचार कर रहा है।",
      "वर्तमान में अनुबंधित और उद्यमिता का अन्वेषण कर रहे व्यक्ति को अपने भविष्य के बारे में अनिश्चितता है यदि उनका उद्यम विफल हो जाता है और वे इसकी कमाई की क्षमता के लिए तकनीकी बिक्री में बदलाव पर विचार कर रहे हैं।",
      "यह पोस्ट अनुभवी इंजीनियरों के बीच उद्योग की थकान और अधिक संतोषजनक या लाभदायक करियर पथों की खोज के बारे में एक सामान्य भावना को उजागर करती है।"
    ],
    "commentSummary": [
      "13 वर्षों तक सॉफ्टवेयर इंजीनियरिंग में काम करने के बाद, लेखक पारंपरिक 9-5 कोडिंग नौकरियों से दूर होकर उद्यमिता और ठेकेदारी की खोज कर रहे हैं।",
      "लेखक के पास एक इंजीनियरिंग प्रबंधक और वरिष्ठ/स्टाफ इंजीनियर के रूप में अनुभव है, लेकिन उद्योग की गतिशीलता से निराश हैं और ऐसे भूमिकाओं की तलाश कर रहे हैं जो लोगों और रणनीति में उनकी ताकत का उपयोग करें।",
      "लेखक एक तकनीकी कंपनी में बिक्री के क्षेत्र में जाने पर विचार कर रहे हैं और उन लोगों से सलाह या कहानियाँ मांग रहे हैं जिन्होंने इसी तरह के परिवर्तन किए हैं।"
    ],
    "points": 165,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1719264031
  }
]
