[
  {
    "id": 40782130,
    "title": "توصل جوليان أسانج إلى اتفاق مع الولايات المتحدة يسمح له بالخروج حرًا",
    "originLink": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782130",
    "commentBody": "",
    "originSummary": [
      "تم الإفراج عن جوليان أسانج، مؤسس ويكيليكس، من سجن بريطاني بعد خمس سنوات وهو في طريقه إلى جزر ماريانا الشمالية للاعتراف بالذنب في تهمة التآمر كجزء من صفقة إقرار بالذنب مع الولايات المتحدة.",
      "الاتفاق القضائي، الذي يتضمن حكماً بالسجن لمدة 62 شهراً مع احتساب الفترة التي قضاها في السجن، سينهي المعركة القانونية حول نشر الوثائق السرية، مما سيسمح لأسانج بأن يكون حراً عند الموافقة.",
      "من المتوقع أن يعود أسانج إلى أستراليا بعد الإجراءات، حيث تنتظره زوجته ستيلا وطفليهما."
    ],
    "commentSummary": [
      "توصل جوليان أسانج إلى صفقة اعتراف مع الولايات المتحدة، مما أدى إلى إطلاق سراحه من سجن بلمارش بعد 1901 يوم.",
      "تم تحقيق هذه النتيجة من خلال حملة عالمية ومفاوضات مع وزارة العدل الأمريكية، مما أدى إلى مغادرته المملكة المتحدة.",
      "أسانج، المعروف بنشر ويكيليكس الذي يكشف فساد الحكومات، سيلتقي قريبًا بعائلته."
    ],
    "points": 2291,
    "commentCount": 1174,
    "retryCount": 0,
    "time": 1719270607
  },
  {
    "id": 40786425,
    "title": "المحلي أولاً، إلى الأبد",
    "originLink": "https://tonsky.me/blog/crdt-filesync/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786425",
    "commentBody": "",
    "originSummary": [
      "البرمجيات المحلية أولاً تعطي الأولوية للحفاظ على البيانات على جهاز المستخدم مع المزامنة عبر الإنترنت من حين لآخر، مما يوفر التحكم والملكية على البيانات.",
      "تشمل التحديات الاعتماد على المكونات عبر الإنترنت للمزامنة، والتي يمكن التخفيف منها باستخدام خدمات السحابة المتاحة على نطاق واسع مثل Dropbox، iCloud Drive، OneDrive، Google Drive، أو Syncthing.",
      "يمكن تحقيق دمج البيانات بدون تعارض باستخدام CRDTs (أنواع البيانات المكررة بدون تعارض)، مع تنفيذات عملية موضحة باستخدام أدوات مثل Automerge على GitHub."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول مفهوم البرمجيات \"المحلية أولاً\"، التي تعطي الأولوية لتخزين البيانات محلياً على أجهزة المستخدمين بدلاً من الاعتماد على خدمات السحابة.",
      "نقطة رئيسية هي تحدي تحقيق الدخل من التطبيقات المحلية أولاً، حيث تكون نماذج الاشتراك التقليدية أقل قابلية للتطبيق، ويجب على المطورين العثور على مصادر إيرادات بديلة.",
      "تُبرز المحادثة أهمية استضافة خوادم المزامنة الخلفية ذاتيًا لضمان الوصول إلى البيانات على المدى الطويل والتحكم فيها، مع أمثلة على المشاريع الحالية والحلول المحتملة."
    ],
    "points": 573,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1719308830
  },
  {
    "id": 40786644,
    "title": "مايكروسوفت تزيل الوثائق الخاصة بالتحويل إلى حساب محلي في ويندوز 11",
    "originLink": "https://arstechnica.com/gadgets/2024/06/microsoft-removes-documentation-for-switching-to-a-local-account-in-windows-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786644",
    "commentBody": "",
    "originSummary": [
      "أزالت مايكروسوفت الوثائق الخاصة بالتبديل إلى حساب محلي في ويندوز 11، لكن معظم الحلول البديلة لا تزال تعمل.",
      "تتطلب إصدارات Windows 11 Home وPro حساب مايكروسوفت أثناء الإعداد، مما يوفر فوائد لخدمات مثل OneDrive أو Microsoft 365.",
      "تشمل الطرق لاستخدام حساب محلي الضغط على Shift+F10 أثناء الإعداد، استخدام أداة Rufus، أو إعداد الحساب باستخدام حساب Microsoft وتسجيل الخروج بعد ذلك."
    ],
    "commentSummary": [
      "أزالت مايكروسوفت الوثائق الخاصة بالتبديل إلى حساب محلي في ويندوز 11، مما تسبب في إحباط المستخدمين ومخاوف بشأن الخصوصية والبرامج الزائدة.",
      "يقارن المستخدمون نظام ويندوز 11 بالأنظمة المليئة بالإعلانات والمتطفلة، وبعضهم يتحول إلى بدائل مثل لينكس أو macOS.",
      "على الرغم من المحاولات لاستخدام الحسابات المحلية، يبلغ المستخدمون عن مشكلات وإعادة تعيين الإعدادات بعد التحديثات، مما يعكس استياءً أوسع من توجه مايكروسوفت."
    ],
    "points": 550,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1719310933
  },
  {
    "id": 40781838,
    "title": "الأشكال المستديرة موجودة في كل مكان",
    "originLink": "https://www.folklore.org/Round_Rects_Are_Everywhere.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781838",
    "commentBody": "",
    "originSummary": [
      "ألهم ستيف جوبز بيل أتكينسون لتنفيذ المستطيلات المستديرة في QuickDraw من خلال تسليط الضوء على وجودها الشائع في الأشياء اليومية.",
      "في البداية كان بيل أتكينسون متشككًا، لكنه سرعان ما طور عرضًا تجريبيًا جديدًا يرسم المستطيلات المستديرة تقريبًا بنفس سرعة المستطيلات العادية، مما أدى إلى أن تصبح ميزة \"RoundRects\" جزءًا أساسيًا من واجهة مستخدم ماكنتوش.",
      "تؤكد هذه القصة على أهمية تصميم واجهة المستخدم والروح الابتكارية في شركة آبل خلال تطوير جهاز ماكنتوش الأصلي."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول تطور تصميم واجهة المستخدم في نظام ويندوز، خاصة استخدام الزوايا المستديرة مقابل الزوايا المربعة في الإصدارات المختلفة.",
      "يعبر العديد من المستخدمين عن الحنين إلى إصدارات ويندوز القديمة مثل ويندوز 2000 وويندوز سيرفر 2003، مشيرين إلى بساطتها واتساقها.",
      "تمتد المحادثة إلى الأسباب العملية والجمالية للزوايا المستديرة في سياقات مختلفة، بما في ذلك الهندسة المعمارية وتصميم المنتجات."
    ],
    "points": 390,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1719268711
  },
  {
    "id": 40781048,
    "title": "نظام ويندوز 11 يتيح الآن نسخ مجلدات OneDrive احتياطيًا دون طلب إذن",
    "originLink": "https://www.neowin.net/news/windows-11-is-now-automatically-enabling-onedrive-folder-backup-without-asking-permission/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781048",
    "commentBody": "",
    "originSummary": [
      "سيتم إزالة لعبة فورزا هورايزن 4 من المتاجر في 14 ديسمبر، مما يعني أنها لن تكون متاحة للشراء بعد ذلك.",
      "ستنتهي قوائم التشغيل الخاصة باللعبة في 22 أغسطس، مما يشير إلى توقف تحديثات المحتوى الجديدة أو الأحداث."
    ],
    "commentSummary": [
      "يعمل نظام Windows 11 الآن على تمكين النسخ الاحتياطي لمجلد OneDrive تلقائيًا دون موافقة المستخدم، مما يسبب مشكلات مثل بطء سرعة الإنترنت وتغيير مسارات الدليل.",
      "يجد المستخدمون صعوبة في عكس هذه التغييرات، مما يؤدي إلى الإحباط وزيادة عدم الثقة في مايكروسوفت، حيث يفكر البعض في بدائل مثل لينكس أو macOS.",
      "يثير النسخ الاحتياطي التلقائي مخاوف بشأن الخصوصية، خاصة بالنسبة للبيانات الحساسة، مما يدفع المستخدمين إلى الإبلاغ عن هذه الممارسات للسلطات مثل لجنة التجارة الفيدرالية."
    ],
    "points": 294,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1719264643
  },
  {
    "id": 40779785,
    "title": "الحجة ضد تعقيم الحكايات الخرافية",
    "originLink": "https://www.plough.com/en/topics/culture/literature/the-case-for-not-sanitizing-fairy-tales",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779785",
    "commentBody": "",
    "originSummary": [
      "تعلم الحكايات الخرافية الأطفال عن وجود الشر والعنف والخطر، وهي دروس مهمة لفهم قسوة الحياة.",
      "تجادل هايلي ستيوارت بأن تنقية هذه القصص، كما هو الحال في التعديلات الحديثة مثل نسخ ديزني، تحرم الأطفال من فرصة معالجة مخاوفهم وفهم أن الخير يمكن أن ينتصر.",
      "ستيوارت يدعو إلى الحفاظ على النسخ الأصلية وغير المعدلة من الحكايات الخيالية لمساعدة الأطفال على تطوير المرونة والتعامل مع تعقيدات العالم."
    ],
    "commentSummary": [
      "يتضمن الجدل حول تنقيح القصص الخيالية موازنة القيم المعاصرة مع الحفاظ على الرسائل الأصلية والأهمية الثقافية.",
      "تُعتبر تعديلات ديزني، مثل \"حورية البحر الصغيرة\"، أمثلة على تحديث القصص القديمة، مما يثير نقاشات حول ما إذا كانت هذه التغييرات ضرورية أم تشكل رقابة.",
      "يجادل المؤيدون بأن تطور القصص يمكن أن يجعلها أكثر سهولة وتأثيرًا على الجماهير الحديثة، بينما يخشى النقاد من تمييع نيتها الأصلية وأهميتها الثقافية."
    ],
    "points": 268,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1719257752
  },
  {
    "id": 40783598,
    "title": "رؤية حاسوبية مسرعة باستخدام SIMD على متحكم دقيق بقيمة 2 دولار",
    "originLink": "https://shraiwi.github.io/read.html?md=blog/simd-fast-esp32s3.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783598",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يمكن لوحدة التحكم الدقيقة التي تكلف 2 دولار، مثل ESP32-S3، الآن تنفيذ رؤية حاسوبية مسرعة بتعليمات SIMD (تعليمات واحدة، بيانات متعددة)، مما يعزز الأداء بشكل كبير للمهام في الوقت الفعلي.",
      "تقدم Edge Impulse أدوات لتحسين نماذج التعلم العميق ورؤية الحاسوب للمتحكمات الدقيقة، مما يسمح للمستخدمين بتحميل النماذج واستلام مكتبات C++ المحسنة.",
      "تغطي المناقشات أيضًا إمكانية وحدات معالجة التنسور (TPUs) الميسورة التكلفة، ولوحات FPGA (المصفوفة المنطقية القابلة للبرمجة ميدانيًا)، واستخدام لغة البرمجة Rust لتطوير ESP32."
    ],
    "points": 260,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719281440
  },
  {
    "id": 40782541,
    "title": "رفضت Apple تطبيق iDOS 3",
    "originLink": "https://litchie.com/2024/04/new-hope",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782541",
    "commentBody": "",
    "originSummary": [
      "قامت شركة آبل بإدراج iDOS 2 في القائمة السوداء، مما أجبر المطور على إعادة تقديمه باسم \"iDOS 3\"، والذي تم رفضه في البداية لكونه مشابهًا جدًا لسابقه ولـ \"تصميم البريد العشوائي\".",
      "على الرغم من تفسيرات المطور، لم تحل شركة آبل المشكلة، ولا يزال التطبيق قيد المراجعة، حيث تقدم آبل إرشادات غامضة حول ما يشكل وحدة تحكم ألعاب قديمة.",
      "المطور في انتظار تحديثات إضافية ويأمل في تبرير زيادة الإصدار للمستخدمين قريبًا."
    ],
    "commentSummary": [
      "رفضت شركة آبل تطبيق iDOS 3، مدعية أنه ليس وحدة تحكم ألعاب قديمة، وقدمت إرشادات غير واضحة للتغييرات اللازمة.",
      "يؤكد هذا الحادث الانتقادات المستمرة لعملية مراجعة التطبيقات في شركة آبل، والتي يجدها العديد من المطورين تعسفية وغير متسقة.",
      "قد يعالج قانون الأسواق الرقمية (DMA) هذه القضايا في المستقبل، لكنه ليس حلاً فورياً."
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719273189
  },
  {
    "id": 40783229,
    "title": "من 0/10 إلى 8/10: مايكروسوفت تضع الإصلاح في المقدمة",
    "originLink": "https://www.ifixit.com/News/96998/from-0-10-to-8-10-microsoft-puts-repair-front-and-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783229",
    "commentBody": "",
    "originSummary": [
      "لقد حسّنت مايكروسوفت بشكل كبير من قابلية إصلاح أجهزتها من نوع Surface، حيث تحسّن جهاز Surface Laptop 7 من تقييم 0/10 إلى 8/10.",
      "تشمل الميزات الرئيسية التي تسهم في هذا التحسن رموز QR لأدلة الخدمة ورموز Wayfinder لتسهيل التفكيك.",
      "يظهر جهاز Surface Pro 11 أيضًا تقدمًا كبيرًا في قابلية الإصلاح، مع مكونات يمكن الوصول إليها وعدم استخدام الغراء، مما يعكس التزام مايكروسوفت المتأثر بالدعوة إلى حق الإصلاح."
    ],
    "commentSummary": [
      "قامت مايكروسوفت بتحسين قابلية إصلاح أجهزتها من نوع Surface، محققةً درجة 8/10 من iFixit، ومن المحتمل أن يكون ذلك بتأثير من اللوائح الأوروبية.",
      "تعبر المناقشات على Hacker News عن شكوك حول دوافع مايكروسوفت، مشيرة إلى أن الضغط التنظيمي هو السبب وليس النية الحسنة الحقيقية.",
      "تتناول المحادثة أيضًا مواضيع أوسع مثل سلوك الشركات، وتنظيم الأسواق، وتأثير التشريعات الأوروبية على المعايير العالمية."
    ],
    "points": 213,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719278395
  },
  {
    "id": 40787842,
    "title": "اتهام مايكروسوفت بانتهاك قوانين مكافحة الاحتكار في الاتحاد الأوروبي بسبب دمج Teams",
    "originLink": "https://www.theverge.com/2024/6/25/24185467/microsoft-teams-eu-bundling-antitrust-violations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40787842",
    "commentBody": "",
    "originSummary": [
      "تم اتهام شركة مايكروسوفت من قبل الجهات التنظيمية في الاتحاد الأوروبي بانتهاكات مكافحة الاحتكار بسبب دمج تطبيق الدردشة Teams مع اشتراكات Office 365 وMicrosoft 365.",
      "هذه هي أول تهمة من هذا النوع منذ 15 عامًا، بعد حالات سابقة تتعلق بـ Windows Media Player وInternet Explorer، وتنشأ من شكوى قدمتها شركة Slack في عام 2020.",
      "إذا ثبتت إدانتها، قد تواجه مايكروسوفت غرامة تصل إلى 10% من إيراداتها السنوية العالمية وقد تُطلب منها تغيير منتجاتها البرمجية."
    ],
    "commentSummary": [
      "تواجه شركة مايكروسوفت اتهامات بمكافحة الاحتكار من الاتحاد الأوروبي بسبب دمجها برنامج Teams مع منتجات أخرى.",
      "تشير التهم إلى أن هذه الممارسة المتمثلة في التجميع قد تكون غير تنافسية، مما قد يلحق الضرر بالشركات الأخرى في السوق.",
      "هذا التطور مهم لأنه يسلط الضوء على التدقيق التنظيمي المستمر لممارسات الأعمال لشركات التكنولوجيا الكبرى في الاتحاد الأوروبي."
    ],
    "points": 206,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719319214
  },
  {
    "id": 40782101,
    "title": "موقع أخبار MTV يتوقف عن العمل، والأرشيفات تُسحب من الإنترنت",
    "originLink": "https://variety.com/2024/digital/news/mtv-news-website-archives-pulled-offline-1236047163/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782101",
    "commentBody": "",
    "originSummary": [
      "قامت قناة MTV بإزالة محتوى يزيد عن عقدين من الزمن من موقع MTVNews.com، وأعادت توجيه الزوار إلى الموقع الرئيسي لـ MTV، بما في ذلك الصحافة الموسيقية الهامة وأرشيفات الهيب هوب.",
      "يأتي الإغلاق بعد إغلاق أخبار MTV في عام 2023 بسبب مشاكل مالية في الشركة الأم Paramount Global، حيث أعرب الموظفون السابقون عن إحباطهم على وسائل التواصل الاجتماعي.",
      "قامت شركة باراماونت جلوبال أيضًا بإزالة المحتوى من موقع CMT، وبينما يقترح البعض استخدام خدمات أرشفة الإنترنت، قد لا تكون المقالات القديمة متاحة."
    ],
    "commentSummary": [
      "موقع أخبار MTV قد توقف عن العمل، وتم سحب أرشيفاته، مما أثار مخاوف بشأن الحفاظ على الصحافة الرقمية والتاريخ الثقافي.",
      "يسلط الحادث الضوء على القضية الأوسع لحقوق الأرشفة للصحفيين، مشددًا على الحاجة إلى الحصول على الائتمان الدائم والوصول إلى أعمالهم، على غرار كيفية تقديم الصحف الكبرى لإعادة الطبع والأرشيفات الرقمية.",
      "تؤكد المناقشة على أهمية الأرشيفات الرقمية القوية وسهلة الوصول، مع اقتراح البعض دعم منظمات مثل أرشيف الإنترنت لضمان ديمومة البيانات المخزنة على مستوى العالم."
    ],
    "points": 206,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1719270382
  },
  {
    "id": 40783777,
    "title": "باحثون يخترعون 'بلاستيك الشعير' القابل للتحلل بنسبة 100%",
    "originLink": "https://phys.org/news/2024-06-biodegradable-barley-plastic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783777",
    "commentBody": "",
    "originSummary": [
      "قام باحثون في جامعة كوبنهاغن بإنشاء بلاستيك قابل للتحلل بنسبة 100% من نشا الشعير ومخلفات بنجر السكر، والذي يتحلل تمامًا في غضون شهرين.",
      "هذا البلاستيك الحيوي الجديد، وهو مركب حيوي من الأميلوز والنانو سليلوز، قوي ومقاوم للماء ومناسب لتطبيقات مثل تغليف المواد الغذائية، على عكس البلاستيك الحيوي الحالي الذي يحتاج إلى التسميد الصناعي.",
      "يقوم الفريق بتسجيل براءة اختراع للمادة والتعاون مع الشركات لتطوير نماذج أولية، بهدف توفرها في السوق خلال فترة تتراوح بين سنة وخمس سنوات."
    ],
    "commentSummary": [
      "قام الباحثون بإنشاء بلاستيك قابل للتحلل بنسبة 100% من الشعير، بهدف استبدال البلاستيك التقليدي الذي يضر بالبيئة.",
      "توجد مخاوف بشأن استخدامه في المنتجات الطبية ومتانته العامة، مما يثير نقاشًا أوسع حول النفايات البلاستيكية والبدائل القابلة للتحلل البيولوجي.",
      "تشمل المناقشة فعالية هذه البدائل والتحديات المتعلقة بتنفيذها على نطاق واسع، إلى جانب التأثير البيئي للأكياس القابلة لإعادة الاستخدام."
    ],
    "points": 199,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1719282877
  },
  {
    "id": 40789672,
    "title": "لقد أنشأت شاشة flipdisc تعمل بجافا سكريبت",
    "originLink": "https://flipdisc.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40789672",
    "commentBody": "",
    "originSummary": [
      "تم اختيار تقنية Flipdiscs، وهي تقنية عمرها 80 عامًا تستخدم النبضات الكهرومغناطيسية لقلب الأقراص بين لونين، لمشروع كبير للفن الجداري التفاعلي بسبب وضوحها وطول عمرها وصوتها الفريد.",
      "تضمن المشروع استخدام 9 لوحات ألفازيتا في شبكة 3x3، تعمل بواسطة مزود طاقة Meanwell بجهد 24 فولت وتيار 10 أمبير، ويتم التحكم فيها عبر Nvidia Orin Nano باستخدام تقنيات ويب مختلفة للعرض والرسوم المتحركة.",
      "قام الفريق ببناء مكتبة Node.js لشاشات flipdisc وتطبيق expo للتفاعل مع المستخدم، بهدف جعل شاشات flipdisc أكثر سهولة للهواة وتشجيع التعاون على الأجهزة الميسورة التكلفة."
    ],
    "commentSummary": [
      "تم إنشاء شاشة عرض تعمل بجافا سكريبت باستخدام أقراص قابلة للانقلاب، والتي قد تكون عرضة للمشاكل الميكانيكية ولكنها تكون جذابة عند التشغيل.",
      "تم الحصول على الألواح من eBay وAlfaZeta، على الرغم من أنها قد تكون مكلفة، ويمكن أن يجذب ضجيج العرض الانتباه في بيئات مثل مراكز عمليات الشبكة (NOCs).",
      "لقد أثار المشروع اهتمامًا ونقاشات حول مصادره، وعمره الافتراضي، وتطبيقاته المحتملة."
    ],
    "points": 176,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719328448
  },
  {
    "id": 40779643,
    "title": "رحلة إلى جحيم فوضى الذكاء الاصطناعي في كيندل",
    "originLink": "https://maxread.substack.com/p/my-kindle-thinks-im-stupid-now",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779643",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يبلغ المؤلفون المستقلون على موقع Royal Road عن سرقة أعمالهم، ومعالجتها بواسطة الذكاء الاصطناعي، ونشرها على منصة Kindle، مما يثير مخاوف بشأن الانتحال والملكية الفكرية.",
      "حاول المؤلفون إضافة علامات مائية إلى أعمالهم لمنع السرقة، لكن فعالية هذه الطريقة لا تزال غير مؤكدة.",
      "استخدام الذكاء الاصطناعي في إنشاء أغلفة الكتب أثار غضب الفنانين التقليديين، الذين يشعرون بأن المؤلفين يجب أن يتعاونوا مع الفنانين البشريين بدلاً من ذلك."
    ],
    "points": 173,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1719256746
  },
  {
    "id": 40780940,
    "title": "أولئك منكم الذين غادروا عالم هندسة البرمجيات، إلى ماذا انتقلتم؟",
    "originLink": "https://news.ycombinator.com/item?id=40780940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40780940",
    "commentBody": "",
    "originSummary": [
      "مهندس برمجيات متمرس لديه 13 عامًا من الخبرة يفكر في مغادرة الصناعة بسبب الإرهاق وعدم الرضا عن الأدوار التقليدية.",
      "يعمل حاليًا في التعاقد واستكشاف ريادة الأعمال، ويشعر بعدم اليقين بشأن مستقبله إذا فشل مشروعه، ويفكر في التحول إلى مبيعات التكنولوجيا نظرًا لإمكانيات الكسب فيها.",
      "تسلط المشاركة الضوء على شعور شائع بين المهندسين ذوي الخبرة حول الإرهاق في الصناعة والبحث عن مسارات وظيفية أكثر إرضاءً أو ربحية."
    ],
    "commentSummary": [
      "بعد 13 عامًا في هندسة البرمجيات، ينتقل المؤلف بعيدًا عن وظائف البرمجة التقليدية من التاسعة إلى الخامسة لاستكشاف ريادة الأعمال والعمل بالعقود.",
      "لدى المؤلف خبرة كمدير هندسي ومهندس أول/كبير، لكنه يشعر بخيبة أمل من ديناميكيات الصناعة ويسعى إلى أدوار تستفيد من نقاط قوته في التعامل مع الناس والاستراتيجية.",
      "يفكر المؤلف في الانتقال إلى مجال المبيعات في شركة تكنولوجيا ويبحث عن نصائح أو قصص من الآخرين الذين قاموا بانتقالات مشابهة."
    ],
    "points": 165,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1719264031
  }
]
