[
  {
    "id": 40782130,
    "title": "« Julian Assange a conclu un accord de plaidoyer avec les États-Unis, lui permettant de retrouver la liberté »",
    "originLink": "https://www.nbcnews.com/politics/justice-department/julian-assange-reached-plea-deal-us-allowing-go-free-rcna158695",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782130",
    "commentBody": "",
    "originSummary": [
      "« Julian Assange, fondateur de WikiLeaks, a été libéré d'une prison britannique après cinq ans et se dirige vers les Îles Mariannes du Nord pour plaider coupable à une accusation de complot dans le cadre d'un accord de plaidoyer avec les États-Unis. »",
      "« L'accord de plaidoyer, qui comprend une peine de 62 mois avec crédit pour le temps déjà purgé, mettra fin à la bataille juridique concernant la publication de documents classifiés, permettant à Assange d'être libre une fois approuvé. »",
      "« Assange devrait retourner en Australie après les procédures, où sa femme Stella et leurs deux enfants attendent son retour. »"
    ],
    "commentSummary": [
      "« Julian Assange a conclu un accord de plaidoyer avec les États-Unis, ce qui a entraîné sa libération de la prison de Belmarsh après 1901 jours. »",
      "« Ce résultat a été obtenu grâce à une campagne mondiale et à des négociations avec le ministère de la Justice des États-Unis, conduisant à son départ du Royaume-Uni. »",
      "« Assange, connu pour les publications de WikiLeaks exposant la corruption gouvernementale, retrouvera bientôt sa famille. »"
    ],
    "points": 2291,
    "commentCount": 1174,
    "retryCount": 0,
    "time": 1719270607
  },
  {
    "id": 40786425,
    "title": "« Local d'abord, pour toujours »",
    "originLink": "https://tonsky.me/blog/crdt-filesync/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786425",
    "commentBody": "",
    "originSummary": [
      "« Les logiciels local-first privilégient la conservation des données sur l'appareil de l'utilisateur tout en se synchronisant occasionnellement en ligne, offrant ainsi contrôle et propriété des données. »",
      "« Les défis incluent la dépendance aux composants en ligne pour la synchronisation, ce qui peut être atténué en utilisant des services cloud largement disponibles comme Dropbox, iCloud Drive, OneDrive, Google Drive ou Syncthing. »",
      "« La fusion de données sans conflit peut être réalisée en utilisant des CRDT (types de données répliquées sans conflit), avec des implémentations pratiques démontrées à l'aide d'outils comme Automerge sur GitHub. »"
    ],
    "commentSummary": [
      "Le débat se concentre sur le concept de logiciel « local-first », qui privilégie le stockage des données localement sur les appareils des utilisateurs plutôt que de dépendre des services cloud.",
      "« Un point clé est le défi de monétiser les applications locales en premier, car les modèles d'abonnement traditionnels sont moins applicables, et les développeurs doivent trouver des sources de revenus alternatives. »",
      "« La conversation souligne l'importance d'héberger soi-même des serveurs de synchronisation backend pour garantir l'accessibilité et le contrôle des données à long terme, avec des exemples de projets actuels et de solutions potentielles. »"
    ],
    "points": 573,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1719308830
  },
  {
    "id": 40786644,
    "title": "« Microsoft supprime la documentation pour passer à un compte local dans Windows 11 »",
    "originLink": "https://arstechnica.com/gadgets/2024/06/microsoft-removes-documentation-for-switching-to-a-local-account-in-windows-11/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40786644",
    "commentBody": "",
    "originSummary": [
      "« Microsoft a supprimé la documentation pour passer à un compte local dans Windows 11, mais la plupart des solutions de contournement fonctionnent toujours. »",
      "Les éditions Windows 11 Home et Pro nécessitent un compte Microsoft lors de l'installation, offrant des avantages pour des services comme OneDrive ou Microsoft 365.",
      "Les méthodes pour utiliser un compte local incluent l'appui sur Shift+F10 pendant l'installation, l'utilisation de l'outil Rufus, ou la configuration avec un compte Microsoft et la déconnexion par la suite."
    ],
    "commentSummary": [
      "« Microsoft a supprimé la documentation pour passer à un compte local dans Windows 11, provoquant la frustration des utilisateurs et des inquiétudes concernant la confidentialité et les logiciels indésirables. »",
      "Les utilisateurs comparent Windows 11 à des systèmes intrusifs et remplis de publicités, et certains passent à des alternatives comme Linux ou macOS.",
      "« Malgré les tentatives d'utiliser des comptes locaux, les utilisateurs signalent des problèmes et des paramètres réinitialisés après les mises à jour, reflétant une insatisfaction plus large envers la direction de Microsoft. »"
    ],
    "points": 550,
    "commentCount": 322,
    "retryCount": 0,
    "time": 1719310933
  },
  {
    "id": 40781838,
    "title": "« Les rectangles arrondis sont partout »",
    "originLink": "https://www.folklore.org/Round_Rects_Are_Everywhere.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781838",
    "commentBody": "",
    "originSummary": [
      "« Steve Jobs a inspiré Bill Atkinson à implémenter des rectangles arrondis dans QuickDraw en soulignant leur présence commune dans les objets du quotidien. »",
      "« Initialement sceptique, Bill Atkinson a rapidement développé une nouvelle démonstration qui dessinait des rectangles arrondis presque aussi rapidement que des rectangles simples, ce qui a conduit à ce que la fonctionnalité \"RoundRects\" devienne une partie clé de l'interface utilisateur du Macintosh. »",
      "« Cette histoire souligne l'importance de la conception de l'interface utilisateur et l'esprit d'innovation chez Apple lors du développement du Macintosh original. »"
    ],
    "commentSummary": [
      "« La discussion se concentre sur l'évolution du design de l'interface utilisateur de Windows, en particulier l'utilisation des coins arrondis par rapport aux coins carrés dans différentes versions. »",
      "« De nombreux utilisateurs expriment de la nostalgie pour les anciennes versions de Windows comme Windows 2000 et Windows Server 2003, en citant leur simplicité et leur cohérence. »",
      "« La conversation s'étend aux raisons pratiques et esthétiques des coins arrondis dans divers contextes, y compris l'architecture et le design de produits. »"
    ],
    "points": 390,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1719268711
  },
  {
    "id": 40781048,
    "title": "Windows 11 permet désormais la sauvegarde des dossiers OneDrive sans demander la permission",
    "originLink": "https://www.neowin.net/news/windows-11-is-now-automatically-enabling-onedrive-folder-backup-without-asking-permission/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40781048",
    "commentBody": "",
    "originSummary": [
      "« Forza Horizon 4 sera retiré des magasins le 14 décembre, ce qui signifie qu'il ne sera plus disponible à l'achat. »",
      "« Les listes de lecture du jeu prendront fin le 22 août, indiquant une cessation des mises à jour de contenu ou des événements. »"
    ],
    "commentSummary": [
      "« Windows 11 active désormais automatiquement la sauvegarde des dossiers OneDrive sans le consentement de l'utilisateur, causant des problèmes tels que des vitesses internet lentes et des chemins de répertoires modifiés. »",
      "« Les utilisateurs trouvent difficile de revenir en arrière sur ces changements, ce qui entraîne de la frustration et une méfiance croissante envers Microsoft, certains envisageant des alternatives comme Linux ou macOS. »",
      "Les sauvegardes automatiques soulèvent des préoccupations en matière de confidentialité, en particulier pour les données sensibles, incitant les utilisateurs à signaler ces pratiques aux autorités telles que la FTC."
    ],
    "points": 294,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1719264643
  },
  {
    "id": 40779785,
    "title": "« L'argument en faveur de ne pas aseptiser les contes de fées »",
    "originLink": "https://www.plough.com/en/topics/culture/literature/the-case-for-not-sanitizing-fairy-tales",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779785",
    "commentBody": "",
    "originSummary": [
      "Les contes de fées enseignent aux enfants l'existence du mal, de la violence et du danger, qui sont des leçons importantes pour comprendre les dures réalités de la vie.",
      "« Haley Stewart soutient que la désinfection de ces histoires, comme on le voit dans les adaptations modernes telles que les versions de Disney, prive les enfants de l'opportunité de traiter leurs peurs et de comprendre que la bonté peut prévaloir. »",
      "« Stewart plaide pour la préservation des versions originales et non altérées des contes de fées afin d'aider les enfants à développer leur résilience et à naviguer dans les complexités du monde. »"
    ],
    "commentSummary": [
      "« Le débat sur la désinfection des contes de fées implique de trouver un équilibre entre les valeurs contemporaines et la préservation des messages originaux et de la pertinence culturelle. »",
      "« Les adaptations de Disney, telles que \"La Petite Sirène\", sont souvent citées comme des exemples de modernisation des histoires anciennes, suscitant des discussions sur la nécessité de ces changements ou s'ils constituent une forme de censure. »",
      "Les partisans soutiennent que l'évolution des histoires peut les rendre plus accessibles et percutantes pour les publics modernes, tandis que les critiques s'inquiètent de diluer leur intention originale et leur signification culturelle."
    ],
    "points": 268,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1719257752
  },
  {
    "id": 40783598,
    "title": "Vision par ordinateur accélérée par SIMD sur un microcontrôleur à 2 $",
    "originLink": "https://shraiwi.github.io/read.html?md=blog/simd-fast-esp32s3.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783598",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Un microcontrôleur à 2 $, tel que l'ESP32-S3, peut désormais effectuer de la vision par ordinateur accélérée par SIMD (Single Instruction, Multiple Data), améliorant considérablement les performances pour les tâches en temps réel.",
      "« Edge Impulse fournit des outils pour optimiser les modèles d'apprentissage profond et de vision par ordinateur pour les microcontrôleurs, permettant aux utilisateurs de télécharger des modèles et de recevoir des bibliothèques C++ optimisées. »",
      "« Les discussions portent également sur le potentiel des TPU (Tensor Processing Units) abordables, des cartes FPGA (Field-Programmable Gate Array) et de l'utilisation du langage de programmation Rust pour le développement ESP32. »"
    ],
    "points": 260,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1719281440
  },
  {
    "id": 40782541,
    "title": "« iDOS 3 rejeté par Apple »",
    "originLink": "https://litchie.com/2024/04/new-hope",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782541",
    "commentBody": "",
    "originSummary": [
      "« Apple a mis iDOS 2 sur liste noire, obligeant le développeur à le soumettre à nouveau sous le nom de \"iDOS 3\", qui a été initialement rejeté pour être trop similaire à son prédécesseur et pour \"spam de conception\". »",
      "Malgré les explications du développeur, Apple n'a pas résolu le problème, et l'application reste en cours d'examen, Apple fournissant des directives vagues sur ce qui constitue une console de jeux rétro.",
      "« Le développeur attend de nouvelles mises à jour et espère justifier bientôt l'augmentation de la version auprès des utilisateurs. »"
    ],
    "commentSummary": [
      "« Apple a rejeté l'application iDOS 3, affirmant qu'elle n'est pas une console de jeu rétro, et a fourni des indications peu claires pour les modifications nécessaires. »",
      "« Cet incident souligne les critiques persistantes à l'égard du processus de révision des applications d'Apple, que de nombreux développeurs trouvent arbitraire et incohérent. »",
      "« La loi sur les marchés numériques (DMA) pourrait potentiellement résoudre ces problèmes à l'avenir, mais ce n'est pas une solution immédiate. »"
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719273189
  },
  {
    "id": 40783229,
    "title": "« De 0/10 à 8/10 : Microsoft met la réparation au premier plan »",
    "originLink": "https://www.ifixit.com/News/96998/from-0-10-to-8-10-microsoft-puts-repair-front-and-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783229",
    "commentBody": "",
    "originSummary": [
      "« Microsoft a considérablement amélioré la réparabilité de ses appareils Surface, avec le Surface Laptop 7 passant de 0/10 à 8/10. »",
      "« Les principales caractéristiques contribuant à cette amélioration incluent des codes QR pour les manuels de service et des symboles de guidage pour un démontage plus facile. »",
      "« La Surface Pro 11 montre également des avancées significatives en matière de réparabilité, avec des composants accessibles et sans utilisation de colle, reflétant l'engagement de Microsoft influencé par le plaidoyer pour le droit à la réparation. »"
    ],
    "commentSummary": [
      "Microsoft a amélioré la réparabilité de ses appareils Surface, obtenant un score de 8/10 de la part d'iFixit, probablement influencé par les réglementations de l'UE.",
      "Les discussions sur Hacker News expriment du scepticisme quant aux motivations de Microsoft, suggérant une pression réglementaire plutôt qu'une véritable bonne volonté.",
      "« La conversation aborde également des sujets plus larges tels que le comportement des entreprises, les régulations du marché et l'impact de la législation de l'UE sur les normes mondiales. »"
    ],
    "points": 213,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1719278395
  },
  {
    "id": 40787842,
    "title": "« Microsoft accusé de violations antitrust par l'UE pour l'intégration de Teams »",
    "originLink": "https://www.theverge.com/2024/6/25/24185467/microsoft-teams-eu-bundling-antitrust-violations",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40787842",
    "commentBody": "",
    "originSummary": [
      "« Microsoft a été accusé par les régulateurs de l'UE de violations antitrust pour avoir intégré son application de chat Teams avec les abonnements Office 365 et Microsoft 365. »",
      "C'est la première accusation de ce type en 15 ans, après des cas précédents impliquant Windows Media Player et Internet Explorer, et découle d'une plainte déposée par Slack en 2020.",
      "Si elle est reconnue coupable, Microsoft pourrait être condamnée à une amende pouvant aller jusqu'à 10 % de son chiffre d'affaires annuel mondial et être obligée de modifier ses produits logiciels."
    ],
    "commentSummary": [
      "« Microsoft fait face à des accusations de pratiques anticoncurrentielles de la part de l'Union européenne pour avoir intégré son logiciel Teams avec d'autres produits. »",
      "« Les accusations suggèrent que cette pratique de regroupement pourrait être anticoncurrentielle, potentiellement nuisible à d'autres entreprises sur le marché. »",
      "« Ce développement est significatif car il met en lumière la surveillance réglementaire continue des pratiques commerciales des grandes entreprises technologiques dans l'UE. »"
    ],
    "points": 206,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1719319214
  },
  {
    "id": 40782101,
    "title": "Le site d'actualités de MTV s'éteint, les archives retirées en ligne",
    "originLink": "https://variety.com/2024/digital/news/mtv-news-website-archives-pulled-offline-1236047163/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40782101",
    "commentBody": "",
    "originSummary": [
      "« MTV a supprimé plus de deux décennies de contenu de MTVNews.com, redirigeant les visiteurs vers le site principal de MTV, y compris des archives importantes de journalisme musical et de hip-hop. »",
      "« La fermeture fait suite à la clôture de MTV News en 2023 en raison de problèmes financiers chez la société mère Paramount Global, les anciens employés exprimant leur frustration sur les réseaux sociaux. »",
      "Paramount Global a également supprimé du contenu du site de CMT, et bien que certains suggèrent d'utiliser des services d'archivage internet, les articles plus anciens peuvent ne pas être disponibles."
    ],
    "commentSummary": [
      "« Le site web de MTV News est hors ligne et ses archives ont été retirées, ce qui suscite des inquiétudes quant à la préservation du journalisme numérique et de l'histoire culturelle. »",
      "« L'incident met en lumière la question plus large des droits d'archivage pour les journalistes, en soulignant la nécessité d'un crédit permanent et d'un accès à leur travail, similaire à la manière dont les grands journaux offrent des réimpressions et des archives numériques. »",
      "« La discussion souligne l'importance des archives numériques robustes et accessibles, certains suggérant de soutenir des organisations comme l'Internet Archive pour garantir la durabilité des données stockées à l'échelle mondiale. »"
    ],
    "points": 206,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1719270382
  },
  {
    "id": 40783777,
    "title": "Des chercheurs inventent un 'plastique d'orge' 100 % biodégradable",
    "originLink": "https://phys.org/news/2024-06-biodegradable-barley-plastic.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40783777",
    "commentBody": "",
    "originSummary": [
      "Des chercheurs de l'Université de Copenhague ont créé un plastique 100 % biodégradable à partir d'amidon d'orge et de déchets de betterave sucrière, qui se décompose complètement en deux mois.",
      "« Ce nouveau bioplastique, un biocomposite d'amylose et de nanocellulose, est solide, résistant à l'eau et adapté à des applications comme l'emballage alimentaire, contrairement aux bioplastiques actuels qui nécessitent un compostage industriel. »",
      "« L'équipe est en train de breveter le matériau et collabore avec des entreprises pour développer des prototypes, visant une disponibilité sur le marché d'ici un à cinq ans. »"
    ],
    "commentSummary": [
      "« Les chercheurs ont créé un plastique 100 % biodégradable à partir d'orge, visant à remplacer les plastiques traditionnels qui nuisent à l'environnement. »",
      "Des préoccupations existent quant à son utilisation dans les produits médicaux et sa durabilité globale, ce qui suscite une discussion plus large sur les déchets plastiques et les alternatives biodégradables.",
      "« Le débat inclut l'efficacité de ces alternatives et les défis de leur mise en œuvre à grande échelle, ainsi que l'impact environnemental des sacs réutilisables. »"
    ],
    "points": 199,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1719282877
  },
  {
    "id": 40789672,
    "title": "« J'ai construit un affichage flipdisc alimenté par JavaScript »",
    "originLink": "https://flipdisc.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40789672",
    "commentBody": "",
    "originSummary": [
      "« Les Flipdiscs, une technologie vieille de 80 ans utilisant des impulsions électromagnétiques pour faire basculer des disques entre deux couleurs, ont été choisis pour un grand projet d'art mural interactif en raison de leur lisibilité, de leur longévité et de leur son unique. »",
      "« Le projet impliquait l'utilisation de 9 panneaux Alfazeta disposés en une grille de 3x3, alimentés par une alimentation Meanwell de 24V 10A, et contrôlés via un Nvidia Orin Nano avec diverses technologies web pour le rendu et les animations. »",
      "« L'équipe a créé une bibliothèque Node.js pour les écrans flipdisc et une application expo pour l'interaction utilisateur, visant à rendre les flipdiscs plus accessibles aux amateurs et à encourager la collaboration sur du matériel abordable. »"
    ],
    "commentSummary": [
      "« Un affichage à disques rotatifs alimenté par JavaScript a été créé, utilisant des disques rotatifs qui peuvent être sujets à des problèmes mécaniques mais sont captivants lorsqu'ils fonctionnent. »",
      "« Les panneaux ont été achetés sur eBay et AlfaZeta, bien qu'ils puissent être coûteux, et le bruit de l'affichage peut attirer l'attention dans des environnements comme les centres d'opérations réseau (NOCs). »",
      "« Le projet a suscité de l'intérêt et des discussions concernant l'approvisionnement, la durée de vie et les applications potentielles. »"
    ],
    "points": 176,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1719328448
  },
  {
    "id": 40779643,
    "title": "« Un voyage en enfer dans la boue de l'IA de Kindle »",
    "originLink": "https://maxread.substack.com/p/my-kindle-thinks-im-stupid-now",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40779643",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Les auteurs indépendants sur Royal Road signalent que leur travail est volé, passé à travers une IA, et publié sur Kindle, ce qui soulève des préoccupations concernant le plagiat et la propriété intellectuelle.",
      "« Les auteurs ont tenté d'ajouter des filigranes à leurs œuvres pour prévenir le vol, mais l'efficacité de cette méthode reste incertaine. »",
      "« L'utilisation de l'IA pour générer des couvertures a irrité les artistes traditionnels, qui estiment que les auteurs devraient collaborer avec des artistes humains à la place. »"
    ],
    "points": 173,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1719256746
  },
  {
    "id": 40780940,
    "title": "« Ceux d'entre vous qui ont quitté le monde du développement logiciel, vers quoi vous êtes-vous reconvertis ? »",
    "originLink": "https://news.ycombinator.com/item?id=40780940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40780940",
    "commentBody": "",
    "originSummary": [
      "« Un ingénieur logiciel chevronné avec 13 ans d'expérience envisage de quitter l'industrie en raison de l'épuisement professionnel et de l'insatisfaction vis-à-vis des rôles traditionnels. »",
      "Actuellement en contrat et explorant l'entrepreneuriat, l'individu est incertain quant à son avenir si son entreprise échoue et envisage un passage à la vente de technologies pour son potentiel de gain.",
      "« Le post met en lumière un sentiment commun parmi les ingénieurs expérimentés concernant la fatigue de l'industrie et la recherche de carrières plus épanouissantes ou lucratives. »"
    ],
    "commentSummary": [
      "Après 13 ans dans l'ingénierie logicielle, l'auteur se détourne des emplois traditionnels de programmation de 9h à 17h pour explorer l'entrepreneuriat et le travail en tant que contractuel.",
      "L'auteur a de l'expérience en tant que manager en ingénierie et ingénieur senior/principal, mais est désillusionné par les dynamiques de l'industrie et recherche des rôles qui tirent parti de ses forces en matière de relations humaines et de stratégie.",
      "L'auteur envisage de se lancer dans la vente au sein d'une entreprise technologique et cherche des conseils ou des témoignages de personnes ayant effectué des transitions similaires."
    ],
    "points": 165,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1719264031
  }
]
