[
  {
    "id": 40825033,
    "title": "القصة، كما أتذكرها بأفضل شكل، عن أصل موزاييك ونتسكيب [فيديو]",
    "originLink": "https://pmarca.substack.com/p/the-true-story-as-best-i-can-remember",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825033",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "فيديو يناقش أصول موزاييك ونتسكيب أثار سلسلة مناقشات في منتدى حيث يشارك المستخدمون تجاربهم وتصحيحات تاريخية.",
      "يوضح قائد مشروع سابق لفريق متصفح Spyglass أن Spyglass Mosaic تم تطويره من الصفر، دون استخدام كود Mosaic المرخص.",
      "تتضمن السلسلة ذكريات حنينية عن تجارب الإنترنت المبكرة، بما في ذلك استخدام موزايك، نيتسكيب، وتقنيات الويب المبكرة الأخرى."
    ],
    "points": 310,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1719607147
  },
  {
    "id": 40828493,
    "title": "Imhex: محرر هيكس لمهندسي العكس",
    "originLink": "https://github.com/WerWolv/ImHex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828493",
    "commentBody": "",
    "originSummary": [
      "ImHex هو محرر سداسي غني بالميزات مصمم لمهندسي العكس والمبرمجين والمستخدمين الذين يعملون لساعات متأخرة، ويقدم واجهة حديثة ووظائف واسعة النطاق.",
      "تشمل الميزات الرئيسية لغة نمط مخصصة تشبه C++، ومفكك تجميع مدمج، ومحلل بيانات، ودعم قواعد YARA، مما يجعله أداة متعددة الاستخدامات لمهام معالجة البيانات المختلفة.",
      "يدعم الأداة أنظمة تشغيل متعددة (ويندوز، ماك أو إس، لينكس) وتتطلب موارد مادية قليلة، مع توفر الشيفرة المصدرية والوثائق للتخصيص والمساهمة بشكل أكبر."
    ],
    "commentSummary": [
      "ImHex هو محرر سداسي مفضل لدى مهندسي العكس بسبب قوالب الملفات الخاصة به، وتفسير أنواع البيانات، وأدائه مع الملفات الكبيرة.",
      "إنه مجاني ومفتوح المصدر، وغالبًا ما يُقارن بـ 010 Editor، على الرغم من أن بعض المستخدمين يفضلون بدائل أبسط مثل Hex Fiend أو HxD.",
      "على الرغم من بعض الأخطاء في واجهة المستخدم الرسومية الخاصة بـ imgui ومشاكل التثبيت، فإن ImHex يُقدَّر لقدراته، مع مناقشات تبرز ضرورة OpenGL لتقديم الرسومات على الأجهزة الحديثة."
    ],
    "points": 286,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1719645949
  },
  {
    "id": 40829607,
    "title": "مجموعة من النصائح البرمجية التي كنت سأقدمها لنفسي قبل 15 عامًا",
    "originLink": "https://mbuffett.com/posts/programming-advice-younger-self/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829607",
    "commentBody": "",
    "originSummary": [
      "حل المشكلات المتكررة من خلال معالجة الأسباب الجذرية، مثل ضمان تحديثات واجهة المستخدم في تطوير iOS تحدث على الخيط الرئيسي لتجنب الأعطال.",
      "وازن بين الجودة والسرعة بناءً على البيئة؛ أعطِ الأولوية للسرعة في البيئات الأقل أهمية والدقة في السيناريوهات ذات المخاطر العالية.",
      "حسّن أدواتك من خلال إتقان استخدام المحرر ونظام التشغيل والشل وأدوات تطوير المتصفح لزيادة الإنتاجية بشكل كبير."
    ],
    "commentSummary": [
      "تشمل النصائح الأساسية للمبرمجين عدم أخذ العمل بشكل شخصي، وفهم السياق التجاري، والتركيز على حل المشكلات بدلاً من التركيز فقط على القضايا التقنية.",
      "التركيز على النصائح العملية مثل تبسيط الكود، إعطاء الأولوية لسرعة المطور، والموازنة بين الشحن السريع والحفاظ على جودة الكود.",
      "التشجيع على تعلم البرمجة الوظيفية، وفهم الآلات الحاسوبية، واتخاذ قرارات مستنيرة حول متى يجب بناء الحلول ومتى يجب شراؤها."
    ],
    "points": 284,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719661081
  },
  {
    "id": 40828203,
    "title": "كيفية إهدار عرض النطاق الترددي، طاقة البطارية، وإزعاج مسؤولي النظام",
    "originLink": "https://rachelbythebay.com/w/2024/06/28/fxios/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828203",
    "commentBody": "",
    "originSummary": [
      "تتناول المقالة عدم الكفاءة في متصفحات الويب، مع التركيز بشكل خاص على كيفية قيام متصفح فايرفوكس لنظام iOS بطلب الروابط نفسها بشكل متكرر وطلب الأيقونات المفضلة بشكل غير صحيح، مما يؤدي إلى استخدام غير ضروري للنطاق الترددي والبطارية.",
      "هذا السلوك يسبب ضغطًا على الخوادم ويمكن أن يكون مزعجًا بشكل خاص لمسؤولي النظام الذين يديرون هذه الخوادم.",
      "يوضح المثال المقدم طلبات متعددة متطابقة وطلب فافيكون غير صحيح، مما يوضح المشكلة وتأثيرها على موارد الخادم."
    ],
    "commentSummary": [
      "تدور المناقشة حول أداء وسهولة استخدام فايرفوكس على نظامي iOS وأندرويد، مع آراء متباينة حول كفاءته وميزاته.",
      "تشمل النقاط الرئيسية القيود التي يفرضها نظام iOS على المتصفحات لاستخدام WebKit، والسماح الأخير لمحركات المتصفحات التابعة لجهات خارجية في الاتحاد الأوروبي منذ إصدار iOS 17.4.",
      "يبرز المستخدمون مشكلات مثل الأداء البطيء والأخطاء وأهمية الإضافات التي تحجب الإعلانات مثل uBlock Origin، والتي تعزز بشكل كبير تجربة التصفح على الأجهزة المحمولة."
    ],
    "points": 253,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719641270
  },
  {
    "id": 40830005,
    "title": "تحليل البايت كود: فك شفرة ثغرات الأمان في لغة Lua الخاصة بلعبة Factorio",
    "originLink": "https://memorycorruption.net/posts/rce-lua-factorio/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40830005",
    "commentBody": "",
    "originSummary": [
      "ثغرة في تنفيذ Lua في لعبة Factorio سمحت للخوادم الضارة بتنفيذ تعليمات برمجية عشوائية على العملاء، وتم تصحيحها في الإصدارات التي تقل عن 1.1.101.",
      "Lua في لعبة Factorio، التي تعتبر أساسية لمنطق اللعبة والإضافات، معرضة لمخاطر الشبكة بسبب وضع اللعب الجماعي المتزامن الحتمي.",
      "يتضمن مسار الاستغلال استضافة خادم يحتوي على كود Lua ضار، مما يؤدي إلى تسرب الذاكرة وتنفيذ التعليمات البرمجية عن بُعد من خلال التلاعب بشيفرة Lua البايتية."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول مخاطر الأمان لتنفيذ شيفرة بايت Lua في لعبة Factorio، مشددة على الحاجة إلى توثيق أفضل وإنشاء بيئة معزولة.",
      "قام فريق Factorio بتعطيل تحميل البايت كود وتقييد مكتبة التصحيح بسبب مخاوف أمنية، مع اقتراحات لإضافة خيار \"وضع الأمان المخفض\" للمستخدمين المتقدمين.",
      "يوصي المشاركون باتخاذ تدابير أمنية متنوعة، مثل استخدام العزل الافتراضي (VM isolation)، وتجنب استخدام البايت كود في الأنظمة غير المدمجة، وضمان التحقق من البايت كود، على غرار بيئات Java و .NET."
    ],
    "points": 226,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719664551
  },
  {
    "id": 40826236,
    "title": "مرثية لـ DevOps",
    "originLink": "https://matduggan.com/a-eulogy-for-devops/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826236",
    "commentBody": "",
    "originSummary": [
      "أدى DevOps، الذي كان يعد في البداية بتبسيط تطوير البرمجيات والعمليات، في كثير من الأحيان إلى مخاطر مركزية وتأخيرات بسبب تحديات التواصل والتنسيق.",
      "كان التحول نحو DevOps يهدف إلى تقليل الاعتماد على الموظفين الفنيين المتخصصين وتسهيل التغييرات في اللحظات الأخيرة، لكنه أدى إلى أنظمة معقدة ومكلفة، على الرغم من إدخال الحاويات وحلول SaaS مثل Datadog.",
      "تتجه الصناعة الآن نحو هندسة المنصات وتبسيط سير العمل، مبتعدة عن التقنيات المعقدة مثل Kubernetes للتركيز على البساطة والاستقرار وتوقعات النمو الواقعية."
    ],
    "commentSummary": [
      "تتناول المقالة التراجع الملحوظ في مجال DevOps، مشيرة إلى أن الأهداف الأولية المتعلقة بالسرعة والكفاءة غالبًا ما أدت إلى ممارسات فوضوية وغير مستدامة.",
      "إنه يؤكد على التحول نحو التكامل المستمر/النشر المستمر (CI/CD) والتطوير القائم على الجذع، والذي يهدف إلى تبسيط عملية النشر وتقليل المخاطر.",
      "تعكس المحادثة الأدوار المتطورة داخل فرق التكنولوجيا، مثل مهندسي موثوقية الموقع (SREs) ومهندسي المنصات، مما يشير إلى الابتعاد عن الأدوار التقليدية في DevOps."
    ],
    "points": 212,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719615545
  },
  {
    "id": 40825146,
    "title": "يخرج 'Eclipse Theia IDE' مفتوح المصدر من النسخة التجريبية لمنافسة Visual Studio Code",
    "originLink": "https://visualstudiomagazine.com/Articles/2024/06/27/eclipse-theia-ide.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825146",
    "commentBody": "",
    "originSummary": [
      "أصبح IDE Theia من مؤسسة Eclipse، بعد سبع سنوات من التطوير، متاحًا الآن بشكل عام، مما يضع نفسه كـ \"بديل مفتوح المصدر حقيقي\" لبرنامج Visual Studio Code (VS Code) من مايكروسوفت.",
      "تشارك Theia الكثير من تكنولوجيا VS Code، بما في ذلك محرر Monaco، وبروتوكول خادم اللغة (LSP)، وبروتوكول محول التصحيح (DAP)، وتدعم نفس الإضافات عبر سجل Open VSX.",
      "تؤكد Theia على المرونة والخصوصية ومجتمع مفتوح المصدر حيوي، مع مساهمات من شركات كبرى مثل إريكسون وIBM وجوجل، وتسمح بتخصيص واسع دون الحاجة إلى تشعب الكود، مما يجعلها مناسبة لكل من بيئات التطوير المتكاملة على سطح المكتب والسحابة."
    ],
    "commentSummary": [
      "خرجت بيئة التطوير المتكاملة مفتوحة المصدر 'Eclipse Theia IDE' من مرحلة البيتا، مما يضعها كمنافس لبرنامج Visual Studio Code (VS Code).",
      "يسلط المستخدمون الضوء على قابلية التمديد ودعم متصفح الويب في Theia، مقارنين ذلك بالمخاوف بشأن سيطرة مايكروسوفت وقابلية التمديد المحدودة في VS Code.",
      "تهدف Theia إلى تقديم إطار عمل بيئة تطوير متكاملة (IDE) قابل للتخصيص، مما يوفر بديلاً مفتوح المصدر مع فوائد محتملة مقارنة بواجهة برمجة التطبيقات الأكثر تقييدًا في VS Code."
    ],
    "points": 192,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1719607763
  },
  {
    "id": 40826683,
    "title": "XAES-256-GCM AEAD ذو العدد الموسع",
    "originLink": "https://words.filippo.io/dispatches/xaes-256-gcm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826683",
    "commentBody": "",
    "originSummary": [
      "XAES-256-GCM هو خوارزمية جديدة للتشفير المصدق مع البيانات المرتبطة (AEAD) بمفاتيح بطول 256 بت و nonces بطول 192 بت، مصممة للسلامة والامتثال لمعيار FIPS 140 وسهولة التنفيذ.",
      "إنها بنية موسعة للرقم العشوائي تعتمد على AES-256-GCM، تتطلب ثلاث استدعاءات لـ AES-256 لكل رسالة، مع إمكانية حساب واحدة منها مسبقًا، وتدعمها المكتبات التشفيرية الشائعة وواجهة برمجة تطبيقات OpenSSL.",
      "تتوفر تطبيقات الطرف الثالث لـ .NET 8+، pyca/cryptography، وواجهة برمجة تطبيقات التشفير على الويب، مع أن التنفيذ المرجعي بلغة Go يكون أقل من 100 سطر باستخدام المكتبات القياسية."
    ],
    "commentSummary": [
      "يعد XAES-256-GCM AEAD (التشفير المصدق مع البيانات المرتبطة) ذو الرقم الموسع تصميمًا تشفيريًا جديدًا يعزز إدارة الأرقام والمفاتيح لـ AES-GCM، مما يعالج مشكلات إعادة استخدام الأرقام.",
      "يستخدم هذا التصميم AES-CBC (تسلسل الكتل المشفرة) لاشتقاق المفاتيح ويستخدم نونس بحجم 192 بت، مما يحسن الأمان عن طريق منع تصادمات النونس، والتي تكون كارثية في AES-GCM القياسي.",
      "التنفيذ متاح حاليًا في مكتبة C2SP المرجعية، ولكنه لم يتوفر بعد في مكتبة Go القياسية، مما يبرز التطوير المستمر والاهتمام في مجتمع التشفير."
    ],
    "points": 163,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1719619284
  },
  {
    "id": 40828441,
    "title": "كل محتوى الويب مجاني",
    "originLink": "https://rubenerd.com/all-web-content-is-freeware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828441",
    "commentBody": "",
    "originSummary": [
      "صرح سليمان، الرئيس التنفيذي للذكاء الاصطناعي في مايكروسوفت، في مقابلة مع CNBC، أن محتوى الويب يعتبر استخدامًا عادلاً منذ التسعينيات، مشبهًا إياه بالبرمجيات المجانية، مما يثير تساؤلات قانونية.",
      "ناقشت المقابلة النموذج المالي غير المستدام للذكاء الاصطناعي وإدراك الجمهور للمحتوى الذي يتم إنشاؤه بواسطة الذكاء الاصطناعي على أنه ذو جودة منخفضة.",
      "يجادل بائعو الذكاء الاصطناعي التوليدي بأن مخرجاتهم مشروعة، ولكن على عكس محركات البحث، لا ترتبط الدردشة الآلية بمصادرها، مما يجعل مخرجاتها غير موثوقة ويشير إلى احتمال وجود فقاعة في الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "يُعتبر محتوى الويب عمومًا محميًا بحقوق الطبع والنشر ما لم يُذكر صراحةً أنه ضمن الملكية العامة، مما يجعل الادعاء بأن جميع محتويات الويب مجانية قانونيًا مشكوكًا فيه.",
      "يُشجَّع مؤلفو الشيفرات مفتوحة المصدر على إضافة قيود لمنع استخدام شيفراتهم في تدريب الذكاء الاصطناعي، مما قد يتيح اتخاذ إجراءات قانونية ضد شركات مثل مايكروسوفت لاستخدامها غير المصرح به.",
      "هناك نقاش مستمر حول كيفية تقاطع تدريب الذكاء الاصطناعي مع قوانين حقوق الطبع والنشر، حيث يجادل البعض بأن الممارسات الحالية تندرج تحت استثناءات الاستخدام العادل وأن التنظيم يجب أن يوازن بين الحماية والابتكار."
    ],
    "points": 151,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1719644985
  },
  {
    "id": 40827650,
    "title": "لص الهواتف العمومية الذي حير مكتب التحقيقات الفيدرالي في الثمانينيات",
    "originLink": "https://www.mentalfloss.com/posts/pay-phone-bandit-baffled-fbi",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827650",
    "commentBody": "",
    "originSummary": [
      "في الثمانينيات، جيمس كلارك، المعروف بلقب \"لص الهواتف العمومية\"، سرق ما يصل إلى مليون دولار من العملات المعدنية من الهواتف العمومية عبر 30 ولاية باستخدام أدوات قفل مخصصة.",
      "على الرغم من الجهود المكثفة التي بذلها مكتب التحقيقات الفيدرالي، تمكن كلارك من الهروب من القبض عليه حتى عام 1985 عندما أبلغ مخبر السلطات، مما أدى إلى اعتقاله في عام 1988 وحكم عليه بالسجن لمدة ثلاث سنوات.",
      "تضمنت طريقة كلارك الفريدة التحقق مما إذا كانت صناديق العملات ممتلئة وفتح الأقفال بينما يتظاهر باستخدام الهاتف، مما يترك أدلة قليلة على السرقة."
    ],
    "commentSummary": [
      "لص الهواتف العمومية من الثمانينيات، الذي أفلت من مكتب التحقيقات الفيدرالي، تم القبض عليه في النهاية بسبب ظهوره في برنامج \"أكثر المطلوبين في أمريكا\" وعادته في دفع تكاليف غرف الفنادق بلفائف من العملات المعدنية.",
      "تسلط القصة الضوء على التحديات المتعلقة بالتعامل مع كميات كبيرة من العملات المسروقة وتقترح أن اللص كان يمكنه غسل الأموال عن طريق فتح مغسلة أو صالة ألعاب فيديو.",
      "القضية هي نظرة حنينية إلى زمن كانت فيه الهواتف العمومية شائعة، كما أنها تتناول الابتكار والمخاطر المتضمنة في مثل هذه الجرائم."
    ],
    "points": 140,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719631182
  },
  {
    "id": 40828610,
    "title": "ليس الأمر مقتصرًا عليك فقط، فـ Next.js أصبح أكثر صعوبة في الاستخدام",
    "originLink": "https://www.propelauth.com/post/nextjs-challenges",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828610",
    "commentBody": "",
    "originSummary": [
      "يتطلب موجه التطبيقات الجديد في Next.js معرفة داخلية عميقة للمهام الأساسية ويحتوي على العديد من الفخاخ التي يجب تجنبها، مما يجعله أصعب في الاستخدام مقارنة بسابقه، موجه الصفحات.",
      "قدمت النسخة 13 التالية ميزات مثل مكونات الخادم والتخطيطات والتخزين المؤقت المتقدم، والتي تفيد التطبيقات المعقدة ولكنها تضيف تعقيدًا وسلوكيات غير متوقعة للمشاريع الأبسط.",
      "يجب على المطورين أن يأخذوا في الاعتبار ما إذا كانت تعقيدات App Router تتماشى مع احتياجات مشروعهم، حيث قد تكون الأدوات الأبسط أكثر ملاءمة لبعض حالات الاستخدام، على الرغم من أن Next.js توصي باستخدام App Router."
    ],
    "commentSummary": [
      "يواجه Next.js انتقادات بسبب بيئة تطوير صعبة، وتخزين مؤقت غير مستقر، وقيود في نظام التوجيه القائم على الملفات.",
      "يبلغ المطورون عن مشكلات في دمج حالة العميل والخادم، وإعدادات المصادقة المعقدة، وموجه التطبيقات الجديد البطيء والمكثف للذاكرة.",
      "يفكر الكثيرون في بدائل مثل Remix و SvelteKit أو Vue/Nuxt بسبب هذه التحديات، مع التحول نحو التصيير من جانب الخادم ومكونات React Server التي تضيف تعقيدًا دون فوائد واضحة."
    ],
    "points": 133,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1719648056
  },
  {
    "id": 40829312,
    "title": "كيف تغلبت على إدماني للسكر",
    "originLink": "https://josem.co/how-i-overcame-my-addiction-to-sugar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829312",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف رحلة شخصية للتغلب على إدمان السكر الذي بدأ في الطفولة واستمر حتى مرحلة البلوغ.",
      "ثلاث استراتيجيات رئيسية كانت حاسمة: تغيير البيئة، إزالة الأطعمة السكرية من المنزل، واعتماد عادات إيجابية مثل ممارسة التمارين الرياضية بانتظام والترطيب.",
      "يهدف المنشور إلى إلهام الآخرين الذين يعانون من إدمان السكر من خلال إظهار أن التغلب عليه ممكن باستخدام النهج الصحيح."
    ],
    "commentSummary": [
      "تغلب المؤلف على إدمانه للسكر عن طريق الحفاظ على مطبخه مليئًا بالصودا الدايت، واللحوم، والجبن، والزبادي، وزبدة الفول السوداني، وتجنب الحلويات.",
      "يقترحون على محبي الشوكولاتة اختيار شوكولاتة بنسبة 90% أو 95% لمنع الإفراط في تناول الطعام.",
      "شارك آخرون استراتيجيات مشابهة، مثل إبقاء الحلويات بعيدًا عن الأنظار، التحول إلى وجبات خفيفة أكثر صحة، وإجراء تخفيضات تدريجية في تناول السكر، حيث وجد البعض النجاح من خلال حميات الكيتو، الصيام، أو استبدال الأطعمة السكرية بالفواكه."
    ],
    "points": 116,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719658324
  },
  {
    "id": 40829653,
    "title": "أوراق بنما: المحكمة تبرئ جميع الـ 28 المتهمين بغسل الأموال",
    "originLink": "https://www.bbc.com/news/articles/cjer3llen42o",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829653",
    "commentBody": "",
    "originSummary": [
      "برأت محكمة بنمية جميع الأفراد الثمانية والعشرين المتهمين بغسل الأموال في فضيحة أوراق بنما، مشيرة إلى عدم كفاية الأدلة لإثبات المسؤولية الجنائية.",
      "من بين الذين تمت تبرئتهم يورغن موساك والراحل رامون فونسيكا، مؤسسا شركة المحاماة موساك فونسيكا، التي كانت محورية في تسريب عام 2016 الذي كشف عن استخدام الأثرياء للملاذات الضريبية.",
      "تم رفض المحاكمة، التي استمرت 85 ساعة وشملت شهادة 27 شاهدًا، جزئيًا لأن الأدلة من خوادم موساك فونسيكا لم تُجمع بشكل صحيح."
    ],
    "commentSummary": [
      "قام قاضٍ بنمي بإسقاط تهم غسل الأموال ضد 28 فردًا مرتبطين بتسريب أوراق بنما، لكن هذا القرار يخص بنما فقط.",
      "النظام القانوني في بنما أكثر ملاءمة لمثل هذه المخططات، على عكس البلدان الأخرى حيث تستمر الملاحقات القضائية، بما في ذلك القضايا الناجحة في الولايات المتحدة.",
      "أدى تسريب أوراق بنما إلى اتخاذ إجراءات عالمية كبيرة، بما في ذلك إغلاق شركة موساك فونسيكا وإجراء تحقيقات واستردادات دولية متنوعة."
    ],
    "points": 106,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1719661444
  },
  {
    "id": 40828180,
    "title": "مسارات آمنة. بيانات الاضطرابات في الوقت الفعلي، تنبؤات التعلم الآلي باستخدام جهاز iPad",
    "originLink": "https://skypath.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828180",
    "commentBody": "",
    "originSummary": [
      "تقدم SkyPath تطبيقًا للتنبؤ بالاضطرابات الجوية في الوقت الفعلي باستخدام البيانات وتقارير الطيارين (PIREP) والتعلم الآلي لتعزيز سلامة وكفاءة الرحلات الجوية.",
      "تشمل الفوائد الإخطارات المبكرة عن الاضطرابات الجوية، والسجلات الدقيقة للصيانة، وتوفير الوقود، وتقليل التكاليف في التأمين والصيانة.",
      "يشيد الطيارون بالتطبيق لدقته وسهولة استخدامه، حيث لا يتطلب أي جهود تكامل—فقط قم بتنزيله وابدأ في استخدامه."
    ],
    "commentSummary": [
      "تقدم SkyPath بيانات الاضطرابات الجوية في الوقت الفعلي وتوقعات التعلم الآلي (ML) عبر iPad، باستخدام مقاييس التسارع وAWS لمعالجة البيانات.",
      "يجد الطيارون التطبيق مفيدًا، وهناك اهتمام متزايد بدمجه مع المزيد من شركات الطيران، مثل دلتا.",
      "التطبيق، الذي يمكنه العمل في الخلفية باستخدام الإنترنت عبر الأقمار الصناعية، يتحسن من خلال ملاحظات الطيارين وارتباط البيانات، مما يعزز سلامة وكفاءة الطيران."
    ],
    "points": 101,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1719640562
  },
  {
    "id": 40827586,
    "title": "OpenLoco: نسخة حديثة ومفتوحة المصدر من لعبة محاكاة النقل الكلاسيكية",
    "originLink": "https://openloco.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827586",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenLoco هو نسخة حديثة ومفتوحة المصدر من لعبة محاكاة النقل الكلاسيكية، Locomotion، التي تجذب عشاق الألعاب القديمة والبسيطة.",
      "تسلط المناقشات الضوء على المقارنات مع ألعاب محاكاة النقل الأخرى مثل OpenTTD، مشيرة إلى الفروقات في التعقيد وواجهة المستخدم وتجربة المستخدم وآليات اللعبة.",
      "يحتفظ OpenLoco بالملف الثنائي الأصلي بشكل كبير، مما يثير تساؤلات حول استخدامه لمكتبات 64 بت والميكانيكيات الحديثة."
    ],
    "points": 94,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719630309
  }
]
