[
  {
    "id": 40825033,
    "title": "जहां तक मुझे याद है, मोज़ेक और नेटस्केप की उत्पत्ति की कहानी [वीडियो]",
    "originLink": "https://pmarca.substack.com/p/the-true-story-as-best-i-can-remember",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825033",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "मोज़ेक और नेटस्केप की उत्पत्ति पर चर्चा करने वाला एक वीडियो एक फोरम थ्रेड को प्रेरित कर रहा है, जहां उपयोगकर्ता अपने अनुभव और ऐतिहासिक सुधार साझा कर रहे हैं।",
      "स्पाईग्लास ब्राउज़र टीम के एक पूर्व प्रोजेक्ट लीड ने स्पष्ट किया कि स्पाईग्लास मोज़ेक को लाइसेंस प्राप्त मोज़ेक कोड का उपयोग किए बिना, पूरी तरह से नए सिरे से विकसित किया गया था।",
      "इस धागे में शुरुआती इंटरनेट अनुभवों की पुरानी यादें शामिल हैं, जिनमें मोज़ेक, नेटस्केप और अन्य शुरुआती वेब तकनीकों का उपयोग शामिल है।"
    ],
    "points": 310,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1719607147
  },
  {
    "id": 40828493,
    "title": "इमहेक्स: रिवर्स इंजीनियर्स के लिए एक हेक्स संपादक",
    "originLink": "https://github.com/WerWolv/ImHex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828493",
    "commentBody": "",
    "originSummary": [
      "ImHex एक विशेषताओं से भरपूर हेक्स संपादक है जिसे रिवर्स इंजीनियर्स, प्रोग्रामर्स और देर रात तक काम करने वाले उपयोगकर्ताओं के लिए डिज़ाइन किया गया है, जो एक आधुनिक इंटरफ़ेस और व्यापक कार्यक्षमता प्रदान करता है।",
      "मुख्य विशेषताओं में एक कस्टम C++ जैसी पैटर्न भाषा, एकीकृत डिसअसेंबलर, डेटा विश्लेषक, और YARA नियम समर्थन शामिल हैं, जो इसे विभिन्न डेटा हेरफेर कार्यों के लिए एक बहुमुखी उपकरण बनाते हैं।",
      "यह उपकरण कई ऑपरेटिंग सिस्टम (विंडोज, मैकओएस, लिनक्स) का समर्थन करता है और न्यूनतम हार्डवेयर संसाधनों की आवश्यकता होती है, जिसमें स्रोत कोड और दस्तावेज़ीकरण आगे की अनुकूलन और योगदान के लिए उपलब्ध हैं।"
    ],
    "commentSummary": [
      "ImHex एक हेक्स एडिटर है जिसे रिवर्स इंजीनियर्स द्वारा इसके फाइल टेम्पलेट्स, डेटा प्रकार की व्याख्या, और बड़े फाइलों के साथ प्रदर्शन के लिए पसंद किया जाता है।",
      "यह मुफ्त, ओपन-सोर्स है, और अक्सर 010 एडिटर से तुलना की जाती है, हालांकि कुछ उपयोगकर्ता सरल विकल्प जैसे Hex Fiend या HxD को पसंद करते हैं।",
      "इसके imgui UI और इंस्टॉलेशन समस्याओं में कुछ बग्स के बावजूद, ImHex अपनी क्षमताओं के लिए मूल्यवान है, जिसमें चर्चाएं आधुनिक हार्डवेयर रेंडरिंग के लिए OpenGL की आवश्यकता को उजागर करती हैं।"
    ],
    "points": 286,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1719645949
  },
  {
    "id": 40829607,
    "title": "15 साल पहले के अपने आप को मैं जो प्रोग्रामिंग सलाह दूंगा",
    "originLink": "https://mbuffett.com/posts/programming-advice-younger-self/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829607",
    "commentBody": "",
    "originSummary": [
      "मूल कारणों को संबोधित करके आवर्ती समस्याओं को ठीक करें, जैसे कि iOS विकास में UI अपडेट को मुख्य थ्रेड पर सुनिश्चित करना ताकि क्रैश से बचा जा सके।",
      "पर्यावरण के आधार पर गुणवत्ता और गति का संतुलन बनाए रखें; कम महत्वपूर्ण सेटिंग्स में गति को प्राथमिकता दें और उच्च-जोखिम वाले परिदृश्यों में शुद्धता को प्राथमिकता दें।",
      "अपने संपादक, ऑपरेटिंग सिस्टम, शेल, और ब्राउज़र डेवलपर टूल्स में निपुण होकर अपने उपकरणों को तेज करें ताकि उत्पादकता में महत्वपूर्ण वृद्धि हो सके।"
    ],
    "commentSummary": [
      "प्रोग्रामरों के लिए मुख्य सलाह में काम को व्यक्तिगत रूप से न लेना, व्यापारिक संदर्भ को समझना, और केवल तकनीकी मुद्दों पर नहीं बल्कि समस्या-समाधान पर ध्यान केंद्रित करना शामिल है।",
      "कोड को सरल बनाने, डेवलपर की गति को प्राथमिकता देने, और तेजी से शिपिंग और कोड की गुणवत्ता बनाए रखने के बीच संतुलन बनाने जैसे व्यावहारिक सुझावों पर जोर।",
      "कार्यात्मक प्रोग्रामिंग सीखने के लिए प्रोत्साहन, राज्य मशीनों को समझना, और समाधान बनाने बनाम खरीदने के समय सूचित निर्णय लेना।"
    ],
    "points": 284,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719661081
  },
  {
    "id": 40828203,
    "title": "बैंडविड्थ, बैटरी पावर बर्बाद करने और सिस्टम एडमिन्स को परेशान करने के तरीके",
    "originLink": "https://rachelbythebay.com/w/2024/06/28/fxios/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828203",
    "commentBody": "",
    "originSummary": [
      "यह पोस्ट वेब ब्राउज़रों में अक्षमताओं पर चर्चा करती है, विशेष रूप से यह बताती है कि iOS के लिए Firefox बार-बार एक ही लिंक का अनुरोध करता है और गलत तरीके से फेविकॉन्स का अनुरोध करता है, जिससे अनावश्यक बैंडविड्थ और बैटरी का उपयोग होता है।",
      "यह व्यवहार सर्वरों पर दबाव डालता है और उन सिस्टम प्रशासकों के लिए विशेष रूप से कष्टप्रद हो सकता है जो इन सर्वरों का प्रबंधन करते हैं।",
      "दिए गए उदाहरण में कई समान अनुरोध और एक गलत फेविकॉन अनुरोध दिखाया गया है, जो समस्या और इसके सर्वर संसाधनों पर प्रभाव को दर्शाता है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु iOS और Android पर Firefox के प्रदर्शन और उपयोगिता के इर्द-गिर्द घूमता है, जिसमें इसकी दक्षता और विशेषताओं पर मिश्रित रायें हैं।",
      "मुख्य बिंदुओं में iOS द्वारा ब्राउज़रों को WebKit का उपयोग करने की आवश्यकता के कारण लगाई गई सीमाएँ शामिल हैं, और iOS 17.4 से यूरोपीय संघ में तृतीय-पक्ष ब्राउज़र इंजनों की हालिया अनुमति शामिल है।",
      "उपयोगकर्ता धीमे प्रदर्शन, बग्स, और uBlock Origin जैसे विज्ञापन-ब्लॉकिंग प्लगइन्स के महत्व को उजागर करते हैं, जो मोबाइल उपकरणों पर ब्राउज़िंग अनुभव को महत्वपूर्ण रूप से बेहतर बनाते हैं।"
    ],
    "points": 253,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719641270
  },
  {
    "id": 40830005,
    "title": "बाइटकोड ब्रेकडाउन: फैक्टोरियो के लुआ सुरक्षा खामियों का विश्लेषण",
    "originLink": "https://memorycorruption.net/posts/rce-lua-factorio/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40830005",
    "commentBody": "",
    "originSummary": [
      "Factorio के Lua कार्यान्वयन में एक कमजोरी ने दुर्भावनापूर्ण सर्वरों को क्लाइंट्स पर मनमाना कोड निष्पादित करने की अनुमति दी, जिसे संस्करण 1.1.101 से नीचे के संस्करणों में पैच किया गया।",
      "फैक्टोरियो का लुआ, जो गेम लॉजिक और मोड्स के लिए महत्वपूर्ण है, अपने निर्धारक लॉकस्टेप मल्टीप्लेयर मोड के कारण नेटवर्क जोखिमों के प्रति संवेदनशील है।",
      "शोषण पथ में दुर्भावनापूर्ण Lua कोड के साथ एक सर्वर होस्ट करना शामिल है, जो मेमोरी लीक और Lua बाइटकोड हेरफेर के माध्यम से रिमोट कोड निष्पादन की ओर ले जाता है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र गेम फैक्टोरियो में लुआ बाइटकोड को निष्पादित करने के सुरक्षा जोखिमों पर है, जिसमें बेहतर दस्तावेजीकरण और सैंडबॉक्सिंग की आवश्यकता पर जोर दिया गया है।",
      "सुरक्षा चिंताओं के कारण Factorio ने बाइटकोड लोडिंग को अक्षम कर दिया है और डिबग लाइब्रेरी को प्रतिबंधित कर दिया है, और उन्नत उपयोगकर्ताओं के लिए 'कम सुरक्षा मोड' टॉगल के सुझाव दिए हैं।",
      "प्रतिभागियों ने विभिन्न सुरक्षा उपायों की सिफारिश की, जैसे कि VM आइसोलेशन का उपयोग करना, गैर-एम्बेडेड सिस्टम में बाइटकोड से बचना, और बाइटकोड सत्यापन सुनिश्चित करना, जो कि जावा और .NET वातावरण के समान है।"
    ],
    "points": 226,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719664551
  },
  {
    "id": 40826236,
    "title": "देवऑप्स के लिए एक श्रद्धांजलि",
    "originLink": "https://matduggan.com/a-eulogy-for-devops/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826236",
    "commentBody": "",
    "originSummary": [
      "देवऑप्स, जो प्रारंभ में सॉफ्टवेयर विकास और संचालन को सरल बनाने का वादा करता था, अक्सर संचार और समन्वय चुनौतियों के कारण केंद्रीकृत जोखिम और देरी का कारण बनता था।",
      "DevOps की ओर बदलाव का उद्देश्य विशेष तकनीकी कर्मचारियों पर निर्भरता को कम करना और अंतिम समय में बदलावों को सुगम बनाना था, लेकिन कंटेनरों और Datadog जैसी SaaS समाधानों के परिचय के बावजूद, यह जटिल और महंगे सिस्टमों का परिणाम बना।",
      "उद्योग अब प्लेटफॉर्म इंजीनियरिंग और सरल वर्कफ्लो की ओर मुड़ रहा है, जटिल तकनीकों जैसे क्यूबर्नेट्स से दूर होकर सादगी, स्थिरता और यथार्थवादी विकास अपेक्षाओं पर ध्यान केंद्रित कर रहा है।"
    ],
    "commentSummary": [
      "पोस्ट में DevOps के कथित पतन पर चर्चा की गई है, जिसमें यह बताया गया है कि गति और दक्षता के प्रारंभिक लक्ष्यों ने अक्सर अराजक और अस्थिर प्रथाओं को जन्म दिया।",
      "यह निरंतर एकीकरण/निरंतर परिनियोजन (CI/CD) और ट्रंक-आधारित विकास की ओर बदलाव पर जोर देता है, जिसका उद्देश्य परिनियोजन प्रक्रिया को सरल बनाना और जोखिमों को कम करना है।",
      "यह बातचीत तकनीकी टीमों के भीतर बदलती भूमिकाओं पर विचार करती है, जैसे कि साइट रिलायबिलिटी इंजीनियर्स (SREs) और प्लेटफॉर्म इंजीनियर्स, जो पारंपरिक देवऑप्स भूमिकाओं से दूर जाने का संकेत देती है।"
    ],
    "points": 212,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719615545
  },
  {
    "id": 40825146,
    "title": "ओपन सोर्स 'Eclipse Theia IDE' बीटा से बाहर आकर Visual Studio Code को चुनौती देने के लिए तैयार",
    "originLink": "https://visualstudiomagazine.com/Articles/2024/06/27/eclipse-theia-ide.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825146",
    "commentBody": "",
    "originSummary": [
      "सात वर्षों के विकास के बाद, एक्लिप्स फाउंडेशन का थिया आईडीई अब सामान्य रूप से उपलब्ध है, और इसे माइक्रोसॉफ्ट के विजुअल स्टूडियो कोड (वीएस कोड) के लिए एक 'सच्चे ओपन-सोर्स विकल्प' के रूप में प्रस्तुत किया जा रहा है।",
      "थिया वीएस कोड की तकनीक का बहुत हिस्सा साझा करता है, जिसमें मोनाको संपादक, भाषा सर्वर प्रोटोकॉल (एलएसपी), और डिबग एडेप्टर प्रोटोकॉल (डीएपी) शामिल हैं, और ओपन वीएसएक्स रजिस्ट्री के माध्यम से समान एक्सटेंशन का समर्थन करता है।",
      "थिया लचीलापन, गोपनीयता, और एक जीवंत ओपन-सोर्स समुदाय पर जोर देती है, जिसमें एरिक्सन, आईबीएम, और गूगल जैसी प्रमुख कंपनियों का योगदान शामिल है, और कोड को फोर्क किए बिना व्यापक अनुकूलन की अनुमति देती है, जो डेस्कटॉप और क्लाउड आईडीई दोनों के लिए उपयुक्त है।"
    ],
    "commentSummary": [
      "ओपन सोर्स 'Eclipse Theia IDE' ने बीटा चरण से बाहर निकलकर खुद को विजुअल स्टूडियो कोड (VS Code) के प्रतिस्पर्धी के रूप में स्थापित किया है।",
      "उपयोगकर्ता Theia की विस्तारशीलता और वेब ब्राउज़र समर्थन को उजागर करते हैं, इसे Microsoft के नियंत्रण और VS Code में सीमित विस्तारशीलता के बारे में चिंताओं के साथ तुलना करते हैं।",
      "Theia का उद्देश्य एक अनुकूलन योग्य आईडीई फ्रेमवर्क प्रदान करना है, जो वीएस कोड के अधिक प्रतिबंधात्मक एपीआई के मुकाबले एक ओपन-सोर्स विकल्प के साथ संभावित लाभ प्रदान करता है।"
    ],
    "points": 192,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1719607763
  },
  {
    "id": 40826683,
    "title": "XAES-256-GCM विस्तारित-नॉन्स AEAD",
    "originLink": "https://words.filippo.io/dispatches/xaes-256-gcm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826683",
    "commentBody": "",
    "originSummary": [
      "XAES-256-GCM एक नया AEAD (प्रमाणित एन्क्रिप्शन विद एसोसिएटेड डेटा) एल्गोरिदम है जिसमें 256-बिट कीज और 192-बिट नॉन्स होते हैं, जिसे सुरक्षा, FIPS 140 अनुपालन, और आसान कार्यान्वयन के लिए डिज़ाइन किया गया है।",
      "यह AES-256-GCM के ऊपर एक विस्तारित-नॉन्स निर्माण है, जिसमें प्रत्येक संदेश के लिए तीन AES-256 कॉल की आवश्यकता होती है, जिसमें से एक पूर्वगणनीय है, और यह सामान्य क्रिप्टोग्राफिक लाइब्रेरी और OpenSSL API द्वारा समर्थित है।",
      "तृतीय-पक्ष कार्यान्वयन .NET 8+, pyca/cryptography, और वेब क्रिप्टोग्राफी API के लिए उपलब्ध हैं, जिसमें Go संदर्भ कार्यान्वयन मानक पुस्तकालयों का उपयोग करते हुए 100 पंक्तियों से कम है।"
    ],
    "commentSummary": [
      "XAES-256-GCM विस्तारित-नॉन्स AEAD (संबद्ध डेटा के साथ प्रमाणीकृत एन्क्रिप्शन) एक नया क्रिप्टोग्राफिक डिज़ाइन है जो AES-GCM के लिए नॉन्स और कुंजी प्रबंधन को बढ़ाता है, नॉन्स पुन: उपयोग के मुद्दों को संबोधित करता है।",
      "यह डिज़ाइन AES-CBC (साइफर ब्लॉक चेनिंग) का उपयोग करके कुंजियों को उत्पन्न करता है और 192-बिट नॉन्स का उपयोग करता है, जिससे नॉन्स टकराव को रोककर सुरक्षा में सुधार होता है, जो मानक AES-GCM में विनाशकारी होते हैं।",
      "यह कार्यान्वयन वर्तमान में C2SP संदर्भ पुस्तकालय में उपलब्ध है, लेकिन अभी तक Go मानक पुस्तकालय में नहीं है, जो क्रिप्टोग्राफिक समुदाय में चल रहे विकास और रुचि को दर्शाता है।"
    ],
    "points": 163,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1719619284
  },
  {
    "id": 40828441,
    "title": "सभी वेब \"सामग्री\" मुफ्त सॉफ्टवेयर है",
    "originLink": "https://rubenerd.com/all-web-content-is-freeware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828441",
    "commentBody": "",
    "originSummary": [
      "माइक्रोसॉफ्ट के एआई के सीईओ, सुलेमान, ने एक सीएनबीसी साक्षात्कार में दावा किया कि वेब सामग्री को 90 के दशक से निष्पक्ष उपयोग माना गया है, इसे फ्रीवेयर के समान बताते हुए, जिससे कानूनी प्रश्न उठते हैं।",
      "साक्षात्कार में एआई के अस्थिर वित्तीय मॉडल और एआई-जनित सामग्री को निम्न गुणवत्ता के रूप में जनता की धारणा पर चर्चा की गई।",
      "जनरेटिव एआई विक्रेता तर्क देते हैं कि उनके आउटपुट उचित हैं, लेकिन सर्च इंजन के विपरीत, चैटबॉट्स अपने स्रोतों से लिंक नहीं करते हैं, जिससे उनके आउटपुट अविश्वसनीय हो जाते हैं और संभावित एआई बुलबुले का संकेत देते हैं।"
    ],
    "commentSummary": [
      "वेब सामग्री को आमतौर पर कॉपीराइटेड माना जाता है जब तक कि इसे स्पष्ट रूप से सार्वजनिक डोमेन के रूप में घोषित नहीं किया गया हो, जिससे यह दावा कि सभी वेब सामग्री फ्रीवेयर है, कानूनी रूप से संदिग्ध हो जाता है।",
      "ओपन-सोर्स कोड के लेखकों को प्रोत्साहित किया जाता है कि वे अपने कोड में प्रतिबंध जोड़ें ताकि उनके कोड का उपयोग एआई को प्रशिक्षित करने के लिए न किया जा सके, जिससे माइक्रोसॉफ्ट जैसी कंपनियों के खिलाफ अनधिकृत उपयोग के लिए कानूनी कार्रवाई की जा सके।",
      "कॉपिराइट कानूनों के साथ एआई प्रशिक्षण के संबंध में चल रही बहस है, जिसमें कुछ लोग तर्क देते हैं कि वर्तमान प्रथाएं निष्पक्ष उपयोग छूट के अंतर्गत आती हैं और यह कि विनियमन को सुरक्षा और नवाचार के बीच संतुलन बनाना चाहिए।"
    ],
    "points": 151,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1719644985
  },
  {
    "id": 40827650,
    "title": "80 के दशक में एफबीआई को चकित करने वाला 'पे फोन बैंडिट'",
    "originLink": "https://www.mentalfloss.com/posts/pay-phone-bandit-baffled-fbi",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827650",
    "commentBody": "",
    "originSummary": [
      "1980 के दशक में, जेम्स क्लार्क, जिन्हें \"पे फोन बैंडिट\" के नाम से जाना जाता है, ने कस्टम लॉकस्मिथ उपकरणों का उपयोग करके 30 राज्यों में पे फोनों से $1 मिलियन तक की राशि चुरा ली थी।",
      "विस्तृत एफबीआई प्रयासों के बावजूद, क्लार्क 1985 तक गिरफ्तारी से बचता रहा जब एक मुखबिर ने अधिकारियों को सूचना दी, जिससे 1988 में उसकी गिरफ्तारी और तीन साल की सजा हुई।",
      "क्लार्क की अनूठी विधि में यह जांचना शामिल था कि क्या सिक्कों के बॉक्स भरे हुए हैं और फोन का उपयोग करने का नाटक करते हुए ताले खोलना, जिससे चोरी के बहुत कम सबूत छूटते थे।"
    ],
    "commentSummary": [
      "1980 के दशक का 'पे फोन बैंडिट', जो FBI से बचता रहा, अंततः पकड़ा गया क्योंकि वह अमेरिका के मोस्ट वांटेड शो में दिखाई दिया और होटल के कमरों का भुगतान क्वार्टर के रोल्स से करता था।",
      "कहानी बड़े पैमाने पर चोरी किए गए सिक्कों से निपटने की चुनौतियों को उजागर करती है और सुझाव देती है कि डाकू ने पैसे को एक लॉन्ड्रोमैट या वीडियो आर्केड खोलकर सफेद किया हो सकता है।",
      "यह मामला एक नॉस्टैल्जिक नजरिया है उस समय की ओर जब पे फोन आम थे, और यह उन अपराधों में शामिल चतुराई और जोखिमों पर भी प्रकाश डालता है।"
    ],
    "points": 140,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719631182
  },
  {
    "id": 40828610,
    "title": "यह केवल आप ही नहीं हैं, Next.js का उपयोग करना कठिन होता जा रहा है",
    "originLink": "https://www.propelauth.com/post/nextjs-challenges",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828610",
    "commentBody": "",
    "originSummary": [
      "Next.js का नया ऐप राउटर बुनियादी कार्यों के लिए गहन आंतरिक ज्ञान की आवश्यकता करता है और इसमें कई ऑप्ट-आउट समस्याएं हैं, जिससे इसका उपयोग इसके पूर्ववर्ती, पेज राउटर की तुलना में कठिन हो जाता है।",
      "नेक्स्ट 13 रिलीज़ ने सर्वर कंपोनेंट्स, लेआउट्स और उन्नत कैशिंग जैसी विशेषताएं पेश कीं, जो जटिल अनुप्रयोगों के लिए लाभकारी हैं लेकिन सरल परियोजनाओं के लिए जटिलता और अप्रत्याशित व्यवहार जोड़ती हैं।",
      "डेवलपर्स को यह विचार करना चाहिए कि क्या ऐप राउटर की जटिलता उनके प्रोजेक्ट की आवश्यकताओं के अनुरूप है, क्योंकि कुछ उपयोग मामलों के लिए सरल उपकरण अधिक उपयुक्त हो सकते हैं, भले ही Next.js ऐप राउटर की सिफारिश करता है।"
    ],
    "commentSummary": [
      "Next.js को कठिन विकास वातावरण, अस्थिर कैशिंग, और इसकी फाइल-आधारित राउटर में सीमाओं के लिए आलोचना का सामना करना पड़ रहा है।",
      "डेवलपर्स क्लाइंट और सर्वर स्टेट को मिलाने, जटिल प्रमाणीकरण सेटअप, और धीमे, मेमोरी-गहन नए ऐप राउटर के साथ समस्याओं की रिपोर्ट करते हैं।",
      "इन चुनौतियों के कारण कई लोग विकल्पों पर विचार कर रहे हैं जैसे कि Remix, SvelteKit, या Vue/Nuxt, क्योंकि सर्वर-साइड रेंडरिंग और React सर्वर कंपोनेंट्स की ओर बदलाव से जटिलता बढ़ रही है बिना स्पष्ट लाभ के।"
    ],
    "points": 133,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1719648056
  },
  {
    "id": 40829312,
    "title": "मैंने अपनी चीनी की लत को कैसे दूर किया",
    "originLink": "https://josem.co/how-i-overcame-my-addiction-to-sugar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829312",
    "commentBody": "",
    "originSummary": [
      "लेखक अपने बचपन में शुरू हुई और वयस्कता तक बनी रही चीनी की लत को पार करने की व्यक्तिगत यात्रा साझा करते हैं।",
      "तीन प्रमुख रणनीतियाँ महत्वपूर्ण थीं: पर्यावरण को बदलना, घर से मीठे खाद्य पदार्थों को हटाना, और नियमित व्यायाम और जलयोजन जैसी सकारात्मक आदतों को अपनाना।",
      "यह पोस्ट उन लोगों को प्रेरित करने का उद्देश्य रखती है जो शुगर की लत से जूझ रहे हैं, यह दिखाकर कि सही दृष्टिकोण के साथ इसे पार करना संभव है।"
    ],
    "commentSummary": [
      "लेखक ने अपने रसोईघर में डाइट सोडा, मांस, पनीर, दही, और मूंगफली का मक्खन रखकर और मिठाइयों से बचकर अपनी चीनी की लत पर काबू पाया।",
      "वे चॉकलेट प्रेमियों को 90% या 95% चॉकलेट चुनने की सलाह देते हैं ताकि अधिक खाने से बचा जा सके।",
      "अन्य लोगों ने भी इसी तरह की रणनीतियाँ साझा कीं, जैसे कि मिठाइयों को दृष्टि से दूर रखना, स्वस्थ स्नैक्स में बदलना, और चीनी की खपत में धीरे-धीरे कमी करना। कुछ ने कीटो डाइट, उपवास, या शर्करायुक्त खाद्य पदार्थों को फलों से बदलने के माध्यम से सफलता पाई।"
    ],
    "points": 116,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719658324
  },
  {
    "id": 40829653,
    "title": "पनामा पेपर्स: अदालत ने मनी लॉन्ड्रिंग के आरोप में सभी 28 आरोपियों को बरी किया",
    "originLink": "https://www.bbc.com/news/articles/cjer3llen42o",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829653",
    "commentBody": "",
    "originSummary": [
      "पनामा की एक अदालत ने पनामा पेपर्स घोटाले में मनी लॉन्ड्रिंग के आरोप में सभी 28 व्यक्तियों को बरी कर दिया है, यह कहते हुए कि आपराधिक जिम्मेदारी साबित करने के लिए पर्याप्त सबूत नहीं हैं।",
      "जिन्हें बरी किया गया उनमें जर्गेन मोसैक और दिवंगत रेमन फोन्सेका शामिल थे, जो कानून फर्म मोसैक फोन्सेका के संस्थापक थे, जो 2016 के लीक में केंद्रीय भूमिका में थी, जिसने अमीरों द्वारा टैक्स हेवन के उपयोग को उजागर किया था।",
      "मुकदमा, जो 85 घंटे तक चला और जिसमें 27 गवाहों की गवाही शामिल थी, आंशिक रूप से इस कारण से खारिज कर दिया गया क्योंकि मोसैक फोन्सेका के सर्वरों से साक्ष्य सही तरीके से एकत्र नहीं किए गए थे।"
    ],
    "commentSummary": [
      "एक पनामा के न्यायाधीश ने पनामा पेपर्स लीक से जुड़े 28 व्यक्तियों के खिलाफ मनी लॉन्ड्रिंग के आरोपों को खारिज कर दिया, लेकिन यह निर्णय केवल पनामा के लिए विशिष्ट है।",
      "पनामा में कानूनी प्रणाली ऐसे योजनाओं के लिए अधिक अनुकूल है, जबकि अन्य देशों में अभियोजन जारी है, जिसमें अमेरिका में सफल मामले भी शामिल हैं।",
      "पनामा पेपर्स लीक ने महत्वपूर्ण वैश्विक कार्रवाइयों को जन्म दिया, जिसमें मोसैक फोन्सेका का बंद होना और विभिन्न अंतरराष्ट्रीय जांच और वसूली शामिल हैं।"
    ],
    "points": 106,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1719661444
  },
  {
    "id": 40828180,
    "title": "सुरक्षित मार्ग। वास्तविक समय में अशांति डेटा, आईपैड के साथ एमएल भविष्यवाणियां",
    "originLink": "https://skypath.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828180",
    "commentBody": "",
    "originSummary": [
      "स्काईपाथ एक वास्तविक समय में अशांति की भविष्यवाणी करने वाला ऐप प्रदान करता है जो डेटा, पायरेप (पायलट रिपोर्ट) और मशीन लर्निंग का उपयोग करके उड़ान सुरक्षा और दक्षता को बढ़ाता है।",
      "लाभों में प्रारंभिक अशांति सूचनाएं, सटीक रखरखाव रिकॉर्ड, ईंधन की बचत, और बीमा और रखरखाव में लागत में कमी शामिल हैं।",
      "इस ऐप की सटीकता और उपयोग में आसानी के लिए पायलटों द्वारा प्रशंसा की जाती है, इसे किसी एकीकरण प्रयास की आवश्यकता नहीं होती—बस डाउनलोड करें और उपयोग करना शुरू करें।"
    ],
    "commentSummary": [
      "स्काईपाथ वास्तविक समय में अशांति डेटा और मशीन लर्निंग (एमएल) भविष्यवाणियाँ आईपैड के माध्यम से प्रदान करता है, जिसमें एक्सेलेरोमीटर और डेटा प्रोसेसिंग के लिए एडब्ल्यूएस का उपयोग किया जाता है।",
      "पायलटों को यह ऐप लाभकारी लगता है, और इसे डेल्टा जैसी अधिक एयरलाइनों के साथ एकीकृत करने में बढ़ती रुचि है।",
      "यह ऐप, जो सैटेलाइट इंटरनेट का उपयोग करके पृष्ठभूमि में चल सकता है, पायलट की प्रतिक्रिया और डेटा संबंध के साथ सुधार करता है, जिससे उड़ान की सुरक्षा और दक्षता में वृद्धि होती है।"
    ],
    "points": 101,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1719640562
  },
  {
    "id": 40827586,
    "title": "ओपनलोको: क्लासिक परिवहन सिमुलेशन गेम का आधुनिक, ओपन सोर्स संस्करण",
    "originLink": "https://openloco.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827586",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ओपनलोको एक आधुनिक, ओपन-सोर्स संस्करण है जो क्लासिक परिवहन सिमुलेशन गेम, लोकोमोशन का है, और यह सरल, पुराने खेलों के प्रशंसकों को आकर्षित करता है।",
      "चर्चाओं में OpenTTD जैसे अन्य परिवहन सिमुलेशन खेलों के साथ तुलना पर प्रकाश डाला गया है, जिसमें जटिलता, UI/UX, और खेल यांत्रिकी में अंतर शामिल हैं।",
      "OpenLoco मूल बाइनरी को भारी रूप से बनाए रखता है, जो इसके 64-बिट लाइब्रेरी और आधुनिक यांत्रिकी के उपयोग के बारे में सवाल उठाता है।"
    ],
    "points": 94,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719630309
  }
]
