[
  {
    "id": 40825033,
    "title": "Kisah, sejauh yang bisa saya ingat, tentang asal-usul Mosaic dan Netscape [video]",
    "originLink": "https://pmarca.substack.com/p/the-true-story-as-best-i-can-remember",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825033",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Klip video yang membahas asal-usul Mosaic dan Netscape telah memicu sebuah utas forum di mana pengguna berbagi pengalaman dan koreksi sejarah.",
      "Seorang mantan Pemimpin Proyek untuk tim peramban Spyglass menjelaskan bahwa Spyglass Mosaic dikembangkan dari awal, tidak menggunakan kode Mosaic yang dilisensikan.",
      "Thread tersebut menampilkan kenangan nostalgia tentang pengalaman awal internet, termasuk penggunaan Mosaic, Netscape, dan teknologi web awal lainnya."
    ],
    "points": 310,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1719607147
  },
  {
    "id": 40828493,
    "title": "Imhex: Sebuah editor heksadesimal untuk insinyur balik",
    "originLink": "https://github.com/WerWolv/ImHex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828493",
    "commentBody": "",
    "originSummary": [
      "ImHex adalah editor hex yang kaya fitur yang dirancang untuk insinyur balik, pemrogram, dan pengguna yang bekerja hingga larut malam, menawarkan antarmuka modern dan fungsionalitas yang luas.",
      "Fitur utama termasuk bahasa pola mirip C++ yang disesuaikan, disassembler terintegrasi, penganalisis data, dan dukungan aturan YARA, menjadikannya alat serbaguna untuk berbagai tugas manipulasi data.",
      "Alat ini mendukung berbagai sistem operasi (Windows, macOS, Linux) dan memerlukan sumber daya perangkat keras yang minimal, dengan kode sumber dan dokumentasi yang tersedia untuk kustomisasi dan kontribusi lebih lanjut."
    ],
    "commentSummary": [
      "ImHex adalah editor hex yang disukai oleh para reverse engineer karena template filenya, interpretasi tipe data, dan kinerjanya dengan file berukuran besar.",
      "Itu gratis, sumber terbuka, dan sering dibandingkan dengan 010 Editor, meskipun beberapa pengguna lebih memilih alternatif yang lebih sederhana seperti Hex Fiend atau HxD.",
      "Meskipun terdapat beberapa bug dalam antarmuka imgui dan masalah instalasi, ImHex dihargai karena kemampuannya, dengan diskusi yang menyoroti pentingnya OpenGL untuk rendering perangkat keras modern."
    ],
    "points": 286,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1719645949
  },
  {
    "id": 40829607,
    "title": "Sejumlah nasihat pemrograman yang akan saya berikan kepada diri saya sendiri 15 tahun yang lalu",
    "originLink": "https://mbuffett.com/posts/programming-advice-younger-self/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829607",
    "commentBody": "",
    "originSummary": [
      "Perbaiki masalah yang berulang dengan mengatasi penyebab utamanya, seperti memastikan pembaruan UI dalam pengembangan iOS terjadi di thread utama untuk menghindari crash.",
      "Keseimbangkan kualitas dan kecepatan berdasarkan lingkungan; prioritaskan kecepatan dalam situasi yang kurang kritis dan ketepatan dalam skenario berisiko tinggi.",
      "Pertajam alat Anda dengan menjadi mahir menggunakan editor, OS, shell, dan alat pengembang browser untuk secara signifikan meningkatkan produktivitas."
    ],
    "commentSummary": [
      "Nasihat utama untuk para pemrogram termasuk tidak mengambil pekerjaan secara pribadi, memahami konteks bisnis, dan fokus pada pemecahan masalah daripada hanya masalah teknis.",
      "Penekanan pada tips praktis seperti menyederhanakan kode, memprioritaskan kecepatan pengembang, dan menyeimbangkan antara pengiriman cepat dan menjaga kualitas kode.",
      "Ajakan untuk mempelajari pemrograman fungsional, memahami mesin status, dan membuat keputusan yang tepat tentang kapan harus membangun versus membeli solusi."
    ],
    "points": 284,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719661081
  },
  {
    "id": 40828203,
    "title": "Bagaimana cara membuang bandwidth, daya baterai, dan mengganggu sysadmin",
    "originLink": "https://rachelbythebay.com/w/2024/06/28/fxios/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828203",
    "commentBody": "",
    "originSummary": [
      "Postingan tersebut membahas ketidakefisienan dalam peramban web, khususnya menyoroti bagaimana Firefox untuk iOS berulang kali meminta tautan yang sama dan secara tidak benar meminta favicon, yang mengakibatkan penggunaan bandwidth dan baterai yang tidak perlu.",
      "Perilaku ini menyebabkan beban pada server dan bisa sangat mengganggu bagi administrator sistem yang mengelola server tersebut.",
      "Contoh yang diberikan menunjukkan beberapa permintaan identik dan permintaan favicon yang salah, menggambarkan masalah dan dampaknya pada sumber daya server."
    ],
    "commentSummary": [
      "Kajian ini berpusat pada kinerja dan kegunaan Firefox di iOS dan Android, dengan pendapat yang beragam mengenai efisiensi dan fiturnya.",
      "Kunci poin termasuk batasan yang diberlakukan oleh iOS yang mengharuskan browser menggunakan WebKit, dan izin terbaru untuk mesin browser pihak ketiga di UE sejak iOS 17.4.",
      "Pengguna menyoroti masalah seperti kinerja yang lambat, bug, dan pentingnya plugin pemblokir iklan seperti uBlock Origin, yang secara signifikan meningkatkan pengalaman menjelajah di perangkat mobile."
    ],
    "points": 253,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1719641270
  },
  {
    "id": 40830005,
    "title": "Bytecode Breakdown: Mengurai Kelemahan Keamanan Lua di Factorio",
    "originLink": "https://memorycorruption.net/posts/rce-lua-factorio/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40830005",
    "commentBody": "",
    "originSummary": [
      "Kelemahan dalam implementasi Lua di Factorio memungkinkan server berbahaya untuk mengeksekusi kode sembarang pada klien, yang telah diperbaiki pada versi di bawah 1.1.101.",
      "Lua di Factorio, yang penting untuk logika permainan dan mod, terpapar risiko jaringan karena mode multipemain lockstep deterministiknya.",
      "Jalur eksploitasi melibatkan hosting server dengan kode Lua berbahaya, yang mengarah pada kebocoran memori dan eksekusi kode jarak jauh melalui manipulasi bytecode Lua."
    ],
    "commentSummary": [
      "Kajian ini berfokus pada risiko keamanan dalam menjalankan bytecode Lua di dalam permainan Factorio, menyoroti kebutuhan akan dokumentasi yang lebih baik dan sandboxing.",
      "Factorio telah menonaktifkan pemuatan bytecode dan membatasi perpustakaan debug karena masalah keamanan, dengan saran untuk tombol \"Mode Keamanan Terbatas\" bagi pengguna tingkat lanjut.",
      "Peserta merekomendasikan berbagai langkah keamanan, seperti menggunakan isolasi VM, menghindari bytecode dalam sistem non-tertanam, dan memastikan verifikasi bytecode, mirip dengan lingkungan Java dan .NET."
    ],
    "points": 226,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1719664551
  },
  {
    "id": 40826236,
    "title": "Kata Pengantar untuk DevOps",
    "originLink": "https://matduggan.com/a-eulogy-for-devops/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826236",
    "commentBody": "",
    "originSummary": [
      "DevOps, yang awalnya menjanjikan untuk merampingkan pengembangan dan operasi perangkat lunak, sering kali menyebabkan risiko terpusat dan penundaan karena tantangan komunikasi dan koordinasi.",
      "Peralihan menuju DevOps bertujuan untuk mengurangi ketergantungan pada staf teknis yang khusus dan memfasilitasi perubahan di menit-menit terakhir, tetapi hal ini menghasilkan sistem yang kompleks dan mahal, meskipun telah diperkenalkan kontainer dan solusi SaaS seperti Datadog.",
      "Industri sekarang beralih ke Rekayasa Platform dan alur kerja yang lebih sederhana, menjauh dari teknologi kompleks seperti Kubernetes untuk fokus pada kesederhanaan, stabilitas, dan harapan pertumbuhan yang realistis."
    ],
    "commentSummary": [
      "Kirimannya membahas penurunan yang dirasakan dari DevOps, menyoroti bagaimana tujuan awal kecepatan dan efisiensi sering kali mengarah pada praktik yang kacau dan tidak berkelanjutan.",
      "Ini menekankan pergeseran menuju Integrasi Berkelanjutan/Distribusi Berkelanjutan (CI/CD) dan pengembangan berbasis trunk, yang bertujuan untuk memperlancar proses distribusi dan mengurangi risiko.",
      "Percakapan tersebut mencerminkan peran yang berkembang dalam tim teknologi, seperti Site Reliability Engineers (SRE) dan insinyur platform, yang menunjukkan pergeseran dari peran DevOps tradisional."
    ],
    "points": 212,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1719615545
  },
  {
    "id": 40825146,
    "title": "IDE 'Eclipse Theia' sumber terbuka keluar dari versi beta untuk menantang Visual Studio Code",
    "originLink": "https://visualstudiomagazine.com/Articles/2024/06/27/eclipse-theia-ide.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40825146",
    "commentBody": "",
    "originSummary": [
      "Kini, setelah tujuh tahun pengembangan, Theia IDE dari Eclipse Foundation telah tersedia secara umum, memposisikan dirinya sebagai 'alternatif sumber terbuka sejati' untuk Visual Studio Code (VS Code) dari Microsoft.",
      "Theia berbagi banyak teknologi dengan VS Code, termasuk editor Monaco, Protokol Server Bahasa (LSP), dan Protokol Adapter Debug (DAP), serta mendukung ekstensi yang sama melalui Open VSX Registry.",
      "Theia menekankan fleksibilitas, privasi, dan komunitas open-source yang dinamis, dengan kontribusi dari perusahaan besar seperti Ericsson, IBM, dan Google, serta memungkinkan kustomisasi yang luas tanpa perlu mem-fork kode, cocok untuk IDE desktop dan cloud."
    ],
    "commentSummary": [
      "IDE 'Eclipse Theia' open source telah keluar dari versi beta, memposisikan dirinya sebagai pesaing Visual Studio Code (VS Code).",
      "Pengguna menyoroti ekstensibilitas dan dukungan peramban web Theia, membandingkannya dengan kekhawatiran atas kontrol Microsoft dan keterbatasan ekstensibilitas di VS Code.",
      "Theia bertujuan untuk menawarkan kerangka kerja IDE yang dapat disesuaikan, menyediakan alternatif sumber terbuka dengan potensi manfaat dibandingkan API yang lebih terbatas dari VS Code."
    ],
    "points": 192,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1719607763
  },
  {
    "id": 40826683,
    "title": "XAES-256-GCM AEAD dengan nonce diperpanjang",
    "originLink": "https://words.filippo.io/dispatches/xaes-256-gcm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40826683",
    "commentBody": "",
    "originSummary": [
      "XAES-256-GCM adalah algoritma AEAD (Authenticated Encryption with Associated Data) baru dengan kunci 256-bit dan nonce 192-bit, yang dirancang untuk keamanan, kepatuhan FIPS 140, dan kemudahan implementasi.",
      "Itu adalah konstruksi nonce yang diperpanjang di atas AES-256-GCM, membutuhkan tiga panggilan AES-256 per pesan, dengan satu yang dapat dihitung sebelumnya, dan didukung oleh perpustakaan kriptografi umum dan API OpenSSL.",
      "Implementasi pihak ketiga tersedia untuk .NET 8+, pyca/cryptography, dan Web Cryptography API, dengan implementasi referensi Go kurang dari 100 baris menggunakan pustaka standar."
    ],
    "commentSummary": [
      "XAES-256-GCM extended-nonce AEAD (Authenticated Encryption with Associated Data) adalah desain kriptografi baru yang meningkatkan manajemen nonce dan kunci untuk AES-GCM, mengatasi masalah penggunaan ulang nonce.",
      "Tata letak ini menggunakan AES-CBC (Cipher Block Chaining) untuk menghasilkan kunci dan menggunakan nonce 192-bit, meningkatkan keamanan dengan mencegah tabrakan nonce, yang sangat berbahaya dalam AES-GCM standar.",
      "Implementasi saat ini tersedia di perpustakaan referensi C2SP, tetapi belum ada di perpustakaan standar Go, menyoroti perkembangan dan minat yang sedang berlangsung dalam komunitas kriptografi."
    ],
    "points": 163,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1719619284
  },
  {
    "id": 40828441,
    "title": "Semua \"konten\" web adalah freeware",
    "originLink": "https://rubenerd.com/all-web-content-is-freeware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828441",
    "commentBody": "",
    "originSummary": [
      "CEO AI Microsoft, Suleyman, dalam sebuah wawancara dengan CNBC, mengklaim bahwa konten web telah dianggap sebagai penggunaan wajar sejak tahun 90-an, menyamakannya dengan perangkat lunak gratis, yang menimbulkan pertanyaan hukum.",
      "Interview tersebut membahas model keuangan AI yang tidak berkelanjutan dan persepsi publik terhadap konten yang dihasilkan AI sebagai berkualitas rendah.",
      "Vendor AI generatif berargumen bahwa keluaran mereka adalah permainan yang adil, tetapi tidak seperti mesin pencari, chatbot tidak menautkan ke sumber mereka, membuat keluaran mereka tidak dapat diandalkan dan menunjukkan potensi gelembung AI."
    ],
    "commentSummary": [
      "Konten web umumnya dianggap memiliki hak cipta kecuali secara eksplisit dinyatakan sebagai domain publik, sehingga klaim bahwa semua konten web adalah freeware secara hukum meragukan.",
      "Penulis kode sumber terbuka didorong untuk menambahkan pembatasan agar kode mereka tidak digunakan untuk melatih AI, yang berpotensi memungkinkan tindakan hukum terhadap perusahaan seperti Microsoft atas penggunaan yang tidak sah.",
      "Ada perdebatan yang sedang berlangsung tentang bagaimana pelatihan AI berinteraksi dengan undang-undang hak cipta, dengan beberapa pihak berpendapat bahwa praktik saat ini termasuk dalam pengecualian penggunaan wajar dan bahwa regulasi harus menyeimbangkan perlindungan dengan inovasi."
    ],
    "points": 151,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1719644985
  },
  {
    "id": 40827650,
    "title": "Bandit telepon umum' yang membingungkan FBI di tahun '80-an",
    "originLink": "https://www.mentalfloss.com/posts/pay-phone-bandit-baffled-fbi",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827650",
    "commentBody": "",
    "originSummary": [
      "Dalam tahun 1980-an, James Clark, yang dikenal sebagai \"Pay Phone Bandit,\" mencuri hingga $1 juta dalam bentuk koin dari telepon umum di 30 negara bagian menggunakan alat kunci khusus.",
      "Meskipun upaya ekstensif FBI, Clark berhasil menghindari penangkapan hingga tahun 1985 ketika seorang informan memberi tahu pihak berwenang, yang mengarah pada penangkapannya pada tahun 1988 dan hukuman tiga tahun penjara.",
      "Metode unik Clark melibatkan memeriksa apakah kotak koin penuh dan membuka kunci sambil berpura-pura menggunakan telepon, meninggalkan bukti minimal pencurian."
    ],
    "commentSummary": [
      "Bandit telepon umum dari tahun 1980-an, yang berhasil menghindari FBI, akhirnya tertangkap karena penampilannya di America's Most Wanted dan kebiasaannya membayar kamar hotel dengan gulungan koin perempat.",
      "Kisah ini menyoroti tantangan dalam menangani sejumlah besar koin yang dicuri dan menyarankan bahwa bandit tersebut bisa saja mencuci uang dengan membuka tempat cuci pakaian atau arcade video.",
      "Kisah ini adalah pandangan nostalgis ke masa ketika telepon umum masih umum, dan juga menyentuh tentang kecerdikan dan risiko yang terlibat dalam kejahatan semacam itu."
    ],
    "points": 140,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1719631182
  },
  {
    "id": 40828610,
    "title": "Ini bukan hanya Anda, Next.js semakin sulit digunakan",
    "originLink": "https://www.propelauth.com/post/nextjs-challenges",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828610",
    "commentBody": "",
    "originSummary": [
      "App Router baru dari Next.js memerlukan pengetahuan internal yang mendalam untuk tugas-tugas dasar dan memiliki banyak jebakan opt-out, membuatnya lebih sulit digunakan dibandingkan pendahulunya, Pages Router.",
      "Rilis Next 13 memperkenalkan fitur-fitur seperti Komponen Server, Tata Letak, dan caching yang canggih, yang menguntungkan aplikasi kompleks tetapi menambah kompleksitas dan perilaku tak terduga untuk proyek yang lebih sederhana.",
      "Pengembang harus mempertimbangkan apakah kompleksitas App Router sesuai dengan kebutuhan proyek mereka, karena alat yang lebih sederhana mungkin lebih cocok untuk kasus penggunaan tertentu, meskipun Next.js merekomendasikan App Router."
    ],
    "commentSummary": [
      "Next.js menghadapi kritik karena lingkungan pengembangan yang sulit, caching yang tidak stabil, dan keterbatasan dalam router berbasis file-nya.",
      "Pengembang melaporkan masalah dengan menggabungkan status klien dan server, pengaturan otentikasi yang kompleks, dan router aplikasi baru yang lambat serta memakan banyak memori.",
      "Banyak yang mempertimbangkan alternatif seperti Remix, SvelteKit, atau Vue/Nuxt karena tantangan ini, dengan pergeseran menuju rendering sisi server dan Komponen Server React menambah kompleksitas tanpa manfaat yang jelas."
    ],
    "points": 133,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1719648056
  },
  {
    "id": 40829312,
    "title": "Bagaimana Saya Mengatasi Kecanduan Gula",
    "originLink": "https://josem.co/how-i-overcame-my-addiction-to-sugar/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829312",
    "commentBody": "",
    "originSummary": [
      "Penulis berbagi perjalanan pribadi dalam mengatasi kecanduan gula yang dimulai sejak masa kanak-kanak dan berlanjut hingga dewasa.",
      "Kunci dari tiga strategi utama adalah: mengubah lingkungan, menghilangkan makanan manis dari rumah, dan mengadopsi kebiasaan positif seperti berolahraga secara teratur dan menjaga hidrasi.",
      "Kirimannya bertujuan untuk menginspirasi orang lain yang berjuang melawan kecanduan gula dengan menunjukkan bahwa mengatasinya dapat dicapai dengan pendekatan yang tepat."
    ],
    "commentSummary": [
      "Penulis mengatasi kecanduan gula mereka dengan menjaga dapur mereka penuh dengan soda diet, daging, keju, yogurt, dan selai kacang, serta menghindari camilan.",
      "Mereka menyarankan para pecinta cokelat untuk memilih cokelat dengan kandungan 90% atau 95% untuk mencegah makan berlebihan.",
      "Orang lain berbagi strategi serupa, seperti menyimpan camilan di luar pandangan, beralih ke camilan yang lebih sehat, dan membuat pengurangan gula secara bertahap, dengan beberapa menemukan keberhasilan melalui diet keto, puasa, atau mengganti makanan manis dengan buah-buahan."
    ],
    "points": 116,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1719658324
  },
  {
    "id": 40829653,
    "title": "Panama Papers: Pengadilan membebaskan semua 28 orang yang didakwa dengan pencucian uang",
    "originLink": "https://www.bbc.com/news/articles/cjer3llen42o",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40829653",
    "commentBody": "",
    "originSummary": [
      "Pengadilan Panama telah membebaskan semua 28 individu yang didakwa dengan pencucian uang dalam skandal Panama Papers, dengan alasan kurangnya bukti untuk membuktikan tanggung jawab pidana.",
      "Di antara mereka yang dibebaskan adalah Jurgen Mossack dan almarhum Ramon Fonseca, pendiri firma hukum Mossack Fonseca, yang menjadi pusat kebocoran tahun 2016 yang mengungkap penggunaan surga pajak oleh orang-orang kaya.",
      "Persidangan, yang berlangsung selama 85 jam dan melibatkan kesaksian dari 27 saksi, dibatalkan sebagian karena bukti dari server Mossack Fonseca tidak dikumpulkan dengan benar."
    ],
    "commentSummary": [
      "Kepala hakim Panama membatalkan tuduhan pencucian uang terhadap 28 individu yang terkait dengan kebocoran Panama Papers, tetapi keputusan ini khusus untuk Panama.",
      "System hukum di Panama lebih menguntungkan bagi skema semacam itu, tidak seperti negara-negara lain di mana penuntutan terus berlanjut, termasuk kasus-kasus yang berhasil di AS.",
      "Kebocoran Panama Papers menyebabkan tindakan global yang signifikan, termasuk penutupan Mossack Fonseca dan berbagai penyelidikan serta pemulihan internasional."
    ],
    "points": 106,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1719661444
  },
  {
    "id": 40828180,
    "title": "Rute Aman. data turbulensi waktu nyata, prediksi ML dengan iPad",
    "originLink": "https://skypath.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40828180",
    "commentBody": "",
    "originSummary": [
      "SkyPath menawarkan aplikasi prediksi turbulensi waktu nyata menggunakan data, PIREP (Laporan Pilot), dan pembelajaran mesin untuk meningkatkan keselamatan dan efisiensi penerbangan.",
      "Manfaatnya termasuk pemberitahuan turbulensi dini, catatan pemeliharaan yang akurat, penghematan bahan bakar, dan pengurangan biaya dalam asuransi dan pemeliharaan.",
      "App ini dipuji oleh para pilot karena akurasinya dan kemudahan penggunaannya, tidak memerlukan upaya integrasi—cukup unduh dan mulai gunakan."
    ],
    "commentSummary": [
      "SkyPath menyediakan data turbulensi waktu nyata dan prediksi pembelajaran mesin (ML) melalui iPad, memanfaatkan akselerometer dan AWS untuk pemrosesan data.",
      "Para pilot menemukan aplikasi ini bermanfaat, dan ada minat yang semakin meningkat untuk mengintegrasikannya dengan lebih banyak maskapai, seperti Delta.",
      "Kami aplikasi, yang dapat berjalan di latar belakang menggunakan internet satelit, meningkat dengan umpan balik pilot dan korelasi data, meningkatkan keselamatan dan efisiensi penerbangan."
    ],
    "points": 101,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1719640562
  },
  {
    "id": 40827586,
    "title": "OpenLoco: Versi modern dan sumber terbuka dari permainan simulasi transportasi klasik",
    "originLink": "https://openloco.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40827586",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenLoco adalah versi modern dan sumber terbuka dari permainan simulasi transportasi klasik, Locomotion, yang menarik bagi penggemar permainan yang lebih sederhana dan lama.",
      "Kajian membandingkan dengan permainan simulasi transportasi lainnya seperti OpenTTD, mencatat perbedaan dalam kompleksitas, UI/UX, dan mekanisme permainan.",
      "OpenLoco mempertahankan biner aslinya secara signifikan, yang menimbulkan pertanyaan tentang penggunaannya terhadap pustaka 64-bit dan mekanisme modern."
    ],
    "points": 94,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1719630309
  }
]
