[
  {
    "title": "The Battle for Radio Waves: Ukraine's Defense Against Russian Jamming",
    "originLink": "https://www.nytimes.com/2023/11/19/technology/the-invisible-war-in-ukraine-being-fought-over-radio-waves.html",
    "originBody": "",
    "originSummary": [
      "Russia is jamming the signals of Ukrainian drones as part of the escalating conflict between the two countries.",
      "German company Quantum Systems has developed AI software and manual piloting options to counter this interference.",
      "Electronic warfare has become crucial in modern warfare, with NATO countries expanding their programs, and Ukraine investing in electronic warfare technology to defend against Russian drones and air defense systems."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  },
  {
    "title": "Ukraine Adapts with Advanced Tech in Artillery Race Against Russia",
    "originLink": "https://www.forbes.com/sites/vikrammittal/2023/11/19/new-technologies-could-help-resolve-ukraines-artillery-challenges/",
    "originBody": "",
    "originSummary": [
      "Ukraine is facing challenges in its conflict with Russia, particularly in the field of artillery.",
      "The Russian military has a tactical advantage with advanced technologies like loitering munitions and electronic warfare systems.",
      "Ukraine is adjusting its artillery tactics and integrating similar technologies to counter Russian advancements.",
      "Both sides are continuously developing new technologies, with Ukraine considering the use of artificial intelligence (AI) and computer vision to enhance its artillery capabilities.",
      "By incorporating AI and computer vision, Ukraine could improve target acquisition, accuracy, and autonomy of drones, reducing reliance on GPS and mitigating the impact of Russian electronic warfare.",
      "The conflict has turned into a technological arms race, with both sides striving for an advantage in artillery."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  },
  {
    "title": "Marut Drones Launches Seedcopter 2.0: India's First Corporate Reforestation Drone Service",
    "originLink": "https://indiaeducationdiary.in/marut-drones-launches-seedcopter-2-0-indias-first-reforestation-drone-services-for-corporates-and-csr/",
    "originBody": "",
    "originSummary": [
      "Marut Drones, a leading Indian drone manufacturer, has launched Seedcopter 2.0, the first reforestation drone in the country.",
      "The company aims to offer Seedcopter services to corporations for their CSR activities and reforestation initiatives, addressing the global concern of deforestation.",
      "Marut Drones has successfully planted over one crore trees across multiple states and plans to restore 900 forests through their 'Hara-Bahara' campaign. The drones are capable of seed ball dispersal in challenging terrains, reducing time and labor required for afforestation. The company also prioritizes empowering women and local communities in their reforestation efforts, including aerial surveys, precise seed dispersal, and post-planting monitoring."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  },
  {
    "title": "Promoting Accountability: Five Principles for Ethical Military Use of Armed Drones",
    "originLink": "https://www.e-ir.info/2023/11/18/enhanced-ethics-for-military-users-of-armed-drones/",
    "originBody": "",
    "originSummary": [
      "The use of armed drones in warfare has raised ethical concerns related to violence, indiscriminate methods, moral injury, and lack of human control over weapon systems.",
      "To address these concerns, users of armed drones should follow five extra-legal principles including combined arms, urgent other-defense, operator discretion, human agency, and high transparency.",
      "These principles aim to promote accountability and limit injustices in the use of armed drones by combining drones with other combat assets, using drones to protect individuals, allowing operators to refuse participation in killing, maintaining human control, and publicly disclosing drone use."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  },
  {
    "title": "India Explores Drones for Delivering Medical Supplies in Remote Areas",
    "originLink": "https://www.straitstimes.com/asia/south-asia/india-looks-to-drones-to-deliver-essential-medical-supplies-to-far-flung-areas",
    "originBody": "",
    "originSummary": [
      "The Indian government is exploring the use of drones to deliver essential medical supplies to remote areas.",
      "The country conducted a successful trial where drones transported blood, plasma, platelets, and medicine in challenging terrain.",
      "India aims to become a drone hub by 2030 and plans to conduct additional trials for organ transport and tuberculosis testing."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  },
  {
    "title": "Nigerian Army's First Professor: Lt. Col. Abubakar-Surajo Imam's Promotion to Reflect Contribution and Excellence",
    "originLink": "https://www.thisdaylive.com/index.php/2023/11/18/nigerian-army-gets-first-professor",
    "originBody": "",
    "originSummary": [
      "Lt. Col. Abubakar-Surajo Imam has been promoted to become the Nigerian Army's first professor.",
      "This promotion recognizes Imam's contributions to the Nigerian Defence Academy, where he is the head of the Department of Mechatronics Engineering.",
      "Imam holds degrees in mechanical engineering, mechatronics, and a PhD in mechatronics and robotics."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404844612
  }
]
