[
  {
    "title": "Hashgraph Technology: A Trillion Dollar Opportunity for VCs as Google and IBM Embrace the Revolutionary Alternative to Blockchain",
    "originLink": "https://medium.com/@shayansa/a-trillion-dollar-opportunity-for-vcs-before-google-ibm-eat-the-whole-pie-b8743596f77d",
    "originBody": "A Trillion Dollar Opportunity for VCs: Before Google & IBM eat the whole pie Shayan Salehi · Follow 5 min read · 12 hours ago -- Hashgraph Technology is far more revolutionary than Blockchain ever will be. This truth has silently been recognised by organisations such as Google, IBM, Boeing and 26 other global organisations who sit on the governing council of Hedera Hashgraph, which has just been open sourced last year. These council members are quietly integrating Hashgraph Technology into their business flows without making a lot of noise. Biden Administration wants some of the Hashgraph-magic The White House recently asked Hedera for help regarding open source software security. The Department of Defence, Department of Energy and the National Science Foundation funded a secure file storage system built on Hashgraph (Taekion) Next to that, Hedera affiliated individuals are regulars in Washington D.C. From CFTC hearings to the senate floor, a pattern of deep mutual engagement can be witnessed. All of this is happening in an environment where other companies have to fight the SEC in court or find themselves be labelled as securities. HBAR, the native currency of the Hashgraph network is not classified as a security due to the extreme measures of compliance taken when initially raising funds and the nature of the token itself which is used to pay transaction fees on the network. Fastest, Greenest, Post-Quantum secure… & soon most decentralised Hashgraph can do everything a Blockchain can do, just better. It also does a bunch more things than traditional Blockchain networks. Some see it make Blockchains fully obsolete in the coming years. Goodbye Layer 1, 2, 3, 4….. Hello Layer 0. One main advantage of Hashgraph technology is the fact that unlike Ethereum, it does not require multiple layers to be scalable, or even private. Hashgraph can do over 10.000 transactions per second with minimal latency before sharding. Blockchain networks like Ethereum that are inherently slow can actually use Hashgraph to scale. Trillions of TPS? Soon. With the incoming roll out of shards, the Hashgraph will be able to do trillions of transactions per second, making it the prime network to be used for Artificial General Intelligence. Perhaps one reason why Google is doubling down on Hedera, as can be seen by their recent interviews with the inventor of Hashgraph, Dr. Leemon Baird regarding AI & DLTs, their Web3 accelerator programs or hosting the Hedera Governing Council Meeting at their HQ. “When Leemon published the Hashgraph white paper, the world changed. The entire computer science community that knew anything about distributed ledgers saw it as a revolution” Not only the fastest, also the greenest Hashgraph technology is not only the fastest, but also the greenest distributed ledger technology in the world. It’s actually 1000 times greener than Visa transactions & 970.000.000 times greener than BTC. Security that is ready for quantum computers Hedera Hashgraph is one of the most secure protocols we know of. If you want to know why in detail, read Dr. Leemon Baird’s blog post. EVM compatible, minimal USD-fixed fees & out-of-the-box tooling Hedera is EVM compatible and aiming for equivalence. At the same time, the Hedera Consensus Service can be used to enable decentralised consensus within traditional applications, fully avoiding the need for smart contracts whilst reaping all the benefits of immutable records. Serverless functions and Kubernetes clusters that are used in billions of infrastructure set ups can now be based on decentralised consensus. From decentralised Identity to Stablecoin Studio and the Hedera Guardian Service Hedera enables seemless tracking of CO2 offsets through the Hedera Guardian. It is slowly becoming a core component of the ESG story of the future. At the same time, banks and central banks are experimenting with Hedera’s Stablecoin studio which enables the creation of stablecoins with proof of reserve and KYC requirement. Hedera also offers decentralised identity SDKs out of the box and lets developers build applications with zK properties, such as Tejouri which is revolutionising the court system in the United Arab Emirates. Most used public network on the planet It took Ethereum 2 years to reach 2 Billion transactions. Hedera does that in 1 week. Hedera does more transactions than Cardano has in its lifetime in 3 days. A market cap that can 500x – 1500x by 2030 (For my own reasons, I’m personally a large HBAR investor but I do not offer any financial advice) Soon it will be more decentralised than ALL networks Hedera already has the most decentralised & trusted, incorruptible governance structure. Soon the network itself will become extremely decentralised with the roll out of community nodes. This will put an end to claims that the Hashgraph is centralised. Together with shards, a new generation of crypto will slowly unfold that will not only eat the rest of the crypto industry, but also most traditional business processes. From RWAs to CBDCS, DeFi, dApps and Infrastructure: Hashgraph will be at the core of the future. Enterprises, governments and start ups are already embracing this technology and we will see continuous growth in the coming years. How VC companies can capitalise The best way venture capital companies can capitalise on Hedera is not only to look at HBAR but also by creating Hashgraph specific accelerators. The Hedera ecosystem is growing daily but there is still a lot of space for innovation. Now is the time to understand this technology thoroughly, to build best practices, form connections and to finally target the enterprise. To understand more about how this could work, send an email to shayan.salehis@gmail.com Watch Dr. Baird, inventor of Hashgraph speak at Harvard https://m.youtube.com/watch?v=IjQkag6VOo0",
    "originSummary": [
      "Hashgraph Technology, considered more revolutionary than Blockchain, is being integrated into business flows by organizations like Google, IBM, and Boeing.",
      "The White House has sought help from Hedera Hashgraph for open source software security.",
      "Hashgraph is faster, greener, and more secure than Blockchain, handling trillions of transactions per second and compatible with EVM."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699970985582
  }
]
