[
  {
    "id": 37546874,
    "title": "CatalaLang/catala: Linguagem de programação para especificação de leis",
    "originLink": "https://github.com/CatalaLang/catala",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546874",
    "commentBody": "",
    "originSummary": [
      "Catala é uma nova linguagem específica de domínio que pode criar algoritmos a partir de documentos jurídicos, garantindo alta fidelidade entre o código e a lei.",
      "A linguagem foi criada para refletir a estrutura lógica da lei, tornando-a acessível para revisão e certificação por profissionais da área jurídica; ela tem até mesmo um compilador que gera PDFs legíveis por advogados.",
      "Nomeado em homenagem a Pierre Catala, pioneiro da tecnologia jurídica francesa, o projeto Catala é uma iniciativa de pesquisa liderada pelo Inria, o Instituto Nacional de Pesquisa em Ciência da Computação da França. No entanto, o compilador continua instável e com recursos limitados."
    ],
    "commentSummary": [
      "A conversa se concentra no uso da Catala, uma linguagem de programação, na especificação de leis e documentos jurídicos, enfatizando suas vantagens, desvantagens e os possíveis desafios de traduzir o inglês para um sistema de lógica formal.",
      "Há um debate sobre o uso do código como regulador, a complexidade do código jurídico, o uso de símbolos de codificação em acordos jurídicos e o conceito de codificação de intenções em leis usando linguagens de programação.",
      "Os participantes discutiram a ideia de escrever textos jurídicos claros, a função de uma linguagem específica de domínio para contratos jurídicos, a comparação do desenvolvimento de software com o sistema jurídico e as preocupações com a escolha do nome para essas linguagens de programação."
    ],
    "points": 418,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1694968469
  },
  {
    "id": 37546810,
    "title": "Faça LLMs em casa, no estilo BitTorrent",
    "originLink": "https://petals.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546810",
    "commentBody": "",
    "originSummary": [
      "A Petals é uma plataforma que permite aos usuários operar grandes modelos de linguagem - como Llama 2, Falcon e BLOOM - em seus dispositivos usando GPU de nível de consumidor ou o Google Colab.",
      "A plataforma permite que seus usuários participem de uma rede para atender a diferentes partes do modelo e adaptar modelos para diversas tarefas, fornecendo uma API e opções flexíveis com PyTorch e Hugging Face Transformers.",
      "O projeto da Petals foi destacado no workshop de pesquisa BigScience, indicando ainda mais sua contribuição significativa para o campo de desenvolvimento de modelos de linguagem."
    ],
    "commentSummary": [
      "O artigo examina o potencial de execução de grandes modelos de linguagem (LLMs) em casa usando um método no estilo BitTorrent, reunindo recursos de computação, criando modelos derivados e utilizando o ajuste fino eficiente de parâmetros e a metodologia LoRA.",
      "As dificuldades e os custos associados ao treinamento de modelos grandes são discutidos, com possíveis soluções como resfriamento a água e modificação de placas de servidor mais antigas. Conceitos como computação descentralizada e modelos de ajuste fino também são abordados.",
      "Há menção ao Petals, um serviço para executar LLMs em dispositivos de baixo custo, com críticas mistas entre os participantes. O artigo especula sobre o possível uso de tokens e computação descentralizada para dar suporte a LLMs de código aberto no futuro."
    ],
    "points": 402,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1694968203
  },
  {
    "id": 37548720,
    "title": "Brian Bucklew Portando o Caves of Qud do Unity para o Godot",
    "originLink": "https://twitter.com/unormal/status/1703163364229161236",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548720",
    "commentBody": "",
    "originSummary": [
      "O tweet indica o plano do indivíduo de participar de atividades irresponsáveis e registrar os danos subsequentes que elas causam."
    ],
    "commentSummary": [
      "Brian Bucklew está fazendo a transição do jogo Caves of Qud do Unity para o Godot, uma mudança que é bem recebida devido à natureza amigável do Godot e aos benefícios no desenvolvimento de ferramentas e na aplicação de gráficos 2D.",
      "Apesar de o Godot não ter um ecossistema de loja e mercado semelhante ao do Unity, há esforços em andamento para corrigir esse problema.",
      "O autor destaca os desafios do uso de SVG (Scalable Vector Graphics, gráficos vetoriais escaláveis) em mecanismos de jogos e sugere o emprego de bibliotecas de renderização como uma solução."
    ],
    "points": 274,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1694980438
  },
  {
    "id": 37545313,
    "title": "Cerca de 2 mil ativistas ambientais foram mortos na última década",
    "originLink": "https://e360.yale.edu/digest/environmental-defenders-murdered-2022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545313",
    "commentBody": "",
    "originSummary": [
      "A Global Witness, em um relatório recente, destaca a tendência preocupante de assassinatos de ativistas ambientais, quase 2.000 em todo o mundo entre 2012 e 2022, com 177 incidentes somente em 2022.",
      "A América Latina, especialmente a Colômbia, foi identificada como de alto risco para os ativistas ambientais, sendo que o Brasil, o México, Honduras e as Filipinas também registraram altas taxas de fatalidade. Os povos indígenas constituíram um terço das vítimas, destacando seu papel fundamental na mitigação do clima.",
      "O relatório ressalta a urgência de proteger e ajudar aqueles que defendem a proteção ambiental."
    ],
    "commentSummary": [
      "As discussões destacam uma série de tópicos, como os riscos enfrentados pelos ativistas ambientais, o papel crucial das culturas indígenas na conservação ambiental e as estratégias e a reputação dos ativistas climáticos.",
      "Eles também se aprofundam em questões sobre as implicações éticas das catástrofes ambientais provocadas pelo homem, o fenômeno da imunidade policial e seu impacto na justiça criminal, a posse de armas e os homicídios relacionados, além de preocupações com a credibilidade e a propaganda da mídia.",
      "A morte a tiros de Manuel Esteban Paez Terán por policiais também é um assunto destacado, com as conversas ressaltando diferentes pontos de vista e perspectivas, destacando a controvérsia e a complexidade desses tópicos."
    ],
    "points": 274,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1694960272
  },
  {
    "id": 37553574,
    "title": "E se o OpenDocument usasse o SQLite?",
    "originLink": "https://www.sqlite.org/affcase1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553574",
    "commentBody": "",
    "originSummary": [
      "O artigo propõe a ideia de utilizar o SQLite, uma biblioteca de software que fornece um sistema de gerenciamento de banco de dados relacional, como um contêiner para arquivos do OpenDocument Presentation, em vez do formato de arquivo ZIP atual.",
      "Ele sugere possíveis aprimoramentos, como a divisão do conteúdo em partes menores e a adição de recursos de controle de versão, que poderiam ser facilitados por essa mudança.",
      "O autor ressalta os benefícios de usar o SQLite como um formato de arquivo de aplicativo, incluindo experiência de usuário e desempenho aprimorados, o que pode aumentar a eficiência dos aplicativos."
    ],
    "commentSummary": [
      "O discurso é sobre o uso do SQLite como um formato de arquivo para o OpenDocument, comparando seus pontos fortes e limitações com outros formatos, como o XML.",
      "A falta de padronização do SQLite apresenta desafios para a interoperabilidade e a padronização ISO, apesar de sua maior funcionalidade.",
      "A conversa também aborda o conceito de salvamento automático dos dados do usuário, os aspectos técnicos do salvamento de dados e as possíveis vantagens e desvantagens do SQLite em vários contextos, enfatizando a necessidade de um equilíbrio entre o salvamento automático e o controle do usuário."
    ],
    "points": 262,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1695024681
  },
  {
    "id": 37551474,
    "title": "Introdução aos sistemas Linux imutáveis",
    "originLink": "https://dataswamp.org/~solene/2023-07-12-intro-to-immutable-os.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551474",
    "commentBody": "",
    "originSummary": [
      "O artigo se aprofunda no conceito de sistemas Linux imutáveis, explorando implementações específicas como NixOS, Guix, Endless OS e Fedora Silverblue.",
      "As características exclusivas de cada sistema são discutidas, incluindo seus gerenciadores de pacotes e recursos de reversão; experiências e opiniões pessoais também são compartilhadas.",
      "Apesar de observar a crescente popularidade dos sistemas operacionais imutáveis no campo do código aberto, o artigo também aponta os desafios associados e as várias estratégias para a imutabilidade."
    ],
    "commentSummary": [
      "Este artigo explora a ideia de sistemas Linux imutáveis, apresentando várias distribuições que implementam esse modelo, incluindo o EndlessOS e o Fedora CoreOS.",
      "São discutidos os prós e os contras do uso de sistemas imutáveis em relação aos sistemas mutáveis, abrangendo aspectos como gerenciamento de pacotes, personalização e controle do sistema.",
      "As experiências e opiniões dos usuários sobre o NixOS e o Fedora são compartilhadas, levando em conta fatores como acessibilidade, compatibilidade e procedimentos de reversão."
    ],
    "points": 255,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695003570
  },
  {
    "id": 37546766,
    "title": "Coisas que não existem na Dimension Apple",
    "originLink": "https://maxread.substack.com/p/a-literary-history-of-fake-texts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546766",
    "commentBody": "",
    "originSummary": [
      "O artigo discute os temas e personagens recorrentes nos materiais de marketing da Apple, com foco especial na representação de conversas de texto falsas.",
      "O autor observa a cultura distinta nessas conversas fictícias, marcada pela ausência de ironia e pelo foco no compartilhamento de fotos e na organização de eventos sociais.",
      "Ele especula sobre um universo paralelo chamado \"Dimensão Apple\", comparado a certas experiências em grupos de pais no WhatsApp, e inclui uma compilação de capturas de tela de textos falsos da Apple."
    ],
    "commentSummary": [
      "O artigo analisa criticamente as representações de mensagens de texto nos recursos de marketing da Apple e as compara com a forma como os indivíduos realmente interagem.",
      "As discussões giram em torno de se a estratégia de comunicação da Apple reflete a realidade, o uso cada vez menor de integrações de mídia social no marketing da empresa e as restrições de compartilhamento de grandes arquivos de imagem por meio de aplicativos de mensagens.",
      "Há também especulações sobre a ausência da Apple no grupo de empresas que oferecem serviços de mídia social."
    ],
    "points": 238,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1694968008
  },
  {
    "id": 37546469,
    "title": "Notas sobre o óleo de pimenta",
    "originLink": "https://uptointerpretation.com/posts/chili-oil-notes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546469",
    "commentBody": "",
    "originSummary": [
      "O autor compartilha suas percepções sobre a preparação do óleo de pimenta, explorando diferentes métodos de extração, como flash quente e infusão lenta.",
      "A correlação entre diferentes temperaturas e tipos de óleo e o sabor resultante é examinada.",
      "A postagem sugere fazer experiências com várias pimentas, especiarias e temperos para descobrir as nuances distintas do óleo de pimenta."
    ],
    "commentSummary": [
      "O artigo principal descreve um método sugerido para fazer óleo de pimenta, bem como técnicas alternativas, como o sous vide.",
      "Nos comentários, os participantes compartilham experiências pessoais e perspectivas sobre a produção de óleo de pimenta, com discussões sobre medidas de segurança e perfis de sabor.",
      "As conversas se desviam para outros tópicos, como preparação de chás, segurança alimentar e o papel crucial da consistência da moagem e dos moedores de qualidade na preparação do café."
    ],
    "points": 235,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1694966406
  },
  {
    "id": 37549745,
    "title": "O patrimônio IPv4 da AWS agora vale US$ 4,5 bilhões",
    "originLink": "https://toonk.io/aws-ipv4-estate-now-worth-4-5-billion/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549745",
    "commentBody": "",
    "originSummary": [
      "A Amazon Web Services (AWS) aumentou seu número de endereços IPv4 em 27 milhões, resultando em um total de 128 milhões; isso faz com que seu patrimônio IPv4 valha aproximadamente US$ 4,5 bilhões, um aumento considerável em relação a 3 anos atrás.",
      "Notavelmente, estima-se que cada endereço IPv4 valha US$ 35, devido à crescente escassez e ao custo dos endereços IPv4.",
      "A AWS planejou cobrar dos clientes por endereços IPv4 a uma taxa de US$ 0,005 por IP por hora, o que poderia gerar uma receita anual estimada de US$ 500 milhões a US$ 1 bilhão."
    ],
    "commentSummary": [
      "A postagem discute as dificuldades e frustrações encontradas na transição do IPv4 para o IPv6, incluindo preocupações com a compatibilidade, atualizações de rede e adoção mais lenta do que o esperado pelos ISPs.",
      "Há debates sobre soluções alternativas, como a extensão do IPv4 ou a criação de uma nova versão, e críticas sobre a complexidade e a usabilidade dos endereços IPv6, bem como sobre a falta de motivação econômica para a migração.",
      "A publicação também destaca a escassez de endereços IPv4 e a possibilidade de comportamento anticompetitivo dos principais participantes, sugerindo a necessidade de um processo de conversão mais suave e de uma solução mais fácil de usar."
    ],
    "points": 212,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1694988059
  },
  {
    "id": 37548975,
    "title": "Clube do site de homebrew",
    "originLink": "https://indieweb.org/Homebrew_Website_Club",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548975",
    "commentBody": "",
    "originSummary": [
      "O Homebrew Website Club é uma rede global de encontros criados para ajudar as pessoas a obter mais controle sobre sua experiência on-line, especialmente em relação a blogs.",
      "O recurso inclui detalhes sobre encontros recentes e futuros, apresentando informações como datas, organizadores, locais e guias para organizar encontros virtuais e físicos.",
      "Durante a pandemia, o clube fez a transição para reuniões on-line e oferece recursos para a organização de IndieWebCamps, esforços independentes para criar sites privados em vez de usar serviços da Web centralizados."
    ],
    "commentSummary": [
      "O diálogo enfatiza os designs minimalistas de sites com uso reduzido de JavaScript e a importância dos banners de consentimento.",
      "Os participantes expressam seu apreço pelo Homebrew Website Club, pela propriedade de sites pessoais e pela criação de designs inovadores para a Web usando ferramentas como React e Angular.",
      "A palestra destaca o valor da criatividade e da personalização no atual cenário da Web, o que inclui ter sites pessoais e participar de eventos da IndieWeb."
    ],
    "points": 204,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1694982354
  },
  {
    "id": 37549216,
    "title": "Modelos de linguagens grandes para otimização de compiladores",
    "originLink": "https://arxiv.org/abs/2309.07062",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549216",
    "commentBody": "",
    "originSummary": [
      "O artigo investiga a aplicação de modelos de linguagem grande (LLMs) na otimização de código, usando um modelo de transformador de 7 bilhões de parâmetros para otimizar o tamanho do código de montagem da máquina virtual de baixo nível (LLVM).",
      "O modelo é treinado para prever a contagem de instruções antes e depois da otimização e, posteriormente, fornecer o código otimizado.",
      "Os testes realizados em uma grande variedade de programas revelaram uma melhoria de 3,0% em relação ao compilador tradicional, demonstrando os recursos robustos de raciocínio de código do modelo."
    ],
    "commentSummary": [
      "O resumo aborda as discussões sobre as vantagens e restrições do uso de modelos de aprendizado de linguagem (LLMs) na otimização do compilador, como a redução do número de instruções e a geração de código compilável.",
      "Ele também discute as preocupações relacionadas à semântica e à correção do código ao usar LLMs, além de desafios como a necessidade de conjuntos de dados maiores.",
      "O texto faz referência a outros diálogos sobre a utilização da IA na otimização de compiladores, os riscos associados e a investigação da funcionalidade dos LLMs em diferentes fases do processo de compilação."
    ],
    "points": 197,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1694984120
  },
  {
    "id": 37546241,
    "title": "Como o Mac não levou a programação para as pessoas",
    "originLink": "https://eclecticlight.co/2023/09/16/how-the-mac-didnt-bring-programming-to-the-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546241",
    "commentBody": "",
    "originSummary": [
      "Este artigo analisa a história das linguagens de programação em plataformas Mac e suas tentativas malsucedidas de tornar a codificação mais acessível para o público em geral.",
      "A ênfase é colocada no Prograph, uma linguagem de programação visual, sugerindo que uma linguagem visual semelhante, porém mais eficiente, pode provocar uma mudança significativa no campo.",
      "O autor indica que, apesar de alguns elementos interessantes em linguagens como Swift, o impacto do Mac no campo da programação continua limitado em comparação com sua influência na editoração eletrônica."
    ],
    "commentSummary": [
      "A discussão se concentra nos esforços da Apple para tornar a programação acessível a usuários comuns, ilustrando os desafios que ocorreram durante o aprendizado de programação em computadores Mac nos anos 90.",
      "Ele destaca os contrastes entre as estratégias da Apple e da Microsoft em relação ao desenvolvimento de software, ressaltando a importância de criar ambientes que simplifiquem a programação e capacitem os usuários.",
      "A conversa reflete sobre as restrições de ferramentas de programação específicas e a discrepância identificada entre várias formas de automação e script, oferecendo diversos pontos de vista sobre a programação e as experiências do usuário em várias plataformas e ferramentas."
    ],
    "points": 195,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1694965242
  },
  {
    "id": 37545040,
    "title": "Alterando as regras da ferrugem",
    "originLink": "https://without.boats/blog/changing-the-rules-of-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545040",
    "commentBody": "",
    "originSummary": [
      "Esta postagem examina as decisões de API e as características dos marcadores na linguagem de programação Rust, com foco especial nas características Send, Move e Leak.",
      "O autor considera a possibilidade de incorporar uma característica de vazamento ao Rust, mas se opõe a ela devido à possível confusão e aos desafios de compatibilidade que ela pode criar.",
      "Apesar de expressar arrependimento por não ter integrado a característica Leak antes, o autor reconhece as complexidades da implementação dessas modificações no estágio atual."
    ],
    "commentSummary": [
      "O fórum RustHacker destaca os desafios de fazer modificações no Rust, principalmente com relação ao Rust assíncrono, devido à ausência de uma característica do tipo Leak, o que exige soluções alternativas.",
      "Há um discurso contínuo sobre as implicações de acomodar compiladores desatualizados, possíveis soluções e a perspectiva de revelar uma nova iteração do Rust comparável ao JavaScript e ao TypeScript.",
      "Os participantes expressam diversos pontos de vista sobre os meandros e as restrições das linguagens de programação, que incluem a fixação em Rust e comparações com C++, demonstrando as complexidades e os compromissos inerentes ao design e à execução da linguagem de programação."
    ],
    "points": 185,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694958551
  },
  {
    "id": 37546255,
    "title": "Independência tecnológica",
    "originLink": "https://sive.rs/ti",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546255",
    "commentBody": "",
    "originSummary": [
      "O artigo explora a ideia de independência tecnológica, incentivando o uso de soluções de código aberto, como os sistemas operacionais Linux ou BSD, para obter controle sobre a presença digital.",
      "Ele fornece guias detalhados sobre tarefas como registro de um domínio, configuração de um servidor e configuração de e-mail, destacando a importância da troca fácil de provedor sem perda de dados ou de funcionalidade.",
      "O material inclui ainda instruções específicas para iPhones Android e Apple, além de sugestões para solução de problemas e recursos de aprendizado valiosos para aprimorar a proficiência individual."
    ],
    "commentSummary": [
      "O artigo se aprofunda no conceito de independência tecnológica, enfatizando a necessidade de soluções de auto-hospedagem mais simples, fáceis de usar e acessíveis.",
      "Ele ressalta as limitações dos sistemas P2P (Peer-to-Peer) existentes, descreve várias plataformas e projetos e oferece sugestões para a auto-hospedagem de sites e arquivos pessoais em casa, recomendando cautela.",
      "O artigo promove um debate sobre os graus de independência tecnológica viáveis com o uso de IP de host de nuvem, gerando perspectivas contrastantes sobre a confiabilidade de serviços de terceiros."
    ],
    "points": 166,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694965286
  },
  {
    "id": 37553193,
    "title": "OpenRA - Jogos de estratégia clássicos reconstruídos para a era moderna",
    "originLink": "https://www.openra.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553193",
    "commentBody": "",
    "originSummary": [
      "O OpenRA, um projeto conduzido por voluntários, reconstruiu jogos clássicos de estratégia em tempo real, como Red Alert, Command & Conquer e Dune 2000, para sistemas contemporâneos, com suporte nativo para Windows, macOS e Linux.",
      "Os jogos apresentam mecânica de jogo aprimorada, jogo on-line, incluindo suporte a mods, e campanhas inovadoras. Esse projeto se baseia no desenvolvimento de código aberto e na contribuição da comunidade.",
      "Seu mais recente teste de jogo inclui correções de bugs, novas tarefas, suporte aprimorado a mods e um avanço na compatibilidade com a Command & Conquer Remastered Collection. Os desenvolvedores agradecem o feedback sobre quaisquer problemas."
    ],
    "commentSummary": [
      "O OpenRA é um projeto que visa renovar os jogos de estratégia clássicos para acomodar plataformas modernas, simplificando a instalação e oferecendo compatibilidade entre plataformas.",
      "O OpenRA aprimorou a mecânica do jogo e oferece opções para importar recursos dos jogos originais, melhorando assim a experiência geral do jogo.",
      "O projeto despertou interesse e discussões ativas entre os usuários sobre a possibilidade de reimplementar outros jogos clássicos."
    ],
    "points": 162,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695020867
  },
  {
    "id": 37548599,
    "title": "Matemática do donut: como o donut.c funciona",
    "originLink": "https://www.a1k0n.net/2011/07/20/donut-math.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548599",
    "commentBody": "",
    "originSummary": [
      "O artigo detalhou o interesse renovado no código \"donut\" de 2006, que usa um framebuffer e um Z-buffer para visualizar um toro como arte ASCII de baixa resolução sem raytracing.",
      "Ele forneceu uma explicação sobre a matemática por trás da renderização em perspectiva 3D e o método de projetar cada ponto em uma tela 2D.",
      "A peça também apresenta o código original e inclui um link para a fonte JavaScript para renderização em ASCII e tela."
    ],
    "commentSummary": [
      "O artigo discute a implementação do código donut.c, comparando-o com outros projetos de codificação criativa.",
      "São fornecidas instruções sobre como compilar esse código em plataformas específicas, juntamente com soluções para alguns problemas de compilação.",
      "A seção de comentários inclui discussões perspicazes e experiências pessoais compartilhadas relacionadas ao tópico."
    ],
    "points": 161,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1694979520
  },
  {
    "id": 37549569,
    "title": "Por que a Booz Allen está nos alugando de volta nossos próprios parques nacionais?",
    "originLink": "https://www.thebignewsletter.com/p/why-is-booz-allen-renting-us-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549569",
    "commentBody": "",
    "originSummary": [
      "O artigo examina a prática da empresa de consultoria Booz Allen de cobrar taxas pelo site Recreation.gov para acesso a terras e águas federais dos EUA, causando preocupações sobre o controle e o lucro dos parques nacionais.",
      "Uma ação judicial que questiona as taxas para visitar o Red Rock Canyon desencadeou um processo de comentários públicos para decidir sobre a remuneração do contratante.",
      "O autor recomenda regulamentações mais rigorosas para evitar tais práticas, enfatizando o valor das terras públicas e a influência das filosofias de Henry George."
    ],
    "commentSummary": [
      "O artigo examina as disputas sobre a forma como o Recreation.gov lida com os aluguéis dos parques nacionais, em que a operadora Booz Allen Hamilton é acusada de praticar preços excessivos e explorar um monopólio.",
      "Em meio a pedidos de transparência, os críticos pedem mais concorrência no desenvolvimento de sites governamentais e uma divulgação clara da receita e dos custos operacionais.",
      "O artigo também aborda as polêmicas taxas de reserva on-line para acampamentos, com alguns sugerindo que uma entidade sem fins lucrativos ou uma instituição governamental gerencie o sistema de reservas, enquanto outros questionam as taxas e os contratos impostos pelas empresas privadas."
    ],
    "points": 160,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1694986436
  },
  {
    "id": 37549259,
    "title": "Hush - Navegação sem ruído para o Safari",
    "originLink": "https://oblador.github.io/hush/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549259",
    "commentBody": "",
    "originSummary": [
      "O Noiseless Browsing, um bloqueador de conteúdo gratuito criado por Joel Arvidsson, está disponível para o Safari no Mac, iPhone e iPad.",
      "O aplicativo evita notificações indesejadas de cookies e rastreamento de privacidade e, ao mesmo tempo, não coleta dados pessoais, garantindo a privacidade do usuário.",
      "Anunciado como leve, rápido, fácil de usar e de código aberto, ele também é compatível com a mais recente tecnologia da Apple."
    ],
    "commentSummary": [
      "O artigo discute várias extensões e navegadores capazes de bloquear anúncios e banners de cookies no navegador Safari.",
      "Ele investiga as irritações dos usuários em relação aos banners de cookies e as regras de coleta de dados de acordo com o Regulamento Geral de Proteção de Dados (GDPR).",
      "A discussão traz à tona preocupações sobre a privacidade e a segurança das ferramentas de software, destacando o debate atual e as preferências dos usuários sobre privacidade e rastreamento on-line."
    ],
    "points": 146,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694984455
  },
  {
    "id": 37551175,
    "title": "As plantas podem detectar sons",
    "originLink": "https://www.economist.com/science-and-technology/2023/09/06/plants-dont-have-ears-but-they-can-still-detect-sound",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551175",
    "commentBody": "",
    "originSummary": [
      "Estudos científicos demonstraram que as plantas podem detectar e reagir ao som e, potencialmente, produzir o próprio som.",
      "Vários experimentos revelam que diferentes tipos de som podem influenciar o crescimento das plantas e a produção de compostos de estresse. Por exemplo, um arbusto asiático apresentou crescimento no tamanho das folhas após a exposição a cantos budistas.",
      "Alguns sons podem ter efeitos negativos sobre as plantas, pois um estudo demonstrou um crescimento atrofiado em plantas expostas ao ruído do tráfego."
    ],
    "commentSummary": [
      "Um estudo descobriu que a espécie de planta Boquila trifoliolata tem a capacidade de identificar sons, embora o mecanismo por trás disso ainda esteja em debate.",
      "Há discordância entre os especialistas sobre o projeto e a interpretação do estudo, especialmente sobre o tema de se todos os sentidos das plantas podem ser classificados como uma forma de toque.",
      "O ceticismo em relação às alegações pseudocientíficas está presente, com pedidos de pesquisas mais rigorosas, como mostra um experimento separado que estuda o efeito do ruído do tráfego nas plantas em um ambiente de laboratório."
    ],
    "points": 137,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1695000586
  },
  {
    "id": 37546689,
    "title": "Navegando como se fosse 1994: Integrando um Mac SE, ImageWriter II em uma LAN moderna",
    "originLink": "https://connor.zip/posts/2023-08-04-localtalk-ethernet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546689",
    "commentBody": "",
    "originSummary": [
      "O autor relata a experiência de usar computadores Macintosh antigos e protocolos AppleTalk para recriar uma experiência de navegação na Internet semelhante à de 1994.",
      "O texto fornece um guia sobre a instalação e a configuração do Netatalk 2.x, que é uma implementação do Linux dos protocolos da Apple, e explica o processo de colocar um computador Macintosh antigo on-line.",
      "Ele também aborda a utilização de navegadores específicos, as vantagens de usar o endereçamento IPv4 Link-Local e os métodos de conexão de impressoras a dispositivos Mac mais recentes."
    ],
    "commentSummary": [
      "O artigo se concentra na integração de um Mac SE antigo e do ImageWriter II em uma rede local (LAN) moderna e revisita o uso do Localtalk e do PhoneNET durante os anos 90.",
      "Os participantes compartilham experiências queridas com Macs e periféricos antigos, incluindo o uso de impressoras antigas e sua conexão com redes modernas.",
      "A discussão também aborda a navegação na Internet usando máquinas desatualizadas e a lembrança do software de processamento de texto favorito do passado."
    ],
    "points": 136,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1694967608
  }
]
