[
  {
    "id": 37546874,
    "title": "CatalaLang/catala: Hukuk spesifikasyonu için programlama dili",
    "originLink": "https://github.com/CatalaLang/catala",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546874",
    "commentBody": "",
    "originSummary": [
      "Catala, yasal belgelerden algoritmalar oluşturabilen ve kod ile yasa arasında yüksek sadakat sağlayan, alana özgü yeni bir dildir.",
      "Dil, hukukun mantıksal yapısını yansıtacak şekilde oluşturulmuştur ve hukuk uzmanları tarafından incelenebilir ve belgelendirilebilir hale getirilmiştir; hatta avukatlar tarafından okunabilir PDF'ler üreten bir derleyiciye sahiptir.",
      "Adını Fransız hukuk teknolojisinin öncülerinden Pierre Catala'dan alan Catala projesi, Fransa'nın Ulusal Bilgisayar Bilimleri Araştırma Enstitüsü Inria tarafından yürütülen bir araştırma girişimidir. Bununla birlikte, derleyici kararsız ve sınırlı özelliklere sahip olmaya devam etmektedir."
    ],
    "commentSummary": [
      "Konuşma, bir programlama dili olan Catala'nın yasaların ve yasal belgelerin belirtilmesinde kullanılmasına odaklanmakta, faydaları, dezavantajları ve İngilizceyi biçimsel bir mantık sistemine çevirmenin potansiyel zorlukları üzerinde durmaktadır.",
      "Kodun bir düzenleyici olarak kullanımı, yasal kodun karmaşıklığı, yasal anlaşmalarda kodlama sembollerinin kullanımı ve programlama dilleri kullanılarak yasalara niyet kodlama kavramı hakkında bir tartışma vardır.",
      "Katılımcılar, açık hukuki metinler yazma fikrini, hukuki sözleşmeler için alana özgü bir dilin rolünü, yazılım geliştirmeyi hukuk sistemiyle karşılaştırmayı ve bu tür programlama dilleri için isim seçimiyle ilgili endişeleri tartıştılar."
    ],
    "points": 418,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1694968469
  },
  {
    "id": 37546810,
    "title": "LLM'leri evde BitTorrent tarzı çalıştırın",
    "originLink": "https://petals.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546810",
    "commentBody": "",
    "originSummary": [
      "Petals, kullanıcıların tüketici sınıfı GPU veya Google Colab kullanarak cihazlarında Llama 2, Falcon ve BLOOM gibi büyük dil modellerini çalıştırmalarını sağlayan bir platformdur.",
      "Platform, PyTorch ve Hugging Face Transformers ile hem bir API hem de esnek seçenekler sunarak kullanıcılarının modelin farklı bölümlerine hizmet vermek için bir ağa katılmasına ve modelleri farklı görevler için uyarlamasına olanak tanır.",
      "Petals'ın projesi, BigScience araştırma çalıştayında vurgulanarak dil modeli geliştirme alanına yaptığı önemli katkının bir göstergesi olmuştur."
    ],
    "commentSummary": [
      "Makale, işlem kaynaklarını bir araya getirerek, türev modeller oluşturarak ve parametre verimli ince ayar ve LoRA metodolojisini kullanarak BitTorrent tarzı bir yöntem kullanarak büyük dil modellerini (LLM'ler) evde çalıştırma potansiyelini incelemektedir.",
      "Büyük modellerin eğitilmesiyle ilgili zorluklar ve maliyetler, su soğutması ve eski sunucu kartlarının değiştirilmesi gibi olası çözümlerle birlikte tartışılmaktadır. Merkezi olmayan bilgi işlem ve ince ayar modelleri gibi kavramlar da ele alınmaktadır.",
      "LLM'leri düşük kaliteli cihazlarda çalıştırmaya yönelik bir hizmet olan Petals'tan bahsediliyor ve katılımcılar arasında karışık yorumlar yapılıyor. Yazıda, gelecekte açık kaynaklı LLM'leri desteklemek için tokenlerin ve merkezi olmayan bilgi işlemin olası kullanımı hakkında spekülasyonlar yapılıyor."
    ],
    "points": 402,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1694968203
  },
  {
    "id": 37548720,
    "title": "Brian Bucklew Caves of Qud'un Unity'den Godot'ya Taşınması",
    "originLink": "https://twitter.com/unormal/status/1703163364229161236",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548720",
    "commentBody": "",
    "originSummary": [
      "Tweet, bireyin sorumsuz faaliyetlere katılma planını ve daha sonra verdikleri zararı kronikleştirdiğini gösteriyor."
    ],
    "commentSummary": [
      "Brian Bucklew, Caves of Qud oyununu Unity'den Godot'a geçiriyor; Godot'un kullanıcı dostu yapısı ve araç geliştirme ve 2D grafik uygulama konusundaki avantajları nedeniyle bu geçiş olumlu karşılandı.",
      "Godot, Unity'ye benzer bir mağaza ve pazar yeri ekosistemine sahip olmamasına rağmen, bu sorunu gidermek için çalışmalar devam etmektedir.",
      "Yazar, oyun motorlarında Ölçeklenebilir Vektör Grafikleri (SVG) kullanımındaki zorlukları vurgulamakta ve çözüm olarak render kütüphanelerinin kullanılmasını önermektedir."
    ],
    "points": 274,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1694980438
  },
  {
    "id": 37545313,
    "title": "Son on yılda 2 bine yakın çevre aktivisti öldürüldü",
    "originLink": "https://e360.yale.edu/digest/environmental-defenders-murdered-2022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545313",
    "commentBody": "",
    "originSummary": [
      "Global Witness, yakın tarihli bir raporunda, 2012-2022 yılları arasında dünya genelinde yaklaşık 2.000 çevre aktivistinin öldürüldüğünü ve sadece 2022 yılında 177 olayın yaşandığını vurgulamaktadır.",
      "Latin Amerika, özellikle de Kolombiya, çevre aktivistleri için yüksek riskli bölgeler olarak tanımlanırken Brezilya, Meksika, Honduras ve Filipinler de yüksek ölüm oranları bildirmiştir. Kurbanların üçte birini oluşturan yerli halk, iklim değişikliğinin azaltılmasındaki kritik rollerinin altını çizmektedir.",
      "Rapor, çevrenin korunmasını savunanların korunması ve desteklenmesinin aciliyetinin altını çizmektedir."
    ],
    "commentSummary": [
      "Tartışmalar, çevre aktivistlerinin karşı karşıya olduğu riskler, yerli kültürlerin çevrenin korunmasındaki hayati rolü ve iklim aktivistlerinin stratejileri ve itibarları gibi bir dizi konunun altını çiziyor.",
      "Ayrıca, insan yapımı çevresel felaketlerin etik sonuçları, polis dokunulmazlığı olgusu ve bunun ceza adaleti üzerindeki etkisi, silah sahipliği ve buna bağlı cinayetler ile medyanın güvenilirliği ve propagandaya ilişkin kaygılar gibi konulara da değinmektedirler.",
      "Manuel Esteban Paez Terán'ın polis memurları tarafından vurularak öldürülmesi de öne çıkan bir konu olup, konuşmalarda farklı bakış açıları ve perspektifler vurgulanarak bu konuların tartışmalı ve karmaşık olduğunun altı çizilmiştir."
    ],
    "points": 274,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1694960272
  },
  {
    "id": 37553574,
    "title": "OpenDocument SQLite Kullansaydı Ne Olurdu?",
    "originLink": "https://www.sqlite.org/affcase1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553574",
    "commentBody": "",
    "originSummary": [
      "Makale, mevcut ZIP arşiv formatı yerine OpenDocument Presentation dosyaları için bir kapsayıcı olarak ilişkisel bir veritabanı yönetim sistemi sağlayan bir yazılım kütüphanesi olan SQLite'ı kullanma fikrini önermektedir.",
      "İçeriği daha küçük parçalara ayırmak ve sürüm oluşturma yetenekleri eklemek gibi bu geçişle kolaylaştırılabilecek potansiyel iyileştirmeler öneriyor.",
      "Yazar, SQLite'ı bir uygulama dosyası formatı olarak kullanmanın, gelişmiş kullanıcı deneyimi ve performans dahil olmak üzere faydalarının altını çizmekte ve bu nedenle uygulamaların verimliliğini potansiyel olarak artırmaktadır."
    ],
    "commentSummary": [
      "Söylem, SQLite'ın OpenDocument için bir dosya biçimi olarak kullanılması, XML gibi diğer biçimlerle güçlü yönlerinin ve sınırlamalarının karşılaştırılması hakkındadır.",
      "SQLite'ın standardizasyon eksikliği, daha fazla işlevselliğe sahip olmasına rağmen birlikte çalışabilirlik ve ISO standardizasyonu açısından zorluklar yaratmaktadır.",
      "Konuşma ayrıca kullanıcı verilerini otomatik kaydetme kavramını, veri kaydetmenin teknik özelliklerini ve çeşitli bağlamlarda SQLite'ın potansiyel avantaj ve dezavantajlarını kapsamakta ve otomatik kaydetme ile kullanıcı kontrolü arasında bir denge kurulması gerektiğini vurgulamaktadır."
    ],
    "points": 262,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1695024681
  },
  {
    "id": 37551474,
    "title": "Değişmez Linux Sistemlerine Giriş",
    "originLink": "https://dataswamp.org/~solene/2023-07-12-intro-to-immutable-os.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551474",
    "commentBody": "",
    "originSummary": [
      "Makale, NixOS, Guix, Endless OS ve Fedora Silverblue gibi belirli uygulamaları inceleyerek değişmez Linux sistemleri kavramını araştırıyor.",
      "Paket yöneticileri ve geri alma yetenekleri de dahil olmak üzere her sistemin kendine özgü özellikleri tartışılmakta; kişisel deneyimler ve görüşler de paylaşılmaktadır.",
      "Açık kaynak alanında değişmez işletim sistemlerinin artan popülaritesine dikkat çeken makale, değişmezlikle ilgili zorluklara ve çeşitli stratejilere de işaret ediyor."
    ],
    "commentSummary": [
      "Bu makale, değişmez Linux sistemleri fikrini araştırıyor ve EndlessOS ve Fedora CoreOS dahil olmak üzere bu modeli uygulayan birkaç dağıtım sunuyor.",
      "Paket yönetimi, özelleştirme ve sistem kontrolü gibi konuları kapsayacak şekilde, değişmez sistemlere karşı değişebilir sistemlerin kullanılmasının artıları ve eksileri tartışılmaktadır.",
      "Kullanıcıların NixOS ve Fedora hakkındaki deneyimleri ve görüşleri, erişilebilirlik, uyumluluk ve geri alma prosedürleri gibi faktörler dikkate alınarak paylaşılmaktadır."
    ],
    "points": 255,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695003570
  },
  {
    "id": 37546766,
    "title": "Boyut Elma'da var olmayan şeyler",
    "originLink": "https://maxread.substack.com/p/a-literary-history-of-fake-texts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546766",
    "commentBody": "",
    "originSummary": [
      "Makalede, Apple'ın pazarlama materyallerinde tekrarlanan temalar ve karakterler ele alınmakta, özellikle de sahte metin konuşmalarının tasvirine odaklanılmaktadır.",
      "Yazar, bu kurgusal sohbetlerde ironinin yokluğu ve fotoğraf paylaşımı ile sosyal etkinlikler düzenlemeye odaklanılmasıyla belirginleşen farklı bir kültüre dikkat çekiyor.",
      "Ebeveyn WhatsApp gruplarındaki bazı deneyimlere benzetilen \"Boyut Apple\" adlı paralel bir evren hakkında spekülasyon yapıyor ve sahte Apple metinlerinin ekran görüntülerinden oluşan bir derleme içeriyor."
    ],
    "commentSummary": [
      "Makale, Apple'ın pazarlama kaynaklarındaki kısa mesaj tasvirlerini eleştirel bir gözle incelemekte ve bunları bireylerin gerçekte nasıl etkileşimde bulunduklarıyla karşılaştırmaktadır.",
      "Tartışmalar, Apple'ın iletişim stratejisinin gerçeği yansıtıp yansıtmadığı, şirketin pazarlamasında sosyal medya entegrasyonlarının kullanımının azalması ve mesajlaşma uygulamaları aracılığıyla büyük görüntü dosyalarının paylaşılmasının kısıtlamaları etrafında dönüyor.",
      "Apple'ın sosyal medya hizmetleri sunan şirketler arasında yer almamasıyla ilgili spekülasyonlar da var."
    ],
    "points": 238,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1694968008
  },
  {
    "id": 37546469,
    "title": "Acı Yağ Notları",
    "originLink": "https://uptointerpretation.com/posts/chili-oil-notes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546469",
    "commentBody": "",
    "originSummary": [
      "Yazar, sıcak flaş ve yavaş infüzyon gibi farklı ekstraksiyon yöntemlerini keşfederek biber yağının hazırlanmasına ilişkin görüşlerini paylaşıyor.",
      "Farklı sıcaklıklar ve yağ türleri ile ortaya çıkan lezzet arasındaki korelasyon incelenmiştir.",
      "Yazıda, biber yağının farklı nüanslarını keşfetmek için çeşitli biberler, baharatlar ve çeşnilerle denemeler yapılması öneriliyor."
    ],
    "commentSummary": [
      "Ana makale, biber yağı yapmak için önerilen bir yöntemin yanı sıra sous vide gibi alternatif teknikleri özetlemektedir.",
      "Yorumlarda katılımcılar, güvenlik önlemleri ve lezzet profilleri hakkındaki tartışmalarla birlikte biber yağı yapımına ilişkin kişisel deneyimlerini ve bakış açılarını paylaşıyor.",
      "Sohbetler çay yapımı, gıda güvenliği ve dökme kahve demlemede öğütme tutarlılığı ve kaliteli öğütücülerin önemli rolü gibi diğer konulara da uzanıyor."
    ],
    "points": 235,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1694966406
  },
  {
    "id": 37549745,
    "title": "AWS IPv4 Mülkü Şimdi 4,5 Milyar Dolar Değerinde",
    "originLink": "https://toonk.io/aws-ipv4-estate-now-worth-4-5-billion/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549745",
    "commentBody": "",
    "originSummary": [
      "Amazon Web Services (AWS), IPv4 adreslerinin sayısını 27 milyon artırarak toplam 128 milyona çıkardı; bu da IPv4 mülklerini yaklaşık 4,5 milyar dolar değerinde yapıyor ve 3 yıl öncesine göre büyük bir artış anlamına geliyor.",
      "Özellikle, IPv4 adreslerinin artan kıtlığı ve maliyeti nedeniyle her bir IPv4 adresinin 35 dolar değerinde olduğu tahmin edilmektedir.",
      "AWS, IPv4 adresleri için müşterilerden saat başına IP başına 0,005 dolar ücret almayı planlıyor ve bu da tahmini olarak yıllık 500 milyon ila 1 milyar dolar gelir sağlayabilir."
    ],
    "commentSummary": [
      "Yazıda IPv4'ten IPv6'ya geçişte karşılaşılan uyumluluk, ağ yükseltmeleri ve İSS'ler tarafından beklenenden daha yavaş benimsenmesi gibi zorluklar ve hayal kırıklıkları ele alınıyor.",
      "IPv4'ü genişletmek veya yeni bir sürüm oluşturmak gibi alternatif çözümler hakkında tartışmalar ve IPv6 adreslerinin karmaşıklığı ve kullanılabilirliğinin yanı sıra geçiş için ekonomik motivasyon eksikliği hakkında eleştiriler var.",
      "Yazıda ayrıca IPv4 adreslerinin yetersizliği ve kilit katılımcıların rekabete aykırı davranışlarda bulunma potansiyeli vurgulanarak daha yumuşak bir dönüşüm sürecine ve daha kullanıcı dostu bir çözüme ihtiyaç duyulduğu belirtiliyor."
    ],
    "points": 212,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1694988059
  },
  {
    "id": 37548975,
    "title": "Homebrew Web Sitesi Kulübü",
    "originLink": "https://indieweb.org/Homebrew_Website_Club",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548975",
    "commentBody": "",
    "originSummary": [
      "Homebrew Website Club, bireylerin çevrimiçi deneyimleri üzerinde, özellikle de blog yazmayla ilgili olarak daha fazla kontrol sahibi olmalarına yardımcı olmak için tasarlanmış küresel bir buluşma ağıdır.",
      "Kaynakta yakın zamanda gerçekleşen ve gelecekte gerçekleşecek buluşmalarla ilgili ayrıntılar yer almakta, tarihler, organizatörler, mekanlar gibi bilgiler sunulmakta ve hem sanal hem de fiziksel toplantılar düzenlemek için kılavuzlar bulunmaktadır.",
      "Pandemi boyunca kulüp çevrimiçi toplantılara geçiş yaptı ve merkezi web hizmetlerini kullanmak yerine özel web siteleri oluşturmak için bağımsız çabalar olan IndieWebCamps'ı düzenlemek için kaynaklar sağladı."
    ],
    "commentSummary": [
      "Diyalog, JavaScript kullanımının azaltıldığı minimalist web sitesi tasarımlarına ve onay banner'larının önemine vurgu yapıyor.",
      "Katılımcılar, Homebrew Web Sitesi Kulübü'ne, kişisel web sitesi sahipliğine ve React ve Angular gibi araçları kullanarak yenilikçi web tasarımları oluşturmaya olan düşkünlüklerini ifade ediyor.",
      "Konuşma, kişisel web sitelerine sahip olmayı ve IndieWeb etkinliklerine katılmayı da içeren mevcut web ortamında yaratıcılığın ve kişiselleştirmenin değerinin altını çiziyor."
    ],
    "points": 204,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1694982354
  },
  {
    "id": 37549216,
    "title": "Derleyici Optimizasyonu için Büyük Dil Modelleri",
    "originLink": "https://arxiv.org/abs/2309.07062",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549216",
    "commentBody": "",
    "originSummary": [
      "Bu makale, Düşük Seviyeli Sanal Makine (LLVM) montaj kodu boyutunu optimize etmek için 7 milyar parametreli bir dönüştürücü modeli kullanarak kod optimizasyonunda Büyük Dil Modellerinin (LLM'ler) uygulanmasını araştırmaktadır.",
      "Model, optimizasyondan önce ve sonra komut sayılarını tahmin etmek ve ardından optimize edilmiş kodu sağlamak için eğitilir.",
      "Çok çeşitli programlar üzerinde yapılan testler, geleneksel derleyiciye göre %3,0'lük bir iyileşme ortaya koyarak modelin sağlam kod muhakeme yeteneklerini sergilemiştir."
    ],
    "commentSummary": [
      "Özet, komut sayılarını azaltmak ve derlenebilir kod üretmek gibi derleyici optimizasyonunda Dil Öğrenme Modellerini (LLM'ler) kullanmanın avantajları ve kısıtlamaları hakkındaki tartışmalara değinmektedir.",
      "Ayrıca, LLM'leri kullanırken kod semantiği ve doğruluğu ile ilgili endişelerin yanı sıra daha büyük veri kümelerine duyulan ihtiyaç gibi zorluklar da tartışılmaktadır.",
      "Metin, derleyicilerin optimizasyonunda YZ'nin kullanımı, ilişkili riskler ve LLM'lerin derleme sürecinin farklı aşamalarındaki işlevselliğinin araştırılması üzerine daha fazla diyaloğa atıfta bulunmaktadır."
    ],
    "points": 197,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1694984120
  },
  {
    "id": 37546241,
    "title": "Mac insanlara programlamayı nasıl getirmedi?",
    "originLink": "https://eclecticlight.co/2023/09/16/how-the-mac-didnt-bring-programming-to-the-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546241",
    "commentBody": "",
    "originSummary": [
      "Bu makale, Mac platformlarındaki programlama dillerinin tarihini ve kodlamayı genel halk için daha ulaşılabilir hale getirmeye yönelik başarısız girişimlerini incelemektedir.",
      "Görsel bir programlama dili olan Prograph'a vurgu yapılarak, benzer ancak daha etkili bir görsel dilin bu alanda önemli bir değişim yaratabileceği öne sürülmektedir.",
      "Yazar, Swift gibi dillerdeki bazı ilginç unsurlara rağmen, Mac'in programlama alanındaki etkisinin masaüstü yayıncılıktaki etkisine kıyasla sınırlı kaldığını belirtiyor."
    ],
    "commentSummary": [
      "Tartışma, Apple'ın programlamayı normal kullanıcılar için erişilebilir hale getirme çabalarına odaklanıyor ve 90'lı yıllarda Mac bilgisayarlarda programlama öğrenirken karşılaşılan zorlukları örnekliyor.",
      "Apple ve Microsoft'un yazılım geliştirmeye yönelik stratejileri arasındaki zıtlıkları vurgulayarak, programlamayı basitleştiren ve kullanıcıları güçlendiren ortamların geliştirilmesinin öneminin altını çiziyor.",
      "Konuşma, belirli programlama araçlarının kısıtlamalarını ve çeşitli otomasyon ve komut dosyası formları arasındaki tanımlanmış tutarsızlığı yansıtıyor ve birden fazla platform ve araçta programlama ve kullanıcı deneyimleri hakkında farklı bakış açıları sunuyor."
    ],
    "points": 195,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1694965242
  },
  {
    "id": 37545040,
    "title": "Pasın Kurallarını Değiştirmek",
    "originLink": "https://without.boats/blog/changing-the-rules-of-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545040",
    "commentBody": "",
    "originSummary": [
      "Bu yazı, özellikle Send, Move ve Leak özelliklerine odaklanarak Rust programlama dilindeki API kararlarını ve işaretleyici özelliklerini incelemektedir.",
      "Yazar, Rust'a bir Leak özelliği eklemeyi düşünmektedir ancak yaratabileceği potansiyel karışıklık ve uyumluluk zorlukları nedeniyle buna karşı çıkmaktadır.",
      "Yazar, Sızıntı özelliğini daha önce entegre edemediği için pişmanlık duyduğunu ifade etmekle birlikte, mevcut aşamada bu tür değişikliklerin uygulanmasındaki karmaşıklıkları kabul etmektedir."
    ],
    "commentSummary": [
      "RustHacker forumu, Leak tarzı bir özelliğin bulunmaması nedeniyle Rust'ta, özellikle de async Rust ile ilgili değişiklikler yapmanın zorluklarının altını çiziyor ve bu nedenle geçici çözümler gerektiriyor.",
      "Eski derleyicileri barındırmanın sonuçları, potansiyel çözümler ve JavaScript ve TypeScript ile karşılaştırılabilir yeni bir Rust yinelemesinin ortaya çıkarılması olasılığı hakkında devam eden bir tartışma var.",
      "Katılımcılar, Rust'ta sabitleme ve C++ ile karşılaştırmaları da içeren programlama dillerinin karmaşıklıkları ve kısıtlamaları hakkında farklı bakış açılarını ifade ederek, programlama dili tasarımı ve yürütülmesinin doğasında bulunan karmaşıklıkları ve uzlaşmaları göstermektedir."
    ],
    "points": 185,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694958551
  },
  {
    "id": 37546255,
    "title": "Teknik Bağımsızlık",
    "originLink": "https://sive.rs/ti",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546255",
    "commentBody": "",
    "originSummary": [
      "Makale, kişinin dijital varlığı üzerinde kontrol sahibi olmak için Linux veya BSD işletim sistemleri gibi açık kaynak çözümlerinin kullanımını teşvik ederek teknoloji bağımsızlığı fikrini araştırıyor.",
      "Alan adı kaydetme, sunucu kurma ve e-posta yapılandırma gibi görevler hakkında ayrıntılı kılavuzlar sunarak veri veya işlevsellik kaybı olmadan kolay sağlayıcı değiştirmenin öneminin altını çiziyor.",
      "Eserde ayrıca Android ve Apple iPhone'lar için özel talimatların yanı sıra sorun giderme önerileri ve bireysel yeterliliği artırmaya yönelik değerli öğrenme kaynakları da yer alıyor."
    ],
    "commentSummary": [
      "Makale, daha basit, daha kullanıcı dostu ve erişilebilir kendi kendine barındırma çözümlerine duyulan ihtiyacı vurgulayarak teknoloji bağımsızlığı kavramını inceliyor.",
      "Mevcut P2P (Peer-to-Peer) sistemlerinin sınırlarının altını çizmekte, çeşitli platformları ve projeleri tanımlamakta ve web sitelerini ve kişisel dosyaları evde barındırmak için öneriler sunmakta ve dikkatli olunmasını tavsiye etmektedir.",
      "Makale, üçüncü taraf hizmetlerinin güvenilirliğine ilişkin zıt bakış açılarını ortaya çıkararak, bulut ana bilgisayar IP'sinin kullanımıyla mümkün olan teknoloji bağımsızlığı dereceleri üzerine bir tartışmayı teşvik etmektedir."
    ],
    "points": 166,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694965286
  },
  {
    "id": 37553193,
    "title": "OpenRA - Klasik strateji oyunları modern çağ için yeniden inşa edildi",
    "originLink": "https://www.openra.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553193",
    "commentBody": "",
    "originSummary": [
      "Gönüllülerin yürüttüğü bir proje olan OpenRA, Red Alert, Command & Conquer ve Dune 2000 gibi klasik gerçek zamanlı strateji oyunlarını Windows, macOS ve Linux'u yerel olarak destekleyen çağdaş sistemler için yeniden yapılandırdı.",
      "Oyunlar, geliştirilmiş oyun mekanikleri, mod desteği dahil çevrimiçi oyun ve yeni kampanyalar içeriyor. Bu proje açık kaynak geliştirme ve topluluk katkısı ile gelişmektedir.",
      "Son oyun testleri hata düzeltmeleri, yeni görevler, geliştirilmiş modlama desteği ve Command & Conquer Remastered Collection ile uyumlulukta ilerleme içeriyor. Herhangi bir sorunla ilgili geri bildirim geliştiriciler tarafından memnuniyetle karşılanmaktadır."
    ],
    "commentSummary": [
      "OpenRA, klasik strateji oyunlarını modern platformlara uyum sağlayacak şekilde yenilemeyi, kurulumu basitleştirmeyi ve platformlar arası uyumluluk sunmayı amaçlayan bir projedir.",
      "OpenRA, oyun mekaniklerini geliştirmiş ve orijinal oyunlardan varlıkları içe aktarma seçenekleri sunarak genel oyun deneyimini iyileştirmiştir.",
      "Proje, kullanıcılar arasında diğer klasik oyunların yeniden uygulanma olasılığı hakkında ilgi ve aktif tartışmalara yol açtı."
    ],
    "points": 162,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695020867
  },
  {
    "id": 37548599,
    "title": "Donut matematiği: donut.c nasıl çalışır?",
    "originLink": "https://www.a1k0n.net/2011/07/20/donut-math.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548599",
    "commentBody": "",
    "originSummary": [
      "Makale, bir torusu ışın izleme olmadan düşük çözünürlüklü ASCII sanatı olarak görselleştirmek için bir çerçeve arabelleği ve bir Z arabelleği kullanan 2006 tarihli \"donut\" koduna olan yenilenen ilgiyi detaylandırdı.",
      "3D perspektif oluşturmanın arkasındaki matematiğin ve her bir noktayı 2D ekrana yansıtma yönteminin bir açıklamasını sağladı.",
      "Yazı aynı zamanda orijinal kodu içeriyor ve ASCII ve tuval oluşturma için JavaScript kaynağına bir bağlantı içeriyor."
    ],
    "commentSummary": [
      "Makale, donut.c kodunun uygulanmasını diğer yaratıcı kodlama projeleriyle karşılaştırarak tartışıyor.",
      "Bu kodun belirli platformlarda nasıl derleneceğine ilişkin talimatların yanı sıra bazı derleme sorunlarının çözümleri de verilmektedir.",
      "Yorumlar bölümü, konuyla ilgili içgörülü tartışmaları ve paylaşılan kişisel deneyimleri içermektedir."
    ],
    "points": 161,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1694979520
  },
  {
    "id": 37549569,
    "title": "Booz Allen Neden Kendi Ulusal Parklarımızı Bize Geri Kiralıyor?",
    "originLink": "https://www.thebignewsletter.com/p/why-is-booz-allen-renting-us-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549569",
    "commentBody": "",
    "originSummary": [
      "Makale, danışmanlık firması Booz Allen'ın ABD federal topraklarına ve sularına erişim için Recreation.gov web sitesi üzerinden ücret talep etme uygulamasını mercek altına alıyor ve milli parkların kontrolü ve kâr elde edilmesi konusunda endişelere neden oluyor.",
      "Red Rock Kanyonu ziyaret ücretlerine itiraz eden bir dava, yüklenicinin ücretine karar vermek için kamuya açık bir yorum sürecini tetikledi.",
      "Yazar, kamu arazilerinin değerini ve Henry George'un felsefelerinin etkisini vurgulayarak bu tür uygulamalardan kaçınmak için daha sıkı düzenlemeler önermektedir."
    ],
    "commentSummary": [
      "Makale, işletmeci Booz Allen Hamilton'ın fiyat kırmak ve tekelden yararlanmakla suçlandığı Recreation.gov'un milli parkların kiralanması konusundaki anlaşmazlıkları inceliyor.",
      "Şeffaflık çağrılarının ortasında, eleştirmenler devlet web sitesi geliştirmede daha fazla rekabet ve gelir ve operasyonel maliyetlerin açık bir şekilde ifşa edilmesi çağrısında bulunuyor.",
      "Yazıda ayrıca, kamp alanları için tartışmalı çevrimiçi rezervasyon ücretleri de ele alınıyor; bazıları rezervasyon sistemini kâr amacı gütmeyen bir kuruluşun veya devlet kurumunun yönetmesini önerirken, diğerleri özel şirketlerin uyguladığı ücretleri ve sözleşmeleri sorguluyor."
    ],
    "points": 160,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1694986436
  },
  {
    "id": 37549259,
    "title": "Hush - Safari için Gürültüsüz Tarama",
    "originLink": "https://oblador.github.io/hush/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549259",
    "commentBody": "",
    "originSummary": [
      "Joel Arvidsson tarafından geliştirilen ücretsiz içerik engelleyici Noiseless Browsing, Mac, iPhone ve iPad'de Safari için kullanılabilir.",
      "Uygulama istenmeyen çerez ve gizlilik takibi bildirimlerini önlerken, kişisel veri toplamayarak kullanıcı gizliliğini sağlıyor.",
      "Hafif, hızlı, kullanımı kolay ve açık kaynaklı olarak tanıtılan bu yazılım aynı zamanda en son Apple teknolojisiyle de uyumludur."
    ],
    "commentSummary": [
      "Makale, Safari tarayıcısında reklamları ve çerez banner'larını engelleyebilen birden fazla uzantı ve tarayıcıyı tartışmaktadır.",
      "Çerez banner'ları ile ilgili kullanıcı rahatsızlıklarını ve Genel Veri Koruma Yönetmeliği (GDPR) kapsamındaki veri toplama kurallarını inceliyor.",
      "Tartışma, gizlilik ve yazılım araçlarının güvenliği ile ilgili endişeleri gündeme getirmekte, çevrimiçi gizlilik ve izleme ile ilgili mevcut tartışma ve kullanıcı tercihlerini vurgulamaktadır."
    ],
    "points": 146,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694984455
  },
  {
    "id": 37551175,
    "title": "Bitkiler sesi algılayabilir",
    "originLink": "https://www.economist.com/science-and-technology/2023/09/06/plants-dont-have-ears-but-they-can-still-detect-sound",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551175",
    "commentBody": "",
    "originSummary": [
      "Bilimsel çalışmalar, bitkilerin sesi algılayıp tepki verebildiğini ve potansiyel olarak kendilerinin de ses üretebildiğini göstermiştir.",
      "Çeşitli deneyler, farklı ses türlerinin bitki büyümesini ve stres bileşiği üretimini etkileyebileceğini ortaya koymaktadır. Örneğin, bir Asya çalısının Budist ilahilere maruz kaldıktan sonra yaprak boyutunda büyüme gösterdiği bildirilmiştir.",
      "Bazı seslerin bitkiler üzerinde olumsuz etkileri olabilir; bir çalışma trafik gürültüsüne maruz kalan bitkilerde bodur büyüme olduğunu göstermiştir."
    ],
    "commentSummary": [
      "Yapılan bir araştırma, Boquila trifoliolata bitki türünün sesleri tanımlama kapasitesine sahip olduğunu keşfetti, ancak bunun arkasındaki mekanizma hala tartışılıyor.",
      "Uzmanlar arasında çalışmanın tasarımı ve yorumu konusunda, özellikle de bitkilerdeki tüm duyuların bir dokunma biçimi olarak sınıflandırılıp sınıflandırılamayacağı konusunda anlaşmazlıklar var.",
      "Laboratuvar ortamında trafik gürültüsünün bitkiler üzerindeki etkisini inceleyen ayrı bir deneyde de görüldüğü üzere, sözde bilimsel iddialara yönelik şüphecilik mevcuttur ve daha titiz araştırma yapılması çağrısında bulunulmaktadır."
    ],
    "points": 137,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1695000586
  },
  {
    "id": 37546689,
    "title": "1994'teki gibi gezinmek: Mac SE, ImageWriter II'yi modern bir LAN'a entegre etmek",
    "originLink": "https://connor.zip/posts/2023-08-04-localtalk-ethernet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546689",
    "commentBody": "",
    "originSummary": [
      "Yazar, 1994 yılına benzer bir internet tarama deneyimini yeniden yaratmak için eski Macintosh bilgisayarları ve AppleTalk protokollerini kullanma deneyimini anlatıyor.",
      "Metin, Apple protokollerinin Linux uygulaması olan Netatalk 2.x'in kurulumu ve yapılandırılması hakkında bir rehber sunmakta ve eski bir Macintosh bilgisayarı çevrimiçi hale getirme sürecini açıklamaktadır.",
      "Ayrıca belirli tarayıcıların kullanımına, IPv4 Link-Local adresleme kullanmanın avantajlarına ve yazıcıları yeni Mac aygıtlarına bağlama yöntemlerine de değiniyor."
    ],
    "commentSummary": [
      "Makale, eski bir Mac SE ve ImageWriter II'nin modern bir Yerel Alan Ağına (LAN) entegre edilmesine odaklanıyor ve 90'lı yıllarda Localtalk ve PhoneNET kullanımını yeniden gözden geçiriyor.",
      "Katılımcılar, eski yazıcıların kullanımı ve modern ağlara bağlantıları da dahil olmak üzere eski Mac'ler ve çevre birimleriyle ilgili değerli deneyimlerini paylaşıyor.",
      "Tartışmada ayrıca eski makinelerle internette gezinme ve geçmişteki favori kelime işlem yazılımlarını anma konularına da değiniliyor."
    ],
    "points": 136,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1694967608
  }
]
