[
  {
    "id": 37546874,
    "title": "CatalaLang / catala: لغة برمجة لمواصفات القانون",
    "originLink": "https://github.com/CatalaLang/catala",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546874",
    "commentBody": "",
    "originSummary": [
      "Catala هي لغة جديدة خاصة بالمجال يمكنها إنشاء خوارزميات من المستندات القانونية ، مما يضمن دقة عالية بين الكود والقانون.",
      "تم تصميم اللغة لتعكس الهيكل المنطقي للقانون ، مما يجعلها متاحة للمراجعة والتصديق من قبل المهنيين القانونيين ؛ حتى أنه يحتوي على مترجم يقوم بإنشاء ملفات PDF يمكن قراءتها من قبل المحامي.",
      "سمي مشروع كاتالا على اسم بيير كاتالا ، الرائد في مجال التكنولوجيا القانونية الفرنسية ، وهو مبادرة بحثية بقيادة إنريا ، المعهد الوطني الفرنسي لبحوث علوم الكمبيوتر. ومع ذلك ، لا يزال المترجم غير مستقر ومحدود الميزات."
    ],
    "commentSummary": [
      "تركز المحادثة على استخدام لغة كاتالا ، وهي لغة برمجة ، في تحديد القوانين والوثائق القانونية ، مع التركيز على فوائدها وعيوبها والتحديات المحتملة لترجمة اللغة الإنجليزية إلى نظام منطقي رسمي.",
      "هناك جدل حول استخدام الكود كمنظم ، وتعقيد الكود القانوني ، واستخدام رموز الترميز في الاتفاقيات القانونية ، ومفهوم ترميز النية في القوانين باستخدام لغات البرمجة.",
      "وناقش المشاركون فكرة كتابة نصوص قانونية واضحة، ودور لغة خاصة بالمجال للعقود القانونية، ومقارنة تطوير البرمجيات بالنظام القانوني، والمخاوف بشأن اختيار الاسم للغات البرمجة هذه."
    ],
    "points": 418,
    "commentCount": 251,
    "retryCount": 0,
    "time": 1694968469
  },
  {
    "id": 37546810,
    "title": "قم بتشغيل LLMs في المنزل ، على غرار BitTorrent",
    "originLink": "https://petals.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546810",
    "commentBody": "",
    "originSummary": [
      "Petals عبارة عن نظام أساسي يتيح للمستخدمين تشغيل نماذج اللغات الكبيرة - مثل Llama 2 و Falcon و BLOOM - على أجهزتهم باستخدام وحدة معالجة الرسومات من فئة المستهلك أو Google Colab.",
      "تتيح المنصة لمستخدميها الانضمام إلى شبكة لخدمة أجزاء مختلفة من النموذج وتكييف النماذج لمهام متنوعة ، مما يوفر واجهة برمجة تطبيقات وخيارات مرنة مع PyTorch و Hugging Face Transformers.",
      "تم تسليط الضوء على مشروع Petals في ورشة عمل BigScience البحثية ، مما يشير إلى مساهمته الكبيرة في مجال تطوير نموذج اللغة."
    ],
    "commentSummary": [
      "تبحث المقالة في إمكانية تشغيل نماذج اللغات الكبيرة (LLMs) في المنزل باستخدام طريقة على غرار BitTorrent عن طريق تجميع موارد الحوسبة ، وإنشاء نماذج مشتقة ، واستخدام الضبط الدقيق الفعال للمعلمات ومنهجية LoRA.",
      "تتم مناقشة الصعوبات والتكاليف المرتبطة بتدريب النماذج الكبيرة ، مع الحلول الممكنة مثل تبريد المياه وتعديل بطاقات الخادم القديمة. كما يتم تناول مفاهيم مثل الحوسبة اللامركزية ونماذج الضبط الدقيق.",
      "هناك ذكر ل Petals ، وهي خدمة لتشغيل LLMs على الأجهزة المنخفضة الجودة ، مع مراجعات مختلطة بين المشاركين. يتكهن المقال حول الاستخدام المحتمل للرموز والحوسبة اللامركزية لدعم LLMs مفتوحة المصدر في المستقبل."
    ],
    "points": 402,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1694968203
  },
  {
    "id": 37548720,
    "title": "بريان باكلو نقل كهوف القدس من الوحدة إلى غودو",
    "originLink": "https://twitter.com/unormal/status/1703163364229161236",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548720",
    "commentBody": "",
    "originSummary": ["تشير التغريدة إلى خطة الفرد للمشاركة في أنشطة غير مسؤولة وتؤرخ الأضرار اللاحقة التي يلحقونها."],
    "commentSummary": [
      "يقوم Brian Bucklew بنقل لعبة Caves of Qud من Unity إلى Godot ، وهي خطوة تم استقبالها جيدا بسبب طبيعة Godot سهلة الاستخدام وفوائدها في تطوير الأدوات وتطبيق رسومات 2D.",
      "على الرغم من عدم وجود نظام بيئي لمتجر وسوق يشبه Unity ، إلا أن الجهود جارية لتصحيح هذه المشكلة.",
      "يسلط المؤلف الضوء على التحديات في استخدام الرسومات المتجهة القابلة للتطوير (SVG) في محركات الألعاب ويقترح استخدام مكتبات العرض كحل."
    ],
    "points": 274,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1694980438
  },
  {
    "id": 37545313,
    "title": "مقتل ما يقرب من 2 ألف ناشط بيئي خلال العقد الماضي",
    "originLink": "https://e360.yale.edu/digest/environmental-defenders-murdered-2022",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545313",
    "commentBody": "",
    "originSummary": [
      "تسلط جلوبال ويتنس، في تقرير صدر مؤخرا، الضوء على الاتجاه المقلق لقتل الناشطين البيئيين، ما يقرب من 2000 في جميع أنحاء العالم بين عامي 2012 و 2022، مع 177 حادثة في عام 2022 وحده.",
      "تم تحديد أمريكا اللاتينية ، وخاصة كولومبيا ، على أنها عالية المخاطر بالنسبة للنشطاء البيئيين ، حيث أبلغت البرازيل والمكسيك وهندوراس والفلبين أيضا عن ارتفاع معدلات الوفيات. وشكل السكان الأصليون ثلث الضحايا، مما يؤكد دورهم الحاسم في التخفيف من آثار تغير المناخ.",
      "ويشدد التقرير على الحاجة الملحة إلى حماية ومساعدة أولئك الذين يدافعون عن حماية البيئة."
    ],
    "commentSummary": [
      "وتسلط المناقشات الضوء على مجموعة من الموضوعات مثل المخاطر التي تواجه الناشطين البيئيين، والدور الحاسم لثقافات السكان الأصليين في الحفاظ على البيئة، واستراتيجيات وسمعة نشطاء المناخ.",
      "كما يتعمقون في القضايا المتعلقة بالآثار الأخلاقية للكوارث البيئية التي من صنع الإنسان ، وظاهرة حصانة الشرطة وتأثيرها على العدالة الجنائية ، وملكية الأسلحة النارية وجرائم القتل ذات الصلة ، والمخاوف بشأن مصداقية وسائل الإعلام والدعاية.",
      "كما أن مقتل مانويل إستيبان بايز تيران بالرصاص على يد ضباط الشرطة هو أيضا موضوع بارز، حيث تؤكد المحادثات على وجهات نظر ووجهات نظر مختلفة، مما يؤكد الجدل والتعقيد في هذه الموضوعات."
    ],
    "points": 274,
    "commentCount": 271,
    "retryCount": 0,
    "time": 1694960272
  },
  {
    "id": 37553574,
    "title": "ماذا لو استخدم OpenDocument SQLite؟",
    "originLink": "https://www.sqlite.org/affcase1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553574",
    "commentBody": "",
    "originSummary": [
      "تقترح المقالة فكرة استخدام SQLite ، وهي مكتبة برامج توفر نظام إدارة قواعد بيانات علائقية ، كحاوية لملفات OpenDocument Presentation ، بدلا من تنسيق أرشيف ZIP الحالي.",
      "يقترح تحسينات محتملة ، مثل تقسيم المحتوى إلى أجزاء أصغر وإضافة إمكانات الإصدار ، والتي يمكن تسهيلها بواسطة هذا التبديل.",
      "يؤكد المؤلف على فوائد استخدام SQLite كتنسيق ملف تطبيق ، بما في ذلك تجربة المستخدم المحسنة والأداء ، وبالتالي زيادة كفاءة التطبيقات."
    ],
    "commentSummary": [
      "يدور الخطاب حول استخدام SQLite كتنسيق ملف ل OpenDocument ، ومقارنة نقاط قوته وقيوده مقابل التنسيقات الأخرى مثل XML.",
      "يشكل افتقار SQLite إلى التوحيد القياسي تحديات للتشغيل البيني وتوحيد ISO ، على الرغم من وظائفه الأكبر.",
      "تغطي المحادثة أيضا مفهوم الحفظ التلقائي لبيانات المستخدم ، وتقنيات حفظ البيانات ، والمزايا والعيوب المحتملة ل SQLite في سياقات مختلفة ، مع التأكيد على الحاجة إلى التوازن بين الحفظ التلقائي وتحكم المستخدم."
    ],
    "points": 262,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1695024681
  },
  {
    "id": 37551474,
    "title": "مقدمة في أنظمة لينكس غير القابلة للتغيير",
    "originLink": "https://dataswamp.org/~solene/2023-07-12-intro-to-immutable-os.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551474",
    "commentBody": "",
    "originSummary": [
      "تتعمق المقالة في مفهوم أنظمة Linux غير القابلة للتغيير ، وتستكشف تطبيقات محددة مثل NixOS و Guix و Endless OS و Fedora Silverblue.",
      "تتم مناقشة السمات الفريدة لكل نظام ، بما في ذلك مديري الحزم وقدرات التراجع ؛ كما يتم تبادل الخبرات والآراء الشخصية.",
      "على الرغم من الإشارة إلى الشعبية المتزايدة لأنظمة التشغيل غير القابلة للتغيير في مجال المصادر المفتوحة ، يشير المقال أيضا إلى التحديات المرتبطة والاستراتيجيات المختلفة للثبات."
    ],
    "commentSummary": [
      "تستكشف هذه المقالة فكرة أنظمة Linux غير القابلة للتغيير ، وتقدم العديد من التوزيعات التي تنفذ هذا النموذج ، بما في ذلك EndlessOS و Fedora CoreOS.",
      "تتم مناقشة إيجابيات وسلبيات استخدام الأنظمة غير القابلة للتغيير مقابل الأنظمة القابلة للتغيير ، والتي تغطي جوانب مثل إدارة الحزم والتخصيص والتحكم في النظام.",
      "تتم مشاركة تجارب المستخدمين ووجهات نظرهم حول NixOS و Fedora ، مع مراعاة عوامل مثل إمكانية الوصول والتوافق وإجراءات التراجع."
    ],
    "points": 255,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1695003570
  },
  {
    "id": 37546766,
    "title": "أشياء غير موجودة في Dimension Apple",
    "originLink": "https://maxread.substack.com/p/a-literary-history-of-fake-texts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546766",
    "commentBody": "",
    "originSummary": [
      "يناقش المقال الموضوعات والشخصيات المتكررة في المواد التسويقية لشركة Apple ، مع التركيز بشكل خاص على تصوير المحادثات النصية المزيفة.",
      "يشير المؤلف إلى الثقافة المتميزة في هذه المحادثات الخيالية ، والتي تتميز بغياب السخرية والتركيز على مشاركة الصور وتنظيم الأحداث الاجتماعية.",
      "إنه يتكهن بعالم مواز يسمى \"Dimension Apple\" ، يشبه تجارب معينة في مجموعات WhatsApp الأم ، ويتضمن مجموعة من لقطات الشاشة لنصوص Apple المزيفة."
    ],
    "commentSummary": [
      "يستعرض المقال بشكل نقدي صور الرسائل النصية في موارد التسويق الخاصة بشركة Apple ويقارنها بكيفية تفاعل الأفراد حقا.",
      "تدور المناقشات حول ما إذا كانت استراتيجية الاتصال الخاصة بشركة Apple تعكس الواقع ، وتناقص استخدام تكامل الوسائط الاجتماعية في تسويق الشركة ، وقيود مشاركة ملفات الصور الكبيرة عبر تطبيقات المراسلة.",
      "هناك أيضا تكهنات بشأن غياب Apple عن حشد الشركات التي تقدم خدمات وسائل التواصل الاجتماعي."
    ],
    "points": 238,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1694968008
  },
  {
    "id": 37546469,
    "title": "ملاحظات زيت الفلفل الحار",
    "originLink": "https://uptointerpretation.com/posts/chili-oil-notes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546469",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف رؤيتهم حول تحضير زيت الفلفل الحار ، واستكشاف طرق الاستخراج المختلفة مثل الفلاش الساخن والتسريب البطيء.",
      "يتم فحص العلاقة بين درجات الحرارة المختلفة وأنواع الزيت والنكهة الناتجة.",
      "يقترح المنشور تجربة العديد من الفلفل الحار والتوابل والتوابل لاكتشاف الفروق الدقيقة المميزة لزيت الفلفل الحار."
    ],
    "commentSummary": [
      "تحدد المقالة الرئيسية طريقة مقترحة لصنع زيت الفلفل الحار ، بالإضافة إلى تقنيات بديلة مثل sous vide.",
      "في التعليقات ، يشارك المشاركون الخبرات الشخصية ووجهات النظر حول صنع زيت الفلفل الحار ، مع مناقشات حول تدابير السلامة وملامح النكهة.",
      "تنحرف المحادثات إلى مواضيع أخرى مثل صنع الشاي وسلامة الأغذية والدور الحاسم لاتساق الطحن والمطاحن عالية الجودة في تخمير القهوة."
    ],
    "points": 235,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1694966406
  },
  {
    "id": 37549745,
    "title": "تبلغ قيمة AWS IPv4 Estate الآن 4.5 مليار دولار أمريكي",
    "originLink": "https://toonk.io/aws-ipv4-estate-now-worth-4-5-billion/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549745",
    "commentBody": "",
    "originSummary": [
      "زادت Amazon Web Services (AWS) عدد عناوين IPv4 بمقدار 27 مليون ، مما أدى إلى إجمالي 128 مليون ؛ يجعل ممتلكاتهم IPv4 تبلغ قيمتها حوالي 4.5 مليار دولار ، بزيادة كبيرة عن 3 سنوات مضت.",
      "والجدير بالذكر أن كل عنوان IPv4 يقدر بقيمة 35 دولارا بسبب الندرة المتزايدة وتكلفة عناوين IPv4.",
      "خططت AWS لفرض رسوم على العملاء مقابل عناوين IPv4 بمعدل 0.005 دولار لكل IP في الساعة ، مما قد يولد إيرادات سنوية تقدر بنحو 500 مليون دولار إلى 1 مليار دولار."
    ],
    "commentSummary": [
      "يناقش المنشور الصعوبات والإحباطات التي تمت مواجهتها في الانتقال من IPv4 إلى IPv6 ، بما في ذلك المخاوف بشأن التوافق وترقيات الشبكة واعتماد مزودي خدمة الإنترنت بشكل أبطأ من المتوقع.",
      "هناك مناقشات حول الحلول البديلة ، مثل تمديد IPv4 أو إنشاء إصدار جديد ، وانتقادات حول تعقيد عناوين IPv6 وقابليتها للاستخدام ، فضلا عن عدم وجود دافع اقتصادي للهجرة.",
      "يسلط المنشور الضوء أيضا على النقص في عناوين IPv4 وإمكانية السلوك المناهض للمنافسة من المشاركين الرئيسيين ، مما يشير إلى الحاجة إلى عملية تحويل أكثر سلاسة وحل أكثر سهولة في الاستخدام."
    ],
    "points": 212,
    "commentCount": 334,
    "retryCount": 0,
    "time": 1694988059
  },
  {
    "id": 37548975,
    "title": "نادي موقع البيرة",
    "originLink": "https://indieweb.org/Homebrew_Website_Club",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548975",
    "commentBody": "",
    "originSummary": [
      "Homebrew Website Club عبارة عن شبكة عالمية من اللقاءات المصممة لمساعدة الأفراد على اكتساب المزيد من التحكم في تجربتهم عبر الإنترنت ، لا سيما فيما يتعلق بالتدوين.",
      "يتضمن المورد تفاصيل حول اللقاءات الأخيرة والمستقبلية ، ويقدم معلومات مثل التواريخ والمنظمين والأماكن والأدلة لترتيب الاجتماعات الافتراضية والمادية.",
      "طوال فترة الوباء ، انتقل النادي إلى التجمعات عبر الإنترنت ويوفر الموارد لتنظيم IndieWebCamps ، والجهود المستقلة لبناء مواقع الويب الخاصة بدلا من استخدام خدمات الويب المركزية."
    ],
    "commentSummary": [
      "يركز الحوار على تصميمات مواقع الويب البسيطة مع تقليل استخدام جافا سكريبت وأهمية لافتات الموافقة.",
      "يعبر المشاركون عن ولعهم بنادي موقع Homebrew ، وملكية موقع الويب الشخصي ، وإنشاء تصميمات ويب مبتكرة باستخدام أدوات مثل React و Angular.",
      "يؤكد الحديث على قيمة الإبداع والتخصيص في مشهد الويب الحالي ، والذي يتضمن امتلاك مواقع ويب شخصية وحضور أحداث IndieWeb."
    ],
    "points": 204,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1694982354
  },
  {
    "id": 37549216,
    "title": "نماذج لغوية كبيرة لتحسين المترجم",
    "originLink": "https://arxiv.org/abs/2309.07062",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549216",
    "commentBody": "",
    "originSummary": [
      "تبحث الورقة في تطبيق نماذج اللغة الكبيرة (LLMs) في تحسين الكود ، باستخدام نموذج محول معلمة 7 مليارات لتحسين حجم رمز تجميع الجهاز الظاهري منخفض المستوى (LLVM).",
      "يتم تدريب النموذج على التنبؤ بأعداد التعليمات قبل وبعد التحسين ، وبالتالي توفير التعليمات البرمجية المحسنة.",
      "كشفت الاختبارات التي أجريت على مجموعة واسعة من البرامج عن تحسن بنسبة 3.0٪ مقارنة بالمترجم التقليدي ، مما يعرض قدرات التفكير القوية للنموذج في الكود."
    ],
    "commentSummary": [
      "يطرح الملخص المناقشات حول مزايا وقيود استخدام نماذج تعلم اللغة (LLMs) في تحسين المترجم ، مثل تقليل عدد التعليمات وإنشاء رمز قابل للتجميع.",
      "كما يناقش المخاوف المتعلقة بدلالات الكود وصحته عند استخدام LLMs ، إلى جانب تحديات مثل الحاجة إلى مجموعات بيانات أكبر.",
      "يشير النص إلى مزيد من الحوارات حول استخدام الذكاء الاصطناعي في تحسين المجمعين ، والمخاطر المرتبطة ، والتحقيق في وظائف LLMs في مراحل مختلفة من عملية التجميع."
    ],
    "points": 197,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1694984120
  },
  {
    "id": 37546241,
    "title": "كيف لم يجلب جهاز Mac البرمجة للناس",
    "originLink": "https://eclecticlight.co/2023/09/16/how-the-mac-didnt-bring-programming-to-the-people/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546241",
    "commentBody": "",
    "originSummary": [
      "تتعمق هذه المقالة في تاريخ لغات البرمجة على منصات Mac ومحاولاتها الفاشلة لجعل الترميز أكثر سهولة لعامة الناس.",
      "يتم التركيز على Prograph ، وهي لغة برمجة مرئية ، مما يشير إلى أن لغة بصرية مماثلة ولكن أكثر كفاءة قد تحدث تحولا كبيرا في هذا المجال.",
      "يشير المؤلف إلى أنه على الرغم من بعض العناصر المثيرة للاهتمام في لغات مثل Swift ، فإن تأثير Mac على مجال البرمجة لا يزال محدودا مقارنة بتأثيره في النشر المكتبي."
    ],
    "commentSummary": [
      "تركز المناقشة على جهود Apple لجعل البرمجة في متناول المستخدمين العاديين ، مما يوضح التحديات التي حدثت أثناء تعلم البرمجة على أجهزة كمبيوتر Mac خلال 90s.",
      "ويسلط الضوء على التناقضات بين استراتيجيات أبل ومايكروسوفت تجاه تطوير البرمجيات، مما يؤكد أهمية رعاية البيئات التي تبسط البرمجة وتمكن المستخدمين.",
      "تعكس المحادثة القيود المفروضة على أدوات البرمجة المحددة والتناقض المحدد بين مختلف أشكال الأتمتة والبرمجة النصية ، مما يوفر وجهات نظر متنوعة حول البرمجة وتجارب المستخدم عبر منصات وأدوات متعددة."
    ],
    "points": 195,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1694965242
  },
  {
    "id": 37545040,
    "title": "تغيير قواعد الصدأ",
    "originLink": "https://without.boats/blog/changing-the-rules-of-rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37545040",
    "commentBody": "",
    "originSummary": [
      "يفحص هذا المنشور قرارات واجهة برمجة التطبيقات وسمات العلامات في لغة برمجة Rust ، مع التركيز بشكل خاص على سمات الإرسال والنقل والتسرب.",
      "يفكر المؤلف في دمج سمة تسرب إلى Rust ولكنه يعارضها بسبب تحديات الارتباك والتوافق المحتملة التي قد تخلقها.",
      "على الرغم من الأسف لعدم دمج سمة التسرب في وقت سابق ، يقر المؤلف بالتعقيدات في تنفيذ هذه التعديلات في المرحلة الحالية."
    ],
    "commentSummary": [
      "يؤكد منتدى RustHacker على تحديات إجراء تعديلات في Rust ، فيما يتعلق بشكل أساسي بالصدأ غير المتزامن ، نظرا لعدم وجود سمة نمط Leak ، مما يستلزم حلولا بديلة.",
      "هناك خطاب مستمر حول الآثار المترتبة على استيعاب المجمعين الذين عفا عليهم الزمن ، والعلاجات المحتملة ، واحتمال الكشف عن تكرار جديد ل Rust يمكن مقارنته بجافا سكريبت و TypeScript.",
      "يعبر المشاركون عن وجهات نظر متنوعة حول تعقيدات وقيود لغات البرمجة ، والتي تشمل التثبيت في Rust والمقارنات مع C ++ ، مما يدل على التعقيدات والتنازلات المتأصلة في تصميم لغة البرمجة وتنفيذها."
    ],
    "points": 185,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1694958551
  },
  {
    "id": 37546255,
    "title": "الاستقلال التقني",
    "originLink": "https://sive.rs/ti",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546255",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال فكرة الاستقلال التكنولوجي ، ويشجع على استخدام حلول مفتوحة المصدر مثل أنظمة التشغيل Linux أو BSD للتحكم في التواجد الرقمي.",
      "يوفر أدلة مفصلة حول مهام مثل تسجيل المجال وإعداد الخادم وتكوين البريد الإلكتروني. التأكيد على أهمية التبديل السهل بين مقدمي الخدمات دون فقدان البيانات أو الوظائف.",
      "تتضمن المقالة أيضا إرشادات محددة لأجهزة Android و Apple iPhone ، إلى جانب اقتراحات لاستكشاف الأخطاء وإصلاحها وموارد تعليمية قيمة لتعزيز الكفاءة الفردية."
    ],
    "commentSummary": [
      "يتعمق المقال في مفهوم الاستقلال التكنولوجي ، مع التأكيد على الحاجة إلى حلول استضافة ذاتية أبسط وأكثر سهولة في الاستخدام ويمكن الوصول إليها.",
      "إنه يؤكد على قيود أنظمة P2P (نظير إلى نظير) الحالية ، ويصف العديد من المنصات والمشاريع ، ويقدم اقتراحات لمواقع الاستضافة الذاتية والملفات الشخصية في المنزل ، وينصح بالحذر.",
      "تعزز المقالة نقاشا حول درجات الاستقلال التكنولوجي الممكنة باستخدام IP للمضيف السحابي ، مما يثير وجهات نظر متناقضة حول موثوقية خدمات الطرف الثالث."
    ],
    "points": 166,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694965286
  },
  {
    "id": 37553193,
    "title": "OpenRA - ألعاب استراتيجية كلاسيكية أعيد بناؤها للعصر الحديث",
    "originLink": "https://www.openra.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37553193",
    "commentBody": "",
    "originSummary": [
      "أعاد OpenRA ، وهو مشروع يحركه المتطوعون ، بناء الألعاب الإستراتيجية الكلاسيكية في الوقت الفعلي مثل Red Alert و Command &Conquer و Dune 2000 للأنظمة المعاصرة ، ودعم Windows و macOS و Linux أصلا.",
      "تتميز الألعاب بآليات لعب محسنة ، واللعب عبر الإنترنت بما في ذلك دعم التعديل ، والحملات الجديدة. يزدهر هذا المشروع على تطوير المصادر المفتوحة ومساهمة المجتمع.",
      "يتضمن أحدث اختبار لعب لهم إصلاحات للأخطاء ومهام جديدة ودعم تعديل محسن وحركة أمامية متوافقة مع مجموعة Command &Conquer Remastered. نرحب بالتعليقات على أي مشكلات من قبل المطورين."
    ],
    "commentSummary": [
      "OpenRA هو مشروع يهدف إلى تجديد الألعاب الإستراتيجية الكلاسيكية لاستيعاب المنصات الحديثة ، وتبسيط التثبيت وتقديم التوافق عبر الأنظمة الأساسية.",
      "قام OpenRA بتحسين آليات اللعبة ويوفر خيارات لاستيراد الأصول من الألعاب الأصلية ، وبالتالي تحسين تجربة الألعاب بشكل عام.",
      "أثار المشروع الاهتمام والمناقشات النشطة بين المستخدمين حول إمكانية إعادة تنفيذ الألعاب الكلاسيكية الأخرى."
    ],
    "points": 162,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1695020867
  },
  {
    "id": 37548599,
    "title": "دونات الرياضيات: كيف يعمل donut.c",
    "originLink": "https://www.a1k0n.net/2011/07/20/donut-math.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37548599",
    "commentBody": "",
    "originSummary": [
      "فصلت المقالة الاهتمام المتجدد برمز \"دونات\" من عام 2006 ، والذي يستخدم Framebuffer و Z-buffer لتصور الجذع على أنه فن ASCII منخفض الدقة دون تتبع الأشعة.",
      "قدم شرحا للرياضيات وراء تقديم منظور 3D وطريقة إسقاط كل نقطة على شاشة 2D.",
      "تحتوي القطعة أيضا على الكود الأصلي وتتضمن رابطا إلى مصدر JavaScript ل ASCII وعرض اللوحة."
    ],
    "commentSummary": [
      "يناقش المقال تنفيذ كود donut.c ، ومقارنته بمشاريع الترميز الإبداعية الأخرى.",
      "يتم توفير إرشادات حول كيفية تجميع هذا الرمز على منصات محددة ، إلى جانب حلول لبعض مشكلات التجميع.",
      "يشتمل قسم التعليقات على مناقشات ثاقبة وتجارب شخصية مشتركة تتعلق بالموضوع."
    ],
    "points": 161,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1694979520
  },
  {
    "id": 37549569,
    "title": "لماذا تستأجرنا بوز ألن حدائقنا الوطنية الخاصة بنا؟",
    "originLink": "https://www.thebignewsletter.com/p/why-is-booz-allen-renting-us-back",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549569",
    "commentBody": "",
    "originSummary": [
      "يدقق المقال في ممارسة شركة الاستشارات Booz Allen المتمثلة في فرض رسوم عبر موقع Recreation.gov للوصول إلى الأراضي والمياه الفيدرالية الأمريكية ، مما يسبب مخاوف بشأن السيطرة والربح من المتنزهات الوطنية.",
      "أدت دعوى قضائية تطعن في رسوم زيارة Red Rock Canyon إلى عملية تعليق عام لاتخاذ قرار بشأن مكافأة المقاول.",
      "يوصي المؤلف بلوائح أكثر صرامة لتجنب مثل هذه الممارسات ، مع التركيز على قيمة الأراضي العامة وتأثير فلسفات هنري جورج."
    ],
    "commentSummary": [
      "يبحث المقال في النزاعات حول تعامل Recreation.gov مع إيجارات المتنزهات الوطنية ، حيث يتهم المشغل Booz Allen Hamilton بالتلاعب في الأسعار واستغلال الاحتكار.",
      "وسط دعوات للشفافية، يحث النقاد على مزيد من المنافسة في تطوير المواقع الحكومية والكشف الواضح عن الإيرادات والتكاليف التشغيلية.",
      "يتناول المقال أيضا رسوم الحجز عبر الإنترنت المثيرة للجدل لمواقع التخييم ، حيث يقترح البعض أن كيانا غير ربحي أو مؤسسة حكومية يجب أن تدير نظام الحجز ، بينما يشكك آخرون في الرسوم والعقود التي تفرضها الشركات الخاصة."
    ],
    "points": 160,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1694986436
  },
  {
    "id": 37549259,
    "title": "الصمت - تصفح بلا ضوضاء ل Safari",
    "originLink": "https://oblador.github.io/hush/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37549259",
    "commentBody": "",
    "originSummary": [
      "التصفح بلا ضوضاء، مانع محتوى مجاني من جويل أرفيدسون متاح لرحلات السفاري على أجهزة Mac و iPhone و iPad.",
      "يمنع التطبيق ملفات تعريف الارتباط غير المرغوب فيها وإشعارات تتبع الخصوصية ، وفي الوقت نفسه لا يجمع البيانات الشخصية ، مما يضمن خصوصية المستخدم.",
      "يتم الإعلان عنه على أنه خفيف الوزن وسريع وسهل الاستخدام ومفتوح المصدر ، كما أنه متوافق مع أحدث تقنيات Apple."
    ],
    "commentSummary": [
      "تناقش المقالة العديد من الإضافات والمتصفحات القادرة على حظر الإعلانات ولافتات ملفات تعريف الارتباط على متصفح Safari.",
      "إنه يتعمق في غضب المستخدم فيما يتعلق بشعارات ملفات تعريف الارتباط وقواعد جمع البيانات بموجب اللائحة العامة لحماية البيانات (GDPR).",
      "تثير المناقشة مخاوف بشأن الخصوصية وسلامة أدوات البرامج ، وتسلط الضوء على النقاش الحالي وتفضيلات المستخدم حول الخصوصية والتتبع عبر الإنترنت."
    ],
    "points": 146,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1694984455
  },
  {
    "id": 37551175,
    "title": "يمكن للنباتات اكتشاف الصوت",
    "originLink": "https://www.economist.com/science-and-technology/2023/09/06/plants-dont-have-ears-but-they-can-still-detect-sound",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37551175",
    "commentBody": "",
    "originSummary": [
      "أظهرت الدراسات العلمية أن النباتات يمكنها اكتشاف الصوت والتفاعل معه ، وربما تنتج الصوت بنفسها.",
      "تكشف التجارب المختلفة أن أنواع الصوت المختلفة يمكن أن تؤثر على نمو النبات وإنتاج مركب الإجهاد. على سبيل المثال ، ورد أن شجيرة آسيوية أظهرت نموا في حجم الورقة بعد التعرض للهتافات البوذية.",
      "يمكن أن يكون لبعض الأصوات آثار سلبية على النباتات ، حيث أظهرت دراسة توقف النمو في النباتات المعرضة لضوضاء المرور."
    ],
    "commentSummary": [
      "اكتشفت دراسة أن أنواع Boquila trifoliolata من النباتات لديها القدرة على تحديد الأصوات ، على الرغم من أن الآلية الكامنة وراء ذلك لا تزال قيد المناقشة.",
      "هناك خلاف بين الخبراء حول تصميم الدراسة وتفسيرها ، خاصة حول موضوع ما إذا كان يمكن تصنيف جميع الحواس في النباتات كشكل من أشكال اللمس.",
      "الشكوك حول الادعاءات العلمية الزائفة موجودة ، مع دعوات لإجراء أبحاث أكثر صرامة ، كما يتضح من تجربة منفصلة تدرس تأثير ضوضاء المرور على النباتات في بيئة معملية."
    ],
    "points": 137,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1695000586
  },
  {
    "id": 37546689,
    "title": "التصفح كما هو الحال في عام 1994: دمج Mac SE و ImageWriter II في شبكة LAN حديثة",
    "originLink": "https://connor.zip/posts/2023-08-04-localtalk-ethernet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37546689",
    "commentBody": "",
    "originSummary": [
      "يروي المؤلف تجربة استخدام أجهزة كمبيوتر Macintosh القديمة وبروتوكولات AppleTalk لإعادة إنشاء تجربة تصفح الإنترنت على غرار عام 1994.",
      "يوفر النص دليلا حول تثبيت وتكوين Netatalk 2.x ، وهو تطبيق Linux لبروتوكولات Apple ، ويشرح عملية الحصول على كمبيوتر Macintosh قديم عبر الإنترنت.",
      "كما يتطرق إلى استخدام متصفحات محددة ، ومزايا استخدام IPv4 Link-Local عنونة ، وطرق توصيل الطابعات بأجهزة Mac الأحدث."
    ],
    "commentSummary": [
      "تركز المقالة على دمج جهاز Mac SE و ImageWriter II في شبكة محلية حديثة (LAN) وتعيد النظر في استخدام Localtalk و PhoneNET خلال '90s.",
      "يشارك المشاركون تجاربهم العزيزة مع أجهزة Mac والأجهزة الطرفية القديمة ، بما في ذلك استخدام الطابعات القديمة واتصالها بالشبكات الحديثة.",
      "تتطرق المناقشة أيضا إلى تصفح الإنترنت باستخدام آلات قديمة وذكريات برامج معالجة النصوص المفضلة من الماضي."
    ],
    "points": 136,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1694967608
  }
]
