[
  {
    "title": "Blockchain Gaming Companies Secure Series Funding, Paving the Way for Innovation and Growth",
    "originLink": "https://blockchainmagazine.net/top-10-blockchain-gaming-companies-that-got-series-funding-in-2023/",
    "originBody": "Top 10 Blockchain Gaming Companies That Got Series Funding In 2023 Blockchain Gaming News November 10, 2023 by Diana Ambolis No Comments Share Tweet Share Share Pin it Blockchain gaming is an emerging concept that combines blockchain technology with video games, creating a new paradigm for interactive entertainment. It introduces decentralized and transparent systems that offer unique benefits to both players and developers. In traditional gaming, players have limited control over in-game assets, and the ownership of these assets is usually controlled by the game’s publisher. However, blockchain gaming aims to revolutionize this by providing true ownership and control of in-game assets to the players themselves. At its core, blockchain gaming utilizes the decentralized nature of blockchain technology to enable peer-to-peer transactions and verifiable ownership of in-game assets. In a blockchain game, the game assets are represented as non-fungible tokens (NFTs) or digital collectibles. NFTs are unique tokens that can represent various in-game items such as characters, weapons, skins, virtual real estate, and more. Each NFT is indivisible and cannot be replicated or replaced, making it truly unique and valuable. The use of blockchain technology in gaming brings several advantages. Firstly, it allows players to have true ownership and control over their in-game assets. Since these assets are stored on the blockchain, players can transfer, trade, or sell them outside of the game’s ecosystem. This opens up new possibilities for players to monetize their gaming achievements and invest in valuable digital assets. Moreover, blockchain gaming introduces transparency and fairness into the gaming ecosystem. The decentralized nature of blockchain ensures that game rules and transactions are recorded on a public ledger, creating a transparent and auditable environment. This prevents cheating, fraud, or manipulation of in-game items, providing a level playing field for all players. Additionally, blockchain technology enables provable scarcity and rarity of in-game assets, making them more valuable and desirable for collectors. Another aspect of blockchain gaming is the concept of play-to-earn. In traditional games, players invest time and effort into playing, but they rarely receive any tangible rewards. However, in blockchain games, players can earn cryptocurrency or other valuable rewards by participating in the game’s ecosystem. This can include completing quests, achieving high scores, or contributing to the game’s development. Play-to-earn models have the potential to transform gaming into a viable source of income for players in some cases. Furthermore, blockchain technology facilitates the creation of open economies within games. Developers can design their games with built-in marketplaces where players can freely buy, sell, and trade in-game assets. These decentralized marketplaces operate on smart contracts, which eliminate the need for intermediaries and enable secure peer-to-peer transactions. Players can directly interact with each other in the economy, fostering a dynamic and thriving ecosystem. Several blockchain gaming platforms and ecosystems have emerged in recent years. Examples include Ethereum-based games like CryptoKitties, where players can collect, breed, and trade virtual cats, or Decentraland, a virtual world where players can own and monetize virtual real estate. Other platforms like Enjin and WAX offer tools and infrastructure for game developers to integrate blockchain technology into their games easily. Despite the potential and excitement surrounding blockchain gaming, there are still challenges to overcome. The scalability of blockchain networks is a significant concern, as they need to handle a large number of transactions and ensure fast and inexpensive operations. Additionally, user adoption and education about blockchain technology remain crucial for the widespread adoption of blockchain games. In conclusion, blockchain gaming represents a disruptive innovation in the gaming industry. By leveraging the decentralized and transparent nature of blockchain technology, it offers players true ownership of in-game assets, transparent and fair gameplay, opportunities for earning rewards, and vibrant in-game economies. While the concept is still evolving, blockchain gaming has the potential to revolutionize the way we play and interact with video games, providing new avenues for creativity, ownership, and engagement. Also read: How Blockchain Gaming Can Take Over Traditional Gaming Importance of Blockchain gaming for the economy Blocks in gaming, or blockchain technology in gaming, can play a significant role in shaping and enhancing the in-game economy. By introducing decentralized and transparent systems, blockchain technology brings several important benefits to the gaming economy, impacting both players and developers. 1. True Ownership and Value: Blockchain technology enables players to have true ownership and control over their in-game assets. Traditionally, game assets are owned by the game publisher, and players have limited control over them. However, with blockchain, in-game assets can be represented as non-fungible tokens (NFTs), which are unique and indivisible tokens. These NFTs can be bought, sold, and traded on decentralized marketplaces. This introduces a new level of value to the in-game assets, as players can own and accumulate assets that have real-world value. 2. Player-Driven Economy: Blockchain gaming facilitates the creation of player-driven economies within games. In a traditional game, the game publisher controls the virtual economy, dictating the availability, pricing, and distribution of in-game assets. In contrast, blockchain technology allows developers to design open economies where players can freely trade and exchange in-game assets. This empowers players to participate actively in the economy, driving supply and demand, determining prices, and creating a dynamic marketplace. 3. Opportunities for Monetization: Blockchain gaming provides new avenues for players to monetize their gaming experiences. By allowing players to own and trade in-game assets, blockchain games enable players to earn real-world value from their virtual achievements. Players can sell rare items, characters, or virtual real estate to other players, creating opportunities for profit. This play-to-earn model can potentially transform gaming from a mere pastime into a viable source of income for some players. 4. Transparency and Trust: The transparent nature of blockchain technology ensures trust and fairness in the gaming economy. In traditional games, transactions and item distribution are often opaque, leading to concerns about cheating, fraud, or manipulation. However, blockchain gaming records all transactions on a public ledger, creating a transparent and auditable system. This enhances trust among players, as they can verify the authenticity and scarcity of in-game assets. It also provides developers with a reputation system, allowing players to evaluate the credibility of developers and their games. 5. Collaboration and Interoperability: Blockchain technology enables interoperability among different games and platforms. Through standardized protocols and smart contracts, in-game assets can be transferred or used across multiple games. This allows players to carry their assets and achievements across various gaming experiences, fostering collaboration and continuity. It also opens up opportunities for partnerships and crossovers between different games and developers, creating a vibrant ecosystem. 6. Anti-Fraud Measures: Blockchain technology provides robust security against fraud and counterfeiting of in-game assets. The decentralized and immutable nature of blockchain ensures that once an asset is recorded on the blockchain, it cannot be tampered with or replicated. This prevents unauthorized duplication or creation of fake assets, protecting the integrity of the economy and maintaining the value of the in-game assets. Overall, the introduction of blockchain technology in gaming has the potential to revolutionize the in-game economy by offering true ownership, value, transparency, and opportunities for monetization. It empowers players, creates a player-driven economy, enhances trust, and encourages collaboration and interoperability. As blockchain gaming continues to evolve, it can provide exciting possibilities for economic growth and innovation within the gaming industry. https://www.youtube.com/watch?v=iUgG7CKt23c Top 10 blockchain gaming companies that got series funding in 2023 Blockchain gaming is a rapidly growing industry, and investors are taking notice. In 2023, a number of blockchain gaming companies raised significant sums of money in series funding rounds. Here are the top 10 blockchain gaming companies that got series funding in 2023: Animoca Brands Animoca Brands is a Hong Kong-based company that develops, publishes, and invests in blockchain games and products. The company has raised over $1 billion in funding, and its portfolio includes popular games such as The Sandbox and Axie Infinity. Sky Mavis Sky Mavis is a Vietnamese company that developed the popular blockchain game Axie Infinity. The game has over 2 million daily active users, and it has generated over $2 billion in revenue. In 2023, Sky Mavis raised $1 billion in a series B funding round led by Andreessen Horowitz. Mythical Games Mythical Games is a San Francisco-based company that develops blockchain games. The company has raised over $500 million in funding, and its portfolio includes the popular game Blankos Block Party. Decentraland Decentraland is a decentralized virtual world that runs on the Ethereum blockchain. The platform allows users to buy, sell, and build virtual land. In 2023, Decentraland raised $26 million in a series B funding round led by Animoca Brands. Sandbox The Sandbox is a decentralized gaming platform that runs on the Ethereum blockchain. The platform allows users to create, build, and monetize their own games. In 2023, The Sandbox raised $93 million in a series B funding round led by SoftBank Vision Fund 2. Aavegotchi Aavegotchi is a blockchain-based collectible game that allows players to collect, trade, and battle Aavegotchis, which are pixelated ghosts. In 2023, Aavegotchi raised $30 million in a series A funding round led by Animoca Brands. Alien Worlds Alien Worlds is a play-to-earn blockchain game that allows players to mine Trilium (TLM), the game’s native currency. In 2023, Alien Worlds raised $10 million in a seed funding round led by Ascensive Assets. Gods Unchained Gods Unchained is a free-to-play trading card game that uses the Immutable X blockchain. The game allows players to collect, trade, and battle cards. In 2023, Gods Unchained raised $30 million in a series B funding round led by Dapper Labs. REVV Racing REVV Racing is a blockchain-based racing game that allows players to collect, race, and trade cars. The game is developed by Animoca Brands and will be released on the Ethereum and Polygon blockchains. Sandbox Evolution Sandbox Evolution is a blockchain-based sandbox game that allows players to create, build, and share their own worlds. The game is developed by Sandbox Interactive and will be released on the Ethereum blockchain. These are just a few of the many blockchain gaming companies that received series funding in 2023. The growth of the blockchain gaming industry is a testament to the potential of this new technology to revolutionize the gaming industry. Also read: Top 5 Blockchain Gaming Platforms Transforming The Industry Benefits of blockchain gaming Blockchain gaming offers a range of benefits that can revolutionize the gaming industry. Here are the key advantages of blockchain gaming: 1. True Ownership of In-Game Assets: In traditional gaming, players invest time and money into acquiring in-game assets, but they usually don’t have true ownership over them. With blockchain gaming, in-game assets are represented as NFTs, which are stored on a blockchain. This gives players verifiable ownership, allowing them to transfer, sell, or trade their assets outside the game’s ecosystem. Players have control over their digital property, which enhances player agency and creates a sense of value and permanence for their in-game possessions. 2. Transparent and Immutable Transactions: Blockchain gaming introduces transparency and immutability to in-game transactions. All transactions, such as asset transfers or purchases, are recorded on the blockchain and can be publicly audited. This transparency eliminates concerns about fraud, cheating, or manipulation of in-game assets. It ensures that all transactions are verifiable and tamper-proof, enhancing trust among players and promoting fair gameplay. 3. Provably Scarce and Unique Assets: Through blockchain technology, game developers can establish scarcity and uniqueness for in-game assets. Each NFT represents a distinct item or collectible, making it rare and valuable. The scarcity is provable and cannot be altered, adding a new layer of authenticity and rarity to digital items. This creates a market for collectors and enthusiasts who are willing to invest in unique and limited-edition assets. 4. Play-to-Earn Opportunities: Blockchain gaming introduces the concept of play-to-earn, allowing players to earn real-world value by participating in the game. Players can earn cryptocurrencies or other valuable rewards by achieving milestones, completing quests, or contributing to the game’s ecosystem. This introduces a new incentive structure where gaming becomes a potential source of income for players, attracting a broader audience and increasing engagement. 5. Decentralized In-Game Economies: Blockchain gaming enables the creation of decentralized, player-driven economies within games. Developers can design in-game marketplaces where players can freely buy, sell, and trade assets with each other. These decentralized marketplaces operate on smart contracts, eliminating the need for intermediaries and ensuring secure and transparent transactions. This fosters a dynamic economy where players have the autonomy to determine the value of assets and participate actively in the ecosystem. 6. Interoperability and Cross-Game Integration: Blockchain technology allows for interoperability among different games and platforms. In-game assets and characters can be tokenized on a blockchain using standard protocols, enabling them to be used across multiple games. This opens up opportunities for collaborations, crossovers, and partnerships between different game developers. Players can carry their assets and achievements across various games, enhancing continuity and creating a cohesive gaming experience. 7. Enhanced Security and Anti-Fraud Measures: Blockchain technology provides robust security and anti-fraud measures for blockchain games. The decentralized nature of the blockchain ensures that assets cannot be counterfeited or duplicated. Smart contracts enable secure and automated transactions, reducing the risk of scams or fraudulent activities. Additionally, players have control over their private keys, ensuring the security of their digital assets. 8. Community Engagement and Governance: Blockchain gaming often involves a strong community aspect, with players actively engaging in the development and governance of the game. Some blockchain games allow players to participate in decision-making processes, such as voting on game updates or contributing to the game’s development. This fosters a sense of ownership and community involvement, creating a more inclusive and participatory gaming experience. Overall, blockchain gaming offers numerous benefits, including true ownership, transparency, provable scarcity, play-to-earn opportunities, decentralized economies, interoperability, enhanced security, and community engagement. These advantages have the potential to reshape the gaming industry by empowering players, increasing economic opportunities, and creating more immersive and player-centric gaming experiences. Also read: GameFi: The Future Of Blockchain Gaming Risks associated with blockchain gaming Blockchain gaming, like any emerging technology, comes with its own set of risks and challenges. Here are some of the key risks associated with blockchain gaming: 1. Technical Limitations: Blockchain technology, especially public blockchains, often faces scalability issues. As blockchain games gain popularity and attract a large number of players, the blockchain network may struggle to handle the increased transaction volume. This can lead to slow transaction processing times and high fees, impacting the overall gaming experience. 2. User Adoption and Accessibility: Despite the growing interest in blockchain gaming, user adoption and accessibility remain significant challenges. Many potential players may not be familiar with blockchain technology or may find it complex to navigate the necessary steps, such as setting up a digital wallet or acquiring cryptocurrency to participate in the game. The learning curve and additional requirements may hinder mass adoption of blockchain games. 3. Volatility of Cryptocurrencies: Blockchain games often utilize cryptocurrencies as in-game assets or rewards. However, the value of cryptocurrencies can be highly volatile, leading to unpredictable changes in the perceived value of in-game assets. Players may experience significant fluctuations in the real-world value of their virtual possessions, which can affect the stability and economy of the game. 4. Security Vulnerabilities: While blockchain technology itself is known for its security, blockchain gaming can still be susceptible to security vulnerabilities. Smart contracts, which facilitate in-game transactions and interactions, may contain coding errors or be subject to exploitation. These vulnerabilities can be targeted by malicious actors seeking to manipulate the game or steal players’ assets. The risk of hacking or phishing attacks on players’ digital wallets is also a concern. 5. Regulatory and Legal Challenges: The regulatory landscape surrounding blockchain and cryptocurrencies is still evolving. Different countries and jurisdictions may have varying regulations and requirements, which can pose challenges for blockchain game developers and players. Uncertainty around legal frameworks and compliance may limit the growth and adoption of blockchain gaming in certain regions. 6. Lack of Standardization: The lack of standardized protocols and interoperability across blockchain platforms can be a challenge for blockchain gaming. Each blockchain network may have its own set of rules and protocols, making it difficult for players to transfer or use their assets across different games or platforms. This fragmentation can limit the potential for a seamless and interconnected blockchain gaming ecosystem. 7. User Experience and Interface: Blockchain gaming interfaces and user experiences may not match the level of polish and accessibility found in traditional games. The complexities of interacting with blockchain technology, such as managing digital wallets, private keys, and navigating decentralized marketplaces, can be daunting for casual gamers. Improvements in user interfaces and experience design are necessary to make blockchain games more user-friendly and appealing to a broader audience. 8. Lack of Regulation and Consumer Protections: Blockchain gaming operates in a relatively unregulated space. This absence of clear regulations and consumer protections can expose players to potential risks. Fraudulent projects, scam games, or misleading marketing practices may emerge, leading to financial losses and negative experiences for players. The absence of well-defined dispute resolution mechanisms can also pose challenges in case of conflicts or disputes within the blockchain gaming ecosystem. It is important to note that the risks associated with blockchain gaming are not inherent to blockchain technology itself but rather stem from the current limitations, industry dynamics, and regulatory landscape. As the technology matures and the ecosystem develops, many of these risks can be mitigated through technological advancements, industry standards, and regulatory frameworks. Future of blockchain gaming The future of blockchain gaming holds tremendous potential for innovation and transformation in the gaming industry. Here are some key aspects that could shape the future of blockchain gaming: 1. Enhanced Scalability: Scalability is a critical factor for the widespread adoption of blockchain gaming. As blockchain technology evolves, solutions such as layer-two scaling solutions (e.g., sidechains, state channels) and advancements in blockchain consensus algorithms (e.g., proof-of-stake) can address scalability challenges. These developments will allow blockchain gaming platforms to handle a higher volume of transactions, improving the overall gaming experience. 2. Improved User Experience: Usability and user experience will play a vital role in attracting mainstream users to blockchain gaming. Efforts are being made to simplify the onboarding process, enhance wallet management, and streamline in-game interactions. User-friendly interfaces, intuitive designs, and seamless integration with traditional gaming platforms will contribute to a more accessible and engaging blockchain gaming experience. 3. Cross-Platform Interoperability: Interoperability across different blockchain networks and gaming platforms will be crucial for the future of blockchain gaming. Standards like the Ethereum-compatible ERC-721 and ERC-1155 standards have paved the way for cross-platform asset transfers. Further developments in interoperability protocols and frameworks will enable players to seamlessly use their assets across multiple games and platforms, fostering a connected and expansive blockchain gaming ecosystem. 4. Integration with Virtual Reality (VR) and Augmented Reality (AR): The combination of blockchain gaming with VR and AR technologies has the potential to create immersive and interactive gaming experiences. Blockchain can facilitate secure ownership and trading of virtual assets within these virtual environments. Players can own, trade, and monetize virtual real estate, avatars, and in-game items, enhancing the sense of presence and realism in virtual worlds. 5. Mainstream Adoption and Industry Collaboration: As blockchain gaming continues to evolve, industry collaboration and partnerships will be key drivers of mainstream adoption. Established game developers and publishers may explore integrating blockchain technology into their existing titles or creating new blockchain-based games. Collaboration between traditional gaming companies and blockchain startups can result in innovative gameplay mechanics, improved graphics, and engaging narratives, attracting a wider audience to blockchain gaming. 6. Metaverse and Persistent Virtual Worlds: The concept of the metaverse, an interconnected virtual universe where players can interact and engage in various activities, aligns closely with blockchain gaming. Blockchain can provide the infrastructure to build persistent virtual worlds with player-owned economies, where players have the freedom to create, trade, and monetize their virtual assets. These metaverse environments can offer endless possibilities for social interactions, gameplay experiences, and economic opportunities. 7. Integration of Artificial Intelligence (AI): The integration of AI technologies within blockchain gaming can enhance the gameplay experience. AI algorithms can generate dynamic and personalized game content, adapt game mechanics based on player behavior, and provide intelligent non-player characters (NPCs) for immersive storytelling. Additionally, AI-powered fraud detection systems can help identify and prevent cheating or fraudulent activities within blockchain games. 8. Expansion of Play-to-Earn Models: Play-to-earn models, where players can earn real-world value by participating in blockchain games, are likely to expand in the future. The ability to monetize in-game achievements, digital assets, and virtual experiences can attract a broader player base, including individuals from regions with limited economic opportunities. This economic empowerment has the potential to revolutionize the gaming landscape, creating new avenues for livelihoods and fostering economic inclusion. 9. Regulatory Developments: Regulatory frameworks around blockchain technology and cryptocurrencies are expected to evolve in the coming years. Clearer regulations and consumer protections will provide a more secure and trustworthy environment for blockchain gaming. Regulatory developments can encourage investor confidence, mitigate risks, and pave the way for further innovation and growth in the blockchain gaming industry. In conclusion, the future of blockchain gaming holds great promise for immersive experiences, enhanced user interactions, cross-platform interoperability, and economic opportunities for players. Advancements in scalability, user experience, interoperability, integration with emerging technologies, and regulatory developments will shape the trajectory of blockchain gaming and its impact on the broader gaming industry. Playstation has been testing blockchain products since November. Today, Sony filed a patent for NFTs to allow trading in-game assets. Sony is known for taking risks -> They (usually) pay off -> People follow. Huge W for crypto gaming. pic.twitter.com/kER31a9gQ8 — Lite. (@LitecoinYagami) March 21, 2023 Share Tweet Share Share Pin it Related posts Exploring The Potential Of Blockchain Gaming In Educat . . . BLOCKCHAIN GAMING NEWS Top 5 Blockchain Gaming Companies That Got High Fundin . . . BLOCKCHAIN GAMING NEWS The Top 10 Benefits of Blockchain Gaming for Developers BLOCKCHAIN GAMING NEWS 15 Things You Should Check Before Investing In Blockch . . . BLOCKCHAIN GAMING NEWS All You Need to Know About Crypto Gaming and its Benefits BLOCKCHAIN GAMING NEWS Top 5 Questions Answered About Web3 Games BLOCKCHAIN GAMING NEWS A Beginner’s Guide To Blockchain Gaming: Combini . . . BLOCKCHAIN GAMING NEWS The Rise Of Blockchain gaming: Top 10 Ways Players Can . . . BLOCKCHAIN GAMING NEWS What Is Blockchain Gaming: The Vision Of The Next Gene . . . BLOCKCHAIN GAMING NEWS Everything You Need To Know About The Role Of Social M . . . BLOCKCHAIN GAMING NEWS Editor's Choice The Best NFT Collection That Is A Hit Among Collectors In 2023 Top 10 Metaverse Projects Changing The Virtual Landscape In 2023 The Top 10 New NFT Marketplaces That Are Creating The Future Of NFTs Assembling Degens And Unleashing Crypto Evolution with $BOBNET Token Presale! Top 10 Blockchain Gaming Companies That Got Series Funding In 2023 Hottest Blockchain News Daily Get our latest posts and announcements in your inbox. [cn-social-icon attr_class=”social-share-side”]",
    "originSummary": [
      "Blockchain gaming combines blockchain technology and video games, giving players ownership and control over in-game assets, and the ability to monetize their achievements.",
      "It brings transparency, fairness, and enhanced security to the gaming industry.",
      "Despite challenges like technical limitations and regulatory hurdles, notable companies in the field have received substantial funding, indicating the industry's potential for growth and innovation."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "Spirit Blockchain Completes Debt Settlement and Shares for Services Transaction",
    "originLink": "https://finance.yahoo.com/news/spirit-blockchain-completes-debt-settlement-220100013.html",
    "originBody": "GlobeNewswire Spirit Blockchain Completes Debt Settlement and Shares for Services Transaction Read full article Spirit Blockchain Capital Inc. Fri, November 10, 2023 at 5:01 PM EST·2 min read Vancouver, British Columbia, Nov. 10, 2023 (GLOBE NEWSWIRE) -- Spirit Blockchain Capital Inc. (CSE: SPIR) (the “Company” or “Spirit”) a leading digital asset investment firm, announces the following corporate updates: Debt Settlement The Company has settled outstanding indebtedness (the “Debt Settlement”) of the Company in the aggregate amount of $36,500.00 (the “Debt”), pursuant to the terms of a debt settlement agreement with an arm’s length creditor (the “Creditor”). In settlement of the Debt, the Company has issued $18,250.00 in cash and an aggregate of 456,250 common shares in the capital of the Company (the “Common Shares”) to the Creditor at a price of $0.04 per Common Share. Shares for Services Transaction The Company has also issued an aggregate of 1,025,000 Common Shares at a price of $0.05 per Common Share to certain directors of the Company (the “Shares for Services”) . The Shares for Services have been issued in lieu of cash payments for services rendered pursuant to consulting agreements whereby these individuals provided various management services to the Company. The foregoing consulting services will be disclosed in the Company’s applicable financial statements. The issuance of Shares for Services to Raymond O’Neill, Erich Perroulaz, and Lewis Bateman, each a director of the Company, (collectively, the “Related Parties”), will each be considered to be a “related party transaction” as defined under Multilateral Instrument 61-101 – Protection of Minority Security holders in Special Transactions (“MI 61-101“). The issuance of Shares for Services, as it relates to the Related Parties, is exempt from the minority approval and formal valuation requirements of MI 61-101 pursuant to subsections 5.5(a) and 5.7(1)(a) of MI 61-101. None of the securities to be issued in connection with the Debt Settlement or Shares for Services have been or will be registered under the United States Securities Act of 1933, as amended (the “1933 Act”), and none may be offered or sold in the United States absent registration or an applicable exemption from the registration requirements of the 1933 Act. Story continues On Behalf of the Board of Directors Lewis Bateman Chief Executive Officer About Spirit Blockchain Capital Spirit Blockchain Capital is a leading digital asset investment firm focused on capital appreciation and alpha generation. With a commitment to active management and a risk-based approach to digital asset allocation, the company seeks to deliver superior returns to its clients. Spirit Blockchain Capital leverages its deep industry expertise and strategic partnerships to stay at the forefront of the ever-evolving digital asset landscape. To learn more about Spirit, please visit: https://www.spiritblockchain.com Media Contact: Lewis Bateman, CEO Email: info@spiritblockchain.com Forward-Looking Statements This news release contains certain “forward-looking statements” and certain “forward-looking information” as defined under applicable Canadian securities laws that are subject to risks and uncertainties, including with respect to the settlement of the Debt owing by the Company to the Creditor through the issuance of cash and Common Shares and regulatory approval of the issuance of such Common Shares. Forward-looking statements and information can generally be identified by the use of forward-looking terminology such as “may”, “will”, “expect”, “intend”, “estimate”, “anticipate”, “believe”, “continue”, “plans” or similar terminology. The Company provides forward-looking statements for the purpose of conveying information about current expectations and plans relating to the future and readers are cautioned that such statements may not be appropriate for other purposes. By its nature, this information is subject to inherent risks and uncertainties that may be general or specific and which give rise to the possibility that expectations, forecasts, predictions, projections, or conclusions will not prove to be accurate, that assumptions may not be correct, and that objectives, strategic goals and priorities will not be achieved. These risks and uncertainties include but are not limited those identified and reported in the Company’s public filings under the Company’s SEDAR profile at www.sedar.com. Although the Company has attempted to identify important factors that could cause actual actions, events, or results to differ materially from those described in forward-looking information, there may be other factors that cause actions, events or results not to be as anticipated, estimated or intended. There can be no assurance that such information will prove to be accurate as actual results and future events could differ materially from those anticipated in such statements. The Company disclaims any intention or obligation to update or revise any forward-looking information, whether as a result of new information, future events or otherwise unless required by law. The Canadian Securities Exchange (CSE) has not reviewed, approved, or disapproved the contents of this press release. Related Quotes Symbol Last Price Change % Change SPIR.CN Spirit Blockchain Capital Inc.0.0500 +0.0050 +11.11% TRENDING 1. UPDATE 1-US House Republicans eye plan to avert government shutdown as Moody's warns 2. The Diamond World Takes Radical Steps to Stop a Pricing Plunge 3. Israel Latest: Air Force Makes Deepest Strike Yet Into Lebanon 4. Americans continue to ransack their retirement savings, survey finds 5. How researchers, farmers and brewers want to safeguard beer against climate change",
    "originSummary": [
      "Spirit Blockchain Capital Inc. has completed a debt settlement by issuing cash and common shares to a creditor, totaling $36,500.",
      "The company also issued 1,025,000 common shares to directors for services rendered instead of cash payments.",
      "The issuance of shares to related parties is considered a \"related party transaction\" and is exempt from certain regulatory requirements. The securities issued have not been registered under the United States Securities Act."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "The Growing Interest of Students in Blockchain Technology",
    "originLink": "https://dailyillini.com/sponsored/2023/11/10/the-surging-enthusiasm-for-blockchain-technology-among-students/",
    "originBody": "Facebook Instagram X Tiktok YouTube Search this site Submit Search The Daily Illini MORE Menu The Daily Illini 🗞 Print 📣 News 🌺 Life And Culture 💬 Opinions 🏅 Sports 🎵 Buzz 📸 Photo 🔅 CU Faith & Life 🏡 Housing 💸 Salary Guide ✨ Special Sections 💌 Subscribe ❓ About 🎨 Illini Media Company The Daily Illini Open Search Bar Search this site Submit Search Menu NEWS FEATURES OPINIONS SPORTS BUZZ CU FAITH & LIFE HOUSING SALARY GUIDE PHOTO HALL OF FAME SPECIAL SECTIONS The Daily Illini Open Search Bar Search this site Submit Search TRENDING NOW 1 UPDATED: Fire at intersection of First, Clark streets 2 No. 25 Illinois menʼs basketball begins 2023-24 season with emphatic win over Eastern Illinois 3 Notes, player grades from Illinois’ season-opening 28-point victory over Eastern Illinois 4 Open house events at University of Illinois Observatory navigate wonders 5 Champaign becomes first Illinois city to be designated as Certified Welcoming place SPONSORED The Surging Enthusiasm for Blockchain Technology Among Students NOVEMBER 10, 2023 In recent years, the allure of Tether (USDT) and blockchain technology, once primarily associated with cryptocurrencies like Bitcoin, has witnessed a significant rise in the enthusiasm of students. This increasing fascination goes beyond mere financial aspirations, signifying a growing recognition of the revolutionary possibilities that blockchain offers across a wide array of industries. Continue reading to explore the driving forces propelling blockchain into the academic spotlight, the resulting impacts on the educational arena, and the potential implications for future career opportunities. Decoding the Foundations: What Constitutes Blockchain Technology? Before looking at the burgeoning fascination with blockchain among students, it is important to establish a clear understanding of the technology. At its core, blockchain serves as a decentralized, distributed digital ledger responsible for recording transactions across multiple computer nodes. These transactions are subsequently bundled into blocks, tethered together within an immutable cryptographic chain. The hallmark attributes of blockchain include its intrinsic immutability and transparency. Understanding the Student Uprising Interest in Blockchain The following may explain the interest students are having in blockchain technology: – The propensity for Innovation and Disruption: Students, by their very nature, gravitate toward disruptive technologies that challenge established paradigms. The capacity of blockchain to usher in groundbreaking changes across sectors spanning finance to healthcare acts as a magnet for the intellectually curious. Sign up for our newsletter! Email – Prospects on the Professional Frontier: Recognizing the increasing demand for proficient blockchain professionals, students perceive career opportunities within this burgeoning domain. Roles such as blockchain developers and analysts are becoming increasingly sought after in a market hungry for blockchain expertise. – Championing Financial Inclusion: A section of students is drawn to blockchain technology due to its potential to bridge the financial divide by extending services to the unbanked and underbanked populations. The resonating socio-economic impact aligns with the collective conscience of socially conscious students. Student Digitalization – Digital Literacy Imperative: In an era in which society has embraced digitalization, students seek familiarity with technologies that are poised to dominate their future landscape. Proficiency in blockchain is seen as a step toward enhancing digital literacy. – Cryptocurrency as an Investment Avenue: The meteoric ascent of cryptocurrencies such as Bitcoin and Ethereum has enticed students to investigate the underpinning technology. For some, it is viewed as an opportunity for investment and wealth generation. – Innate Academic Curiosity: The multi-faceted nature of blockchain – entailing elements from computer science to cryptography, economics and more – appeal to the intellectually curious student, who relishes the complexities inherent in blockchain’s architecture. The Impact of Blockchain on Academia The realm of academia has not remained impervious to the transformative potential of blockchain. Several universities and e-learning platforms have embraced blockchain by offering a number of courses and certifications, thereby offering students the opportunity to delve into the technical intricacies of blockchain technology, its applications and the accompanying ethical and legal nuances. Furthermore, academic institutions have started leveraging blockchain to authenticate academic credentials. This innovative application streamlines the verification process and curtails fraud. As students observe their own educational institutions embracing blockchain for such functions, their interest in the technology is aroused. The Emergence of Blockchain Communities and Clubs Many students, fervently interested in blockchain, are proactively engaging with blockchain clubs and virtual communities. These forums often organize activities, from hackathons to guest lectures, in addition to fostering an environment conducive to experiential learning. Membership in such groups not only helps in understanding about blockchain technology, but also opens doors to coveted internships and career placements. Navigating the Challenges and Addressing Concerns While the appeal of blockchain among students is undeniable, it also has its fair share of challenges and apprehensions: Cryptocurrency Volatility: Students who venture into cryptocurrency investments must grapple with their volatile nature. The promise of substantial gains is balanced by the specter of potential losses. Regulatory Ambiguity: The regulatory framework surrounding blockchain remains a work in progress across many jurisdictions. The absence of comprehensive oversight provides fertile ground for fraudulent schemes and scams that can wreak havoc on inexperienced investors. Educational Lacunae: Despite the surging interest in blockchain education, a disparity exists between what is taught in universities and the swiftly evolving industry. To stay abreast of the developments, students may need to complement their formal education with self-learning and industry-relevant certifications. Ethical and Environmental Considerations: Certain cryptocurrencies – Bitcoin being a case in point – have invited scrutiny for their heavy energy consumption and their potential employment in illicit activities. It is incumbent upon students to consider the ethical and environmental ramifications of blockchain technology. The Future Landscape of Blockchain in Education As the appeal of blockchain among students continues its upward trajectory, the technology is poised to impact the educational sphere and the ensuing job market. A growing number of academic institutions are expected to start offering blockchain related courses and certifications, thereby helping facilitating student in preparation for careers within this evolving field. The use of blockchain to authenticate academic credentials is anticipated to become increasingly pervasive. This pragmatic application promises to streamline the verification process for employers and institutions. The Wrap-Up The burgeoning popularity of blockchain among students signifies their fascination with emerging technologies, an eagerness to avail themselves of career opportunities, and a determination to attain proficiency within the digital space. As blockchain continues to permeate diverse sectors, students are strategically positioning themselves as the vanguard of this transformative technology. 0 More to Discover More in Sponsored Digital Transition: How Traditional Games are Making a Comeback Online Balancing Academics and Health: Tips for College Students Mobile Convenience Continues to Feed the Australian iGaming Boom Facebook Instagram X Tiktok YouTube Search this site Submit Search STAY CONNECTED Contact Us / Submit a Tip Print Edition Newsletter Sports Newsletter Apply ABOUT Staff Ethics Code Corrections Policy Archives Terms of Use THE ILLINI MEDIA COMPANY Donate Advertise Illio Yearbook WPGU 107.1 Alumni Saturday, November 11, 2023 35° Champaign, IL 35° Urbana, IL Facebook Instagram X Tiktok YouTube Saturday, November 11, 2023 35° Champaign, IL 35° Urbana, IL Facebook Instagram X Tiktok YouTube The Daily Illini • © 2023 The Daily Illini • Privacy Policy • FLEX Pro WordPress Theme by SNO • Log in Close Close Modal Window",
    "originSummary": [
      "Blockchain technology, particularly associated with cryptocurrencies like Bitcoin, is gaining popularity among students due to its potential for innovation and disruption, career prospects, financial inclusion, digital literacy, and investment opportunities.",
      "Universities are responding to this growing interest by offering courses and certifications in blockchain and using it for authenticating credentials.",
      "Despite challenges like cryptocurrency volatility, regulatory ambiguity, educational gaps, and ethical considerations, blockchain is expected to have a continued impact on education and job market, with more academic institutions offering blockchain-related courses and certifications, and the use of blockchain for credential verification becoming more widespread."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "JPMorgan Chase Harnesses Blockchain for Programmable B2B Payments",
    "originLink": "https://www.americanbanker.com/payments/news/how-jpmorgan-is-using-blockchain-to-make-b2b-payments-programmable",
    "originBody": "Payments How JPMorgan is using blockchain to make B2B payments 'programmable' By John Adams CloseText About John twitter johnhadams mailto john.adams@arizent.com linkedin john-adams-83444310 November 10, 2023, 1:57 p.m. EST 4 Min Read Facebook Twitter LinkedIn Email Enjoy complimentary access to top ideas and insights — selected by our editors. JPMorgan Chase contends the standing rules around business payments can be made more flexible. Gabby Jones/Bloomberg As a growing number of banks use payment automation to lure business-to-business clients, JPMorgan Chase is expanding its B2B strategy by applying cryptocurrency-style technology to this audience. John Adams , American Banker twitter mailto linkedin",
    "originSummary": [
      "JPMorgan Chase is adopting blockchain technology to enhance business-to-business payments.",
      "The move is aimed at countering the growing trend of payment automation among other banks.",
      "The use of blockchain will bring more flexibility and programmability to B2B payments."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "Blockchain Life Forum 2023: Insights, Analysis, and Global Attendance",
    "originLink": "https://coingape.com/press-releases/blockchain-life-2023-shaping-trends-for-the-upcoming-bull-run/",
    "originBody": "Home / Press Release Blockchain Life 2023: Shaping Trends For The Upcoming Bull Run By Stan Peterson Updated 2 hours ago Advertise With Us Dubai, October 25, 2023 – The 11th edition of the Blockchain Life Forum, widely recognized as the premier meeting point for global cryptocurrency leaders, concluded with a gathering of over 7000 attendees from 120 countries. Blockchain Life has become the center of crypto activities, as well as one of the largest and most important events in the world, summing up the Crypto Year. Once again, traditionally accompanied by the growth of Bitcoin and a bunch of side events, Blockchain Life 2023 took place in Dubai. The main stage provided a platform for more than 100 distinguished speakers, and exemplars of the industry, to share their market insights and insider analysis. These luminaries included founders and С-level of Binance, TRON, Ripple, Bybit, Animoca Brands, Circle, Tether, OKX, HTX, Kucoin, Mastercard, ICP, Trust Wallet, Sandbox, Near, Litecoin, Bitmain, Marathon, Canaan, WhatsMiner, Bitfury, Consensys, BNB chain, Mantle. Moreover, H.E. Justin Sun gave an exclusive speech at the forum, talking about the value of real world assets in the digital age. “We were excited to see strong investor interest in the projects showcased at the forum, with participation from private investors and Tier-1 funds like Animoca Brands, Wintermute, and DWF Labs. I’m sure our attendees made wise choices for their portfolios, and we expect the upcoming Bull Run to further amplify their profits.” – said Sergei Khitrov, the organizer of Blockchain Life. During the event, the crypto community engaged in vibrant discussions on the most pertinent topics, establishing valuable connections, and striking important deals. Furthermore, participants had the opportunity to survey the largest exhibition of crypto companies, boasting over 120 booths, including industry titans such as OKX, HTX, Bitmain, Uminers and others. This exhaustive showcase offered visitors the chance to witness first-hand the cutting-edge technologies and innovations revolutionizing the crypto ecosystem. Adding an enchanting conclusion to the forum, participants were treated to the celebrated Legendary AfterParty at one of the world’s premier clubs. Against the backdrop of an all-inclusive night, attendees had the unique chance to network and forge relationships in an informal yet stimulating environment. As the curtains fall on the 11th Blockchain Life Forum, attendees return to their respective countries, fueled by the common expectation of an imminent market boost. Looking ahead, mark your calendars for the 12th edition of Blockchain Life on April 15-16, 2024. This highly anticipated event will provide an opportunity for participants to showcase their achievements, celebrate their growth, and lay the foundation for future success. The early bird tickets and sponsorship application are already open – follow the link. https://blockchain-life.com Organizers of Blockchain Life 2023 – Listing.Help, Jets.Capital General Sponsor of Blockchain Life 2023 and AfterParty – Uminers. Disclaimer This article is a paid publication and does not have journalistic/ editorial involvement of CoinGape. CoinGape does not endorse/ subscribe to the contents of the article/advertisement and/or views expressed herein. Do your market research before taking any actions . The author or the publication does not hold any responsibility for your personal financial loss. For PR & Sponsored Content Reach us : @Coingapeofficials contact@coingape.com Similar Post Investor Preference Swings To VC Spectra And THORChain Amidst dYdX’s Decline Analysts Monitor Chainlink (LINK) and VC Spectra (SPCT) with Interest – Here’s Why Chimpzee Launches ‘End Of Presale Giveaway’ With 500,000 $CHMPZ Up For Grabs – Here’s How You Can Join Too Bitcoin, Solana And New Bitcoin ETF Token (BTCETF) Are The Most Trending Cryptocurrency Assets Today Comparing Dogecoin (DOGE) And VC Spectra (SPCT): Assessing The Faster Path To 10-Fold Returns eTukTuk Presale: Making Financial Inclusion A Reality For All",
    "originSummary": [
      "The 11th edition of the Blockchain Life Forum took place in Dubai and attracted over 7000 attendees from 120 countries.",
      "The forum featured more than 100 speakers from leading cryptocurrency companies who shared market insights and insider analysis.",
      "The event also included a large exhibition of crypto companies and a memorable afterparty. Organizers are already preparing for the 12th edition in April 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "The Rise of Gaming Tokens: A Game-Changer in the Blockchain Industry",
    "originLink": "https://nftplazas.com/blockchain-gaming-tokens/",
    "originBody": "NFT Gaming News The Rise of Gaming Tokens Among Other Blockchain Assets NFT Gaming News 9 hours ago ShareTwitterFacebookLinkedInE-mail Despite a year-long decline, the Web3 landscape finally appears brighter. In the NFT world, October sales soared by 32%, spurred by a significant $1,136,658.03 (600 ETH) CryptoPunks transaction and an NFT-focused episode of The Simpsons. On top of that, in the crypto realm, Bitcoin ($BTC) is soaring today, nearly touching $38,000, giving early investors back those sorely missed bull market vibes. $38,000 is the next victim. #Bitcoin pic.twitter.com/usdArYM1td — BITCOINLFG® (@bitcoinlfgo) November 9, 2023 Still, the Web3 world goes beyond NFTs and well-know cryptocurrencies, like $BTC. Gaming and Metaverse tokens also play a tremendous part in the blockchain industry’s rising trajectory. Triumphing Gaming Tokens To contextualize the benefits of GameFi coins, let’s look at Illuvium. Spurred by revealing going mainstream on Epic Games, the blockchain game’s token ($ILV) rapidly soared by a whopping $79.5% in just seven days and 122.6% over the past 30, hitting a coin price of $90.43 and 24-hour trading volume of $77,012,963. Similarly, ImmutableX ($IMX) has also significantly risen this past week, by 32.9%, sparked by its groundbreaking partnership with the world-famous video gaming titan Ubisoft. Today, the token’s 24-hour trading volume stands at an eye-boggling $594,694,735 – over 50% of the coin’s market cap of $1,132,601,917. Additionally, Star Atlas DAO’s token, $POLIS, had a recent uptick, increasing by 20.9% in just 24 hours. Differently, the reason behind the token’s rapid spike includes acting as the gateway for governance in the sci-fi-based Metaverse game built on the Solana blockchain network, signifying new developments being underway. $POLIS 7-day trading volume (CoinGecko) Another blockchain gaming token worth giving a shout-out to is Gala Games’ native token, $GALA, which rose by a notable 25.5% this past week. Reasons behind the token’s popularity include the playtest version of ‘The Walking Dead: Empires’ recently going live on the Gala ecosystem. Last but not least, The Sandbox, which has a 24-hour trading volume of $137,275,405.38, is climbing higher. Despite dipping by -4.8 over the past 24-hours hours, $SAND has enhanced by 5.3% in the past 7 days with potential for increased growth following the Metaverse’s recent collaboration with Gucci. Such successes present the dynamism and diversity of blockchain gaming/Metaverse tokens, spotlighting their significant contributions to the Web3 realm’s unceasing revival and promising future beyond NFTs and renowned digital coins solely for financial purposes. Want more? Connect with NFT Plazas Join the Weekly Newsletter Follow us on Twitter Like us on Facebook Follow us on Instagram Leah Digital art fanatic who brings a unique perspective to NFT news. Tags: Gaming Tokens",
    "originSummary": [
      "The article discusses the rising popularity and value of gaming and Metaverse tokens in the Web3 space.",
      "Tokens like Illuvium, ImmutableX, Star Atlas DAO, Gala Games, and The Sandbox have seen substantial price increases and trading volumes.",
      "The article emphasizes the increasing significance of these tokens in the blockchain industry, going beyond NFTs and established cryptocurrencies like Bitcoin."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "The Rising Demand for Blockchain Engineers: Exploring Top Job Opportunities, Skills, and Challenges",
    "originLink": "https://www.blockchain-council.org/blockchain/blockchain-engineer-job/",
    "originBody": "Top Blockchain Engineer Job Options",
    "originSummary": [
      "The article explores the various job opportunities for blockchain engineers, emphasizing the increasing demand in the industry.",
      "It outlines the necessary skills and experience needed for these positions.",
      "The article discusses the benefits and challenges of working as a blockchain engineer."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "JPMorgan Launches Programmable Payments Feature on Blockchain System",
    "originLink": "https://blockworks.co/news/jpmorgan-blockchain-payments",
    "originBody": "home news Business JPMorgan adds ‘holy grail’ payments feature as part of blockchain push Siemens the first to use the new offering built to allow “a real-time and a programmable treasury” by Ben Strack / November 10, 2023 04:43 pm JPMorgan Chase CEO Jamie DimonSteve Jurvetson/\"Jamie Dimon\" (CC license) share JPMorgan is giving institutional clients more control over payments via JPM Coin — marking the company’s latest blockchain-related milestone. Its new programmable payments offering is a feature for blockchain-based accounts on the JPM Coin System, a permissioned payment rail and deposit account ledger letting clients transfer dollars within the system. Programmability lets clients place rules for funding a bank account, for example — or set parameters for executing payments based on margin calls, asset delivery or meeting contract requirements. “Blockchain technology is the ideal infrastructure to which programmable payments can be applied as it enables rules and bank accounts to be integrated in a native manner, enabling cases including dynamic direct debits and multi-party escrow accounts,” a spokesperson told Blockworks in an email. JPMorgan’s Onyx Digital Assets network — launched in 2020 — enables the tokenization of traditional assets, such as US Treasurys and money-market products. The company tested programmable payments with German automation company Siemens in December 2021, calling it “a move that will forever redefine the role of corporate treasuries,” in a blog post at the time. Siemens made its first payment with the programmable capability on Nov. 6. “Advantages and features from the crypto world are now available for fiat currencies by JP Morgan’s provision of 24 [hours] by 7 [days] blockchain-based bank accounts, combined with programmability,” Siemens’ group treasurer Peter Rathgeb said in a Friday statement. Naveen Mallela, head of coin systems at Onyx, noted in a LinkedIn post that there is now “general availability” for the new offering, adding that programmability “has always been the holy grail” in the JPM Coin roadmap. “We believe that this capability will enable not only a real-time and a programmable treasury but also newer digital business models,” Mallela wrote. JPMorgan has been busy on the blockchain front. The financial titan used the Polygon blockchain to trade tokenized cash deposits in November 2022. More recently, asset manager BlackRock last month used JPMorgan’s Tokenized Collateral Network to tokenize shares in one of its money market funds. It then sent those interests to Barclays as collateral for an over-the-counter (OTC) derivatives trade between the firms. Read more: TradFi, DeFi convergence continues through tokenizing real-world assets BlackRock CEO Larry Fink said last year the tokenization of securities is “the next generation for markets.” Don’t miss the next big story – join our free daily newsletter. Tags JPMorgan payment systems Tokenization TradFi",
    "originSummary": [
      "JPMorgan is launching a new programmable payments feature for institutional clients on its JPM Coin blockchain system.",
      "The feature enables clients to establish rules and parameters for payments based on different factors.",
      "Siemens is the first company to utilize this feature and believes it will revolutionize the role of corporate treasuries."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  },
  {
    "title": "Blockchain for Mortgages - Revolutionizing the Mortgage Industry with Enhanced Efficiency and Liquidity",
    "originLink": "https://www.ledgerinsights.com/blockchain-mortgage-backed-securities-mbs/",
    "originBody": "Blockchain for Banking • News • Real estate Brian Brooks compares blockchain for mortgages to CDs versus cassette tape 20 hours ago by Ledger Insights During this week’s DC Fintech Week, Brian Brooks outlined why he sees blockchain as a strong solution for recording and securitizing mortgages. A few years before becoming Acting Comptroller of the Currency, Brooks was General Counsel for Fannie Mae, so he knows a thing or two about the sector. In short, blockchain can act as a definitive mortgage registry, cut costs and enable a wider pool of investors for tokenized mortgage backed securities (MBS). The net effect is improved liquidity. The U.S. mortgage backed securities (MBS) market is worth $11 trillion or around half the size of the Nasdaq. Native mortgage blockchain registries & cost savings A major benefit of blockchain is to act as a native digital mortgage registry. Brooks discussed the Great Financial Crisis, and how mortgage records were a major blocker with foreclosures. “We didn’t know for sure who owned the note,” said Brooks. “And even if the mortgage was registered on the MERS (mortgage registry) system, people still argued a certain percentage of the time that the MERS system was subject to human error – that something had been onboarded incorrectly or there had been a break in the chain of title.” With blockchain, it will still be possible to have errors in mortgage origination. However, if the mortgage record is natively digital, there should be no re-keying errors. And digital signatures prove who has the title. Mike Cagney, the CEO of blockchain mortgage provider Figure, estimates that the cost savings in origination, aggregation and securitization are 85 basis points (0.85%). Putting it another way, that’s $850 per $100,000 mortgage. One example Cagney gave is securitization. For conventional mortgage securitizations, every mortgage is audited which costs $500 per loan. With a blockchain solution, it’s only necessary to audit a sample. Currently that’s 20% in Figure’s case. And because of the availability of all the data digitally, the cost is $50 – $100 per loan. Averaged across all loans, that’s a cost of $15 per loan versus $500, giving a saving of $485. Cagney expects that figure to come down further. Brooks noted there’s a financial inclusion aspect. Using Cagney’s figures, savings of $485 on a $100,000 mortgage is a big deal, but not so much on a million dollar mortgage. Blockchain can improve liquidity For those familiar with the mortgage sector, to improve liquidity, Cagney announced that Figure is planning a private TBA market (explained below) in association with two major global investment banks. He didn’t mention which banks, but Figure’s April asset backed security issuance was underwritten by Jefferies, JP Morgan and Goldman Sachs. Cagney added that atomic settlement enabled by blockchain can eliminate counterparty and settlement risk. Plus greater transparency around mortgage performance can support improved liquidity. He gave the example during COVID when liquidity dried up for Prime Jumbo loans (which are not federally guaranteed). Most mortgage reports were at least 30 days in arrears, so it was difficult to tell how mortgages were performing. In contrast, with blockchain the reporting is automated and real time. But even bigger improvements in liquidity can come from expanding the investor base. Typically mortgage backed securities trade in units of millions or tens of millions of dollars. One of the benefits of tokenization is the ability to cut costs which makes smaller transaction sizes viable. Brooks spoke about how the stock market evolved. “Typically, 100 shares was the smallest you could possibly buy and stocks were expensive. And then we invented mutual funds and then we invented the ETF. So now you can buy equities for a dollar. But that wasn’t the case in our parent’s generation,” he said. “That will come to mortgages as well through tokens.” Expanding the investor base might become even more important as banks reduce their lending with macroeconomic headwinds and increased capital requirements. What’s holding up mortgage tokenization? The hold-ups on tokenization were perhaps the only area where Brooks and Cagney weren’t on the same page. Brooks believes the blockers are around crypto securities rules in the United States and the reluctance of the SEC and FINRA to approve the trading of natively digital securities. Figure doesn’t have that problem. As context, many of the incumbents that have tokenized money market funds or assets – such as Franklin Templeton and WisdomTree – also keep conventional securities registries. The SEC required it. Some might argue the securities are not digitally native. Figure is a registered broker-dealer and has an Alternative Trading System (ATS) registration. Cagney revealed that Figure issued the first U.S.-regulated asset backed security (ABS) that was native to the blockchain and trades on its ATS. In fact, Figure has been doing ABS for some time, although perhaps the early ones needed dual conventional registrations. Part of the adoption hold-up is a false belief that private data is stored on the public blockchain used by Figure (Provenance blockchain). Cagney noted it stores a hash of the mortgage data which is simply a unique identifier but cannot be used to decipher any personal information. MERS and structural U.S. blockers Perhaps the biggest blocker is the current structure of the U.S. mortgage market doesn’t favor change. Two issues are the way the incumbent MERS registry is effectively a monopoly. And the standardized manner in which Fannie Mae or Freddie Mac pools of assets are sold (as TBA). Figure aims to address both of these. Figure’s Digital Asset Registration Technologies (DART) solution can be used instead of the dominant MERS registry. The startup conducted its first transaction with Apollo using DART last year. However, Federal mortgage insurers such as Fannie Mae require the use of MERS. And the modus operandi bakes in MERS as a central registry. MERS acts as the nominee for the true lender to enable faster transfer of title. When the mortgage is sold, the lender gets updated on the MERS database with no need to update the public records. That’s not an easy competitor. Creating a private TBA market Another structural issue is the way pools of mortgages are sold by Fannie Mae or Freddie Mac. The buyer doesn’t know the precise contents until two days later, hence the name TBA. This only works because each pool includes a standardized set of mortgages. Research indicates that this improves liquidity, effectively lowering mortgage rates. And the benefits are not purely attributable to the federal guarantee. Standardization plays a role. Hence, Figure wants to replicate this standardization concept and create a private TBA market. “The ability to build homogenous assets. The ability to have an immutable transaction history and certainty of data. That’s the foundation that you need to create a liquid TBA and ultimately pass through* market with a third party guarantor,” said Figure’s Cagney. “So I believe that’s the next step of what’s going to happen. We’re working with two of the largest investment banks in the world to do this right now. And my hope would be that by the end of the year, you’ll see a first private TBA trade on chain.” Brooks sees the biggest risk as slow adoption. “To me, it feels a lot like the advent of smartphones, or the advent of the commercial internet or even like the advent of the CD player,” said Brooks. “It will be seen as risky. We have to overcome that. This is the CD player. Okay, yes, your cassette tapes are super awesome, but just get over it.” *A passthrough market refers to the way mortgage payments go to servicing intermediaries and are then passed on to the investor. Image Copyright: DC Fintech Week / Fannie Mae ABS asset backed securities blockchain DART distributed ledger DLT Figure mortgage backed securities mortgage registry mortgages provenance tokenization tokenized mortgages FacebookXRedditEmailLinkedInWhatsApp",
    "originSummary": [
      "Blockchain technology can provide significant benefits for recording and securitizing mortgages, as discussed by Brian Brooks during DC Fintech Week.",
      "By serving as a definitive mortgage registry, blockchain can reduce costs and attract a larger pool of investors for tokenized mortgage-backed securities.",
      "Native digital mortgage records on the blockchain can minimize errors and utilize digital signatures to prove ownership. The potential cost savings in origination, aggregation, and securitization could be around 85 basis points, according to the CEO of Figure, a blockchain mortgage provider. Additionally, blockchain has the potential to enhance liquidity in the mortgage market by facilitating smaller transaction sizes and expanding the investor base.",
      "However, there are regulatory hurdles and structural issues, including the dominance of the MERS registry and the standardized manner in which mortgage pools are sold, that need to be addressed before blockchain can be widely adopted in the mortgage industry."
    ],
    "commentBody": "",
    "commentSummary": [
      "-"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699709250966
  }
]
