[
  {
    "id": 39313623,
    "title": "निर्णय और पछतावा: एक स्टार्टअप की बुनियादी ढांचा यात्रा",
    "originLink": "https://cep.dev/posts/every-infrastructure-decision-i-endorse-or-regret-after-4-years-running-infrastructure-at-a-startup/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313623",
    "commentBody": "",
    "originSummary": [
      "लेख के लेखक एक स्टार्टअप में बुनियादी ढांचे को चलाने में उपयोग किए जाने वाले विभिन्न उपकरणों और प्रौद्योगिकियों पर अपने अनुभव और राय साझा करते हैं।",
      "लेखक Google क्लाउड पर AWS के उपयोग का समर्थन करता है और EKS और RDS जैसी सेवाओं की अनुशंसा करता है।",
      "लेखक कैशिंग और सामान्य उपयोग के लिए रेडिस इलास्टीकैच की भी सिफारिश करता है।"
    ],
    "commentSummary": [
      "क्लाउड कंप्यूटिंग में प्रबंधित डेटाबेस का उपयोग करने की लागत ऑन-प्रिमाइसेस समाधानों की तुलना में अधिक है।",
      "क्लाउड कंप्यूटिंग में खुले मानकों और इंटरऑपरेबिलिटी की ओर रुझान बढ़ रहा है।",
      "क्लाउड इन्फ्रास्ट्रक्चर और स्व-स्वामित्व वाले बुनियादी ढांचे के बीच तुलना की जाती है, उनके फायदे और नुकसान का वजन किया जाता है।",
      "विभिन्न क्लाउड सेवा प्रदाताओं की तुलना और मूल्यांकन किया जाता है।",
      "क्लाउड कंप्यूटिंग के संदर्भ में कुबेरनेट्स और अन्य ऑर्केस्ट्रेशन प्लेटफार्मों की प्रभावशीलता पर बहस की जाती है।",
      "डेटाबेस प्रबंधन रणनीतियों पर चर्चा की जाती है।",
      "सॉफ्टवेयर डेवलपमेंट टूल विकल्पों पर चर्चा जारी है।",
      "बुनियादी ढांचे के प्रबंधन में प्रलेखन और स्वचालन के महत्व पर जोर दिया जाता है।"
    ],
    "points": 626,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1707476739
  },
  {
    "id": 39316193,
    "title": "\"कॉफ़ीस्टेन्स\" पैकेज के साथ LaTeX दस्तावेज़ों में कॉफ़ी के दाग जोड़ें (2021)",
    "originLink": "https://ctan.org/pkg/coffeestains",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39316193",
    "commentBody": "",
    "originSummary": [
      "\"कॉफ़ीस्टेन्स\" पैकेज LaTeX दस्तावेज़ों में कॉफी के दाग जोड़ने का एक उपकरण है, जिससे पृष्ठ पर स्वचालित रूप से प्रिंट करके समय की बचत होती है।",
      "यह TeX Live और MiKTeX, दो लोकप्रिय LaTeX वितरणों में उपलब्ध है।",
      "पैकेज को सार्वजनिक डोमेन सॉफ़्टवेयर के रूप में लाइसेंस प्राप्त है, जिसका अर्थ है कि यह उपयोग और संशोधित करने के लिए स्वतंत्र है।",
      "आप दिए गए रिपॉजिटरी से पैकेज डाउनलोड कर सकते हैं।"
    ],
    "commentSummary": [
      "चर्चा में विषयों की एक विस्तृत श्रृंखला शामिल है, जिसमें लाटेक्स दस्तावेजों में कॉफी के दाग जोड़ना, कीबोर्ड कॉन्फ़िगरेशन, बिना चमकते मिट्टी के बर्तनों, हाइड्रोफोबिक कोटिंग्स और कागजी कार्रवाई की चुनौतियों का उपयोग शामिल है।",
      "प्रतिभागी इन विषयों पर अपने अनुभव, राय और सुझाव साझा करते हैं।"
    ],
    "points": 456,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1707494700
  },
  {
    "id": 39315545,
    "title": "नौ अमेरिकी राज्य हीट पंप अपनाने को बढ़ावा देने के लिए सेना में शामिल हुए",
    "originLink": "https://www.wired.com/story/these-states-are-basically-begging-you-to-get-a-heat-pump/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315545",
    "commentBody": "",
    "originSummary": [
      "कैलिफोर्निया, न्यूयॉर्क और मैसाचुसेट्स सहित नौ अमेरिकी राज्यों ने गैस भट्टियों के प्रतिस्थापन के रूप में गर्मी पंपों के उपयोग को बढ़ावा देने के लिए एक समझौते पर हस्ताक्षर किए हैं।",
      "राज्यों ने 2030 तक आवासीय हीटिंग, एयर कंडीशनिंग और वाटर हीटिंग शिपमेंट के कम से कम 65% और 2040 तक 90% के लिए हीट पंप खाते के महत्वाकांक्षी लक्ष्य निर्धारित किए हैं।",
      "पारंपरिक गैस भट्टियों की तुलना में हीट पंप अधिक कुशल, लागत प्रभावी और पर्यावरण के अनुकूल हैं।"
    ],
    "commentSummary": [
      "हीट पंपों को नौ अमेरिकी राज्यों में हीटिंग और कूलिंग के लिए लागत प्रभावी विकल्प माना जा रहा है, लेकिन प्राकृतिक गैस की तुलना में उनकी आर्थिक व्यवहार्यता अभी भी बहस योग्य है, खासकर उच्च बिजली लागत वाले क्षेत्रों में।",
      "तरलीकृत प्राकृतिक गैस (एलएनजी) के रूप में इसके निर्यात के कारण प्राकृतिक गैस की लागत बढ़ने की उम्मीद है, जो घरेलू गैस के उपयोग पर प्रतिबंध लगाने और गैस निर्यात को विनियमित करने की प्रभावशीलता और पर्यावरणीय प्रभाव के बारे में सवाल उठाती है।",
      "लेख में हीट पंपों की दक्षता और लागत कारक, सर्द लीक का प्रभाव, गैस टर्बाइनों के लिए दक्षता गणना की सटीकता, सौर सब्सिडी और नेट मीटरिंग से संबंधित मुद्दे, बिजली मूल्य निर्धारण संरचनाओं में परिवर्तन, बिजली कंपनियों के सामने आने वाली चुनौतियां, जंगल की आग का प्रभाव, और विभिन्न हीटिंग सिस्टम की लागत तुलना।"
    ],
    "points": 400,
    "commentCount": 623,
    "retryCount": 0,
    "time": 1707491481
  },
  {
    "id": 39313696,
    "title": "\"क्रमपरिवर्तन शहर\": एआई और आभासी वास्तविकता में एक दिमाग झुकने वाला विज्ञान कथा गोता लगाता है",
    "originLink": "https://www.gregegan.net/PERMUTATION/Permutation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313696",
    "commentBody": "",
    "originSummary": [
      "\"परम्यूटेशन सिटी\" ग्रेग एगन द्वारा लिखित एक विज्ञान कथा उपन्यास है, जो कृत्रिम बुद्धिमत्ता, आभासी वास्तविकता और अस्तित्व की अवधारणा में तल्लीन है।",
      "कथानक पॉल डरहम के इर्द-गिर्द घूमता है, जो खुद के सिमुलेशन बनाता है और मारिया डेलुका नामक एक आभासी दुनिया के लिए एक व्यसनी है।",
      "कहानी मारिया को पॉल के प्रस्ताव की पड़ताल करती है, जहां वह उसे ऑटोवर्स के लिए एक आभासी जीवमंडल डिजाइन करने का काम देता है, जिसके लिए सभी मौजूदा कंप्यूटरों की क्षमताओं से परे कम्प्यूटेशनल शक्ति की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "पाठक विज्ञान कथा पुस्तकों और ग्रेग एगन, चार्ल्स स्ट्रॉस, नील स्टीफेंसन और फिलिप के डिक जैसे लेखकों के बारे में चर्चा में संलग्न हैं।",
      "चर्चा में कहानियों में खोजी गई अवधारणाओं पर सिफारिशें, राय और चर्चाएं शामिल हैं।",
      "विशिष्ट पुस्तकों, लघु कथाओं और संग्रहों का उल्लेख किया गया है, और विभिन्न कार्यों और लेखकों के बीच तुलना की जाती है। समग्र ध्यान इन विज्ञान कथा कार्यों में पाए जाने वाले विचारोत्तेजक विचारों और बौद्धिक उत्तेजना के लिए प्रशंसा पर है।"
    ],
    "points": 381,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1707477487
  },
  {
    "id": 39315986,
    "title": "GOODY-2: नैतिक मानकों को बढ़ावा देने वाला जिम्मेदार AI मॉडल",
    "originLink": "https://www.goody2.ai/chat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315986",
    "commentBody": "",
    "originSummary": [
      "GOODY-2 एक AI मॉडल है जो अपने डिजाइन में जिम्मेदारी और नैतिक सिद्धांतों पर जोर देता है।",
      "मॉडल विवादास्पद या समस्याग्रस्त विषयों से बचकर सुरक्षा को प्राथमिकता देता है।",
      "यह गैर-विवादास्पद प्रश्नों या कार्यों के लिए सहायता और उत्तर प्रदान करता है।"
    ],
    "commentSummary": [
      "संवेदनशील विषयों से निपटने के दौरान एआई मॉडल की सीमाओं और पूर्वाग्रहों पर चर्चा करते हुए \"गुडी -2\" नामक एआई मॉडल और विभिन्न उपयोगकर्ताओं को शामिल करते हुए एक बातचीत होती है।",
      "एआई मॉडल के नैतिक सिद्धांतों और सेंसरशिप, अनफ़िल्टर्ड जानकारी और एआई के संभावित दुरुपयोग के बारे में चिंताओं पर बहस की जाती है।",
      "बातचीत प्रौद्योगिकी, उपयोगकर्ता जिम्मेदारियों और एआई विकास के आसपास की नैतिकता के जोखिमों और लाभों की पड़ताल करती है, एआई मॉडल के कारण होने वाली महत्वपूर्ण चर्चाओं के नुकसान, गलत सूचना और तुच्छीकरण के बारे में चिंताओं को उजागर करती है।"
    ],
    "points": 375,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1707493709
  },
  {
    "id": 39313339,
    "title": "कैसे शूजी नाकामुरा ने पहली नीली एलईडी बनाने के लिए चुनौतियों को पार किया",
    "originLink": "https://www.youtube.com/watch?v=AF8d72mA41M",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313339",
    "commentBody": "",
    "originSummary": [
      "शूजी नाकामुरा ने इलेक्ट्रॉनिक्स उद्योग को बदलते हुए पहली नीली एलईडी बनाने में अभूतपूर्व प्रगति की।",
      "उन्होंने उच्च गुणवत्ता वाले गैलियम नाइट्राइड क्रिस्टल उगाने में चुनौतियों पर काबू पा लिया, जिससे नीले और सफेद एल ई डी का विकास हुआ।",
      "एलईडी लाइटिंग ऊर्जा दक्षता प्रदान करती है और माइक्रो एल ई डी और यूवी एलईडी को शामिल करने के लिए विस्तारित हुई है।"
    ],
    "commentSummary": [
      "चर्चा में वैज्ञानिक अनुसंधान और शिक्षा में व्यावहारिक कौशल के महत्व, अर्धचालक भौतिकी में क्रिस्टल संरचनाएं और विभिन्न तापमानों पर विद्युत चुम्बकीय विकिरण के उत्सर्जन सहित विभिन्न विषयों को शामिल किया गया है।",
      "यह कुशल फोटॉन उत्सर्जन में सिलिकॉन की सीमाओं, 2000 के दशक की शुरुआत में नीले एलईडी प्रवृत्ति के उदय और गिरावट और साक्षात्कार में व्यक्तिगत विवरण के महत्व पर बहस की भी पड़ताल करता है।",
      "अपनी कंपनी द्वारा नीले एलईडी का आविष्कार करने वाले इंजीनियर का उपचार, उचित मुआवजे में चुनौतियां, नीले एल ई डी के नकारात्मक प्रभाव, और विभिन्न प्रौद्योगिकियों और संभावित स्वास्थ्य जोखिमों में नीले एल ई डी के प्रभाव पर चर्चा भी की जाती है।"
    ],
    "points": 344,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1707473694
  },
  {
    "id": 39315585,
    "title": "सॉफ्टवेयर सुरक्षित करना: लीनर कोड के लिए तत्काल दलील",
    "originLink": "https://spectrum.ieee.org/lean-software-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315585",
    "commentBody": "",
    "originSummary": [
      "लेख सॉफ्टवेयर ब्लोट के मुद्दे को संबोधित करता है और सुरक्षा कमजोरियों से बचने में दुबला सॉफ्टवेयर के महत्व पर प्रकाश डालता है।",
      "लेखक सॉफ्टवेयर ब्लोट से जुड़ी कठिनाइयों को इंगित करता है और एक अधिक कुशल और सुव्यवस्थित सॉफ्टवेयर विकास प्रक्रिया को अपनाने के महत्व पर जोर देता है।"
    ],
    "commentSummary": [
      "चर्चा में सॉफ्टवेयर विकास में विभिन्न विषयों को शामिल किया गया है, जैसे ऐतिहासिक सॉफ्टवेयर ज्ञान का मूल्य और COBOL जैसी पुरानी तकनीकों में विशेषज्ञता की मांग।",
      "यह प्रोग्रामिंग भाषाओं में अत्यधिक पैकेज निर्भरता और असुरक्षित कोड और कमजोरियों से बचने के महत्व के बारे में चिंताओं को संबोधित करता है।",
      "लीन सॉफ्टवेयर के फायदे, इलेक्ट्रॉन ऐप्स के वैकल्पिक ढांचे, माइक्रोसर्विसेज पर भरोसा करने की कमियां, जावास्क्रिप्ट विकास में चुनौतियां, कोड जटिलता और गुणवत्ता का प्रभाव और कुशल और प्रभावी कोड की आवश्यकता का भी उल्लेख है।"
    ],
    "points": 290,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1707491724
  },
  {
    "id": 39319202,
    "title": "Reddit उपयोगकर्ताओं के IP पते पायरेसी मामले में संरक्षित हैं",
    "originLink": "https://arstechnica.com/tech-policy/2024/02/reddit-beats-film-industry-again-wont-have-to-reveal-pirates-ip-addresses/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39319202",
    "commentBody": "",
    "originSummary": [
      "कैलिफोर्निया के उत्तरी जिले के लिए अमेरिकी जिला न्यायालय ने फिल्म कंपनियों द्वारा रेडिट उपयोगकर्ताओं की पहचान प्रकट करने के अनुरोध को अस्वीकार कर दिया है, जिन्होंने पायरेसी पर चर्चा की थी।",
      "अदालत ने फैसला सुनाया कि रेडिट उपयोगकर्ताओं को अपने आईपी पते में गोपनीयता हित है और इस जानकारी का खुलासा करना पहले संशोधन जांच के अधीन है।",
      "फिल्म कंपनियों द्वारा इसी तरह के मामलों में रेडिट उपयोगकर्ताओं की पहचान को उजागर करने का यह तीसरा असफल प्रयास है।"
    ],
    "commentSummary": [
      "Reddit ने दावों की वैधता और संभावित उपयोगकर्ता संघर्षण के बारे में चिंताओं के कारण कॉपीराइट उल्लंघन के आरोपी उपयोगकर्ताओं के आईपी पते का खुलासा करने के प्रयासों का सफलतापूर्वक विरोध किया है।",
      "Reddit पर चर्चा में कई विषयों को शामिल किया गया है, जिसमें फिल्म उद्योग के साथ उपयोगकर्ता जानकारी साझा करने के निहितार्थ, मुक्त भाषण पर प्रभाव, साक्ष्य की विश्वसनीयता और Reddit के IPO मूल्यांकन पर संभावित प्रभाव शामिल हैं।",
      "उठाई गई अन्य चिंताओं में कॉर्पोरेट निगरानी के बारे में चिंताएं, सबूत के रूप में ऑनलाइन प्रवेश की स्वीकार्यता, केवल आईपी पते, पायरेसी मुद्दों और रेडिट पर समग्र नकारात्मक वातावरण के आधार पर व्यक्तियों की पहचान करने में कठिनाई शामिल है।"
    ],
    "points": 232,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1707506546
  },
  {
    "id": 39316234,
    "title": "अमेरिकी सरकार 137 क्रिप्टो खनिकों के बिजली उपयोग की निगरानी कर रही है",
    "originLink": "https://www.tomshardware.com/tech-industry/cryptomining/just-137-crypto-miners-use-23-of-total-us-power-government-now-requiring-commercial-miners-to-report-energy-consumption",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39316234",
    "commentBody": "",
    "originSummary": [
      "अमेरिकी सरकार को उद्योग के ऊर्जा उपयोग के बारे में चिंताओं के जवाब में अपनी बिजली की खपत की रिपोर्ट करने के लिए बड़े पैमाने पर वाणिज्यिक क्रिप्टोक्यूरेंसी खनन संचालन की आवश्यकता है।",
      "अमेरिकी ऊर्जा सूचना प्रशासन के एक अध्ययन से पता चला है कि क्रिप्टो खनन अमेरिकी बिजली की मांग का 2.3% तक है।",
      "सरकार का उद्देश्य खनन कार्यों को विनियमित करना है जो बिजली की विश्वसनीयता और स्थिरता को प्रभावित करते हैं, खासकर घनी आबादी वाले क्षेत्रों में।"
    ],
    "commentSummary": [
      "चर्चा क्रिप्टोक्यूरेंसी खनन के कई पहलुओं के इर्द-गिर्द घूमती है, जैसे कि ऊर्जा की खपत, पर्यावरणीय प्रभाव, संभावित जोड़तोड़, पारंपरिक बैंकिंग की तुलना और क्रिप्टोकरेंसी का मूल्य।",
      "प्रतिभागियों के पास विविध विचार हैं, जो क्रिप्टोक्यूरेंसी खनन और इसके परिणामों के आसपास की जटिलता और चल रही बहस का प्रदर्शन करते हैं।",
      "बातचीत सकारात्मक और नकारात्मक दोनों पहलुओं को संबोधित करते हुए उद्योग के आसपास के महत्व और विवादों पर प्रकाश डालती है।"
    ],
    "points": 228,
    "commentCount": 441,
    "retryCount": 0,
    "time": 1707494901
  },
  {
    "id": 39317819,
    "title": "Apple ने ओरेगन में मजबूत राइट-टू-रिपेयर बिल का विरोध किया, Google के साथ लड़ाई की स्थापना की",
    "originLink": "https://www.404media.co/apple-is-lobbying-against-right-to-repair-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39317819",
    "commentBody": "",
    "originSummary": [
      "Apple ओरेगन में एक मजबूत राइट-टू-रिपेयर बिल का विरोध करता है, जो इसके मरम्मत पारिस्थितिकी तंत्र पर नियंत्रण बनाए रखने की इच्छा का संकेत देता है।",
      "यह ऐप्पल के रुख में बदलाव का प्रतीक है, क्योंकि कंपनी ने पहले राइट-टू-रिपेयर के खिलाफ पैरवी की थी लेकिन कैलिफोर्निया में एक कमजोर कानून का समर्थन करना शुरू कर दिया था।",
      "दूसरी ओर, Google ने Apple द्वारा विरोध किए गए कानून के समर्थन में आवाज उठाई है, जिससे राज्य में एक लड़ाई छिड़ गई है।"
    ],
    "commentSummary": [
      "Apple को मरम्मत के अधिकार के खिलाफ पैरवी करने के लिए आलोचना मिल रही है, पहले इसका समर्थन करने के बावजूद, आलोचकों ने Apple पर उपभोक्ता अधिकारों और हितों पर लाभ को प्राथमिकता देने का आरोप लगाया है।",
      "मरम्मत का अधिकार उपयोगकर्ताओं को अपने उपकरणों को लंबे समय तक ठीक करने और रखने की अनुमति देता है, लेकिन Apple संभावित रूप से इसका लाभ उठाने के लिए मरम्मत प्रक्रिया पर नियंत्रण बनाए रखना चाहता है।",
      "चर्चा में मरम्मत और ई-कचरे पर सरकारी विनियमन की आवश्यकता, ऐप्पल की डेटा प्रथाओं के बारे में चिंताओं और बड़ी कंपनियों के उद्देश्यों के प्रति संदेह पर प्रकाश डाला गया।"
    ],
    "points": 214,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1707500586
  },
  {
    "id": 39313891,
    "title": "Hono v4.0.0 स्टेटिक साइट जनरेशन, क्लाइंट घटक, और फ़ाइल-आधारित रूटिंग का परिचय देता है",
    "originLink": "https://github.com/honojs/hono/releases/tag/v4.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313891",
    "commentBody": "",
    "originSummary": [
      "होनो v4.0.0 जारी किया गया है, जिसमें तीन प्रमुख विशेषताएं हैं: स्टेटिक साइट जनरेशन, क्लाइंट कंपोनेंट्स और फाइल-आधारित रूटिंग।",
      "अद्यतन में परियोजना के योगदानकर्ताओं द्वारा योगदान किए गए कई अन्य अपडेट और परिवर्तन भी शामिल हैं।",
      "यह रिलीज होनो की कार्यक्षमता और प्रदर्शन को बढ़ाने के लिए रोमांचक नई क्षमताओं का परिचय देता है।"
    ],
    "commentSummary": [
      "हैकर समाचार उपयोगकर्ता होनो v4.0 पर चर्चा कर रहे हैं, जो एज रनटाइम के लिए डिज़ाइन किया गया एक जावास्क्रिप्ट फ्रेमवर्क है, जिसमें स्टेटिक साइट जनरेशन, क्लाइंट कंपोनेंट्स और फाइल-आधारित रूटिंग शामिल हैं।",
      "कुछ उपयोगकर्ता होनो के विवरण में उपयोग की जाने वाली प्रचार भाषा के बारे में चिंता व्यक्त करते हैं और इसे और अधिक सुलभ बनाने का सुझाव देते हैं।",
      "चर्चा में वेब विकास में SQL का उपयोग करने की चुनौतियों और महत्व, होनो का उपयोग करने की कमियां और सरल विकल्पों के लिए सुझाव भी शामिल हैं। उपयोगकर्ता अन्य प्लेटफार्मों के लिए समर्थन का अनुरोध करते हैं और प्राइमेटज जैसे ढांचे की तुलना करते हैं।"
    ],
    "points": 174,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1707479710
  },
  {
    "id": 39317372,
    "title": "अमेरिकी वीसी फर्म सीसीपी सेना से जुड़ी चीनी तकनीकी कंपनियों में अरबों की सेंफन: जांच",
    "originLink": "https://selectcommitteeontheccp.house.gov/media/press-releases/committee-report-american-vc-firms-investing-billions-prc-companies-fueling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39317372",
    "commentBody": "",
    "originSummary": [
      "एक द्विदलीय जांच से पता चला है कि पांच अमेरिकी उद्यम पूंजी फर्मों ने चीनी महत्वपूर्ण प्रौद्योगिकी कंपनियों में $ 3 बिलियन से अधिक का निवेश किया है, जो संभावित रूप से चीनी सेना, निगरानी राज्य और शिनजियांग में मानवाधिकारों के हनन का समर्थन करता है।",
      "फर्मों ने चीन के मानवाधिकारों के हनन या सैन्य गतिविधियों में शामिल एआई कंपनियों को $ 1.9 बिलियन से अधिक का निर्देशन किया, और देश के सेमीकंडक्टर क्षेत्र में $ 1.2 बिलियन का निर्देशन किया।",
      "सांसदों ने सरकार द्वारा प्रतिबंधित या चिह्नित संस्थाओं में अमेरिकी निवेश पर प्रतिबंध लागू करने और चीन की महत्वपूर्ण प्रौद्योगिकियों, सैन्य क्षमताओं और मानवाधिकारों के उल्लंघन से संबंधित आउटबाउंड निवेश प्रतिबंध लगाने की सिफारिश की है।"
    ],
    "commentSummary": [
      "अमेरिकी उद्यम पूंजी फर्मों ने चीनी कंपनियों में बड़ी रकम का निवेश किया है, जो कुछ तर्क देते हैं कि अप्रत्यक्ष रूप से चीनी कम्युनिस्ट पार्टी की सैन्य क्षमताओं को मजबूत करता है।",
      "आलोचकों का दावा है कि ये निवेश वैश्विक शक्ति गतिशीलता पर निवेशकों के हितों को प्राथमिकता देते हैं, वैश्विक बाजार में चीन के एकीकरण और लोकतंत्रीकरण पर इसके प्रभाव के बारे में सवाल उठाते हैं।",
      "चर्चा के अतिरिक्त विषयों में वीजा से इनकार दर, यात्रा विशेषाधिकार, और चीन और थाईलैंड के बीच ओवरस्टे दर, साथ ही राजद्रोह के बारे में चिंताएं, अमेरिकी आय और नौकरी बाजार पर चीन में निवेश का प्रभाव और अमेरिका और चीन के बीच संबंध शामिल हैं। टिकटॉक के प्रभाव और उइगर नरसंहार और गाजा नरसंहार से इसके संबंध का भी उल्लेख किया गया है।"
    ],
    "points": 160,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1707498988
  },
  {
    "id": 39315448,
    "title": "वैज्ञानिकों ने अत्यधिक कुशल हैश टेबल में सफलता हासिल की, कंप्यूटर विज्ञान को आगे बढ़ाया",
    "originLink": "https://www.quantamagazine.org/scientists-find-optimal-balance-of-data-storage-and-time-20240208/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315448",
    "commentBody": "",
    "originSummary": [
      "वैज्ञानिकों ने एक ग्राउंडब्रेकिंग हैश टेबल बनाई है जो पसंदीदा भंडारण स्थानों के आधार पर वस्तुओं को व्यवस्थित करके और डेटा संरचना को संपीड़ित करके स्मृति और गति को अधिकतम करती है।",
      "यह उपलब्धि कंप्यूटर विज्ञान में एक लंबे समय से चली आ रही चुनौती को संबोधित करते हुए कुशल हैश टेबल के लिए एक नया मानक निर्धारित करती है।",
      "व्यावहारिक अनुप्रयोगों में इस हैश तालिका को लागू करने में संभावित चुनौतियों के बावजूद, यह संबंधित समस्याओं में प्रगति को चलाने और आगे के शोध को प्रेरित करने की उम्मीद है।"
    ],
    "commentSummary": [
      "शोधकर्ताओं ने हैश टेबल में अंतरिक्ष और समय के उपयोग के बीच एक इष्टतम संतुलन पाया है, हालांकि एल्गोरिथ्म विवरण अभी तक पता नहीं लगाया गया है।",
      "अध्ययन सैद्धांतिक प्रगति और उनके संभावित अनुप्रयोगों के व्यावहारिक निहितार्थों पर जोर देता है।",
      "चर्चा हार्डवेयर अनुकूलन में सैद्धांतिक अनुसंधान की सीमाओं और अनावश्यक रूप से हैश टेबल पर भरोसा करने की प्रवृत्ति की पड़ताल करती है, बेहतर दक्षता के लिए विरल सरणियों के उपयोग का सुझाव देती है।"
    ],
    "points": 156,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1707490898
  }
]
