[
  {
    "id": 39313623,
    "title": "القرارات والندم: رحلة البنية التحتية للشركات الناشئة",
    "originLink": "https://cep.dev/posts/every-infrastructure-decision-i-endorse-or-regret-after-4-years-running-infrastructure-at-a-startup/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313623",
    "commentBody": "",
    "originSummary": [
      "يشارك مؤلف المقال تجاربهم وآرائهم حول الأدوات والتقنيات المختلفة المستخدمة في تشغيل البنية التحتية في شركة ناشئة.",
      "يؤيد المؤلف استخدام AWS عبر Google Cloud ويوصي بخدمات مثل EKS و RDS.",
      "يوصي المؤلف أيضا Redis ElastiCache للتخزين المؤقت والاستخدام العام."
    ],
    "commentSummary": [
      "تكلفة استخدام قواعد البيانات المدارة في الحوسبة السحابية أعلى مقارنة بالحلول المحلية.",
      "هناك اتجاه متزايد نحو المعايير المفتوحة وقابلية التشغيل البيني في الحوسبة السحابية.",
      "يتم إجراء مقارنات بين البنية التحتية السحابية والبنية التحتية المملوكة ذاتيا ، مع موازنة مزاياها وعيوبها.",
      "تتم مقارنة وتقييم مزودي الخدمات السحابية المختلفين.",
      "تتم مناقشة فعالية Kubernetes ومنصات التنسيق الأخرى في سياق الحوسبة السحابية.",
      "تتم مناقشة استراتيجيات إدارة قواعد البيانات.",
      "ولا تزال المناقشات جارية بشأن خيارات أدوات تطوير البرمجيات.",
      "يتم التأكيد على أهمية التوثيق والأتمتة في إدارة البنية التحتية."
    ],
    "points": 626,
    "commentCount": 298,
    "retryCount": 0,
    "time": 1707476739
  },
  {
    "id": 39316193,
    "title": "أضف بقع القهوة إلى مستندات LaTeX مع حزمة \"بقع القهوة\" (2021)",
    "originLink": "https://ctan.org/pkg/coffeestains",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39316193",
    "commentBody": "",
    "originSummary": [
      "حزمة \"coffeestains\" هي أداة لإضافة بقع القهوة إلى مستندات LaTeX ، مما يوفر الوقت عن طريق طباعتها تلقائيا على الصفحة.",
      "وهي متوفرة في TeX Live و MiKTeX ، وهما توزيعات LaTeX شائعة.",
      "الحزمة مرخصة كبرنامج ملكية عامة ، مما يعني أنها مجانية للاستخدام والتعديل.",
      "يمكنك تنزيل الحزمة من المستودع المقدم."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة واسعة من الموضوعات ، بما في ذلك إضافة بقع القهوة إلى مستندات LaTeX ، وتكوين لوحة المفاتيح ، واستخدام الفخار غير المزجج ، والطلاءات الكارهة للماء ، وتحديات الأعمال الورقية.",
      "يتبادل المشاركون خبراتهم وآرائهم واقتراحاتهم حول هذه الموضوعات."
    ],
    "points": 456,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1707494700
  },
  {
    "id": 39315545,
    "title": "تسع ولايات أمريكية توحد قواها لتعزيز اعتماد المضخات الحرارية",
    "originLink": "https://www.wired.com/story/these-states-are-basically-begging-you-to-get-a-heat-pump/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315545",
    "commentBody": "",
    "originSummary": [
      "وقعت تسع ولايات أمريكية ، بما في ذلك كاليفورنيا ونيويورك وماساتشوستس ، اتفاقية لتعزيز استخدام المضخات الحرارية كبديل لأفران الغاز.",
      "وضعت الولايات أهدافا طموحة لجعل المضخات الحرارية تمثل ما لا يقل عن 65٪ من شحنات التدفئة السكنية وتكييف الهواء وتسخين المياه بحلول عام 2030 ، و 90٪ بحلول عام 2040.",
      "تعتبر المضخات الحرارية أكثر كفاءة وفعالية من حيث التكلفة وصديقة للبيئة مقارنة بأفران الغاز التقليدية."
    ],
    "commentSummary": [
      "تعتبر المضخات الحرارية بديلا فعالا من حيث التكلفة للتدفئة والتبريد في تسع ولايات أمريكية ، لكن جدواها الاقتصادية مقارنة بالغاز الطبيعي لا تزال قابلة للنقاش ، خاصة في المناطق ذات تكاليف الكهرباء المرتفعة.",
      "من المتوقع أن ترتفع تكلفة الغاز الطبيعي بسبب تصديره كغاز طبيعي مسال (LNG) ، مما يثير تساؤلات حول الفعالية والتأثير البيئي لحظر استخدام الغاز المحلي وتنظيم صادرات الغاز.",
      "يغطي المقال أيضا عوامل الكفاءة والتكلفة للمضخات الحرارية ، وتأثير تسرب المبردات ، ودقة حسابات الكفاءة لتوربينات الغاز ، والقضايا المتعلقة بدعم الطاقة الشمسية والقياس الصافي ، والتغيرات في هياكل تسعير الكهرباء ، والتحديات التي تواجهها شركات الكهرباء ، وتأثير حرائق الغابات ، ومقارنات التكلفة لأنظمة التدفئة المختلفة."
    ],
    "points": 400,
    "commentCount": 623,
    "retryCount": 0,
    "time": 1707491481
  },
  {
    "id": 39313696,
    "title": "\"مدينة التقليب\": خيال علمي محير للعقل يغوص في الواقع الذكاء الاصطناعي والافتراضي",
    "originLink": "https://www.gregegan.net/PERMUTATION/Permutation.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313696",
    "commentBody": "",
    "originSummary": [
      "\"مدينة التقليب\" هي رواية خيال علمي كتبها جريج إيجان ، وتتعمق في الذكاء الاصطناعي والواقع الافتراضي ومفهوم الوجود.",
      "تدور الحبكة حول بول دورهام ، الذي يخلق محاكاة لنفسه ومدمن على عالم افتراضي يدعى ماريا ديلوكا.",
      "تستكشف القصة عرض بول لماريا ، حيث يكلفها بتصميم محيط حيوي افتراضي ل Autoverse ، مما يتطلب قوة حسابية تتجاوز قدرات جميع أجهزة الكمبيوتر الموجودة."
    ],
    "commentSummary": [
      "يشارك القراء في مناقشة حول كتب الخيال العلمي والمؤلفين مثل جريج إيجان وتشارلز ستروس ونيل ستيفنسون وفيليب ك. ديك.",
      "تتضمن المناقشة توصيات وآراء ومناقشات حول المفاهيم التي تم استكشافها في القصص.",
      "يتم ذكر كتب وقصص قصيرة ومجموعات محددة ، ويتم إجراء مقارنات بين الأعمال والمؤلفين المختلفين. ينصب التركيز العام على تقدير الأفكار المثيرة للتفكير والتحفيز الفكري الموجود في أعمال الخيال العلمي هذه."
    ],
    "points": 381,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1707477487
  },
  {
    "id": 39315986,
    "title": "قودي-2: نموذج الذكاء الاصطناعي المسؤول لتعزيز المعايير الأخلاقية",
    "originLink": "https://www.goody2.ai/chat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315986",
    "commentBody": "",
    "originSummary": [
      "قودي-2 هو نموذج الذكاء الاصطناعي يؤكد على المسؤولية والمبادئ الأخلاقية في تصميمه.",
      "يعطي النموذج الأولوية للسلامة من خلال تجنب الموضوعات المثيرة للجدل أو الإشكالية.",
      "يوفر المساعدة والإجابات على الاستفسارات أو المهام غير المثيرة للجدل."
    ],
    "commentSummary": [
      "تجري محادثة تتضمن نموذجا الذكاء الاصطناعي يسمى \"قودي -2\" ومستخدمين مختلفين ، وتناقش قيود وتحيزات النماذج الذكاء الاصطناعي عند معالجة الموضوعات الحساسة.",
      "تتم مناقشة المبادئ الأخلاقية لنموذج الذكاء الاصطناعي والمخاوف بشأن الرقابة والمعلومات غير المفلترة وإساءة الاستخدام المحتملة الذكاء الاصطناعي.",
      "تستكشف المحادثة مخاطر وفوائد التكنولوجيا ومسؤوليات المستخدم والأخلاقيات المحيطة بتطوير الذكاء الاصطناعي ، وتسليط الضوء على المخاوف بشأن الضرر والمعلومات الخاطئة والتقليل من شأن المناقشات المهمة التي تسببها نماذج الذكاء الاصطناعي."
    ],
    "points": 375,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1707493709
  },
  {
    "id": 39313339,
    "title": "كيف تغلب شوجي ناكامورا على التحديات لإنشاء أول مصباح LED أزرق",
    "originLink": "https://www.youtube.com/watch?v=AF8d72mA41M",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313339",
    "commentBody": "",
    "originSummary": [
      "حقق شوجي ناكامورا تقدما رائدا في إنشاء أول مصباح LED أزرق ، مما أدى إلى تحويل صناعة الإلكترونيات.",
      "لقد تغلب على التحديات في زراعة بلورات نيتريد الغاليوم عالية الجودة ، مما أدى إلى تطوير مصابيح LED زرقاء وبيضاء.",
      "توفر إضاءة LED كفاءة في استخدام الطاقة وقد توسعت لتشمل مصابيح LED الصغيرة ومصابيح LED للأشعة فوق البنفسجية."
    ],
    "commentSummary": [
      "تغطي المناقشة مواضيع مختلفة بما في ذلك أهمية المهارات العملية في البحث العلمي والأوساط الأكاديمية ، والهياكل البلورية في فيزياء أشباه الموصلات ، وانبعاث الإشعاع الكهرومغناطيسي في درجات حرارة مختلفة.",
      "كما يستكشف قيود السيليكون في انبعاث الفوتون الفعال ، وصعود وانخفاض اتجاه LED الأزرق في أوائل عام 2000 ، والمناقشات حول أهمية التفاصيل الشخصية في المقابلات.",
      "كما تتم مناقشة معاملة المهندس الذي اخترع LED الأزرق من قبل شركته ، والتحديات في التعويض العادل ، والآثار السلبية لمصابيح LED الزرقاء ، والمناقشات حول تأثير مصابيح LED الزرقاء في مختلف التقنيات والمخاطر الصحية المحتملة."
    ],
    "points": 344,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1707473694
  },
  {
    "id": 39315585,
    "title": "تأمين البرمجيات: النداء العاجل للحصول على كود أصغر حجما",
    "originLink": "https://spectrum.ieee.org/lean-software-development",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315585",
    "commentBody": "",
    "originSummary": [
      "تتناول المقالة مسألة سخام البرامج وتسلط الضوء على أهمية البرامج الخالية من الهدر في تجنب الثغرات الأمنية.",
      "يشير المؤلف إلى الصعوبات المرتبطة بتضخم البرامج ويشدد على أهمية اعتماد عملية تطوير برمجيات أكثر كفاءة وانسيابية."
    ],
    "commentSummary": [
      "تغطي المناقشة مواضيع مختلفة في تطوير البرمجيات ، مثل قيمة المعرفة التاريخية للبرمجيات والطلب على الخبرة في التقنيات القديمة مثل COBOL.",
      "يعالج المخاوف المتعلقة بتبعيات الحزمة المفرطة في لغات البرمجة وأهمية تجنب التعليمات البرمجية ونقاط الضعف غير الآمنة.",
      "هناك أيضا ذكر لمزايا البرامج الخالية من الهدر ، والأطر البديلة لتطبيقات Electron ، وعيوب الاعتماد على الخدمات المصغرة ، والتحديات في تطوير JavaScript ، وتأثير تعقيد الكود وجودته ، والحاجة إلى كود فعال وفعال."
    ],
    "points": 290,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1707491724
  },
  {
    "id": 39319202,
    "title": "عناوين IP لمستخدمي Reddit محمية في حالة القرصنة",
    "originLink": "https://arstechnica.com/tech-policy/2024/02/reddit-beats-film-industry-again-wont-have-to-reveal-pirates-ip-addresses/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39319202",
    "commentBody": "",
    "originSummary": [
      "رفضت المحكمة الجزئية الأمريكية للمنطقة الشمالية من كاليفورنيا طلبا من شركات الأفلام للكشف عن هويات مستخدمي Reddit الذين ناقشوا القرصنة.",
      "قضت المحكمة بأن مستخدمي Reddit لديهم مصلحة خصوصية في عناوين IP الخاصة بهم وأن الكشف عن هذه المعلومات يخضع للتدقيق في التعديل الأول.",
      "هذه هي المحاولة الثالثة الفاشلة من قبل شركات الأفلام للكشف عن هويات مستخدمي Reddit في حالات مماثلة."
    ],
    "commentSummary": [
      "قاوم Reddit بنجاح الجهود المبذولة للكشف عن عناوين IP للمستخدمين المتهمين بانتهاك حقوق الطبع والنشر بسبب مخاوف بشأن صحة المطالبات واستنزاف المستخدم المحتمل.",
      "تغطي المناقشات على Reddit مجموعة من الموضوعات ، بما في ذلك الآثار المترتبة على مشاركة معلومات المستخدم مع صناعة السينما ، والتأثير على حرية التعبير ، ومصداقية الأدلة ، والتأثير المحتمل على تقييم الاكتتاب العام لشركة Reddit.",
      "تشمل المخاوف الأخرى التي أثيرت المخاوف بشأن مراقبة الشركات ، ومقبولية القبول عبر الإنترنت كدليل ، وصعوبة تحديد الأفراد بناء على عناوين IP فقط ، وقضايا القرصنة ، والجو السلبي العام على Reddit."
    ],
    "points": 232,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1707506546
  },
  {
    "id": 39316234,
    "title": "الحكومة الأمريكية تراقب استخدام الطاقة ل 137 من عمال مناجم العملات المشفرة",
    "originLink": "https://www.tomshardware.com/tech-industry/cryptomining/just-137-crypto-miners-use-23-of-total-us-power-government-now-requiring-commercial-miners-to-report-energy-consumption",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39316234",
    "commentBody": "",
    "originSummary": [
      "تطلب حكومة الولايات المتحدة من عمليات تعدين العملات المشفرة التجارية واسعة النطاق الإبلاغ عن استهلاكها للطاقة استجابة للمخاوف المتعلقة باستخدام الطاقة في الصناعة.",
      "كشفت دراسة أجرتها إدارة معلومات الطاقة الأمريكية أن تعدين العملات المشفرة يمثل ما يصل إلى 2.3٪ من الطلب على الطاقة في الولايات المتحدة.",
      "تهدف الحكومة إلى تنظيم عمليات التعدين التي تؤثر على موثوقية الطاقة واستدامتها ، لا سيما في المناطق المكتظة بالسكان."
    ],
    "commentSummary": [
      "تدور المناقشة حول جوانب متعددة من تعدين العملات المشفرة ، مثل استهلاك الطاقة ، والتأثير البيئي ، والتلاعب المحتمل ، والمقارنات مع الخدمات المصرفية التقليدية ، وقيمة العملات المشفرة.",
      "لدى المشاركين وجهات نظر متنوعة ، مما يدل على التعقيد والنقاش المستمر المحيط بتعدين العملات المشفرة وعواقبه.",
      "تسلط المحادثة الضوء على الأهمية والخلافات المحيطة بالصناعة ، وتتناول الجوانب الإيجابية والسلبية."
    ],
    "points": 228,
    "commentCount": 441,
    "retryCount": 0,
    "time": 1707494901
  },
  {
    "id": 39317819,
    "title": "أبل تعارض مشروع قانون قوي للحق في الإصلاح في ولاية أوريغون ، وتقيم معركة مع جوجل",
    "originLink": "https://www.404media.co/apple-is-lobbying-against-right-to-repair-again/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39317819",
    "commentBody": "",
    "originSummary": [
      "تعارض Apple مشروع قانون قوي للحق في الإصلاح في ولاية أوريغون ، مما يشير إلى الرغبة في الحفاظ على السيطرة على نظامها البيئي للإصلاح.",
      "يمثل هذا تحولا في موقف Apple ، حيث ضغطت الشركة سابقا ضد الحق في الإصلاح لكنها بدأت في دعم قانون أضعف في كاليفورنيا.",
      "من ناحية أخرى ، أعربت Google عن دعمها للتشريع الذي تعارضه Apple ، مما أدى إلى معركة في الولاية."
    ],
    "commentSummary": [
      "وتتعرض شركة آبل لانتقادات بسبب الضغط ضد الحق في الإصلاح، على الرغم من دعمها له سابقا، حيث يتهم النقاد شركة آبل بإعطاء الأولوية للربح على حقوق المستهلك ومصالحه.",
      "يسمح الحق في الإصلاح للمستخدمين بإصلاح أجهزتهم والاحتفاظ بها لفترة أطول ، لكن Apple تريد الحفاظ على السيطرة على عملية الإصلاح للاستفادة منها.",
      "تسلط المناقشة الضوء على الحاجة إلى تنظيم حكومي بشأن قابلية الإصلاح والنفايات الإلكترونية ، والمخاوف بشأن ممارسات بيانات Apple ، والشكوك تجاه دوافع الشركات الكبرى."
    ],
    "points": 214,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1707500586
  },
  {
    "id": 39313891,
    "title": "يقدم Hono v4.0.0 إنشاء موقع ثابت ومكونات العميل والتوجيه المستند إلى الملفات",
    "originLink": "https://github.com/honojs/hono/releases/tag/v4.0.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39313891",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Hono v4.0.0 ، مما يوفر ثلاث ميزات رئيسية: إنشاء موقع ثابت ، ومكونات العميل ، والتوجيه المستند إلى الملفات.",
      "يتضمن التحديث أيضا العديد من التحديثات والتغييرات الأخرى التي ساهم بها المساهمون في المشروع.",
      "يقدم هذا الإصدار إمكانات جديدة ومثيرة لتحسين وظائف وأداء Hono."
    ],
    "commentSummary": [
      "يناقش مستخدمو Hacker News Hono v4.0 ، وهو إطار عمل جافا سكريبت مصمم لأوقات تشغيل الحافة ، ويضم إنشاء موقع ثابت ومكونات العميل والتوجيه المستند إلى الملفات.",
      "يعبر بعض المستخدمين عن مخاوفهم بشأن اللغة الترويجية المستخدمة في وصف هونو ويقترحون جعلها أكثر سهولة.",
      "تغطي المناقشة أيضا تحديات وأهمية استخدام SQL في تطوير الويب ، وعيوب استخدام Hono ، واقتراحات لبدائل أبسط. يطلب المستخدمون الدعم لمنصات أخرى ويجرون مقارنات مع أطر عمل مثل primatejs."
    ],
    "points": 174,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1707479710
  },
  {
    "id": 39317372,
    "title": "شركات رأس المال المغامر الأمريكية تسحب المليارات إلى شركات التكنولوجيا الصينية المرتبطة بجيش الحزب الشيوعي الصيني: التحقيق",
    "originLink": "https://selectcommitteeontheccp.house.gov/media/press-releases/committee-report-american-vc-firms-investing-billions-prc-companies-fueling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39317372",
    "commentBody": "",
    "originSummary": [
      "كشف تحقيق أجراه الحزبان أن خمس شركات رأس مال استثماري أمريكية استثمرت أكثر من 3 مليارات دولار في شركات التكنولوجيا الحيوية الصينية، مما قد يدعم الجيش الصيني، ودولة المراقبة، وانتهاكات حقوق الإنسان في شينجيانغ.",
      "ووجهت الشركات أكثر من 1.9 مليار دولار إلى الذكاء الاصطناعي شركة متورطة في انتهاكات حقوق الإنسان أو الأنشطة العسكرية في الصين، و1.2 مليار دولار أخرى إلى قطاع أشباه الموصلات في البلاد.",
      "يوصي المشرعون بفرض قيود على الاستثمارات الأمريكية في الكيانات التي تعاقبها الحكومة أو تبلغها وفرض قيود على الاستثمار الخارجي تتعلق بالتقنيات الحيوية والقدرات العسكرية وانتهاكات حقوق الإنسان في الصين."
    ],
    "commentSummary": [
      "استثمرت شركات رأس المال الاستثماري الأمريكية مبالغ كبيرة من المال في الشركات الصينية ، والتي يجادل البعض بأنها تعزز بشكل غير مباشر القدرات العسكرية للحزب الشيوعي الصيني.",
      "يزعم النقاد أن هذه الاستثمارات تعطي الأولوية لمصالح المستثمرين على ديناميكيات القوة العالمية، مما يثير تساؤلات حول اندماج الصين في السوق العالمية وتأثيره على التحول الديمقراطي.",
      "وتشمل الموضوعات الإضافية للمناقشة معدلات رفض التأشيرات، وامتيازات السفر، ومعدلات تجاوز مدة الإقامة بين الصين وتايلاند، فضلا عن المخاوف بشأن الخيانة، وتأثير الاستثمار في الصين على الدخل الأمريكي وسوق العمل، والعلاقة بين الولايات المتحدة والصين. كما تم ذكر تأثير TikTok وعلاقته بالإبادة الجماعية للأويغور والإبادة الجماعية في غزة."
    ],
    "points": 160,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1707498988
  },
  {
    "id": 39315448,
    "title": "العلماء يحققون اختراقا في جداول التجزئة عالية الكفاءة ، ويتقدمون في علوم الكمبيوتر",
    "originLink": "https://www.quantamagazine.org/scientists-find-optimal-balance-of-data-storage-and-time-20240208/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39315448",
    "commentBody": "",
    "originSummary": [
      "أنشأ العلماء جدول تجزئة رائدا يزيد من الذاكرة والسرعة من خلال تنظيم العناصر بناء على مواقع التخزين المفضلة وضغط بنية البيانات.",
      "يضع هذا الإنجاز معيارا جديدا لجداول التجزئة الفعالة ، ويعالج تحديا طويل الأمد في علوم الكمبيوتر.",
      "على الرغم من التحديات المحتملة في تنفيذ جدول التجزئة هذا في التطبيقات العملية ، فمن المتوقع أن يدفع التقدم في المشكلات ذات الصلة ويلهم المزيد من البحث."
    ],
    "commentSummary": [
      "وجد الباحثون توازنا مثاليا بين استخدام المكان والزمان في جداول التجزئة ، على الرغم من أن تفاصيل الخوارزمية لم يتم استكشافها بعد.",
      "وتؤكد الدراسة على الآثار العملية للتطورات النظرية وتطبيقاتها المحتملة.",
      "تستكشف المناقشة أيضا قيود البحث النظري في تحسين الأجهزة والميل إلى الاعتماد على جداول التجزئة دون داع ، مما يشير إلى استخدام صفائف متفرقة لتحسين الكفاءة."
    ],
    "points": 156,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1707490898
  }
]
