[
  {
    "id": 41375548,
    "title": "Modelli di diffusione sono motori di gioco in tempo reale",
    "originLink": "https://gamengen.github.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41375548",
    "commentBody": "",
    "originSummary": [
      "Ricercatori hanno introdotto GameNGen, un motore di gioco alimentato da un modello neurale capace di interazione in tempo reale, dimostrato simulando il gioco DOOM a oltre 20 fotogrammi al secondo su una singola TPU.",
      "GameNGen utilizza un processo di addestramento in due fasi che coinvolge un agente RL per la raccolta dei dati e un modello di diffusione per la previsione del fotogramma successivo, raggiungendo un PSNR di 29,4, paragonabile alla compressione JPEG con perdita.",
      "Il modello architettonico include aumenti di condizionamento e la messa a punto di un auto-encoder pre-addestrato per garantire una generazione stabile a lungo termine e una qualità dell'immagine migliorata, rendendo difficile per i valutatori umani distinguere tra clip di gioco reali e simulate."
    ],
    "commentSummary": [
      "Modelli di diffusione generano fotogrammi basati su fotogrammi passati e azioni dell'utente, ma non supportano l'input in tempo reale dell'utente per regolazioni dinamiche.",
      "Addestrati su un ampio dataset di gameplay di DOOM, questi modelli producono fotogrammi condizionati dai fotogrammi attuali e dalle azioni dell'utente, somigliando più a una registrazione neurale che a una simulazione interattiva.",
      "Pur essendo impressionante, la tecnologia affronta limitazioni come la manutenzione incoerente dello stato interno del gioco, evidenziando sia il suo potenziale che le sfide per la simulazione dei giochi."
    ],
    "points": 947,
    "commentCount": 344,
    "retryCount": 0,
    "time": 1724813980
  },
  {
    "id": 41372833,
    "title": "CRDT più veloci (2021)",
    "originLink": "https://josephg.com/blog/crdts-go-brrr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41372833",
    "commentBody": "",
    "originSummary": [
      "L'autore era inizialmente frustrato dall'inefficiente implementazione del loro algoritmo in un articolo accademico, che portava a dichiarazioni di prestazioni errate.",
      "Questa frustrazione ha portato all'esplorazione e all'ottimizzazione dei CRDT (Conflict-Free Replicated Data Types), che consentono l'editing collaborativo in tempo reale senza un server centrale.",
      "Il CRDT ottimizzato dall'autore, Diamond, supera significativamente i CRDT popolari come Automerge utilizzando strutture dati più semplici e tecniche di indicizzazione avanzate, raggiungendo miglioramenti di velocità superiori a 5000 volte."
    ],
    "commentSummary": [
      "Il post discute le prestazioni dei tipi di dati replicati senza conflitti (CRDT) e le loro applicazioni pratiche nel software del mondo reale, evidenziando i loro benefici e le sfide.",
      "CRDT sono utilizzati in varie applicazioni come Thymer, Notion e Apple Notes, offrendo funzionalità come la collaborazione in tempo reale e la funzionalità offline, ma comportano compromessi come compromessi sulle prestazioni e risoluzione dei conflitti complessa.",
      "Il dibattito include approfondimenti da parte di sviluppatori e utenti sull'implementazione pratica dei CRDT, confrontandoli con altri metodi di sincronizzazione come gli Operational Transforms (OT) ed esplorando la loro idoneità per diversi casi d'uso."
    ],
    "points": 313,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1724791648
  },
  {
    "id": 41374009,
    "title": "ChartDB – Gratuito e open source, editor di progettazione di database",
    "originLink": "https://chartdb.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41374009",
    "commentBody": "",
    "originSummary": [
      "ChartDB offre un editor di progettazione di database gratuito e open-source che consente agli utenti di visualizzare il proprio database con una singola query, senza bisogno di registrarsi.",
      "Supporta più sistemi di gestione di database (DBMS) tra cui PostgreSQL, MySQL, SQL Server, SQLite e MariaDB, e offre funzionalità come l'importazione istantanea dello schema e DDL (Data Definition Language) generato dall'IA.",
      "Gli utenti possono importare/esportare rapidamente database, generare script SQL o immagini e utilizzare strumenti avanzati di modifica delle query, rendendolo uno strumento versatile per la gestione e la progettazione dei database."
    ],
    "commentSummary": [
      "ChartDB è un editor di design di database gratuito e open-source, che sta attirando l'attenzione per la sua utilità nella creazione di diagrammi di database.",
      "Il dibattito evidenzia l'importanza dei diagrammi di database per comprendere e comunicare strutture di dati complesse, specialmente nei progetti maturi.",
      "Gli utenti confrontano ChartDB con altri strumenti come dbdiagram.io, ERWin e PlatUML, notando il suo potenziale per la generazione automatica di diagrammi e la facilità d'uso in ambienti collaborativi."
    ],
    "points": 234,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1724798329
  },
  {
    "id": 41376590,
    "title": "COSMIC Alpha Rilasciato",
    "originLink": "https://blog.system76.com/post/cosmic-alpha-released-heres-what-people-are-saying/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41376590",
    "commentBody": "",
    "originSummary": [
      "È stata rilasciata la versione alpha di COSMIC, un nuovo ambiente desktop per Pop!_OS e altre distribuzioni Linux, che offre nuove funzionalità, personalizzazione, prestazioni, stabilità e sicurezza.",
      "COSMIC non è ancora consigliato per l'uso in produzione, ma i feedback sono stati positivi, evidenziando la sua velocità, solida base e design intuitivo.",
      "Il rilascio funge anche da alpha per Pop!_OS 24.04 LTS, con nuove funzionalità come impostazioni di data e ora, cattura dello schermo, impostazioni predefinite del touchpad e condivisione dello schermo nelle app di videoconferenza."
    ],
    "commentSummary": [
      "System76 ha rilasciato la versione alpha di COSMIC, un nuovo ambiente desktop, che ha suscitato un notevole interesse nella comunità tecnologica.",
      "COSMIC è costruito utilizzando Iced, un framework UI multipiattaforma basato su Rust, che è ancora sperimentale ma mostra potenziale per lo sviluppo futuro.",
      "Gli utenti hanno segnalato sia aspetti positivi, come spazi di lavoro indipendenti per monitor e scorciatoie da tastiera sensate, sia aspetti negativi, come funzionalità mancanti e bug, indicando che, sebbene promettente, COSMIC non è ancora pronto per l'uso quotidiano."
    ],
    "points": 231,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1724826635
  },
  {
    "id": 41379517,
    "title": "Iniziando da oggi, YouTube è quasi inutilizzabile su Firefox",
    "originLink": "https://old.reddit.com/r/youtube/comments/1f30ku4/youtube_sabotaging_on_firefox/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41379517",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "YouTube è diventato quasi inutilizzabile su Firefox, con benchmark delle prestazioni che mostrano rallentamenti significativi e blocchi completi dell'interfaccia utente.",
      "Il problema sembra essere legato a un aggiornamento di Polymer che influisce sui componenti web personalizzati, suscitando speculazioni sul fatto che si tratti di un meccanismo anti-adblocker o di un bug.",
      "Si sono aperte discussioni sull'influenza di Google sulla compatibilità dei browser, con alcuni che suggeriscono che l'UE dovrebbe finanziare un browser incentrato sulla privacy o creare un fork di Chromium per affrontare queste preoccupazioni."
    ],
    "points": 206,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1724853007
  },
  {
    "id": 41375746,
    "title": "Vaccino intranasale per Covid-19",
    "originLink": "https://news.griffith.edu.au/2024/08/27/game-changing-needle-free-covid-19-intranasal-vaccine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41375746",
    "commentBody": "",
    "originSummary": [
      "Ricercatori della Griffith University, guidati dal Professor Suresh Mahalingam, stanno sviluppando un vaccino mucosale di nuova generazione contro il COVID-19, CDO-7N-1, pubblicato su Nature Communications.",
      "Questo vaccino intranasale vivo attenuato mira a indurre sia l'immunità mucosale che sistemica con una singola dose, offrendo una protezione a lungo termine e un'alternativa senza ago.",
      "Il vaccino fornisce una protezione incrociata contro tutte le varianti di preoccupazione, rimane stabile a 4°C per sette mesi ed è concesso in licenza a Indian Immunologicals Ltd per i prossimi studi clinici, rendendolo adatto ai paesi a basso e medio reddito."
    ],
    "commentSummary": [
      "Un nuovo vaccino intranasale contro il Covid-19, CDO-7N-1, afferma di fornire una forte protezione contro la trasmissione, la reinfezione e la diffusione del virus, riducendo al contempo la generazione di nuove varianti.",
      "Al contrario dei vaccini a mRNA, il CDO-7N-1 induce l'immunità a tutte le principali proteine del SARS-CoV-2 e rimane stabile a 4°C per sette mesi, rendendolo adatto ai paesi a basso e medio reddito.",
      "Il metodo di somministrazione nasale potrebbe neutralizzare il virus lungo la mucosa nasale, offrendo un nuovo approccio alla prevenzione del Covid-19, sebbene la sua efficacia e l'accoglienza pubblica debbano ancora essere determinate."
    ],
    "points": 173,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1724816858
  },
  {
    "id": 41372482,
    "title": "Taskwarrior – Gestione delle attività tramite CLI",
    "originLink": "https://taskwarrior.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41372482",
    "commentBody": "",
    "originSummary": [
      "Taskwarrior 3.0.2 è stato rilasciato, affrontando problemi minori della versione 3.0.0, inclusi miglioramenti nelle notizie sui compiti, nella gestione degli errori, nella documentazione e nelle interazioni con gli hook.",
      "Taskwarrior 3.0 ha introdotto un nuovo supporto affidabile per l'archiviazione e la sincronizzazione delle attività basato su TaskChampion, segnando un aggiornamento significativo.",
      "Le ultime versioni stabili disponibili sono Taskwarrior 3.0.2, Taskshell 1.2.0 e Timewarrior 1.7.1, con versioni di sviluppo anche accessibili."
    ],
    "commentSummary": [
      "Uno sviluppatore sta creando una GUI (Interfaccia Grafica Utente) minimale per Taskwarrior, uno strumento di gestione delle attività CLI (Interfaccia a Riga di Comando), per migliorare la navigazione tramite tastiera e assistere gli utenti con ADHD.",
      "Lo sviluppatore prevede di integrare Timewarrior, uno strumento di tracciamento del tempo, nell'interfaccia grafica in futuro, sebbene gli sforzi attuali siano concentrati sull'uso locale piuttosto che sull'accesso remoto o sulla sincronizzazione mobile.",
      "La comunità sta discutendo vari aspetti di Taskwarrior, inclusi i problemi di sincronizzazione, il potenziale supporto mobile e i vantaggi delle sue funzionalità come le dipendenze tra i compiti e l'ordinamento per urgenza."
    ],
    "points": 163,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1724789844
  },
  {
    "id": 41377960,
    "title": "IPA, un'interfaccia grafica per esplorare i dettagli interni dei PDF",
    "originLink": "https://github.com/seekbytes/IPA",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41377960",
    "commentBody": "",
    "originSummary": [
      "Analisi PDF Interattiva (IPA) è uno strumento progettato per aiutare i ricercatori a esplorare e analizzare file PDF, in particolare quelli che possono contenere payload dannosi o essere utilizzati in campagne di phishing.",
      "IPA offre un'interfaccia grafica per estrarre i payload, comprendere le relazioni tra gli oggetti e visualizzare i riferimenti all'interno del file, rendendolo più intuitivo rispetto agli strumenti da riga di comando.",
      "Lo strumento è compatibile con pdf-rs e Rust, non richiede software aggiuntivo e può essere compilato utilizzando Rust e cargo."
    ],
    "commentSummary": [
      "IPA è un nuovo strumento GUI per esplorare i dettagli dei PDF, creato da Nicolodev, mirato a un'analisi rapida dei PDF.",
      "Altri strumenti simili includono pdf.hyzyla.dev, iText RUPS (Java), PDFSyntax (Python), Polyfile, ReportMill PDFViewer, PDFInspector e PDFXplorer.",
      "Il creatore di PDFSyntax ha introdotto un nuovo comando CLI per il riepilogo della struttura, e gli utenti hanno discusso di vari strumenti e funzionalità, condividendo esperienze e problemi con gli strumenti PDF."
    ],
    "points": 162,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1724840572
  },
  {
    "id": 41376044,
    "title": "Abbiamo già implementato l'anti-cheat?",
    "originLink": "https://areweanticheatyet.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41376044",
    "commentBody": "",
    "originSummary": [
      "\"Are We Anti-Cheat Yet?\" è un elenco collaborativo che dettaglia la compatibilità dei giochi che utilizzano software anti-cheat con GNU/Linux o Wine/Proton.",
      "Statistiche attuali: 37% supportato, 17% in esecuzione, 1% pianificato, 38% non funzionante e 7% negato.",
      "Alcuni esempi notevoli: Halo: The Master Chief Collection (supportato con piccole riserve), Fortnite (negato, funziona su Xbox-Cloud) e Apex Legends (supportato)."
    ],
    "commentSummary": [
      "\"Are We Anti-Cheat Yet?\" (areweanticheatyet.com) ha attirato notevole attenzione su Hacker News, con 158 punti e 176 commenti, evidenziando la sua rilevanza nella comunità dei videogiochi.",
      "Il sito, sviluppato da Starz0r nel corso di 2-3 anni, inizialmente tracciava i giochi supportati da Linux per lo Steam Deck, ma da allora si è espanso e ha subito una riprogettazione.",
      "Le discussioni principali includono l'efficacia del software anti-cheat, la corsa agli armamenti tra sviluppatori di cheat e misure anti-cheat, e il potenziale dell'IA e delle soluzioni lato server per migliorare il rilevamento dei cheat."
    ],
    "points": 158,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1724820404
  },
  {
    "id": 41374663,
    "title": "Il TTPoE di Tesla a Hot Chips 2024: Sostituire il TCP per Applicazioni a Bassa Latenza",
    "originLink": "https://chipsandcheese.com/2024/08/27/teslas-ttpoe-at-hot-chips-2024-replacing-tcp-for-low-latency-applications/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41374663",
    "commentBody": "",
    "originSummary": [
      "Tesla ha introdotto TTPoE (Tesla Transport Protocol over Ethernet) a Hot Chips 2024, con l'obiettivo di sostituire TCP per applicazioni a bassa latenza nel loro supercomputer Dojo.",
      "TTPoE offre una latenza a livello di microsecondi e un offload hardware, semplificando la macchina a stati del TCP per ridurre la latenza e migliorare il throughput dei dati per compiti ad alta larghezza di banda IO come l'addestramento video.",
      "TTPoE utilizza un approccio di forza bruta per il controllo della congestione, con un buffer di trasmissione SRAM da 1 MB e una \"Dumb-NIC\" economica chiamata Mojo, progettata per migliorare le prestazioni del supercomputer Dojo."
    ],
    "commentSummary": [
      "Tesla ha introdotto TTPoE (Tesla Transport Protocol over Ethernet) a Hot Chips 2024, con l'obiettivo di sostituire TCP per applicazioni a bassa latenza.",
      "Il nuovo protocollo è progettato per ottimizzare le prestazioni per i casi d'uso specifici di Tesla, sfruttando l'hardware esistente e riducendo i costi evitando la necessità di soluzioni di rete più costose come Infiniband.",
      "Il provvedimento ha suscitato dibattiti, con alcuni che sostengono che sia superfluo data l'esistenza di tecnologie come i TCP Offload Engines (TOE) e RoCE (RDMA over Converged Ethernet), mentre altri lo vedono come una decisione strategica per un migliore controllo e un'efficienza dei costi."
    ],
    "points": 158,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1724803605
  },
  {
    "id": 41378806,
    "title": "Il giudice respinge la maggior parte delle rivendicazioni di copyright contro GitHub Copilot",
    "originLink": "https://www.developer-tech.com/news/judge-dismisses-majority-github-copilot-copyright-claims/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41378806",
    "commentBody": "",
    "originSummary": [
      "Un giudice ha respinto la maggior parte delle accuse in una causa per violazione del copyright contro GitHub, Microsoft e OpenAI riguardante l'assistente di codifica GitHub Copilot alimentato dall'IA.",
      "Il contenzioso, avviato dagli sviluppatori nel 2022, originariamente contava 22 reclami, ma ne rimangono solo due: uno per violazione della licenza open-source e un altro per violazione del contratto.",
      "Il tribunale ha ritenuto non convincenti gli argomenti secondo cui Copilot avrebbe violato il DMCA suggerendo codice senza la dovuta attribuzione e ha respinto le richieste di danni punitivi e risarcimenti monetari."
    ],
    "commentSummary": [
      "Un giudice ha respinto la maggior parte delle rivendicazioni di copyright contro GitHub Copilot, accendendo dibattiti sul codice generato dall'IA e sulle questioni di copyright.",
      "Gli utenti hanno segnalato casi in cui l'IA ha prodotto codice identico a esempi esistenti, sollevando preoccupazioni legali riguardo alla violazione del copyright.",
      "Il dibattito in corso si concentra su come le leggi sul copyright dovrebbero evolversi per affrontare le capacità dell'IA e le responsabilità degli operatori di IA."
    ],
    "points": 145,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1724848786
  },
  {
    "id": 41378478,
    "title": "Digitare liste e tuple in Elixir",
    "originLink": "https://elixir-lang.org/blog/2024/08/28/typing-lists-and-tuples/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41378478",
    "commentBody": "",
    "originSummary": [
      "Elixir sta sviluppando un sistema di tipi per garantire una tipizzazione graduale corretta, consentendo un'interfaccia sicura tra codice statico e dinamico, con l'obiettivo di prevenire errori di tipo durante l'esecuzione.",
      "Il nuovo sistema di tipi supporterà i tipi tupla, specificando dimensioni minime e tipi di elementi, e fornirà avvisi in fase di compilazione per prevenire errori a runtime.",
      "Elixir v1.17 è stato rilasciato e i prossimi eventi sono programmati per il 27-30 agosto 2024 a Orlando, FL."
    ],
    "commentSummary": [
      "Il metodo di tipizzazione graduale di Elixir dà priorità alla solidità del sistema rispetto alla sintassi, con il compilatore che migliora per rilevare più bug in ogni versione.",
      "Elixir 1.17 ha introdotto un sistema di tipi graduale, attualmente supportando solo alcuni tipi, con piani di espansione nei futuri aggiornamenti.",
      "Il confronto con F# e MyPy di Python mette in evidenza la complessità della gestione delle liste non vuote e dei sistemi di tipi, ma l'approccio di Elixir è considerato vantaggioso per lo sviluppo a lungo termine."
    ],
    "points": 142,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1724845772
  },
  {
    "id": 41376558,
    "title": "Boxxy mette le cattive applicazioni Linux in una scatola con solo i loro file",
    "originLink": "https://github.com/queer/boxxy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41376558",
    "commentBody": "",
    "originSummary": [
      "Boxxy è uno strumento Linux progettato per organizzare i file e le directory delle applicazioni reindirizzandoli senza utilizzare i symlink, sfruttando i namespace di Linux.",
      "Contribuisce a mantenere ordinata la directory $HOME reindirizzando i dati delle applicazioni a posizioni specificate e supporta funzionalità come regole dipendenti dal contesto, minimo sovraccarico e iniezione di variabili d'ambiente.",
      "Come nuovo progetto, Boxxy potrebbe avere potenziali problemi e limitazioni, come l'incapacità di utilizzare sudo all'interno del container."
    ],
    "commentSummary": [
      "Boxxy è uno strumento progettato per isolare le applicazioni Linux problematiche contenendo i loro file.",
      "Uno strumento correlato, \"xdg-ninja,\" scansiona la directory $HOME alla ricerca di file fuori posto e suggerisce posizioni appropriate.",
      "Gli utenti discutono di vari metodi di sandboxing come symlink, Firejail, Bubblewrap e Docker, e sollevano preoccupazioni sull'uso di Discord per la comunicazione del progetto, preferendo forum più aperti."
    ],
    "points": 119,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1724826305
  },
  {
    "id": 41375902,
    "title": "Riflessioni sull'arresto di Durov",
    "originLink": "https://prestonbyrne.com/2024/08/24/thoughts-on-the-durov-arrest/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41375902",
    "commentBody": "",
    "originSummary": [
      "Pavel Durov, fondatore di Telegram, è stato arrestato in Francia per presunta non conformità alle leggi sulla moderazione dei contenuti e sulla divulgazione dei dati, sollevando importanti questioni legali.",
      "Il arresto sottolinea le leggi più severe sulla regolamentazione dei contenuti in Europa, come la Loi Lutte Contra la Haine sur Internet della Francia e il NetzDG della Germania, rispetto alla Sezione 230 del Communications Decency Act degli Stati Uniti.",
      "Le accuse contro Durov, tra cui complicità in crimini come il riciclaggio di denaro e il traffico di stupefacenti, evidenziano i rischi crescenti per gli imprenditori tecnologici statunitensi che operano in Europa."
    ],
    "commentSummary": [
      "Pavel Durov, fondatore di Telegram, si trova in una posizione simile a quella di Ladar Levison di Lavabit, affrontando pressioni legali per fornire documenti al governo francese, dove detiene la cittadinanza.",
      "Al contrario dei servizi con crittografia end-to-end (E2EE), le scelte di design di Telegram gli permettono di accedere ai dati degli utenti, il che ha portato a complicazioni legali e potenziali responsabilità per Durov.",
      "Il dibattito evidenzia l'importanza della crittografia end-to-end (E2EE) nel proteggere sia i dati degli utenti che i fornitori di servizi da pressioni legali e coercitive, confrontando l'approccio di Telegram con alternative più sicure."
    ],
    "points": 111,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1724818561
  },
  {
    "id": 41380450,
    "title": "Procuratori francesi affermano che il CEO di Telegram è stato rilasciato dalla custodia e comparirà in tribunale",
    "originLink": "https://apnews.com/article/france-telegram-pavel-durov-arrest-6e213d227458f330ed16e7fe221a696c",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41380450",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Il procuratore francese ha rilasciato il CEO di Telegram Pavel Durov dalla custodia iniziale, ma dovrà comunque comparire in tribunale, evidenziando le questioni legali in corso.",
      "Il problema centrale è il rifiuto di Telegram di condividere informazioni con gli investigatori, il che ha scatenato dibattiti sulla conformità alle leggi locali rispetto alla crittografia e alla privacy.",
      "Questo caso ha attirato notevole attenzione a causa delle sue implicazioni per le aziende tecnologiche globali che operano sotto diverse giurisdizioni nazionali e dell'equilibrio tra la privacy degli utenti e gli obblighi legali."
    ],
    "points": 109,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1724858081
  }
]
