[
  {
    "id": 35727967,
    "timestamp": 1682602847,
    "title": "Datomic is Free",
    "url": "https://blog.datomic.com/2023/04/datomic-is-free.html",
    "hn_url": "http://news.ycombinator.com/item?id=35727967",
    "content": "Datomic is now FREE!PRODUCTSPRICINGRESOURCESCOMPANYCAREERSGet Datomic ProDatomic Blog ›Datomic is FreeRecent PostsImplicit PartitionsQuery StatsDatomic Cloud 884-9095: New tiers and internet accessDatomic KnowledgebaseCognitect Joins Nubank!Datomic is Free27 April 2023Nubank is excited to announce today that we are making all editions of Datomic available free of licensing fees. The Datomic binaries are being released under the Apache 2.0 license and will be readily available for direct download and use via Maven Central - no signup required. Datomic Cloud will be available on AWS Marketplace with no additional software cost.We are doing this to make Datomic more useful to more people in more situations, and look forward to expanding the Datomic and Clojure community as a result.FAQWhat’s changing for customers?Moving forward, we are making the software easily available to everyone, at no cost.All current agreements and support are continued in full effect. We will continue to offer paid enterprise support.If you are interested in continuing support, and or leveraging the new licensing call us.Which editions of Datomic are free?Datomic Pro is free of licensing fees, and we are working on making Datomic Cloud available off AWS Marketplace with no associated license fees.Is it Open Source?Datomic binaries are provided under the Apache 2 license which grants all the same rights to a work delivered in object form.Datomic will continue to be developed at Nubank, where it is a critical piece of our infrastructure.Will Pro support (2 day SLA business hour) be providedYes, through the duration of your current license term. Moving forward, contact us if interested in an Enterprise Support agreement.Where can I find out more?www.datomic.comDatomic Documentationask.datomicDatomic Forum#datomic in Clojurians SlackCan I now run Datomic Cloud off marketplaceWe are working on making that available.Implicit PartitionsDatomic ProBenefitsGet DatomicDocumentationRelease NotesLicense AgreementDatomic CloudProduct DetailsPricingDocumentationRelease NotesLicense AgreementResourcesBlogKnowledgbaseDeveloper ForumProduct SupportCompanyAbout UsContact©2016-2021 Cognitect, Inc.Datomic® is a registered trademark of Cognitect, Inc.Trademark Guidelines | Privacy Policy",
    "summary": "- Datomic, a database software, is now available for free to all, with no licensing fees.\n- Datomic Pro is free of licensing fees, and Datomic Cloud will be available on AWS Marketplace with no additional software cost.\n- Datomic binaries are released under the Apache 2.0 license, providing users with the same rights as an object work under an open-source license.",
    "hn_title": "Datomic is Free",
    "original_title": "Datomic is Free",
    "score": 979,
    "hn_content": "Datomic, a database system recently released for free, is seen as ideal for backoffice systems that don't need to be web-scale. Its single-threaded writing process and system with transaction as first-class entities allow for easy addition of meta-data on changes to the system. It also offers a new, functional way of writing code by making the database available as a lazy, immutable value, which can follow \"functional core, imperative shell\". The architecture allows for easy addition of working sets to your system in various use cases, making it ideal for small-scale applications.The article discusses the benefits of having the working set of your database in memory on your app server, and how Datomic's peer model allows app servers to service reads directly to avoid contention and achieve massive read scale. It also covers the idea of intelligent application-level partitioning and routing schemes to balance cost and performance. Additionally, it touches on Datomic's support for scale-out compute and its advantages over traditional query execution on the server. Overall, the article emphasizes the importance of considering different patterns and trade-offs when designing databases and applications.Cognitect has released Datomic as a free binary, though it remains closed-source. The relationship between the Datomic/Cognitect/NuBank entities continues to be symbiotic, as NuBank's developers can avoid hiring difficulties. Datalog in Datomic enables developers to model their data in stored queries and alleviate the need for an ORM. Datomic returns maps of nested structures for query results rather than OOP objects, which simplifies data manipulation. While users may easily modify the Datomic binary and distribute the results under the Apache 2.0 license, this is not strictly \"open sourcing.\"Software engineers discuss the best method to model objects in Clojure. Some argue that OOP is the best way to model objects, while others believe that stateful data can be organized without using OOP paradigm. Clojure uses nominal product types to model data classes, but can be generated to other types. Datomic Cloud is debated, with some finding it slow, expensive, and challenging to diagnose performance issues. Others find it has a cool idea with its time travel feature. Postgres can implement time travel with thoughtful schema design. Implemented by 'created_at' and 'deleted_at' columns on everything and filtering to make sure that the object 'exists' at the time of the query.Datomic is useful for back-office systems that don't need to be web-scale, with audit logs and reset-ability features. 'Time travel' is an audit feature and not a business logic dependency, and is complicated to implement. Postgres is a known and reliable tool and should be the default choice for any use-case. Datomic Cloud is slow, overpriced, and resource-intensive, presented in an overly complex CloudFormation style. Datomic is event-sourced but makes it hard to correct data with retroactive corrections. Datomic binaries are released under the Apache 2 license.Datomic, a Clojure-based database management system, has released its binary under Apache licensing, sparking debate about the necessity of access to source code. Some believe the licensing switch is a publicity stunt, while others suggest the temporal properties and transactional flexibility of Datomic make it valuable for industries such as finance, inventory, and billing. Arguments abound about the need for open-source binary access versus paying for support contracts and maintaining peace of mind over data security. Finally, some wonder who really needs source code access in a world of standardized databases like Postgres and MySQL.Developers discuss using Datomic versus SQL for handling mutable and immutable data, with some praising Datomic's functionality for enabling customizable transaction metadata and historical querying, while others note that using SQL requires additional scaffolding to approximate Datomic's immutability features. The conversation also involves tangents about Rich Hickey and the benefits and drawbacks of using Clojure, such as the ramp-up time and necessary tools like Paredit.- A discussion on the use of Clojure for personal projects and larger-scale commercial work \n- Clojure has a small but growing community, plenty of job opportunities, and a friendly community \n- Clojure's learning curve and piecemeal library ecosystem can make it difficult for developers to get started \n- Clojure is a minority language, which can cause issues with funding and VC support \n- Datomic and other products in the Clojure ecosystem have not taken off due to unclear documentation and poor onboarding \n- Comments on the release of Datomic binaries under the Apache 2.0 license, leading to discussions on open source licensing for binaries and the validity of such licenses.Datomic binaries are being released under the Apache 2.0 license, allowing for binary-only distribution. Some commenters question the spirit of the license and note that decompiling the code is possible, but argue that this type of licensing is not uncommon and is a marketing tactic. Others criticize Datomic's history of commercial pricing and suggest a freemium model would have worked better to gain market share. Overall, the conversation focuses on the unique considerations and precedents for \"closed-source, free-to-use\" licensing.Datomic Cloud will be available on AWS Marketplace at no additional software cost, as a CloudFormation template based product. Users have commented that it is free as in beer, not freedom, and raised issues around historical audit trails. Some users have had good experiences with the product, particularly within the context of small startups, although others have found it challenging to manage from an organizational perspective. Companies that use Datomic in production include Netflix, Facebook, and Nubank.",
    "hn_summary": "- Datomic's peer model allows in-memory app servers to handle reads for massive read scale, with intelligent application-level partitioning and routing schemes balancing cost and performance.\n- Datomic binary is released under the Apache 2.0 license, allowing binary-only distribution, leading to debate on open-source licensing for binaries and commercial pricing."
  },
  {
    "id": 35724634,
    "timestamp": 1682581868,
    "title": "Steven Spielberg: 'No film should be revised' based on modern sensitivity",
    "url": "https://www.theguardian.com/film/2023/apr/26/steven-spielberg-et-guns-movie-edit",
    "hn_url": "http://news.ycombinator.com/item?id=35724634",
    "content": "Steven Spielberg. Photograph: Jemal Countess/Getty Images for TimeSteven SpielbergSteven Spielberg: ‘No film should be revised’ based on modern sensitivityDirector has criticised the practice of re-editing older films while expressing remorse over removing guns in a later edition of ETBenjamin LeeWed 26 Apr 2023 09.43 EDTLast modified on Wed 26 Apr 2023 16.30 EDTSteven Spielberg has criticised the idea that older films should be re-edited to appease modern sensibilities.Speaking at Time’s 100 Summit in New York City, the 76-year-old film-maker expressed regret over taking out guns from a later release of his 1982 sci-fi blockbuster ET: The Extra Terrestrial. In the 20th anniversary edition, agents saw their firearms replaced with walkie-talkies.“That was a mistake,” he said on stage. “I never should have done that. ET is a product of its era. No film should be revised based on the lenses we now are, either voluntarily, or being forced to peer through.”In 2011, Spielberg had already explained that the guns would be returning for the 30th anniversary release, explaining that he was “disappointed” in himself.This week he added: “I should have never messed with the archives of my own work, and I don’t recommend anyone do that. All our movies are a kind of a signpost of where we were when we made them, what the world was like and what the world was receiving when we got those stories out there. So I really regret having that out there.”Spielberg was also asked about the controversial re-editing of Roald Dahl’s work which has included changing words like “fat” to “enormous” and “ugly and beastly” to just “beastly”.Initially he joked that “Nobody should ever attempt to take the chocolate out of Willy Wonka! Ever!” before adding “For me, it is sacrosanct. It’s our history, it’s our cultural heritage. I do not believe in censorship in that way.”Other authors whose work has recently been tweaked for modern readers include Agatha Christie and Ian Fleming.Spielberg’s most recent film, autobiographical drama The Fabelmans, received seven Oscar nominations. The director’s next project is yet to be confirmed but he has been attached to a drama based around the lead character from 1968 drama Bullitt with Bradley Cooper set to star.TopicsSteven SpielbergET: The Extra-TerrestrialnewsReuse this content",
    "summary": "- Steven Spielberg criticized the idea of re-editing older films to appease modern audiences, expressing remorse over removing guns from a later edition of E.T.\n- He believes that every film is a signpost of its era and should not be changed based on modern sensibilities.\n- Spielberg also expressed his opposition to censorship and the controversial re-editing of literary works like Roald Dahl's.",
    "hn_title": "Steven Spielberg: ‘No film should be revised’ based on modern sensitivity",
    "original_title": "Steven Spielberg: ‘No film should be revised’ based on modern sensitivity",
    "score": 849,
    "hn_content": "Steven Spielberg declares that no film should be revised based on today's sensitivity, essentially advocating for preserving art. A Hacker News thread was inspired by this declaration, highlighting how censorship and revising old media could impede the cultural history of a society. The conversation touched upon several shows and movies that are currently unavailable or altered due to licensing and copyright issues. The consensus reached is that people should own and control their data to preserve cultural products' original state, and content owners should reconsider licensing rules.The article discusses the issue of streaming platforms altering the aspect ratio and music of TV shows, such as Friends and Northern Exposure. The decision to crop or replace content was made by software engineers or licensing companies, ignoring the original director's intent. Some shows attempted to re-release the original content with limited success. The article draws attention to the importance of archiving and storing original copies to preserve original artistic integrity. The discussion also touches on intersex people, gender identity politics, and the significance of sex in scientific accuracy.A debate on gender and sex determination was held on HN with some users claiming that gender is a social construct, while sex is determined by genes. The consensus was that there are multiple sex-determination systems in animals, and the rigidness of gender binary in modern western society is not universal across time and space within human cultures. Additionally, there is a conversation on why society only acknowledges gender as a social construct and not other personal identities. The discussion also touched on the topic of transgender persons and the acceptance of gender-affirming care in the medical community. Finally, the conversation ended with a discussion on the high suicide rate among the trans community, and the lack of rigorous research on the subject due to the charged political climate.A debate about the existence of a high suicide rate among transgender individuals is underway. One person cites an NIH article that supports the idea, while another argues that there is insufficient data. The conversation turns to allowing individuals to express themselves as they desire, regardless of societal norms. The notion that gender is not real is debated, with the counterargument that behavior matters more than thoughts; some point to abnormal sex chromosomes and gametes in humans to demonstrate that even biology is not always binary. Some countries have 3 options for sex identification: M, F, and X.Tech enthusiasts discuss censorship of certain content in media and the importance of owning and controlling one's own data. Some mention specific examples such as the controversy over Netflix cropping Seinfeld, the edit of Greedo shooting first in Star Wars, and the changes made to the end of Return of the Jedi. Others comment on the need for discernment and nuance in judging people, rather than relying solely on labels or appearances. The conversation highlights the ongoing debate over censorship and revisionism in media.A discussion on George Lucas and the changes made to the original Star Wars trilogy has taken place on a thread on Hacker News. Some users criticize Lucas for his changes to the original films, especially the controversial decision to have Han Solo unknowingly shoot first in his encounter with Greedo. However, others defend Lucas for wanting to improve his work and his pioneering work in digital effects. Additionally, Spielberg's similar decision to replace guns with walkie-talkies in E.T. is also discussed, as well as Ridley Scott's various edits to Blade Runner.No meaningful content to extract from this text.Individuals discuss different options for archiving various types of media, including books, films, music, and articles. Suggestions include torrent trackers like what.cd and the Interplanetary File System (IPFS). Some caution that IPFS has security issues and high resource usage. Others note that torrent trackers may not be ideal for archiving due to problems with long-term seeding and changing file structures. Some recommend private trackers or distributed seeding to address these issues. Overall, the discussion emphasizes the need for ongoing efforts to find effective ways to archive important cultural artifacts.DC++ is a file-sharing client that allows users to access rare content, regardless of its popularity or seeders. Archive.org is a data hoarder that stores physical and digital copies of books and magazines, and maintains rare content. Long-term data preservation is a challenge, with factors such as storage media reliability, codec availability, and data transfer protocols. Clubs like Redacted.ch are VPN-based private trackers that enable file sharing among individuals. Some content may not be available on streaming services like Plex or Jellyfin due to limited music licenses. Users must balance the need to preserve historical content with potentially problematic content.No meaningful content in this text.The post discusses the destruction of art and beauty throughout history, comparing it to modern-day climate activists destroying art in protests. The intent behind each differs, with climate activists desiring to use art as a disruptive medium, while ISIS wanted to cause deliberate damage to human culture. The debate around destroying controversial art centers on particulars, with some pieces considered cultural artifacts while others are spam. Each viewpoint has its own considerations to make. Arguments also arise over modifying works of fiction to fit modern sensibilities. Ultimately, preservation and censorship are both complicated issues with no easy answer.There are a series of comments that touch on censorship and the preservation of historical artifacts. One argues that conservators should remove the painted-on underwear from a painting, while another contends that such censorship serves as a reminder of the puritan era. A few comments delve into the current state of American dialogue surrounding controversial topics, with one remarking that people are afraid to speak their minds. Another mentions that most Americans take a laissez-faire attitude towards politics. Finally, there is a mention of AOC and her positive attitude towards cancel culture.The conversation on a forum about the increasingly polarized nature of politics in the US and the fear of speaking one's mind. Some people argue that it's not worth the risk of losing one's job or livelihood to express an unpopular opinion, while others believe in standing up for their beliefs, even if it means facing consequences. There is also a discussion of personal dogmas and ideologies, and how they shape our notions of good and evil. Additionally, it's noted that wealthy elites rather than the general public often decide election outcomes in the US.There is a discussion on whether foreign powers, especially Russia and its elites, installed Trump to win the US 2016 presidential election. However, others think that blaming the results of the election on Russians is just a way of evading responsibility. The discord in American society was also fermented by foreign powers. Foreign influence is more about pushing the most convenient angle by means of propaganda, astroturfing or information laundering. The obsession of Americans and elites in monitoring each other’s activity, especially online, is presenting a serious minefield that stifles discussion. Hyper-focus on race has produced more division and more racism, and a hell of a lot more descriptive and clear language could solve newspeak naming problems.A debate on the impact of rebranding the \"master\" branch in version control systems to \"main\" has sparked discussions on whether such changes are necessary or effective in addressing racism. While some argue that the move is a positive one, with increased clarity and brevity, others argue that it is purely driven by self-indulgent white people who don't want to make material changes to their own lives while pretending to fight the good fight. Additionally, debates on the use of censorship to address issues such as racism and the role of euphemism treadmill in language transformation have also emerged.The article discusses the limitations of censoring words without changing people's perceptions.\nThe conversation explores the definition and implications of censorship, including government-imposed and self-imposed censorship in the film industry.\nThe article also touches on the topic of societal sensitivity and how it may be perceived in the future.\nSome commenters debate the effectiveness of certain anti-discrimination measures and their potential consequences.\nOverall, the article and conversations dive into the complexities of censorship and societal change.- The possibility of edits to creative works, such as removing language or behavior deemed unacceptable, raises concerns about censorship and a slippery slope towards more significant changes.\n- Some argue that adding content warnings and recognizing the context of a specific time period is a better approach.\n- The issue of cultural preservation becomes more complicated when discussing children's literature, with some supporting edits to better align with contemporary values, while others argue for the availability of the original work and the importance of historical context.\n- The discussion also touches on how children communicate today and the potential impact of state-approved language or censorship on their language development.",
    "hn_summary": "- The importance of owning and controlling one's own data to preserve original artistic integrity is emphasized, and the need for effective archiving methods is highlighted.\n- The debate on gender and sex determination, as well as the discussion on censorship and revisionism in media, add complexity to the conversation on cultural preservation and societal change."
  },
  {
    "id": 35730074,
    "timestamp": 1682611276,
    "title": "As I am currently in a war zone, I don't have many options for cabling",
    "url": "https://electronics.stackexchange.com/questions/664502/using-clothesline-steel-core-wire-rope-for-ac-and-dc",
    "hn_url": "http://news.ycombinator.com/item?id=35730074",
    "content": "A question posted on Electrical Engineering Stack Exchange asks if clothesline steel core wire rope can be used for AC and DC wiring in a war zone where other options are limited. The poster provides measurements of the wire's resistance and asks if it can carry AC 120 or 240 volts for a certain distance and how many wires they would need to carry DC 18V and 15 amperes from solar panel arrays to an inverter 10 to 15 meters away. Several users provide suggestions, including placing the inverter close to the panels and sending 230V AC over the clothesline, using copper wire for the DC connection, and providing additional safety measures such as insulating tubes and ground wires.Possible summary:\n\n- Using lead to coat steel wire can be a way to protect it from corrosion and oxidation, but it requires special precautions and expertise.\n- Resistance in steel wire depends on its length, cross-sectional area, and resistivity, which is much higher than copper or aluminum.\n- Parallel wires can reduce resistance, but the number and combination of wires depend on the desired current and voltage.\n- Testing and measuring resistance in steel wire can be challenging due to the effects of contact resistance, oxidation, and multimeter leads.\n- Steel wire can melt and arc if exposed to flammable materials or if connections become loose or corroded, posing a risk of fire or electrocution.\n- Insulating and insuring high-current wire connections is important, especially in a war zone or other adverse conditions.\n- Lead, tin and cloth can help create a conductive layer and a mechanical support for wire, but caution and skill are required when using them.\n- The post discusses technical and practical aspects of wiring and electricity, but it may not apply to all situations or standards, and it does not provide legal or professional advice.",
    "summary": "- A question on Electrical Engineering Stack Exchange asks about using clothesline steel wire for AC and DC wiring in a war zone where options are limited.\n- Suggestions include using copper wire for DC and sending 230V AC over clothesline, as well as adding safety measures like insulating tubes and ground wires.\n- Experts caution that steel wire has higher resistivity, can melt or arc, and requires careful testing and insulation.",
    "hn_title": "As I am currently in a war zone, I don't have many options for cabling",
    "original_title": "As I am currently in a war zone, I don't have many options for cabling",
    "score": 776,
    "hn_content": "The post discusses using field telephone wire for cabling in war zones. Suggestions include using a cable with a steel and copper core for power, building low-cost emergency long wire antennas, and using binary search to find a pin. The conversation extends to sharing personal experiences and discussing the state of different war zones. The post highlights how connecting with others online can make a significant moral difference and provide actual help and solutions for people in difficult situations.No meaningful content.The comments section discusses the viability of prewar inventions in today's world. People who have experienced power outages for days at a time argue that methods like using a Sarajevo War Stove or constructing efficient stoves can still be useful. There is some discussion on herbal smoke blends, voice matching for security, and Stack Overflow's reputation for unhelpful answers. The main warning concerns the dangers of working with electricity and how there is a high risk of injury or death if it is not handled carefully.An exchange in a thread on Stack Overflow discussing the safety of using clothesline wire for AC power in a warzone. One user argues that the person asking the question is not capable of basic electrical calculations and should not be using deadly AC voltages. Another user argues that the person is a hacker who knows enough to measure resistance and understand current limits. Some discuss the need for more resilient infrastructure, especially in warzones or after natural disasters. There is debate about privilege and the different experiences of those in warzones and those in first-world countries.There is a conversation around recognizing one's privilege and acknowledging the price paid for that privilege. The discussion includes mentioning the conditions of cities in Brazil, the literacy rates around the world, and the limitations of using high voltage DC with most things. In Sudan, there is a war and questioning external arms supply intensifying conflicts. Wagner group, a Russian private military group, is actively involved in Sudan and has interests in gold mining.The comments section discusses the conflict between Russia and Ukraine, with opinions divided between who the bad guys and good guys are. While some argue that Putin is corrupt and that the ousted leader was also deeply corrupt, others suggest that it was a genuine people’s movement against a corrupt regime. Some users suggest scavenging cabling and pipes for infrastructure during war times, while others warn of the risks of using steel cable for power due to corrosion and rust. Long-term, the wire itself will rust and overheat, making it necessary to keep away from flammable materials.A thread on Stack Exchange discusses methods of preventing rust and corrosion, including the use of sacrificial anodes, impressed current cathodic protection, and anodizing. Some users question whether electrical current affects oxidation rates, with some suggesting it could create an EM field that repels oxygen ions and slows the process. Others note that temperature and environmental gases are the primary drivers of corrosion. Despite some off-topic comments about Home Depot's CEO, the thread features useful insights for those seeking to prolong the lifespan of cables and metal structures.The post discusses the limitations of finding solutions online and the importance of experience and hands-on learning. It highlights the difficulties that arise when trying to communicate technical solutions to non-experts and the possibility of debasing the written language in favor of video production. The post also touches on the struggles of professional moderators on sites like StackExchange and the issues that arise with the scale of these sites. Ultimately, the post suggests the need for better tools to enable people trying to answer questions to find interesting ones more easily.The post discusses how Stack Overflow measures the success of their site through engagement metrics and A/B testing. Better moderation tools resulting in higher quality questions are seen as \"worse\" for engagement. The author also argues for a focus on the Q&A format and actively curating content to make good content more easily discoverable, even if it means removing questions. The debate around what is considered rude or unhelpful engagement on Stack Overflow is also explored. Overall, the post delves into the challenges of maintaining a successful tech Q&A site.- Stack Overflow's moderation tools and community involvement were built for a smaller site and do not scale well with increased engagement metrics and question volume.\n- Lack of barriers to participation in online communities can lead to generic and specific failures, such as spam, misogyny attacks, and racist attacks.\n- Conversational contexts require dense two-way conversations that decline as a system scales up, so finding ways to spare the group from scale is crucial.\n- Stack Overflow's problems appear to be self-inflicted, optimizing for political games instead of problem-solving optimization.\n- Stack Overflow has difficulty finding a balance between keeping all content around and providing an easily searchable system.\n- Despite the massive amount of space available, the difficulty of searching for the right question with a good answer prompts Stack Overflow to delete low-quality questions.\n- The company currently measures success by engagement and advertisement impressions, which presents a barrier to implementing barriers to entry for low-quality questions.\n- The decision not to implement barriers to entry could lead to the continued use of rudeness as a moderation tool of last resort.\n- Optimizing for valuable audiences, such as software engineers, rather than college kids could alleviate some issues with Stack Overflow's quality control.",
    "hn_summary": "- Viability of prewar inventions, such as Sarajevo War Stoves or efficient stoves, is debated for power outages.\n- Working with electricity in war zones is dangerous and high risk of injury or death.\n- Need for more resilient infrastructure in war zones and recognition of privilege is discussed.\n- Methods of preventing rust and corrosion in cables and metal structures are discussed.\n- Importance of experience and hands-on learning, and need for better moderation tools on Q&A sites are highlighted.\n- Stack Overflow's moderation tools and community involvement have difficulty scaling, leading to a lack of balance between keeping all content and providing an easily searchable system.\n- Stack Overflow measures success by engagement and advertisement impressions, leading to a potential continuation of rudeness as a moderation tool."
  },
  {
    "id": 35729558,
    "timestamp": 1682609219,
    "title": "Colorado governor signs tractor right-to-repair law opposed by John Deere",
    "url": "https://arstechnica.com/tech-policy/2023/04/colorado-governor-signs-tractor-right-to-repair-law-opposed-by-john-deere/",
    "hn_url": "http://news.ycombinator.com/item?id=35729558",
    "content": "RIGHT-TO-REPAIR VICTORY —Colorado governor signs tractor right-to-repair law opposed by John DeereManufacturers must provide repair parts, embedded software, and documentation.JON BRODKIN - 4/26/2023, 6:35 PMEnlargeGetty Images | Juan Silva147WITHColorado has enacted the nation's first state law guaranteeing farmers a right to repair tractors and other equipment themselves or at independent repair shops. Colorado Gov. Jared Polis, a Democrat, signed the bill yesterday.\"I am proud to sign this important bipartisan legislation that saves hardworking farmers and ranchers time and money on repairs, and supports Colorado's thriving agriculture industry... Farmers and ranchers can lose precious weeks and months when equipment repairs are stalled due to long turnaround times by manufacturers and dealers. This bill will change that,\" Polis said.The state House voted 46-14 in favor of the bill on April 11, while the Senate voted 21-12 on March 30. \"The legislation advanced through long committee hearings, having been propelled forward mostly by Democrats even though a Republican lawmaker co-sponsored the bill,\" the Associated Press wrote. \"The proposal left some GOP lawmakers stuck between their farming constituents pleading for the ability to repair their equipment and the manufacturers who vehemently opposed it.\"The law's requirements are scheduled to take effect on January 1, 2024. Farm equipment manufacturers will have \"to provide parts, embedded software, firmware, tools, or documentation, such as diagnostic, maintenance, or repair manuals, diagrams, or similar information (resources), to independent repair providers and owners of the manufacturer's agricultural equipment,\" according to the legislature's summary of the Consumer Right To Repair Agricultural Equipment bill.Deceptive trade practiceFailing to provide repair resources will be considered a deceptive trade practice under the new Colorado law. \"Any new contractual provision or other arrangement that a manufacturer enters into that would remove or limit the manufacturer's obligation to provide resources to independent repair providers and owners is void and unenforceable,\" the legislative summary said.AdvertisementManufacturers must provide the required tools, software, and information at \"fair and reasonable terms and costs\" to independent repair providers and equipment owners, the Colorado law text says. The terms must not \"discourage or disincentivize repairs to be made by an owner or an independent repair provider.\" Manufacturers also can't impose \"substantial\" obligations, such as requiring an equipment owner or independent repair provider to \"become an authorized repair provider of the manufacturer.\"Colorado previously imposed similar requirements on makers of powered wheelchairs. The farmer and rancher law applies to tractors, trailers, combines, sprayers, tillage implements, balers, \"other equipment used to plant, cultivate, or harvest agricultural products or to ranch,\" and to attachments and repair parts.In January, the American Farm Bureau Federation and John Deere signed a memorandum of understanding on repair rights after \"several years of discussions.\" As a state law, the Colorado requirement is more enforceable than the voluntary memorandum and isn't limited to John Deere equipment. Skeptics of the John Deere agreement say it doesn't provide enough help to farmers and that real laws are still needed.In response to the Colorado bill, John Deere has said it supports customers' decisions to repair products themselves or use independent repair services but still opposes the state law. \"We feel strongly that the legislation in Colorado is unnecessary and will carry unintended consequences that negatively impact our customers,\" the company has told media outlets. We asked John Deere for more information on the \"unintended consequences\" and will update this article if we get an answer.John Deere is facing a class-action lawsuit over its alleged monopolization of repair services. Numerous lawsuits against John Deere were consolidated into a single antitrust case being heard in US District Court for the Northern District of Illinois. In February, the US Department of Justice filed a statement of interest opposing John Deere's attempt to get the case dismissed.Page: 1 2 Next →ARS VIDEOHow Lighting Design In The Callisto Protocol Elevates The HorrorREADER COMMENTS147WITHJON BRODKINJon has been a reporter for Ars Technica since 2011 and covers a wide array of telecom and tech policy topics. Jon graduated from Boston University with a degree in journalism and has been a full-time journalist for over 20 years.AdvertisementChannel Ars TechnicaSITREP: F-16 replacement search a signal of F-35 fail?Footage courtesy of Dvids, Boeing, and The United States Navy.SITREP: F-16 replacement search a signal of F-35 fail?Sitrep: Boeing 707The F-35's next tech upgradeUS Navy Gets an Italian AccentSITREP: DOD Resets Ballistic Missile Interceptor programSITREP: DOD's New Long-Range Air-to-Air Missile Aims to \"Outstick\" ChinaArmy's New Pistol Has Had Some MisfiresArmy's Next (Vertical) Lift En RouteSITREP: President Trump's Missile Defense StrategyHybrid Options for US's Next Top FighterThe Air Force’s Senior Citizen Chopper Can’t Retire YetArs Live #23: The History and Future of Tech LawPolice re-creation of body camera evidence - Pueblo, CO | Ars TechnicaVisual Labs body camera software with the Dos Palos PD | Ars TechnicaHe knew his rights; he got tased anywayMore videos← PREVIOUS STORYNEXT STORY →Related Storiesby TaboolaSponsored LinksFinally, House Passes Billions for Camp Lejeune FamiliesTrulaw AttorneysLearn MoreCompletely New Electric Cars for Seniors - The Prices Might Surprise YouElectric Car DealsWhy people are so passionate about Ka’ChavaKachavaTry NowIncredible: Military Invention Turns Men 40+ Into BeastsTactical XRoofers Tested 17 Gutter Guards… Here’s What They DiscoveredLeafFilter PartnerLearn MoreIf You Have US Dollars In Your Bank Account - Watch Thisusfinancial.newsToday on Ars",
    "summary": "- Colorado Governor Jared Polis signed the first state law guaranteeing farmers a right to repair tractors and other equipment themselves or at independent repair shops.\n- Manufacturers of farm equipment must provide parts, embedded software, and documentation to independent repair providers and owners under the new law.\n- Failing to provide the required tools, software, and information will be considered a deceptive trade practice under the new Colorado law, which is more enforceable than a voluntary agreement between the American Farm Bureau Federation and John Deere.",
    "hn_title": "Colorado governor signs tractor right-to-repair law opposed by John Deere",
    "original_title": "Colorado governor signs tractor right-to-repair law opposed by John Deere",
    "score": 574,
    "hn_content": "Colorado's governor has signed new legislation that enforces the right-to-repair for tractors opposed by John Deere. Supporters say it's vital for family farms to stay alive, with equipment so expensive compared to margins at smaller scales. Those against the idea of \"family farms\" argue that the sector is mostly a myth, with governmental subsidies paid to growers of commodity grains more of what provide any value. The top cites that only 4% of American farms are 2,000 acres or larger, while the average farm size in America is just 446 acres.Colorado has reportedly become the first US state to pass a Right-to-Repair bill for farmers, which grants them more control over their farming equipment maintenance, allowing them to bypass manufacturers' repair monopolies. Despite its limitation to agricultural equipment, it sets precedence for future cases and may motivate campaigns for similar legislation in other industries. The move has been praised by those demanding corporate accountability and consumer rights, despite questions regarding enforcement and potential impacts on competition and pricing. The US DMCA regulatory standards were also criticized for limiting market competition and the Right-to-Repair movement was acknowledged as a necessary action to fix it.The discussion revolves around the difficulty of disrupting the long-standing farming capital industry due to the high barrier to entry/market penetration, the externalities of repairability, and established players maximizing profit. While increased competition is valuable, it is not a panacea and may not solve certain problems such as those involving externalities. Some cultural factors such as the siloing of the different disciplines of build, repair, and sales may also contribute to the challenge of creating a more desirable product. In addition, the market prioritizes profit, making it difficult to meet the demand for repairable tractors. Lesser-known brands of tractors that are repairable may not have quick access to parts as they lack dealer coverage. Even if new entrants offer better warranties, they may still experience difficulty penetrating the market.The post discusses why warranties offered by new entrants carry no weight in purchasing decisions for agricultural equipment due to the importance of proven durability and rugged dependability. Tesla's entrance into the personal vehicle market is deemed irrelevant to the agricultural equipment market due to different market characteristics. The potential for lock-in via expanded product features, integrations, distribution deals, and regulation favors larger incumbents in most industries. Intellectual property laws also contribute to this phenomenon. The purpose of a corporation is not solely profit maximization, but also to benefit society. A free market is defined by people making trades based on negotiation rather than coercion.Farm equipment manufacturer John Deere's restrictive repair policies have prompted the \"right to repair\" movement, which seeks to give farmers and independent repair shops access to necessary equipment repair tools and software. Critics of the so-called \"free market\" argue that market competition isn't the cure-all solution for all issues, as monopolies and regulatory capture often arise. John Deere's market entrenchment and dealership/service center network provide a moat that discourages competition. The movement views right-to-repair legislation as a step towards minimizing monopolies and protecting consumers from regulatory capture, while acknowledging that legislation may be required to address market failures.",
    "hn_summary": "- The Right-to-Repair movement is viewed as a necessary action to fix limitations in the US DMCA regulatory standards and demand corporate accountability and consumer rights\n- Critics argue that the high barrier to entry/market penetration, established players maximizing profit, and externalities of repairability may pose challenges to creating a more desirable product and achieving increased competition"
  },
  {
    "id": 35730711,
    "timestamp": 1682613475,
    "title": "Every web search result in Brave Search is now served by our own index",
    "url": "https://brave.com/search-independence/",
    "hn_url": "http://news.ycombinator.com/item?id=35730711",
    "content": "Brave Search passes 2.5 billion queries in its first year, and debuts Goggles feature that allows users to choose their own search rankingsPrivate, independent search engine exits beta phase on its first anniversary, with innovative features that help users de-Google their searchRead this article →",
    "summary": "- Brave Search has exceeded 2.5 billion queries in its first year of operation.\n- The search engine now features 'Goggles,' which allows users to choose their search rankings, offering innovative solutions to de-Google their search.\n- Brave Search is a private and independent search engine that has exited its beta phase on its first anniversary.",
    "hn_title": "Every web search result in Brave Search is now served by our own index",
    "original_title": "Every web search result in Brave Search is now served by our own index",
    "score": 571,
    "hn_content": "Brave Search has received praise for delivering superior results compared to other search engines like Bing, Google, and DuckDuckGo, with one user saying it scored a rare 100 in the first test, being able to find boutique hotel websites without relying on third-party intermediaries. Some users disagreed and claimed that third-party aggregators were easier to modify reservations, with one user citing his negative experience with Booking.com, which sold his room to someone else. Another user described how Booking.com failed to deliver on its available bookings, leaving him without a place to stay.A customer complains of a booking problem with Booking.com not having any other hotels in his area available, forcing him to drive far away. Booking.com did not offer to find or book another hotel and only refunded his money. The commenter argues that Booking.com's incentives are not aligned with the customer experience, but rather the company's profit. Some people have found booking directly with hotels can be cheaper and more reliable, as hotels must comply with price parity agreements with online booking sites. Loyalty programs with hotels can also offer benefits not found on third-party booking sites.Users share mixed experiences booking hotels through third-party platforms like Booking.com. Some report difficulties with communication and errors in booking, while others receive free upgrades through direct communication with hotels. Some users prefer booking directly with hotels to ensure confirmation and accessibility to staff for problem-solving. Direct communication with hotels can also allow for negotiating special services. However, some users contend that booking on third-party platforms provides better user experience through messaging tools and easier booking processes.- Booking.com and other third-party hotel booking websites have been criticized for allegedly overbooking hotels, resulting in customers arriving without a confirmed reservation.\n- Some users prefer to book directly with hotels to ensure they have a room and to avoid potential UX friction from third-party websites.\n- However, other users have had positive experiences with Booking.com and appreciate its flexibility and ability to offer free cancellations.\n- Some hotels may offer different prices for direct bookings versus bookings through third-party websites, but this is not always the case.\n- When encountering issues with booking or modifying reservations, some customers prefer to call and speak with a real person rather than rely on websites or chatbots.DuckDuckGo, a privacy-focused search engine, may not value privacy as much as it claims. They require users to install a browser extension for their email relay service, which some believe is unnecessary for a privacy-focused company. Some argue that companies like DuckDuckGo and Apple are simply doing \"privacy theater\" while smaller companies like Mozilla are more committed to privacy. Some users have reported issues with finding specific results on DuckDuckGo, while others have had positive experiences with other search engines.Kagi, a search engine with no ads, blacklists, and ranking algorithm, is hailed as the best in the market by users. However, its pricing of $25 per month is deemed unsustainable, and many users find it difficult to justify the cost. Some users hit the search limit before the renewal date, and the $5 hard limit is set to prevent large bills by accident. Meanwhile, many travelers book through third-party sites because they provide cheaper prices and more conveniences. There are concerns about slow and clunky changes or refunds, along with the consistency of room pricing among different sites.Booking directly through a hotel may not result in special treatment or better deals; hotels are operated like commodities. However, becoming a rewards member with Marriott or Hilton provides higher points accrual rates, beneficial for exchanging points for hotel stays. Customers are better off checking hotel reviews before booking, and hotel brands such as Marriott and Hilton will usually provide a small discount for direct booking. Using third-party booking sites may provide a discount but may also result in fewer options for changing travel plans. Direct booking can be organized through TripIt or a hotel's website.Brave Search, built on the foundation of Tailcat, the open search engine developed by the team formerly responsible for the privacy search and browser products at Cliqz, aims to replace reliance on Bing for better search results. Users praise Brave Search for its speed and accuracy in loading maps and search results, and its customization feature using goggles. There is a debate over editorial control versus censorship, as seen in DuckDuckGo's reluctance to develop competitive tech for organic search results and Brave's required removal of results. However, some also defend editorial control against state-sponsored disinformation.DuckDuckGo (DDG) blocks Russian propaganda outlet RT, leading to accusations of censorship. Commenters debate whether the action is censorship or editorial control, and whether it was necessary to outright block RT instead of down-ranking it. Some argue that blocking RT was more about politics than filtering fake news, but others believe that RT is \"pure garbage\" and blocking it is part of exercising free speech rights. There are concerns that justifying censorship could lead to future repression and limitations on free speech.Big tech's power enables their capability to censor, colluding to protect capitalist profit. Heavy-handed punishments are levied against pro-union activists, and algorithms selectively choose which content people see. Brave plans to release the Brave Search API to compete on quality with Big Tech. Search index service Bing API increases its pricing, and small teams of developers manage search engines effectively. Marginalia.nu consists of one engineer and one server but manages to outclass DuckDuckGo in some relevant queries. Moores law has gone through 13 cycles in Google's existence, allowing for fewer \"hard problems.\"- Brave browser on iPhone offers a good YouTube experience and blocks all YouTube ads\n- Brave search lacks a translator feature compared to StartPage, but Brave does offer a cool Goggles feature for custom re-ranking\n- Brave is a fast and ergonomic browser but has some memory usage issues and lacks customization compared to Firefox\n- Brave comes with crypto/gamification upsell features that can be disabled, but they are not opt-in only as advertised\n- Brave's founder used to head Firefox before being fired over a controversial political donationThe post contains a debate over the ethicality of the former CEO of Mozilla and his contributions to political campaigns. Some argue that using Firefox supports the CEO and his actions. Others argue that politics is irrelevant and Mozilla should solely focus on developing Firefox. The post also includes discussions about alternative browsers such as Brave and Vivaldi, their features, and user experiences. Lastly, there are criticisms of Mozilla's management and its financial dependence on Google.- A discussion thread on HN criticizes Mozilla's strategy against Google's dominance on browsers\n- Some commenters express hope for breaking up Google's monopoly\n- Others doubt Mozilla's ability to compete with Google and suggest focusing on improvement rather than diversification\n- A debate ensues about Mitchell Baker's salary and Mozilla's revenue allocation\n- Cloudflare usage stats show poor Firefox usage on desktop and mobile, suggesting the need for strategy revision to attract new users\n- Some users modify UA strings to combat fingerprinting \n- Firefox's share in higher education is reportedly low",
    "hn_summary": "- Some users prefer to book directly with hotels to ensure they have a room and to avoid potential UX friction from third-party websites.\n- DuckDuckGo blocks specific outlets, leading to a debate over editorial control versus censorship."
  },
  {
    "id": 35724939,
    "timestamp": 1682584095,
    "title": "Dropbox telemetry can't be disabled",
    "url": "https://www.dropboxforum.com/t5/Integrations/Why-So-Much-Telemetry/td-p/455961/page/3",
    "hn_url": "http://news.ycombinator.com/item?id=35724939",
    "content": "DropboxHelp centerCommunityDropbox learnContact supportSign InCommunityAsk the CommunityDo More with DropboxShare an ideaAbout the CommunityEnglishDropbox Replay and the Replay Add-On are now available. See how we use Replay for video project feedback and what our favorite features are right here.IntegrationsFind solutions to issues with third-party integrations from the Dropbox Community. Share advice and help members with their integration questions.Dropbox Community Ask the Community Integrations Why So Much Telemetry ?Options1Ask2CommentsSolutionDark ModeWhy So Much Telemetry ?JayDropboxer10-12-2020 12:45 PMHi @Threlly, @GlynH, and everyone else in this thread, thanks for your patience. Our dev team have informed us that they use telemetry.dropbox.com as a channel to receive client side logging, error reporting, and other metrics. This is listed as a trusted domain since the primary domain itself is 'dropbox.com'.The Pi-Hole add-on marks ‘error reporting domains’ which is what we are gathering through that web path. I hope this information helps to clarify matters. JayCommunity Moderator @ Dropboxdropbox.com/supportDid this post help you? If so, give it a Like below to let us know.Need help with something else? Ask me a question!Find Tips & Tricks Discover more ways to use Dropbox here!What do you think about the Community? Fill out our survey here!0 LikesReplyThrellyHelpful | Level 710-12-2020 01:40 PMHi Jay,I thought I’d turned that off, nor do I want to share information that I have no control over.How do I turn this off ?Who is this information (in any form) shared with ?Thanks,Gary5 LikesReplyJayDropboxer10-12-2020 06:11 PMHi @Threlly, currently, it isn't possible to disable this via the Dropbox desktop application. The information would be sent to the dev team, to further improve the Dropbox desktop application.JayCommunity Moderator @ Dropboxdropbox.com/supportDid this post help you? If so, give it a Like below to let us know.Need help with something else? Ask me a question!Find Tips & Tricks Discover more ways to use Dropbox here!What do you think about the Community? Fill out our survey here!0 LikesReplyThrellyHelpful | Level 710-13-2020 03:54 AMHi Jay,Well that’s me out.It’s constant and I have no control of data being sent from MY machine, especially when I have purposefully clicked the option that turned that off.So it turns out that we have all been deceived.If I want that turned off, that’s it. Period.I’ll migrate my data to another service.Please note: I must also refer this to European GDPR, as Dropbox are clearly not compliant.Thank you all for your patience and help.Kind regards,Gary11 LikesReplymedall12New member | Level 210-14-2020 06:15 AMI found this thread because my pihole is also blocking a CRAZY amount of telemetry.dropbox.com and I fully agree with Gary. We MUST have the option to share our information or not to share the information if that is what we choose. I am very dissapointed in these findings. I will also be looking in to another service to migrate to that is more transparent. 7 LikesReplydoniHelpful | Level 510-14-2020 11:25 PMAlso fully agree w/ the other annotators. one callback per minute is way too much and not providing an option to turn off undocumented!!! telemetry is even worse. This is a 'good-bye trigger' for me. I also think this is not GDPR compliant. Dropboxers, your data protection seriousness is way too lazy!7 LikesReplythisIsBadNew member | Level 210-17-2020 03:54 AMI followed this thread ever since I discovered the amount of data dropbox is siphoning under our nose. It seems that you are right that this is no compiant of European GDPR. If Dropbox doesn't do something and earn back our trust, I see a class-action lawsuit coming their way. 4 LikesReplyeagerish_nuthatchExplorer | Level 410-21-2020 05:05 AMAlso discovering this thread while researching why my pi-hole is blocking such a lage amount of traffic for a service I pay for. Hits in 24 Hours:5 LikesReplyJayDropboxer10-21-2020 09:35 AMHi everyone, I've checked again regarding your concerns and have the following information on the telemetry domain. Using our Telemetry alias, we do not gather any data that is related to GDPR. The data gathered through this alias is user and device agnostic. This alias primarily reports error logs to our team to better improve our product. Our privacy terms and conditions has more information on what and why we collect certain data. You can view that information on this page. JayCommunity Moderator @ Dropboxdropbox.com/supportDid this post help you? If so, give it a Like below to let us know.Need help with something else? Ask me a question!Find Tips & Tricks Discover more ways to use Dropbox here!What do you think about the Community? Fill out our survey here!3 LikesReplyThrellyHelpful | Level 710-21-2020 10:47 AMHi Jay.Thank you.How do we opt out ?Best,Gary2 LikesReplyPrevious123456NextWork Smarter with DropboxReady to learn new ways of using Dropbox? Discover tips & tricks, use cases and feature updates. Connect with other members of our Community and share your story!Featured ThreadsWhat do you like about using Dropbox on Desktop?New Scan Improvements for AndroidWhat’s new this spring--> Did you know... you can search for images using just text?Related TagsThird Party AppsApp integrationsDropbox SignMS OfficeMobile AppDesktop AppWebsiteDropbox PasswordsPreviewingDropbox PaperAndroid OSFAQiOSMac OSView AllWho's talkingTop contributors to this postjayjay1New member | Level 2ThrellyHelpful | Level 7PrivacyAdvocateHelpful | Level 5MarkSuper User IImoebiusNew member | Level 2What do Dropbox user levels mean?Share your ideaGot an idea for Dropbox? We want to hear it. Our team will review the top voted ideas so get voting!Need more support?DropboxDesktop appMobile appsPlansSecurityFeaturesProductsPlusProfessionalBusinessEnterpriseCompanyAbout usJobsPressInvestor relationsBlogSupportHelp centerContact usCookie policyCookies & CCPA preferencesPrivacy & termsSitemapCommunityDevelopersReferralsForum",
    "summary": "- Dropbox uses telemetry to receive client-side logging, error reporting, and other metrics, which cannot be disabled via the desktop application.\n- The data gathered through Dropbox's Telemetry alias doesn't contain GDPR related information and is primarily used to improve the product.\n- Some users are dissatisfied with not having the option to opt-out of sharing their information and are looking for alternative services.",
    "hn_title": "Dropbox telemetry can't be disabled",
    "original_title": "Dropbox telemetry can't be disabled",
    "score": 406,
    "hn_content": "Dropbox users are concerned that the service's telemetry cannot be disabled, leading some to explore open source alternatives like Maestral and Syncthing, which can also prevent inaccessible corporate policies. Users express frustration with Dropbox's increased prices and the limitations of its official client, believing that without VC funding, the company could have stuck with its initial sync offering. Some users also express skepticism towards free cloud services, fearing that they may disappear, or worse, mine and monetize personal data. However, others attest to the stability and ease of use of Dropbox on multiple devices over a decade. Some users argue for alternatives like rclone mount, sshfs, and rsync.net, but others acknowledge a preference for Dropbox's cloud function.Syncthing, a free and open-source tool for syncing files between devices, is praised for its user-friendliness, lack of telemetry, and background usage. It does not require accounts and is easier to set up syncing between multiple machines. The tool works quickly, but new users need to understand machine keys, folder identifiers, and ignore lists. Syncthing is considered as relatively easier for the average HN user but requires some background understanding of computers. It is a reliable tool and can be used as a backup solution, caution must be taken in mistakes made from one device being synced with others.A user discusses their setup for syncing multiple devices, utilizing Syncthing on a Raspberry Pi. They note the ease of maintenance and set up, though they did encounter difficulty when setting up a software raid due to power issues. They also mention the lack of public sharing with Syncthing, which is not a feature they miss due to privacy concerns. A user asks for recommendations for file transfer between Linux and iOS, with Tailscale cli being suggested. Lastly, there is a discussion about the merits and drawbacks of self-hosting services versus using external services, with varying opinions on the matter.Users discuss the ease and convenience of cloud services for off-site backups of data, with some preferring not to use the cloud for security reasons. Dropbox is discussed as a popular option for syncing files across devices due to its simple and effective UX. Some users prefer alternative solutions such as syncthing or Git for syncing code, with recommendations for rsync or Git LFS for larger files. Dropbox's popularity on HN may have been influenced by its backing by YC, and while some users still use it, others have moved on to different solutions due to added features and a decline in user experience.Users discuss alternatives for Dropbox, including Syncthing, Maestral, and Insync, and express concerns about possible security risks associated with USB sticks and Dropbox's telemetry data collection. They debate the acceptability of telemetry logging and discuss the importance of respecting user privacy. Some users express satisfaction with Dropbox's features, such as 2TB of storage and synchronization across multiple devices, while others criticize its approach to Android integration.Users discuss their issues with Dropbox, including the inability to open a folder with a 3rd party app and privacy concerns such as data sharing and unwanted notifications. Some users recommend alternatives such as iCloud or self-hosted solutions like Synology Drive. Others use encryption tools like Boxcryptor or open-source clients like Maestral. Some users express frustration with telemetry and error reporting, while others argue it is necessary for improving software. Overall, the post highlights some of the drawbacks of cloud-sharing services and users' concerns around privacy and control of their data.Dropbox users express concern over telemetry which appears to be non-disablable, with some stating that it is too invasive, and others noting that it is necessary when developing a service. Some commenters suggest using Dropbox alternatives, with Nextcloud being recommended for those looking for a similar experience but with greater privacy control. Users pay varying degrees of concern to the telemetry issue, with some saying that it exposes Dropbox to greater security risks, while others feel that it's par for the course for users of software companies.The Tech Times comment section discusses the transparency requirements of collecting telemetry data, particularly anonymous usage statistics and crash reports, under GDPR. While GDPR requires transparency, it is not an issue if no personally identifiable information (PII) is collected, and consent may not be required. However, if PII is collected for data processing purposes, data controllers must provide its specification and how it's processed for each cost-effective collection of data involving individuals. The relevance of GDPR to the discussion is the subject of debate in the comments. Additionally, some comments suggest alternative file-sharing solutions with version history and robust enterprise controls.- Some users find Dropbox expensive compared to competitors, while others find its extensive features, flawless syncing, and unlimited versions extremely cheap \n- There are competitors such as Microsoft OneDrive, Google Drive, pCloud, iDrive, and Sync.com that offer different features and pricing options \n- Dropbox is still widely used because of its user-friendly interface and integration with other apps and services \n- Some users have trust issues with proprietary apps and prefer open-source alternatives, while others prioritize free options with zero setup requirements",
    "hn_summary": "- Syncthing, a free and open-source tool, is praised for its lack of telemetry, user-friendliness, and background usage\n- Users recommend alternatives such as Nextcloud and self-hosted solutions and express concerns about privacy control and security risks associated with telemetry data collection."
  },
  {
    "id": 35728216,
    "timestamp": 1682604049,
    "title": "Dropbox to reduce global workforce by about 16%, or 500 staff",
    "url": "https://blog.dropbox.com/topics/company/a-message-from-drew",
    "hn_url": "http://news.ycombinator.com/item?id=35728216",
    "content": "Today, our cofounder and CEO Drew Houston shared the difficult news that we’ll be making reductions to our global workforce. He sent the following email to all employees: Hi everyone,I'm writing to share that I’ve made the difficult decision to reduce our global workforce by about 16%, or 500 Dropboxers.First and foremost, I want to recognize the impact this decision has on Dropboxers who are affected and their families, and I take full ownership of this decision and the path that led us here.If you've been impacted, you'll be sent a calendar invitation within the next 30 minutes for a 1:1 with a leader on your team and a member of the People team to go through details of your departure, package, and to ask any questions you may have. You'll also have some time today and tomorrow to wrap up and say goodbye to colleagues.Why we’re making this decisionI've said in the past that our business is stable and profitable. So why would we take a step like this? What's changed?First, while our business is profitable, our growth has been slowing. Part of this is due to the natural maturation of our existing businesses, but more recently, headwinds from the economic downturn have put pressure on our customers and, in turn, on our business. As a result, some investments that used to deliver positive returns are no longer sustainable.Second, and more consequentially, the AI era of computing has finally arrived. We’ve believed for many years that AI will give us new superpowers and completely transform knowledge work. And we’ve been building towards this future for a long time, as this year’s product pipeline will demonstrate.The opportunity in front of us is greater than ever, but so is our need to act with urgency to seize it. Over the last few months, AI has captured the world’s collective imagination, expanding the potential market for our next generation of AI-powered products more rapidly than any of us could have anticipated. However, this momentum has also alerted our competitors to many of the same opportunities.In an ideal world, we’d simply shift people from one team to another. And we’ve done that wherever possible. However, our next stage of growth requires a different mix of skill sets, particularly in AI and early-stage product development. We’ve been bringing in great talent in these areas over the last couple years and we'll need even more.And we need to acknowledge some other hard truths. In some areas, investments that showed promise before the downturn have more limited potential today. In others, we haven’t been executing consistently or managing performance as tightly as we need to. So we’ve made more significant cuts in these areas in order to free up investment in our future growth.I’m truly sorry that as a result of these decisions, we have to part ways with Dropboxers and valued teammates who have made many contributions to the company.Taking care of impacted employeesTo all of you impacted by today’s news, we’re committed to doing as much as we can to take care of you through this transition.Those leaving will be eligible to receive the following benefits and support:Severance and equity: Impacted employees will be eligible for sixteen weeks of pay, with one additional week of pay for each completed year of tenure at Dropbox. All impacted employees will receive their Q2 equity vest.Healthcare: All employees will be eligible for up to six months of COBRA in the US, and similar equivalents where applicable internationally, as well as Modern Health support.Devices: Impacted employees will be eligible to keep company devices (phones, tablets, laptops, and peripherals) for personal use.Job placement: Job placement services and career coaching will be available at no cost.Organizational changesToday’s changes were the result of taking a hard look at our strategic priorities and organizational structure as a leadership team, and aligning to principles of sustainable financial growth, efficiency, and flexibility to invest in our future. We’re also streamlining how the company is organized. For example, we’re consolidating our Core and Document Workflows businesses to reflect renewed focus on integrating our customers’ key workflows seamlessly within our core FSS product. We’re also realigning and refocusing our business teams to reflect proportionate adjustments to the product development teams they support and refinements to our strategy.Team leaders will be following up with more details on any impact to your org shortly.Building for the futureThe changes we’re announcing today, while painful, are necessary for our future. Change is constant in our business, and technology transitions over the last few decades are instructive. As the world moved from physical film to digital photography, or from land lines to wireless communication, or from DVD rentals to streaming, opportunity and disruption went hand-in-hand. Companies that embraced a new reality and took decisive action did well. Companies that held onto the past or tried to have it all did not.These transitions are never easy, but I’m determined to ensure that Dropbox is at the forefront of the AI era, just as we were at the forefront of the shift to mobile and the cloud. We’ll need all hands on deck as machine intelligence gives us the tools to reimagine our existing businesses and invent new ones. And I'm committed to doing everything in my power to best position ourselves for the future and unlock our full potential.In closingWe’ll focus today on supporting impacted employees and saying goodbye to fellow Dropboxers. To those of you who are departing: thank you for everything you’ve done for Dropbox in your time here.Beginning tomorrow through early next week, I’ll be hosting regional town halls to answer your questions and discuss our future plans in more detail. Thank you for your kindness and compassion as we get through this difficult process.DrewFiled UnderNewsThe AuthorDrew HoustonPreviousShare stuff from Dropbox in your Facebook Groups!Share",
    "summary": "- Dropbox will reduce its global workforce by 16% or 500 Dropbox employees due to slowing growth and the arrival of the AI era of computing\n- The company is streamlining its organizational structure to align with sustainable financial growth, efficiency, and flexibility to invest in the future. This includes consolidating some of its businesses and realigning and refocusing its teams.\n- Impacted employees will receive severance, equity, healthcare, retention of company devices, and job placement services and career coaching. The CEO Drew Houston expressed commitment to ensuring Dropbox remains at the forefront of the AI era.",
    "hn_title": "Dropbox to reduce global workforce by about 16%, or 500 staff",
    "original_title": "Dropbox to reduce global workforce by about 16%, or 500 staff",
    "score": 386,
    "hn_content": "Dropbox announced it will reduce its global workforce by approximately 16%, or 500 staff, to shift the company towards a different mix of skillsets, particularly in artificial intelligence (AI) and early-stage product development. Dropbox has been bringing in great talent in these areas over the last few years and will need even more for growth. The move ignited debates on how AI could enhance Dropbox’s development, particularly in improving its enterprise permissions management tools. However, there were concerns about how AI should not solely make all permissions decisions and how language imprecision could impede security.Facebook's \"metaverse\" is seen as a waste of money with no other use or integration with other companies, and it is Facebook's walled garden. The idea that money needs to be made back quickly is challenged by examples like Tesla, whose finances and stock work on different principles compared to an ad company. Many companies' product strategies are close to spitballing, but a strategy exists, and people's full-time job is to curate and maintain it. Wealthy CEOs tend to keep working on passion projects instead of retiring, and their view of the world is sometimes opposite to most people's.Dropbox is focusing on new markets and revenue sources, including the use of AI to improve its products.\n\nSome express skepticism about the hype around AI and its potential for significant change.\n\nCompanies' interest in blockchain and NFTs has been overstated, with few existing companies making significant pivots to those areas.\n\nBitcoin and Uniswap are cited as examples of successful applications of new technology.\n\nThere is criticism of groupthink and negativity towards new technologies in certain online communities.- AI is being used to write literature and journalism but few people are interested in reading it.\n- GitHub Copilot is seen as the only worthwhile \"killer app\" of AI.\n- NFTs are criticized as \"beanie babies\" by many but artists see them as a new way to monetize their work.\n- The digital collectibles created by NFTs have emotional significance for fans and represent a new way to appreciate art digitization.\n- Stable Diffusion uses neural nets to rejigger art created by real humans.\n- Some criticize the use of AI to make art, saying it takes money out of artists' pockets while allowing people to use algorithms to mimic their style.\n- Reddit, Hacker News, and mainstream media are unduly influenced by large corporations and are biased towards crypto.\n- Critical stories about AI are more likely to become buried as compared to critical stories about crypto.\n- The skeptics and critics of crypto are essential for examining its potential, but they are scarce in regards to AI.- DropBox has laid off 1/6 of its employees causing concern from customers and the public.\n- Some commenters question the need for AI in DropBox's file-sharing service and why it would require layoffs.\n- Others suggest AI applications such as personalized user AI models, unstructured data analysis, and improving security.\n- Some criticize companies who pivot to new trends solely for stock market gains, rather than sustainable growth and profitability.Many public companies embark on product strategies that are not valid, like Facebook's Metaverse and Google's Stadia. Evernote also comes to mind. Dropbox tried pivoting to mail and apps (Carousel + Mailbox) but failed. AI can be useful for Dropbox, but urgent use cases are uncertain. Dropbox has a lot of data, which is well-suited to building bespoke, company-specific AI models. As long as they don't betray customer trust, they have a massive starting advantage over organizations trying to convince customers to upload sensitive information. All comments beyond this are speculative.- Incentive structures in tech companies contribute to employment and salary growth.\n- Over-saturation of the job market with bad talent is a problem, partly due to the prevalence of Leetcode hiring practices.\n- A discussion on alternative file-syncing technologies, with Syncthing being a popular choice.\n- The emphasis on continuous company expansion can be problematic; some consumers would prefer companies to focus on perfecting existing products rather than adding new features. \n- The nature of the tech industry demands constant R&D work, which makes it difficult for companies to simply exist without expansion.Cloud storage company Dropbox has announced an expansion in artificial intelligence (AI) capabilities that includes the appointment of a new chief AI officer. Possibilities for the technology at the company include using machine learning algorithms to develop personalisation opportunities for users and \"recommendation engines,\" say experts. The service could also move beyond mere file storage to allow users to undertake other business-related tasks, such as interacting with clients. Dropbox's AI team, which currently numbers around 100, will now be integrated with its product teams.Dropbox's announcement of a 315 employee (11%) reduction in workforce has stirred up conversation questioning the company's future direction. Speculations include the possibility of adding AI capabilities to enhance their service and competing with rivals in the market while others believe this is simply a post-pandemic cost-cutting measure. Some have criticized the company's email notifying employees, describing it as poorly written and misguided. The difficulty in finding people with AI skills at this time has also been raised, with suggestions that the company could retrain some of the laid-off staff.Dropbox is considering using semantic compression algorithms to improve lossy compression techniques, as they have been shown to be hugely beneficial. However, there's a disparity between the computation cost and storage cost for deploying models, which could be addressed through creating small models to plow through data at fast rates. In a related story, Dropbox is planning to lay off 11% of its workforce as part of a restructure, which includes shifting to remote working, reducing real estate, and investing in core areas of the business. The decision to cut 500 employees represents roughly 16% of Dropbox workforce.- Google is planning to cut 500,000 jobs due to challenging market dynamics.\n- Commenters express skepticism, calling out the lack of transparency behind the decision and suggesting that it may be driven by investor demands.\n- Some commenters question the choice of 500,000 as a round number and speculate on the origins of the decision.\n- Overall, the post provides a glimpse into the debate surrounding Google's job cuts, but there is no concrete information or official announcement.",
    "hn_summary": "- There are debates about the potential of AI, including enhancing enterprise permissions management tools and concerns about language imprecision impeding security.\n- Some commenters criticize companies that pivot to new trends solely for stock market gains, rather than sustainable growth and profitability."
  },
  {
    "id": 35726559,
    "timestamp": 1682595602,
    "title": "A visual book recommender",
    "url": "https://nathanrooy.github.io/posts/2023-04-12/visual-book-recommender/",
    "hn_url": "http://news.ycombinator.com/item?id=35726559",
    "content": "[+]A visual book recommenderIntroductionI have this long running conjecture that used book stores are superior to commercial book outlets (including Amazon) for discovering books. One of the reasons for this I think has less to do with a skewed explore/exploit strategy, and more to do with the way exploratory suggestions are sourced. I think financial pressure skews exploratory search suggestions towards oversampling newer books rather than older adjacent books. I get that though; oversampling newer books is a simple way to help combat the rich getting richer trap. The problem is that I’m biased against new books; I think they’re mostly noise. Used books stores on the other hand are curated by humans for other humans (who probably live nearby). If I ask for a book that’s like “x” they’re not going to point me to the newer version of “x”, they’re going to show me books “y” and “z”. There are additional reasons that go beyond just oversampling newer books which I’ll touch on later. I’ll also admit that all the supporting evidence I have is completely anecdotal, but still, when I want a new book I don’t pull out my phone, I walk down the street to the used book store.First attemptI’ve been casually thinking about how a book recommender could reflect the used book store experience for a while now. This first attempt is still a bit rough around the edges, but I think it captures some of what I’m after. It initially started out as roughly 100M book reviews that were then distilled into basic reading preferences. I then rode the Pareto frontier between latent representation and model accuracy for about a month before I landed on what you see below. Books closer together indicate a stronger favorability. Enjoy! (make sure to go click the full screen button)+−LeafletGenre clustersI think one of the key drivers fueling the high discovery rate at used book stores has to do with the layout. All of my favorite used book stores are located in old buildings that have lots of nooks and crannies. It’s this fractal approach to book layout that I think encourages exploration into areas you wouldn’t explicitly seek out otherwise. This “nooks and crannies” feeling was a major attribute I was trying to recreate with this first iteration.Below, you’ll find a selection of the most common genres. Each book and its assigned genre are represented once as a single point. Keep in mind that the model has absolutely no understanding of authors, genres, book descriptions, vocabulary, or plot lines. It simply knows which books people liked more than others. Each cluster represents a collection of books which have a higher than expected favorability amongst a subset of readers. A large genre such as Science-fiction can include many clusters each representing a different pocket of interest within that genre. A genre that consists of one cluster with sharp, well defined borders (such as Romanian-literature or Christian-fiction) indicates a readership with more focused interests.AdventureAfrican-americanAliensAlternate-historyAmishAngelsArtBdsmBiographyBuddhismBusinessChick-litChildrensChristianChristian-fictionChristmasClassicsComicsCookbooksCrimeDarkDystopiaEconomicsEroticaFantasyFictionFinanceGraphic-novelsHealthHistorical-fictionHistorical-romanceHistoryHorrorHorsesHumorLeadershipM-m-romanceMangaMarriageMemoirMiddle-gradeMusicMysteryNew-adultNon-fictionNovelsParanormal-romanceParanormalPhilosophyPicture-booksPlaysPoetryProgrammingPsychologyRealistic-fictionReverse-haremRomanceRomanian-literatureRomantic-suspenseRussianScience-fictionScienceSelf-helpShapeshiftersSpiritualitySports-romanceSportsStar-warsSteampunkTheologyThrillerTime-travelTrue-crimeTurkish-literatureUrban-fantasyVampiresWesternsWitchcraftYoung-adultZombiesIn most clustering situations, crisp, well defined borders are the desired outcome. Points which fall outside of these boundaries are usually seen as a nuisance (customer segmentation amiright?). In this particular situation though, the books which fall between multiple clusters actually represent something rather interesting. They’re books that strongly capture multiple readerships (or they capture a smaller, more diffused readership).Technical detailsA few years ago, I scraped a little over 100M book reviews spread across 505k unique users and 6.97M books. In order to reduce the potential influence of spam reviews I took the following measures:Only include books with 100 reviews or more.Only include reviews which came from users who had at least 10 reviews.Only include users who had reviews spread across a minimum time window of 6 months.After filtering, the total review count dropped down to 26.8M across 396k users and 59k books. Since many of these books were in fact just different editions of the same book, they were consolidated into their canonical version represented by the edition with the most reviews. This brought the final count to 51,847 books.The model itself is just a basic siamese network with a contrastive loss. I had initially implemented a triplet loss which yielded good model performance but the embeddings lacked the aesthetic qualities I was after. After some tinkering, I ended up simplifying it down to the pairwise contrastive loss you see below:We can clearly see that this loss contains two distinct forces trying to overcome each other. If we establish d as the euclidean distance between the latent representations of two books xi and xj, then y=0 represents two books in close proximity with each other while y=1 are two books further apart. With the bounds established, the forces become apparent.With these two competing forces shuffling books around, the next question becomes: how do we want to define similarity? I actually tested about a dozen different strategies and ended up using the pointwise mutual information shared between books.High PMI scores are produced when the joint probability of liking two books a and b exceeds the expected probability of liking those same two books assuming independence. Now it’s just a matter of computing these distributions, but in order to do so we now need to define like and dislike… Well I hate to disappoint:Not only was this the very first thing I tried, and after testing maybe twenty variants (this includes model training too!) it was still producing the best embeddings. I know, what a letdown… Now the original question of similarity can be resolved with the following:With everything defined, the filtered 26.8M reviews were expanded into just over 300M pair-wise training rows. Each book was represented by a one-hot encoded array (1x51847) and compressed into a 64D latent space by the model. To further accentuate the clusters, instead of running through each training row per epoch, I sampled rows proportional to the combined (book a + book b) review count frequency. After model training, the 64D book vectors were further compressed down to 2D via t-SNE. The output of which can be seen below.Because t-SNE doesn’t care about overlapping points I needed a way to both remove the overlap and add some padding around the book covers. The script I wrote to accomplish this iteratively moves the book covers while also producing these oddly satisfying animations…Thoughts on v2.0My favorite books fall within the intersection of engineering and adventure. Not “engineering” as a subject, but rather from the perspective of the engineers. My favorite book of all time, Skunkworks by Ben Rich captures this beautifully. The fact that Skunkworks hasn’t been made into a movie in the style of the The Big Short blows my mind. Anyway, books like Apollo (Charles Murray & Catherine Cox), The Descent (Brad Matsen), The Fastest Men on Earth (Paul Clifton), and The First Crossing of the Polar Sea (Roald Amundsen) are other great books in this area. But since aerospace engineering doesn’t have a whole lot of overlap with deep sea exploration, I never get served these recommendations online. Thank goodness for The Ohio Book Store!Anyway, I’ve been experimenting with the idea of long tail book recommendations and fuzzy vectors and the initial results have me really excited. I just want more serendipitous book suggestions!Home | About | RSS",
    "summary": "-Author prefers used book stores over commercial options for book discovery due to skewed search suggestions towards newer books.\n-An initial attempt at creating a book recommender that replicates the used bookstore experience.\n-The model is based on 100M book reviews, reducing spam reviews, and a siamese network with contrastive loss. Uses pointwise mutual information shared between books for similarity.",
    "hn_title": "A visual book recommender",
    "original_title": "A visual book recommender",
    "score": 368,
    "hn_content": "A new visual book recommender has been released by Nathan Rooy, which maps all authors in the world and sorts them based on overlap in readership. Users can use it to find new books based on genre and author, as well as see which authors are related based on readership. Other similar tools include Shepherd, literature-map.com, YASIV, and same.energy. However, tools may lack accuracy, and popular books with many varied appearances in reading lists can be hard to map to similar books. Victims of this effect include Harry Potter and The Chamber of Secrets and Lord of the Rings.A visual tool for organizing and discovering books was developed using t-SNE visualization algorithm. Users can search for books and see similar books clustered together on a map. Post-t-SNE processing can be used to get non-overlapping items. Similar tools exist for papers and movies. Users can import their Goodreads reading lists and see them on the map. The tool can generate book recommendations based on clustering data. The tool is fun to use and can reveal interesting insights. Some clusters are ironic, like the proximity of a Donald Trump book to \"Getting Things Done\" by David Allen.",
    "hn_summary": "- Other similar tools include Shepherd, literature-map.com, YASIV, and same.energy, but they may lack accuracy, particularly with popular books with many varied appearances in reading lists.\n- Users can search for books and see them clustered together on a map, import Goodreads reading lists, and generate book recommendations based on clustering data. The tool can also reveal interesting insights like ironic clusters such as the proximity of a Donald Trump book to \"Getting Things Done\" by David Allen."
  },
  {
    "id": 35730075,
    "timestamp": 1682611278,
    "title": "Even Apple employees hate Siri & are skeptical of its future, new report says",
    "url": "https://9to5mac.com/2023/04/27/apple-employees-siri-struggles/",
    "hn_url": "http://news.ycombinator.com/item?id=35730075",
    "content": "Exclusive: Latest iPhone 15 Pro CADs reveal ‘Action button’ and camera changesIan ZelboApr 26 2023",
    "summary": "- This article is not connected to the title or topic.\n- No meaningful content for a summary.",
    "hn_title": "Even Apple employees hate Siri and are skeptical of its future, new report says",
    "original_title": "Even Apple employees hate Siri and are skeptical of its future, new report says",
    "score": 332,
    "hn_content": "Reports suggest that even Apple employees are skeptical about Siri's future, as the quality of the speech recognition of iOS's voice assistant fluctuates and declines. Customers are experiencing that Siri is misunderstanding their commands, giving incorrect responses or randomly misinterpreting any similar sounding words. People are frustrated with their inability to use Siri as it is intended, especially when using the onscreen keyboard or in-car voice assistant.A discussion on the accuracy of Siri's pronunciation in German sparked a conversation on the difficulties of voice commands for virtual assistants. Some users suggested that the issue is not with speech recognition but with Siri's inability to carry out the intended action, like when it mistakes a command to turn off one light as to turn off all the lights. Others expressed frustration with the inconsistency of voice commands for things like playing music, while others noted that Apple has been praised for its accessibility features. Overall, the discussion highlights ongoing challenges in optimizing virtual assistants for human speech and needs.Users complain about Siri's inconsistency in recognizing keywords and phrases, with some words suddenly working again after months of not. Some users switch to English, which works better than their native language. Autocorrect and swiping also have their own issues, including changing \"and\" to \"abs\" and \"20\" to \"2.0.\" Users also report Alexa's recent failure in doing anything other than weather and timers without promoting subscription, and iCloud Drive's lack of snapshots like Dropbox. HomePod Mini even mistakenly reacts to Siri prompts in TV shows.Users on Hacker News discuss the deteriorating state of Apple's Siri and voice assistants in general, with many pointing out Siri's lack of progress and suggesting that Apple invest in rebuilding the platform. Some users note the importance of accessibility features like voice control in iOS, but others express disillusionment with the limitations of current voice assistants when it comes to basic tasks like playing music or controlling lights. Several users express disappointment with the lack of options for reading an article behind a paywall.Users express frustration with Siri's handling of natural language commands, maintaining a train of thought, and recognizing simple requests. Some users report Siri's failure to recognize downloaded music unless connected to a network. Siri's reliance on cloud processing also causes delays, failures, and misinterpretations. There is speculation that Siri may benefit from on-device voice recognition leveraging onboard hardware. Users recommend Google Assistant or Amazon's Alexa for a better experience. Some users express concerns with continued reliance on voice assistants due to their potential for errors.People debate the reliability and usefulness of voice assistants, with some finding them helpful for tasks like setting reminders or timers while cooking, and others finding them frustrating and unreliable. Users have different standards for what counts as reliable enough, with some continuing to use assistants despite frequent mistakes. Some find that assistants from Google or Amazon are more effective than Apple's Siri, while others prefer Siri for consistency across devices. Concerns have been raised about the possibility of assistants being used to suggest or sell products, potentially eroding users' trust in them.A discussion thread on Hacker News debates people's experiences with Siri as a voice assistant. Many people report issues with Siri's speech recognition, particularly in noisy environments and with thick accents. Some find that adapting their speech patterns to be clearer and more concise helps with accuracy. Others report success in using Siri for basic tasks like setting timers and playing music, while others criticize its inability to handle more complex requests. There is also discussion about Siri's compatibility with third-party apps like Spotify and Homekit. Some users have found workarounds, while others have switched to other voice assistants like Google Home and Alexa.- Users discuss limitations and issues with Siri's timer feature, including lack of support for multiple timers on iPhone and HomePods\n- Some users find voice assistants like Siri, Alexa, and Google Assistant to be generally useful for simple tasks like setting timers, playing music, and turning off lights\n- Others criticize voice assistants for inconsistent performance and frequent bugs, arguing they are \"novelty\" products not to be relied on for important tasks\n- Some users imagine a future where voice assistants become more advanced, with chatbot-like functionality and better voice synthesis technology\n- Users mention frustrations with Siri's inability to distinguish between \"tell\" and \"call\" commands and its frequent bugs, especially when used through CarPlayUsers express frustration with Siri's lack of contextual understanding, frequent music-playing responses to unrelated queries, and replacement of random words with UK town names. Some express annoyance with devices that listen to them and dislike of voice-based automation systems. Others suggest that the use of language models like GPT could make Siri more effective, but there may be back-end issues as well. There is no official way to replace Siri with another assistant, and Apple's Siri team is criticized for failing to keep up with competitors in the voice assistant market.Apple users express frustration with Siri's inability to understand voice commands accurately, causing them to turn to other voice assistants like Google's. Users report problems with Siri setting timers, giving directions, playing music, and interacting with other apps on their devices. While some users defend Siri's usefulness, others say it needs significant improvements, especially in processing natural language. The comments also touch on OpenAI's ChatGPT system, pointing out its impressive but flawed abilities. Despite Apple's desire to integrate Siri into their ecosystem, it appears that the AI's limitations are driving customers away.Google's CEO, Sundar Pichai, personally recruited three AI researchers reportedly from Apple to work on the virtual assistant, Google Assistant. The virtual assistant is said to be more versatile than Apple's, Siri. The reason for Google's interest is an increased in competition in the AI sector, where virtual assistants have become a vital part of daily living for many users. Despite issues with several virtual assistants not working correctly, providers continue to work on improving them. AI's current limitations and tracking technology need improvement to ensure success, with virtual assistants' unique needs requiring advanced technology to perform optimally.",
    "hn_summary": "- Users complain about Siri's inconsistency in recognizing keywords and phrases, with some words suddenly working again after months of not.\n- Users on Hacker News discuss the deteriorating state of Apple's Siri and voice assistants in general, with some suggesting that Apple invest in rebuilding the platform."
  },
  {
    "id": 35722681,
    "timestamp": 1682563267,
    "title": "Emerging Rust GUI libraries in a WASM world",
    "url": "https://monadical.com/posts/shades-of-rust-gui-library-list.html",
    "hn_url": "http://news.ycombinator.com/item?id=35722681",
    "content": "Rust GUI development is progressing rapidly with state-of-the-art frameworks and toolkits. Rust's cross-platform support and WebAssembly integration have made it a popular choice. Some notable Rust GUI toolkits are Dioxus and Tauri, which are designed for desktop applications. Xilem is a promising experimental framework aiming to be the premier Rust GUI library, and Iced is a cross-platform library focused on simplicity and type-safety. Egui, a portable Immediate Mode GUI library, provides easy-to-use functionality, making it an excellent choice for simple GUIs and games. Despite the fast movement of the Rust GUI world, these tools provide a good starting point, even if they might be updated soon.This post discusses four different GUI frameworks for Rust: KasKas, Slint, Sycamore, and Yew. KasKas is a retained-state toolkit that is ahead of WebGPU's capabilities. Slint aims to provide users with an imperative tool for web, embedded systems, microcontrollers, and desktop with its own scripting language. Sycamore is a reactive library for creating web apps with a good developer experience. Finally, Yew is a popular GUI framework built for the web with similarities to React, but components are built like state machines. Yewdux can be used for redux-like data handling.1. rebranded roguelike toolkit, Bracket, runs on web and desktop, has OpenGL mode and wgpu backend\n2. Cursive is a console lib for terminal interfaces\n3. Vizia is a declarative and reactive GUI framework, with GPU rendering and multiplatform support\n4. Leptos is an isomorphic web framework with fine-grained reactivity and a router for both server and client\n5. Perseus is a fast and versatile framework for building web apps1. Perseus is a rendering strategy built on top of Sycamore for web development with reactive semantics for state variables.\n2. SauronLibrary offers simple UI declarations and ELM-like state management for web development.\n3. MoonZoon is a full-stack framework with frontend state management using signal semantics.\n4. Relm4 is an idiomatic GUI library based on gtk4-rs inspired by Elm with compatibility with GTK4 and libwaita for desktop and device development.\n5. Relm4 can make use of CSS for UI rendering with desktop and device development.",
    "summary": "- Rust's cross-platform support and WebAssembly integration have made it a popular choice for GUI development\n- Notable Rust GUI toolkits include Dioxus, Tauri, Xilem, Iced, and Egui\n- This post discusses four additional Rust GUI frameworks: KasKas, Slint, Sycamore, and Yew, as well as other tools like Bracket, Cursive, Vizia, Leptos, Perseus, SauronLibrary, MoonZoon, and Relm4.",
    "hn_title": "Emerging Rust GUI libraries in a WASM world",
    "original_title": "Emerging Rust GUI libraries in a WASM world",
    "score": 317,
    "hn_content": "A Hacker News post highlights the emerging Rust GUI libraries in a WASM world. The post features a bunch of Rust frameworks that sit on top of the core OS UI frameworks. Silkenweb is similar to Leptos and Sycamore and supports all the usual things like SSR and hydration, along with a few nice extras like scoped CSS. Egui is the highest performance Rust GUI library, built to achieve the goal of showing as many rectangles onto the screen as possible. The canvas-only technologies could eventually trump the inspectability benefits that came before but should accommodate most of the features like screen readers, keyboard shortcuts, and copy+paste text.A discussion on HN discusses the limitations of using Canvas to render large numbers of rectangles for a profiler. One commenter suggests using WebGL or GPU rendering to bypass performance issues with Canvas. Another suggests that GUI toolkits should handle choosing what to render as native HTML versus what needs to be rendered on Canvas, and asks for recommendations for Rust-based alternatives to egui. The original poster mentions that a specialized UI library was used for their use case. The discussion highlights the importance of considering performance and UI integration when choosing a rendering method.The post discusses the benefits of using a 3D rendering library for better performance and lower level interface to hardware in web applications. It also talks about the challenges of using a mixed UI and the importance of accessibility in user interfaces. The post highlights the efficiency of egui, an immediate mode GUI, in drawing UI elements and optimizing performance. Finally, the post suggests the idea of a simple and interactive plotting library for data visualization as a potential weekend project.Developers recommend different Rust GUI libraries to create graphics in notebooks, including fastplotlib, pygfx, bokeh, dear-imgui, and egui, with varying speeds and ease-of-use. There is a debate over canvas rendering and portability vs. consistency of look and style. Some libraries are advised for internal tools and fast reactive isomorphic apps in Rust, while others offer accessibility features. Some users reported issues with crashes, lagging, and poor widget support, and urged the need for more well-supported widgets in Rust GUI programming. Despite progress in Rust GUI, there is yet no definitive solution for GUIs.Developers discuss the tradeoff between programming and problem domain expertise, with many agreeing that highly invested programmers may struggle to engage meaningfully with problem areas that could be solved with programming. The success of a UI platform is highly dependent on solid foundations, with many developers agreeing that the browser is currently the most successful UI platform. There is a need for cross-platform widgets that support many web frameworks. Rust has multiple solutions for native GUIs, however.Rust GUI development is delayed due to the language's push towards correctness and the ownership model not fitting popular GUI solutions, leading to a search for solutions that work within constraints. Native Rust solutions that work with the borrow checker are preferable, with most real shipped apps having a majority of the GUI code written in bindings. While handling business logic is more important than having many widgets, larger resources are essential when not certain of needs, and a definitive solution to GUIs might never exist across OSes or even within the same platform.Developers discuss the user experience (UX) of web-based UIs versus native ones, with some preferring options like Swing or Qt over web or Electron apps. Some Rust users praise Electron's work towards accessibility, but a web-based approach can cause complications for virtualized scrolling. AccessKit aims to fix some of these accessibility issues but has limitations, including performance costs and developers using it as an excuse to ignore other accessibility issues. The developers discuss the pros and cons of different approaches to creating accessible user interfaces, emphasizing that there is no perfect solution.The comments on this HN post mostly revolve around accessibility and limitations of canvas-based rendering. AccessKit is praised for trying to solve accessibility issues. However, some see the problem lying with frameworks causing the issue, such as Flutter's canvas-based rendering. The fragmentation of GUI libraries in Rust is also discussed, with some suggesting that a dominant framework is necessary for broad adoption. The potential for Rust to be used as the performant and stable core of software systems is noted, but its future as a mainstream GUI language remains uncertain.Some commenters discuss the potential for Rust to become a serious player in frontend development with wasm, citing improved UI frameworks and the ability to handle tasks like games, CAD, and 3D modeling. However, others note that wasm binaries produced by Rust can be larger and slower to load than those produced by other languages, like TypeScript. Rust's tendency to include bounds checks and other safety features can add bloat to code, and reducing that bloat can be tricky. While Rust offers exciting possibilities in frontend development, it remains to be seen if it will overtake the established dominance of JavaScript and TypeScript in this area.Readers discuss the use case for Rust-based GUI and its syntax, manual memory management, and compile times, which are considered suitable for compilers, embedded systems, and not GUI; Rust lacks garbage collection but offers enum types, sensible error handling, generics, non-nullable types, or macros compared to Golang; Rust's power in complex graphics applications and vector or image editor is acknowledged; however, its adoption requires a learning curve overlooked by many. Meanwhile, the post lacks meaningful content or new developments.Developers discuss their preferences for programming languages, with some finding Rust to be particularly challenging due to its complexity and use of generics and macros in libraries. However, others note that the difficulty of the language can depend on one's experience and preferred style of programming, with Rust enforcing a different paradigm than object-oriented programming languages. Some developers also express interest in WebGPU for app GUI development, while others warn against using it for standard UI and suggest using existing solutions like DOM or frameworks like Flutter.- Developers are excited about the implementation of the WebGPU toolkit in Rust and other languages.\n- Crablang and Vlang are being discussed as potential alternatives to Rust in the memory-safe programming space.\n- The creator of Vlang has promised automatic memory management without a GC, but this is still a work in progress and some doubt it's possible without making sacrifices.\n- Vale and Lobster are other languages that are attempting to make memory-safe programming more user-friendly, but it's still unclear whether it's possible and how it would look.",
    "hn_summary": "- Discussion highlights the challenges of using Canvas to render large numbers of rectangles and the importance of considering performance and UI integration when choosing a rendering method.\n- Despite progress in Rust GUI, there is yet no definitive solution for GUIs."
  }
]
