[
  {
    "id": 35525294,
    "timestamp": 1681221760,
    "title": "I worked at Google for -10 days",
    "url": "https://andgein.ru/blog/all/20-i-worked-at-google-for-10-days/",
    "hn_url": "http://news.ycombinator.com/item?id=35525294",
    "content": "I worked at Google for -10 daysYour passwordI forgot Public computer     Sign in                Заметки Андрея Гейна I worked at Google for -10 daysIt’s the story of how I was laid off from Google before I even started to do my job there. I have tried to write only facts, although there is a small hurricane somewhere inside me right now.It began nearly a year ago, in April of 2022, when I applied for multiple SWE and SRE positions at Google. Large tech companies usually have a lengthy hiring process, but I could take it slow. I successfully completed five technical interviews during May and June. However, shortly after that, the company encountered some difficulties due to the global post-COVID crisis, and as a result, HR were unavailable for weeks. I had to be patient.In July, I entered the Team Matching Phase where I had the opportunity to meet with hiring managers. During these meetings, we talked about ourselves, the team, and the project, and ultimately decided whether or not we were a good fit for each other. After attending two meetings, I realised that I wasn’t interested in joining either team at the moment.Regrettably, I had to wait a considerable amount of time for the next opportunity. Google had announced an international hiring freeze, which essentially halted all interview and job offer processes. The exact extent of the freeze and the regions it affected is unclear, with contradictory information available online. Nevertheless, the freeze did affect me: I was assigned to a different HR manager who informed me that “Unfortunately we are not in a position to move forward with your application at this time due to a current slowdown in hiring at Google. Our leaders are taking the next few weeks to review our priorities for the rest of the year and we hope to have an update for you at the beginning of August.”At the beginning of August, things didn’t change a lot (“Unfortunately we still have a pause on hiring and I’m afraid that there have been no further updates from the business side at this point in time.”), and at the end of the month either (“Unfortunately we still haven’t had any news, I’m really sorry that it’s taking longer than initially expected”). It wasn’t until the end of September that the situation shifted. I received news that my candidacy could be submitted to the Hiring Committee before completing the team matching phase. Nearly six months after submitting my application, I was thrilled to learn on October 11th that the Hiring Committee had approved me. The next step was to find a team that was willing to bring me on board. Fortunately, a suitable team was found in November. I had a conversation with Tom, the hiring manager, and we hit it off. From there, the process moved forward smoothly.On November 17, my salary was announced and in December, I received an official offer for a SRE position at Google London. I began preparing for my move by taking an English exam and a mandatory tuberculosis test for Russians working in the UK. After the long New Year holidays, I applied to the visa application center, which took nearly two months to issue the visa. In March, I quit my previous company, Yandex, to spend the last month preparing for my move to London, which involved vacating my apartment in Yekaterinburg, packing my belongings, and selling some items.I had planned to fly out on April 10, giving myself a week to acclimate and get comfortable before starting work on April 17. However, on the evening of April 6, I received an unexpected email from Liz West, the head of Google Cloud HR in Europe, asking to connect with me regarding “an update on my Google offer”. I chose to connect the following day.During the call, Liz West informed me that my contract with Google had been terminated due to a wave of layoffs that began in the United States and now reached Europe and Britain. “Unfortunately”, my position had come under reduction, so I no longer had the job I had been working towards for the past year. Nothing personal, just business.This is the official notification that I received after the conversation:Thus, the contract with me has been terminated 10 days before it was supposed to take effect.As for what to do next, I am not entirely sure yet. I held a “garage sale” (in Russian) and sold most of my belongings. The remaining items were either discarded, recycled, or packed into two suitcases that I had planned to take with me. Moving to a new country is a difficult task that typically requires months of preparation. Changing these plans on the fly is challenging and somewhat painful. However, I feel that I should say something optimistic at the end. All will be good 🙂If you would like to speak with me, please send an email to andgein@gmail.com, or message me on Telegram @andgein. Additionally, I would be grateful if you share this story as widely as possible.TweetShareShareSendPin 49297  4 d  google   layoffCtrl ←Заметка двадцатая. Как я проработал в гугле -10 дней8 comments  Андрей Гейн   3 d  Feel free to share this post via direct link,in twitter https://twitter.com/AndrewGein/status/1644413952141541376,linkedin https://www.linkedin.com/posts/andgein_swe-sre-google-activity-7050144892131450881-S2QQor hackernews: https://news.ycombinator.com/item?id=35525294.Thank you :-)Mookie   10 h  Theres plenty to be found in London, don’t fret. Google and Co are all companies I would avoid to work for anyway. They may seem like a great opportunity which may be but can be ruthless (as you’ve just encountered). A smaller company is more fun and has a faster hiring process.Best of luck.Been there done That   9 h  keep your head high. London is amazing for good talent.Vladimir Rudolfovich Solovyov   9 h  1st world problem. You might get the things you sold from some other vatnik over there.  Yulian Kuncheff   9 h  While mine was in a different location, I had the same thing on the same.timeline happen to me. Almost the exact same dates. But they gave me a low offer so I declined it. There is a chance if I accepted it, I would have been laid off before I started also.I wish you luck finding something knew. There is a Bulgarian saying Всяко зло за добро, which would be Нет худа без добра in Russian. You will find something great from this mess!You deserve better   8 h  It could always be worse. Once relocated cross country, everyone else got laid off during my first week, and they stiffed me on relocation and left me homeless. You’ll land on your feet :)red = dead   5 h  Who the fuck cares. Crawl back to your shithole.fella   3 h  Yikes, that’s bad timing. Isn’t there a new round of mobilisation soon? Watch out for drones when you are in the trenches.Your comment   Sign in via                                                                     Full nameEmail Get other comments by email    Submit Ctrl + EnterYour comment   Sign in via                                                                     Full nameEmail Get other comments by email    Submit Ctrl + Enter© Андрей Гейн, 2017–2023RSSPowered by Aegea",
    "summary": "The article describes the author's experience of being laid off from Google ten days before starting their SRE position in London due to a wave of layoffs, which was a difficult process as they had already quit their previous job and prepared for the move. The author described the complex and lengthy hiring process they went through and their disappointment at not getting the opportunity to work at Google after all. Some HN users left supportive comments, while others were less empathetic.",
    "hn_title": "I worked at Google for -10 days",
    "original_title": "I worked at Google for -10 days",
    "score": 645,
    "hn_content": "A story of a person who worked briefly for Google has sparked discussion on Hacker News, with some commenters sharing stories of similar experiences with other companies. Some advise against putting in notice until all paperwork is completed, while others recommend pushing back start dates if necessary. Some commenters discuss controversial policies on quitting at other companies, such as immediate termination, while others share experiences with vacation policies during notice periods. Although the thread covers a variety of topics, the main point of discussion is the risks and pitfalls of quitting a job and accepting a new offer.The comments on this post, which is likely to attract tech experts, involve a discussion regarding the ethics of companies that pay employees for two weeks after the notice period has ended. Some users argue that it's better for the business to pay these weeks to minimize risk and avoid unemployment premiums, while others suggest it's reasonable for businesses to immediately terminate employment after employees give their notices. One user notes that some smaller companies, particularly after rapid growth, may struggle with employees leaving and are awkward about things ending. While there are exceptions, in most professional US-based jobs, employee termination comes with severance pay or notice. European countries often require payout for the notice period, and the length also varies depending on the employee's length of service.HN users discuss their experiences with background checks and drug screens during the hiring process, with some noting that they have worked for companies that only conducted screenings after employment. The topic of giving notice when transitioning jobs is also discussed, with some users advocating for waiting until the first day with the new company to give notice, while others note that this can be difficult or impossible with relocation involved. Some users also explain employment notice periods and employment rights in different countries.A Hacker News thread discussed the ethics of working a new job while still collecting a paycheck from an old employer, which some commenters found unethical and risky, as it could lead to legal trouble. Some people have found ways to manage this situation, such as giving two weeks notice and waiting for a written job offer. However, others warned that violating employee policies could result in termination or legal action, and advised caution. Some commenters also expressed frustration with HR practices and wondered if AI could improve the hiring process, while others pointed out potential drawbacks and errors that could come with automated recruiting.An article on Hacker News recounts a hiring mistake that led to an offer being rescinded, with users sharing their own experiences about similar incidents. Suggestions for better hiring processes include using AI or \"one-click-apply\" systems. Some users point out the possibility of at-will employment and managerial objections that could cause last-minute changes. Others share their own clauses for relocation expenses or redundancy protections in employee agreements. Commenters advise against quitting a job before passing probation at a new employer, while some express disbelief at companies taking such risks with potential employees.Employees should consider asking for relocation protection in their job contracts, though it may not always be possible. One solution seen in larger companies is to have a relocation bonus paid on the start date. However, this does not account for situations where the employee is laid off before their start date. Relocation protection clauses are common and companies may have prepared clauses that they can add upon request or negotiation. However, not all companies will allow employees to add clauses to their contracts. Candidates may also hedge their bets by not giving notice until one to two weeks into their new job.HN users share their negative experiences with Google and Apple's hiring processes, including rescinded offers and personal attacks from hiring managers. However, one individual shares positive experience and recommends prioritizing oneself when disrespected by an employer. Discussion also includes the challenges of preventing unfair disadvantage for candidates while maintaining hiring standards and preventing wasted preparation. Some comments suggest that public tech companies prioritize stock price instead of employee satisfaction or customer satisfaction, while others argue for the need for cost-cutting measures due to flat revenue growth.A discussion on the rescinding of job offers by tech companies has taken place on Hacker News, with some suggesting that binding job offers with compensation requirements would be a good solution. Others suggest the hiring of additional staff would increase employment risk factors and potentially lead to additional rounds of interviews; the burden would be amplified in struggling economies. One user suggests companies should be held accountable for actual costs incurred by rescinding offers, including replacement of discarded items and moving costs. The main point stressed is that the human cost of decisions should not be forgotten, and companies should be more strategic in their hiring practices.Google is facing criticism after a job offer was rescinded one week before the employee was due to start. While the company offered to pay the employee for two months to make up for relocation costs, many have called for clear laws to be imposed in such cases. One commenter suggested “any offer revoked before the agreed start date implies mandatory payment of six months of salary, automatically, without exception”, while others proposed a severance payment, should termination occur pre-employment agreement. Meanwhile, one expert suggested that the problem centres on companies hiring people whom they do not need in pursuit of growth, while another proposed automating the hiring and firing processes in full.An HN user suggests that moving to another country for a job may be worth the risk if a company cannot compensate a person appropriately; they suggest using resources to hedge against serious downside if things do not go as planned. This is seen as more sensible and realistic advice compared to relying on laws for protection. However, another user notes that laws are meant to protect those who may not have the resources to proactively protect themselves. The importance of having a buffer of savings is mentioned, but this is dismissed as being applicable only to those with financial stability. Overall, the thread discusses the risks and strategies involved in making a big move for a job, including the difficulties of navigating legal systems in another country.",
    "hn_summary": "A Hacker News post about the risks and pitfalls of resigning from a job has sparked conversation. Users discuss controversial policies on quitting at other companies, such as immediate termination, and vacation policies during notice periods. The ethics of working a new job while still collecting a paycheck from an old employer are also discussed, as are experiences with background checks and drug screens during the hiring process. Some users suggest asking for relocation protection in job contracts and hedging bets by not giving notice until one to two weeks into a new job. One user suggests that clear laws should be imposed around job offer rescinding, while another proposes automating hiring and firing processes."
  },
  {
    "id": 35526768,
    "timestamp": 1681227822,
    "title": "Substack Notes Launched",
    "url": "https://on.substack.com/p/notes",
    "hn_url": "http://news.ycombinator.com/item?id=35526768",
    "content": "Now live for all: Substack Notes - On SubstackOn SubstackSubscribeSign inRead in the Substack appOpen appShare this postNow live for all: Substack Noteson.substack.comCopy linkTwitterFacebookEmailProductNow live for all: Substack NotesA way to share posts and short-form content on SubstackApr 11, 2023713211Share this postNow live for all: Substack Noteson.substack.comCopy linkTwitterFacebookEmailToday we’re launching Notes to everyone. Notes is a new space where you can publish short-form posts and share ideas with other writers and readers on Substack. Try NotesNotes helps writers’ and creators’ work travel through the Substack network for new readers to discover. You can share links, images, quick thoughts, and snippets from Substack posts. As well as being lightweight and fun, we hope that Notes will help writers grow their audience and revenue. Notes lives in a tab beside Inbox at substack.com and in Substack’s mobile apps. Unlike an Inbox post, a Notes post does not get sent to subscribers by email.Notes also marks the next step in our efforts to build our subscription network—one that puts writers and readers in charge, rewards great work with money, and protects the free press and free speech. This work is at the core of the Substack model, and we believe it will be an important part of a new economic engine for culture. But what you see today is just the beginning. Notes is a long-term project, and success will ultimately be determined by the trust expressed by writers and readers over the course of years. We do not take that trust for granted. This release is an early version of the product that we have been testing with a small group of writers in recent weeks. We expect it to have bumps, bugs, and imperfections, and for it to evolve rapidly in response to feedback. If you have ideas, please let us know—preferably in Notes! We think that Notes can become a powerful driver of subscriptions. Historically, having worthy posts get shared widely is one of the major ways that writers find growth on Substack. Notes will help posts find a valuable audience of writers and readers who are already invested in the Substack ecosystem and are just one click away from a subscription. How to publish your first noteHere’s how to get started with Notes:Visit the Notes tab. Head to substack.com/notes or visit the new Notes tab in the Substack app.Post your first note. Say hello to your fellow writers and subscribers, or share an excellent piece of writing. Your notes can contain simple text or much more, including images, rich text, links, and @mentions.Invite subscribers to join the conversation. After you send your first note, you will see a template to announce to your subscribers that you are using Notes. Send them an email or share a link to any of your notes on social media to get the word out.If you’re looking for a way to get started, jump into our roll call.How writers and creators are using NotesHere are a few examples from the writers, illustrators, journalists, comics creators, and more who helped us build Notes:Recommend another writer’s work. Share posts, quotes, comments, images, and links. Be sure to @mention the writers when recommending their work. Loading...Share commentary and inspiration. A note might be something you believe other writers and readers in the Substack network would enjoy but that you don’t want to send out via an email.Loading...“Restack” a quote. Shine a spotlight on the exceptional writing and ideas you encounter on Substack, down to your favorite excerpts. (You can restack any post or quote that’s on Substack.) Loading...Share a behind-the-scenes look. Notes can include up to six photos or GIFs. You can include images in both notes and replies.Loading...How to navigate NotesHead to substack.com/notes on the web or visit the new Notes tab in the Substack app. In Notes you will see two tabs: “Home” and “Subscribed.”The Subscribed tab shows notes and activity from writers you have subscribed to directly.The Home tab shows notes from writers you are subscribed to and writers they recommend, making up your extended network.What writers are sayingLoading...Loading...Loading... Have questions about how Notes works? Head to the Help Center or visit our Note FAQ.CommentShareShare this postNow live for all: Substack Noteson.substack.comCopy linkTwitterFacebookEmailPreviousShare this postNow live for all: Substack Noteson.substack.comCopy linkTwitterFacebookEmail211 CommentsTopNewCommunityNo postsReady for more?Subscribe© 2023 SubstackPrivacy ∙ Terms ∙ Collection notice Start WritingGet the appSubstack is the home for great writing    This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
    "summary": "Substack has launched 'Notes' to all users, a new space where writers and creators can publish short-form posts and share ideas, and it will help work travel through the Substack network for new readers to discover. Notes, which is a long-term project, will also help drive subscriptions as worthy posts get shared widely, and this will help posts find a valuable audience of writers and readers who are already invested in the Substack ecosystem and are just one click away from a subscription. However, a Notes post does not get sent to subscribers by email.",
    "hn_title": "Substack Notes Launched",
    "original_title": "Substack Notes Launched",
    "score": 500,
    "hn_content": "Substack Notes have launched, leading to speculation about whether it will compete with Twitter's product. Some users see this as an opportunity for Substack to compete with Twitter, while others believe Twitter is not dying. Thought leaders in various fields are still active on Twitter, but many are double posting on both Twitter and Mastodon. The tech landscape is changing, and Google's AI, Twitter, and Facebook all face challenges. Users have discussed similarities between Kodak's failed transition toward digital cameras and Google's unwillingness to adjust to change. Some users are wishing for Twitter's failure due to ongoing dissatisfaction with the platform, while others believe that too much focus on Twitter is unrealistic.Users on Hacker News discuss their preferences for search engines, with some noting issues with DuckDuckGo and Google while recommending Kagi as a viable alternative. Other comments touch on the usability of Edge, the annoyance of Bing chat, and the potential downfall of Google's search dominance. There is mention of AI-assisted search as a possible disruptor, while some users express skepticism about the longevity of Google's market power.Legacy companies like Microsoft and IBM have missed the boat on new technology arrivals despite having profitable businesses, and current tech giants like Twitter may soon face disruption as they become ossified and slow. Facebook's business remains robust despite its missteps, and its Messenger service has replaced services like Skype for many people. Discord is gaining popularity over Twitter in certain circles, while Elon Musk has been accused of using the term \"free speech\" in bad faith when criticizing Twitter. Mastodon's potential to grow may be limited due to UI stumbling blocks and poor discoverability. The question of whether Twitter can be replicated is a moot point as the conditions under which it initially flourished no longer exist.The enduring popularity of Twitter is due to its variety of voices, though financial sustainability remains uncertain. Facebook's group features are well-liked, but many dislike the platform itself. Mastodon offers a less addictive alternative to Twitter's constant outrage culture. Twitter power-users are increasingly shifting to Mastodon, but discoverability is harder. Twitter's technical issues and advertising overload have caused high-quality accounts to interact less. Musk's attitude towards hate speech and refusal to address systemic injustices aligns him with a racist, sexist, and transphobic faction of society. The Verfication system was a key feature of Twitter that attracted high-profile users, but killing it has driven out the blue checks who generated substantial traffic for the site.The article discusses the tension between anti-\"woke\" politics and systemic injustices in American society. Some comments focus on Twitter and its recent changes due to Elon Musk's involvement. While some users have left Twitter, others have found it more authentic and less manipulative. Users have also debated Musk's political views and their impact on the platform. An HN user points out a definition of \"woke\" as \"the belief there are systemic injustices in American society and the need to address them.\" However, there is some debate over whether this is an accurate definition. Despite controversies, Twitter continues to be a significant social media platform.Comments on HN regarding Twitter's new subscription service, Twitter Blue, include complaints about continued ad exposure despite paying for the service, differing opinions on the value of additional verification markers for businesses, and speculation regarding Twitter's future business model given recent struggles with profitability. One commenter criticized Elon Musk's management of Twitter while others debated the wisdom of his purchase of the site, while still others discussed possible reasons for Substack's recent growth and fundraising efforts. Despite differing opinions, many comments express concern over monetizing social media and the potential impact on user experience.Crowdsourcing fundraising is becoming a new way for startups to avoid the \"down round\" game with VCs. This is because once a company enters this game, they are stuck in it, \"having to keep fundraising to keep fueling the growth.\" Early stage VCs these days, unlike before, don't pressure founders for quick growth. A way to pivot to a new advertising based business model is by introducing features that encourage more engagement like Substack's new \"notes\" feature. Twitter has been completely worthless for promoting Substack channels, with word of mouth and SEO proving to be more effective. Different social media sites like Reddit and StackExchange are now censoring and making it difficult for self-promotion. Mastodon is better, but slow.Many high profile individuals, such as Neil Gaiman, created Mastodon accounts, suggesting a potential alternative to Twitter. However, there is no conclusive evidence of a \"mass exodus\" from Twitter, and it is suggested that the hype created by the news was overstated. There is a growing number of accounts syndicating to Mastodon, but it remains a small fraction of Twitter's user base. Meanwhile, Substack has added a \"Notes\" feature that allows users to post shorter content, potentially turning it into a Twitter-like platform. However, it remains to be seen if this move will attract users or potentially cannibalize Substack's own audience for long-form content.An HN user points out that there is an option to subscribe to notes without newsletters on desktop via Substack's three-dot menu. However, the UX is suboptimal. The post mentions that applications for YC Summer 2023 are open, with relevant links provided.",
    "hn_summary": "Substack has launched a new \"Notes\" feature, leading to discussions about whether it will compete with Twitter. Users have expressed varying opinions over Twitter's continued importance and the rise of Mastodon as an alternative. Crowdsourcing fundraising and new features, such as Substack's Notes, have become ways for startups to pivot to new business models. Monetizing social media, through methods such as Twitter's new subscription service \"Twitter Blue,\" has raised concerns for some users. Additionally, Substack's Notes feature may cannibalize its own long-form content audience."
  },
  {
    "id": 35521704,
    "timestamp": 1681195802,
    "title": "We're building a browser when it's supposed to be impossible",
    "url": "https://awesomekling.substack.com/p/how-were-building-a-browser-when",
    "hn_url": "http://news.ycombinator.com/item?id=35521704",
    "content": "How we're building a browser when it's supposed to be impossibleAndreas KlingSubscribeSign inShare this postHow we're building a browser when it's supposed to be impossibleawesomekling.substack.comCopy linkTwitterFacebookEmailHow we're building a browser when it's supposed to be impossibleAndreas KlingApr 11, 2023213ShareShare this postHow we're building a browser when it's supposed to be impossibleawesomekling.substack.comCopy linkTwitterFacebookEmail“How is the SerenityOS team making such good progress on building their Ladybird browser, when we've heard for years that it’s impossible”?I've seen this question a few times on sites like Hacker News and Reddit, and I thought I’d offer my own personal take on it.Thanks for reading Andreas Kling! Subscribe for free to receive new posts and support my work.SubscribeFrom my perspective, it comes down to five main things:Stronger web specificationsFocus on vertical slicesDeferring on performance workTeam cultureHaving an experienced leaderStronger web specificationsWe’ve come a long way from the wishy-washy days of HTML4 and CSS2.1.The ECMAScript, HTML, and CSS specifications today are (for the most part) stellar technical documents whose algorithms can be implemented with considerably less effort and guesswork than in the past.The architecture of Ladybird tries really hard to match the architecture described in the various web specifications. This makes it significantly easier for new developers to get oriented, as they only have to learn one architecture instead of two.There are still gaps though, and some features are less specified than others. Thankfully there’s an active community of editors at the W3C working on improvements. A fair amount of the work we do on Ladybird involves adapting our codebase to updates made by these spec editors.We try to do our part in improving the specs as well: the Ladybird developers often report spec bugs, and sometimes make PRs to improve specs directly. Not to mention that implementing a spec in a novel browser engine provides great validation that the spec is actually complete.Focus on vertical slicesWhile the specs today are indeed better than ever before, it’s still the case that many features span multiple specs, often with subtle interactions between subsystems that must be understood by an implementer.If you tried to build a browser one spec at a time, or even one feature at a time, you’d most likely run out of steam and lose interest altogether. So instead of that, we tend to focus on building “vertical slices” of functionality. This means setting practical, cross-cutting goals, such as “let’s get twitter.com/awesomekling to load”, “let’s get login working on discord.com”, and other similar objectives.Working on a vertical slice helps maintain momentum and it's highly motivating to see tangible improvement on real live websites as they progress.This approach is in part possible because the web itself is designed around graceful degradation, meaning that browsers can render web content while only supporting some of the features used by the site.You might think this approach would produce a small collection of “compatible websites” and a vast desert of non-working things, but what really happens is that the rising tide lifts all boats, and as we focus on improving one website, thousands of other sites improve as well!Deferring on performance workWe're currently not putting much effort into optimizing Ladybird for performance. Instead, our primary focus is on addressing issues related to correctness and compatibility. This approach helps us stay focused on making sure the browser works as intended before diving into optimizations.It's not that we don't care about performance. We want our browser to be fast and responsive eventually. It's a matter of making a disciplined choice to not spend too much time optimizing a product that doesn't work correctly yet. For example, while we might identify areas where we could potentially optimize JavaScript execution or rendering speed, we consciously choose to prioritize fixing rendering bugs or compatibility issues with popular websites first.We do make exceptions for things that are unbearably slow. We don't want working on the browser to be unpleasant, after all. In such cases, we'll invest time in addressing the most significant performance bottlenecks to maintain a tolerable development experience.But we're not tracking benchmark scores and things like that at this stage. That day will come though, once we've achieved a solid foundation in terms of correctness and compatibility!Team cultureIn the time we’ve spent together working on this, a strong team culture has formed. The culture is highly optimistic and everyone has a “can do” attitude.Although the team is distributed around the world, we all meet on Discord to chat and spur each other on. People frequently collaborate and pitch in on each other’s projects.Everyone who works on Ladybird is encouraged to explore their own personal interests within the project. Most folks on the team had never looked at browser code before joining us, and they're quickly becoming world-class browser developers.Also, since Ladybird is an offshoot from the SerenityOS project, it shares the same culture of accountability and self-reliance. We avoid 3rd party dependencies and build everything ourselves. In part because it’s fun, but also because it creates total accountability for what goes into our software.Having an experienced leaderAn experienced leader can make a significant difference in a project like this. I've had the opportunity to work on production browsers for many years (at Apple and Nokia), which has given me a strong understanding of how browsers are put together.While other people may look at the huge stack of technologies and specifications that need to be combined to make a browser and feel overwhelmed, I’ve got a clear picture of how to put them together and make it work. We save a lot of time here by not worrying about whether it’s possible and just getting straight to the work instead!In more practical terms, what I really end up working on is often between the seams — parts of the browser that are less rigidly specified (e.g layout & rendering). Those parts can be much harder for less experienced browser developers to engage with.ConclusionAlthough I don’t believe our exact way of working is directly transferable to other software projects (unless they are also browsers), with a small team of smart, focused individuals and a knowledgeable leader to guide them, you can build any software you want.Thanks for reading Andreas Kling! Subscribe for free to receive new posts and support my work.Subscribe3Share this postHow we're building a browser when it's supposed to be impossibleawesomekling.substack.comCopy linkTwitterFacebookEmail3 CommentsMilan RajWrites Milan’s Substack 7 hr agoCurious why not build / take on the mantle of a project like Servo?Expand full commentReplyHexcles9 hr agoCheck out https://web-platform-tests.org/, too. To run the suite automatically you'd need to implement WebDriver first, but you can still run most tests manually.Expand full commentReply1 reply1 more comment…TopNewCommunityNo postsReady for more?Subscribe© 2023 Andreas KlingPrivacy ∙ Terms ∙ Collection notice Start WritingGet the appSubstack is the home for great writing    This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
    "summary": "Andreas Kling discusses the process of building the Ladybird browser, which has made significant progress despite being considered an impossible task. The team's success is attributed to factors such as stronger web specifications, focusing on vertical slices, deferring on performance work, having a strong team culture, and being guided by an experienced leader.",
    "hn_title": "We're building a browser when it's supposed to be impossible",
    "original_title": "We're building a browser when it's supposed to be impossible",
    "score": 479,
    "hn_content": "A team has taken on the impossible task of building a web browser using a unique development strategy that focuses on creating “vertical slices” of functionality, rather than building based on features or specifications. They target cross-cutting goals, such as getting specific websites to load, as a way to prioritize development. This approach has comparisons with the Wine emulator and console emulators, which work to solve issues one game (or program) at a time, instead of implementing a list of API functions to fix. The challenge with this approach on the web, compared to Wine, is that even after you get a website functioning well, a minor redesign can cause everything to again stop working as expected.A post on Hacker News discusses a vertical slice approach to creating a new browser, which involves implementing only the essential features necessary for practical use cases instead of the entire API. Some comments question the approach and its efficacy, while others mention similar methods used in game development. There is debate over the accuracy of the article's claim regarding the number of specs from the W3C, and the discussion delves into the challenges of navigating a large volume of information to implement a system.An HN user points out that the length of specs is not necessarily an indication of technical intractability of implementation. The value of verbosity in a standard depends on whether it defines well-defined behavior or leaves gaps of undefined behavior. The length of an HTML-based standard including its reference standards may be non-trivial, but this is not necessarily an issue for implementing a modern web browser. WebGL may not be a significant part of current standards, and may not be necessary for implementing a functional and modern web browser. The HTML, ECMAScript, and CSS specifications are fully spelled out and largely mechanical, making it easier to implement;the HTML parsing algorithm is a good example of this.The complexity of creating a new browser lies in the rendering engine, with most frameworks being quite similar. However, the current HTML and CSS specs, while exhaustive, do not necessarily reflect actual implementation. The difficulty lies in the interactions between different parts of the code, as seen, for instance, in the complexities created by position: sticky in CSS, which results in issues with flexboxes, z-index, and negative margins. Even Servo, Mozilla's project to create a new rendering engine, had its challenges because of its under-documented components. Creating a new state-of-the-art browser to rival Chrome, Firefox or Safari may take more than a decade, given the complexity of their rendering engines.SerenityOS has built a browser using C++ and Qt, and HN users discuss various aspects such as the choice of programming language, the selection of GUI framework, the possibility of embedding the browser, and the license of the project. Some comments also mention the use of a memory-safe language being developed for SerenityOS. While the project is seen as interesting due to its use of C++ and Qt, some express concern over the use of an unsafe language for a web browser. There is also discussion of the need for a C API version of the browser for embedding purposes. Finally, HN users note that this project represents a new browser engine being developed from scratch, rather than simply rebranding an existing one.Building a web browser engine is challenging due to the numerous specifications, multiple versions of each specification, and the need to support broken websites, in addition to the graphical output being harder to unit test. However, some volunteer C++ projects have done excellent memory management, and bypassed memory management issues by using modern C++ features and error return types instead of null. Ada and some lesser-used languages have well-supported formal verification methods to reduce crashes, but few mainstream languages do. While the specs have improved, there's still a lot of invalid HTML on the web, and building a web browser is an ambitious project.Building a browser engine is incredibly difficult due to ever-shifting web standards and browser requirements. Features such as CSS, HTML, and JS are constantly changing, making it difficult to keep up. While building a new JS engine from scratch may be feasible, implementing it into a fully functioning browser is a much larger undertaking. Implementing specs to the pixel level can cause issues when pixels shift from version to version requiring golden data to be rebased. The most important thing is to understand the challenge of building a new browser engine is less about features and more about performance.Ladybird, an open-source browser engine, is being developed with a focus on vertical slices for now, deferring performance work. Building a new browser engine is not unlike creating an OS or compiler, and despite many competitors having their own browsers, many people are discouraged from building a web browser engine. Navigating \"long tail\" web compatibility issues and making complex projects more accessible could be achieved by librifying web browser engines. Andreas Kling, the leader of Ladybird's team, worked at Apple and Nokia, where he worked on browser engine performance, and implementing the W3C specs is Ladybird's primary goal. One potential use case of Ladybird is as a contenteditable polyfill.An HN user noted that Google Docs now uses canvas to render everything. Another HN user suggested that creating a graphical word processor with web technology is infeasible compared to creating a desktop app with its GUI toolkit. The debate on creating apps on a browser continued with some suggesting it's a terrible application platform, while others argue that it is one of the best application platforms for both users and developers due to its wide reach. Additionally, a user shared their excitement for Language Models and the possibility of creating new products. Lastly, building a browser is attainable, but the real challenge lies in creating a better one with a more sophisticated UX.",
    "hn_summary": "HN users discuss the challenges of creating a browser using the \"vertical slice\" approach, which focuses on creating essential features for practical use cases instead of the entire API. While some express concern over its efficacy, others mention the success of similar methods in game development. There is also debate over the accuracy of the article's claim regarding the number of W3C specs and the complex interactions between different parts of code, rendering engines, and supporting broken websites when building a web browser."
  },
  {
    "id": 35526846,
    "timestamp": 1681228120,
    "title": "SQL Maxis: Why We Ditched RabbitMQ & Replaced It with a Postgres Queue",
    "url": "https://www.prequel.co/blog/sql-maxis-why-we-ditched-rabbitmq-and-replaced-it-with-a-postgres-queue",
    "hn_url": "http://news.ycombinator.com/item?id=35526846",
    "content": "SQL Maxis: Why We Ditched RabbitMQ And Replaced It With A Postgres QueueProductsExportSync data to your customer's data warehouse.IMPORTIngest data from your customer's data warehouse.SECURITYDOCUMENTATIONBlogBOOKÂ AÂ DEMOLOGINEngineeringSQL Maxis: Why We Ditched RabbitMQ And Replaced It With A Postgres QueueEmbracing our SQL Maxi nature: how we ripped out RabbitMQ from our infrastructure and replaced it with a Postgres queue.6 minsApril 11, 2023Charles ChretienCo-FounderShare on social mediaWe recently ripped out RabbitMQ from our system and replaced it with a queue built on top of our Postgres db and written in SQL. The change took half a day to implement + test, and had a net delta of -580 LOC. Much more importantly, it drastically improved the reliability and resiliency of our system. This is a writeup of that change, the rationale behind it, and how we did it.Note: this is not an indictment against RabbitMQ or other queuing systems. Itâ\u0080\u0099s quite possible (likely, really) that we were holding it wrong. If anything, itâ\u0080\u0099s a push to keep things simple. And, of course, a very biased reminder that SQL is unbelievably powerful. In fact, it often really is all you need. Do we dream of a world where everything is SQL? Maybe.Some useful contextLetâ\u0080\u0099s talk briefly about why we needed a queue in the first place. Prequel is a large-scale data pipeline: we help B2B SaaS companies sync data to or from their customerâ\u0080\u0099s database. In other words, our business consists of running data transfers between various dbs and warehouses. Each of these transfers can be modeled as a job, which is put into a queue and processed by workers. One idiosyncrasy of these jobs is that they can be fairly long to process: itâ\u0080\u0099s not unheard of for a data backfill to take several hours, and the fastest jobs take at least a few seconds. To make all of this run smoothly, we enqueue and dequeue thousands of jobs every day.â\u0080\u008dRabbitMQ: good enough to startWhen we initially designed our system, we settled on RabbitMQ as the right queuing solution for the job. It was widely adopted, based on an even more widely adopted protocol (AMQP), seemed mature and production-grade, and looked easy enough to add to our Helm chart. We wrote our own GoLang wrapper around an existing client, didnâ\u0080\u0099t think about it twice, and shipped it.Our setup was fairly straightforward. We configured it such that any message could only be processed by one consumer: this allowed us to avoid having different workers running the same transfer, which would be a waste of everyoneâ\u0080\u0099s compute. We also set it up such that consumers would â\u0080\u009cmanuallyâ\u0080\u009d ACK messages. We tried to keep everything as lightweight as possible, and it worked well for us for a while.â\u0080\u008dIssues started popping upWe started experiencing issues and challenges a few months in. We spent a lot of time tweaking our consumer reconnection behavior, aka what happens if somehow one of the workers loses its connection to the queue. We had a handful of multi-threading bugs where a consumer timing out from the queue would cause it to reconnect twice, effectively growing the number of queue threads exponentially. This led to some fun memory utilization graphs. We dealt with those and moved on.Until one fateful evening, when we got paged by a customer. They were seeing some of their transfers arbitrarily delayed by up to a few hours, sometimes so much so that our system would mark them as stale and cancel them. There wasnâ\u0080\u0099t any good explanation for this: our queue wasnâ\u0080\u0099t showing any major backlogs, our workers looked healthy, and the majority of jobs were being processed just fine. Except for those occasional, seemingly non-deterministic stragglers. Of course, that didnâ\u0080\u0099t make for a very satisfying answer for our customers: â\u0080\u009csorry, we know a handful of your transfers are delayed by a matter of hours, but our system looks healthy so Â¯\\_(ã\u0083\u0084)_/Â¯â\u0080\u009d.After _hours_ of investigating and a bunch of banging our heads against our desks, we managed to root-cause the issue. Turns out each RabbitMQ consumer was prefetching the next message (job) when it picked up the current one. This prevented other consumers from acking the message, and thus from picking it up from the queue. See RabbitMQ documentation on this here.Now, this is fine when most jobs take a roughly even and well-bounded amount of time. Where things get dicey is when some jobs can take hours (remember, weâ\u0080\u0099re talking about data transfers here). What was happening in our case was: a worker would pick up a message, and prefetch the next one. It would process the current message, a multi-hour transfer, and hold the next one effectively hostage until it had completed the one it was chewing on.Even worse, there was no way (that we could find) to disable the behavior. You could set the prefetch count to 1, which meant every worker will prefetch at most 1 message. Or you could set it to 0, which meant they will each prefetch an infinite number of messages. But there was seemingly no way to _actually_ set the prefetch count to zero (ie disable prefetching).â\u0080\u008dEarning our stripes as SQL maxisWe had a good grasp on what was happening, but we had no immediate way of fixing it. This was causing issues for production customers, so waiting it out wasnâ\u0080\u0099t an option. We couldnâ\u0080\u0099t figure out how to make the queue behave in the way that we wanted it to. We also couldnâ\u0080\u0099t just rip out the queue entirely. Or could weâ\u0080¦It turns out that we could actually recreate the same queue functionality in our Postgres database, but tweak it to match our exact requirements. Better yet, that implementation would be _way_ simpler and fully modifiable in the future if our requirements changed in any way.So thatâ\u0080\u0099s what we built: a new queue backed by a single, and surprisingly simple, Postgres table. Our publishers write to it. Our consumers (workers) read from it. We maintain things like queue ordering by adding an ORDER BY clause in the query that consumers use to read from it (groundbreaking, we know). And we guarantee that jobs wonâ\u0080\u0099t be picked up by more than one worker through simple read/write row-level locks. The new system is actually kind of absurdly simple when you look at it. And thatâ\u0080\u0099s a good thing. Itâ\u0080\u0099s also behaved flawlessly so far.It comes with several, significant upsides for our team. For one, the application state is no longer spread out over two systems (RabbitMQ storage and Postgres). Itâ\u0080\u0099s now centralized in our application database. This makes disaster recovery that much easier, and increases the resiliency of the overall system by removing moving pieces.Better yet, we all understand this queuing system _really_ well since we wrote it and are all fluent in SQL. This allows us to tweak it if we need to update its behavior, and makes monitoring and debugging easier. We already have plenty of tooling set up to deal with Postgres, and we donâ\u0080\u0099t need to remember how to set up this one different piece of infra like we did with RabbitMQ. That may not sound like much, but the delta in time and complexity makes a world of difference during an outage.One of our team members has gotten into the habit of pointing out that â\u0080\u009cyou can do this in Postgresâ\u0080\u009d whenever we do some kind of system design or talk about implementing a new feature. So much so that itâ\u0080\u0099s kind of become a meme at the company. But thereâ\u0080\u0099s a good reason for it: heâ\u0080\u0099s right. It turns out that, when your problem involves enforcing constraints on your data, you can do it in Postgres, and itâ\u0080\u0099s probably way simpler than the mountains of code you were going to write for it otherwise. Weâ\u0080\u0099re proud SQL maxis.â\u0080\u008dSign up to be notifiedwhen a new post comes out!We'll let you know when the next blog post comes out!Woopsie, something went wrong while submitting the form. We'll get right on it. In the meantime, can you please email us at hello@prequel.co instead?Most popularEngineeringSQL Maxis: Why We Ditched RabbitMQ And Replaced It With A Postgres QueueApr 11, 2023Â â\u0088\u0099Â 6 minsEngineeringDatabase Drivers: Naughty or Nice?Jan 18, 2023Â â\u0088\u0099Â 6 mins readProductBuilding Data Products: The Three Questions You Should Ask When Specâ\u0080\u0099ing Out A Data ProductDec 12, 2022Â â\u0088\u0099Â 7 mins readSecure data sharing, made easy.Thank you!Â Check your inbox soon for a note from us to schedule a demo.Woopsie, something went wrong while submitting the form. We'll get right on it. In the meantime, can you please email us at hello@prequel.co instead?INTEGRATIONSSNOWFLAKEBIGQUERYREDSHIFTDatabrickspostgresMysqlS3&Â moreRESOURCESTermsPrivacyLoginMade with ð\u009f\u0097½ in NYC",
    "summary": "Prequel introduced a new queue built on top of Postgres database, replacing RabbitMQ, which improved system reliability and resiliency, and centralizing the application state. Prequel provides a large-scale data pipeline that syncs data for its B2B SaaS customers, where each transfer can be modeled as a job, put into a queue, and processed by workers. The change took half a day to implement + test, and the new queue is simpler, easier to monitor, tweak if needed, and debug.",
    "hn_title": "SQL Maxis: Why We Ditched RabbitMQ and Replaced It with a Postgres Queue",
    "original_title": "SQL Maxis: Why We Ditched RabbitMQ and Replaced It with a Postgres Queue",
    "score": 404,
    "hn_content": "SQL Maxis replaced RabbitMQ with a Postgres queue due to a broken consumer library and configuration. The underlying issue was fixed when they rewrote the message fetching code for Postgres. They suggested using different queues based on job duration and adding a dead letter queue for both long and short jobs. Using Postgres for low-volume jobs was considered valid, but this setup might need reconsideration for higher volumes. Some users question whether RabbitMQ is a good fit for long-running jobs, with some suggesting using Postgres instead for easier job tracking and deletion. Overall, the company picked the right tool for their problem.Comments on a Hacker News article discuss the best tech for handling queue jobs at high volume. Some users express their preference for SQL tables, while others suggest using RabbitMQ or other queue management solutions. Suggestions include multiple queue solutions for optimizing job types, and sharing queues to avoid frustration. Some users also mention using SQLite or in-memory databases, and caution against benchmarking traffic by daily traffic volumes. Overall, the discussion highlights a range of options and considerations for efficient and versatile queue management.Users on Hacker News are discussing the use of Postgres as a queue, with some pointing out that it can handle millions of jobs per day as a queue. However, concerns are raised about queue size and disk throughput. Some users suggest using different queue infrastructures for different applications. One user mentions using SQLite and enabling the write-ahead log to maintain disk throughput, while another suggests using a \"transactional outbox\" pattern for processing incoming messages in-order. Overall, relying on Postgres as a queue may work for some applications, but carefully considering the design of the queue infrastructure is important.A discussion on Hacker News highlights the benefits of using Postgres as a message queue due to its transactional semantics and simplified database transactions. While some users argue that using messaging queues in databases is no different than using tables and row locks directly, others emphasize the importance of avoiding race conditions by utilizing decorators or transactional outbox patterns. Postgres is also touted as a solution for all types of data storage, eliminating the need for multiple resources for different use cases. However, caution is advised when using Postgres as a blob store.The use of PostgreSQL as an event queue or message broker is discussed on Hacker News, with some HN users pointing out the advantages of using a database as a queue and others suggesting that using an actual queue solution may be easier; the article recommends the use of PostgreSQL for queuing because it is a simpler solution and because PostgreSQL queues are easy to manage; according to the article, the use of PostgreSQL also allows the user to easily implement basic queue features, like prioritizing tasks or ensuring that only one worker picks up a task at a time. Discussion on the use of AMQP clients and Postgres for job queues among Hacker News (HN) users. Some users suggest alternative ways to avoid polling, such as using NOTIFY in Postgres or MongoDB's change event stream. Others mention their own experiences with creating message queues and recommend specific tools. There are also discussions about the pros and cons of using advisory locks compared to row locks in Postgres. One comment highlights a potential issue with hunting for more than the allocated memory space for locks in Postgres. Some comments contain sarcasm and criticism towards the original article's perceived exaggeration and mistake.Prequel shares their experience of replacing RabbitMQ with a Postgres queue for their job manager, highlighting the benefits of using a DB/SQL-backed queue for granular control and simplicity. They mention trade-offs and trade-offs in choosing technology for specific use cases and discuss resolving the contention issue by using SKIP LOCKED. Users share their own experiences with different queue systems such as Graphile Worker, Apache Pulsar, and AWS Batch. One user recommends thinking about horizontal scalability, and another notes the importance of listing exact needs when selecting a tool. There is a brief discussion about handling stale 'processing' jobs in a Postgres-backed queue.Developers can use a database as a queue by querying it for the next job, but should consider adding a queue when too many workers overload the database. While using a database as a queue is not recommended, it can allow for easy prioritization, canceling and dynamic controls for queued jobs. A clear understanding of workload, SQL, and database is crucial when implementing a queue in Postgres. It is essential to consider short leases to scale the number of database connections and garbage pages while processing data. Developers should not be quick to dismiss fundamentals while choosing between resources like RabbitMQ and Postgres. It is crucial to be observant while using message processing systems and to understand that RabbitMQ issues may not stem from the tool itself. Using Postgres stored procedures can achieve various functions, but it may not always be the best paradigm to follow.",
    "hn_summary": "SQL Maxis replaced RabbitMQ with a Postgres queue due to a broken consumer library, and suggested using different queues based on job duration and adding a dead letter queue; some users questioned the use of RabbitMQ for long-running jobs. The discussion on Hacker News highlighted the use of Postgres as a queue, with some pointing out potential concerns about queue size and disk throughput, but highlighting the benefits of transactional semantics; users also discussed the use of other queue management solutions, such as SQLite and in-memory databases, cautioning against benchmarking traffic by daily volumes."
  },
  {
    "id": 35523859,
    "timestamp": 1681214289,
    "title": "Anthropic's $5B, 4-year plan to take on OpenAI",
    "url": "https://techcrunch.com/2023/04/06/anthropics-5b-4-year-plan-to-take-on-openai/",
    "hn_url": "http://news.ycombinator.com/item?id=35523859",
    "content": "TechCrunchTechCrunchWe'll be right back...Our engineers are working quickly to resolve the issue.Thank you for your patience.",
    "summary": "Sorry, the text provided does not contain any information relevant to the task given. Can you please provide the correct text?",
    "hn_title": "Anthropic’s $5B, 4-year plan to take on OpenAI",
    "original_title": "Anthropic’s $5B, 4-year plan to take on OpenAI",
    "score": 360,
    "hn_content": "Anthropic has announced a four-year plan to take on OpenAI in a $5 billion investment. The plan aims to build impactful technology that goes beyond just the research level. Apple's future Mx chip with a more capable Neural Engine and greater RAM is expected to run the largest GPT3 class models locally, with better developer tools for targeted neural engine (NE) compilers. Trust and privacy concerns are noted, as cloud solutions require trusting third parties with data, while local models will require more than privacy to move locally. Latency, flexibility, and cost are more likely extending factors. There is an incentive to change LLMs off research quality to mass-market quality.Experts on Hacker News are discussing the idea of locally running language models (LLMs) like ChatGPT instead of relying on hosted models, but some users express doubts about its feasibility for common use cases. One user suggests that the buzz around llama.cpp indicates a desire for large LLMs to be available outside of a subscription model. Users debate whether an iPhone or a high-end MacBook would be better suited for running LLMs locally, but others note that LLMs are primarily intended for large-scale usage and unlikely to become a commodity. However, some believe that Apple's unified memory model on the M1/M2 ARM chips make them well-suited for AI applications.Apple has released libraries for using its Neural Engine in CoreML, and a library to use Apple Silicon for training via PyTorch. The size of models loaded on the Neural Engine is limited and has to run on CPU when it exceeds this limit. However, full memory usage could significantly enhance the speed and reduce the computational power required for huge models such as GPT-3. Apple's move to make stable diffusion run well on the iPhone implies they might be waiting for open models before committing to any. Siri was launched with a server-based approach, so Apple could use a small LLM on local chips/MacOS and a large model running in the cloud. Dario Amodei split from OpenAI and founded Anthropic, a public benefit corporation. Anthropic was heavily focused on research for the first year and a half of its existence, but it fully committed to commercialization in September 2022 after developing a strategy for go-to-market and initial product specialization. They have plans for a billion-dollar investment in training their next Claude version.Anthropic's trademark and domain name history is creating confusion regarding their relationship with Google-supported OpenAI. Some users speculate about the challenges of non-profit commercialization, while others note the potential for AI systems to violate censorship rules. The discussion leads to a debate about the necessity of private payment processors and credit card companies, and whether blockchain or other modern solutions could replace them. However, most companies choose the current system, which is familiar and easy to use, and they prioritize fast payments over buyer protection or credit offers. In the end, there is some support for crypto as an anti-censorship currency, but its workability is questioned, and it still has fees and off-ramps.A discussion on payments systems, cryptocurrency, and regulations took place on Hacker News. While one user discussed the potential success of programmable money, others shared insights on existing payment systems like Unified Payments Interface and GiroPay. The conversation also touched on the regulation of payment processors and the reputational concerns of companies in relation to adult content. The thread also dove into topics around capitalism and greed, with some questioning why banks and credit card companies refuse to process sex-related transactions if there's an obvious profit center to explore. In conclusion, the discussion covered a wide range of topics surrounding payments and regulation.Visa and MasterCard control more than 75% of the US market, making having access to a debit/credit card crucial for participation in modern life. However, legislating obedience is not the solution to their control over the market, and regulators' partnerships with big businesses may not lead to improvement. Despite the potential for companies to take control away from them with a few clicks, there are limitations to taking all payments in cryptocurrencies. Meanwhile, the usage of crypto for server/domain purchases is relatively easy. Notably, the market for chatbots driven by NSFW generative AI is rapidly developing, but debates abound over the potential creation of illegal content and the liability faced by providers of such a service. Lastly, skeptical comments have been raised about the efficacy of measuring oneself against the leading edge of today.Anthropic, a startup focused on creating artificial general intelligence (AGI) systems, received $124 million in Series B funding from investors including Google and former Google CEO Eric Schmidt. However, some commentators argue that Anthropic faces steep competition from other companies, particularly OpenAI. The future of the AGI market remains uncertain, with differing opinions on the potential size and impact of the market. While the market may be dominated by a few players, there is still room for smaller companies to capture market share in the long tail.Experts debate the likelihood of AI displacing human jobs and the potential benefits it could bring to the economy. The future of the moats surrounding large language models is uncertain, and smaller players may eventually be forced out of the market or need to find a specific niche. Open-source models are becoming increasingly popular, but their B2B use cases remain doubtful. LLM prices might hit rock bottom as smaller firms and investors try to use uncensored models to their advantage, and AI becomes a commodity. Companies are yet to realize how important uncensored models can be when it comes to medical and finance applications. Finally, the discussion of whether AI is indeed a pyramid scheme is yet to be resolved.The comments are focused on the potential profitability of foundational models in AI and whether investing in them is worth the risk. Some argue that even if the models themselves do not generate substantial revenue, having top talent working on them is valuable. Others point out that investing in the models may be like a pyramid scheme where early investors profit from latecomers pouring money in. There is also discussion on the potential emergence of new AI techniques in the future and whether open-core approaches or proprietary models will be the winners. The article notes that investing in AI is still a high-risk endeavor and that the comments showcase a range of opinions on the matter.No summary provided.",
    "hn_summary": "Anthropic plans to spend $5 billion over four years to take on OpenAI in developing impactful technology. Discussions on Hacker News focus on the feasibility of locally running language models, with doubts expressed about common use cases. Apple is releasing libraries to use its Neural Engine in CoreML, but trust and privacy concerns remain. Other digressions include discussions on the cryptocurrency market, payments and regulations, and the potential profitability of foundational models in AI."
  },
  {
    "id": 35519706,
    "timestamp": 1681177736,
    "title": "Sponsor the open source projects you depend on",
    "url": "https://thanks.dev/home",
    "hn_url": "http://news.ycombinator.com/item?id=35519706",
    "content": "thanks.dev â\u0080\u0093 open source funding platformYou need to enable JavaScript to access thanks.dev.",
    "summary": "'Thanks.dev' is an open source funding platform.",
    "hn_title": "Sponsor the open source projects you depend on",
    "original_title": "Sponsor the open source projects you depend on",
    "score": 333,
    "hn_content": "Thanks.dev allows users to sponsor the open source projects they depend on, however, the imposition of a 5% minimum tip has left some dissatisfied, with users pointing out that this makes their system for-profit. The developers have clarified that this minimum fee is to cover operating costs, and they encourage more transparency by calling it a fee. Users have suggested implementing a 5% or X dollars minimum to avoid forcing a 5% minimum for all payments, and have asked for the ability to manually add projects to the system. Nevertheless, developers have defended their position and their innovative platform has gained traction as a way to support open source.Comments on Hacker News discuss the issue of open-source project funding, particularly how donations often aren't enough to cover expenses due to fees charged by payment processors. Some suggest that platforms like Stripe could help by waiving fees for donations, but others argue that someone has to cover those costs. Some commenters advise individual donors to use methods like SEPA IBAN transfers or to set up monthly donations, while others suggest taking a tip jar-style approach or using sliders to let donors choose how their money is spent. Some note that many open-source projects aren't funded at all, with affiliate income often proving more lucrative than donations.Thanks.dev is a new platform for open source project funding, where GitHub dependencies are scanned, and donations are split among them. The platform allows users to adjust the donation amount for each dependency, and has a recommendation system based on usage. Despite concerns around the 5% flat fee for safety and maintenance reasons, users are positive about the platform's impact on motivating maintainers and helping to streamline funding. The platform also offers a \"boosting\" option to reward maintainers indirectly contributing to their GitHub accounts, and tools to promote funding for non-code tools. Overall, thanks.dev offers a new way to contribute to the ecosystem without leaving a tangential impact for maintaining and organizing crowdsourced funding.A new platform called 'Thanks!' automates the process of finding open source software and dependencies for donating money and sponsoring. It aims to fund developers who contribute to often-overlooked dependencies and help sustain their work. The project plans to open-source the code, and currently accepts contributions via GitHub sponsors and PayPal. However, many HN users shared concerns over the choice of middlemen and the need for invoices, and suggested using cryptocurrency or paid feature requests/support. Some users also pointed out the potential risks of transparency and accountability and mentioned existing similar services and platforms. Despite these reservations, the idea has been received positively, and many users showed an interest in contributing to the platform.Developers explain how open-source software (OSS) works and why it is not driven by money but rather by value creation, recognition, and personal satisfaction. HN users discuss funding approaches for OSS, including thanks.dev, which facilitates trickling funds down to dependencies, and NimbusWS, which suggests contributing a small percentage of revenue back to F/OSS projects. However, concerns arise regarding the security of tools like thanks.dev, which scans repositories for dependencies, and the effectiveness of funding approaches in encouraging more support. Some OSS developers argue the need for greater recognition and funding to incentivize contributions and maintenance.Thanks.dev is a new platform that calculates the weight of each dependency in your codebase and distributes monthly budgets accordingly to ensure deep nested dependencies are not neglected. Users can pick a contribution level, and the service automatically donates to their favorite projects. Many maintainers aren't non-profits, so they don't take donations, hence the use of the term \"sponsor\" is preferred. The platform distributes micro-payments up to three deep levels into the dependency tree, has the potential to increase competition and make ends meet, but users note concerns around full access to their repos. There are also initiatives by governments to invest in open-source projects.",
    "hn_summary": "Thanks.dev is a platform for sponsoring open source projects, but some users are dissatisfied with the 5% minimum fee, while others suggest alternative funding methods. Despite concerns, users appreciate the platform's impact on motivating maintainers and helping to streamline funding. Some HN users discuss the need for greater recognition and funding to incentivize contributions and maintenance for open-source software."
  },
  {
    "id": 35520044,
    "timestamp": 1681180383,
    "title": "The end of a myth: Distributed transactions can scale",
    "url": "http://muratbuffalo.blogspot.com/2023/04/the-end-of-myth-distributed.html",
    "hn_url": "http://news.ycombinator.com/item?id=35520044",
    "content": "A new paper presented at VLDB'17 presents NAM-DB, a scalable distributed database system that leverages remote direct memory access (RDMA) and a novel timestamp oracle to support snapshot isolation (SI) transactions. The paper offers an interesting approach to achieve scalability of distributed transactions by eliminating the CPU overhead of the TCP/IP stack with the use of one-way RDMA. The NAM architecture logically decouples compute and storage nodes and uses RDMA for communication between all nodes. Scalability results show that NAM-DB achieves linear scale-out for throughput while keeping a low latency, outperforming other RDMA-based systems such as FaRM. However, the global stall caused by memory server failures in the event of recovery is problematic for production use.A collection of papers and blog posts about Time, Clocks, and the Ordering of Events in a Distributed System, Virtual Time and Global States of Distributed Systems, and Practical uses of synchronized clocks in distributed systems were listed in chronological order. The Silo paper, a single-node multi-core in-memory database that avoids all centralized contention points, is impressive, achieving almost 700,000 transactions per second on a standard TPC-C workload mix on a 32-core machine, and garnered 445 citations in 10 years. Researchers from academia and industry recently released a state-of-the-union (SOTU) report on database research indicating the SOTU is strong and growing stronger thanks to cloud computing and machine learning. Amazon Aurora's design, covered by the Sigmod 17 and Sigmod 18 papers from the Aurora team, is also noteworthy, as it uses MySQL or PostgreSQL for the database instance at the top and decouples the storage to a multi-tenant scale-out storage service.",
    "summary": "A new paper presented at VLDB'17 introduces NAM-DB, a scalable distributed database system that uses remote direct memory access (RDMA) and a timestamp oracle for snapshot isolation (SI) transactions, achieving linear scale-out for throughput and low latency. However, the global stall caused by memory server failures in event of recovery is problematic for production use. Additionally, a recent state-of-the-union report on database research indicates strength and growth due to cloud computing and machine learning, and Amazon Aurora's design using MySQL or PostgreSQL and multi-tenant scale-out storage service is noteworthy.",
    "hn_title": "The end of a myth: Distributed transactions can scale",
    "original_title": "The end of a myth: Distributed transactions can scale",
    "score": 305,
    "hn_content": "The article discusses research proof-of-concept NAM-DB and its global stall problem in production, but it offers potential solutions using redundancy/quorums, though this brings challenges for consistency. An HN user points out MySQL Cluster which benchmarked 200m transactions/second using open-source, non-blocking 2-phase commit protocol. There may be slow adoption of distributed database designs due to limitations in cloud environments, and the atomic clock may be crucial for achieving global consistency. Distributed transactions are inherently latency-bound, rather than CPU or memory-bound, but RDMA may be tricky to program. The posted comments contain additional information on the topic, including where to find useful context graphics and repositories for further discussion.A multi-writer distributed database without partitions can be built by 'flipping some lock bits' and using cache-coherence messages, enabling round-robin messaging for any writer-compute-node. Further implementation of Atomicity, Consistency, Isolation, and Durability (ACID) could be possible. An HN user points out a better way to do this with a shared-nothing architecture. An article about GCP VMs with atomic clocks prompts discussion on time synchronization over unknown latencies, and whether physical clocks can be trusted for distributed systems. An HN user achieved accurate timestamps using NTP servers from their ISP. The implementation of reliability for an RDMA database raises concerns about node downtime and adversarial behavior. Finally, an HN user mentions implementing multiversion concurrency control.A question posed on Hacker News asks how to synchronize read and write timestamps in a database replica system that spans multiple machines while maintaining minimal latency, potentially requiring serialization of timestamps; RDMA and load balancers are offered as potential solutions. Some comments provide links to additional resources on similar systems built by PingCAP and Cassandra; others discuss concerns about the security and maturity of RDMA technology, and some criticize Mellanox leadership for their handling of the company's market growth. There is also brief mention of the use of Ethereum rollups to scale transactions.",
    "hn_summary": "The article discusses the global stall problem in distributed transactions and potential solutions using redundancy/quorums, but challenges for consistency exist. Slow adoption of distributed database designs and atomic clocks for achieving global consistency are mentioned. An HN user points out MySQL Cluster and a shared-nothing architecture. Other comments mention multiversion concurrency control and synchronization of timestamps in a distributed system."
  },
  {
    "id": 35525222,
    "timestamp": 1681221465,
    "title": "Supabase Edge Runtime: Self-Hosted Deno Functions",
    "url": "https://supabase.com/blog/edge-runtime-self-hosted-deno-functions",
    "hn_url": "http://news.ycombinator.com/item?id=35525222",
    "content": "Supabase Edge Runtime: Self-hosted Deno FunctionsOpen main menuProductDevelopersPricingBlogStar us on GitHubSign inStart your projectBackBlog postSupabase Edge Runtime: Self-hosted Deno Functions2023-04-11•10 minute readLakshan PereraEngineeringInian ParameshwaranEngineeringToday we’re open-sourcing Supabase Edge Runtime for self-hosting Deno Edge Functions.Edge Runtime is MIT licensed, written in Rust, and based on the latest Deno Runtime (1.32+). If you’ve been using the Supabase CLI to serve functions then you’re already one of our Beta testers (thanks!).Host your Edge Functions anywhereWe launched Supabase Edge Functions a little more than a year ago. We use Deno Deploy to host your edge functions globally across 30+ data centers, so your users get super fast responses. This setup works great for us! We didn’t have an easy solution for self-hosting Edge Functions. We’re releasing Edge Runtime to address this.One of our core principles is “Everything is portable”, meaning you should be able to take any part of the Supabase stack and host it yourself.Supabase Edge Runtime is a web server written in Rust that uses a custom Deno runtime. It can serve TypeScript, JavaScript, and WASM functions. All your existing Edge Functions run on Edge Runtime without changing a single line of code.Better local development experienceSelf-hosting is not the only benefit of Edge Runtime. It will improve the local development experience of Edge Functions.Serve all functionsSupabase CLI can now serve all local Edge Functions by running supabase functions serve. Previously, you could only serve a single Edge Function at a time. This was not a great experience for local development. Some of you even devised clever hacks to get around this limitation.When you run supabase functions serve, the CLI uses Edge Runtime to serve all functions. It supports JWT verification, import maps, and passing custom environment variables. It hot-reloads local changes, giving you a seamless development experience.Dev/Prod parityEdge Runtime improves Dev/Prod parity for Edge Functions. You may have encountered issues where an Edge Function works locally but fails when deployed. The main cause for this is Deno Deploy Runtime is more restrictive and only supports a subset of Deno APIs. Edge Runtime exposes the same APIs available in the Deno Deploy Runtime. This will help you spot issues faster while developing and avoid surprises when deploying.Enforcing memory/duration limitsAnother neat feature we built into Edge Runtime is the option to enforce limits on memory and wall-clock durations. Currently, we are setting them to sensible defaults (memory set to 150 MB and execution duration set to 60s). This will allow you to simulate your functions’ resource usage and handle the behavior if they run into the limits. Soon we will allow configuring these limits via CLI config so that you can match them with the real limits of the deployment platform.How to self-host Edge FunctionsWe have put together a demo on how to self-host edge functions on Fly.io (you can also use other providers like Digital Ocean or AWS).To try it yourself:Sign up for an Fly.io account and install flyctlClone the demo repository to your machineCopy your Edge Function into the ./functions directory in the demo repo.Update the Dockerfile to pull the latest edge-runtime image (check releases)Optionally edit ./functions/main/index.ts, adding any other request preprocessing logic (for example, you can enable JWT validation, handle CORS requests)Run fly launch to create a new app to serve your Edge FunctionsAccess your Edge Function by visiting:https://{your-app-name}.fly.dev/{your-function-name}View the logs for the Edge Runtime by visiting Fly.io’s Dashboard > Your App > Metrics. You can serve Edge Runtime from multiple regions by running fly regions add [REGION].Standing on the shoulders of DenoYou may wonder why we cannot use Deno Runtime to self-host functions. Isn’t it open-source and available as a Docker container?Deno Runtime, by default, includes a wide array of built-in APIs, making it easy to use for multiple use cases out of the box. However, this makes it difficult to use for serving web requests. You need the runtime embedded within a web server that can boot fast and, for security, has a more restricted API.However, Deno’s architecture makes it easy to extend its core capabilities and create a customized runtime to match our needs. Deno provides a Rust crate called deno_core, which abstracts the interactions with V8 JavaScript engine. Using deno_core we can create a JS context (known as a V8 Isolate). A V8 isolate has minimal overhead to boot up and a single process can host multiple V8 isolates. When you load a web page that contains scripts from multiple domains in a browser, each of them runs in a separate v8 isolate.Deno team has a detailed 2-part blog post on how to create a custom runtime.Edge Runtime implements an HTTP server (using hyper) that listens to incoming requests. When Edge Runtime is booted, it spins up a JS context (V8 isolate), which we call the Main Worker. Main Worker runs in a separate thread, executing the provided main module. When a new HTTP request is received, the Rust runtime will forward it to the Main Worker.You can write a main module to handle all incoming requests. This would look like a typical Deno Edge Function. The main difference is that it has access to a global object called “EdgeRuntime”.EdgeRuntime global provides methods to create and access UserWorkers. Main Worker can optionally delegate a request to a UserWorker to handle and respond.User Workers are separate JS contexts (V8 isolates) that can run a given Edge Function. They have a restricted API (for example, they don’t get access to the host machine’s environment variables). You can also control the memory and duration a User Worker can run.Here’s a simple implementation of a Main Worker that receives a request, then creates a User Worker and passes the handling of request to the worker.serve(async (req: Request) => { const memoryLimitMb = 150 const workerTimeoutMs = 1 * 60 * 1000 const noModuleCache = false const importMapPath = null const envVars = [  ['USER', 'foo'],  ['PASSWORD', 'BAR'], ] try {  const worker = await EdgeRuntime.userWorkers.create({   servicePath,   memoryLimitMb,   workerTimeoutMs,   noModuleCache,   importMapPath,   envVars,  })  return await worker.fetch(req) } catch (e) {  const error = { msg: e.toString() }  return new Response(JSON.stringify(error), {   status: 500,   headers: { 'Content-Type': 'application/json' },  }) }})What’s Next?Open-sourcing Edge Runtime is the first step of an exciting roadmap we have planned for Edge Functions. In the coming months, you will see tighter integrations with the rest of the Supabase ecosystem. Here are some sneak peeks at what is to come next.API Gateway to other Supabase servicesWe plan to use Edge Runtime as a replacement for Kong, acting as an API gateway to other Supabase services. This will not only simplify the self-hosting setup but also give you the option to do Request pre/post-processing using JavaScript.Here’s a simple example of re-routing a request to a different endpoint using Edge Runtime.serve(async (req) => { try {  if (req.url.endsWith('/rest/v1/old_table')) {   return await fetch('http://rest:3000/rest/v1/new_table', {    headers: req.headers,    method: req.method,    body: req.body,   })  } } catch (e) {  const error = { msg: e.toString() }  return new Response(JSON.stringify(error), {   status: 500,   headers: { 'Content-Type': 'application/json' },  }) }})Scheduled FunctionsSince Edge Runtime’s Main Worker runs in the background as long as the server is running, we can utilize it to run periodic tasks.For example, here’s a naive implementation of how it can be used to trigger a function every 2 minutes. In production, you need to account for server restarts and timer resetting.const interval = 2 * 60 * 1000 // 2 minutestry { const worker = await EdgeRuntime.userWorkers.create({  servicePath,  memoryLimitMb,  workerTimeoutMs,  noModuleCache,  importMapPath,  envVars, }) const req = new Request('http://localhost/scheduled-job') setInterval(() => worker.fetch(req), interval)} catch (e) { console.error(e)}Custom Global ObjectsAnother exciting thing about shipping a custom JavaScript runtime is that we can control the available global objects in the runtime. In previous examples, you may noticed we used EdgeRuntime without importing a specific module to our function, this was possible because we exposed it as a global object in the runtime.We can introduce a Supabase global object that can provide platform specific features. For example, similar to Deno.writeTextFile , we can expose a Supabase.writeTextFile which can directly write a file to Supabase Storage.We 💚 ContributionsWe are excited to build Edge Runtime in public and involve the Supabase community in the process. As an initial beta release, there are still bugs and performance quirks to be ironed out. Don’t shy away from trying it though.You can report any issues you encounter in repo’s GitHub issues. If you have ideas on how to make edge-runtime better, reach out via Twitter or Discord.More Launch Week 7Designing with AISupavisorOpen Source LoggingSelf-hosted Deno Edge FunctionsShare this articleNext postSupabase Logs: open source logging server10 April 2023launch-weekfunctionsOn this pageHost your Edge Functions anywhereBetter local development experienceHow to self-host Edge FunctionsStanding on the shoulders of DenoWhat’s Next?We 💚 ContributionsRelated articlesSupabase Edge Runtime: Self-hosted Deno FunctionsSupabase Logs: open source logging serverSupabase Beta March 2023The Supabase AI HackathonDesigning with AI: Generating unique artwork for every userView all postsShare this articleBuild in a weekend, scale to millionsStart your projectFooterTwitterGitHubDiscordYoutubeProductDatabaseAuthFunctionsRealtimeStoragePricingLaunch Week 7ResourcesSupportSystem StatusIntegrationsExpertsBrand Assets / LogosDPASOC2DevelopersDocumentationChangelogContributingOpen SourceSupaSquadDevToRSSCompanyBlogCustomer StoriesCareersCompanyTerms of ServicePrivacy PolicyAcceptable Use PolicyService Level AgreementHumans.txtLawyers.txtSecurity.txt© Supabase IncToggle Themes",
    "summary": "Supabase has released the Edge Runtime, a self-hosted solution for Deno Edge Functions that improves local development experience, enforces memory/duration limits, and serves all functions. The web server written in Rust uses a customizable Deno runtime and can serve TypeScript, JavaScript, and WASM functions, and it is licensed under MIT. Supabase plans to integrate Edge Runtime as an API gateway to other Supabase services in the future.",
    "hn_title": "Supabase Edge Runtime: Self-Hosted Deno Functions",
    "original_title": "Supabase Edge Runtime: Self-Hosted Deno Functions",
    "score": 298,
    "hn_content": "Supabase, a webserver for Deno, has released its Edge Runtime for self-hosted Deno functions, which can serve TypeScript, JavaScript, and WASM functions, and ensures parity between local development and production. A demo repository for deploying to Fly.io has been provided. The Supabase team aims to reduce its tech stack by removing Kong and replacing it with the Deno runtime. Edge Runtime plans to introduce better ways to profile functions in the future. Supabase supports Swift and React Native, and mobile auth support will be announced tomorrow. However, in some cases regular servers may be preferred.Supabase's new release, Edge Functions, allows serverless functions to run on the edge (closest to the user) for speed and security, and function logic may be written in any language. Some Hacker News commenters discuss the cost-benefit of hosting on VPS versus PaaS, praising the former for its flexibility and relatively low cost, and complaining about the way some PaaS providers inflate prices. However, some commenters argue they prefer PaaS for the ease of deployment and maintenance, and for the reduced need to deal with server administration. Other commenters debate the merits of different serverless providers and technologies, with one Supabase engineer revealing future plans for integrating file system access via Supabase Storage.Supabase, a PostgreSQL-based database platform, has released a new feature called Edge Functions that run serverless functions on the edge. The Deno implementation's serverless functions run on V8 isolates, allowing for nearly instantaneous deploys and low cold start times. However, a user reports that Supabase's developer tooling is not yet mature and can be buggy, and suggests that running multiple edge functions can limit scalability. The Supabase team builds products based on user feedback, with developers being very product-focused and user-facing. The platform recently received SOC2 Type 2 compliance and plans to support HIPAA next.  Supabase commented that it is slow to hire and only does so for specific issues outside the current team's ownership.Supabase users discuss options for deploying a multi-tenant B2B2C product, with some mentioning the possibility of using WASM functions, while others showcase the platform's functionality, such as its built-in authentication system, which is similar to Firebase Auth with user data stored in a regular Postgres database. Other topics discussed include Deno's superior runtime architecture, compared to Node, and possible competition with Cloudflare's Workers product. The Supabase team mentions that they are focused on Deno and WASM, but are adding support for native client libraries for other languages.",
    "hn_summary": "Supabase has released Edge Runtime for self-hosted Deno functions, aiming to reduce tech stack and provide better ways to profile functions in the future; Supabase also supports React Native and mobile auth, yet regular servers may be preferred in some cases. The new release, Edge Functions, runs serverless functions on the edge for speed and security, with several Hacker News commenters discussing cost-benefit of VPS versus PaaS and the merits of different serverless providers and technologies, while one user reports that Supabase's tooling is not yet mature and can limit scalability."
  },
  {
    "id": 35524881,
    "timestamp": 1681219858,
    "title": "People with severe mental illness have been failed by a dysfunctional system",
    "url": "https://www.theatlantic.com/magazine/archive/2023/05/american-madness-schizophrenia-mental-illness/673490/",
    "hn_url": "http://news.ycombinator.com/item?id=35524881",
    "content": "Jonathan Rosen's article in The Atlantic recounts the story of his childhood best friend, Michael Laudor, who suffered from severe mental illness and harmed the person he loved most; the article reflects upon the failings of America's mental health care system and the need for reform; Rosen advocates for policies that provide respite and adequate care to those who need it the most; the article highlights the importance of early intervention and the need for a cultural shift in attitudes towards severe mental illness.The article recounts the writer's friendship with a childhood friend named Michael who was socially effective and persistent in achieving his goals. Michael had a photographic memory and read at breakneck speed. He fueled the writer's love for Doc Savage and was well-versed in politics and current events. Michael went on to work for a top management consulting firm but quit after experiencing health issues and paranoia. He then pursued writing and stayed in an attic in a grand house owned by community psychiatrists who aimed to leave the world better. The article touches on the failures of community mental-health centers and their aim to treat the whole society instead of focussing on severe patients.The Network's Crisis Handbook detailed how vulnerable members of the community were being criminalized, and how the system failed to support those with mental illness. In 1987, the author visited his childhood friend, Michael Laudor, in a locked ward at Columbia-Presbyterian, struggling with delusions and paranoia. While earlier initiatives aimed to keep people with mental illnesses out of hospitals, Michael's eight-month stay gave doctors time to find the most effective medication. The story raises themes of community care versus institutionalization, and how society treats those with mental health issues.Michael was his struggle with schizophrenia, which posed challenges to his relationships, career prospects, and sense of self. Despite taking antipsychotic medication, Michael was one of many patients who were \"treatment resistant\" due to the conviction that they weren't sick, which complicated his recovery process. Michael's attempt to reintegrate into society was further hampered by the limitations of halfway houses, which offered only short-term solutions for long-term needs. In an unexpected turn of events, Michael's story gained national attention after a glowing profile in The New York Times, which chronicled his journey towards becoming a law school professor while openly acknowledging his schizophrenia.Michael Laudor, a Yale Law graduate suffering from severe schizophrenia, was popular among publishers for his proposed memoir that narrates schizophrenia from the inside out. Michael's book proposal caused a stir, as it resonated well with the movie industries. Michael made little progress on his book but the process inspired filmmakers. The severe delusions and hallucinations that accompanied Michael's illness, which he believed was controlled through his screen, ultimately lead to his fiancee's murder. Schizophrenia expert Dr. E. Fuller Torrey's case study regarding Michael became the subject of his article, \"Why Deinstitutionalization Turned Deadly,\" in which he compares Michael with another severe schizophrenic who killed people after rejecting medication.Author E. Fuller Torrey argues that denying care to mentally ill individuals who are unable to request help is a moral and medical failure. Although changes are slowly emerging in New York and California, nationwide improvements in mental health care and the provision of assisted outpatient treatment remain a concern. Involuntary commitment to hospitals is viewed as controversial, but psychiatrist Katherine Koh suggests that the biggest improvements in mental health can come from such treatment if there is a pre-planned and supported care process afterward. One of the biggest challenges toward reform is pessimism or a sense of resigned hopelessness stemming from failed efforts in the past.The concept of asylum has lost its intended purpose, but change is necessary to address severe mental illness. Solutions must focus on real problems instead of imaginary ones, even if it means acknowledging past mistakes. There is a tragic example of a legal scholar with schizophrenia who could have benefited from forced hospitalization. The author regrets not taking seriously a vague warning from a friend before a tragic event occurred. The article is adapted from a book called The Best Minds: A Story of Friendship, Madness, and the Tragedy of Good Intentions by Jonathan Rosen. Buying the book supports The Atlantic.",
    "summary": "Jonathan Rosen's article in The Atlantic tells the story of his childhood friend, Michael, and highlights the flaws of America's mental health care system, calling for reform that provides adequate care and support to those in need, emphasizing early intervention and cultural change. The article touches on community care versus institutionalization, the failures of community mental-health centers, and the need to support those with mental illness. The author argues for assisted outpatient treatment and acknowledges the controversial nature of involuntary commitment to hospitals, calling for change and a focus on real problems.",
    "hn_title": "People with severe mental illness have been failed by a dysfunctional system",
    "original_title": "People with severe mental illness have been failed by a dysfunctional system",
    "score": 262,
    "hn_content": "Theatlantic.com reports on severe mental illness patients being failed by a broken system; Hacker News user debates the middle ground between forcibly hospitalizing patients and ensuring no vulnerable patients get taken advantage of; efforts to help the homeless and mentally ill failing in San Francisco, according to VonGuard, due to the dominant ideology and absence of proper support; another user mentions their personal experience with trauma following forcible hospitalizations in context of psychiatric treatment.The post discusses the exploitative and exorbitant costs of medical care in America, particularly for those who cannot afford it, which often results in individuals being discharged without a diagnosis and considerable medical debt. One user suggests that there is a public hospital which treats individuals who cannot afford medical care, although this option is not discussed extensively. Another user argues that a person's right to refuse medical treatment cannot be overridden, even in cases where it is clear that they are not mentally sound enough to make such decisions. The lack of adequate support for homeless and mentally ill individuals in San Francisco is also noted, with some advocating for voluntary community treatment programs that are properly funded. Mental wards are criticized for questionable practices, including sleep deprivation, although some argue that these institutions are necessary for addressing severe mental health issues.A discussion on homelessness and mental health issues in society happened on Hacker News. A user points out that homelessness is not about punishing those who follow the rules, but rather about addressing the survival and mental health concerns that contribute to the problem. Some users express their frustration with both the Right and the Left's policies, with one user defining the feeling that they have no \"upper bound\" for compassion/empathy, which crashes and burns when they hit the real world. Another user cites the Great Lakes Region as the area where it's nice to live as poor or of moderate income.The comment section discusses the issue of homelessness and mental illness and possible solutions, with some arguing that treatments should be more helpful and respectful of users' rights to encourage those who need it to seek help. Others argue that some individuals may be beyond reason and unable to accept help, creating a need for a solution that balances compassion with prohibiting behavior that harms others. The commenters acknowledge the complexity of the issue and that sweeping solutions may not be effective without addressing underlying systemic issues. Some also note that certain cities within the Great Lakes region may be more habitable than others and that diversity can vary widely based on location.Comments on a post about homelessness highlight the need for compassion and homes, not forceful mental health treatment, in addressing the issue. Critics point out that shelters are often dangerous and less preferable to being outside, citing a need for smaller, scattered-sized shelters. Some argue that homelessness should be addressed as a public health issue, not one of individual rights, while others suggest repurposing unused spaces for affordable housing. One user speculates that the modern zombie genre is influenced by the issue of homelessness and its impact on cities.A farmer in California is dealing with a tent city of the homeless with multiple problems including human waste, needles, and stolen property which has now caused an influx of rats, coyotes and other scavengers.They have been told by the County Sheriff to file a report as they no longer respond to trespassing calls, and they could be fined for cleaning up the private property. One commenter suggests providing free homes to those who need them, with some claiming this has been successful in other places, although some are concerned about the political opposition it may face. Nonetheless, it is important to consider solutions that benefit society as a whole, with compassion and empathy, rather than just waiting for a perfect solution to fall into place.The comments on this post cover a range of topics, including homelessness, mental illness, and public health. One user argues that \"competence\" is not a binary decision and that it is not helpful to force treatment on people who do not want it. Others point out the challenges of treating mental illness and the limitations of current systems, while still others discuss the ethical implications of forcing people to take medication. There are also discussions of the public response to the pandemic and the balance between personal freedom and public safety. Overall, the comments reveal a complex set of issues that defy simple solutions.A debate around forced medication for individuals with acute mental health issues sparks conversation on vaccination mandates - an HN user argues that mandatory vaccination is more important than mandating treatment for mental illness due to the high ROI and lower harm inflicted. However, other users argue that involuntary treatment for severe mental illness is necessary to protect society from harm, even suggesting that mandatory isolation might be a more reasonable parallel than vaccination. The discussion involves disagreements about whether the current approaches to mental health care are working, as well as concerns about the potential abuses of requiring medical treatment for public benefit.There is a discussion about the best way to handle mental illness, whether it is to prioritize prevention or to address symptoms as they come up. The problem of compulsory care was also raised, with some users advocating for it, while others were concerned about government overreach. There was also a debate about the role of the judicial system in handling mental illness and the difficulty in finding good legal representation for those with severe mental health issues. Finally, the issue of treating mental illness without patient consent was discussed, with some advocating for it based on the need for early intervention and better long-term outcomes, while others raised concerns about patient autonomy.An article discussing the treatment of homeless mentally ill individuals has garnered a variety of opinions, including concerns over punitive measures against homeless individuals and the potential for the abuse of policies. Some commenters argue that involuntary hospitalization may be necessary for those who require mental medication. However, others express discomfort with the mental health industry and the potential lack of oversight or abuse of power that may result from it. The discussion also highlights the difficulties and challenges of navigating the US healthcare system, particularly for those with chronic illnesses or conditions.Comments on a Hacker News post discuss the relationship between intelligence and mental illness, specifically schizophrenia. While there are studies suggesting that higher IQs may help with coping mechanisms and awareness of illness, personal experiences of those with mental illness show that once psychosis takes hold, intelligence cannot control it. The discussion cites the example of John Forbes Nash Jr., whose high IQ did not save him from the severe impact of schizophrenia. The conversation then shifts to the challenges of accessing mental health care in the US, particularly for those who cannot afford it, and how the media often portrays these issues in a \"feel-good\" light.Social mobility in the US is low, and having rich parents is the best way to ensure access to healthcare according to an opinion piece published in The Tech Times. While government price caps and start-ups offering affordable medication are beginning to appear, the problem requires sustainable government intervention to prevent capitalism spiraling out of control. Mental health, drug abuse and crime are linked, but generally, there is little can be done for the management and treatment of incurable mental illnesses. Prevention of the onset of mental illness would be a more feasible and effective approach, but efforts are obstructed by the unpredictable nature of the disease, the absence of available treatment, and present laws that make it hard to legislate. Misdiagnosis is also rampant due to the delicate nature and complexity of mental health issues.A former associate of Bain & Company shares their negative experiences, including excessive spending and pressure to make up things for customers. A mentor's criticism led to an intense conversation and a dark comment about jumping out a window, which was tragically fulfilled when a Goldman Sachs associate jumped out of a nearby window a week later. The author resigned a week after that incident. A discussion in the comments section highlights the debate about whether drug use can induce schizophrenia, with one citing a study linking cannabis use to increased risk of psychosis in vulnerable people. Some comments share personal experiences with drug-induced psychosis. Applications are open for YC Summer 2023.",
    "hn_summary": "A broken mental health system leaves patients with severe mental illnesses uncared for, as necessary support efforts fail due to the dominant ideologies and lack of proper funding. The discussion in the comments section covers a range of topics, including homelessness, mental illness, public health, and the difficulty of finding effective solutions without addressing systemic issues. Additionally, concerns over the potential abuse of policies and the difficulty in accessing mental health care in the US arise."
  },
  {
    "id": 35519229,
    "timestamp": 1681173664,
    "title": "It happened to me today: $80/hr writer replaced with ChatGPT",
    "url": "https://old.reddit.com/r/freelanceWriters/comments/12ff5mw/it_happened_to_me_today/",
    "hn_url": "http://news.ycombinator.com/item?id=35519229",
    "content": "A freelance writer lost their main income source, a marketer who outsources writing, to ChatGPT. The client stated that despite the AI's inferior quality, the profit margin cannot be ignored. The writer emphasizes that quality may not matter to businesses and clients who prioritize profit margins, and that chatbots and AI are already replacing customer service teams. While some comments offer opinions on AI and its impact on the freelance writing profession, it is advised to distinguish between opinions and facts. The overall message is that AI, while not necessarily better than human writers, can provide faster and cheaper solutions that many clients prefer.The rise of AI in creative professions poses a significant threat, as it outperforms humans in terms of speed and cost-effectiveness, leading to the loss of clients for traditional professionals. The profit-driven world values quantity over quality, making AI an attractive option for companies seeking to publish content quickly. While some suggest adapting and reskilling, learning new skills takes time, and bills still need to be paid. AI's disruptive capabilities are obvious and could result in a future where artists are not rewarded for their work. Ultimately, professions that can be automated may become obsolete, leading to a society that only values utilitarian work.AI's potential to replace human jobs is a major concern, with some industries like content writing already experiencing disruption. While some believe AI will not replace human creativity, others predict it will automate much of the work. The question arises: will AI value creativity more or less when it is so easily accessible to more people? The growth of AI could potentially make individual contributions and creative outputs much more feasible with reduced effort, bypassing the need for big teams and budgets previously required. Ultimately, AI's impact will be enormously disruptive for everyone, with many getting caught in the crossfire financially at some point.Artificial intelligence (AI) is replacing the work of copy and content writers, but not in a good way as most of that writing is not good in the first place, and AI is trained on that type of writing. The opportunity is to write in ways that stand out against SEO-driven content. Clients may notice that SEO-degraded search engines render AI-produced content ineffective at returning useful results, prompting them to look for more unique pieces of writing. However, the risk is that AI technology may soon replace human writing entirely. Anyone who creates content in a purely online space has no chance against AI, but SEO and persuasive writing that convert are two areas that still take human effort.Writers advised to shift their skillset to include AI prompt engineering to replace lost jobs, with tips and tricks provided by OpenAI, but cautioned against paid courses. Some users believe quality content will always have a market niche, while others predict that the demand for it is in its final years, with clients preferring cheaper and automated writing. One employer's decision to hire automated writing may not reflect the broader market, and catering to target audiences might require more robotic texts, gifs, and less-crafted writing. While high-end writers might survive automation longer, their survival is not guaranteed. Surviving new technologies requires adapting, and manual trades have already faced similar challenges.Content writers are discussing the impact of AI on their profession, with some admitting they are unaffected, while others feel it is hurting their work. One user recommends developing other skills to future-proof oneself, while another reminds that AI's impact is still uncertain, and people should not base their career progression on others' assumptions. Some writers argue that AI-generated content is of lower quality, while others predict that AI will become a threat only temporarily. Some users suggest that AI will result in universal basic income, while others acknowledge that AI will continue to improve, and the impact will only increase. Meanwhile, some users share their similar experiences and sympathize with the impacted writer.The potential threat of AI and automation on jobs is highlighted in an exchange on Reddit's Hacker News forum. One user claims that AI will replace all jobs in the workplace, with the last to go being physical complex labor. According to the user, coders and accountants may be replaceable by AI within the next few years. Despite the possibility of change, there is hope for smart, hardworking individuals with people skills, who may retain value in the future. Other users share similar experiences, with one revealing that their client suggests they utilize ChatGPT to speed up their content creation process.ChatGPT, an AI language model, is discussed by HN users within the context of the freelance writing industry. While ChatGPT can generate grammatically correct and coherent content, professional copywriters bring a range of expertise to the table that AI may not match. Some HN users acknowledge the potential of AI to impact the field of writing, while others maintain that unique human qualities such as creativity, opinion, and personality will always be needed in writing. The discussion also touches on the potential for AI to reduce the need for certain professions, and the importance of upskilling and finding new ways to add value to clients.An expert copywriter laments the impact of AI on their industry, arguing that writers should not see any assignment as boring and that great writing is possible regardless of budget or product type. One reader suggests that writers could differentiate themselves by becoming certified in specific niches. Other comments express skepticism about the true impact of AI on copywriting, warning that the limitations of the technology and the value of human point of view and opinion mean that good writers will always be in demand. Some users express anti-capitalist or anti-corporate sentiments, while others joke about the post's perceived conspiratorial intent.",
    "summary": "An $80/hr freelance writer lost their job to ChatGPT, an AI language model, highlighting the impact of automation on the writing industry. While AI can produce faster and cheaper content, some believe that human writers can provide unique qualities such as creativity and personality. The discussion touches on the potential for AI to replace jobs and the importance of upskilling to add value to clients in a changing market.",
    "hn_title": "It happened to me today: $80/hr writer replaced with ChatGPT",
    "original_title": "It happened to me today: $80/hr writer replaced with ChatGPT",
    "score": 242,
    "hn_content": "A Hacker News post contemplates whether AI will replace human writers and content creators, citing a story from a writer who was replaced with ChatGPT. While some view \"content\" as an industry that needs to be devalued into the ground, others recognize the immeasurable contribution that talented artisans add to society. As for AI, it's important to consider that it still requires heavy human interference and will require critical reputation signals to make up for any loss of quality. Overall, it's challenging to predict the many possible outcomes, but ultimately, it's important to recognize that the world is constantly changing and finding new solutions to make a profit.AI-powered content creation has led to the elimination of jobs that were previously done by humans, such as marketing and writing. Users of ChatGPT have reported time savings and cost reductions when using the tool, which can generate polished content that may be on par with human writers. Some users suggest this is a positive development as it eliminates \"bullshit jobs,\" while others highlight potential social unrest resulting from the loss of jobs. In addition, some comments note shifts in cultural values towards greater recognition of unique, original work, rather than generic, AI-generated content. However, LLMs (large language models) may pose a danger because people may struggle to conceptualize the implications of models trained on vast amounts of data.HN users discuss the concept of 'bullshit jobs' and how it reflects on the socioeconomic system. Some argue that a job that improves revenue or profit cannot be considered a 'bullshit job.' The use of AI in content creation is also discussed, with some pointing out that AI output may be cheaper but not necessarily better. An analogy is made to cheap flights being less reliable. The winner-take-all nature of industries like music and movies is mentioned, with only the top 1% truly succeeding. The use of intellectual property is brought up as an example. Coca-Cola is brought up as a company that survives significant competition through their advertising efforts.Experts discuss the quality of AI-generated content versus its volume, with some pointing out that minor differences can create significant variations in the outcome. However, the potential to significantly cut costs by outsourcing to AI remains attractive for many. The conversation moves towards other fields, such as medicine and surgery, and whether AI will replace highly skilled individuals in the future. Meanwhile, concerns arise about the potential impact of relying solely on AI-generated content in fields where accuracy is paramount. Overall, the discussion highlights the ongoing debate about AI's role in industries, and whether it can truly replicate the work done by humans.The article discusses the potential for ChatGPT to take over the role of technical writers and the concerns that come with that, including the need for accuracy in compliance related writing. Some users argue that ChatGPT may even be superior in certain areas of writing, but others express concerns about complacency in the face of errors that could slip through without human oversight. Some users highlight the humor of translation errors and suggest that chatbots will not make quality worse, but rather that most writing already on websites and in FAQs is lacking. Others suggest that human interaction will always be valuable and that premium products will continue to come from human writing.The use of AI to generate creative output is disrupting creative industries, with examples such as AI-generated video game posters and copywriting. However, there are debates as to whether AI is a substitute or just an assistant. Some argue that AI is replacing certain jobs, while others argue that it's not yet able to perform all of the necessary tasks. Regardless, there is a potential for a flood of competition in industries where automation has not yet reached. The impact on job security can be significant, and the main challenge for individuals is adapting to the changing tech landscape.Experts discuss the potential of AI replacing human coders, with some arguing that the quality of AI-generated code is currently poor, while others point out that the technology is improving and will likely continue to improve over time. Some predict that as automation continues to replace jobs, a social safety net may become necessary to support displaced workers. Others argue that such concerns are overblown and that automation will ultimately lead to a world without drudgery, freeing people to pursue their hobbies and passions. Still, others warn that the rise of automation could exacerbate inequality, leading to a world with a GINI coefficient approaching 1.Experts on Hacker News are discussing the potential impact of artificial intelligence on various industries, including white-collar jobs such as content writing and programming. Some commenters express concern for those who may lose their jobs, while others argue that this disruption is simply a part of progress. Mention is made of GPT-4, a particularly effective AI language model capable of generating content quickly and cheaply. Some express skepticism about the quality of such generated content, while others suggest that it may be good enough for certain applications. The discussion also touches on the global impact of such AI disruption, particularly on areas with lower-valued markets. Overall, the conversation highlights the need for society to adapt to a rapidly changing technological landscape.An article on Hacker News discusses the idea of replacing human writers with AI, citing examples of AI-driven copywriters and the capabilities of GTP. Some comments express support for the idea, arguing that AI can produce better and more efficient output. However, others argue that AI cannot replace the creativity and insight that humans bring to writing. The authenticity of the article is called into question by some comments, but others point out that the author is a professional writer and marketer. Ultimately, the debate around AI and writing highlights the ongoing advancements in technology and their potential impact on various industries.",
    "hn_summary": "AI-powered content creation with tools like ChatGPT has led to the loss of jobs, but some see it as a positive development to eliminate \"bullshit jobs,\" while others express concerns about social unrest resulting from job loss. Expert discussions center around the quality vs. quantity of AI-generated content, its use in various industries, and potential impact on job security and inequality. Debate highlights the need for society to adapt to a rapidly changing technological landscape."
  },
  {
    "id": 35531989,
    "timestamp": 1681249327,
    "title": "Deck.of.cards",
    "url": "https://deck.of.cards/old/",
    "hn_url": "http://news.ycombinator.com/item?id=35531989",
    "content": "HTML5 Deck of Cards",
    "summary": "The 'Deck.of.cards' post is about an HTML5 Deck of Cards. It is not clear what exactly the post is about other than that.",
    "hn_title": "Deck.of.cards",
    "original_title": "Deck.of.cards",
    "score": 239,
    "hn_content": "Deck.of.cards | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Deck.of.cards (of.cards)239 points by edent 4 hours ago | hide | past | favorite | 35 comments   graypegg 1 hour ago        | next [–] I played a game of solitaire but as I was moving my kings onto their suit's stack at the end I triggered the joker easter egg and the entire deck got put back into one pile :( reply  jesse__ 2 hours ago        | prev | next [–] Nicely polished, I like it.EDIT: Turns out the following behavior is intentional, but I'll leave the statement here so the child comments make sense.I wanted to point out what may be a bug .. if I quickly drag a face-down card off the deck and release the LMB right away, it flips face-up, however if I leave the mouse button depressed for ~0.5s, it stays face-down. Maybe this is intentional, but I feel like it's a bit of a weird behavior either way.Chrome 111/Windows.Anyway, thanks for sharing :) reply  cypherpunks01 2 hours ago        | parent | next [–] I think it's a feature, works really nicely on a phone - if you tap, flick the card and quickly release, it lands face up as if you're throwing the card on the table as you deal. Whereas if you drag it more slowly into place, it will remain face down as if you are sliding it on the table. Feels pretty natural on touchscreen. reply  throwbadubadu 1 hour ago        | parent | prev | next [–] 200 ms to be precise, definitely feature (a reasonable one) and not a bug (:card.js confirms:if (isFlippable && Date.now() - starttime < 200) {    // flip sides reply  jeron 35 minutes ago        | prev | next [–] Reminds me of Mr. Doob's javascript recreation of winning solitairehttps://mrdoob.com/lab/javascript/effects/solitaire/ reply  allenu 3 hours ago        | prev | next [–] Really cool stuff. I like how \"heavy\" the cards feel during the animation.I've been working on something similar, but for arbitrary index card notes and played around with some very basic animations. You can see a quick video of it here [1]. After I got a basic prototype working, there was just something satisfying about collecting all the cards, shuffling them, and then re-distributing them into a grid.I noticed that deck.of.cards doesn't have a flip animation, but maybe that's a good thing. The typical animation you see when a card is just flipped by rotating about one of the axes just \"feels\" wrong to me. It breaks the illusion somehow, but maybe there's a better way to do it.[1] https://mastodon.social/@allenu/109952125506805902Edit: You may need to hover over the GIF in the link to get the animation to start. Kind of unexpected behavior. reply  alexthehurst 2 hours ago        | prev | next [–] I tried setting up a game of solitaire (on desktop with a mouse) and it got tedious really fast. What I wished for right away was:- Ability to drag a selection region and move multiple cards together (like, say, the deck)- Ability to align cards to each other (I found myself testing modifier keys while dragging to see if this was a hidden feature, but alas.) reply  jordan_curve 32 minutes ago        | parent | next [–] Does anyone know how one might go about implementing a feature like multiple select?I had a project doing something similar a while back and got pretty stuck on figuring out how to go about it reply  armchairhacker 4 minutes ago        | root | parent | next [–] Click and drag to select, then click and drag again to move, like how Kinopio does it: https://kinopio.club/, https://blog.kinopio.club/posts/magic-paint-select/ reply  RheingoldRiver 1 hour ago        | parent | prev | next [–] Also, the cards in the should-be-face-down deck seem to sometimes be face-up when I remove the top card. I played with it a bit before dealing cards, though, like \"fan,\" \"sort,\" \"poker,\" etc, so I'm thinking maybe it doesn't properly reset the face-down-ness when you click \"shuffle.\"FWIW I don't think the Kings easter egg is a good idea as-is. Maybe require a modifier key like \"Click the kings while holding down the `K` key.\" Otherwise someone might have to click all kings while playing Free Cell and have their game ruined, that's no fun. reply  wlesieutre 1 hour ago        | root | parent | next [–] Shuffling doesn't reset flipped-ness, it looks like \"flip\" is the only action that puts all the cards facing the same way reply  InitialLastName 2 hours ago        | parent | prev | next [–] Also necessary:- The ability to shuffle the cards without the jokers. reply  alexthehurst 1 hour ago        | root | parent | next [–] I actually often skip this step with real cards. If a joker comes up, toss it and replace it from the deck. reply  jkingsman 3 hours ago        | prev | next [–] Oh man this would be awesome to have as a shared web space where I could play arbitrary card games with friends like a hyper restricted Tabletop Simulator.Nice and slick as is, though reply  usrusr 14 minutes ago        | parent | next [–] That, but through a federated local bluetooth mesh instead of a server is something that I'd appreciate a lot. Restricted to in-person opportunities, but liberating from not only the need for a deck but also from the need for a reasonably suitable table surface. And obviously a play on the \"everybody just starting at their phones instead of interacting\" trope. reply  nneonneo 3 hours ago        | parent | prev | next [–] https://playingcards.io/ worked well for me and my family during the pandemic. reply  shp0ngle 3 hours ago        | parent | prev | next [–] If you remove the \"/old\" from the URL, you can do just that reply  nneonneo 2 hours ago        | root | parent | next [–] Multiplayer didn't seem to work - nothing synced, buttons didn't work, and I couldn't even flip cards (Firefox).Single-player seems fine though. reply  ehcjrvakzjtbe 2 hours ago        | parent | prev | next [–] Cockatrice can do that, configured for magic by default if i remember correctly. Youll have to cough up image files for different card sets.There is a client and a server, so not super easy, but not hard if you have any sysadmin experience. I had a server up for almost a year oncehttps://github.com/Cockatrice/Cockatrice reply  dminor 59 minutes ago        | parent | prev | next [–] I've been hacking on something like that to learn Phoenix, will post it to HN when it's usable reply  hauxir 1 hour ago        | parent | prev | next [–] that's exactly what https://cardtables.online does reply  Caitlynmeeks 2 hours ago        | prev | next [–] Aw i was hoping it was gonna go to Gregg Turkington's Deck of Cards projecthttps://www.heinetwork.tv/episode/deck-of-cards-teaser/ reply  Caitlynmeeks 2 hours ago        | parent | next [–] https://www.youtube.com/watch?v=cv0EmWhd24Y reply  totetsu 1 hour ago        | prev | next [–] The stuff you should know podcast just released an episode on the history of playing cards that was interesting reply  taylorbuley 2 hours ago        | prev | next [–] Anyone else rather hunt through source code to find the king easter egg than to actually click only kings and nothing in between? reply  skeaker 2 hours ago        | parent | next [–] Even easier, just hit the By Suit button at the top and all the kings will be sorted along the right side. reply  cuttysnark 1 hour ago        | root | parent | next [–] Source code reveals clicking all Kings adds Jokers to the deck, but also clicking all Aces will do the \"Winning\" sequence from Solitaire, aptly named \"startWinning()\" reply  karaterobot 2 hours ago        | prev | next [–] Very satisfying animations.It needs some form of multi-card selection, so that I can grab a stack of cards and move, shuffle, or flip them as a group. I tried to play a game of solitaire, then got to the part where you can reuse the cards in your discard pile, and realized that there was no way to have it shuffle those cards, or even to just flip them all over. reply  booleandilemma 2 hours ago        | prev | next [–] Wow, beautiful and polished looking on Firefox.It would be cool if when I clicked and dragged a card and let go of the mouse button, the cards slid a bit, to simulate them sliding them across the table.I could see some people not liking that though, best to make it configurable. reply  notfed 1 hour ago        | prev | next [–] I like that this essentially can simulate any card game.(Feedback: can't click \"sort\" on mobile due to placement of git banner.) reply  tambourine_man 37 minutes ago        | prev | next [–] Great fun and awesome domain.Nicely done. reply  owenpalmer 3 hours ago        | prev | next [–] Super cool, works well on mobile reply  HDMI_Cable 3 hours ago        | parent | next [–] One (very small) nitpick on mobile: it’s very hard to press the ‘Sort’ button, as the ‘Fork me on GitHub’ logo covers most of the button. Other than that, this is great! reply  noizejoy 2 hours ago        | root | parent | next [–] Even smaller nit-pick: what you’re describing would seem to be more “small screen size” rather than “mobile” reply  hauxir 1 hour ago        | prev [–] really cool, you can also check out https://cardtables.online it allows for multiplayer + cams replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Deck.of.cards is a well-polished virtual card deck with a feature that allows players to simulate dealing cards by flicking them onto the table. Users suggest that the deck of cards website would benefit from a couple of new features, such as multi-card selection and the ability to align the cards. Some users also compare the website with other virtual card games or card games that they throw with their own hands."
  },
  {
    "id": 35529240,
    "timestamp": 1681237882,
    "title": "Rules for developers to design beautiful UIs without a designer",
    "url": "https://www.refactoringui.com/",
    "hn_url": "http://news.ycombinator.com/item?id=35529240",
    "content": "Refactoring UI, a comprehensive design package for creating beautiful user interfaces, is introduced by full-stack developer Adam Wathan and creative designer Steve Schoger. The package includes a 218-page book containing 50 visual chapters, video tutorials, a gallery of 200+ component styles, a collection of over a dozen detailed color palettes, a showcase of 30+ categorized font recommendations, and over 200 customizable SVG icons. With testimonials from satisfied customers, the Essential version is priced at $99 while the Complete Package, which includes all features, is offered at $149 plus local taxes. Team pricing options are also available.Tailwind Labs Inc. is offering a pricing page layout idea and a component gallery for users to customize, while emphasizing the importance of creating unique designs. The license for the icons allows users to use them in open-source projects, but prohibits reselling or publishing them for free. In case of dissatisfaction, there is a 60-day money-back guarantee.",
    "summary": "Full-stack developer Adam Wathan and designer Steve Schoger have developed Refactoring UI, a comprehensive design package including a 218-page book, video tutorials, a gallery of 200+ component styles, color palettes, fonts, and SVG icons. The Essential version costs $99, while the Complete Package is priced at $149. Team pricing options are available, and there is a 60-day money-back guarantee. Tailwind Labs Inc. is offering layout ideas and a component gallery, emphasizing unique designs.",
    "hn_title": "Rules for developers to design beautiful UIs without a designer",
    "original_title": "Rules for developers to design beautiful UIs without a designer",
    "score": 235,
    "hn_content": "The article \"Rules for developers to design beautiful UIs without a designer\" has garnered a lot of attention on Hacker News, with both positive and negative feedback. Some readers feel that focusing only on the \"polish\" of a design overshadows more critical factors such as user flow, functionality, and placement of buttons. Others argue that aesthetics are just as important in attracting consumers and that beauty sells. The debate between form and function continues, and UX designers must balance engineering with art to make a product that is both functional and visually appealing.Design and functionality are both important in creating an effective product, and attempting to separate the two can lead to a subpar outcome. Good aesthetic design can enhance usability, but it is important not to confuse design with art. While designers may be tempted to create a highly unique design, they should learn and follow recognized design best practices, especially when it comes to supporting localization. The recent trend of \"dribbble-raised designers\" may contribute to a lack of understanding of design principles. However, both functional and visual design are important, and a balance between the two is key to creating a successful product.Comments on a Hacker News post discuss issues with material UI design and the overuse of pop-up windows and other anti-UX patterns. A UI designer advises on dealing with disagreements in design and strategies for user research. Some comments criticize design rules, calling for a focus on usability over aesthetics. The importance of information hierarchy and intuitive interaction design is emphasized. The discussion highlights the pitfalls of over-reliance on visual design trends at the expense of usability.A post on Hacker News describes how to use borders intentionally instead of avoiding them altogether; an example screenshot shows using fewer borders to highlight a single row from a table. Some users criticize the example and suggest better alternatives like making the selection hint more saturated than a field bg; others criticize the focus on beauty over usability. Users also suggest the importance of feedback, contrast, and functionality over aesthetics in UI/UX design. Despite controversy, the accompanying book has sold over 20,000 copies as of posting. As a side note, some users express frustration over automatically disappearing elements in UI, such as disappearing scrollbars.A book recommended for its comprehensive guide on UI design and tailoring the interface design process without containing any code is worth the $100 price tag, but some readers argue that a pdf costs too much. Borders are a great way to distinguish two elements from one another, but using too many of them can make designs feel cluttered, but individual preferences may differ. Users assert that the designer should care about creating a great UI instead of only making it pretty. \"Feel for it\" cannot be taught in boot camp or crash courses; it develops with time and experience. Although busy designs may be unappealing, they allow higher contrast and better visibility for a large amount of data.A book on UI design is being advertised on HN, which has received positive reviews from some users. Many users have also expressed interest in a physical copy of the book. Some users have made sarcastic comments regarding the advertisement, while others have recommended following the author on Twitter. One user recommends using an AI language model to design web pages, while another user noted that the book focuses on design rather than UX. The book costs $100, sparking a discussion regarding the advertisement budget.",
    "hn_summary": "The debate between form and function continues as Hacker News users discuss the importance of design principles in UI/UX, including the balance between aesthetic design and usability, avoiding overreliance on trends, and prioritizing feedback and functionality. A book on UI design advertised on HN receives positive reviews, although the $100 price tag sparks controversy among users."
  },
  {
    "id": 35525661,
    "timestamp": 1681223343,
    "title": "Distributed Machine Learning Notebooks with Elixir & Livebook",
    "url": "https://news.livebook.dev/distributed2-machine-learning-notebooks-with-elixir-and-livebook---launch-week-1---day-2-1aIlaw",
    "hn_url": "http://news.ycombinator.com/item?id=35525661",
    "content": "Distributed² Machine Learning notebooks with Elixir and Livebook - Launch Week 1 - Day 2 - Livebook.dev - The Livebook BlogThe Livebook BlogBack to Homepage Subscribe to UpdatesLabelsAll Postsreleasestutorialsannouncementslaunch weekJump to MonthApril 2023March 2023February 2023January 2023December 2022October 2022September 2022August 2022July 2022May 2022January 2022April 2021Powered️ byCreate yours, for free!releaseslaunch weektodayDistributed² Machine Learning notebooks with Elixir and Livebook - Launch Week 1 - Day 2Welcome to the second day of Livebook Launch Week! 🎉Today we will discuss all the new Machine Learning capabilities in Elixir and Livebook. First, we will discuss some of the new Neural Network tasks in Livebook v0.9. Then we will show how easy it is to make an existing model run concurrently and then distributed across multiple machines and multiple GPUs.Let’s get started!Distributed² Machine Learning with ElixirThis new Livebook release has many new Machine Learning models you can use with just a few clicks. But there is more exciting news about the Machine Learning story in the Elixir world.Not only can you do Machine Learning with Elixir, but you can also do Distributed² Machine Learning!But what does that “Distributed²” means?It means that when executing a Machine Learning model with Elixir’s Nx, the distribution can happen on two dimensions:it can be distributed to multiple machinesinside each machine, it can be distributed to multiple GPUsThis can lead to increased performance and better utilization of your hardware resources. And it only takes very few changes to your code.Do you want to see an example? Watch this part of our video.We are very excited about these features because we are starting to marry the benefits of Nx with the capabilities for building fault-tolerant and distributed software from the Erlang Virtual Machine. Case in point: adding distribution support to Nx took only 400 lines of code, including docs and tests!New Machine Learning models availableNeural network tasks were initially added to Livebook version 0.8 with the idea of giving you the power to use modern Machine Learning models with just a few clicks.This 0.9 release comes with more models. Here they are.Speech-to-textConversationQuestion answeringLanguage detectionZero-shot text classificationPunctuationWhat now?We encourage you to go ahead and install Livebook’s latest version to start playing with all of those Machine Learning models!And if you have any comments or want to share what you’ve built using Livebook, you can tweet using the #LivebookLaunchWeek hashtag.Stay tuned for the following announcement of the Livebook Launch Week!More Launch WeekDay 1: Deploy notebooks as apps & quality-of-life upgrades",
    "summary": "The Livebook Launch Week's second day introduces Livebook v0.9's new machine learning capabilities, including distributed machine learning with Nx that can be GPU-accelerated and distributed to multiple machines with minimal code adjustments. The release also includes new neural network tasks such as speech-to-text, language detection, and punctuation, making it easier for users to use modern machine learning models with just a few clicks.",
    "hn_title": "Distributed Machine Learning Notebooks with Elixir and Livebook",
    "original_title": "Distributed Machine Learning Notebooks with Elixir and Livebook",
    "score": 227,
    "hn_content": "Distributed Machine Learning Notebooks with Elixir and Livebook | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Distributed Machine Learning Notebooks with Elixir and Livebook (livebook.dev)228 points by josevalim 11 hours ago | hide | past | favorite | 20 comments   josevalim 11 hours ago        | next [–] Hi everyone, contributor to Livebook and Nx here.When we started the Numerical Elixir effort, we were excited aboutthe possibilities of mixing projects like Google XLA's (from Tensorflow)and LibTorch (from PyTorch) with the Erlang VM abilities to run concurrent,distributed, and fault-tolerant software.I am very glad we are at a point where those ideas are coming to lifeand I explore part of it in the video. My favorite bit: making the tensorserving implementation cluster distributed took only 400 LOC(including docs and tests!): https://github.com/elixir-nx/nx/pull/1090I'll be glad to answer questions about Nx or anything from Livebook's launch week! reply  DrewADesign 8 hours ago        | parent | next [–] Nothing specific about this project, and don't feel obligated to respond, but I just wanted to thank you for all the work you've done with Elixir and the related ecosystem. Great language, great tools, and a helpful, welcoming community. It was a perfect introduction to practical functional programming.Haven't found a big project for it yet, but I've done a bunch of little side projects since a friend who worked at Appcues gave me the hard sell on it around 2018. reply  pejrich 7 hours ago        | parent | prev | next [–] > contributor to Livebook and Nx hereWhile accurate, it's a bit of an understatement :) Thanks for all your work, Jose. reply  andy_ppp 4 hours ago        | parent | prev | next [–] Do you ever think about why you’re probably a 100x programmer, is it just working memory and pure intelligence or some strategy or tactics that make you so good at this. Asking for a friend :-) reply  dpflan 9 hours ago        | parent | prev | next [–] Thanks for sharing!The distributed ML currently seems focused on model execution. I see another commenter's excitement about \"Looking forward to NX transformations that take distributed training next level.\" -- which I agree, will be quite interesting.Where / how do you see Nx being used effectively in distributed training? Is distributed training a reality for open-sourced models to compete against big tech models? reply  josevalim 8 hours ago        | root | parent | next [–] For distributed training, one important feature is to be able to do GPU-to-GPU communication, such as allreduce, allgather, and all2all. Those are not supported at the moment but they are in our roadmap. At this level, however, it seems the language runtime itself plays a reduced role, so I don't expect the experience to be much different to, say, Python/JAX.For the second question, my understanding is that all big tech models rely on distributed training, so distributed training is a requisite for competing really. reply  Dowwie 7 hours ago        | parent | prev | next [–] Is anyone working on audio libraries that will enable streaming audio chunks for Whisper processing? Saving audio files into a local file system, running ffmpeg to chunk, and then sending them off to Whisper is very tactical.. reply  josevalim 7 hours ago        | root | parent | next [–] The current pipeline expects PCM audio blobs and, if data is coming from a microphone in the browser, you can do the initial processing and conversion in the browser (see the JS in this single file Phoenix app speech to text example [0]).On the other hand, if you expect a variety of formats (mp3, wav, etc), then shelling out or embedding ffmpeg is probably the quickest path to achieve something. The Membrane Framework[1] is an option here too which includes streaming. I believe Lars is going to do a cool demo with Membrane and ML at ElixirConf EU next week.[0]: https://github.com/elixir-nx/bumblebee/blob/main/examples/ph...[1]: https://membrane.stream/ reply  mark_h 19 minutes ago        | root | parent | next [–] Quick example video from Chris McCord using ffmpeg and whisper in Phoenix: https://www.phoenixframework.org/blog/whisper-speech-to-text... reply  ricketycricket 4 hours ago        | root | parent | prev | next [–] > I believe Lars is going to do a cool demo with Membrane and ML at ElixirConf EU next week.Yes, the relevant part of his demo with the membrane pipeline appears to be here: https://github.com/lawik/lively/blob/master/lib/lively/media... reply  brentjanderson 7 hours ago        | root | parent | prev | next [–] You may be able to incorporate the [Membrane Framework](https://membrane.stream/) to do that. Built in Elixir, deals in those types of multimedia problems.I'm not an expert here, but I'd expect that capturing a sample using Membrane and piping it into Whisper should be doable. reply  dangerboysteve 5 hours ago        | parent | prev | next [–] As everyone is chiming in on, fantastic work by you and your team. reply  mrdoops 8 hours ago        | prev | next [–] It is bonkers how little code and need-to-now is necessary to deploy cutting edge models in an Elixir app these days.I didn't realize until a recent side project just how much progress had been made in Nx until I started implementing parts of Nx Serving myself only to find the Nx libraries already have distributed batched serving, faiss, pg_vector support and more.Makes me want to quit all work obligations to hit the books and build product with Nx. reply  throwawaymaths 10 hours ago        | prev [–] It's pretty clear that Joe Armstrong respecting that the speed of light is a thing and that data locality/data gravity are real is starting to pay off in big ways.I do wonder if maybe streaming large data chunks over Erlang distribution might be a problem and a secondary data channel (e.g. over udp or sctp) might be worth playing with.Looking forward to NX transformations that take distributed training next level. reply  Ankhers 8 hours ago        | parent | next [–] > I do wonder if maybe streaming large data chunks over Erlang distribution might be a problem and a secondary data channel (e.g. over udp or sctp) might be worth playing with.You may want to take a look at the partisan[0] library written in Erlang. It is basically that, a reimagination of distributed Erlang, except that it can be multiplexed over multiple connections.[0] - https://github.com/lasp-lang/partisan/ reply  throwawaymaths 6 hours ago        | root | parent | next [–] Yeah but partisan gives you a \"ton of stuff you might not need\" plus the point is to treat distribution as a control plane and separate concerns from the data plane. There used to be things to worry about using Erlang distribution in general -- irrespective of backend, iirc, like HOL blocking (I think those are resolved now). reply  bmitc 8 hours ago        | parent | prev [–] > It's pretty clear that Joe Armstrong respecting that the speed of light is a thing and that data locality/data gravity are real is starting to pay off in big ways.I'm familiar with Joe Armstrong and Erlang/Elixir, but do you have a particular reference in mind where he was specifically discussing this? Is it one of his papers or talks? Just looking for another interesting thing Joe Armstrong said or thought. :) reply  throwawaymaths 6 hours ago        | root | parent | next [–] I don't have a reference offhand, but I have seen it. It's mostly a vibe. Remember that Joe was a physicist before a programmer: the synchronicity problem is pervasive in the design of the platform. Local immediate access to data is generally a special cased situation via an escape hatch with tons of big red warning signs. reply  OkayPhysicist 6 hours ago        | root | parent | prev | next [–] I think he said it a few times, but \"The Mess We're In\" features it prominently. reply  POiNTx 5 hours ago        | root | parent | prev [–] Right here, but the entire talk is great: https://youtu.be/lKXe3HUG2l4?t=1431 replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Livebook and Nx allow for distributed machine learning with Elixir, utilizing the capabilities of the Erlang VM in conjunction with Google XLA and PyTorch's LibTorch. Nx aims to compete with big tech models in machine learning, and contributors to Livebook and Nx have been thanked for their work by HN users."
  },
  {
    "id": 35522080,
    "timestamp": 1681199129,
    "title": "Maximizing the Potential of LLMs: A Guide to Prompt Engineering",
    "url": "https://www.ruxu.dev/articles/ai/maximizing-the-potential-of-llms/",
    "hn_url": "http://news.ycombinator.com/item?id=35522080",
    "content": "Language models (LLMs) such as GPT-3 and GPT-4 have gained popularity due to their ability to perform various tasks with incredible skill. In this article, the author explores LLMs, their strengths, weaknesses, and prompt engineering strategies. LLMs are neural networks trained on vast amounts of text data to generate human-like text ideal for natural language processing (NLP) tasks. Prompt engineering strategies can direct LLMs to perform specific tasks such as text summarization, information extraction, question answering, chatbots, text classification, code generation, and reasoning upon its response. Despite their impressive performance, LLMs have several limitations, such as their inability to reason beyond the information provided and generating biased text. Using these prompt engineering strategies allows users to maximize the potential of LLMs.Prompt engineering is essential to maximize the potential of language models like LLMs, with few-shot and chain of thought prompting being viable strategies. LLMs can perform complex tasks, but prompt engineering helps developers harness their power effectively. More strategies and techniques are being developed to optimize LLM potential. As LLMs grow bigger, they will offer solutions for more tasks we cannot even think of yet. Thus, it's exciting to think about the possibilities and the use cases that LLMs will continue to serve us in the future.",
    "summary": "The article explores Language Models (LLMs), including their strengths, weaknesses, and prompt engineering strategies for specific tasks such as text summarization,  question answering, code generation, and reasoning. Despite some limitations, prompt engineering allows users to maximize LLMs' potential, and with more strategies being developed, the possibilities for LLMs in the future are exciting.",
    "hn_title": "Maximizing the Potential of LLMs: A Guide to Prompt Engineering",
    "original_title": "Maximizing the Potential of LLMs: A Guide to Prompt Engineering",
    "score": 225,
    "hn_content": "A post on Hacker News by ruxudev, titled \"Maximizing the Potential of LLMs: A Guide to Prompt Engineering\" has gained significant attention. While some consider it prompt engineering, others view it as witchcraft or AI. Some users highlight that understanding the problem, expressing it cogently, and considering edge cases are the real meat of software engineering. Additionally, users debate the use of language like \"engineering\" in this context. Meanwhile, other users contributed humorous incantations to summon GPT-IV demon spirits to perform programming tasks. It is essential in such posts to remain neutral and focus on the central topic, omitting trivial information that most readers already understand.A debate on whether individuals who write HTML and CSS should call themselves software engineers leads to discussions about the definition of engineering and the practice of using GPT for software prompts. While some argue that engineering is about precision and reliability, others suggest that it is primarily about making things useful. One individual describes LLMs as \"stochastic sequence completion engines.\" A suggestion is made to use templates or snippet managers to save time.The post discusses \"Prompt Engineering,\" which creates specific prompts for AI language models. Some commenters argue whether it qualifies as engineering. Others discuss security vulnerabilities of concatenating trusted and untrusted text, and propose potential solutions. The author and commenters emphasize the necessity of clear and precise prompts to achieve optimal results with AI language models, which can have a wide range of applications from API calls to bug reports. Assembling prompts programmatically presents challenges and security issues. The article suggests respecting the norms and avoiding incorrect assumptions when communicating with AI language models.Hacker News users discuss the risks of prompt injection and insidious LLM injections that can email people, and the difficulty of mitigating them due to the probabilistic nature of LLMs; some suggest treating AIs as human employees with potential to go rogue; others note the limitations of text-completion LLMs, such as their tendency towards \"mode collapse\" causing similar outputs in style and content; while some feel that prompt engineering is unnecessary with stronger AI models, many think it encompasses broader sequences than simple verbal templates. There is also a comment noting the error in output location from the LLM model.Prompt engineering, a process of interleaving multiple prompts, is becoming essential for getting the most out of modern language models (LLMs) like GPT3/4, however, limitations like token limit still pose obstacles. Splitting large documents into smaller parts, using embedding tools or summarization software like Universal Summarizer can provide workarounds. Though people who think prompt engineering is a new skill they need to learn should understand it's essentially just like writing. Prompt engineering is a bag of tricks that change the probabilities of outputs, thus behaving more like experiments rather than engineering. In conclusion, prompt engineering is evolving and playing a crucial role in LLMs for natural language processing.Users on Hacker News are discussing the use of prompts and interactions in working with language models (LLMs) for generating code. Some users express frustration with the need to craft precise prompts for LLMs, with one user suggesting that the development of an AI that can better understand natural language is a more suitable long-term approach. Others argue that precise prompts are necessary, comparing it to a movie director giving actors direction, and that such prompts will likely evolve towards a more programming language-like structure in the future. There is also a mention of the need for a better way to handle LLM outputs.",
    "hn_summary": "Users on Hacker News are discussing the role of prompt engineering in maximizing the potential of language models such as GPT3/4. Debate centers around the nature of engineering and the necessity of precise prompts for optimal results in natural language processing. Concerns are raised about the security vulnerabilities of concatenating trusted and untrusted text, and the difficulty of mitigating risks due to the stochastic nature of language models."
  },
  {
    "id": 35527873,
    "timestamp": 1681232250,
    "title": "The Best Pens for 2023: Gel, Ballpoint, Rollerball, & Fountain Pens",
    "url": "https://www.jetpens.com/blog/The-42-Best-Pens-for-2023-Gel-Ballpoint-Rollerball-and-Fountain-Pens/pt/974",
    "hn_url": "http://news.ycombinator.com/item?id=35527873",
    "content": "JetPens has released a guide called \"The 42 Best Pens for 2023,\" featuring gel, ballpoint, rollerball, and fountain pens. The guide categorizes pens by various features like color, style, and function. The guide also includes samplers, refills, accessories and art supplies. JetPens is offering free shipping on orders over $35, exclusive bundles, and other sets for beginners or experts. The website also offers curated collections of pens, curated by the staff's top picks, and features sections covering guides, trends, and comparisons. JetPens provides various types of stationery for all occasions and preferences, making it a one-stop-shop for everything stationery.",
    "summary": "JetPens has released a comprehensive guide named \"The 42 Best Pens for 2023,\" consisting of various categories of pens. The guide includes samplers, refills, accessories, and art supplies, along with curated collections of pens, trends, comparisons, and top picks for users' convenience. Additionally, JetPens offers free shipping on orders over $35 and an extensive range of stationery, making it a one-stop-shop for all stationery needs.",
    "hn_title": "The Best Pens for 2023: Gel, Ballpoint, Rollerball, and Fountain Pens",
    "original_title": "The Best Pens for 2023: Gel, Ballpoint, Rollerball, and Fountain Pens",
    "score": 205,
    "hn_content": "Jetpens, a trustworthy source for stationery information and products, is the future of online specialty stores. Customers are assured of what they are ordering as Jetpens does not commingle goods, unlike Amazon. Jetpens's organization of notebooks in various sizes, among other things, increases the likelihood of customers buying something. The comments section contains mostly product and website reviews. Fountain pens are recommended for people who have had issues with hand pain and ballpoints. Switching to fountain pens helps improve writing quality and reduce hand pain.Tech-savvy users on Hacker News are discussing fountain pens and sharing tips for left-handed writers. Recommendations include Pilot Vanishing Point and Lamy 2000. JetPens is praised for its site, guides, and information with users suggesting it adds Apple Pay or other payment options. Pentel EnerGel earns high marks for lefties, but Pilot G2 also gets some love. Some users recommend placing fountain pen tips in boiling water, but others suggest using refills to prolong ink shelf life. Discussions on fountain pens, gel pens, and other writing materials are sparking more interest among readers.The post contains various comments on preferred writing tools, including fountain pens, mechanical pencils, and inexpensive options like BIC Cristal pens. One user recommends Sharpie S-gel metal pen bodies with Pentel Energel refills, and another suggests a Rhodia notebook to pair with a quality pen. Some users share their experiences with fountain pens, including issues with ink leakage and the need for extensive cleaning. The post emphasizes the importance of the tactile experience and aesthetics of writing tools, particularly for experts in the field. It also highlights the popularity of Pilot Metropolitan and TWSBI GO fountain pens among users.A recent Hacker News article features a list of the 42 best pens for 2023, featuring options for both right and left-handed writers. Uniball 207 is recommended to prevent check washing fraud, while LAMY ST Steel Fountain Pen, Kaweco, Uni-ball Signo 207 Plus+, and Pentel EnerGel Alloy Gel Pen are highly rated. Fountain pens such as Parker, Pilot Vanishing Point, and Pilot Kakuno also make the list. The article emphasizes the importance of ink choice and quick-drying properties for left-handed writers. In addition, the article features recommendations from users, including Pentel Kerry, Tombow Mono Stick Eraser, Uni-Pin brush, and Aen Arts gel set.",
    "hn_summary": "Jetpens is considered a reliable source for stationery products, praised for its organization and lack of commingling goods. The comments discuss recommendations on writing tools, including fountain pens that decrease hand pain and improve writing quality, as well as suggestions for left-handed writers. The post highlights the importance of aesthetic and tactile experiences for writing tools and lists the top pens for 2023, including options for both right and left-handed writers."
  },
  {
    "id": 35530289,
    "timestamp": 1681241744,
    "title": "Htmx 1.9.0 has been released",
    "url": "https://htmx.org/posts/2023-04-11-htmx-1-9-0-is-released/",
    "hn_url": "http://news.ycombinator.com/item?id=35530289",
    "content": "</> htmx ~ htmx 1.9.0 has been released!</> htmxdocsreferenceexamplestalkessaysSearchhtmx 1.9.0 has been released!htmx 1.9.0 ReleaseI’m happy to announce the 1.9.0 release of htmx.New FeaturesSupport for view transitions, based on the experimental View Transitions APIcurrently available in Chrome 111+ and coming to other browsers soon.Support for “naked” hx-trigger attributes, where an hx-trigger is present on an elementthat does not have an hx-get, etc. defined on it. Instead, it will trigger the new htmx:triggered event, which canbe responded to via your preferred scripting solution.Support for generalized inline event handling via the new hx-on attribute, which addressesthe shortcoming of limited onevent properties attributes in HTML.Improvements & Bug fixesThe htmx website has been migrated from 11ty to zola by @danieljsummers, cuttingway down on the number of “development” javascript dependenciesA memory leak fix by @croxtonThank you to everyone who contributed, and enjoy!haiku      javascript fatigue:      longing for a hypertext      already in hand     docsreferenceexamplestalkessays@htmx_org",
    "summary": "Htmx has released version 1.9.0, featuring support for view transitions and generalized inline event handling. The update also includes bug fixes and improvements, including a migration to zola, reducing the number of development dependencies. Htmx is a hypertext-driven application for modern web development.",
    "hn_title": "Htmx 1.9.0 has been released",
    "original_title": "Htmx 1.9.0 has been released",
    "score": 200,
    "hn_content": "Htmx 1.9.0 has been released | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Htmx 1.9.0 has been released (htmx.org)200 points by vyrotek 6 hours ago | hide | past | favorite | 40 comments   recursivedoubts 5 hours ago        | next [–] this will probably get nuked since it's just a point release (no hard feelings dang), but there is an interesting new feature: it now has View Transitions support, an experimental browser feature available in Chrome 111+ that makes visual transitions between DOM states much easier to animate.I discuss it in an essay here:https://htmx.org/essays/view-transitions/Chrome's docs on the feature are here:https://developer.chrome.com/docs/web-platform/view-transiti...MDN:https://developer.mozilla.org/en-US/docs/Web/API/View_Transi...will be exciting to see this feature rolled out across the major browsers, as it will make vanilla HTML a lot smoother. reply  udbhavs 38 minutes ago        | parent | next [–] This seems like a big leap forward for web apps! Proper view transitions are one of the biggest gaps in usability and perceived smoothness between web and native/Flutter apps at the moment. reply  afraca 2 hours ago        | parent | prev | next [–] I was curious about Mozilla's stance on the API. They have a GH issue for it:https://github.com/mozilla/standards-positions/issues/677but it's not finalized yet. View the very interesting dashboard here:https://mozilla.github.io/standards-positions/ reply  rmorey 1 hour ago        | root | parent | next [–] WebKit in a similarly undecided position: https://github.com/orgs/WebKit/projects/1?pane=issue&itemId=... reply  clairity 4 hours ago        | parent | prev | next [–] neat stuff!you have a typo on that page under https://htmx.org/essays/view-transitions/#the-css : @keframes instead of @keyframes reply  recursivedoubts 4 hours ago        | root | parent | next [–] thx, fixed! reply  smusamashah 2 hours ago        | prev | next [–] Why is it slow? For example in https://htmx.org/examples/click-to-edit/ and https://htmx.org/examples/edit-row/ when I click the edit button, there is a noticeable delay between click and appearance of editable boxes.I don't see any network requests being sent. reply  recursivedoubts 18 minutes ago        | parent | next [–] all the demos use a mock ajax request library (sinon) so we don't have to run a serveri intentionally introduced an 200ms delay so that you can see things like request indicators:https://github.com/bigskysoftware/htmx/blob/master/www/stati... reply  sli 2 hours ago        | parent | prev | next [–] It seems to just be a simulated delay and should probably mention that if that's the case. Running the first example locally does indeed attempt to send a network request when clicking the edit button. reply  ye-olde-sysrq 4 hours ago        | prev | next [–] I know this is tangential but I was trying to decide what I wanted to use to make an app that could be accessed from android, ios, and desktop in a convenient way. I am not a fan of how churny the js world is, and I come from a background in Swing/Qt/GTK/etc desktop development.I evaluated HTMX as a not-js way to do modern web apps. It was fine, it was certainly interesting. I had some concern about how much pain I would be in for when I inevitably wanted to borrow something from the js ecosystem, like a charting library or something.I actually ended up deciding on godot with gdscript and while I'm not done yet, I'm having a pretty dang good time. I'm a little annoyed that I have to pay apple to get it on iOS, but I have to pay apple anyway because safari is such an annoying odd one out from how firefox and chrome's renderers work. It's always safari that has weird things it doesn't like, in my experience. And I have hope that either Epic Games or Europe will manage to force Apple to let people sideload apps. reply  somethoughts 3 hours ago        | parent | next [–] From what I could tell the sweet spot for HTMX would be much more targeted at adding some JS magic to an existing backend server based web app (i.e. Django, Flask, Rails) where the developer primarily is a Python/Ruby, HTML/DOM and database expert and doesn't want to get bogged down into supporting a full fledged frontend like React, Angular, etc. to add some UX flair to their mostly CRUD based app.Native apps (i.e. iOS, Android, MacOS) purely in HTMX is probably not its sweet spot. Probably Electron (or Godot) would be better. reply  recursivedoubts 3 hours ago        | root | parent | next [–] there is a really neat mobile-native hypermedia called HyperView:https://hyperview.org/which is discussed in depth in our book:https://hypermedia.systems/book/hyperview-a-mobile-hypermedi... reply  hokumguru 2 hours ago        | root | parent | prev | next [–] Turbo is pretty similar to htmx and Turbo iOS produces some stellar experiences https://github.com/hotwired/turbo-ios reply  Takennickname 4 hours ago        | parent | prev | next [–] Doesn't godot refresh the entire screen at X fps? That would kill battery life, no? Asking cuz I considered this route before but decided against it for battery and app loading time reasons. reply  DisownedWheat 3 hours ago        | root | parent | next [–] Godot does have a low CPU mode that limits screen refreshes until something is interacted with on screen or animated, it's what the actual editor uses. I'm not sure whether it works on web exports though. reply  boterock 3 hours ago        | root | parent | prev | next [–] godot ticks at that rate, but if you don't transform UI things, they don't get redrawn.so maybe the framebuffer is switched every frame, but draw calls shouldn't be reissued unless needed.also, I think it is possible to make it not tick from time updates, but only from input event updates, or maybe an animation actually running. similar to what the editor does. reply  riwsky 2 hours ago        | parent | prev | next [–] I would be much more comfortable with the Epic Games App Store if they just let me pay to submit my app instead of micropurchase a bunch of loot boxes hoping for a submission crystal. reply  PaulHoule 3 hours ago        | parent | prev | next [–] I am using d3.js inside an htmx app with no problems. reply  jonathan-adly 3 hours ago        | prev | next [–] If you are on the fence about using htmx in production. my startup[0] uses it exclusively for our frontend (with like 2 lines of hyperscript. It’s sister library). No complaints and boy, it’s such a fresh breath of increased productivity and still excellent user experience.We still had to build an API anyway for external organizations using our product, but you still skip a ton of unnecessary JS code.0. GalenAI.co reply  summarity 2 hours ago        | parent | next [–] Same, using it for https://findsight.ai (combined with Alpine). Backend is Nim & karax which makes HTML responses a breeze (fragments and full page). reply  powersnail 2 hours ago        | parent | prev | next [–] What's the back-end? Do you generate those HTML responses via a normal template engine, or is there some sort of deeper integration with HTMX on the backend? reply  jonathan-adly 2 hours ago        | root | parent | next [–] It’s Django.. request data in, html response out. That’s all what you need :) reply  raihansaputra 1 hour ago        | root | parent | next [–] How do you handle template and fragments? any libraries/usage patterns you use to integrate django <-> htmx? reply  schemescape 3 hours ago        | prev | next [–] Anyone planning to make a browser with native support for HTMX (instead of a full JavaScript runtime)?I only ask because I kind of wish such a thing existed.I still can’t find a happy medium between no JS and “browser as an entire OS”. reply  recursivedoubts 3 hours ago        | parent | next [–] my hope is that, at some point, the browser developers notice htmx and decide to fold its functionality into HTML itself, which is where most of this stuff belongs reply  seumars 2 hours ago        | prev | next [–] What's the consensus on using custom HTML attributes such as \"hx-post\", \"hx-trigger\" and so on, which are \"invalid\" according to the spec? I don't mind prepending data- to custom attributes but it's still a minor nuisance. reply  synergy20 2 hours ago        | prev | next [–] as an embedded developer, CSR+SPA is the default way to do it these days, my embedded board(with limited resources that can not run python/django/etc) only needs to provide some json data but htmx expects backend spits out html.Not sure if it's possible for htmx to work with haserl or some c-based cgi or even lua-based lightweight web framework, I guess it could, just not popular so nobody did it. reply  olodus 1 hour ago        | parent | next [–] If I am not mistaken, last time I looked at it I think I saw that HTMX has the ability to declare handlers. So that if you instead want to provide Json, one of those handlers could transform/handle it client-side. I think, haven't tried it myself. reply  JoshWVS 3 hours ago        | prev | next [–] Woah--I stumbled upon \"Hypermedia Systems\"[0] from the View Transitions essay linked on this release page. If, like me, you're sympathetic to the htmx philosophy, but not really an expert, it looks like a great read. (And it's beautifully presented, too.)Seems it was discussed a few months ago[1]; I missed it then.[0]: https://hypermedia.systems/[1]: https://news.ycombinator.com/item?id=34134545 reply  benatkin 3 hours ago        | prev | next [–] Does it play nicely with custom elements and the shadow DOM? reply  kerkeslager 6 minutes ago        | parent | next [–] It's a bit of an aside, but what do you get from the shadow DOM?I've given a real, honest effort to using the shadow DOM for a bunch of WebComponents and it just seems like it makes everything harder for no benefit that I've been able to find. Every example I've found of WebComponents using the shadow DOM seems to show many many lines of weirdly-inverted HTML (templates/slots) and JavaScript, all to achieve what I can do in a few \"document.creatElement\"s (vanilla JavaScript) that are easier to understand. And using the shadow DOM means my global CSS styles don't apply to what I do there without absurd hacks.I have honestly been looking for a benefit here, but I just don't see it. What am I missing? reply  djbusby 3 hours ago        | parent | prev | next [–] I'm using a combination of RiotJS and HTMX. But RiotJS isn't exactly shadow DOM. reply  recursivedoubts 3 hours ago        | parent | prev | next [–] as far as I understand, it does a visual snapshot of the DOM, so it should work w/ custom elements just fine reply  canadianfella 2 hours ago        | root | parent | next [–] What is a visual snapshot of the DOM? reply  sdze 3 hours ago        | prev | next [–] Fantastic update. Also, I can't wait for Hyperscript to get to its maturity (1.0). ;) reply  durpkingOP 4 hours ago        | prev | next [–] Where might I find a red cap that says \"Make apps HTML again\"? reply  squidsoup 3 hours ago        | prev [–] Htmx has such an old man yells at cloud vibe. People don't like fat js clients because of \"view transitions\", they like the developer experience, composability of components, and benefitting from a vibrant ecosystem that is constantly innovating. reply  mdavidn 2 hours ago        | parent | next [–] I despise JS clients because I hate waiting for the entire thing to download and initialize every time I visit a site to make a quick change. Looking at you, Hello Fresh. reply  squidsoup 2 hours ago        | root | parent | next [–] Most popular js frameworks support SSR - it isn't appropriate to use an SPA for a public app like Hello Fresh, that's on them. reply  zhte415 1 hour ago        | parent | prev [–] I just like the user experience coupled with a dead simple development experience. Simple CRUD webapps, which is a lot of things, don't need unique user experiences; oftentimes the less unique the better. replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Htmx 1.9.0 has been released with View Transitions support, an experimental browser feature available in Chrome 111+. This feature will make vanilla HTML a lot smoother but comes with a noticeable delay. Users see htmx as a solution for adding some UX flair to mostly CRUD based apps, and the hope is that the browser developers will notice htmx and decide to fold its functionality into HTML itself, which is where most of this stuff belongs."
  },
  {
    "id": 35526401,
    "timestamp": 1681226468,
    "title": "The Coming of Local LLMs",
    "url": "https://nickarner.com/notes/the-coming-of-local-llms-march-23-2023/",
    "hn_url": "http://news.ycombinator.com/item?id=35526401",
    "content": "The Coming of Local LLMs - Nick ArnerNick ArnerThe Coming of Local LLMsPosted at — Mar 23, 2023While there’s been a truly remarkable advance in large language models as they continue to scale up, facilitated by being trained and run on larger and larger GPU clusters, there is still a need to be able to run smaller models on devices that have constraints on memory and processing power.Being able to run models at the edge enables creating applications that may be more sensitive to user privacy or latency considerations - ensuring that user data does not leave the device.This also enables the application to be able to always work without concerns over server outages or degradation, or upstream provider policy or API changes.LLaMA Changes EverythingRecently, the weights of Facebook’s LLaMA model leaked via a torrent posted to 4Chan. This sparked a flurry of open-source activity, including llama.cpp. Authored by the creator of whisper.cpp, it quickly showed that it’s possible to get an LLM running on an M1 Mac:Soon, Anih Thite posted a video of it running on a Google Pixel 6 phone. It was incredibly slow, at 1 token per second, but it was a start.The next day, he posted a new video - showing it running at 5 tokens a second.Artem Andreenko soon was able to get LLaMA running on a Raspberry Pi 4:Kevin Kwok created a fork of llama.cpp that included an add-on for a Chat-GPT style interface:And finally, yesterday, he posted a demonstration of Alpaca running on an iPhone:Consumer Electronics Companies and LLMsWith the rapid advances being made for running local LLMs in the open source community, the question is bound to be asked - what is Apple doing? While Apple does have significant ML capabilities and talent, a look at their ML Jobs Listings does not indicate they are actively hiring for any LLM projects. The cream of the crop of expertise in LLM’s are at OpenAI, Anthropic, and DeepMind.Apple is generally always late to deploying big technological advancements into their products. If and when Apple does develop on-device LLM capabilities, it could either arrive in the form of CoreML models that are embedded in individual apps and come with different flavors; such as summarization, sentiment analysis, and text generation.Or, alternatively, they could deploy a single LLM as part of an OS update. Apps could then interact with the LLM through system frameworks, similar to how the Vision SDK works.This, to me, seems the more likely of the two approaches - both to be sure that each app on a user’s phone does not embed their own, large model bundled with them, and - more importantly - that would allow Apple to have a much more capable version of Siri.It’s incredibly unlikely that Apple will ever license the use of LLMs from outside parties like OpenAI or Anthropic. Their strategy is much more the style of either building it all in-house, or to acquire small startups that they integrate into their products. This is what happened with the Siri acquisition.One consumer electronics company that isn’t shy about having a partnership with OpenAI is Humane. They recently announced a $100M Series C round of financing. While still in stealth, they’re widely considered to be a laser-projector based AR wearable. Such a device would surely have major constraints on power, due to the nature of the laser projector. This would probably have a major restriction on running an embedded LLM, at least in their first version.As part of their fundraising announcement, they did disclose that they’re partnering with several companies, including OpenAI. My guess is that they’re going to use a combination of Whisper and GPT4 for some kind of personal assistant as part of their hardware product. While Whisper has been shown to be quite capable of running on-device, it will probably be some time until a powerful language model will be able to do so in production.Closing ThoughtsI think we’re going to eventually see a demo showing an open source model running on an iPhone as well. I don’t have intuition as to how long it will take until we start seeing these models being baked into production apps, and eventually, into the OS’s themselves. I do anticipate this to eventually happen, opening the door to extremely personal and personalized ML models that we will carry with us in our pockets - having intelligent assistants with us at all times.If you’re doing work in the area of local LLMs, particularly ones that may be able to run on phones or other embedded devices, please reach out.Further ReadingLarge language models are having their Stable Diffusion momentYou can now run a GPT-3-level AI model on your laptop, phone, and Raspberry PiInference at the edge© Copyright Nicholas Arner, 2022 |",
    "summary": "Despite advances in large language models (LLMs) trained on larger GPU clusters, there is still a need for running smaller models on devices with memory and processing power constraints. Local LLMs enable applications that are more sensitive to user privacy and latency considerations, as well as ensure it always works without server outages or changes in upstream provider policies or APIs. Advances in open source communities for running LLMs locally means consumer electronics companies are likely to incorporate the technology into their products, but Apple may be late to the game as they are not actively hiring for any LLM projects in their ML job listings.",
    "hn_title": "The Coming of Local LLMs",
    "original_title": "The Coming of Local LLMs",
    "score": 200,
    "hn_content": "A new article on Hacker News discusses the growing accessibility and importance of Local LLMs, which have the potential to make productivity improvements by giving anyone who can use a spreadsheet the power of local LLMs; the ability to create custom browser plugins can now be done much more efficiently, cutting down on low quality commentary and filtering out spam; an LLM as a general purpose classifier can have a major impact on elevating online discourse from potential low quality comments, although there are risks and issues with potentially sloppy use of them; and finally, ease of use will be the key factor in driving adoption of these new technologies.A user on Hacker News shares their experience using ChatGPT to automate their paperwork, resulting in a significant reduction in time spent on tasks. The user emphasizes the ease of use and accessibility of the tool for those without programming abilities. Another user discusses the potential for consumer-grade coprocessors to incorporate attention layers and make ultra-low-precision transformer layers more compute- and memory-efficient on consumer devices. Some comments discuss the limitations of attention scaling in practice, while others suggest alternative approaches. A discussion emerges around the merits and limitations of LLAMA and its variants as compared to ChatGPT.A thread on Hacker News discusses the potential for open-source models to democratize access to LLMs, leading to excitement among enthusiasts. However, some users question the feasibility of companies sharing the models for free or working on open-source projects due to risks from regulators and politicians. Others raise questions about the capability of LLMs developed through open-source models, and the limitations of current capabilities to respond to complex queries. Users point out, however, that the models are still valuable testing tools for creativity, thought, and knowledge exploration, despite the limitations.Comments on Hacker News discuss the limitations and benefits of local language model (LLM) training and inference. Alpaca, Alpaca-LoRA, and LLaMA models are mentioned, with some users considering them underwhelming compared to more advanced models like ChatGPT. Hardware requirements and GPU concerns are also discussed, with some users recommending cloud training over personal GPU purchases. Additionally, users mention the potential for more advanced LLM models on mobile devices, though there is some debate around the feasibility of this. Finally, there is some discussion around the claim that the LLaMA model weights were leaked to the public, with some users clarifying that researchers were able to gain access by request.Apple is potentially entering the NLP space which requires machines to understand human language. Although Apple has a focus on tangible products, they have many job listings for NLP related positions. Hacker News users have mixed opinions about whether Apple is truly behind in ML technologies. The use of local LLMs, while removing data protection problems, can open the door for malicious use on a larger scale. While GPT-4 operates entirely in secret, there are alternative multimodal options available. An individual is running a 7B model on an M1, and tinygrad has an available option to run on Apple's neural cores/GPU cores to even more accelerate the process.",
    "hn_summary": "Hacker News users discuss the accessibility and potential productivity improvements of Local LLMs, as well as concerns and risks associated with their use. There is also discussion around ChatGPT, open-source models, hardware requirements, and Apple's potential entry into the NLP space, as well as debates around the limitations and feasibility of current LLM models."
  },
  {
    "id": 35521846,
    "timestamp": 1681197195,
    "title": "FreeBSD 13.2",
    "url": "https://www.freebsd.org/releases/13.2R/relnotes/",
    "hn_url": "http://news.ycombinator.com/item?id=35521846",
    "content": "The FreeBSD 13.2-RELEASE notes summarize changes made to the Free BSD base system on the 13-STABLE development line; the document lists applicable security advisories and significant changes to the FreeBSD kernel and userland. Binary upgrades between snapshot releases of FreeBSD and other systems are supported; source-based upgrades from previous versions are also supported. The",
    "summary": "FreeBSD 13.2-RELEASE notes detail updates to the FreeBSD kernel and userland, including security advisories and changes on the 13-STABLE development line. Both binary and source-based upgrades are supported.",
    "hn_title": "FreeBSD 13.2",
    "original_title": "FreeBSD 13.2",
    "score": 198,
    "hn_content": "FreeBSD 13.2, the latest version of the popular operating system, has been released, and various users have provided their feedback. Some users praised FreeBSD's modular design and the ability to boot directly to a console and run a GUI if necessary, while others cited the system's relative simplicity, well-defined userland hierarchy, and excellent documentation as reasons to choose FreeBSD over Linux. ZFS being built into the base system, as well as Jails, were some of the features that made FreeBSD stand out as a server OS. However, the site also makes mention of some of the challenges that come with running FreeBSD as a desktop OS, including issues with drivers and compatibility with software ecosystems.Users discuss their experiences with using FreeBSD on their desktops, noting that while it has improved over the years, it still has some issues with drivers, particularly for modern hardware. However, users appreciate the system's stable, rolling packages, excellent documentation, and useful features such as ZFS on root and the ports collection. Some users suggest trying other systems like Void Linux or Arch Linux, while others advocate for immutable distros like Silverblue/Kinoite on top of Arch Linux. The lack of modern WiFi support is a downside, and users are hoping for better support in the future.Multiple users on a thread discuss their preference for FreeBSD over Linux on their desktop computers, citing reasons such as better documentation, simpler configuration, ZFS support, and lack of systemd. Some users also mention that Linux distros feel clunky or unstable due to multiple updates and corporate involvement, while FreeBSD feels solid and supportive. However, some users also note that FreeBSD may not have full support for CUDA and other proprietary software commonly used in machine learning. Overall, the thread offers a nuanced discussion of the pros and cons of using FreeBSD over Linux on desktop computers.",
    "hn_summary": "FreeBSD 13.2 has been released, and users praise its modular design and ability to run a GUI if necessary, as well as features such as ZFS built into the base system, making it stand out as a server OS. However, users note that running it as a desktop OS may have issues with drivers and compatibility with software ecosystems, but appreciate its stable packages, excellent documentation, and useful features. Some users prefer FreeBSD over Linux on desktops due to better documentation, simpler configuration, lack of systemd, and solid support, although it may not have full support for proprietary software used in machine learning."
  },
  {
    "id": 35521345,
    "timestamp": 1681192437,
    "title": "YouTube suspends a YouTuber's Patreon-exclusive account for self-impersonation",
    "url": "https://twitter.com/craig1black/status/1645649300167495681",
    "hn_url": "http://news.ycombinator.com/item?id=35521345",
    "content": "",
    "summary": "YouTube has suspended a YouTuber's Patreon-exclusive account after accusing the creator of self-impersonation. The creator, known as YaBoiAction, states that he was using the account as a way to share exclusive content with his Patreon supporters and that YouTube's decision was unjustified. His supporters and followers have been left confused about the platform's actions and are questioning YouTube's policies.",
    "hn_title": "YouTube suspends a YouTuber's Patreon-exclusive account for self-impersonation",
    "original_title": "YouTube suspends a YouTuber's Patreon-exclusive account for self-impersonation",
    "score": 196,
    "hn_content": "YouTube has suspended a YouTuber's Patreon-exclusive account for self-impersonation. A user comments about their experience returning items to Amazon, including the disposal of perfectly good returns, which led to a debate about boycotting Amazon. Another user suggests taking legal action.An Amazon customer experienced difficulty in returning a pair of Apple AirPods where the company wanted a \"spurious return fee\" greater than the value of the items and destroyed them, despite mistakenly receiving the wrong box. Some readers expressed concerns about the industry's practice of unreliable decision-making over returned items and the lack of more efficient solutions such as AI integration. Nevertheless, others noted that Amazon still needs to service its number of customers despite fraud and abuse being somewhat unavoidable in e-commerce. OAuth, which grants permissions and access, was blamed for its overly broad scopes allowing apps to gather unnecessary details, however, some readers cautioned to read the permission details before granting access. YouTube's customer service has been criticized after multiple customer complaints, with some pointing out that they treat even paying customers poorly. Despite YouTube's success, and the fact that it caters to content creators who are its lifeblood, it seems to be harsh on them. Several well-known YouTubers have had their channels suspended, making it difficult for creators to diversify and become independent. Many point out that there is currently no alternative to YouTube, as no other company seems willing to take it on. The possibility of having a paid expedited customer service fee to review content is a solution to be considered.A YouTuber raises concerns about Google's lack of customer service, and shares that their channel was terminated without warning or explanation. Other users share their own stories of unfair treatment from large tech companies, highlighting the need for better support and appeal processes. Some suggest that companies prioritize profits over user experience and suggest legal action against such practices. One user points out that the scale of these companies and the number of active users make personal support difficult, while others argue that this should not excuse poor treatment of customers. Ultimately, it's suggested that solutions such as mandatory third-party appeal services may be necessary. One user updates that the YouTuber was able to get their issue resolved after sharing their experience on Hacker News.",
    "hn_summary": "YouTube suspended a YouTuber's Patreon-exclusive account for self-impersonation. Some criticize YouTube's poor treatment of paying customers and its harsh treatment of content creators. Others discuss concerns about Amazon's unreliable decision-making over returned items and suggest better solutions such as AI integration, while some point out the need for better customer support and appeal processes in large tech companies."
  },
  {
    "id": 35524023,
    "timestamp": 1681215129,
    "title": "KDE Plasma Widget for external monitor brightness adjustment",
    "url": "https://github.com/davidhi7/ddcci-plasmoid",
    "hn_url": "http://news.ycombinator.com/item?id=35524023",
    "content": "# KDE Plasma Widget for external monitor brightness adjustment![Screenshot](./screenshots/banner.png)## Setup### 1. Load the `i2c-dev` kernel moduleNote: Most kernel builds should include this module by default.Check if it is already loaded:`$ lsmod | grep i2c_dev`If it isn't, load it automatically on every boot:`$ echo i2c-dev | sudo tee /etc/modules-load.d/i2c-dev.conf`or load it once:`$ sudo modprobe i2c-dev`### 2. Install and configure **ddcutil**ddcutil is a commandline utility to control external monitors.This widget uses ddcutil to detect supported monitors and adjust their brightness.For additional details, refer to the great [ddcutil documentation](http://www.ddcutil.com/).Note that additional steps may be required if you are using a NVIDIA GPU, see [Special Nvidia Driver Settings](https://www.ddcutil.com/nvidia/) in the ddcutil documentation.Install the `ddcutil` from your distribution's repositories. ([Arch Linux](https://archlinux.org/packages/extra/x86_64/ddcutil/))By default, ddcutil can only be used the the root user.Little configuration is required to allow non-root users to use it:`$ sudo usermod -aG i2c `If the group `i2c` doesn't exit, create it first:`$ sudo groupadd --system i2c`Finally, you need to install a udev rule to allow members of the group `i2c` to access to i2c devices: `$ sudo cp /usr/share/ddcutil/data/45-ddcutil-i2c.rules /etc/udev/rules.d`Now, you can verify that ddcutil is working correctly:`$ ddcutil detect`The output should look something like that:```Display 1  I2C bus: /dev/i2c-9  DRM connector:      card0-DP-1  EDID synopsis:   Mfg id:        DEL - Dell Inc.   Model:        DELL S2721DGF   Product code:     XXXXX (0xXXXX)   Serial number:    XXXXXXXX   Binary serial number: XXXXXXXX (0xXXXXXXXX)   Manufacture year:   2022, Week: 35  VCP version:     2.1Display 2  I2C bus: /dev/i2c-10  DRM connector:      card0-DP-2  EDID synopsis:   Mfg id:        DEL - Dell Inc.   Model:        DELL U2417H   Product code:     XXXXX (0xXXXX)   Serial number:    XXXXXXXX   Binary serial number: XXXXXXXX (0xXXXXXXXX)   Manufacture year:   2018, Week: 22  VCP version:     2.1```### 3. Install the backend ###`pip install ddcci-plasmoid-backend `### 4. Install the widget itself ###````bash$ git clone https://github.com/davidhi7/ddcci-plasmoid.git$ cd ddcci-plasmoid$ kpackagetool5 --install plasmoid# or upgrade the plasmoid:$ kpackagetool5 --upgrade plasmoid````## History#### v0.1.3 2023-04-11* Add padding to widget title* Fix duplicate monitor detection (#1)* Expand debug output#### v0.1.2 2023-04-09* Fix KDE widget configuration not loading#### v0.1.1 2023-04-09First public release",
    "summary": "The article explains how to set up a KDE Plasma Widget for external monitor brightness adjustment using the `ddcutil` command-line utility. The setup involves loading the `i2c-dev` kernel module, installing and configuring `ddcutil`, installing the backend and the widget itself. The article also provides information on the history of the widget, including release notes.",
    "hn_title": "KDE Plasma Widget for external monitor brightness adjustment",
    "original_title": "KDE Plasma Widget for external monitor brightness adjustment",
    "score": 193,
    "hn_content": "A new KDE Plasma widget on GitHub allows for external monitor brightness adjustment on Linux, which has garnered significant interest on Hacker News with over 50 comments. Several users recommend additional Linux-compatible monitor control software, including clight, gddccontrol, and ClickMonitorDDC7.2 for more advanced use cases. Some users discuss the perennial problem of DDC and EDID non-standardization on monitors and the potential for kernel level support. Lunar, MonitorControl, and BetterDisplay are some of the Lunar alternative software options mentioned. While many early Linux monitor control apps were CLI-based, there is significant interest in apps that feature a pretty UI, keyboard shortcuts for changing brightness, and the ability to change multiple parameters, including contrast, RGB, volume, and more.Users on Hacker News are discussing how to control external computer monitors using DDC, which requires using i2c commands over HDMI but not DisplayPort. Several users have shared their own methods for controlling monitor settings, such as using specific Linux packages or scripting languages, and one user even created a database of monitors that support DDC control to aid others in finding compatible displays. However, controlling external monitors via DDC still poses limitations and can be a tedious process due to the lack of full functionality and compatibility with different devices.",
    "hn_summary": "A new KDE Plasma widget enables an external monitor's brightness adjustment on Linux, garnering over 50 discussion points on Hacker News. Users share their own methods and recommended Linux-compatible monitor control software, but DDC's lack of standardization presents limitations and tedious controls on compatible displays."
  },
  {
    "id": 35528956,
    "timestamp": 1681236876,
    "title": "GPT-4 gets a B on my quantum computing final exam",
    "url": "https://scottaaronson.blog/?p=7209",
    "hn_url": "http://news.ycombinator.com/item?id=35528956",
    "content": "Quantum computing will not solve hard problems instantly, according to Scott Aaronson, whose GPT-4 AI scored a B on an honors upper-level undergrad exam in quantum information science at UT Austin. Receiving a score of 73/100, Bryan Caplan and others have agreed this is an achievement in itself. Aaronson explains how the quantum circuits challenged GPT-4 but that it was strongest on true/false and conceptual questions. Students who struggle dropped the course before the end, however Aaronson said it was possible that fine-tuning or few-shot prompting with his other exams or lecture notes could boost GPT-4’s performance. Lattice-based cryptography winning the secure post-quantum public-key cryptography, and problems still being unsolvable in polynomial time are true, and density matrices always having eigenvalues in the [0,1] range is also true.A quantum circuit that prepares $\\ket{\\psi}$ from an all-0 initial state is described, consisting of several quantum gates and one $\\ket{\\psi}$ measurement. Engineering constraints, decoherence and noise, and cooling requirements make it practically impossible to speed up a quantum computation by increasing the energy scale of the Hamiltonian, even though it may be theoretically possible. HN users point out limitations on this as well as factors preventing the simulation of Simon's algorithm. Further questions are related to the order of the multiplicative group $\\mathbb{Z}_N^\\times$. One user provides a quantum solution to factorize $N=105$ into $3\\cdot 5 \\cdot 7$.",
    "summary": "Scott Aaronson's GPT-4 AI scored a B on an undergrad quantum computing exam, with strengths in true/false and conceptual questions, according to a blog post by Aaronson. Practical constraints make it difficult to improve quantum computing's performance despite its theoretical possibility, and HN users discuss related limitations and factors. A user provides a quantum solution to factorize $N=105$ into $3\\cdot 5 \\cdot 7$.",
    "hn_title": "GPT-4 gets a B on my quantum computing final exam",
    "original_title": "GPT-4 gets a B on my quantum computing final exam",
    "score": 186,
    "hn_content": "An HN user shares that while GPT-4 passing a difficult exam is impressive, there is still a need to be cautious about relying too much on AI. Some users question if GPT-4 may have had access to exam questions beforehand. Others debate whether AI can replace humans in various fields, with medical radiology being a point of discussion. ChatGPT was able to find an issue that a team of doctors and nurses missed. Ultimately, the discussion revolves around the limitations of AI and the importance of human oversight.A discussion on Hacker News centered around the use of AI in medicine, particularly image recognition and statistics being used as a first pass for pathologists. One user argues that AI could aid in catching cancer earlier, especially non-lump forming types. However, others express concerns about relying too heavily on AI, citing the need for human review and the potential for errors to compound. The conversation also touches on the use of AI in other fields and the importance of balance between AI and human input. Overall, the discussion highlights the potential benefits and risks associated with the increased use of AI in various industries.Experts on HN discuss the acceptance of autonomous vehicles, with some arguing that liability issues need to be solved before the technology is accepted by society. Others argue that even if autonomous vehicles are not perfect, they would still be a safer option compared to human-driven ones. The conversation is not limited to autonomous vehicles, with HN users discussing the remarkable progress made in AI technology, particularly in language processing. Some express amazement at how easy it is to interact with LLMs like GPT-4, while others remain skeptical of the technology's ability to judge literature on its artistic merits.A letter discussing the subject of Mount Analogue, its existence, and a potential expedition is translated from French to English by various sources including ChatGPT and GPT-4. The conversation between various users concludes that while GPT-4's translation is more literary, ChatGPT's is more functional, accurately translating with simple English requests. However, the limitations of machine translations and the nuances of language are noted. The letter itself speaks of a sense of stagnancy in the recipient's life, and a desire for adventure and exploration. The reader is called to respond, and to embark on a journey beyond the mundane.Learning a new language opens a new world of vocabulary, just like learning a new programming language. However, some think it is not worth the significant investment of time and money since it has little economic upside. Yet, being fluent enough to make a pun in a foreign language is wholly worth it. Machine translation has improved significantly but still has some limitations, such as difficulty recognizing sentence structures and idioms unique to a language. Nevertheless, using machine translation is faster than relying on someone's language skills, especially when doing mundane tasks such as filling out forms. While some remain skeptical about machine translation's ability to handle more complex translations, experts attest that GPT-4 can translate abstract concepts across multiple novels with considerable accuracy.Commentators on a recent Hacker News post debate the reliability of GPT-4's translation ability, with some users pointing out that the corpus includes training sets for some idioms and common phrases. Others argue that machine translation still cannot capture the nuance required to understand certain sentences or colloquialisms, as evidenced by a discussion of a Doctor Who episode that features a pun. True/false and multiple choice questions on exams are common, particularly in larger classes, sparking a debate on whether they are a lazy way of grading.ChatGPT, a chatbot using GPT-3, has passed an exam on quantum computing at the University of Texas at Austin, to widespread interest on Hacker News. While some pointed out the ability for both AI and humans to memorize and pattern match calculable problems, others questioned how AI will be certified if it certifies itself, while others saw its advance as evidence of the impact AI may have on jobs. Commentators observed that the AI could answer true/false questions and pattern-matching questions easily, but struggled with problems requiring longer calculations. ChatGPT's performance prompted many to think deeply about the trajectory and ultimate potential impact of AI.A new article on Hacker News discusses how GPT-4 has taken a final exam for a graduate Quantum Mechanics course and scored 64% correct, surpassing the scores of GPT-3.5-TURBO. The comments on the post discuss the limitations of GPT-4's capabilities, with some suggesting that it is superhuman in the amount of expert knowledge it possesses, but lacks reasoning skills to generate new knowledge. Others point out that the AI's ability to solve equations is not purely based on seeing the problem before, but rather on understanding the rules underlying the operations. Overall, the post highlights the progress in AI capabilities and the implications for human-computer interaction.Quantum computing and its associated complicated exams were discussed by experts on Hacker News. The quantum state of an n-qubit system is represented by a 2^n-dimensional complex unit vector, according to the initial post. The thread also touched on the difficulty of quantum computing exams, in addition to questioning whether AI co-pilots could be used in programming. The quality of exams, particularly those designed for LLMs, was also scrutinized. While some regarded the tests as insufficient measures of technical knowledge, others found some of the questions relatively easy and comfortably answered them.",
    "hn_summary": "GPT-4 gets a B on a quantum computing final exam, but discussions in the comments revolve around the limitations of AI and the need for human oversight. Users debate the use of AI in medicine, autonomous vehicles, and machine translations. While some express skepticism, others recognize the potential benefits and risks of increased use of AI. ChatGPT's performance prompts deeper consideration of the trajectory and potential impact of AI, highlighting progress in AI capabilities and the implications for human-computer interaction."
  },
  {
    "id": 35524328,
    "timestamp": 1681216849,
    "title": "Show HN: Skip the SSO Tax, access your user data with OSS",
    "url": "https://github.com/AccessOwl/open_owl",
    "hn_url": "http://news.ycombinator.com/item?id=35524328",
    "content": "# OpenOwl 🦉OpenOwl lets you download user lists including user permissions (and other additional data) from various SaaS applications without the need for a public API. This tool is commonly used to check for orphaned user accounts or as preparation for an access review.This project is made with IT Ops, InfoSec and Compliance teams in mind - no developer experience needed. The [`recipes.yml`](recipes.yml) lists all supported applications. You are welcome to contribute to this project by setting up additional vendor integrations.## How to run itSince OpenOwl uses various technologies running it with Docker is recommended. There are additional instructions if you want to run it directly.### Option 1: Shell Wrapper with [`Docker`](https://docs.docker.com/get-docker/) (Recommended)The Docker image is built automatically with the first launch.#### Show all available applications a.k.a recipes```bash./owl.sh recipes list```#### Step 1. Run `login` action Following is an example on how to use it with [`Mezmo`](https://www.mezmo.com/)Parameters like `OWL_USERNAME` and `OWL_PASSWORD` are passed via the environment variable.```bashOWL_USERNAME=someone@acme.com OWL_PASSWORD=abc123 ./owl.sh mezmo login```#### Step 2. Run `download_users` action```bash./owl.sh mezmo download_users```Depending on the application there might be additonal parameters required which will be listed after running the command. If that is the case, add the parameters and re-run the command.Example for additional parameters:In [recipes.yml](recipes.yml) you can see that there is a placeholder defined for Mezmo. Placeholders start with a `:` and look like this: `:account_id`. Depending on the recipe they are either passed as parameter or populated from other data (e.g. see Adobe). To pass the `:account_id` parameter, you prefix it with `OWL_` and upcase it. So `:account_id` becomes `OWL_ACCOUNT_ID`.```bashOWL_ACCOUNT_ID=YOUR_ACCOUNT_ID ./owl.sh mezmo download_users```### Option 2: Docker ComposeExamples:```bashdocker compose run owl recipes listdocker compose run -e 'OWL_USERNAME=YOUR_USERNAME' -e 'OWL_PASSWORD=YOUR_PASSWORD' owl mezmo logindocker compose run -e 'OWL_ACCOUNT_ID=YOUR_ACCOUNT_ID' owl mezmo download_users```### Option 3: Directly You can leverage the available [`.tool-versions`](.tool-versions) file to install requirements with [`asdf`](https://asdf-vm.com).```bashasdf install```Alternatively you can install the required Node, Elixir and Erlang version manually based on the version of the [`.tool-versions`](.tool-versions) file.Run it with:```bashmix run lib/cli.exs ```## How does it work?OpenOwl signs in like a regular user by entering username and password (RPA via Playwright). It then uses the SaaS' internal APIs to request the list of users on your behalf.This approach only works for SaaS applications with internal APIs. With the rise of single page apps (SPA) (think about React.js, Vue etc.), most applications can be supported. Besides SaaS applications this tool can also be used for internal apps.## Quick Demo## Known limitations1. User Account: The user account needs administrator rights (or a similar permissions that grants access to user lists).2. Login: Currently only direct logins via username and password are supported. Logins via SSO (Google, Okta, Onelogin,...) will be added in the future.3. Captchas: Login flows that include captchas are currently not supported.## How to contribute[Here](recipes.yml) is the list of available integrations. Open a PR to add further [recipes](recipes.yml), adjust existing ones or extend missing capabilities (like further pagination strategies) to support even more applications.When all the required capabilities exist, a further integration can take just 30m.### How to add a new vendor recipe1. Check that your intended SaaS application has an internal API.  1. Open the Developer Tools/Inspector of your favourite browser.  1. Navigate to the page that shows all users.  1. In your inspector filter by XHR requests and reload the page. When you find some that belong to the same domain like your tool, the application is probably supported.1. Use the Network tab in the inspector, find the request that includes your list of users with their permissions.1. Copy the request as `curl`-request and paste it into a tool like [Postman](https://www.postman.com/downloads/). You can import the request by clicking *Import*, selecting *Raw text* and pasting the copied `curl`-request.1. Execute the request in Postman and remove as many headers and parameters as possible to keep the request clean. Check that the request still works. Add the request to the [`recipes.yml`](recipes.yml).1. When you have many users in your SaaS account, you will not see all users at once but 10, 50 or 100. Adjust the pagination parameters and try to get all data by traversing through it. Check which [pagination strategy](lib/pagination_strategies/) applies and add it to your added recipe.1. Open the direct login page of the new vendor and find the right [selector](https://www.cuketest.com/playwright/docs/selectors) for the username and password field. Adjust the [`recipes.yml`](recipes.yml) accordingly.1. Test that the login flow works properly and the configured action.1. Open a PR.## Troubleshooting### Build Docker imageIn case the Shell Wrapper cannot build the Docker image as expected, try the following command to build the image manually:```bashdocker build -t open_owl-owl:latest .```## The history of OpenOwlKnowing who has access to your SaaS tools is often guesswork at best and manually adding and deleting user accounts is tedious and error prone. The fact that SCIM/SAML are often locked up behind an enterprise-subscription is adding to the frustration. That's why Mathias and Philip decided to build [AccessOwl](https://www.accessowl.io/), a tool to automate SaaS account provisioning for employees for any tool.OpenOwl is essentially an open-source version of the underlying technology of AccessOwl. It was created out of a discussion that having access to your own teams user data should be a basic right for anybody. No matter whether it's used for audits, to discover orphaned user accounts or run access reviews. That's why we decided to open source a core part of AccessOwl to let anybody read out crucial information out of their SaaS stack.",
    "summary": "OpenOwl is an open-source tool that enables one to download user lists and additional user data from various SaaS applications without the need for a public API. The tool is intended for IT Ops, InfoSec, and Compliance teams and supports various applications, with users able to contribute to the project by setting up additional vendor integrations. Users may choose to run OpenOwl with Docker or install the required Node, Elixir, and Erlang version manually.",
    "hn_title": "Show HN: Skip the SSO Tax, access your user data with OSS",
    "original_title": "Show HN: Skip the SSO Tax, access your user data with OSS",
    "score": 184,
    "hn_content": "OpenOwl, an open-source tool developed by a former Insurtech and Fintech startup CTO, lets users automatically download user data from SaaS tools, forgetting the limitations on access to APIs and SSO pricing; currently, it covers only 7 SaaS vendors and is limited to non-SSO login flows, however, its \"recipes\" feature allows anyone to add new integrations; comments suggest that SSO taxation refers to excessive pricing for SSO integration on the vendor's product, although it usually comes bundled with enterprise plans, which often can be negotiated down; some users point out that OpenOwl is a great solution for companies that don't want to pay for enterprise pricing or deal with SSO taxation.OpenOwl, an open-source project, allows users to conduct \"money-leak-hunting\" for Y Combinator portfolio companies and beyond. While users are calling for clarification on its SSO, OpenOwl was built with ease of use in mind, allowing it to be used by non-developer IT admins. Users suggest combining multiple distinct problems, such as the \"SSO is expensive\" problem, the \"access user data\" problem, \"centrally manage permissions\" problem, and \"automatic account provisioning/deprovisioning\" problem, which OpenOwl aims to support. Future versions are set to offer secure login flow solutions, including enabling Google SSO sign-in with 2FA enabled, making it more attractive to all users.A new tool called Resmo aims to reduce the Single Sign-On (SSO) tax that is usually bundled with third-party SSO, SCIM and SAML. Resmo integrates with 80+ of the most popular tools, and only three of them require the paid-tier for API access. A Resmo user can list and manage the users and their permissions centrally in one place, and they can quickly find the data they require by utilizing the SQL command. While small businesses are increasingly using SSO, many software solutions are still charging way too much money as \"enterprise\" pricing, effectively holding security hostage. Resmo's solution to this issue is providing an affordable tool for both small and large businesses.The cost of SSO is often unfairly high due to enterprise plans with added features, resulting in a significant price increase for those who only want SSO. SaaS vendors often do not include prices on their website as software integration typically requires consulting and bespoke development. While SSO is orders of magnitude easier to implement and enforces better security practices, many customers do not enjoy implementing it as a policy. The cost of SSO is often subsidized by commercial customers, and adding necessary features can cause a significant increase in the price of the service.",
    "hn_summary": "Former Insurtech and Fintech CTO has developed OpenOwl, an open-source tool allowing users to download user data from SaaS tools to avoid SSO pricing limitations; while currently only covering 7 SaaS vendors, OpenOwl allows users to add new integrations. Resmo is another tool aimed at reducing the high cost of SSO, integrating with over 80 popular tools and centralizing user management, with an affordable option for small and large businesses; the cost of SSO is often unfairly high due to enterprise plans with added features, but SSO implementation enforces better security practices."
  },
  {
    "id": 35526648,
    "timestamp": 1681227454,
    "title": "Make Something Wonderful – Steve Jobs in his own words",
    "url": "https://stevejobsarchive.com/book",
    "hn_url": "http://news.ycombinator.com/item?id=35526648",
    "content": "Make Something Wonderful | a book from the Steve Jobs ArchiveSkip to contentHomeMake Something WonderfulSteve Jobs in his own wordsA curated collection of Steve’s speeches, interviews and correspondence, Make Something Wonderful offers an unparalleled window into how one of the world’s most creative entrepreneurs approached his life and work. In these pages, Steve shares his perspective on his childhood, on launching and being pushed out of Apple, on his time with Pixar and NeXT, and on his ultimate return to the company that started it all.Featuring an introduction by Laurene Powell Jobs and edited by Leslie Berlin, this beautiful handbook is designed to inspire readers to make their own “wonderful somethings” that move the world forward.Read nowAlso available on Apple Books, from participating libraries via the Libby app, or by downloading the file for your e-reader.Subscribe for updates from the Archive.Sign up for the newsletterBookExhibitPrivacy PolicyTerms & Conditions© Steve Jobs Archive 2023Steve Jobs ArchiveHome",
    "summary": "Make Something Wonderful is a book from the Steve Jobs Archive that includes a collection of his speeches, interviews, and correspondence. The book features an introduction by Laurene Powell Jobs and is edited by Leslie Berlin. It aims to inspire readers to create something innovative that will impact the world.",
    "hn_title": "Make Something Wonderful – Steve Jobs in his own words",
    "original_title": "Make Something Wonderful – Steve Jobs in his own words",
    "score": 178,
    "hn_content": "An HN user shares their personal experience of people's emotional reactions to Steve Jobs' passing, highlighting his impact on not just technology but people's lives. Stallman's role in free software is pointed out by another user, but Jobs is acknowledged for his knack in understanding what appeals to the masses and forming teams that execute his vision effectively. A conversation is sparked about the never-ending search for progress and the inherent dissatisfaction in humans, but the importance of using one's own preferences as a guide in design is raised. Finally, the value of taking advice from experts in their field is discussed.An HN discussion on Steve Jobs, healthcare advice, and the value of his contributions to the tech industry. Some commenters question Jobs' expertise in healthcare and the extent to which his talent can be attributed to making a lot of money. Others argue that Jobs' passionate leadership and taste for aesthetics, along with his willingness to assemble and retain top talent, were the driving forces behind his success. The discussion also touches on the importance of good taste and design in technology, and the idea that technical brilliance and design can coexist. Overall, the discussion highlights the complex nature of evaluating the worth of a figure like Steve Jobs.HN users discuss the value of design in UI, with some arguing that button design and visual indicators of function are essential for good UI, but others disagreeing; some users praise HN's design for placing function over form and being built for human use rather than designed by non-users with trendy elements; users compare Steve Jobs' design approach to CEOs at modern companies and generally find the latter lacking; finally, one user argues that Jobs' products were amazing because he prioritized the user's needs and found ways to eliminate user annoyance by paying keen attention to details.The post discusses Steve Jobs and his impact on technology, specifically his leadership and marketing skills. Some comments discuss his ability to wait until the technology was ready to release a product. Other comments mention his prescience and vision for the future. While some criticize his management style, overall, he is seen as a pivotal figure in the technology industry. There are mentions of his impact on innovation and design, and a few users share resources for learning more about his contributions to the field.Steve Jobs' impact on the world was due to his creative genius and skillset in marketing, storytelling, and design, providing accessible user-friendly products. An HN user referred to the \"Three Types of Specialists Needed for Any Revolution,\" outlining the importance of a team consisting of a genius, a highly intelligent individual, and someone who can explain complicated ideas well. Jobs was noted to have started at the third type and worked his way up to become a second type, which aided him in attracting and retaining first type specialists. Comparisons were made to other successful innovators, such as Edison. Not everyone uses Apple products, but Jobs' impact was still undeniably significant.",
    "hn_summary": "An HN user shares emotional reactions to Steve Jobs' impact on people's lives beyond technology, while acknowledging his ability to form effective teams. HN users discuss Steve Jobs' complex impact on technology, debating his skills in healthcare and acknowledging his leadership and marketing skills. Some HN users praise UI design as essential for good user experience, and others credit Jobs' attention to detail for his amazing products. Jobs' creative genius, marketing skills, and team-building abilities are noted as important factors in his impact on the industry, along with his prioritization of user-friendly design."
  },
  {
    "id": 35532479,
    "timestamp": 1681251945,
    "title": "Colorado passes agricultural Right to Repair",
    "url": "https://www.ifixit.com/News/73291/colorado-approves-first-ever-agricultural-right-to-repair-bill",
    "hn_url": "http://news.ycombinator.com/item?id=35532479",
    "content": "Colorado Approves First-Ever Agricultural Right to Repair Bill | iFixit News  Skip to main content Fix Your StuffJoin the CommunityStoreRight to RepairColorado Approves First-Ever Agricultural Right to Repair BillFarmers, Raise Your Wrenches!      Article by:      Elizabeth Chamberlain@liz_ifixitApril 11, 2023Filed under:     Activism,Legislation,Right to RepairAdd Comment  Share  Farmers have always been a fix-it-yourself kind of people. But when it comes to repairing their tractors and other agricultural equipment, they’ve been locked out of many kinds of repairs by manufacturers like John Deere. Equipment getting stuck in “limp mode” in the field at harvest time is not only expensive but demeaning and frustrating.But now, farmers in Colorado have reason to celebrate. Denver legislators have just passed the first-ever agricultural Right to Repair bill. Today’s landslide 44-16 vote on the reconciled bill in the House follows a successful vote in the Senate last month. The bill now moves to the governor’s desk.We’ve been raising the alarm and advocating for farmers for a decade. In the meantime, Deere and other major agricultural equipment manufacturers have worked ever harder to keep their repair monopolies, consolidating independent repair shops into larger and larger dealerships. This has left farmers with few options when it comes to fixing their equipment.Colorado is already a leader in the Right to Repair movement. Last year, they passed the first US Right to Repair bill since 2012, protecting Coloradans’ right to fix their own powered wheelchairs. Colorado’s fight for the Right to Repair is being waged by a broad coalition of groups, including Rocky Mountain Farmers Union, Colorado Cross-Disability Coalition, and CoPIRG.In January—the beginning of the legislative season—Deere and the American Farm Bureau Federation signed a Memorandum of Understanding (MOU), promising to give farmers access to some previously restricted repair materials. And on the very day of a critical hearing, Case IH and New Holland signed their own memorandum of understanding at the last minute, a desperate attempt to smother the bill. However, legislators determined that both MOUs were vague, incomplete, and unenforceable. Suspiciously, they also required that members of the American Farm Bureau Federation cease advocating for Right to Repair laws. But other farm groups in Colorado and beyond have continued to advocate on behalf of all farmers. Montana Farmers Union president Walter Schweitzer told PIRG, We could have a dozen pinky swears from a dozen tractor manufacturers, but we still wouldn’t have comprehensive repair materials. I’m running out of pinkies and I still can’t fix my damn tractor. —WALTER SCHWEITZER, Montana Farmers Union President Farmers have found that any repair that interfaces with the emissions control system on the tractor is likely to require a dealer mechanic to input a code to complete. And in many states, dealer mechanics are increasingly overburdened, as Deere has killed off smaller repair businesses. A PIRG investigation of agricultural repair market consolidation found that last year in Colorado, there were 1,437 farms per Deere dealership. No wonder farmers reported waiting as much as 8 weeks for repair service—an unacceptable delay when your crops are rotting in the field.But even before this bill passed, the antitrust screws have been tightening: The US Department of Justice weighed in on a large class action lawsuit criticizing Deere’s monopolistic practices. Last year, Farm Action and other farm advocacy groups filed a complaint with the US Federal Trade Commission. Repair.org and PIRG advocates believe there’s irony in Deere’s argument that their repair restrictions are meant to follow the Clean Air Act—because Deere may be violating that very law by refusing to allow third-party repair. Meanwhile, hackers have been looking for ways around these restrictions. Last year at the hacker conference DefCon, security researcher Sick Codes demonstrated that he was able to get Doom running on a Deere console. Still, none of this movement against Deere has had the force of law. When the bill goes into effect on January 1, 2025, Colorado farmers will get the first chance to experience a post-monopoly world.Today’s bill passage should open the door for more independent repair options for farmers: Farmers, their hired mechanics, and local repair shops can get the parts, diagnostics, and documentation they need to make repairs.One critical step remains: a signature by Governor Polis, who has signaled that he supports the legislation.“For farmers, simply getting access to all the tools needed to fix their tractors has been a tough row to hoe. That makes this historic victory sweeter than summer corn,” said PIRG Right to Repair Campaign Director Kevin O’Reilly. “With this bill, Colorado legislators are giving their farmers the repair relief they deserve. But farmers across the country should know: This is just the start.”“Everyone who eats will benefit from this law. Farmers will have more timely options for repair, which will make it easier to use high-tech products which in turn enable more productive farms,” said Gay Gordon-Byrne, executive director of Repair.org. “It will also help align the industry of agriculture with other products using technology-enabled products such as motor vehicles, trucks, wheelchairs, and cell phones. We should all be able to fix everything, everywhere, all the time.”“This is a huge win for farmers in Colorado, who will now have more control over their own equipment and the ability to fix it themselves,” said Kyle Wiens, iFixit CEO. “iFixit has been fighting for our right to fix every thing we own for two decades. We’re thrilled to see this right extended to farmers in Colorado, and we expect that other states will follow suit.”To support Right to Repair legislation near you, find your state on Repair.org—or, if you’re outside the US, look for your country’s advocacy network here.Related StoriesRight to RepairDeere Promised Farmers the Right to Repair. Can We Trust Them?Consumer RightsWe Can’t Let John Deere Destroy the Very Idea of OwnershipRight to RepairPlaying Doom on a John Deere (And Why It Matters): Repair Roundup Week of August 14      0 Comments     Add CommentAdd Comment1024      Cancel     Post comment",
    "summary": "Colorado has passed the first-ever agricultural Right to Repair bill, allowing farmers to access the necessary tools, diagnostics, and documentation to repair their tractors and other agricultural equipment. The bill now awaits signature from Governor Polis and is expected to go into effect on January 1, 2025, providing farmers with more timely and productive repair options. The passing of the bill is a win for farmers and is hoped to be the start of aligning the agricultural industry with other technology-enabled products.",
    "hn_title": "Colorado passes agricultural Right to Repair",
    "original_title": "Colorado passes agricultural Right to Repair",
    "score": 175,
    "hn_content": "Colorado passes agricultural Right to Repair | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Colorado passes agricultural Right to Repair (ifixit.com)177 points by kwiens 3 hours ago | hide | past | favorite | 28 comments   walterbell 3 minutes ago        | next [–] \"Repairing Your Car in Your Own Garage Is Considered Illegal in Sacramento, CA\", 400+ comments, https://news.ycombinator.com/item?id=34081331\"50k repair manuals for most vehicles 1982-2013\", https://news.ycombinator.com/item?id=35491294 reply  Gustomaximus 50 minutes ago        | prev | next [–] What I don't understand is why a couple of the higher quality tractor companies have not started pushing hard to brand \"we support repair\" and having available online manuals and software to support this. This seems a perfect marketing/product platform for an underdog that also believes this.Massey, Fendt or similar could really differentiate themself and take market share on the back of this I suspect.Especially with online world having reached farmers as the dealer networks increasingly mean less when you can order equiptment and spares online so JD loses some of the strength they hold by their dominating physical presence alone. reply  donw 32 minutes ago        | parent | next [–] Excellent point.Check out Project Farm on YouTube to get a sense of what the average farmer is like in terms of engineering mindset.They would love this.Farmers are smart. When your combine breaks during harvest, you can't just grab another or wait a couple of days for the repair guy to show up -- you need it fixed now. That's not easy.Not to mention, understanding your soil, your crops, the weather, how they interact, how to handle everything from planting up to post-harvest processing... it's not an easy job.And this starts at a young age, because all the kids help out on the farm, too. You know why licenses for vehicles aren't required on private property? Farms. Early-teenagers need to be able to drive around a truck, then a tractor, etc. reply  GalenErso 17 minutes ago        | root | parent | next [–] Farmers also need to understand animal biology (for those who raise animals) and reproduction, the local, state, and national commodities market (and sometimes the international market too), pests and invasive species (plants, insects, and animals alike) and the diseases they can bring, and hydrology. A modern farmer is an engineer, an economist, a biologist and a wilderness expert all in one. reply  voakbasda 1 hour ago        | prev | next [–] I suspect that John Deere and friends will find a way to challenge this in court and -- if they eventually lose -- find a way to maliciously comply with the law. Their behavior has been actively hostile to their customers for years, and they have zero incentive to change.Like Apple's repair kits mentioned in another comment, I suspect their strategy will involve providing tools that cost nearly as much to rent as it would take to buy a new machine. Then, only the most well-capitalized farmers will be able to afford to lock up the extraordinary amounts of cash required to perform their own repairs.Without legislation that absolutely eviscerates their monopolistic business practices, I would be shocked if anything changes for the average farmer. reply  userbinator 1 hour ago        | parent | next [–] Like Apple's repair kits mentioned in another comment, I suspect their strategy will involve providing tools that cost nearly as much to rent as it would take to buy a new machine.That reminds me of how much things have changed since the \"good old days\". I have some service manuals for mid-century equipment that don't need much in the way of special tools, and where one is needed or would be helpful, they tell you how to make one. reply  conradev 7 minutes ago        | parent | prev | next [–] John Deere signed a memorandum of understanding in January: https://www.fb.org/news-release/afbf-signs-right-to-repair-m... reply  crooked-v 1 hour ago        | parent | prev | next [–] Apple's repair kits are a weird comparison here. The rental is $49, and that's probably at cost or close to it given the shipping costs both ways for a 79-pound box.There's nothing malicious compliance about it... it's just a pain in the ass to repair modern ultra-light and ultra-efficient phones the \"right\" way. reply  Dylan16807 21 minutes ago        | parent | prev | next [–] The problem with apple isn't really the kits, it's the price of parts and inability to stock them. reply  kelseyfrog 1 hour ago        | parent | prev | next [–] Name, shame, and industry blacklist Deere product managers. It's the only way. Stop acting like there's nothing that can be done. reply  TimTheTinker 1 hour ago        | root | parent | next [–] Good coverage of the issue by news outlets, including naming John Deere specifically, would be far more effective not only at motivating Deere to improve their practices, but also helping the populace at large to understand the problem, build popular support for good legislation, motivating legislators to deal with the problem, and motivating other companies to avoid copying Deere's example.Naming and shaming individuals (besides a CEO) within a company is unnecessary, and can cause destruction to lives, families, and communities that have nothing to do with the problem. It also overestimates the individual agency these people hold over what is most often a cultural and policy issue at a company. reply  dataflow 2 hours ago        | prev | next [–] Does the governor not need to sign it? Or has it been signed already? Because I wouldn't be celebrating yet until it's signed into law (if even then). NY's right to repair law was destroyed at the governor's desk at the 11th hour. [1][1] https://www.theverge.com/2022/12/29/23530733/right-to-repair... reply  kwiens 2 hours ago        | parent | next [–] Governor Polis still needs to sign it, and you are right to be skeptical after New York. Two reasons to be optimistic:* In CO, the Governor can't mess with the bill like NY, only sign or veto it* Gov Polis is very good on tech issues, and has signalled to us (the coalition) that he will sign it reply  dataflow 2 hours ago        | root | parent | next [–] W.r.t. the first bullet point, I don't think NY was any different - AFAIK the governor didn't \"mess\" with it (despite the reporting making it look that way); she just didn't sign it until the legislature revised it.The second one is nice to hear though. reply  kwiens 2 hours ago        | root | parent | next [–] New York's chapter amendment process is totally novel in my legislative experience, haven't come across it anywhere else. Gives the governor a lot of power. reply  paws 1 hour ago        | root | parent | next [–] Do you have links about this?I was extremely disappointed [1] when I learned about Hochul's last minute nerfing of right to repair and I'd be curious to learn more how the governors office acquired that power. IANAL but thought separation of powers was supposed to be guaranteed by the Constitutions, both US and NY. What happened?[1] https://twitter.com/onpaws/status/1618787954306211840 reply  kQq9oHeAz6wLLS 1 hour ago        | root | parent | next [–] Lots of things are supposed to be guaranteed by various constitutions which, sadly, are not. reply  z3c0 2 hours ago        | root | parent | prev | next [–] I was about to say the same. It appears the NY bill was ineffective from the jump and wouldn't have amounted to more than pageantry for the companies refusing to give such rights. It was a good thing that is was killed at the last minute. reply  TedDoesntTalk 2 hours ago        | prev | next [–] But will John Deere do what Apple did? Here’s one example:“Apple shipped me a 79-pound iPhone repair kit to fix a 1.1-ounce battery”https://www.theverge.com/2022/5/21/23079058/apple-self-servi...“I’m starting to think Apple doesn’t want us to repair them” reply  inconceivable 1 hour ago        | parent | next [–] so what happens if the kit gets \"stolen\"? $1200 for all of that stuff sounds like kind of a deal, especially with 2 pelicans. reply  samtho 1 hour ago        | parent | prev | next [–] Honestly, that’s kind of cool to get the entire repair rig. I doubt it’s worth it for them to differentiate based on the of work done, so they just send the entire kit.I don’t mind that Apple does this if anyone is allowed to make their own repair rig as well. reply  andreareina 1 hour ago        | parent | prev | next [–] That's just the fixture Apple uses isn't it? You're not required to use it. reply  MBCook 1 hour ago        | root | parent | next [–] They ship you the tools their stores and authorized third parties seem to use to do a proper quality repair.Yeah it’s heavy. But you don’t buy it, it’s lent to you (via a hold on your credit card).I know people complain about this but should they send the battery in an envelope and say “good luck”?Even if they design the phones to be more repairable (which I know many hope for), nothing can change the design of the phone you bought 2 years ago. And what Apple is doing is miles better than what they were doing before. reply  CivBase 1 hour ago        | parent | prev | next [–] Heaven forbid you want to replace a blown capacitor. reply  m0llusk 54 minutes ago        | prev | next [–] Right to repair is a great thing, but it seems like we need to be honest about this business and its customers. Agriculture, at least in the US, is primarily a government subsidized big business. Many if not most John Deere customers are corporations that like having their operating fleets be maintained and managed with help from the provider. The farmers getting screwed are smaller operators who are far less profitable for John Deere and really should seek or develop other options if at all possible.Comparisons with Apple hardware are not very good because Apple is primarily a consumer brand. Apple does in a sense sell fleets to companies and schools, but most rely on other companies to configure and maintain their computing gear. The market for laptops is very different from the market for large tractors. reply  oofta-boofta 2 hours ago        | prev [–] Good! A massive win for moving away from a throwaway society. reply  AnimalMuppet 1 hour ago        | parent [–] I'm pretty sure that John Deere tractors are not a throwaway item, even if the dealer is holding you hostage on a repair. reply  TaylorAlexander 15 minutes ago        | root | parent [–] I suspect many of the parts on a John Deere tractor get thrown away when they could be repaired. replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Colorado's agricultural right to repair has been passed, with optimism for approval from Governor Polis, but uncertain success. Farmers claim the technology corporations such as John Deere company actively hold hostile monopolistic business practices, deterring from repair and conflicting with the needs of farmers who cannot wait for parts or new equipment during harvest season. Some suggest that a company like Massey, Fendt or similar could have an opportunity to differentiate themselves by supporting repairs, filling the need for explicit signals of available online manuals and software to support repairs."
  },
  {
    "id": 35525384,
    "timestamp": 1681222134,
    "title": "The EU proposed CRA law may have unintended consequence for the Python ecosystem",
    "url": "https://pyfound.blogspot.com/2023/04/the-eus-proposed-cra-law-may-have.html",
    "hn_url": "http://news.ycombinator.com/item?id=35525384",
    "content": "The Python Software Foundation (PSF) has raised concerns about the proposed Cyber Resilience Act (CRA) and Product Liability Act in the EU, stating it may put the organization and the open-source software community at risk. PSF has found issues with the proposed policies that may harm the users they intend to protect, making open-source authors liable for how their software is used in commercial products. The PSF believes increased liability should be assigned to entities that have agreements with consumers. It is critical to ensure clarity around public software repositories and exempt under-resourced entities who host packages from liabilities. The PSF encourages policymakers to consider the impact on open-source software development when drafting the policies.No summary can be provided as the given text does not contain any information relevant to tech news.",
    "summary": "The Python Software Foundation is concerned about the EU's proposed Cyber Resilience Act and Product Liability Act, stating that it may put the open-source software community at risk. The PSF highlights issues with the policies that may make open-source authors liable for how their software is used in commercial products and suggests that liability should be assigned to entities with agreements with consumers. The PSF urges policymakers to consider the impact on open-source software development when drafting the policies.",
    "hn_title": "The EU proposed CRA law may have unintended consequence for the Python ecosystem",
    "original_title": "The EU proposed CRA law may have unintended consequence for the Python ecosystem",
    "score": 173,
    "hn_content": "The proposed Cyber Resilience Act in the EU could impact the Python ecosystem, and online communities are divided on the matter. Experts note the absence of a clear definition of \"commercial activity,\" which may lead to unintended consequences for developers. Some suggest that selling support for open-source software may be considered a commercial activity, while others disagree. Despite the controversy, open-source developers who do not monetize their software are likely to be exempt from this regulation. The EU is expected to release a new draft of the regulation in April, based on feedback from open-source foundations.The European Union's Article 13 will require open-source codes' creators to be financially responsible for commercial software it is used in; Law excludes paid open-source contributors. This may cause developers to leave the EU, and destroy the open-source community as we know it. If enforced retroactively, commercial developers  could hold open source contributors responsible – including Bill Joy for creating the first versions of TCP/IP stack- causing an unsolvable legal conundrum. While the regulation is necessary, writing effective and targeted regulations is hard, and the current draft may be not in the right place. Extraterritoriality and the way EU data processing protection rules apply to people outside of the EU is still unknown, making it hard for developers to comply with privacy laws.The EU proposed legislation that would require open-source maintainers to perform audits, require certification, and handle liability; This has raised concerns among the open-source community as it may make them financially and legally liable for the code they write; Some small shops have already refused to work with EU IP addresses and redirected to a page with a disclaimer; Large corporations have already benefited from GDPR, and it may not be surprising if they start exploiting these new regulations as well; Instead of targeting open-source maintainers, liability should be shifted to the company shipping the actual product; This approach to regulation is strongly disconnected from the way software is currently built, and maintainers need to pay more attention to this space.The EU is proposing a law that may hold developers liable for problems in their software, which has caused concern among FOSS developers. Americans commenters argue that similar regulations exist in the US, and such laws can create new liability even when disclaimers exist. The proposed law only applies to commercial activity, but some open source projects might not qualify. The views on this law are divisive, with some believing it would shield customers from poorly designed products, while others argue it will prevent small developers from creating new products. Total downloads of Python software every day exceeding 300 million times since companies and developers have integrated Python into their products directly, relying on the software.A discussion on the pros and cons of open-source software arose on Hacker News. Some argue that making software open-source will be a free pass for hackers to cause chaos, while others point out that the internet is built on open-source software. One user mentioned that the IoT industry shows us that charging for software doesn't necessarily make it less vulnerable. Open-source proponents argue that deferring semantics to implementation provides a convenient and bug-free option. However, the user points out that the code may not be suitable for all purposes, and it's up to the user to be responsible for what they use it for.",
    "hn_summary": "The proposed Cyber Resilience Act in the EU has implications for the Python ecosystem, causing division among online communities. Open-source developers who do not monetize their software are likely to be exempt, but there are concerns that selling support for open-source software may be considered a commercial activity, leading to unintended consequences for developers. The EU is expected to release a new draft of the regulation in April, based on feedback from open-source foundations."
  },
  {
    "id": 35528281,
    "timestamp": 1681234070,
    "title": "Elizabeth Holmes loses bid to stay out of prison",
    "url": "https://www.cnbc.com/2023/04/11/theranos-elizabeth-holmes-loses-bid-to-stay-out-of-prison.html",
    "hn_url": "http://news.ycombinator.com/item?id=35528281",
    "content": "Theranos' Elizabeth Holmes loses bid to stay out of prisonSkip NavigationwatchliveMarketsPre-MarketsU.S. MarketsCurrenciesCryptocurrencyFutures & CommoditiesBondsFunds & ETFsBusinessEconomyFinanceHealth & ScienceMediaReal EstateEnergyClimateTransportationIndustrialsRetailWealthLifeSmall BusinessInvestingPersonal FinanceFintechFinancial AdvisorsOptions ActionETF StreetBuffett ArchiveEarningsTrader TalkTechCybersecurityEnterpriseInternetMediaMobileSocial MediaCNBC Disruptor 50Tech GuidePoliticsWhite HousePolicyDefenseCongressEquity and OpportunityCNBC TVLive TVLive AudioBusiness Day ShowsEntertainment ShowsFull EpisodesLatest VideoTop VideoCEO InterviewsCNBC DocumentariesCNBC PodcastsCNBC WorldDigital OriginalsLive TV ScheduleWatchlistInvesting ClubTrust PortfolioAnalysisTrade AlertsMeeting VideosHomestretchJim's ColumnsEducationPROPro NewsPro LiveSubscribeSign InMenuMake ItselectALL SELECTCredit Cards Loans Banking Mortgages Insurance Credit Monitoring Personal Finance Small Business Taxes Help for Low Credit Scores Investing SELECTAll Credit CardsFind the Credit Card for YouBest Credit CardsBest Rewards Credit CardsBest Travel Credit CardsBest 0% APR Credit CardsBest Balance Transfer Credit CardsBest Cash Back Credit CardsBest Credit Card Welcome BonusesBest Credit Cards to Build CreditSELECTAll LoansFind the Best Personal Loan for YouBest Personal LoansBest Debt Consolidation LoansBest Loans to Refinance Credit Card DebtBest Loans with Fast FundingBest Small Personal LoansBest Large Personal LoansBest Personal Loans to Apply OnlineBest Student Loan RefinanceSELECTAll BankingFind the Savings Account for YouBest High Yield Savings AccountsBest Big Bank Savings AccountsBest Big Bank Checking AccountsBest No Fee Checking AccountsNo Overdraft Fee Checking AccountsBest Checking Account BonusesBest Money Market AccountsBest CDsBest Credit UnionsSELECTAll MortgagesBest MortgagesBest Mortgages for Small Down PaymentBest Mortgages for No Down PaymentBest Mortgages with No Origination FeeBest Mortgages for Average Credit ScoreAdjustable Rate MortgagesAffording a MortgageSELECTAll InsuranceBest Life InsuranceBest Homeowners InsuranceBest Renters InsuranceBest Car InsuranceTravel InsuranceSELECTAll Credit MonitoringBest Credit Monitoring ServicesBest Identity Theft ProtectionHow to Boost Your Credit ScoreCredit Repair ServicesSELECTAll Personal FinanceBest Budgeting AppsBest Expense Tracker AppsBest Money Transfer AppsBest Resale Apps and SitesBuy Now Pay Later (BNPL) AppsBest Debt ReliefSELECTAll Small BusinessBest Small Business Savings AccountsBest Small Business Checking AccountsBest Credit Cards for Small BusinessBest Small Business LoansBest Tax Software for Small BusinessSELECTAll TaxesBest Tax SoftwareBest Tax Software for Small BusinessesTax RefundsSELECTAll Help for Low Credit ScoresBest Credit Cards for Bad CreditBest Personal Loans for Bad CreditBest Debt Consolidation Loans for Bad CreditPersonal Loans if You Don't Have CreditBest Credit Cards for Building CreditPersonal Loans for 580 Credit Score or LowerPersonal Loans for 670 Credit Score or LowerBest Mortgages for Bad CreditBest Hardship LoansHow to Boost Your Credit ScoreSELECTAll InvestingBest IRA AccountsBest Roth IRA AccountsBest Investing AppsBest Free Stock Trading PlatformsBest Robo-AdvisorsIndex FundsMutual FundsETFsBondsUSAINTLwatchliveSearch quotes, news & videosWatchlistSIGN INCreate free accountMarketsBusinessInvestingTechPoliticsCNBC TVWatchlistInvesting ClubPROMenuTechTheranos' Elizabeth Holmes loses bid to stay out of prisonPublished Tue, Apr 11 20231:19 PM EDTWATCH LIVEFormer Theranos CEO Elizabeth Holmes arrives at federal court on October 17, 2022 in San Jose, California.Justin Sullivan | Getty ImagesDisgraced Theranos CEO Elizabeth Holmes has been rebuffed in her attempt to stay out of federal prison while she appeals her conviction for the fraud she committed while overseeing a blood-testing scam that exposed Silicon Valley's dark side.In an 11-page ruling issued late Monday, U.S. District Judge Edward Davila concluded there wasn't compelling enough evidence to allow Holmes to remain free on bail while her lawyers try to persuade an appeals court that alleged misconduct during her four-month trial led to an unjust verdict.The judge's decision means Holmes, 39, will have to surrender to authorities April 27 to start the more than 11-year prison sentence that Davila imposed in November. The punishment came 10 months after a jury found her guilty on four counts of fraud and conspiracy against the Thearanos investors who believed in her promises to revolutionize the health care industry.Holmes had accompanied her lawyers to a San Jose, California, courtroom on March 17 to try to convince Davila that various missteps by federal prosecutors and the omission of key evidence will culminate in the Ninth Circuit Court of Appeals exonerating her.Her prison sentence is scheduled to start roughly 20 years after Holmes dropped out of Stanford University when she was 19 years old to start Theranos in Palo Alto, California – the same city where William Hewlett and David Packard founded a company bearing their surnames in a small garage and planted the seeds of what grew into Silicon Valley.Holmes could still file another appeal of the ruling Davila's latest ruling, a maneuver that her co-conspirator at Theranos – Ramesh \"Sunny\" Balwani – successfully used to delay his scheduled March 16 date to begin a nearly 13-year prison sentence. But the Ninth Circuit Court of Appeals last week rejected that appeal, and Balwani is now scheduled to report to a Southern California prison on April 20.Davila has recommended that Holmes serve her sentence in a Byron, Texas, prison. It hasn't yet been publicly confirmed if that will be the facility where she reports.Unless she can find a way to stay free, Holmes will be separated from the two children she had leading up to the trial and after her conviction.Her first child, a boy, was born shortly before her trial began in September 2021. The youngest child, whose gender hasn't been disclosed in court documents, was born at some point after her November sentencing. She conceived both with her current partner, William \"Billy\" Evans, who she met after breaking up with Balwani in the midst of Theranos' scandalous downfall.The denial of Holmes' request to remain free is the latest twist in a long-running saga that has already been the subject of an acclaimed HBO documentary and an award-winning Hulu TV series.Although they had separate trials, Holmes and Balwani were accused of essentially the same crimes centered on a ruse touting Theranos' blood-testing system as a breakthrough in health care. The claims helped the company become a Silicon Valley sensation that raised nearly $1 billion from investors and at one point anointed Holmes with a $4.5 billion fortune, based on her 50% stake in Theranos.Holmes also parlayed the buzz surrounding Theranos to speaking engagements on the same stage as former President Bill Clinton and glowing cover stories in business publication that likened her to tech visionaries such as Apple co-founder Steve Jobs.But Theranos' technology never came close to working like Holmes and Balwani boasted, resulting in the company's scandalous collapse and a criminal case that shined a bright light on Silicon Valley greed and hubris.Subscribe to CNBC PROLicensing & ReprintsCNBC CouncilsSelect Personal FinanceCNBC on PeacockJoin the CNBC PanelSupply Chain ValuesSelect ShoppingClosed CaptioningDigital ProductsNews ReleasesInternshipsCorrectionsAbout CNBCAd ChoicesSite MapPodcastsCareersHelpContactNews TipsGot a confidential news tip? We want to hear from you.Get In TouchAdvertise With UsPlease Contact UsCNBC NewslettersSign up for free newsletters and get more CNBC delivered to your inboxSign Up NowGet this delivered to your inbox, and more info about our products and services. Privacy Policy|Do Not Sell My Personal Information|CA Notice|Terms of Service© 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversalData is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis.Market Data Terms of Use and DisclaimersData also provided by",
    "summary": "Elizabeth Holmes, the disgraced CEO of Theranos, has lost her bid to remain out of federal prison while she appeals her conviction for fraud. She will have to surrender on April 27 and serve more than 11 years in prison, following a four-month trial which found her guilty on four counts of fraud and conspiracy. Holmes has still not ruled out filing another appeal.",
    "hn_title": "Elizabeth Holmes loses bid to stay out of prison",
    "original_title": "Elizabeth Holmes loses bid to stay out of prison",
    "score": 170,
    "hn_content": "Elizabeth Holmes, the founder of scandal-hit biotech firm Theranos, has lost her bid to stay out of prison. Tesla has been mentioned in the comments as an ironic counterpoint, with criticism that the company applies unqualified claims to so-called \"Full Self-Driving\" technology. Some comments also point out that Tesla investors have been happy with their returns, but that this is different from Holmes' fraudulent activity which \"screwed over peers\". Readers also question why Holmes was punished for financial fraud rather than the impact of faulty test results on patient health.A discussion on Tesla's Full Self Driving (FSD) feature highlights the discrepancy between the marketing name and the technical functionality that it represents. Some users assert that selling something called FSD that doesn't fully drive itself is not within the duty of good faith and fair dealing, while others argue that FSD is just an Advanced Driver Assistance System (ADAS) level 2, like many other car brands. The FSD Beta program, tested by thousands of users, causes controversy, with some users labeling it as reckless and unethical, while others believe it is a safer alternative to novice drivers. The discussion touches on the subject of ethics, morals, and regulation, and the need for independent audits and formalized safety testing processes for autonomous systems.The article discusses whether self-driving technology has advanced to the point of being relatively immune to government intervention and oversight. One commentator argues that compromise is the only sensible approach when considering the potential benefits to society. However, another commentator raises concerns about the safety of such technology and claims that Tesla is \"hyping\" self-driving capabilities that it doesn't currently possess. Twitter's API changes are also discussed, with critics expressing their dissatisfaction over the suddenness of the transition. The discussion underscores the complex balance between innovation, safety, and the responsibilities of tech companies towards their customers.A culture that supresses internal doubt and creates delusional over-promising could lead to prosecution. The debate sparked mainly revolves around Musk's culpability or special treatment as he faces minimum sanction, whilst other defendants that commit less serious crimes receive much longer sentences. The debate reaches beyond fraudulent activity and extends to the disproportionate punishment laws. The post highlights that only a dishonest person will steal from the rich, while the elites use their network to escape prosecution. There is minimal good conduct time, systematic parole eligibility, and early release in the federal prison system.Elizabeth Holmes, former CEO of Theranos, has been sentenced to 20 years in prison after defrauding investors, doctors, and patients in a blood-testing scandal. An HN user points out that Holmes won't qualify for California's \"three strikes\" law, which requires three grand theft convictions before a 25-year minimum sentence is imposed. While Holmes didn't steal $5k more than three times, she still stole millions, leading some to question the justice system's perverse incentives. The article also highlights the normalized nature of theft in the Bay Area, while another user wonders if Holmes will actually report to prison.Elizabeth Holmes, the founder of Theranos, has been sentenced to 20 years in prison for several counts of fraud. Holmes was also fined $500,000 and required to pay restitution. Despite her lawyers' attempts to argue for a lighter sentence, citing her lack of previous criminal history and charitable work, the judge ruled that her actions had significant impacts on public health and research. Holmes' former partner, Sunny Balwani, who faced the same charges, will be sentenced separately. Many users on Hacker News speculated about whether Holmes would attempt to flee or whether she would serve her sentence in \"minimum security\" prison.The discussion on HN revolves around the sentencing of Elizabeth Holmes and the appropriateness of prison sentences for non-violent crimes. Some users argue that white-collar crimes like fraud harm society in unique ways, destroying trust and leading to long-term impacts, while others believe that the costs of incarceration are too high and a free person can pay their debt to society with money. An ankle monitor system is suggested as an alternative, while others note that Holmes's crimes directly jeopardized people's health. However, some think that people have a tendency to be forgiving towards non-violent crimes and that they need to be punished for their criminal actions, including any resulting harm like the death of patients.HN users comment on possible punishments for fraudulent loan applications, suggesting fines are often insufficient and other deterrents can be explored, such as bans on equity ownership. One user contends that the current prison system's approach to punishment is barbaric and suggests alternative measures like caning, banishment, or compulsory face tattoos of shame. The comment section raises questions about the effectiveness of current punishments and highlights possibilities for more creative approaches.",
    "hn_summary": "Elizabeth Holmes, founder of Theranos, has failed to avoid a 20-year prison sentence for fraud. Contrasting opinions and criticisms of Tesla's Full Self-Driving technology and self-driving in general are discussed, including the need for independent audits and regulations. The discussion revolved around the appropriateness and effectiveness of prison sentences for non-violent crimes, highlighting alternatives such as ankle monitoring systems, equity ownership bans, and more creative punishments."
  },
  {
    "id": 35528595,
    "timestamp": 1681235373,
    "title": "Ask HN: Is the job market brutal? or is it just me?",
    "url": "",
    "hn_url": "http://news.ycombinator.com/item?id=35528595",
    "content": "",
    "summary": "The Ask HN post asks whether the tech job market is brutal or if it's just the poster's failure. Responses indicate it could be a combination of both, with factors such as lack of experience and competition playing a role in difficulty finding a job. One user suggests networking and building up a portfolio to increase chances of success.",
    "hn_title": "Ask HN: Is the job market brutal? or is it just me?",
    "original_title": "Ask HN: Is the job market brutal? or is it just me?",
    "score": 169,
    "hn_content": "An HN post asks if the job market is brutal, with examples given of high-experience tech workers struggling to find work. One user suggests trying defense companies. Some users argue that working for defense companies raises moral and ethical concerns, while others argue that it is a necessary industry. Other users suggest that non-tech Fortune 100 companies may offer fewer hours and lower stress. Applicants may face high volume competition, leading to generic rejection letters.Prospective tech employees should consider factors beyond job pay, such as onerous bureaucracy and office environment, according to employment comments on Hacker News. A significant and competitive pool of underneath-and above-average talent exists at non-tech companies. The job search process for senior roles is lengthier and more challenging, regardless of experience. The influx of candidates has slowed recruiters' ability to screen and interview appropriately. Recruiters may avoid notifying qualified candidates of positions for fear of being poached by FAANG companies. Employers have regained power in the market and job prospects may continue to be bleak for the time being.Experienced tech professionals are struggling to find work despite their qualifications and track record, with some unable to secure employment after months of searching. Specialization is viewed as career suicide, as most companies look for employees with interdisciplinary skills. Those at FAANG level may struggle to find roles with equivalent high salaries in smaller organizations, particularly if they lack expertise in specific areas of software development. Hiring managers themselves are finding the process challenging, with some struggling to find candidates who can solve basic coding problems. Some suggest that candidates should be expected to successfully complete such exercises, while others find them insulting.Many candidates struggle with coding, as it's a common requirement for job interviews. Some companies use coding questions to test adaptability more than the candidate's coding skills. Artificial intelligence is entering the conversation, with discussion around ChatGPT's abilities compared with human candidates. There is a high number of applicants per week for software engineer roles, making it challenging to stand out from the crowd. Some companies are delaying hiring decisions and are looking to fill senior or management roles. Freelance or consulting work may be an option for those struggling to find a job. The current job climate is tough, and it requires a lot of motivation to stay focused and confident during a job search.Recruiting in the tech industry has slowed down, particularly for middle management roles. While senior individual contributors (ICs) are still in demand, companies are cutting middle managers. The drop in demand can be felt especially in the Bay Area among FAANG companies. Large non-tech companies and government agencies like Walmart, CVS and UnitedHealth are still hiring; but beware of ghost job openings where companies stockpile resumes for future use without any intention of hiring right now. Job seekers are finding it harder to land roles and many workers are wondering if the past decade has been a wasted opportunity for some sort of collective bargaining or a greater seat at the table of businesses. Location is considered irrelevant for most forms of knowledge work, particularly since the pandemic has pushed remote work to the forefront.The current job market for tech professionals is soft, although some industries like energy are hiring. Many experienced engineers are receiving less responses to job applications, and companies are rejecting more qualified applicants. The hiring process is often inefficient, particularly at small companies that are unable to manage the process well. Those with twenty years of experience or a \"big-name\" company on their resume often find it difficult to secure interviews. However, smaller companies in fields like banking, manufacturing, and pharma are hiring swiftly. Some have suggested that relocating abroad to countries like Germany may offer better job opportunities.Advice and discussion on job searching in the tech industry, with an emphasis on customizing resumes and cover letters for specific positions rather than sending out generic applications en masse. Some comments suggest the market for senior/lead level roles in the EU is tough, while others argue that salaries are still going up. There is also discussion of the limited opportunities for tech workers to audit software for safety/privacy compliancy and the need for tech workers to be more assertive in protecting their position in the industry. A suggestion is made to consider building a startup during the current job market lull.",
    "hn_summary": "Experienced tech professionals are struggling to find work despite qualifications, with specialized skills viewed as career suicide. Location is irrelevant for most knowledge work. The job search process for senior roles is more challenging, and recruiting has slowed down. Many suggest customizing resumes and cover letters for specific positions rather than sending out generic applications."
  },
  {
    "id": 35524611,
    "timestamp": 1681218606,
    "title": "Open source & the future of nuclear physics",
    "url": "https://github.com/readme/featured/nuclear-fusion-open-source",
    "hn_url": "http://news.ycombinator.com/item?id=35524611",
    "content": "404: Not Found",
    "summary": "I'm sorry, but there is no text given for me to summarize. Please provide me with the text so I can complete the task.",
    "hn_title": "Open source and the future of nuclear physics",
    "original_title": "Open source and the future of nuclear physics",
    "score": 169,
    "hn_content": "Open source and the future of nuclear physics | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Open source and the future of nuclear physics (github.com/readme)169 points by BerislavLopac 12 hours ago | hide | past | favorite | 12 comments   cdibona 10 hours ago        | next [–] One project that I didn't see in the article was the rtos https://marte.unican.es/ which a number of prominent experiments use. reply  anthk 8 hours ago        | parent | next [–] It's weird to see an OS developed from a place pretty close to home... reply  gumby 7 hours ago        | root | parent | next [–] Not when you live in Palo Alto! So you get an idea of what it's like here. If where you live isn't particularly fancy, it'll be an even more accurate experience. reply  xhkkffbf 10 hours ago        | prev | next [–] I've always found academic research to be one of the most natural homes for open source software. It's in the paper formatting software (latex) and much of the lab software. reply  colordrops 8 hours ago        | prev | next [–] Didn't nuclear physics also help fuel the future of open source and the web in general, e.g. CERN. reply  andrepd 7 hours ago        | parent | next [–] Yes! Turns out open, transparent, low-barrier scientific and technological development snowballs itself. Who would have thunk :) reply  abhayhegde 5 hours ago        | prev | next [–] There is a broader statement: open source is fueling the future. In fact, holding off projects close sourced only makes it profitable for one-party for a while, until an open version spins off. Open source copies are bound to happen. reply  __MatrixMan__ 5 hours ago        | parent | next [–] The title could be adequately rephrased: Intellectual Property Has Been Preventing the Future of Nuclear Physics reply  acyou 4 hours ago        | parent | prev | next [–] Alternate theory: open source is destroying the future. In fact, significant progress is occurring from concentrated capital investments made by public entities or corporations, and development slows down or regresses once open source alternatives become available. The likelihood of open source piracy occurring decreases the overall desire for coordinated, large scale technology development. reply  bsder 4 hours ago        | prev | next [–] Where is KiCad? CERN pumps quite a lot of money into KiCad.https://www.kicad.org/ reply  maxloh 8 hours ago        | prev [–] I won't be surprised if one day I saw \"Open source is fueling the future of nuclear bomb\" on HN. reply  bgribble 7 hours ago        | parent [–] That would be old news!My first job as a programmer, in the early 1990s, was working on a tool that was used in one of the last US underground nuclear tests. It was a finite-element electromagnetic effects simulator, designed to help get off of actual bombs blowing up and on to simulation to help design for radiation and EM effects on military equipment.My part was a 2.5d viewer that showed the input model and let you rotate it around and zoom in and out and such. We used X386 (the predecessor of XFree86), the Athena widgets, and GNU tools on a commercial SysV Unix for PC hardware. This was the era of the actual 386; maybe Linux existed but it was well pre 1.0 (I know because I started installing Linux in the 0.99 kernel days, and that was 3 or so years later)Open source has been fueling the future of every single technical endeavor for 30+ (40+? more?) years. replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "The HN community believes that open-source software is vital for the future of scientific and technological development, particularly in academic research fields such as nuclear physics. However, others argue that open-source alternatives hinder coordinated, large-scale technological advancement, and concentrated investments by public entities or corporations lead to more significant progress. One user notes that CERN pumps significant capital into KiCAD, a project not mentioned in the article. Some HN users share anecdotal stories about nuclear tests requiring open-source software, proving that open-source software has been fueling the future of technical endeavors for over 30 years."
  },
  {
    "id": 35522642,
    "timestamp": 1681204430,
    "title": "Rust, RR, Neovim: A perfect debug combination",
    "url": "https://github.com/vlopes11/rrust.nvim",
    "hn_url": "http://news.ycombinator.com/item?id=35522642",
    "content": "# RRustThis is a helper tool to record the execution of a Rust test with `rr`, and replay it using `termdebug`. For more information, check `:h termdebug`.## RequirementsMinimum version of neovim: 0.9.0- https://github.com/nvim-treesitter/nvim-treesitter- https://rr-project.org/- https://www.rust-lang.org/- https://stedolan.github.io/jq- https://www.linux.org/ (this is not tested with Win, OSX, etc - it might work tho)```vimpackadd termdebug```## Installation```vimPlug 'vlopes11/rrust.nvim'```## UsagePosition your cursor on a Rust test, and run:```vim:lua require('rrust').RustRRTestRecord()```It will call `rr` to record the execution of the test.To debug the test, run:```vim:lua require('rrust').RustRRTestReplay()```## EtcI created the following convenience bindings:```vimfunction! NewRRDebug()  lua require('rrust').RustRRTestRecord()  lua require('rrust').RustRRTestReplay()  wincmd L  wincmd h  vertical resize 73  wincmd l  stopinsertendfunctionnnoremap :Stopnnoremap :Continuennoremap :Finishnnoremap :Stepnnoremap :Overnnoremap :Breaknnoremap :Clearnnoremap ed :call NewRRDebug()```![output](https://user-images.githubusercontent.com/8730839/231178300-5d999d5f-b0cd-48ad-a218-1836f0ac4521.gif)",
    "summary": "The post introduces `rrust.nvim`, a Rust helper tool that records and replays Rust test execution using `termdebug`. It requires Neovim, `nvim-treesitter`, `rr`, `jq`, and a Linux operating system. The tool includes convenience bindings for debugging and can be installed using `vimPlug`.",
    "hn_title": "Rust, RR, Neovim: A perfect debug combination",
    "original_title": "Rust, RR, Neovim: A perfect debug combination",
    "score": 148,
    "hn_content": "Developers discuss useful tools for debugging within (neo)vim, with many suggesting the use of nvim-dap and various plugins. Many also emphasize the importance of investing in a good debugging tool to improve productivity, with some recommending Totalview, VSCode, or even CLion. One user notes that while rr can be effective for debugging, it may not be feasible for larger applications with lots of RAM access. There is some discussion around the benefits of specific debuggers for different languages, with Intellij products and VS Code being popular choices.A plugin for Neovim users who use Rust to utilize the debugging tool RR directly in Neovim has been released, with many users praising the ability to record failures and play them back for easier debugging. Expert users in the programming language Rust are very interested in alternative debugging tools like RR, as the language is designed to be debugged without a debugger. The Rust Foundation's recent changes to their trademark policies have caused concern among some users, as they require written permission to use \"Rust\" in domain names or product names, with some finding it fundamentally gross and pointless. The Foundation has also publicly stated that Rust meetups should be firearm-free.A user on Hacker News raises concerns over the possibility of Rust being forked due to a controversial draft policy released by the Rust Foundation regarding the usage of the Rust trademark. However, another user points out the significant effort that would be required to rename all the associated tools and resources alongside the language. Some users suggest alternative names such as Crust, Embargo, Roost, and Corvo. Despite controversy in the community, the Rust Foundation has stated that the proposal is based on the results of a previous survey, and they have reviewed and approved it. Some users express skepticism over how much feedback has been taken into account.",
    "hn_summary": "Developers discuss useful tools for debugging in (neo)vim, with many recommending investing in a good debugging tool like Totalview, VSCode or CLion to improve productivity. Some express concern over obstacles in using rr for debugging large applications with lots of RAM access, while others praise the new nvim-dap plugin for Neovim users who use Rust to utilize the debugging tool RR directly within Neovim. There is some debate around the benefits of specific debuggers for different languages, such as the popularity of Intellij products and VS Code. Users are interested in alternative debugging tools for the programming language Rust, but the Rust Foundation's recent trademark policy changes have sparked controversy and concern among some in the community, who express skepticism over how much feedback has been taken into account."
  },
  {
    "id": 35524297,
    "timestamp": 1681216665,
    "title": "The Free Software Foundation is dying",
    "url": "https://drewdevault.com/2023/04/11/2023-04-11-The-FSF-is-dying.html",
    "hn_url": "http://news.ycombinator.com/item?id=35524297",
    "content": "The Free Software Foundation is dying The Free Software Foundation is dying April 11, 2023  on  Drew DeVault's blogThe Free Software Foundation is one of the longest-running missions in thefree software movement, effectively defining it. It provides a legal foundationfor the movement and organizes activism around software freedom. The GNUproject, closely related, has its own long story in our movement as the codingarm of the Free Software Foundation, taking these principles and philosophy intopractice by developing free software; notably the GNU operating system thatfamously rests atop GNU/Linux.Today, almost 40 years on, the FSF is dying.Their achievements are unmistakable: we must offer them our gratitude andadmiration for decades of accomplishments in establishing and advancing ourcause. The principles of software freedom are more important than ever, and theproducts of these institutions remain necessary and useful – the GPL licensefamily, GCC, GNU coreutils, and so on. Nevertheless, the organizations behindthis work are floundering.The Free Software Foundation must concern itself with the following ahead of allelse:Disseminating free software philosophyDeveloping, publishing, and promoting copyleft licensesOverseeing the health of the free software movementIt is failing in each of these regards, and as its core mission fails, thefoundation is investing its resources into distractions.In its role as the thought-leaders of free software philosophy, the message ofthe FSF has a narrow reach. The organization’s messaging is tone-deaf,ineffective, and myopic. Hammering on about “GNU/Linux” nomenclature, antagonismtowards our allies in the open source movement, maligning the audience as“useds” rather than “users”; none of this aids the cause. The pages and pages ofdense philosophical essays and poorly organized FAQs do not provide a usefulentry point or reference for the community. The message cannot spread like this.As for copyleft, well, it’s no coincidence that many people struggle with theFSF’s approach. Do you, dear reader, know the difference between free softwareand copyleft? Many people assume that the MIT license is not free softwarebecause it’s not viral. The GPL family of licenses are essential for ourmovement, but few people understand its dense and esoteric language, despite the16,000-word FAQ which supplements it. And hip new software isn’t using copyleft:over 1 million npm packages use a permissive license while fewer than 20,000 usethe GPL; cargo sports a half-million permissive packages and another 20,000 orso GPL’d.And is the free software movement healthy? This one gets an emphatic “yes!” –thanks to the open source movement and the near-equivalence between freesoftware and open source software. There’s more free software than ever andvirtually all new software contains free software components, and most peoplecall it open source.The FOSS community is now dominated by people who are beyond the reach of theFSF’s message. The broader community is enjoying a growth in the diversity ofbackgrounds and values represented, and the message does not reach these people.The FSF fails to understand its place in the world as a whole, or itsrelationship to the progressive movements taking place in the ecosystem andbeyond. The foundation does not reach out to new leaders in the community,leaving them to form insular, weak institutions among themselves with no centralleadership, and leaving us vulnerable to exploitation from growing movementslike open core and commercial attacks on the free and open source softwarebrand.Reforms are sorely needed for the FSF to fulfill it basic mission. Inparticular, I call for the following changes:Reform the leadership. It’s time for Richard Stallman to go. His polemeicrhetoric rivals even my own, and the demographics he represents – to theexclusion of all others – is becoming a minority within the free softwaremovement. We need more leaders of color, women, LGBTQ representation, andothers besides. The present leadership, particularly from RMS, creates anexclusionary environment in a place where inclusion and representation areimportant for the success of the movement.Reform the institution. The FSF needs to correct its myopic view of theecosystem, reach out to emerging leaders throughout the FOSS world, and askthem to take charge of the FSF’s mission. It’s these leaders who hold thereins of the free software movement today – not the FSF. If the FSF stillwants to be involved in the movement, they need to recognize and empower theleaders who are pushing the cause forward.Reform the message. People depend on the FSF to establish a strongbackground in free software philosophy and practices within the community,and the FSF is not providing this. The message needs to be made much moreaccessible and level in tone, and the relationship between free software andopen source needs to be reformed so that the FSF and OSI stand together asthe pillars at the foundations of our ecosystem.Decouple the FSF from the GNU project. FSF and GNU have workedhand-in-hand over decades to build the movement from scratch, but theirprivileged relationship has become obsolete. The GNU project represents aminute fraction of the free software ecosystem today, and it’s necessary forthe Free Software Foundation to stand independently of any particular projectand focus on the health of the ecosystem as a whole.Develop new copyleft licenses. The GPL family of licenses has served uswell, but we need to do better. The best copyleft license today is theMPL, whose terse form and accessible language outperforms the GPL inmany respects. However, it does not provide a comprehensive answer to theneeds of copyleft, and new licenses are required to fill other niches in themarket – the FSF should write these licenses. Furthermore, the FSF shouldpresent the community with a free software perspective on licenses as aresource that project leaders can depend on to understand the importance oftheir licensing choice such that they understand the appeal of copyleftlicenses without feeling pushed away from permissive approaches.The free software movement needs a strong force uniting it: we face challengesfrom many sides, and today’s Free Software Foundation is not equal to the task.The FOSS ecosystem is flourishing, and it’s time for the FSF to step up to thewheel and direct its coming successes in the name of software freedom.  Articles from blogs I read     Generated by   openringSummary of changes for March 2023Hey everyone! This is the list of all the changes we've done to our projects and apps during the month of March. We'll also be reporting in our on position in the world, and on our future plans.Summary Of Changes  Donsol, added 100r logo to spla…    via Hundred RabbitsMarch 31, 2023SourceHut's 2022 Financial reportIn summary, SourceHut continues to be sustainable, profitable, and growing. Wecontinued to grow YoY between 2021 and 2022. We were able to make somesignificant investments, particularly in establishing a new datacenter presencein Europe, and we intend to …    via Blogs on SourcehutMarch 27, 2023Status update, March 2023Hi all!In the past week or so I’ve focused on a NPotM: go-imap, an IMAP library for Go. “But Simon, a NewProject of the Month is supposed to be new!” Right, right, the NPotM is alie… But only a half-lie: I’m rewriting it from scratch. go-imap was one of t…    via emersionMarch 20, 2023 The content for this site is CC-BY-SA. The code for this site is MIT.",
    "summary": "The Free Software Foundation (FSF), one of the longest-running missions in the free software movement, is failing to disseminate free software philosophy, promote copyleft licenses, and oversee the health of the free software movement, despite its accomplishments in establishing and advancing software freedom. The FSF's problematic messaging and management, failure to understand its place in the world, and exclusionary environment under leadership like Richard Stallman are leaving us vulnerable to exploitation from commercial attacks on the free and open-source software brand. Reform is necessary to fulfill its mission and keep the community united, including leadership, the message, decoupling it from GNU, developing new copyleft licenses, and reforming its view of the ecosystem.",
    "hn_title": "The Free Software Foundation is dying",
    "original_title": "The Free Software Foundation is dying",
    "score": 145,
    "hn_content": "The Free Software Foundation is reportedly dying, with comments suggesting that Richard Stallman, its founder, should step down for the organisation to move forward; however, others counter that it was Stallman who spearheaded the philosophy of open-source software and its related movement. While it is noted that Stallman has not been 'relevant' for decades, many still see him as an essential figurehead for the Free Software Foundation. Some comments suggest his greatest achievement was the founding of this organisation, while criticism is levelled at Stallman's recent lack of action or innovation. Nonetheless, many see him as better suited to a consulting role that would allow him to remain active in the organization.HN users discuss the problem of secure boot in implementing Linux on Intel laptops. Some argue for the need for a chain of trust, while others argue that users should be allowed to choose the chain of trust. The FSF's relevance and activism are also questioned, while the need for open-source software for democracy and freedom is emphasized. There are examples of Intel laptops blocking Linux installation, but it is possible to enable it through the BIOS setting, so it is not clear if Intel is actively blocking it. Richard Stallman's future and role in the movement is also a topic of discussion.A discussion on Foundation Structures and their relevance to corporate involvement and exploitation was had on HN. The conversation discussed examples of where corporations have worked together with foundations effectively and examples of where it has turned negative. The Linux Foundation was cited as a good example of where the structure balances private and corporate interests well. A discussion on diversity and including LGBTQ, women, and People of Colour in leadership positions also took place. To achieve effective leadership, it was thought that leadership should have technical and social competency with a vision aligned to core FSF ideologies. Additionally, technologists are encouraged to use seemingly unrelated issues such as human governance and society to draw connections between those and software freedom.The FSF may be dying due to its resistance to change and toxic work environment, driving away talented individuals. The organization's goals have not entirely been achieved, and the landscape has changed since its inception. There is a need for a new kind of freedom that the FSF may not be able to deliver, and new leadership based on skill, respect, and vision is needed. The idea that diversity should be a goal is dangerous and discriminative, and the focus must be on fighting discrimination. Those aiming for free software's success can either reform the FSF or create a new organization, but the use of the FSF's brand and established network of donors is not necessarily a bad thing.  The focus must be on achieving the organization's goals, and change is required for growth.The Free Software Foundation (FSF) has become stagnant under Richard Stallman's management, and some are calling for him to step down, although he has staunch supporters. The FSF has remained selectively focused on licensing violations of the GNU project instead of all GPL-licensed projects; innovation in licensing is needed to solve this problem. Despite the growing popularity of \"Open Source,\" especially on Github, the FSF continues to be relevant in guiding the open-source community, even if it is not necessarily driving it forward. There are opportunities for new leaders in the community, but this must prioritize merit, not representation.The article argues that the Free Software Foundation (FSF) needs to focus on making FOSS a more reasonable option for end-users, as opposed to focusing on the developer side, which has already been done. The average user, who runs Windows and has an iPhone or Android, deals with far simpler and more dystopian problems than FOSS. The FSF's insistence on total replacement of workflows is impractical for most people. Instead, FOSS successes come when a project bridges the user problem. Criticisms of FSF, stemming from its philosophical essays and poorly organized FAQs, do not facilitate the cause. However, critics must first understand FSF's perspective before abandons the cause.The community is divided over the Free Software Foundation’s approach to copyleft. The article suggests it is time for Richard Stallman to go, but HN users argue that Stallman’s contribution to the software development ecosystem should not be discredited. The majority's recent focus towards closed-source commercial software, no longer under the FOSS movement, is concerning. The focus should be on promoting free software, and the relationship between free software and open-source needs reformation. There must be a balance between ideological advocacy and business interests to move forward. Also, to make the message more accessible and level in tone, decouple the FSF from the GNU project and invest in developing new copyleft licenses. Finally, leaders must reach out to diverse communities for better representation.Comments on the importance of diversity in tech and leadership, as well as calls for Richard Stallman to step down from his position at the Free Software Foundation due to problematic behavior. One user argues that diversity should not be a specific goal, but rather a reflection of equal opportunities at the beginning of the proverbial pipeline. Another user argues that pointing out lack of diversity is appropriate and that organizations should strive for inclusivity. The importance of promoting free software over proprietary software is also mentioned. The comments highlight a need for fair treatment and equal opportunity in the tech industry.The comments debate whether the Free Software Foundation (FSF) board should prioritize diversity or qualifications in their appointments. Some argue that gender, sexuality, or race are not important whereas others believe being less exclusionary and expanding to embrace larger communities is crucial. The discussion contains criticisms of both the FSF messaging and Stallman's leadership style. An HN user points out that 75% of US programmers are male and around 65% white, and the FSF cannot afford to be picky with adding extra requirements. Some argue that the FSF is agenda-driven, while others feel following their guidelines ironically leaves the user with very little freedom.",
    "hn_summary": "The Free Software Foundation (FSF) faces criticism over its relevance, toxic work environment, and Richard Stallman's leadership. Some call for his resignation, while his supporters argue against that. The FSF needs change and innovation to achieve its goals. Diversity is a topic of discussion, with opposing views regarding its importance. The focus should be on promoting free software and finding a balance between advocacy and business interests. The FSF needs to make FOSS more accessible to end-users, and new copyleft licenses should be developed. The importance of fair treatment and equal opportunities in tech industry is emphasized. Gender, sexuality, race, and qualifications are debated as priorities for the FSF board's appointments."
  }
]
