[
  {
    "id": 38966875,
    "title": "كشف خداع مكتب البريد والتهديدات في قضية المبلغين عن المخالفات",
    "originLink": "https://www.bbc.co.uk/news/uk-67884743",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966875",
    "commentBody": "",
    "originSummary": [
      "حاول مكتب البريد إخفاء وتشويه سمعة فيلم وثائقي لهيئة الإذاعة البريطانية يكشف عن مشاكل داخل المنظمة.",
      "استخدموا معلومات كاذبة وتهديدات باتخاذ إجراءات قانونية وحملة تضليل.",
      "على الرغم من جهودهم ، اكتسبت الفضيحة اهتماما كبيرا وأسفرت عن إلغاء الإدانات."
    ],
    "commentSummary": [
      "يواجه مكتب بريد المملكة المتحدة اتهامات بخيانة الأمانة والترهيب فيما يتعلق بالمبلغين عن المخالفات والبرامج المعيبة التي أدت إلى اتهامات كاذبة بالاحتيال ضد مديري البريد.",
      "وعلى الرغم من حكم المحكمة، إلا أن المساءلة كانت مفقودة، حيث خفض مكتب البريد التعويضات واستمر في محاربة الطعون، بينما لا يزال يستخدم برنامج هورايزون، الذي دفعوا مقابله 95 مليون جنيه إسترليني لمدة عامين إضافيين.",
      "وقد أثيرت مخاوف بشأن الصعوبات التي يواجهها الأفراد في المحكمة، والافتقار إلى الأدلة والأدلة المخفية، والدور المزدوج لمكتب البريد كضحية ومدع عام، واستخدام المدعين الخاصين. أثارت هذه الفضيحة مطالب بالمساءلة، وتجريد الرئيس التنفيذي المعني من الشرف، ومخاوف بشأن الفساد في الحكومة والنظام القضائي."
    ],
    "points": 494,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1705059253
  },
  {
    "id": 38972153,
    "title": "DevDocs: توثيق شامل لواجهة برمجة التطبيقات باستخدام جافا سكريبت",
    "originLink": "https://devdocs.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38972153",
    "commentBody": "",
    "originSummary": [
      "وثائق واجهة برمجة تطبيقات DevDocs عبارة عن نظام أساسي يوفر وثائق شاملة لواجهات برمجة التطبيقات المختلفة.",
      "مطلوب جافا سكريبت للوصول إلى ميزات النظام الأساسي والاستفادة منها.",
      "يوفر النظام الأساسي التفضيلات والبيانات غير المتصلة بالإنترنت وسجل التغيير والأدلة ومعلومات حول الإبلاغ عن الأخطاء والقدرة على تخصيص الإعدادات."
    ],
    "commentSummary": [
      "يثني المستخدمون على DevDocs لتأثيره الإيجابي على حياتهم المهنية.",
      "يعبر المستخدمون عن إحباطهم من القيود بما في ذلك صعوبة التحديث وعدم قدرة التطبيق على الاحتفاظ بالوثائق المحددة.",
      "يتم اقتراح حلول بديلة مثل devdocs-desktop."
    ],
    "points": 364,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1705085199
  },
  {
    "id": 38971966,
    "title": "Marimo: دفتر ملاحظات تفاعلي مفتوح المصدر ل Python مع تخزين متوافق مع Git",
    "originLink": "https://github.com/marimo-team/marimo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38971966",
    "commentBody": "",
    "originSummary": [
      "Marimo هو دفتر ملاحظات تفاعلي مفتوح المصدر ل Python يعالج القيود في أجهزة الكمبيوتر المحمولة التقليدية.",
      "يوفر قابلية التكرار والتخزين الصديق ل Git والقدرة على تنفيذ دفاتر الملاحظات كنصوص Python النصية ونشرها كتطبيقات ويب.",
      "تضمن دفاتر ملاحظات Marimo الاتساق بين التعليمات البرمجية والمخرجات وحالة البرنامج ، وتوفر عناصر واجهة المستخدم مثل أشرطة التمرير ومحولات إطار البيانات والمخططات التفاعلية التي تتزامن مع Python. ويهدف إلى تحسين بيئة البرمجة للبحث والتواصل والتجريب وتدريس العلوم الحاسوبية."
    ],
    "commentSummary": [
      "Marimo هي مكتبة Python مفتوحة المصدر تعمل على تحسين دفاتر الملاحظات التقليدية من خلال توفير قابلية التكرار والملاءمة ل git والقدرة على تنفيذها كنصوص برمجية أو نشرها كتطبيقات ويب.",
      "توفر دفاتر ملاحظات Marimo تعليمات برمجية ومخرجات وحالة برنامج متسقة ، وتتضمن عناصر واجهة مستخدم تفاعلية.",
      "المستخدمون متحمسون لإمكانات Marimo في البحث والتواصل والتجريب وتعلم العلوم الحاسوبية ، مشيدين بسهولة استخدامه والقدرة على إنشاء عناوين URL عامة بسرعة. ومع ذلك ، لا تزال المناقشات جارية حول القيود والتحديات ، مثل قابلية التكرار وإدارة الحزم والتكامل مع الأدوات الأخرى. بشكل عام ، ينظر إلى ماريمو على أنه بديل قيم ل Jupyter للأدوات العلمية."
    ],
    "points": 344,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1705084397
  },
  {
    "id": 38972735,
    "title": "OpenAI يزيل الحظر المفروض على الاستخدام العسكري والحربي ل ChatGPT",
    "originLink": "https://theintercept.com/2024/01/12/open-ai-military-ban-chatgpt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38972735",
    "commentBody": "",
    "originSummary": [
      "أزالت OpenAI الحظر المفروض على استخدام تقنيتها ، بما في ذلك ChatGPT ، لأغراض \"عسكرية وحربية\" من سياسة الاستخدام الخاصة بها.",
      "لا تزال السياسة الجديدة تحظر استخدام التكنولوجيا لإيذاء النفس أو الآخرين ، ولكن تم إلغاء الحظر المحدد على التطبيقات العسكرية.",
      "يأتي قرار OpenAI في الوقت الذي تواجه فيه اهتماما متزايدا من البنتاغون ومجتمع الاستخبارات الأمريكي ، مما يثير مخاوف بشأن المخاطر والأضرار المحتملة المرتبطة بتكنولوجيا الذكاء الاصطناعي في الاستخدام العسكري. لا تزال عواقب هذا التغيير في السياسة غير واضحة."
    ],
    "commentSummary": [
      "رفعت OpenAI الحظر المفروض على استخدام نموذج ChatGPT لأغراض \"عسكرية وحربية\".",
      "ينتقد بعض المستخدمين OpenAI لابتعاده عن مبادئه الأصلية ، بينما يتكهن آخرون بالضغوط التنافسية.",
      "تشمل المناقشات الآثار الأخلاقية والمخاطر المحتملة وأداء الذكاء الاصطناعي في الحرب بالإضافة إلى تأثير استثمار Microsoft واهتمام Apple بترخيص بيانات التدريب."
    ],
    "points": 324,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1705087673
  },
  {
    "id": 38968550,
    "title": "نحن بحاجة إلى تقنية أقل غامرة ، وليس أكثر",
    "originLink": "https://filiph.net/text/we-need-technology-that-is-less-immersive,-not-more.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968550",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال التأثير السلبي للتكنولوجيا الغامرة ، وخاصة ألعاب الفيديو ، على المجتمع.",
      "يؤكد المؤلف أن المهندسين الموهوبين يتم تحويلهم نحو تكنولوجيا الترفيه بدلا من معالجة القضايا الهندسية الأكثر إلحاحا.",
      "يقال إن الفترات الطويلة من لعب ألعاب الفيديو تؤدي إلى عدم الراحة الجسدية وتضاؤل الذكاء ، حيث يزعم أن صناعة الألعاب تهيمن على اللعب البشري.",
      "يشجع المؤلف المهندسين على إعطاء الأولوية لحل مشاكل العالم الحقيقي ويسلط الضوء على الخيارات البديلة ، بما في ذلك إنشاء تطبيقات وألعاب غير غامرة واستكشاف الفرص في الحبر الإلكتروني والشاشات الشفافة وإنترنت الأشياء.",
      "في النهاية ، يؤكد المقال على أن المهندسين لديهم الاستقلالية لتقرير كيفية استخدامهم لمهاراتهم."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة واسعة من الموضوعات المتعلقة بالتكنولوجيا ، بما في ذلك إعطاء الأولوية للتكنولوجيا الأقل غامرة والعواقب السلبية المحتملة للواقع الافتراضي ووسائل التواصل الاجتماعي.",
      "كما يستكشف أهمية الترفيه والجماليات وتصميم واجهة المستخدم في ألعاب الفيديو ، فضلا عن دور التكنولوجيا في المجتمع وتأثير الأجهزة والمحفزات الخارجية.",
      "كما تتطرق المناقشة إلى أهمية الإعلان وسلوك المستهلك، والتحديات التي يواجهها الأفراد الموهوبون في اختيار الوظائف، وأهمية التنفيذ والأفكار في الفن، والمخاطر والفوائد المحتملة للواقع الافتراضي."
    ],
    "points": 283,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1705070632
  },
  {
    "id": 38977128,
    "title": "حشرة Valve التي استمرت عقدا من الزمان تصيب مجتمع Counter-Strike",
    "originLink": "https://blog.freudenjmp.com/posts/no-user-logon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38977128",
    "commentBody": "",
    "originSummary": [
      "يسلط المقال الضوء على خطأ طويل الأمد في Counter-Strike فشل Valve في معالجته على الرغم من ملاحظات المجتمع وتقارير الأخطاء.",
      "يعرب المؤلف عن إحباطه من عدم استجابة Valve والتأثير السلبي للخطأ على تجربة الألعاب.",
      "يحققون في مشكلة خطأ تسجيل دخول المستخدم في CS2 ويحددونها على أنها مشكلة في التحقق من الصحة تتعلق بجلود اللاعبين ، ناتجة عن عملية التحقق الفاشلة باستخدام Steam3 وخطأ في اللعبة نفسها.",
      "يوفر المؤلف إرشادات للمستخدمين لتجنب تشغيل الخطأ ويبلغ عن انخفاض في تذاكر تسجيل دخول المستخدم ذات الصلة بعد تنفيذ الإصلاح."
    ],
    "commentSummary": [
      "يمكن أن يتسبب الخطأ المتعلق بتذاكر الجلسة والمصادقة في Counter-Strike في حدوث مقاطعات وانضمام اللاعبين إلى خوادم اللعبة بدون تذكرة.",
      "تقدم المقالة شرحا متعمقا للخطأ وعواقبه المحتملة ، إلى جانب اقتراحات لحل بديل.",
      "يحتوي قسم التعليقات على تعليقات على المقالة وأسئلة إضافية حول الخطأ."
    ],
    "points": 254,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1705117041
  },
  {
    "id": 38966306,
    "title": "تبيع IAC 17 تطبيقا ل Bending Spoons مقابل 100 مليون دولار ، مما يؤدي إلى تسريح جماعي للعمال",
    "originLink": "https://twitter.com/rjonesy/status/1745567200600076531",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966306",
    "commentBody": "",
    "originSummary": [
      "باعت شركة الإنترنت IAC 17 تطبيقا إلى Bending Spoons في صفقة بقيمة 100 مليون دولار ، مما أدى إلى إنهاء جميع الموظفين البالغ عددهم 330.",
      "تعتبر تطبيقات Robokiller و PDF Hero أبرز عمليات الاستحواذ في هذه الصفقة.",
      "هناك مخاوف بشأن تكتيكات Bending Spoons العدوانية المفصلة في دليل اللعب الخاص بهم ، بما في ذلك بيع بيانات المستخدم ، وتكثيف الإعلانات ، والنقص الملحوظ في الميزات الجديدة."
    ],
    "commentSummary": [
      "باعت IAC 17 تطبيقا إلى Bending Spoons مقابل 100 مليون دولار ، مما أدى إلى إنهاء جميع الموظفين البالغ عددهم 330.",
      "تشتهر Bending Spoons بالحصول على تطبيقات مع مستخدمين مخصصين وتنفيذ برامج إعلانية متطفلة لجمع بيانات المستخدم لتحقيق مكاسب مالية.",
      "يثير الجدل المحيط بهذه الصفقة تساؤلات حول مسؤولية المستثمر ، وتراجع Meetup ، والمنصات البديلة ، والمحتوى الذي أنشأته الحكومة ، وعدم رضا المستخدم عن Evernote ، والملكية والتحكم في عمليات الاستحواذ على التطبيقات ، وإعطاء الأولوية للربح على تجربة المستخدم."
    ],
    "points": 238,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1705055052
  },
  {
    "id": 38967262,
    "title": "إيرباص تحطم الرقم القياسي مع 2,319 طلبية طائرة في عام 2023",
    "originLink": "https://www.wsj.com/business/airlines/airbus-shatters-record-for-jet-orders-as-demand-soars-a9f75750",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38967262",
    "commentBody": "",
    "originSummary": [
      "حققت إيرباص ، أكبر صانع للطائرات في العالم ، رقما قياسيا جديدا مع إجمالي طلبيات 2,319 في عام 2023 ، متجاوزة رقمها القياسي السابق من عام 2014.",
      "وتأتي الزيادة الكبيرة في الطلبات بسبب الطلب القوي على الطائرات الجديدة.",
      "ويسلط هذا الإنجاز الضوء على نجاح إيرباص المستمر وهيمنتها في صناعة الطيران."
    ],
    "commentSummary": [
      "وتسلط المناقشة الضوء على التحديات التي تواجهها بوينغ وهيمنة إيرباص في صناعة الطيران.",
      "تشمل الموضوعات التي يتم تناولها مشاكل محركات الطائرات ، والاعتماد على التكنولوجيا الأمريكية ، وانتقاد ثقافة بوينج وأدائها في برامج الدفاع ، ومخاوف السلامة ، ومستقبل الشركة.",
      "كما تتطرق المناقشة إلى المقارنات بين طائرات بوينغ وإيرباص، وأنظمة التحكم في الطيارين، والإعانات الحكومية، والسوق التنافسية، وقوانين العمل، والأمن الوظيفي في إيرباص."
    ],
    "points": 233,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1705062533
  },
  {
    "id": 38967744,
    "title": "التغييرات في \"مساعد Google\" لتحسين تجربة المستخدم",
    "originLink": "https://blog.google/products/assistant/google-assistant-update-january-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38967744",
    "commentBody": "",
    "originSummary": [
      "يخضع \"مساعد Google\" لتغييرات لتحسين تجربة المستخدم من خلال إزالة الميزات الأقل استخداما.",
      "سيتم إيقاف بعض الميزات ، وسيتم إعلام المستخدمين عندما لم يعد مدعوما.",
      "سيبدأ رمز الميكروفون في تطبيق Google الآن نتائج البحث بدلا من تنفيذ الإجراءات ، مما يدفع المستخدمين إلى ترقية التطبيق للحصول على وظائف مساعد Google المثلى."
    ],
    "commentSummary": [
      "يعاني المستخدمون من إحباطات وقيود على واجهات المستخدم التي تعتمد على الصوت مثل مساعد Google و Alexa ، بما في ذلك التغييرات التخريبية ، وعدم إمكانية الاكتشاف ، والإشعارات غير الضرورية ، والانقطاعات.",
      "هناك مخاوف بشأن الخصوصية واستخدام البيانات ، بالإضافة إلى المقارنات بين المساعدين الصوتيين المختلفين.",
      "يعبر بعض المستخدمين عن عدم رضاهم عن منتجات Google وينتقدون سلوكهم المناهض للمنافسة. بشكل عام ، الآراء حول فعالية وفائدة المساعدين الصوتيين مختلطة."
    ],
    "points": 206,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1705066613
  },
  {
    "id": 38968269,
    "title": "سيتي جروب يخفض 20 ألف وظيفة في خطة إعادة الهيكلة",
    "originLink": "https://www.wsj.com/livecoverage/stock-market-today-dow-jones-bank-earnings-01-12-2024/card/citigroup-plans-to-cut-20-000-jobs-KCIfucmQx18qn9TfDESs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968269",
    "commentBody": "",
    "originSummary": [
      "وستخفض سيتي جروب 20 ألف وظيفة بحلول نهاية عام 2026 كجزء من خطة إعادة الهيكلة.",
      "لدى البنك حاليا ما يقرب من 200000 موظف ، لا يشمل ذلك عملياته في المكسيك والتي سيتم فصلها.",
      "شهدت سيتي جروب خسارة في الربع الأخير ، ويرجع ذلك أساسا إلى الرسوم لمرة واحدة."
    ],
    "commentSummary": [
      "تخطط سيتي جروب لتسريح 20000 موظف بحلول نهاية عام 2026 ، مما يثير مخاوف بشأن التأثير المحتمل على العمالة الناقصة والمجتمعات المحلية.",
      "يجادل النقاد بأن الشركات يجب أن تعطي الأولوية للحفاظ على توظيف الناس ، بغض النظر عن الاعتبارات الاستراتيجية ، والنظر في التأثير الأوسع على الاقتصاد.",
      "وتشمل المناقشات فعالية بنك الاحتياطي الفيدرالي، والمقارنات بين سيتي جروب ومنافسيها، والقدرة على تحمل تكاليف الإسكان، ومعدلات البطالة، والتجارب الشخصية مع فقدان الوظائف والخدمات المصرفية."
    ],
    "points": 194,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1705069487
  },
  {
    "id": 38968619,
    "title": "تحدي التفكير النقدي والتغلب على المعلومات الخاطئة",
    "originLink": "https://slatestarcodex.com/2019/06/03/repost-epistemic-learned-helplessness/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968619",
    "commentBody": "",
    "originSummary": [
      "يناقش منشور المدونة أهمية العقلانية ومهارة إقناع الآخرين من خلال الحجج.",
      "يشارك المؤلف تجربته الشخصية في الاقتناع بالمعلومات الخاطئة ويؤكد على أهمية التفكير النقدي.",
      "يتم التطرق إلى مواضيع مختلفة مثل الكاثوليكية وعلم تحسين النسل وتأثير الذكاء الخارق ، مما يسلط الضوء على ضعف الأفراد غير المتعلمين أمام الحجج الخادعة.",
      "يستكشف قسم التعليقات تحديات التمييز بين الحجج الصحيحة والكاذبة وصعوبات فهم الأحداث التاريخية.",
      "ويختتم المنشور بالتأكيد على الحاجة إلى التحليل القائم على الأدلة وتحديات تحقيق اليقين في الأنظمة المعقدة."
    ],
    "commentSummary": [
      "يناقش المنشور مفهوم العجز المعرفي المكتسب وفوائد احتضان نقص المعرفة.",
      "ويشدد على أهمية عدم القفز إلى الاستنتاجات وقيمة التفكير ومحاولة حل المشاكل قبل البحث عن مصادر خارجية.",
      "تمتد المحادثة إلى مواضيع مختلفة مثل مناهج التعلم ، واستجواب الخبراء ، والعمل التعاوني ، وجودة التعليم ، ودور الديمقراطيات في العنف الذي ترعاه الدولة."
    ],
    "points": 191,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1705070976
  },
  {
    "id": 38966601,
    "title": "تحسين تجربة المستخدم في CLI: دراسة حالة لمحرك تنسيق التعليمات البرمجية الخاص ب Topiary",
    "originLink": "https://www.tweag.io/blog/2023-10-05-cli-ux-in-topiary/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966601",
    "commentBody": "",
    "originSummary": [
      "تركز دراسة الحالة على التحديات التي تواجهها واجهة سطر الأوامر (CLI) لمحرك تنسيق التعليمات البرمجية Topiary.",
      "تسلط الدراسة الضوء على أهمية تحسين تجربة المستخدم وتناقش التغييرات التي تم إجراؤها على Topiary CLI لمعالجة هذه القضايا.",
      "يتضمن تجديد CLI إزالة الافتراضات ، ودمج مبادئ البرمجة الوظيفية ، واستخدام مكتبة clap لتحديد وسيطات CLI ، وإدخال الأوامر الفرعية ، وإضافة ميزة الإكمال."
    ],
    "commentSummary": [
      "تستكشف مجموعة دراسات الحالة والمناقشات التحديات والاعتبارات المتعلقة بواجهات سطر الأوامر (CLIs) وقابليتها للاستخدام.",
      "تشمل الموضوعات التي يتم تناولها الطبيعة المخيفة ل CLI ، والحاجة إلى معرفة دقيقة ببناء الجملة ، وعدم إمكانية الاكتشاف في البيئات الطرفية ، والصعوبة التي يواجهها المستخدمون المبتدئون في التنقل وفهم CLIs.",
      "تناقش المقالات فوائد وقيود CLIs مقارنة بواجهات المستخدم الرسومية (GUIs) ، وتقترح طرقا لتحسين قابلية استخدام CLI ، وتناقش الأساليب المختلفة لهيكل الأوامر والخيارات. يؤكدون على أهمية التصميم سهل الاستخدام والتوثيق الواضح وفهم احتياجات المستخدم وقدراته."
    ],
    "points": 166,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1705057307
  }
]
