[
  {
    "id": 38966875,
    "title": "Posta İdaresinin Aldatma ve Tehditleri İhbarcı Davasında İfşa Edildi",
    "originLink": "https://www.bbc.co.uk/news/uk-67884743",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966875",
    "commentBody": "",
    "originSummary": [
      "Posta İdaresi, kurum içindeki sorunları ortaya koyan bir BBC belgeselini gizlemeye ve itibarsızlaştırmaya çalıştı.",
      "Yanlış bilgiler, yasal işlem tehditleri ve yanlış bilgilendirme kampanyası kullandılar.",
      "Çabalarına rağmen skandal büyük ilgi gördü ve mahkumiyet kararlarının bozulmasına neden oldu."
    ],
    "commentSummary": [
      "Birleşik Krallık Posta İdaresi, bir ihbarcı ve postacılara yönelik yanlış dolandırıcılık suçlamalarına yol açan hatalı yazılımla ilgili olarak sahtekârlık ve gözdağı verme suçlamalarıyla karşı karşıya.",
      "Mahkeme kararına rağmen, Postane'nin tazminatı azaltması ve temyiz başvurularında bulunmaya devam etmesi ve iki yıl daha 95 milyon Sterlin ödediği Horizon yazılımını kullanmaya devam etmesi nedeniyle hesap verebilirlik sağlanamamıştır.",
      "Bireylerin mahkemede karşılaştıkları zorluklar, delil eksikliği ve gizli deliller, Postanenin mağdur ve savcı olarak ikili rolü ve özel savcıların kullanımı ile ilgili endişeler dile getirilmiştir. Bu skandal, hesap verilebilirlik taleplerini, ilgili CEO'nun onurunun elinden alınmasını ve hükümet ile adalet sistemindeki yolsuzlukla ilgili endişeleri tetikledi."
    ],
    "points": 494,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1705059253
  },
  {
    "id": 38972153,
    "title": "DevDocs: JavaScript ile Kapsamlı API Dokümantasyonu",
    "originLink": "https://devdocs.io",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38972153",
    "commentBody": "",
    "originSummary": [
      "DevDocs API Dokümantasyonu, çeşitli API'ler için kapsamlı dokümantasyon sağlayan bir platformdur.",
      "Platformun özelliklerine erişmek ve bunları kullanmak için JavaScript gereklidir.",
      "Platform tercihler, çevrimdışı veriler, bir değişiklik günlüğü, kılavuzlar, hataları bildirme bilgileri ve ayarları özelleştirme olanağı sunuyor."
    ],
    "commentSummary": [
      "Kullanıcılar DevDocs'u kariyerleri üzerindeki olumlu etkisi nedeniyle övüyor.",
      "Kullanıcılar, güncelleme zorluğu ve uygulamanın seçilen belgeleri saklayamaması gibi sınırlamalarla ilgili hayal kırıklıklarını dile getirmektedir.",
      "devdocs-desktop gibi alternatif çözümler önerilmektedir."
    ],
    "points": 364,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1705085199
  },
  {
    "id": 38971966,
    "title": "Marimo: Git Dostu Depolama ile Python için Açık Kaynaklı Reaktif Not Defteri",
    "originLink": "https://github.com/marimo-team/marimo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38971966",
    "commentBody": "",
    "originSummary": [
      "Marimo, Python için geleneksel not defterlerindeki sınırlamaları ele alan açık kaynaklı bir reaktif not defteridir.",
      "Yeniden üretilebilirlik, Git dostu depolama ve not defterlerini Python komut dosyaları olarak çalıştırma ve web uygulamaları olarak dağıtma yeteneği sağlar.",
      "Marimo not defterleri kod, çıktılar ve program durumu arasında tutarlılık sağlar ve Python ile senkronize olan kaydırıcılar, veri çerçevesi dönüştürücüler ve etkileşimli grafikler gibi kullanıcı arayüzü öğeleri sunar. Araştırma, iletişim, deney ve hesaplamalı bilim öğretimi için programlama ortamını iyileştirmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "Marimo, yeniden üretilebilirlik, git dostu olma ve komut dosyası olarak yürütülebilme veya web uygulamaları olarak dağıtılabilme yeteneği sağlayarak geleneksel not defterlerini geliştiren açık kaynaklı bir Python kütüphanesidir.",
      "Marimo not defterleri tutarlı kod, çıktılar ve program durumu sunar ve etkileşimli kullanıcı arayüzü öğeleri içerir.",
      "Kullanıcılar, Marimo'nun araştırma, iletişim, deney ve hesaplamalı bilimi öğrenme potansiyeli konusunda heyecan duymakta, kullanım kolaylığını ve hızlı bir şekilde herkese açık URL'ler oluşturma yeteneğini övmektedir. Bununla birlikte, yeniden üretilebilirlik, paket yönetimi ve diğer araçlarla entegrasyon gibi sınırlamalar ve zorluklar üzerine tartışmalar devam etmektedir. Genel olarak Marimo, bilimsel araçlar için Jupyter'e değerli bir alternatif olarak görülüyor."
    ],
    "points": 344,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1705084397
  },
  {
    "id": 38972735,
    "title": "OpenAI, ChatGPT'nin Askeri ve Savaşta Kullanımına İlişkin Yasağı Kaldırdı",
    "originLink": "https://theintercept.com/2024/01/12/open-ai-military-ban-chatgpt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38972735",
    "commentBody": "",
    "originSummary": [
      "OpenAI, ChatGPT de dahil olmak üzere teknolojisinin \"askeri ve savaş\" amaçlı kullanımına ilişkin yasağı kullanım politikasından kaldırdı.",
      "Yeni politika, teknolojinin kendine veya başkalarına zarar vermek için kullanılmasını hala yasaklıyor, ancak askeri uygulamalara yönelik özel yasak ortadan kaldırıldı.",
      "OpenAI'nin kararı, Pentagon ve ABD istihbarat topluluğunun artan ilgisiyle karşı karşıya kaldığı ve askeri kullanımda yapay zeka teknolojisiyle ilişkili potansiyel riskler ve zararlar konusunda endişeleri artırdığı bir dönemde geldi. Bu politika değişikliğinin sonuçları henüz belirsiz."
    ],
    "commentSummary": [
      "OpenAI, ChatGPT modelinin \"askeri ve savaş\" amaçlı kullanımına yönelik yasağı kaldırdı.",
      "Bazı kullanıcılar OpenAI'yi orijinal ilkelerinden uzaklaştığı için eleştirirken, diğerleri rekabetçi baskılar hakkında spekülasyon yapıyor.",
      "Tartışmalar, Microsoft'un yatırımının ve Apple'ın eğitim verilerini lisanslama konusundaki ilgisinin etkisinin yanı sıra etik sonuçları, olası riskleri ve yapay zekanın savaştaki performansını da kapsıyor."
    ],
    "points": 324,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1705087673
  },
  {
    "id": 38968550,
    "title": "Daha fazla değil, daha az sürükleyici teknolojiye ihtiyacımız var",
    "originLink": "https://filiph.net/text/we-need-technology-that-is-less-immersive,-not-more.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968550",
    "commentBody": "",
    "originSummary": [
      "Makale, sürükleyici teknolojinin, özellikle de video oyunlarının toplum üzerindeki olumsuz etkilerini araştırıyor.",
      "Yazar, yetenekli mühendislerin daha acil mühendislik sorunlarını ele almak yerine eğlence teknolojisine yönlendirildiğini iddia ediyor.",
      "Oyun endüstrisinin insan oyunlarına hükmettiği iddia edildiğinden, uzun süreli video oyunu oynamanın fiziksel rahatsızlığa ve zekanın azalmasına neden olduğu ileri sürülmektedir.",
      "Yazar, mühendisleri gerçek dünya sorunlarını çözmeye öncelik vermeye teşvik ediyor ve sürükleyici olmayan uygulamalar ve oyunlar oluşturmak ve e-Ink, şeffaf ekranlar ve IoT'deki fırsatları keşfetmek de dahil olmak üzere alternatif seçenekleri vurguluyor.",
      "Nihayetinde makale, mühendislerin becerilerini nasıl kullanacaklarına karar verme özerkliğine sahip olduklarını vurguluyor."
    ],
    "commentSummary": [
      "Tartışma, daha az sürükleyici teknolojiye öncelik verilmesi ve sanal gerçeklik ve sosyal medyanın potansiyel olumsuz sonuçları da dahil olmak üzere teknolojiyle ilgili çok çeşitli konuları kapsamaktadır.",
      "Ayrıca video oyunlarında eğlence, estetik ve kullanıcı arayüzü tasarımının öneminin yanı sıra teknolojinin toplumdaki rolünü ve cihazların ve dış uyaranların etkisini de araştırır.",
      "Tartışmada ayrıca reklam ve tüketici davranışının önemi, yüksek yetenekli bireylerin iş seçiminde karşılaştıkları zorluklar, sanatta icra ve fikirlerin önemi ve sanal gerçekliğin potansiyel risk ve faydaları da ele alınıyor."
    ],
    "points": 283,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1705070632
  },
  {
    "id": 38977128,
    "title": "Valve'ın On Yıldır Süren Hatası Counter-Strike Topluluğunun Başına Bela Oldu",
    "originLink": "https://blog.freudenjmp.com/posts/no-user-logon/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38977128",
    "commentBody": "",
    "originSummary": [
      "Makale, Counter-Strike'ta uzun süredir devam eden ve Valve'ın topluluk geri bildirimlerine ve hata raporlarına rağmen çözemediği bir hataya dikkat çekiyor.",
      "Yazar, Valve'in yanıt vermemesinden ve hatanın oyun deneyimi üzerindeki olumsuz etkisinden duyduğu hayal kırıklığını dile getiriyor.",
      "CS2'deki bir kullanıcı oturum açma hatası sorununu araştırdılar ve Steam3 ile başarısız bir doğrulama işleminden ve oyunun kendisindeki bir hatadan kaynaklanan oyuncu görünümleriyle ilgili bir doğrulama sorunu olarak tanımladılar.",
      "Yazar, kullanıcıların hatayı tetiklemekten kaçınmaları için talimatlar sunmakta ve bir düzeltme uyguladıktan sonra ilgili kullanıcı oturum açma biletlerinde bir azalma olduğunu bildirmektedir."
    ],
    "commentSummary": [
      "Counter-Strike'ta oturum biletleri ve kimlik doğrulama ile ilgili bir hata, kesintilere ve oyuncuların oyun sunucularına bilet olmadan katılmasına neden olabilir.",
      "Makale, hatanın ve olası sonuçlarının derinlemesine bir açıklamasının yanı sıra geçici bir çözüm için öneriler de sunmaktadır.",
      "Yorumlar bölümü, makaleyle ilgili geri bildirimleri ve hatayla ilgili ek soruları içerir."
    ],
    "points": 254,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1705117041
  },
  {
    "id": 38966306,
    "title": "IAC 17 Uygulamayı 100 Milyon Dolara Bending Spoons'a Satarak Toplu İşten Çıkarmalara Yol Açtı",
    "originLink": "https://twitter.com/rjonesy/status/1745567200600076531",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966306",
    "commentBody": "",
    "originSummary": [
      "İnternet şirketi IAC, 17 uygulamayı 100 milyon dolarlık bir anlaşmayla Bending Spoons'a sattı ve 330 çalışanın tamamının işine son verdi.",
      "Robokiller ve PDF Hero uygulamaları bu işlemdeki en önemli satın almalar olarak kabul ediliyor.",
      "Bending Spoons'un kullanıcı verilerini satmak, reklamları yoğunlaştırmak ve yeni özelliklerin algılanan eksikliği de dahil olmak üzere oyun kitaplarında ayrıntılı olarak açıklanan agresif taktiklerine ilişkin endişeler var."
    ],
    "commentSummary": [
      "IAC, 17 uygulamayı 100 milyon dolara Bending Spoons'a satarak 330 çalışanın tamamının işine son verdi.",
      "Bending Spoons, özel kullanıcılara sahip uygulamaları edinmesi ve finansal kazanç için kullanıcı verilerini toplamak üzere müdahaleci reklam yazılımları uygulamasıyla bilinir.",
      "Bu anlaşmayı çevreleyen tartışmalar, yatırımcı sorumluluğu, Meetup'ın düşüşü, alternatif platformlar, devlet tarafından oluşturulan içerik, Evernote'tan kullanıcı memnuniyetsizliği, uygulama satın almalarında sahiplik ve kontrol ve kullanıcı deneyimi yerine kârın önceliklendirilmesi hakkında soruları gündeme getiriyor."
    ],
    "points": 238,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1705055052
  },
  {
    "id": 38967262,
    "title": "Airbus 2023 Yılında 2.319 Jet Siparişi ile Rekor Kırdı",
    "originLink": "https://www.wsj.com/business/airlines/airbus-shatters-record-for-jet-orders-as-demand-soars-a9f75750",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38967262",
    "commentBody": "",
    "originSummary": [
      "Dünyanın en büyük uçak üreticisi Airbus, 2023 yılında 2.319 brüt siparişle yeni bir rekora imza atarak 2014 yılındaki bir önceki rekorunu geride bıraktı.",
      "Siparişlerdeki önemli artış, yeni uçaklara yönelik güçlü talepten kaynaklanmaktadır.",
      "Bu başarı, Airbus'ın havacılık sektöründe süregelen başarısını ve hakimiyetini vurgulamaktadır."
    ],
    "commentSummary": [
      "Tartışmada Boeing'in karşılaştığı zorluklar ve Airbus'ın havacılık sektöründeki hakimiyeti vurgulanıyor.",
      "Ele alınan konular arasında uçak motoru sorunları, Amerikan teknolojisine güven, Boeing'in kültürüne ve savunma programlarındaki performansına yönelik eleştiriler, güvenlik endişeleri ve şirketin geleceği yer alıyor.",
      "Tartışmada ayrıca Boeing ve Airbus uçakları arasındaki karşılaştırmalar, pilot kontrol sistemleri, devlet sübvansiyonları, rekabet piyasası, iş kanunları ve Airbus'taki iş güvenliği konularına da değiniliyor."
    ],
    "points": 233,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1705062533
  },
  {
    "id": 38967744,
    "title": "Geliştirilmiş Kullanıcı Deneyimi için Google Asistan'da Yapılan Değişiklikler",
    "originLink": "https://blog.google/products/assistant/google-assistant-update-january-2024/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38967744",
    "commentBody": "",
    "originSummary": [
      "Google Asistan, daha az kullanılan özellikleri kaldırarak kullanıcı deneyimini geliştirmek için değişiklikler geçiriyor.",
      "Bazı özellikler kullanımdan kaldırılacak ve artık desteklenmediklerinde kullanıcılar bilgilendirilecektir.",
      "Google uygulamasındaki mikrofon simgesi artık eylemleri gerçekleştirmek yerine arama sonuçlarını başlatacak ve kullanıcıları en iyi Google Asistan işlevselliği için uygulamayı yükseltmeye teşvik edecek."
    ],
    "commentSummary": [
      "Kullanıcılar, Google Asistan ve Alexa gibi sesle çalışan kullanıcı arayüzlerinde, rahatsız edici değişiklikler, keşfedilebilirlik eksikliği, gereksiz bildirimler ve kesintiler gibi hayal kırıklıkları ve sınırlamalar yaşamaktadır.",
      "Gizlilik ve veri kullanımının yanı sıra farklı sesli asistanlar arasındaki karşılaştırmalarla ilgili endişeler var.",
      "Bazı kullanıcılar Google'ın ürünlerinden memnuniyetsizliklerini dile getirmekte ve rekabete aykırı davranışlarını eleştirmektedir. Genel olarak, sesli asistanların etkinliği ve kullanışlılığı hakkındaki görüşler karışıktır."
    ],
    "points": 206,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1705066613
  },
  {
    "id": 38968269,
    "title": "Citigroup Yeniden Yapılandırma Planı Kapsamında 20 Bin Kişiyi İşten Çıkaracak",
    "originLink": "https://www.wsj.com/livecoverage/stock-market-today-dow-jones-bank-earnings-01-12-2024/card/citigroup-plans-to-cut-20-000-jobs-KCIfucmQx18qn9TfDESs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968269",
    "commentBody": "",
    "originSummary": [
      "Citigroup, yeniden yapılandırma planının bir parçası olarak 2026 yılı sonuna kadar 20.000 kişiyi işten çıkaracak.",
      "Bankanın şu anda, ayrılacak olan Meksika operasyonları hariç olmak üzere yaklaşık 200.000 çalışanı bulunmaktadır.",
      "Citigroup, özellikle tek seferlik masraflar nedeniyle son çeyrekte zarar etmiştir."
    ],
    "commentSummary": [
      "Citigroup'un 2026 yılı sonuna kadar 20.000 çalışanı işten çıkarmayı planlaması, eksik istihdam ve yerel topluluklar üzerindeki potansiyel etkiye ilişkin endişeleri artırıyor.",
      "Eleştirmenler, şirketlerin stratejik kaygılardan bağımsız olarak insanları istihdamda tutmaya öncelik vermeleri ve ekonomi üzerindeki daha geniş etkiyi göz önünde bulundurmaları gerektiğini savunuyor.",
      "Tartışmalar arasında Federal Rezerv'in etkinliği, Citigroup ve rakipleri arasındaki karşılaştırmalar, konut satın alınabilirliği, işsizlik oranları ve iş kaybı ve bankacılık hizmetleri ile ilgili kişisel deneyimler yer almaktadır."
    ],
    "points": 194,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1705069487
  },
  {
    "id": 38968619,
    "title": "Eleştirel Düşünme ve Yanlış Bilgilerin Üstesinden Gelme Zorluğu",
    "originLink": "https://slatestarcodex.com/2019/06/03/repost-epistemic-learned-helplessness/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38968619",
    "commentBody": "",
    "originSummary": [
      "Blog yazısında rasyonelliğin önemi ve argümanlar yoluyla başkalarını ikna etme becerisi tartışılıyor.",
      "Yazar, yanlış bilgilerle ikna edilme konusundaki kişisel deneyimlerini paylaşmakta ve eleştirel düşünmenin önemini vurgulamaktadır.",
      "Katoliklik, öjenik ve süper zekânın etkisi gibi çeşitli konulara değinilerek, eğitimsiz bireylerin aldatıcı argümanlara karşı savunmasızlığı vurgulanıyor.",
      "Yorum bölümünde, doğru ve yanlış argümanları birbirinden ayırmanın ve tarihi olayları anlamanın zorlukları ele alınmaktadır.",
      "Yazı, kanıta dayalı analiz ihtiyacını ve karmaşık sistemlerde kesinliğe ulaşmanın zorluklarını vurgulayarak sona eriyor."
    ],
    "commentSummary": [
      "Yazıda epistemik öğrenilmiş çaresizlik kavramı ve kişinin bilgi eksikliğini kabullenmesinin faydaları tartışılmaktadır.",
      "Hemen sonuca varmamanın önemini ve dış kaynaklara başvurmadan önce düşünmenin ve sorunları çözmeye çalışmanın değerini vurgular.",
      "Sohbet, öğrenme yaklaşımları, uzmanları sorgulama, işbirlikçi çalışma, eğitim kalitesi ve devlet destekli şiddette demokrasilerin rolü gibi çeşitli konulara uzanıyor."
    ],
    "points": 191,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1705070976
  },
  {
    "id": 38966601,
    "title": "CLI'da Kullanıcı Deneyimini İyileştirme: Topiary'nin Kod Biçimlendirme Motoru Üzerine Bir Vaka Çalışması",
    "originLink": "https://www.tweag.io/blog/2023-10-05-cli-ux-in-topiary/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38966601",
    "commentBody": "",
    "originSummary": [
      "Bu vaka çalışması, Topiary kod biçimlendirme motorunun komut satırı arayüzünün (CLI) karşılaştığı zorluklara odaklanmaktadır.",
      "Çalışma, kullanıcı deneyimini iyileştirmenin önemini vurgulamakta ve bu sorunları ele almak için Topiary CLI'da yapılan değişiklikleri tartışmaktadır.",
      "CLI'nin yenilenmesi, varsayımların ortadan kaldırılmasını, işlevsel programlama ilkelerinin dahil edilmesini, CLI argümanlarını tanımlamak için clap kütüphanesinin kullanılmasını, alt komutların tanıtılmasını ve bir tamamlama özelliğinin eklenmesini içerir."
    ],
    "commentSummary": [
      "Örnek olay incelemeleri ve tartışmalar koleksiyonu, komut satırı arayüzleri (CLI'lar) ve bunların kullanılabilirliği ile ilgili zorlukları ve hususları araştırmaktadır.",
      "Ele alınan konular arasında CLI'ların göz korkutucu doğası, kesin sözdizimi bilgisi ihtiyacı, terminal ortamlarında keşfedilebilirlik eksikliği ve acemi kullanıcıların CLI'larda gezinme ve anlama konusunda karşılaştıkları zorluklar yer almaktadır.",
      "Makaleler, grafik kullanıcı arayüzlerine (GUI) kıyasla CLI'ların faydalarını ve sınırlamalarını tartışmakta, CLI kullanılabilirliğini geliştirmenin yollarını önermekte ve komut yapısı ve seçeneklerine yönelik farklı yaklaşımları tartışmaktadır. Kullanıcı dostu tasarımın, açık dokümantasyonun ve kullanıcı ihtiyaçlarını ve yeteneklerini anlamanın önemini vurgulamaktadırlar."
    ],
    "points": 166,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1705057307
  }
]
