[
  {
    "title": "Temu, New Online Shopping App, Raises Data Security Concerns Despite Offering 99% Off Deals",
    "originLink": "https://www.wsbradio.com/news/local/online-shopping-app-temu-offers-deals-high-99-off-is-it-safe/NW4QRRW2OJBZZDBKOKOSY3ACXI/",
    "originBody": "ATLANTA — A new online shopping app is taking the digital marketplace by storm. Temu is currently the number one apps in the Apple and Google Play stores. It boasts major discounts of up to 99% off on some items. Temu is technically based in Boston, but is actually owned by Pinduoduo, a Chinese-base e-commerce site. A brief by a U.S. government commission expresses concerns that Pinduoduo has had issues with data security and malware in the last year. WSB-TV’s Justin Gray contributed to this story. ©2023 Cox Media Group",
    "originSummary": [
      "Temu, a new online shopping app owned by Pinduoduo, has quickly risen to become the top app in both Apple and Google Play stores.",
      "The app provides substantial discounts, with some items marked down by as much as 99%.",
      "However, a US government commission has expressed concerns about Pinduoduo's data security and previous malware issues."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699708071367
  },
  {
    "title": "Enhance Your Daily Routine with Temu's Up to 30% Off Discounts",
    "originLink": "https://mashable.com/ad/deals/temu-deal",
    "originBody": "The products that spark joy aren’t necessarily big-ticket items. More often than not, it’s the small things, like gadgets and accessories, that keep us organized and make our lives run more smoothly. If you’re seeking a dose of inspiration, Temu is an online marketplace that is stocked full of tech accessories, clever homewares, and organizing solutions. The prices are already jaw-droppingly low, but right now, new users can save even more with 30 percent off orders $39 and above with the code USNEW30 or 10 percent off sitewide with the code USNEW10. Here are just a few things we’re snapping up: Declutter your gaming gear Opens in a new window Credit: Temu Accessories Kit Storage For Game $29.87 ($21.21 with the code USNEW10 or $20.91 with the code USNEW30 for baskets $39 or higher) Buy Now Gamers, and those of us who might live with gamers, know all too well how quickly controllers, games, cords, and cards stack up, creating clutter around the TV. This accessories kit for your games, for example, puts an end to all that clutter with a dock for the console, charging stations for four controllers, storage for 12 game cards, and more. Keep it piping hot Opens in a new window Credit: Temu Smart Mini USB Cup Warmer $10.78 ($9.70 with the code USNEW10 or $7.55 with the code USNEW30 for baskets $39 or higher) Buy Now If you’re struggling to accept that cold brew season is coming to an end, this adorable mini cup warmer is for you. Resembling a coaster, it conveniently connects to a USB power source to maintain your coffee at a cozy temperature, whether warm or piping hot. You can choose from one of three colors, and because it’s pretty affordable, you can easily grab a couple to avoid toting it from the home office to work or school. Fold, charge, repeat Opens in a new window Credit: Temu 3 In 1 Fast Charging Station $13.41 ($12.07 with the code USNEW10 or or $9.39 with the code USNEW30 for baskets $39 or higher) Buy Now Never miss your alarm because of a dead battery again. This charging station includes a stand for your phone, watch, and headphones, plus a nightlight so you can charge all your devices at once. Customers praise the chargers for their speed, highlighting the device's lightweight design that makes it effortlessly portable. Plus, it comes in six different colors to match your charger to your decor. In a world where the little things often bring the most joy and convenience, Temu's enticing discounts make enhancing your daily life a no-brainer. Whether you're decluttering your gaming space, keeping your coffee piping hot, or embracing efficient charging solutions, Temu has you covered — all at jaw-droppingly low prices. Don't miss out on these fantastic deals to enhance your daily routine! Topics Gadgets Sign up for Mashable Deals Awesome products and offers, sent to your inbox daily. Subscribe By signing up you agree to our Terms of Use and Privacy Policy.",
    "originSummary": [
      "Temu is an online marketplace that offers a variety of tech accessories, homewares, and organizing solutions at low prices.",
      "New users can take advantage of discount codes to save even more on their purchases.",
      "Some popular items on Temu's platform include a gaming accessories kit, a USB cup warmer, and a 3-in-1 fast charging station. These products aim to enhance daily life with convenience and affordability."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699708071367
  }
]
