[
  {
    "id": 36110527,
    "timestamp": 1685333009,
    "title": "Let us serve you, but don't bring us down",
    "url": "https://blog.archive.org/2023/05/29/let-us-serve-you-but-dont-bring-us-down/",
    "hn_url": "http://news.ycombinator.com/item?id=36110527",
    "content": "Let us serve you, but don’t bring us downPosted on May 29, 2023 by Brewster KahleWhat just happened on archive.org today, as best we know:Tens of thousands of requests per second for our public domain OCR files were launched from 64 virtual hosts on amazon’s AWS services. (Even by web standards,10’s of thousands of requests per second is a lot.)This activity brought archive.org down for all users for about an hour.We are thankful to our engineers who could scramble on a Sunday afternoon on a holiday weekend to work on this.We got the service back up by blocking those IP addresses.But, another 64 addresses started the same type of activity a couple of hours later. We figured out how to block this new set, but again, with about an hour outage.—- How this could have gone better for us:Those wanting to use our materials in bulk should start slowly, and ramp up. Also, if you are starting a large project please contact us at info@archive.org, we are here to help.If you find yourself blocked, please don’t just start again, reach out.Again, please use the Internet Archive, but don’t bring us down in the process.Posted in News | 2 Replies",
    "summary": "- Archive.org experienced an hour-long outage due to tens of thousands of requests per second launched from 64 virtual hosts on Amazon Web Services, which brought the site down for all users.\n- Engineers scrambled on a Sunday afternoon on a holiday weekend to work on the issue, and the site got back up by blocking those IP addresses, but another 64 addresses started the same type of activity a couple of hours later.\n- Those wanting to use Archive.org's materials in bulk should start slowly and ramp up, and if starting a large project, should contact the organization at info@archive.org to avoid overwhelming the site.",
    "hn_title": "Let us serve you, but don't bring us down",
    "original_title": "Let us serve you, but don't bring us down",
    "score": 922,
    "hn_content": "A system administrator shares their experience of how they had to add a recaptcha token to thwart a malicious attack that was scraping their domain. The attack worked like a DDoS and came from a large number of IP addresses, making it difficult to stop. Commenters suggest using proof-of-work algorithms to prevent such attacks, with some advocating for the use of Bitcoin's proof-of-work as a replacement for CAPTCHAs. Others recommend looking into projects like mCaptcha, which uses a proof-of-work algorithm that poses the least amount of friction to individual users, or relying on human-powered OCR tasks to avoid captchas altogether. The discussion also covers the limitations of using PoW algorithms and the feasibility of using WebGPU for efficient computation.There is a discussion about using Proof-of-Work (PoW) for CAPTCHAs as a way to avoid bots without creating accessibility issues for people with disabilities. However, PoW can create a significant initial hurdle for users who don't already own cryptocurrency, and there is no existing API for micro-proof-of-burn. Some proposed alternative PoW algorithms include proof-of-space and proof-of-wait, but their efficacy is uncertain. There are several existing solutions, including friendlyCaptcha and hCaptcha, though hCaptcha has received criticism for needing user registration and being inaccessible to some users. As for blockchain and cryptocurrency, economic incentives need time to work, but blockchain certainly has potential to serve as a more practical solution when it comes to authentication processes.The discussion centers around strategies to prevent DDoS-style attacks. The post mentions implementing various techniques, including limiting requests, rate limiting, and implementing CAPTCHAs. However, these tactics have limitations, and some commenters suggest alternative methods such as \"PoW\" challenges or delaying responses to suspected bots. The conversation also briefly touches on the value of online Archives like \"archive.org\" and the funding they receive.The Internet Archive faced server overload and downtime due to excessive scraping from 64 IP addresses. Suggestions included implementing rate limiting and managing the queue to prevent excessive requests. Some contributors suggested using torrents to relieve the load. However, some were unsure about torrents' practicability, especially when the files are less popular. The discussion also touched on how government funding can be used to support art and culture, and selecting established art forms, such as opera, over more trivial art may stifle non-mainstream artists' growth. Ultimately, the post highlighted the impact of Internet Archive on the web, how it has become a core utility, and how its uptime is critical to the smooth functioning of various websites and the justice system.Archive.org warns users of potential rate limiting if they are downloading too much content or overtaxing the system. The rate limiting would not be on a per user basis, but instead is done per public IP. Limiting could also result from scraping the website, with major websites typically implementing inbound request limits. Archive mining services run by users have been identified as one of the main sources of load on the servers. A new AI model might be being trained from the OCRs of PD material.",
    "hn_summary": "- System administrator shares experience of adding a recaptcha token to thwart scraping attack that worked like DDoS from multiple IP addresses\n- Commenters suggest using Proof-of-Work algorithms, including Bitcoin's, as alternative to CAPTCHAs to prevent bot attacks, but concerns raised about initial hurdle for users who don't own cryptocurrency and limitations of alternative PoW algorithms\n- Discussion centers around strategies to prevent DDoS-style attacks, including rate limiting and delaying responses to bots, as well as concerns about overload on Internet Archive servers and potential rate limiting for excessive scraping or downloads"
  },
  {
    "id": 36113551,
    "timestamp": 1685365479,
    "title": "India ruling party's IT cell used AI to show smile on arrested protesters' faces",
    "url": "https://www.altnews.in/wrestlers-detained-in-delhi-ai-image-of-smiling-vinesh-sangeeta-phogat-viral/",
    "hn_url": "http://news.ycombinator.com/item?id=36113551",
    "content": "29TH MAY 2023 / 5:21 PMWrestlers detained in Delhi: AI image of ‘smiling’ Vinesh & Sangeeta Phogat viralBY SHINJINEE MAJUMDERShareTweetSome of India’s top wrestlers, led by Vinesh Phogat, Bajrang Punia, and Sakshi Malik, were detained by Delhi Police on Sunday, May 28, after they had been stopped from marching towards the new Parliament building from their site of protest at Jantar Mantar. The Wrestlers, who have been demanding the arrest of the Wrestling Federation of India (WFI) president and BJP MP Brij Bhushan Sharan Singh over allegations of sexual harassment by at least seven women wrestlers (including a minor), wanted to hold a women’s Maha Panchayat in front of the new Parliament building.The following is an image of Delhi Police detaining wrestler Sakshi Malik near Jantar Mantar during their protest march (used in a Hindustan Times report).According to ThePrint, eight to nine buses filled with protesters were taken to different police stations. The police then removed all the tents, hoardings, and the Tricolour that the wrestlers had put up. The protest site at Jantar Mantar was emptied by the police who also took down all the arrangements the wrestlers had made for themselves.After the wrestlers were taken into custody, a selfie of Vinesh Phogat, Sangeeta Phogat and others apparently clicked in a police vehicle started circulating on social media, with the claim that the wrestlers were seen smiling even after being detained by the police.Abhijit Majumder, who describes himself as a journalist in his Twitter bio, shared the viral image and wrote, “Mission Toolkit accomplished. #WrestlersProtest”. (Archive)Filmmaker Ashoke Pandit also tweeted the viral image of the smiling wrestlers and said that after the drama on the streets, this was their real face. He later deleted the tweet.Pro-BJP propaganda website Kreately Media also tweeted the viral image alongside an image of the wrestlers pinned to the ground by police. They later deleted the tweet.State general secretary for Bengal BJP Amitava Chakravorty shared the image alongside images of the protest and wrote ‘Drama is over. Now all going home smiling. They only came for the photo to ruin today’s inaugurations.’ (Archive)Verified account @wokeflix_ tweeted the same image in a meme and wrote ‘Toolkit Activated. Mission Accomplished’. (Archive)Verified account @randomsena tweeted the same image alongside an image of Sangeeta Phogat and Vinesh Phogat pinned to the floor during the protest, and wrote “Propaganda Vs Reality” (Archive). Another verified account, @RealAtulsay, tweeted the same image and wrote “Selfie🤳 of the day. Fake #WrestlerProtest”. (Archive) Fact CheckWe found that journalist Mandeep Punia had tweeted the photo at 12:28 pm on Sunday with the information that Vinesh Phogat had been detained by Delhi Police. In that image, Vinesh, Sangeeta and others are not seen smiling, contrary to the viral image. (Archive)Wrestler Bajrang Punia tweeted a collage of the two photos (in one, the wrestlers are smiling; in the other, they are not) marking the viral image as ‘fake’. He stated that complaints would be filed against whoever circulated the viral image. This particular tweet was retweeted the Vinesh Phogat herself.Sangeeta Phogat also retweeted a tweet by user Rahul Tahiliani which carried the same collage where the ‘smiling’ photo was marked ‘fake’. (Archive)Coming to the details of the viral image itself, we found that the image had been morphed using Artificial Intelligence app called FaceApp. We performed the same exercise on the original image tweeted by Mandeep Punia and found the exact viral image. This exercise was also performed by journalist Uzair Rizvi in a tweet.Moreover, Vinesh and Sangeeta Phogat have dimples in the viral image. By comparing Vinesh and Sangeeta’s faces in the viral image with images from their Instagram accounts, we found that neither of the sisters has a dimple. (Sangeeta’s Instagram picture and Vinesh’s Instagram picture)Some users also shared a video of Vinesh Phogat smiling and waving from the police vehicle, while she was being taken away. Users sarcastically asked if the video of her smiling was also edited. (Archive)In reality, Vinesh was sarcastically saying “Naya Desh Mubarak Ho” (Translation: Congratulations on a new India) while being taken away by the police. The video was taken out of context by the above user. In this video too, one can clearly see that Vinesh Phogat does not have a dimple.Hence, a selfie taken by wrestlers Vinesh Phogat, Sangeeta Phogat and others in a police van while being taken away for detention has been edited using an Artificial Intelligence app to show that the wrestlers were smiling. The narrative was grossly manipulated to show that the protest was just a propaganda tactic.Donate to Alt News!Independent journalism that speaks truth to power and is free of corporate and political control is possible only when people start contributing towards the same. Please consider donating towards this endeavour to fight fake news and misinformation.Donate NowRelatedImage from 2013 shared as Delhi police attacking Sikh man during farmers’ protest30th January 2021In \"Politics\"News18 cameraman’s scuffle with journalist used by News18, Amit Malviya to target farmers28th July 2021In \"Media analysis\"‘When will you kill Muslims & Christians?’: At Jantar Mantar, Hindutva leaders call for massacre of minorities13th February 2023In \"Religion\"ShareTweetPREVIOUS STORYVideo of Yazidi women rescued by Syrian forces viral with false claims that they’re Hindus from India, BangladeshNEXT STORYOld video shared with false claim that Karnataka govt has revoked hijab banShinjinee MajumderStudent of Economics at Presidency University. Interested in misinformation.READ NEXTAI images of US actor Dwayne Johnson go viral, users claim he performed ‘aarti’30TH MAY 2023Images of the Hollywood actor and former professional wrestler Dwayne Johnson, who is also known…Old video shared with false claim that Karnataka govt has revoked hijab ban29TH MAY 2023A video is viral on social media in which one can see several burqa-clad women…Video of Yazidi women rescued by Syrian forces viral with false claims that they’re Hindus from India, Bangladesh27TH MAY 2023A video is viral on social media with the claim that the UN (United Nations)…Actress Devoleena Bhattacharjee is not part of The Kerala Story, viral claim false27TH MAY 2023Following the release of ‘The Kerala Story’, television actress Devoleena Bhattacharjee has been targeted by…Power bill defaulter assaults staffer: Incident unrelated to Cong’s free electricity promise; viral claims false25TH MAY 2023A video circulating on social media shows a man physically roughing up and verbally abusing…MOREFOLLOW ALT NEWS215K486K",
    "summary": "- Some of India's top wrestlers were detained by Delhi Police after demanding the arrest of the WFI president and BJP MP Brij Bhushan Sharan Singh over allegations of sexual harassment.\n- A photo of detained female wrestlers allegedly smiling in a police vehicle started circulating on social media, but it was later uncovered that the photo had been edited using an AI app to show them smiling.\n- This incident highlights the potential misuse of social media and AI technology for misleading propaganda purposes, and the importance of fact-checking and critical thinking when consuming news on social media platforms.",
    "hn_title": "India ruling party's IT cell used AI to show smile on arrested protesters' faces",
    "original_title": "India ruling party's IT cell used AI to show smile on arrested protesters' faces",
    "score": 765,
    "hn_content": "India's ruling party's IT cell made use of AI to manipulate arrested protesters' photos and add a smile, according to altnews.in. The manipulation of images could be used to spread false narratives, leading to a battle of opposing views. 'Post-truth' incidents by political bodies are harmful to countries and societies on many levels. It's crucial to prioritize the voices and opinions of all parties involved in conflicts, inform all those who are unaware of the truth with valid facts, and avoid inflicting harm on reluctant citizens. The Internet acts like an echo chamber and amplifies niche ideas, which could lead to mass delusions and chaos.This text does not contain any meaningful content related to cutting-edge tech news and therefore cannot be summarized.The text contains a mix of discussions ranging from the importance of public education in democracy, to the origin and validity of truth claims in postmodern philosophy, and even the issue of image authenticity in the age of AI. The discussions include varying perspectives, from skepticism towards grand narratives to the potential benefits of verifying image authenticity to combat digital forgeries. However, there is no clear central theme or new release to capture the interests of tech-savvy readers, and the discussions may not be directly relevant to current tech news.AI-generated images and the prevalence of fakery in media are eroding trust in visual information, with a need for developing ways to authenticate images and videos. One proposed solution involves the use of stereo cameras and an assortment of different camera types (including IR and LIDAR) to verify that what is seen is not a projection. However, the technology still cannot protect against 100% of forgeries, and it remains the case that fake images can still have a significant impact on people's beliefs and reactions. Additionally, media consumers may need to evolve their understanding of visual media's authenticity as it becomes increasingly easy for fake visuals to be created and disseminated.A recent tweet by Elon Musk sharing a photo of the Indian protestors with a morphed image raised concerns about the danger of deepfakes. The incident, along with other instances of disinformation across social media platforms, has shaken the belief that cameras objectively capture reality. As newer technology makes it easier to produce authentic yet false narratives, experts fear people will become more vulnerable to subtle yet effective tricks. Such concerns extend into public online conversations, as bots become increasingly difficult to identify. There is also discussion of Twitter's verification system losing credibility, with verified accounts often being used by cranks paying to spread their opinions and untruths.The discussion in this text is mainly political, with some comments mentioning AI manipulation of public opinion. The original article being discussed in the comments is of questionable newsworthiness and from a propaganda blog. There is disagreement on whether political discussions should be allowed on HN and whether certain accounts should be discouraged. One commenter shares disappointment with the state of their home country, India, while another disagrees with their points and expresses optimism towards the country's future. Crop burning, which contributes to pollution in Delhi, is already outlawed in India. The 2022 Indian presidential election was held on July 18, 2022.The post includes discussions on the recent Indian presidential election and the state of democracy in the country. There is debate on the political parties, with the BJP being praised by some and criticized by others. The issue of job growth, infrastructure growth, and economic policies in India also arise in the discussion. Some users dispute claims made by others, while others provide sources to support their arguments. The post includes criticism of both the current ruling party and the Congress party, with their past actions and flaws being debated. There is debate on the main causes of Delhi's pollution, specifically crop burning, and the role of the government and farmers in addressing it. The post also includes a discussion on the methodology of measuring highways built by the government.There is no meaningful content to summarize.",
    "hn_summary": "- AI-generated images can be used to spread false narratives, eroding trust in visual information\n- There is a need for developing ways to authenticate images and videos to combat digital forgeries\n- Experts fear people will become more vulnerable to subtle yet effective tricks as newer technology makes it easier to produce authentic yet false narratives"
  },
  {
    "id": 36118707,
    "timestamp": 1685398246,
    "title": "HBO Max new Captcha system",
    "url": "https://twitter.com/wondermeg_/status/1662454909353033730",
    "hn_url": "http://news.ycombinator.com/item?id=36118707",
    "content": "Thread ReaderOne-click sign-up and loginSign up or login to access your unrolled and bookmarked threads (or PDF archives if you are a Premium member!)Login with TwitterLogin with EmailLogin above to accept Thread Reader App'sTerms of Service and Privacy PolicyHelp | About | TOS | Privacy | Twitter Files",
    "summary": "- This text does not contain any meaningful content to summarize.\n- This website is best experienced by visiting the website directly.\n- Please visit the website to read the article.",
    "hn_title": "HBO Max new Captcha system",
    "original_title": "HBO Max new Captcha system",
    "score": 534,
    "hn_content": "HBO Max recently launched a new Captcha system for login, requiring users to solve puzzles which some say are poorly designed. The new system also coincides with a rebranding effort that may have been motivated by a desire to make changes for the sake of change, as often happens with management changes. The rebranding may also be related to potential future mergers with other companies. Many find the Captcha system unnecessarily difficult, particularly for non-English speakers or the visually impaired, and criticize the underlying AI-powered technology, Arkose MatchKey, as marketing-driven. Despite criticism, the rebranding and Captcha system remain in place.Users discuss the efficacy of various CAPTCHA systems and their ability to distinguish between humans and bots. Some propose utilizing difficult, compute-intensive tasks as a form of verification. Concerns are expressed around potential government surveillance and the need for non-invasive alternatives. One user suggests a digital wallet tied to a verified identity as a potential solution. Another argues that the government is the only entity capable of solving this problem. The discussion highlights the importance of finding a secure, reliable, and non-invasive system for verifying human users online.Online security experts debate alternatives to CAPTCHAs to prevent bots on websites. Apple's new system to get rid of CAPTCHAs is suggested as one of the best solutions so far. Inverse captcha honeypots, proof-of-work captchas, and rate limiting are some of the other methods discussed. However, it is pointed out that bots are not random and are run by someone for a reason, such as selling products or pushing political outcomes. Additionally, there are concerns about user privacy and the potential for human identity verification provided by a centralized party. Experts also criticize some current CAPTCHA systems as unpredictable, difficult to use, and problematic for accessibility purposes. Some suggest alternatives such as Cloudflare Turnstile or Friendly Captcha.HBO's use of a captchas system designed by Arkose Labs has been criticized for its poor user experience. The system, which requires users to solve audio and visual puzzles, has been described as too difficult to solve, with some users giving up entirely. Other websites, including ESPN, have also been criticized for their captchas systems, but the Arkose system used by HBO has been singled out for the complexity of its puzzles. Users have questioned why a paid subscription service should require such a difficult security system and have criticized the way it hinders rather than supports their use of the service.Comments on a Tech Times article discuss the frustration with CAPTCHAs and their ineffectiveness. Some commenters argue for alternative solutions such as strong verification through payment, while others suggest anti-abuse mechanisms or redesigning abuse detection. Others express frustration with the branding changes of the HBO streaming service and report glitches or bugs in the platform. Some commenters note the usefulness of CAPTCHAs for detecting click farms, but also acknowledge the potential for AI to ramp up the issue. Overall, the comments reflect a frustration with current CAPTCHA systems and suggest the need for more innovative solutions.",
    "hn_summary": "- HBO Max's new Captcha system, powered by Arkose Labs, has received criticism for its poor design and difficulty level.\n- Users and experts discuss the need for alternative, more effective and accessible verification systems to prevent bot attacks and ensure online security.\n- Some commenters express frustration with the rebranding of HBO streaming service, along with glitches and bugs in the platform."
  },
  {
    "id": 36113430,
    "timestamp": 1685364551,
    "title": "300ms Faster: Reducing Wikipedia's total blocking time",
    "url": "https://www.nray.dev/blog/300ms-faster-reducing-wikipedias-total-blocking-time/",
    "hn_url": "http://news.ycombinator.com/item?id=36113430",
    "content": "300ms Faster: Reducing Wikipedia's Total Blocking TimeNicholas Ray·May 21, 2023·8 min readON THIS PAGETotal Blocking Time: Why long tasks matterWhat is Total Blocking Time?How to reduce Total Blocking TimeStep 1: Remove unnecessary JavaScriptStep 2: Optimize existing JavaScriptConclusionHave you ever been frustrated from interacting with a website that was slow to respond to your clicks or had jerky scrolling? Performance flaws like these can lead to the following:Rage clickingIncreased bounce rates and decreased conversion ratesLower search engine rankingFor more than three years, Wikipedia’s mobile site suffered from a piece of JavaScript that could take over 600ms to execute during page load on low-end devices, effectively blocking user interactions.In this article, we’ll walk through a couple of easy steps I took to reduce the execution time of this task by about 50%.Total Blocking Time: Why long tasks matter600ms of synchronous JavaScript execution may not sound like a long time, but imagine if a user tried to click a button during page load when the 600ms of JavaScript began executing. Because only one task can be processed on the browser’s main thread at any given time, the user would need to wait for the following steps to finish before they see a visual update:The 600ms JavaScript task executesThe relevant click handler task executesThe browser performs the necessary rendering steps to update the page visuallyA long task can delay the execution of a click handler that produces a visual update.Each step takes time, and the user can perceive any interaction that takes longer than 100ms to produce a visual update as slow. Because of this, Google considers any task that takes more than 50ms a “long task” that can affect the page’s responsiveness to user input. They even developed a metric for this called “Total Blocking Time” (TBT).There are two long tasks (> 50ms) — the 80ms task and the 100ms task.What is Total Blocking Time?TBT measures the sum of the blocking portion of all long tasks on the browser’s main thread between First Contentful Paint (FCP) and Time to Interactive (TTI). The “blocking portion” is the time after 50ms of each long task.Let’s try calculating the TBT in the example below:The 80ms task is 30ms longer than 50ms so contributes 30ms to TBT.The 30ms task doesn’t contribute to TBT since it is less than 50ms and NOT a long task.The 100ms task is 50ms longer than 50ms so contributes 50ms to TBT.Since TBT is the sum of the time exceeding 50ms of each long task, the TBT for this example is 30ms + 50ms = 80ms.When tested on average mobile hardware, Google recommends sites have a TBT of less than 200 milliseconds. But Wikipedia had one task that could take over 600 milliseconds — roughly 3x the recommended TBT limit for this one task alone.How do we improve TBT?How to reduce Total Blocking TimeTo decrease TBT, we need to either:Do less work on the main thread between First Contentful Paint and Time to InteractiveDo the same amount of work, but break up long tasks into smaller tasks that don’t exceed 50msThis article focuses on making gains from the first bullet point.Step 1: Remove unnecessary JavaScriptWhile many things run on the main thread, including HTML parsing, paints, and garbage collection, long JavaScript execution is frequently the culprit of TBT problems. After all, JavaScript is the fastest way to slow down a site.When I profiled Wikipedia’s mobile site, I found that an _enable method was responsible for most of the execution time. This method initialized the mobile site’s section expansion and collapsing behavior. The profile also showed that, within the _enable method, a call to jQuery’s .on(\"click\") method was slow.function _enable( $container, prefix, page, isClosed ) { ... // Restricted to links created by editors and thus outside our control // T166544 - don't do this for reference links - they will be handled elsewhere var $link = $container.find(\"a:not(.reference a)\"); $link.on(\"click\", function () {  // the link might be an internal link with a hash.  // if it is check if we need to reveal any sections.  if (   $link.attr(\"href\") !== undefined &&   $link.attr(\"href\").indexOf(\"#\") > -1  ) {   checkHash();  } }); util.getWindow().on(\"hashchange\", function () {  checkHash(); });}The .on(\"click\") call attached a click event listener to nearly every link in the content so that the corresponding section would open if the clicked link contained a hash fragment. For short articles with few links, the performance impact was negligible. But long articles like ”United States” included over 4,000 links, leading to over 200ms of execution time on low-end devices.Worse yet, this behavior was unnecessary. The downstream code that listened to the hashchange event already called the same method that the click event listener called. Unless the window’s location already pointed at the link’s destination, clicking a link called the checkHash method twice — once for the link click event handler and once more for the hashchange handler.Therefore, in this case, the best approach was to simply remove this block of JavaScript and free up nearly 200ms from the main thread with virtually the same functionality.When profiling, always check where the most time is spent. Then, see if there is code you can either optimize or, better yet, remove.Remember, the fastest way to speed up a site is to remove JavaScript.Step 2: Optimize existing JavaScriptAn additional performance review revealed that an initMediaViewer method took ~100ms to execute . This method was responsible for attaching a click event listener to each thumbnail in the content so that a click to a thumbnail would open a media viewer:/** * Event handler for clicking on an image thumbnail * * @param {jQuery.Event} ev * @ignore */function onClickImage(ev) { ev.preventDefault(); routeThumbnail($(this).data(\"thumb\"));} /** * Add routes to images and handle clicks * * @method * @ignore * @param {jQuery.Object} [$container] Optional container to search within */function initMediaViewer($container) { currentPageHTMLParser.getThumbnails($container).forEach(function (thumb) {  thumb.$el.off().data(\"thumb\", thumb).on(\"click\", onClickImage); });}Similar to the link example in step 1, attaching an event listener to each thumbnail on the page doesn’t scale well. Editors of Wikipedia articles can (and do) make articles with thousands of images. When this block of code ran, it could take well over 100 milliseconds to execute for pages with a lot of images and increase the TBT of the page. What is an alternative approach?Use event delegation.Event delegation is a powerful technique that lets us attach a single event listener to an element that is the common ancestor of many elements. Using event delegation is often more efficient when dealing with user-generated content that could add any number of elements. It takes advantage of event bubbling and works like this:Attach an event listener to a container element.Using the event param in the event handler, check the event.target property to see the source of the event. Optionally use the event.target.closest(selector) API to check for an ancestor element.If the source of the event is an element or the child of an element we’re interested in, handle it.The updated code looked like the following:/** * Event handler for clicking on an image thumbnail * * @param {MouseEvent} ev * @ignore */function onClickImage(ev) { var el = ev.target.closest(PageHTMLParser.THUMB_SELECTOR); if (!el) {  return; }  var thumb = currentPageHTMLParser.getThumbnail($(el)); if (!thumb) {  return; }  ev.preventDefault(); routeThumbnail(thumb);} /** * Add routes to images and handle clicks * * @method * @ignore * @param {HTMLElement} container Container to search within */function initMediaViewer(container) { container.addEventListener(\"click\", onClickImage);}In this case:I revised the initMediaViewer method to attach one click event listener to a single container element that contained all the images.In the onClickImage method, I used the ev.target.closest(selector) API to check if the click originated from a thumbnail or a child of a thumbnail element. If it didn’t, the code returns early since we only care about clicks to thumbnails. If it did, the code handles the event.But what were the results of this work?ConclusionWe released the optimizations outlined in steps 1 and 2 to production in two deploys — step 1 followed by step 2.According to Wikipedia’s synthetic performance test data, the first deployment resulted in a reduction of TBT by approximately 200ms, while the second deployment improved TBT by around 80ms when testing on a real Moto G (5) phone. Overall, these two steps reduced TBT by nearly 300ms on devices like the Moto G (5) phone visiting long articles.Wikipedia's Moto G (5) synthetic performance test visiting the \"Sweden\" article on English WikipediaWhile there is still room for further improvement, with the task still exceeding the recommended limit on low-end devices, the progress made so far is significant. To achieve even greater reductions in TBT, it may be necessary to break up the task into smaller tasks.What this experience demonstrates is that significant performance improvements can be achieved through small, targeted optimizations. By removing or optimizing specific sections of code, even seemingly minor changes can have a substantial impact on a website’s overall performance. It serves as a reminder that delivering a more responsive browsing experience that can work on any device doesn’t always require complex and extensive changes to the codebase. Sometimes, it’s the smaller wins that make the biggest difference.",
    "summary": "- Total Blocking Time (TBT) measures the sum of all long tasks on a browser's main thread that blocks user interaction between First Contentful Paint and Time to Interactive. \n- Long JavaScript execution and attaching event listeners to every element can lead to high TBT. \n- By removing unnecessary JavaScript and optimizing existing JavaScript, Wikipedia reduced TBT by nearly 300ms on low-end devices, improving its overall performance.",
    "hn_title": "300ms Faster: Reducing Wikipedia's total blocking time",
    "original_title": "300ms Faster: Reducing Wikipedia's total blocking time",
    "score": 457,
    "hn_content": "Wikipedia is extremely fast if you're not logged in and almost lag-free unlike when you're logged in, due to partial caching; the user links, skin preferences, language preference, and misc. preferences makes the logged-in experience slower. Workarounds like fetching the logged-out page first and then re-rendering what's missing or browsing in a container where you're logged out and then switching to a different container where you're logged in may help. Wikipedia uses extensive caching when logged out, which is quite common for many websites that require logins. An RFC has been made to do away with mobile-specific URLs, which make it hard for desktop users to browse sites properly on their devices. Some low-hanging fruit suggestions have been made to improve website performance by experts that the developers can implement, such as moving to Astro and speculative prefetching, which can improve page transitions, bundle time, and navigation time.Safari drops first-party non-interaction cookies after 7 days of no site activity. Some users prefer the mobile WP interface even on desktop. Discussions include whether Wikipedia should serve the mobile version by default or detect device capabilities. Mediawiki supports older browsers and mobile phones. Functionality such as collapsing sections can be achieved with <details> using CSS, but <dialog> is not widely supported. Some users find mobile sites annoying. Some site features like a media viewer and expanding/collapsing sections are achieved using Javascript, which can be a tradeoff between functionality and compatibility, as some users prefer websites to load faster without Javascript.The article discusses optimizing website performance through better interactivity, such as using the <details> HTML element or delegation of click events. It includes comments from readers discussing various aspects of website optimization and performance issues with specific websites, such as Wikipedia and Google. Some readers note the importance of accessibility and how excessive JavaScript can impact website performance on older devices. There is also a discussion about the use of jQuery and the benefits of reducing or eliminating it to improve website performance.A discussion is held in Hacker News about whether removing JavaScript is always the best approach to make a site faster. Counterexamples include advanced CSS causing rendering delays. A demo exists of infinite-scrolling without JavaScript using the hack of never closing/finishing the request. Although strongly critical of JS abuse and overuse, someone asserts that Wikipedia with JS offers handy features such as dynamic tables, previews of articles and citations, and visible floating or collapsed page navigation.",
    "hn_summary": "- Wikipedia is faster for users who are not logged in\n- Low-hanging fruit suggestions have been made to improve website performance, such as using Astro and speculative prefetching\n- Discussions include whether Wikipedia should serve the mobile version by default or detect device capabilities"
  },
  {
    "id": 36118470,
    "timestamp": 1685396672,
    "title": "Setris – Tetris with Sand Physics",
    "url": "https://mslivo.itch.io/setris",
    "hn_url": "http://news.ycombinator.com/item?id=36118470",
    "content": "Blocks turn into sandClear pixels by lining up the same continous color from left to right3 Game Modes5x5 Difficulty SettingsHighscoresCombosDiscord: https://discord.gg/mkHtGBhbEwControlsA = Confirm / RotateP = Pause🡅 = Rotate🡄 = Move to Left🡆 = Move to Right🡇 = Drop BlockMore informationDownloadDownload NowName your own priceClick download now to get access to the following files:Setris-1.2_LINUX.tar.gz61 MBSetris-1.2_WIN.zip59 MBDevelopment logScreen flickering on Linux4 days ago1.2 Release5 days ago1.1 Release10 days agoCommentsLog in with itch.io to leave a comment.buluiz54 minutes agoLook so good! Need this for Mac!ReplyAlresord5 hours ago(+1)please, make to phone´sReplyslenderbowman6 hours agoAny plans to release on Steam?ReplyHauntedCorpse6 hours agoWow, this is satisfying afReplyTeppuTeppu7 hours agoNice!!Replyhazujh8 hours agoAwesome game!!!! :D I love all the aspects of trying to come up with strategies to deal with the falling sand; I have recommended it to all my friends.There is just one issue which is that my color blind friend cannot play it and I am sad that I can't compete against him for the high score >:(ReplyJackyVintonjek8 hours agoI am 85min into a run and I would love to be able to pause, save and exit cuz I gotta go to sleep >w<' nothing I can do besides ending the run on purpose now?ReplyvSanjo2 hours agoIt's `p`.ReplyAlresord8 hours agoThe game closes even when I set it as administratorReplyPaodealho10 hours ago(+2)Please port to mobile I really wanted to play this :(ReplyThe British Wolf12 hours agoFrustrating and yet kinda addictive. I keep getting really bad blocks popping up (like red, green, blue, and by the time red turns up again there's no chance of me merging them) and yet I still kinda wanna keep playing out of sheer stubbornness.That and the sand physics kinda remind me of those old java games and it pleases me to watch it fall. :3ReplyMaingron14 hours ago(+1)Ok wow, this is actually fun and playable, besides the sand sometimes closing up in really mean ways. I really enjoy playing Tetris and I also enjoyed playing Setris for the last 30 minutes or so.Replyshidowfanlol16 hours agothe game doesnt open even when i tried running the program as adminstrator......ReplyBright Spark14 hours ago(+1)Don't just start programs as an administrator unprompted - only do that if you absolutely HAVE to!ReplyAlresord9 hours agoHere is someone who, open as administrator, still closesReplyGrabber Walkie19 hours ago(+2)Port it to mobile platforms and you've got a hit!ReplyX Master19 hours agoOh, I can see myself playing this for hours because I'm a Tetris fan.Plus, the sand physics is just amazing and reminds me to Noita.ReplyIGNOT19 hours ago(+1)Я прям засел конкретно. (Do not know, how to translate it to english from russian.)I will especially highlight impact from blocks falling. This little thing make games feel way cooler. I immediately remembered the shaking of the screen when a powerful, buzzing tank passes next to you in Metal Gear Solid V: The Phantom Pain. Adorable, love stuff like this.Learned about Setris from Alpha Beta Gamer YouTube video:Replyhai!touch Studios23 hours ago(1 edit)I’m not even colorblind and I have trouble telling the blue and green blocks apart.Update: Turned off the blue light filter and lasted 51 minutes. Pretty easy without game speed speeding up considerably.ReplySinnah Saint17 hours agolol I was gonna tell you I had some bad news for you but I'm glad it was just the blue light filter. Replydeebledoubs1 day ago(2 edits)I really think there should be a 15-30 frame buffer after placing a block where your piece doesn't move but the sand continues to settle. And maybe the easiest difficulty should have the block moving at roughly the same speed as the sand settles instead of roughly twice as fast.EDIT: Also a similar pause to block falling while sifting continues during a match clear would make a big difference in game feel.Reply1xeL1 day agoCrea version para 32bitsReplyUniversos Finolizo Studio1 day agovery good game, excellent mechanics.ReplyEvoDev1 day agoGot to 145k pointsReplytunegoro (catlover_mimi)6 days ago(+2)It's Tetris, but the arrangement of having the puzzle disappear when the colors are connected, rather than having a horizontal row fill up, was very unique and interesting. That and the behavior of the sand is fun to watch! The exquisite time limit of the combo system and the sound really enhance the feeling of playing. Also, unlike Tetris, you can't move the sand a little when it's on the ground, so it suddenly becomes more difficult when the falling speed gets faster.It is Tetris, but the arrangement was very unique and interesting: instead of a horizontal row being filled, it disappears when the colors are connected. That and the behavior of the sand is fun to watch! The exquisite time limit of the combo system and the sound really enhance the feeling of playing. Also, unlike Tetris, you can't move the sand a little when it is on the ground, so it suddenly becomes more difficult when the falling speed becomes faster.Translated with DeepLReplymslivo5 days ago(+2)Thanks. I watched your playthrough, glad you like it.Replytunegoro (catlover_mimi)2 days agoI enjoyed it very much! *meow*ReplyFW_Gamer7 days ago(1 edit)(+1)Amazing game, absolutely love the combination of powder and tetris, it might be a nice touch if there was in game music but its already great!Reply079 days agoThis absolutely rules.ReplyEAJB12 days ago(+1)really cool ideaReplypancelor12 days ago(+2)(-1)fun game! I think its very funny how the line piece is still good, but here you usually want to place it sideways instead of vertical hahamy highscore is 775K/301 lines (on marathon/1/1) without thinking too much about the combos. (but its very fun to pull them off!) I’d be interested to try a version of this with 5 colorsReplyargonvile12 days ago(+6)Wow cool! I love the combo system and how intense it gets when the stack raises.https://tetris.fandom.com/wiki/Tetris_Guideline#Guideline_VersionsYou might consider following the Tetris Guideline controls, it's kind of strange to have up and A rotate clockwise, and no keys bound to rotate counterclockwise. I don't think most people would expect that!Replymslivo12 days ago(+3)I thought about it but didn't find it necessary to rotate counter-clockwise in this game.Replydeebledoubs1 day ago(+1)I find myself wishing I could rotate counterclockwise frequently even if it probably makes little difference. That said most tetris rules don't apply here since stuff like wall kicking and pivot rules don't really apply in a sandy environment.Reply",
    "summary": "- 'Setris' is a new game that combines the mechanics of Tetris with sand physics.\n- The game includes three different play modes and five levels of difficulty.\n- Players can download the game for free or name their price to support the developer.",
    "hn_title": "Setris – Tetris with Sand Physics",
    "original_title": "Setris – Tetris with Sand Physics",
    "score": 406,
    "hn_content": "A new Tetris-style game called Setris, developed using Java and LibGDX, is gaining attention online among programmers and gamers. Some users have requested that the game be made available to run in a browser rather than requiring a download. Suggestions for alternative names to avoid possible trademark issues with Tetris include Sandtris and Brick Game. Some users have reported issues running the game on particular systems and operating systems. The game's developer, mslivo, has explained that the large download size is due to the bundled JRE required by the game's Java-based development.",
    "hn_summary": "- Setris, a new Tetris-style game developed with Java and LibGDX, is popular among programmers and gamers.\n- Some users want the game to run in a browser instead of as a download, others suggest names like Sandtris and Brick Game to avoid trademark issues.\n- Users have reported issues running the game on specific systems and the download size is large due to the bundled JRE required by the game's Java-based development."
  },
  {
    "id": 36118990,
    "timestamp": 1685400249,
    "title": "An open-source alternative to QuickBooks",
    "url": "https://bigcapital.ly",
    "hn_url": "http://news.ycombinator.com/item?id=36118990",
    "content": "bigcapital.lyChecking if the site connection is securebigcapital.ly needs to review the security of your connection before proceeding.Why am I seeing this page?Ray ID: 7cf626a6eac8206aPerformance & security by Cloudflare",
    "summary": "- This website is best experienced by visiting the website directly.\n- Please visit the website to read the article.",
    "hn_title": "An open-source alternative to QuickBooks",
    "original_title": "An open-source alternative to QuickBooks",
    "score": 333,
    "hn_content": "An open-source alternative to QuickBooks has gained attention on Hacker News, with users discussing their frustration with Intuit. Some express concern about the project's use of Discord as a support channel, while others suggest other solutions for accounting software, including Plain Text Accounting, Akaunting, and GnuCash. Some commenters note the challenges of integrating with different countries' banking and taxes. The post seems to generate interest from those seeking open-source accounting solutions, particularly for small businesses, but there are also concerns about the project's viability and user support.BigCapital is a new open-source accounting software that offers multi-user web management capabilities. GnuCash is a business accounting software that can be difficult to customize, while ERPNext is an alternative that can be self-hosted. QuickBooks is the industry standard for accounting and its main advantage is its many functions and numerous integrations with other services and software. One of the benefits of QuickBooks is that it is widely used and accountants are typically trained to use it. Another benefit of QuickBooks is QuickBooks Capital which can provide short-term loans at a low interest rate. AccountingCoach.com offers a great rundown of bookkeeping basics online. BigCapital does not yet offer bank feeds, which would automatically import bank information.• Users discuss bank transaction data access and SaaS pricing models for financial software.\n• The challenges of interoperability with banks and the importance of API access are mentioned.\n• Some offer recommendations for open-source alternatives to popular accounting software.\n• The prevalence of Quickbooks in the market and the slow process of customers switching to new software is noted.",
    "hn_summary": "- Users express frustration with Intuit and discuss open-source alternatives to QuickBooks.\n- Concerns are raised about the project's use of Discord as a support channel.\n- Commenters discuss challenges with interoperability with different countries' banking and taxes."
  },
  {
    "id": 36114896,
    "timestamp": 1685374198,
    "title": "Wikipedia had wrong Vatican flag for years – now incorrect flags are everywhere",
    "url": "https://www.catholicnewsagency.com/news/254032/wikipedia-had-the-wrong-vatican-city-flag-for-years-now-incorrect-flags-are-everywhere",
    "hn_url": "http://news.ycombinator.com/item?id=36114896",
    "content": "Friday, May 12, 2023A service of EWTN News CNA ACI Prensa ACI Stampa ACI Digital ACI Africa ACI Afrique ACI Mena CNA Deutsche NCRegisterNewsResourcesColumnsPodcastsVideoCNA NewsletterDonateWikipedia had the wrong Vatican City flag for years. Now incorrect flags are everywhereA Vatican flag, with the incorrect design likely drawn from Wikipedia, and the dome of St. Peter's Basilica. | Bohumil Petrik/ACIBy Jonah McKeownSt. Louis, Mo., Apr 8, 2023 / 13:00 pmThe flag of Vatican City, with its distinctive yellow and white, is instantly recognizable to many Catholics. Likely far fewer people, though, have scrutinized the papal coat of arms on the right-hand side, instead taking the intricate design — which includes famous crossed keys — for granted. As it turns out, there’s a good chance that the coats of arms on many of the Vatican flags you’ve seen out in the world are rendered incorrectly. And it took until 2023 for the internet to start taking notice. Imagine you wanted to print your own version of the Vatican flag. Where would you go to find a high-quality picture of one? If you’re like most internet users, your first stop would probably not be the Vatican’s official (but admittedly outdated) vatican.va website. You’re probably going to pull up Wikipedia, one of the world’s most visited websites and an endless storehouse of free image content. Flagmakers the world over appear to have done so over the years.Imagine many people’s surprise, then, to discover that the image of the “Flag of Vatican City” displayed on Wikipedia has been wrong several times over the years, most recently from 2017 to 2022. (It was also wrong from 2006–2007.)What is “wrong” about these flags, you might ask? It’s a small detail in the grand scheme of things but easy to spot once you know about it. The erroneous Wikipedia file includes a red disk at the bottom of the papal tiara as well as a different shade of yellow on portions of the coat of arms.The anonymous Wikipedia editor who changed the look of the flag in 2017 wrote that he or she did so for “color correction” purposes, noting that the Vatican’s coat of arms includes the red at the bottom of the tiara. The only problem? The Vatican’s official flag design renders the coat of arms differently, with the circular bottom of the tiara in white. The image was reverted to the correct one in 2022, but the damage was done. A casual internet search will turn up dozens of Vatican flags for sale that clearly used the incorrect image downloaded from Wikipedia. The incorrect flag has even made its way into emojis. (This whole situation gained attention last month after a Reddit user made a post about it.)An inexpensive Vatican flag available for sale on Amazon that makes use of the incorrect Wikipedia flag design. Amazon/ScreenshotFather William Becker, pastor at St. Columbanus Parish in Blooming Prairie, Minnesota, read the Reddit post with interest and amusement. Becker, a self-described “flag guy,” has studied the Vatican flag for years and even wrote an entire book about it. He has fond memories of raising the yellow and white colors over his alma mater, the North American College in Rome. One might imagine that the precise design specifications of the Vatican flag would be laid out for anyone to access, like they are for the flag of the United States, for example. But they aren’t. The best the Vatican provides is a web page with a verbal description and history of the flag, along with a low-resolution image showing a square version. Becker told CNA that the saga of the Vatican flag on Wikipedia demonstrates a need for the Vatican to step in and clarify exactly what its flag should look like, especially considering the fact that Catholic churches all over the world display the Vatican flag. It was precisely this lack of clarity on the official design of the Vatican flag that led Becker to create a website detailing, as best as he could, the correct design for the flag. “Cultural communities in general have turned to flags in a stunning way,” Becker commented, citing in part a proliferation of cheaply made, mass-produced flags. And, anecdotally, there seems to be an ever-increasing interest in the Vatican flag as a way for Catholics to claim an identity, whether by flying a flag at home, waving it at a papal event, or by putting one in their social media profile picture. The Vatican flag. Bohumil Petrik/CNAPerhaps surprisingly, the Vatican flag is less than 100 years old, as is Vatican City itself. For more than a millennium before 1870, the pope ruled over the Papal States, large regions mainly within present-day Italy. After the Vatican lost control of the Papal States, it found itself a tiny island surrounded by an acrimonious Italy. It took nearly 60 years until the ratification of the Lateran Accords of 1929 ushered in harmony between the Vatican and Italy, and the creation of the world’s smallest sovereign country. In the days of the Papal States, many different flags were used, but the yellow and white color scheme was a common feature. Becker said the modern design was first used by the merchant fleet in the Papal States from 1825 to 1870. In 1929, that design was chosen as the new flag of Vatican City, the sovereign country. MORE IN USIn swing-state Virginia, pro-life attorney general opts not to support abortion pill lawsuitRead article“It took a while in 1929 to get some flags made. The techniques of mass production weren’t available yet, and so it would have been a matter of sewing up some flags and fitting out buildings with flag staffs,” Becker noted, saying that during this time and for years afterward there was quite a bit of variation between the Vatican flags people flew, perhaps even more so than today. “That’s kind of common with other countries too, especially those that don’t really take pains to standardize their design. [Nowadays] a flagmaker is likely to go to a source like Wikipedia, and it may vary in its accuracy,” Becker told CNA. The same flag chosen in 1929 was reconfirmed in a revised Vatican constitution, issued by Pope John Paul II in 2000. The original Vatican flag was actually square, as indeed the official version is today. Since roughly the 1960s, though, buildings began to fly oblong state flags that followed Italy’s flag proportions, probably because most Vatican flags at the time were mass-produced there. The flag has special significance beyond the walls of Vatican City as a marker for the Vatican’s extraterritorial properties, of which there are more than a dozen. These properties, which include major basilicas such as St. Paul Outside the Walls and St. Mary Major, are marked as the Vatican’s through their flying of the papal flag. Becker said he hopes his website will serve as a helpful resource for anyone looking for the exact Vatican flag design, at least until the Vatican issues some kind of clarification on what exactly the flag should look like. “The papal flag is interesting because on the one hand, the Vatican is such a small state, but the papal flag is seen all over the world. Anywhere there’s a Catholic church, you might be likely to run into a papal flag,” he said. “It would be nice if somebody at the Holy See could, through their website or wherever, make some design specifications more available … design specifications that manufacturers could rely on a bit more.”(Story continues below)Subscribe to our daily newsletterAt Catholic News Agency, our team is committed to reporting the truth with courage, integrity, and fidelity to our faith. We provide news about the Church and the world, as seen through the teachings of the Catholic Church. When you subscribe to the CNA UPDATE, we'll send you a daily email with links to the news you need and, occasionally, breaking news.As part of this free service you may receive occasional offers from us at EWTN News and EWTN. We won't rent or sell your information, and you can unsubscribe at any time.I agree to receive other communications from EWTN and consent to the terms of the Privacy Policy.*Tags: Catholic News, Holy See, Vatican City, Vatican City State, Vatican news, Vatican flagJonah McKeown is a staff writer and podcast producer for Catholic News Agency. He holds a Master’s Degree from the University of Missouri School of Journalism and has worked as a writer, as a producer for public radio, and as a videographer. He is based in St. Louis.TRENDING1UK birth of ‘three-parent baby’ came at a high moral cost, Catholic bioethicists warn2Pope Francis adds Coptic Orthodox martyrs to liturgical book of saints3Eduard Habsburg, Hungary’s man at the Vatican, talks Pope Francis, cheesesteak, and family secrets4PHOTOS: Eucharistic procession brings Jesus to halls of Rome university5Spanish bishops: Abortion as a right makes the unborn child ‘a true undocumented person’Our mission is the truth. Join us!Your monthly donation will help our team continue reporting the truth, with fairness, integrity, and fidelity to Jesus Christ and his Church.DonateYOU MAY ALSO LIKEWild West nun Sister Blandina is focus of planned TV series ‘Trinidad’Apr 8, 2023A trailer for the “Trinidad” series describes Sister Blandina Segale as “an unsung hero of the West who never carried a gun.”Was this Italian Easter sweet miraculously invented by an Irish saint?Apr 8, 2023The incredible story of the “Colomba di Pasqua” (“Easter dove”) dates to the sixth or seventh century and includes a queen, a feast, and a group of Irish monks.Pope Francis’ advice for Holy Week: Look to the cross, our hope is thereApr 5, 2023Pope Francis has offered advice for how to have a fruitful Holy Week, urging people to focus on the essentials and look to the cross as the source of hope.CNA is a service of EWTN News, Inc.Contact usEIN: 27-4581132TOOLSSubscribe to our newsletterRSS FeedAdvertise with usLEGALAbout usPrivacy policy© 2023 CNA | All rights reserved.",
    "summary": "- The Vatican flag, featuring a yellow and white background and a papal coat of arms, is often displayed by Catholics around the world as a symbol of their identity.\n- However, many of the flags available for purchase or use may be incorrect, as multiple versions with minor differences have been circulated online, including one sourced from an erroneous Wikipedia file.\n- This situation highlights a lack of clear specifications from the Vatican regarding the official design of the flag, and the need for greater standardization and clarity in the design specifications, particularly as the Vatican flag is seen globally.",
    "hn_title": "Wikipedia had wrong Vatican flag for years – now incorrect flags are everywhere",
    "original_title": "Wikipedia had wrong Vatican flag for years – now incorrect flags are everywhere",
    "score": 304,
    "hn_content": "Wikipedia incorrectly displayed the Vatican flag for years, which spread the usage of the faulty design. The Vatican flag details lack specificity, and there are multiple acceptable versions of it. Countries should contemplate publishing canonical SVG files to achieve uniformity in their flag. Heraldic rules and conventions vary between different entities, which may also contribute to different flag versions. The colour of the tiara in the Vatican flag is unknown, and both red and white versions are acceptable. Ultimately, it is unlikely that someone would mistake the \"wrong\" Vatican flag for a different entity, and uniform representation of flags is challenging due to the wide range of guidelines and conventions globally.A recent article on the Vatican's flag has sparked discussion on whether the image of the flag on Wikipedia is accurate. Some have found old reference materials that contradict the image on Wikipedia, while others argue that such variations between flags areDiscussions on the accuracy of symbols on flags and coats of arms on Wikipedia, with varying opinions on the importance of correct details. Some argue that creative license can be welcome, as long as the general recognizable symbol remains. Others argue that factual errors can be damaging and should be corrected. Examples of errors include misspellings in logos and wrong versions of national flags. Anecdotes are shared, including one about an incorrect coat of arms being used by a fire department due to Wikipedia. Overall, there are differing opinions on how important factual accuracy of these symbols should be, but most agree that Wikipedia should not be the final source of truth.There is an ongoing edit war and discussion regarding the correct flag designs on Wikipedia for certain countries, including India and the Vatican. Some users find it amusing that incorrect designs have been displayed at times, and others blame the lack of high-quality official graphics from the relevant authorities for the confusion. Critics argue that it highlights the limitations of Wikipedia as a source of information, stating that most of the content is inaccurate or incomplete. However, defenders argue that it is an invaluable resource and that inaccuracies are due to human error rather than a systemic flaw. Overall, the post provides an insight into the limitations of crowdsourced information and the challenges of maintaining accurate and reliable data in the digital age.",
    "hn_summary": "- Wikipedia displayed the wrong Vatican flag for years, leading to widespread usage of the incorrect design due to lack of specificity and multiple acceptable versions of the flag.\n- Discussions on the accuracy of symbols on flags and coats of arms on Wikipedia, with mixed views on the importance of factual accuracy and the challenges of maintaining uniformity in flag designs globally.\n- An ongoing edit war and discussion on Wikipedia regarding the correct flag designs for certain countries, highlighting the limitations of crowdsourced information and the challenges of maintaining accurate and reliable data in the digital age."
  },
  {
    "id": 36111878,
    "timestamp": 1685348386,
    "title": "Donut: OCR-Free Document Understanding Transformer",
    "url": "https://github.com/clovaai/donut",
    "hn_url": "http://news.ycombinator.com/item?id=36111878",
    "content": "Donut : Document Understanding TransformerOfficial Implementation of Donut and SynthDoG | Paper | Slide | PosterIntroductionDonut , Document understanding transformer, is a new method of document understanding that utilizes an OCR-free end-to-end Transformer model. Donut does not require off-the-shelf OCR engines/APIs, yet it shows state-of-the-art performances on various visual document understanding tasks, such as visual document classification or information extraction (a.k.a. document parsing). In addition, we present SynthDoG , Synthetic Document Generator, that helps the model pre-training to be flexible on various languages and domains.Our academic paper, which describes our method in detail and provides full experimental results and analyses, can be found here:OCR-free Document Understanding Transformer.Geewook Kim, Teakgyu Hong, Moonbin Yim, JeongYeon Nam, Jinyoung Park, Jinyeong Yim, Wonseok Hwang, Sangdoo Yun, Dongyoon Han, Seunghyun Park. In ECCV 2022.Pre-trained Models and Web DemosGradio web demos are available!You can run the demo with ./app.py file.Sample images are available at ./misc and more receipt images are available at CORD dataset link.Web demos are available from the links in the following table.Task Sec/Img Score Trained ModelDemoCORD (Document Parsing) 0.7 /0.7 /1.2 91.3 /91.1 /90.9 donut-base-finetuned-cord-v2 (1280) /donut-base-finetuned-cord-v1 (1280) /donut-base-finetuned-cord-v1-2560 gradio space web demo,google colab demoTrain Ticket (Document Parsing) 0.6 98.7 donut-base-finetuned-zhtrainticket google colab demoRVL-CDIP (Document Classification) 0.75 95.3 donut-base-finetuned-rvlcdip gradio space web demo,google colab demoDocVQA Task1 (Document VQA) 0.78 67.5 donut-base-finetuned-docvqa gradio space web demo,google colab demoThe links to the pre-trained backbones are here:donut-base: trained with 64 A100 GPUs (~2.5 days), number of layers (encoder: {2,2,14,2}, decoder: 4), input size 2560x1920, swin window size 10, IIT-CDIP (11M) and SynthDoG (English, Chinese, Japanese, Korean, 0.5M x 4).donut-proto: (preliminary model) trained with 8 V100 GPUs (~5 days), number of layers (encoder: {2,2,18,2}, decoder: 4), input size 2048x1536, swin window size 8, and SynthDoG (English, Japanese, Korean, 0.4M x 3).Please see our paper for more details.SynthDoG datasetsThe links to the SynthDoG-generated datasets are here:synthdog-en: English, 0.5M.synthdog-zh: Chinese, 0.5M.synthdog-ja: Japanese, 0.5M.synthdog-ko: Korean, 0.5M.To generate synthetic datasets with our SynthDoG, please see ./synthdog/README.md and our paper for details.Updates2022-11-14 New version 1.0.9 is released (pip install donut-python --upgrade). See 1.0.9 Release Notes.2022-08-12 Donut is also available at huggingface/transformers (contributed by @NielsRogge). donut-python loads the pre-trained weights from the official branch of the model repositories. See 1.0.5 Release Notes.2022-08-05 A well-executed hands-on tutorial on donut is published at Towards Data Science (written by @estaudere).2022-07-20 First Commit, We release our code, model weights, synthetic data and generator.Software installationpip install donut-pythonor clone this repository and install the dependencies:git clone https://github.com/clovaai/donut.gitcd donut/conda create -n donut_official python=3.7conda activate donut_officialpip install .We tested donut with:torch == 1.11.0+cu113torchvision == 0.12.0+cu113pytorch-lightning == 1.6.4transformers == 4.11.3timm == 0.5.4Getting StartedDataThis repository assumes the following structure of dataset:> tree dataset_namedataset_name├── test│  ├── metadata.jsonl│  ├── {image_path0}│  ├── {image_path1}│       .│       .├── train│  ├── metadata.jsonl│  ├── {image_path0}│  ├── {image_path1}│       .│       .└── validation  ├── metadata.jsonl  ├── {image_path0}  ├── {image_path1}       .       .> cat dataset_name/test/metadata.jsonl{\"file_name\": {image_path0}, \"ground_truth\": \"{\\\"gt_parse\\\": {ground_truth_parse}, ... {other_metadata_not_used} ... }\"}{\"file_name\": {image_path1}, \"ground_truth\": \"{\\\"gt_parse\\\": {ground_truth_parse}, ... {other_metadata_not_used} ... }\"}   .   .The structure of metadata.jsonl file is in JSON Lines text format, i.e., .jsonl. Each line consists offile_name : relative path to the image file.ground_truth : string format (json dumped), the dictionary contains either gt_parse or gt_parses. Other fields (metadata) can be added to the dictionary but will not be used.donut interprets all tasks as a JSON prediction problem. As a result, all donut model training share a same pipeline. For training and inference, the only thing to do is preparing gt_parse or gt_parses for the task in format described below.For Document ClassificationThe gt_parse follows the format of {\"class\" : {class_name}}, for example, {\"class\" : \"scientific_report\"} or {\"class\" : \"presentation\"}.Google colab demo is available here.Gradio web demo is available here.For Document Information ExtractionThe gt_parse is a JSON object that contains full information of the document image, for example, the JSON object for a receipt may look like {\"menu\" : [{\"nm\": \"ICE BLACKCOFFEE\", \"cnt\": \"2\", ...}, ...], ...}.More examples are available at CORD dataset.Google colab demo is available here.Gradio web demo is available here.For Document Visual Question AnsweringThe gt_parses follows the format of [{\"question\" : {question_sentence}, \"answer\" : {answer_candidate_1}}, {\"question\" : {question_sentence}, \"answer\" : {answer_candidate_2}}, ...], for example, [{\"question\" : \"what is the model name?\", \"answer\" : \"donut\"}, {\"question\" : \"what is the model name?\", \"answer\" : \"document understanding transformer\"}].DocVQA Task1 has multiple answers, hence gt_parses should be a list of dictionary that contains a pair of question and answer.Google colab demo is available here.Gradio web demo is available here.For (Pseudo) Text Reading TaskThe gt_parse looks like {\"text_sequence\" : \"word1 word2 word3 ... \"}This task is also a pre-training task of Donut model.You can use our SynthDoG to generate synthetic images for the text reading task with proper gt_parse. See ./synthdog/README.md for details.TrainingThis is the configuration of Donut model training on CORD dataset used in our experiment. We ran this with a single NVIDIA A100 GPU.python train.py --config config/train_cord.yaml \\        --pretrained_model_name_or_path \"naver-clova-ix/donut-base\" \\        --dataset_name_or_paths '[\"naver-clova-ix/cord-v2\"]' \\        --exp_version \"test_experiment\"   . .                                                                                                                     Prediction: <s_menu><s_nm>Lemon Tea (L)</s_nm><s_cnt>1</s_cnt><s_price>25.000</s_price></s_menu><s_total><s_total_price>25.000</s_total_price><s_cashprice>30.000</s_cashprice><s_changeprice>5.000</s_changeprice></s_total>Answer: <s_menu><s_nm>Lemon Tea (L)</s_nm><s_cnt>1</s_cnt><s_price>25.000</s_price></s_menu><s_total><s_total_price>25.000</s_total_price><s_cashprice>30.000</s_cashprice><s_changeprice>5.000</s_changeprice></s_total>Normed ED: 0.0Prediction: <s_menu><s_nm>Hulk Topper Package</s_nm><s_cnt>1</s_cnt><s_price>100.000</s_price></s_menu><s_total><s_total_price>100.000</s_total_price><s_cashprice>100.000</s_cashprice><s_changeprice>0</s_changeprice></s_total>Answer: <s_menu><s_nm>Hulk Topper Package</s_nm><s_cnt>1</s_cnt><s_price>100.000</s_price></s_menu><s_total><s_total_price>100.000</s_total_price><s_cashprice>100.000</s_cashprice><s_changeprice>0</s_changeprice></s_total>Normed ED: 0.0Prediction: <s_menu><s_nm>Giant Squid</s_nm><s_cnt>x 1</s_cnt><s_price>Rp. 39.000</s_price><s_sub><s_nm>C.Finishing - Cut</s_nm><s_price>Rp. 0</s_price><sep/><s_nm>B.Spicy Level - Extreme Hot Rp. 0</s_price></s_sub><sep/><s_nm>A.Flavour - Salt & Pepper</s_nm><s_price>Rp. 0</s_price></s_sub></s_menu><s_sub_total><s_subtotal_price>Rp. 39.000</s_subtotal_price></s_sub_total><s_total><s_total_price>Rp. 39.000</s_total_price><s_cashprice>Rp. 50.000</s_cashprice><s_changeprice>Rp. 11.000</s_changeprice></s_total>Answer: <s_menu><s_nm>Giant Squid</s_nm><s_cnt>x1</s_cnt><s_price>Rp. 39.000</s_price><s_sub><s_nm>C.Finishing - Cut</s_nm><s_price>Rp. 0</s_price><sep/><s_nm>B.Spicy Level - Extreme Hot</s_nm><s_price>Rp. 0</s_price><sep/><s_nm>A.Flavour- Salt & Pepper</s_nm><s_price>Rp. 0</s_price></s_sub></s_menu><s_sub_total><s_subtotal_price>Rp. 39.000</s_subtotal_price></s_sub_total><s_total><s_total_price>Rp. 39.000</s_total_price><s_cashprice>Rp. 50.000</s_cashprice><s_changeprice>Rp. 11.000</s_changeprice></s_total>Normed ED: 0.039603960396039604                                                                 Epoch 29: 100%|█████████████| 200/200 [01:49<00:00, 1.82it/s, loss=0.00327, exp_name=train_cord, exp_version=test_experiment]Some important arguments:--config : config file path for model training.--pretrained_model_name_or_path : string format, model name in Hugging Face modelhub or local path.--dataset_name_or_paths : string format (json dumped), list of dataset names in Hugging Face datasets or local paths.--result_path : file path to save model outputs/artifacts.--exp_version : used for experiment versioning. The output files are saved at {result_path}/{exp_version}/*TestWith the trained model, test images and ground truth parses, you can get inference results and accuracy scores.python test.py --dataset_name_or_path naver-clova-ix/cord-v2 --pretrained_model_name_or_path ./result/train_cord/test_experiment --save_path ./result/output.json100%|█████████████| 100/100 [00:35<00:00, 2.80it/s]Total number of samples: 100, Tree Edit Distance (TED) based accuracy score: 0.9129639764131697, F1 accuracy score: 0.8406020841373987Some important arguments:--dataset_name_or_path : string format, the target dataset name in Hugging Face datasets or local path.--pretrained_model_name_or_path : string format, the model name in Hugging Face modelhub or local path.--save_path: file path to save predictions and scores.How to CiteIf you find this work useful to you, please cite:@inproceedings{kim2022donut, title   = {OCR-Free Document Understanding Transformer}, author  = {Kim, Geewook and Hong, Teakgyu and Yim, Moonbin and Nam, JeongYeon and Park, Jinyoung and Yim, Jinyeong and Hwang, Wonseok and Yun, Sangdoo and Han, Dongyoon and Park, Seunghyun}, booktitle = {European Conference on Computer Vision (ECCV)}, year   = {2022}}LicenseMIT licenseCopyright (c) 2022-present NAVER Corp.Permission is hereby granted, free of charge, to any person obtaining a copyof this software and associated documentation files (the \"Software\"), to dealin the Software without restriction, including without limitation the rightsto use, copy, modify, merge, publish, distribute, sublicense, and/or sellcopies of the Software, and to permit persons to whom the Software isfurnished to do so, subject to the following conditions:The above copyright notice and this permission notice shall be included inall copies or substantial portions of the Software.THE SOFTWARE IS PROVIDED \"AS IS\", WITHOUT WARRANTY OF ANY KIND, EXPRESS ORIMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THEAUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHERLIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS INTHE SOFTWARE.",
    "summary": "- Donut is an OCR-free document understanding transformer that achieves state-of-the-art performance on visual document understanding tasks without off-the-shelf OCR engines or APIs.\n- SynthDoG, a synthetic document generator, helps Donut's pre-training be flexible on various languages and domains.\n- Pre-trained models and web demos for various visual document understanding tasks are available, such as document parsing, document classification, document VQA, and text reading task.",
    "hn_title": "Donut: OCR-Free Document Understanding Transformer",
    "original_title": "Donut: OCR-Free Document Understanding Transformer",
    "score": 290,
    "hn_content": "A new OCR-Free Document Understanding Transformer called Donut has been released on Github. The tool was tested by users on Hacker News, with mixed reviews. Users recommended other OCR tools such as Google Cloud OCR or Azure OCR, which outperformed Donut in some tests. However, Donut was praised for its potential in future document understanding and classification applications. Some users recommended using GPT-4, a language model AI, to find specific words in a string. Overall, the discussion highlighted the ongoing evolution of OCR technology and its potential for improving document management and understanding in the future.No meaningful content to summarize.",
    "hn_summary": "- Donut, an OCR-Free Document Understanding Transformer, has been released on Github.\n- Donut received mixed reviews from Hacker News users compared to other OCR tools such as Google Cloud OCR or Azure OCR.\n- Despite criticisms, Donut showed potential for future document understanding and classification applications."
  },
  {
    "id": 36113215,
    "timestamp": 1685362674,
    "title": "Removing support for forwarded ports",
    "url": "https://mullvad.net/en/blog/2023/5/29/removing-the-support-for-forwarded-ports/",
    "hn_url": "http://news.ycombinator.com/item?id=36113215",
    "content": "MULLVADAboutHelpServersPricingBlogWhat is privacy?Why Mullvad VPN?What is a VPN?DownloadPressJobs",
    "summary": "- This text appears to be the header of a website, likely belonging to Mullvad VPN.\n- It includes links to various pages, such as help, servers, pricing, blog, and information about privacy and VPNs.\n- Without further context or information, it is unclear if there is anything new or exciting relevant to tech news.",
    "hn_title": "Removing support for forwarded ports",
    "original_title": "Removing support for forwarded ports",
    "score": 255,
    "hn_content": "VPN provider Mullvad has announced it is removing its port forwarding feature, which allows users to receive incoming traffic through a fixed IP address. Many users expressed dismay at the decision, as port forwarding is used to enable common applications such as peer-to-peer file sharing and gaming. While it will make the service less open to abuse, the company stated that users had been prevented from accessing certain IPs due to blacklisting, which reduced a key feature of the VPN: its anonymity. Other VPN providers with port forwarding such as Windscribe, ProtonVPN and Tailscale were suggested as alternatives. Mullvad has been highly regarded for its sense of privacy and security.Mullvad will discontinue its port forwarding service to prevent users from using their IPs to host illegal websites. This will affect torrenting as at least one of the peers must be accessible to others to download data, and port forwarding is vital for high-speed downloads and seeding. Private trackers, such as Redacted, and seedboxes are useful alternatives to using Mullvad. Private trackers have a lower risk of copyright infringement and higher quality content with good user communities, while seedboxes offer fast speeds and good upload rates. Accessing private trackers requires an invitation from established members and passing an interview process, which may discriminate against VPN users. Public trackers may have a higher risk of viruses, slower download speeds, and the likelihood of bait-and-switch tactics.Mullvad VPN eliminates port forwarding service, citing abuse by malicious actors prompting law enforcement and service cancellations from hosting providers. Private trackers like Usenet or climbing the private tracker ladder are viable alternatives. One could purchase invites on eBay or Reddit; however, it's risky to get banned for selling invites. Another alternative is to create an account at The Pirate Society or wait for randomly opened sign-ups. Seedboxes offer direct connectivity to seed and peers, but some users prefer keeping their files at home without using a third-party service. Mullvad had a 'how-to' guide for torrenting on their platform, but they deleted it in 2021. Mullvad was forced to stop offering port forwarding service due to abuse and blacklisting of its IP addresses, although, those who do not abuse the service could still enjoy it.Mullvad VPN will stop offering port forwarding from July 1st. This indicates they are dealing with abuse reports and Mullvad sees this step as a necessary measure to protect the integrity of their service against current and future threats. The move has prompted current subscribers to ask for refunds and start exploring alternative options. Mullvad is known for its strong privacy ethos, guarantees customers only a unique Mullvad IP address, and offers privacy-friendly payments. Several Mullvad users highlighted the importance of port forwarding for BitTorrent users. Others indicate that they use a VPN to access content that would otherwise be geographically restricted. Some users mention privacy, which is believed to be endangered by the loss of port forwarding, leading to unique globally routable IPv6 addresses for service providers and increasing the visibility of internet users.\nSeveral users discussed the port forwarding functionality on VPN services, specifically on the Mullvad VPN which appears to have removed this feature in 2019. AirVPN and Hide.me were recommended as alternatives that still support port forwarding, while users also mentioned the need for port forwarding for torrenting and accessing services outside of their subnet. The discussion also touched upon the legality of hosting services that could potentially be used for illegal activities and the ability of VPN companies to operate without logging user data. A comparison table provided by Reddit on VPN services was also mentioned.",
    "hn_summary": "- Mullvad is removing its port forwarding feature, which is used for peer-to-peer file sharing and gaming, due to abuse by malicious actors.\n- Private trackers and seedboxes are suggested as alternatives for torrenting, though accessing private trackers may require an invitation from established members.\n- Some users are concerned about losing privacy and the ability to access geographically restricted content without port forwarding. Alternative VPN services that support port forwarding such as AirVPN and Hide.me were recommended by users."
  },
  {
    "id": 36111596,
    "timestamp": 1685345240,
    "title": "Production AI systems are hard",
    "url": "https://methexis.substack.com/p/production-ai-systems-are-really",
    "hn_url": "http://news.ycombinator.com/item?id=36111596",
    "content": "Discover more from MethexisThe relationship between humans and machinesSubscribeContinue readingSign inProduction AI systems are really hardNo, AGI isn't going to take over every social system when GPT5 comes outKEVIN FISCHERMAY 28, 2023121ShareNOTE: This post is not up to my normal writing standard, just felt compelled to get this down in some form. This is more like a blog post entry than a real newsletter addition.I don't talk much about this - I obtained one of the first FDA approvals in ML + radiology and it informs much of how I think about AI systems and their impact on the world. If you're a pure technologist, you should read the following:Thanks for reading Methexis! Subscribe for free to receive new posts and support my work.SubscribeGeoffrey Hinton was one of the loudest voices decrying the decline of radiology 5 years, and now he’s crying fear for new AI systems.There's a lot to unpack for both why Geof was wrong, and why his future predictions should not be taken seriously either. Geoff made a classic error that technologists often make, which is to observe a particular behavior (identifying some subset of radiology scans correctly) against some task (identifying hemorrhage on CT head scans correctly), and then to extrapolate based on that task alone.The reality is that reducing any job, especially a wildly complex job that requires a decade of training, to a handful of tasks is quite absurd. Here's a bunch of stuff you wouldn't know about radiologists unless you built an AI company with them instead of opining about their job disappearing from an ivory tower.Radiologists are not performing 2d pattern recognition - they have a 3d world model of the brain and its physical dynamics in their head. The motion and behavior of their brain to various traumas informs their prediction of hemorrhage determination.Radiologists have a whole host of grounded models to make determinations, and actually, one of the most important first order determination they make is whether there is anything notably wrong with a brain structure that \"feels\" off. As a result, classifiers aren’t actually performing the same task even as radiologists.Radiologists, because they have a grounded brain model, only need to see a single example of a rare and obscure condition to both remember it and identify it in the future. This long tail of rare conditions to avoid missing is a large part of their training, and no one has any clue how to make a model that acts similar in this way.There’s so many ways to make Radiologist lives easier instead of just replacing them, it doesn’t even make sense to try. I interviewed and hired 25 radiologists, whose primary and chief complaint was that they had to reboot their computers several times a day..A large part of the radiologist job is communicating their findings with physicians, so if you are thinking about automating them away you also need to understand the complex interactions between them and different clinics, which often are unique.Every hospital is a snowflake, data is held under lock and key, so your algorithm might not work in a bunch of hospitals. Worse, the imagenet datasets have such wildly different feature sets they don’t do much for pretraining for you.Have you ever tried to make anything in healthcare? The entire system is optimized to avoid introducing any harm to patients - explaining the ramifications of that would take an entire book, but suffice to say even if you had an algorithm that could automate away radiologists I don’t even know if you could create a viable adoption strategy in the US regulatory environment.The reality is that for every application, the amount of specific and unknowlable domain knowledge is immense.Long story shortThinkers have a pattern where they are so divorced from implementation details that applications seem trivial, when in reality, the small details are exactly where value accrues.Should you be worried about GPT5 being used to automate vulnerability detection on websites before they’re patched? Maybe.Should you be worried GPT5 is going to interact with social systems and destroy our society single-handedly? No absolutely not.Thanks for reading Methexis! Subscribe for free to receive new posts and support my work.Subscribe121Share",
    "summary": "- Radiologists have a complex job that requires a 3D world model of the brain and its dynamics, making it nearly impossible to replace them entirely with AI systems.\n- Automated systems cannot make determinations like radiologists because radiologists have grounded brain models, making it challenging to train AI machines to replicate their performance.\n- Even creating an algorithm that could automate the work of radiologists could prove difficult given the extensive domain-specific knowledge necessary, making it unlikely that anyone will succeed in doing so.",
    "hn_title": "Production AI systems are hard",
    "original_title": "Production AI systems are hard",
    "score": 246,
    "hn_content": "A post on Hacker News discusses the potential usefulness of AI in diagnostic radiology. The author argues that AI could pre-draft 90% of diagnostic studies, allowing radiologists to customize the remaining 10% to each patient. Others in the comments section express concerns about radiologists not reviewing AI output and becoming complacent, potentially leading to misreadings. The post also discusses the challenges of sharing medical data due to legal and regulatory issues, as well as differences in imaging protocols and disease prevalences between hospitals. Overall, the post highlights the potential benefits and drawbacks of using AI in diagnostic radiology.Experts discuss the challenges in sharing healthcare data due to concerns over patient privacy and the lack of a globally accepted standard for data sharing. While some countries, such as Sweden, have implemented systems for easy sharing of patient data, the US and some other countries still struggle with interoperability and siloed data. Experts also highlight the limitations of AI in complex diagnosis and the importance of having human diagnostician input for rare and challenging conditions. However, AI can still assist radiologists in triaging interpretation priorities and flagging abnormal scans. Startups such as AIdoc are raising funds to tackle these challenges. Skill-based upskilling of nurses is another potential solution to increase productivity in primary care.Experts argue that AI cannot take over social systems and destroy humanity, as their interactions are limited to specific domains, and extrapolating based on a single task is an error. An AI cannot perform certain tasks that human radiologists do because of the lack of implementation details. Deploying AI-based systems in real-life hospital situations is difficult, as software integration and user adoption are major influences. Healthcare professionals play a vital role in the design and deployment of AI-based systems. Sharing patient data is complicated, as it could harm privacy, but more data sharing is the best route for reducing physical harm. Finally, the human part of the equation must be considered in the development and implementation of AI-based solutions.- AI systems perform pattern recognition based on complex neural connections built from training data\n- Humans cannot claim that AI lacks patterns that allow it to make certain determinations better than humans\n- AI can significantly improve productivity for tasks like generating boilerplate code but cannot replace a worker entirely\n- The potential for AI to replace white-collar workers exists, leading to shifts in labor to capital and increased economic inequality\n- GPT-5 does not pose an immediate threat to society, but the operationalization of AI could be used for harm\n- Reality is far more complex than we realize, and AI is just a tool in the toolbox",
    "hn_summary": "- AI can pre-draft 90% of diagnostic studies in radiology, but concerns exist about radiologists becoming complacent and misreading due to not reviewing output\n- Challenges of sharing medical data exist due to legal and regulatory issues, differences in imaging protocols and disease prevalence between hospitals, and concerns over privacy\n- AI can assist radiologists in triaging interpretation priorities and flagging abnormal scans, but human diagnostician input remains crucial for rare and challenging conditions."
  }
]
