[
  {
    "id": 37262440,
    "title": "OpenTF oznamuje rozvětvení Terraformu",
    "originLink": "https://opentf.org/announcement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37262440",
    "commentBody": "",
    "originSummary": [
      "OpenTF je odnož systému Terraform vytvořená iniciativou OpenTF.",
      "Cílem této iniciativy je udržet Terraform jako open-source a získala významnou podporu komunity.",
      "OpenTF je vyvíjen pod známou licencí, bude řízen komunitou, nestranný, vrstevnatý a modulární a bude zpětně kompatibilní.",
      "OpenTF se plánuje stát součástí Linux Foundation a Cloud Native Computing Foundation, aby bylo zajištěno, že zůstane open-source a neutrální vůči dodavatelům.",
      "Projekt se blíží ke konci, přičemž již bylo dokončeno přejmenování celého úložiště, výběr členů řídícího výboru a úpravy dokumentů komunity.",
      "Pracovní verze OpenTF se očekává v blízké budoucnosti.",
      "OpenTF již získalo podporu mnoha společností a očekává se, že se bude dále rozšiřovat.",
      "OpenTF bude kompatibilní se stávajícími poskytovateli a moduly Terraform.",
      "Jeho licenční model bude řízen nadací a komunitou.",
      "Přispívat do OpenTF lze prostřednictvím příslibů zdrojů, šířením informací a případně i příspěvků do kódu.",
      "Cílem projektu je vytvořit veřejný plán a proces RFC, který by umožnil přispět komunitě."
    ],
    "commentSummary": [
      "Komunitní iniciativa OpenTF odštěpila projekt Terraform od společnosti HashiCorp kvůli změně licence projektu.",
      "Cílem OpenTF je zaměřit se na pozitivní aspekty a získat podporu společností a zároveň diskutovat o motivech rozhodnutí společnosti HashiCorp a důsledcích pro komunitu open-source.",
      "CNCF možná bude muset udělat výjimku ze své licenční politiky pro OpenTF a diskutuje se o úloze různých open-source nadací."
    ],
    "points": 1373,
    "commentCount": 417,
    "retryCount": 0,
    "time": 1692975408
  },
  {
    "id": 37260637,
    "title": "Factorio: Vesmírný věk",
    "originLink": "https://factorio.com/blog/post/fff-373",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37260637",
    "commentBody": "",
    "originSummary": [
      "Hra Factorio dostává nové rozšíření s názvem Factorio: Space Age, které pokračuje v cestě hráče po dosažení vesmíru.",
      "Rozšíření přinese nové světy, meziplanetární vesmírné platformy a logistiku, které poskytnou jedinečné výzvy a zdroje.",
      "Datum vydání rozšíření je plánováno přibližně na rok a bude obsahovat vylepšení celé hry, například lepší ovládání vlaků a tvorbu plánů."
    ],
    "commentSummary": [
      "Diskuze se točí kolem populární hry Factorio a zabývá se různými aspekty, jako jsou mody, herní mechanismy, vlaková signalizace, optimalizace výkonu a nadcházející rozšíření.",
      "Hráči se dělí o své zkušenosti, názory a návrhy na zlepšení hry, přičemž zdůrazňují její návykovost a obavy z časové náročnosti.",
      "Přestože je Factorio chváleno za svou hratelnost a časté aktualizace, objevují se i návrhy na zvýšení hloubky a udržitelnosti."
    ],
    "points": 1355,
    "commentCount": 335,
    "retryCount": 0,
    "time": 1692964220
  },
  {
    "id": 37267597,
    "title": "Překonání GPT-4 na HumanEval s vyladěným CodeLlama-34B",
    "originLink": "https://www.phind.com/blog/code-llama-beats-gpt4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37267597",
    "commentBody": "",
    "originSummary": [
      "Tým Phind vycvičil modely CodeLlama na souboru dat a dosáhl působivých výsledků v testu HumanEval.",
      "Modely byly zveřejněny na webu Huggingface za účelem ověření a podpory komunity open-source.",
      "Byly zmíněny výsledky modelů pass@1 a srovnání s výkonem GPT-4."
    ],
    "commentSummary": [
      "Příspěvek se zabývá výkonností a omezeními jazykového modelu GPT-4 a diskutuje o praktických aplikacích a možných vylepšeních modelu CodeLlama-34B.",
      "Diskutuje se o kontaminaci dat a etických aspektech sdílení kódu.",
      "Zkoumají se výhody otevřeného uvolňování jazykových modelů a důsledky pro odvětví, možnosti a potenciální využití modelu CodeLlama-34B a dopad umělé inteligence na odvětví kódování."
    ],
    "points": 524,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1693001303
  },
  {
    "id": 37264676,
    "title": "Škrábání webu pro mě, ale ne pro tebe",
    "originLink": "https://blog.ericgoldman.org/archives/2023/08/web-scraping-for-me-but-not-for-thee-guest-blog-post.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37264676",
    "commentBody": "",
    "originSummary": [
      "Společnosti jako Meta a Microsoft zakazují shromažďování dat z webu na svých vlastních stránkách a zároveň volně shromažďují data z webových stránek jiných společností, což je pokrytecký postoj.",
      "Web scraping zahrnuje získávání dat z internetu, ale právní otázka, kdo může k těmto datům přistupovat a používat je, je složitá.",
      "Společnosti provozující sociální média agresivně vedou soudní spory týkající se scrapingu webu, aby ochránily obsah vytvořený uživateli, a to i bez vlastnických práv k datům, přičemž využívají právní teorie, jako je neoprávněné vniknutí do movitého majetku nebo porušení smlouvy.",
      "Autor kritizuje právní režim, který umožňuje společnostem vytvářet vlastní práva duševního vlastnictví prostřednictvím smluv o podmínkách používání online.",
      "Je zdůrazněn nedostatek právního požadavku na intelektuální poctivost nebo důslednost v právním režimu porušení smlouvy jako vlastnictví.",
      "Autor obviňuje soudy, že toto pokrytectví umožňují, a vyzývá k řešení, které by zabránilo soukromým společnostem vymýšlet práva duševního vlastnictví prostřednictvím online smluv.",
      "Právní stav scrapování webových stránek je považován za nestabilní a v budoucnu bude pravděpodobně čelit výzvám, zejména v případech generativní umělé inteligence."
    ],
    "commentSummary": [
      "Článek pojednává o právních důsledcích a dopadech scrapování webu na příkladu případu HiQ vs. LinkedIn.",
      "Zabývá se tématy, jako je porušování podmínek služby a licenčních smluv s koncovými uživateli, širšími důsledky pro scraping na webu a potřebou spravedlivých pravidel a předpisů.",
      "Článek se také zabývá chováním společností, právní jasností, pojistným krytím a soudními spory, ochranou autorských práv, otázkami ochrany soukromí a rovnováhou mezi otevřeností a kontrolou v digitálním prostoru."
    ],
    "points": 477,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1692985343
  },
  {
    "id": 37266957,
    "title": "Vzdát se cestovního snu pouze o iPadu",
    "originLink": "https://sixcolors.com/post/2023/08/why-i-gave-up-on-the-ipad-only-dream/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37266957",
    "commentBody": "",
    "originSummary": [
      "Autor se s vámi podělí o své zkušenosti s používáním iPadu jako hlavního cestovního zařízení a o důvody, které ho vedly k rozhodnutí přejít zpět na MacBook Air.",
      "Jako klíčový faktor pro své rozhodnutí uvádějí nedostatečnou flexibilitu a funkčnost ve srovnání s MacBookem Air.",
      "Jako nepříjemné aspekty používání iPadu pro profesionální práci jsou uváděna konkrétní omezení, například nemožnost používat některé aplikace a příslušenství."
    ],
    "commentSummary": [
      "Článek se zabývá výhodami a nevýhodami používání iPadů a dalších zařízení při činnostech, jako je cestování, psaní poznámek a konzumace médií.",
      "Uživatelé mají různé názory na pohodlí a přenosnost iPadů ve srovnání s notebooky a jinými tablety.",
      "Diskutuje se například o kompatibilitě softwaru, omezeních zařízení a přání konvertibilních zařízení."
    ],
    "points": 249,
    "commentCount": 346,
    "retryCount": 0,
    "time": 1692997091
  },
  {
    "id": 37263322,
    "title": "Válka EU proti behaviorální reklamě",
    "originLink": "https://thisisunpacked.substack.com/p/the-eu-war-on-behavioral-advertising",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37263322",
    "commentBody": "",
    "originSummary": [
      "EU dosáhla vítězství v omezování behaviorální reklamy, protože společnost Meta (dříve Facebook) souhlasila s ukončením výchozího nastavení opt-in pro behaviorální reklamu v aplikacích v EU.",
      "Toto rozhodnutí ovlivnily změny v zásadách ochrany osobních údajů a legislativě, jako je transparentnost sledování aplikací společnosti Apple a postupné ukončení používání souborů cookie třetích stran společností Google.",
      "Nařízení o ochraně osobních údajů měla významný dopad na dosah a účinnost behaviorální reklamy, což vedlo k nárůstu nepersonalizovaných verzí produktů a potenciálnímu snížení priorit trhů EU ze strany platforem. Přetrvávají však obavy z možných důsledků přísného regulačního přístupu EU na schopnost platforem sociálních médií zpeněžit."
    ],
    "commentSummary": [
      "Diskuse se soustředí na přístup EU k regulaci behaviorální reklamy a zkoumá kritiku složitosti a nákladů, jakož i nerespektování záhlaví Do Not Track.",
      "Hlavním tématem je implementace a dopad GDPR, přičemž názory na jeho účinnost při ochraně soukromí uživatelů se různí.",
      "V rozhovoru se probírají témata jako online reklama, pravidla ochrany soukromí, souhlas s přístupem k uživatelským údajům, dodržování GDPR a spor mezi Facebookem a kanadskou vládou ohledně placení za zprávy. Zabývá se také vlivem hnutí na ochranu soukromí, reklamními strategiemi, algoritmickými kanály, personalizovanými digitálními reklamami a hodnotou a dopadem reklamy na společnost a ekonomiku."
    ],
    "points": 237,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1692979656
  },
  {
    "id": 37262258,
    "title": "Uniklý zdrojový kód hry Wipeout vede k téměř kompletnímu přepsání a remasteru",
    "originLink": "https://arstechnica.com/gaming/2023/08/developer-rewrites-original-wipeout-from-abysmal-leaked-windows-source/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37262258",
    "commentBody": "",
    "originSummary": [
      "Unikl zdrojový kód původní hry Wipeout, což vedlo k tomu, že nezávislý vývojář hru přepsal a předělal.",
      "Vývojář Dominic Szablewski vylepšil výkon a hratelnost přepsáním vykreslování, fyziky, zvuku a dalších prvků hry.",
      "Szablewski zpřístupnil kód na GitHubu, což umožňuje jeho kompilaci pro více platforem. Doufá, že společnost Sony, vlastník série Wipeout, buď umožní pokračování remasteru, nebo oficiálně vydá remasterovanou verzi."
    ],
    "commentSummary": [
      "Únik zdrojového kódu hry Wipeout vedl k jejímu kompletnímu přepsání a remasterování, což vedlo k působivé snímkové frekvenci 6 000 snímků za sekundu.",
      "Diskuse se soustředí na vykreslování her a snímkovou frekvenci a zdůrazňuje problémy práce s herním kódem a rozlišování mezi \"špatným\" a \"dobrým\" kódem.",
      "Zdůrazňuje se význam čištění a refaktorizace kódu, jakož i hodnota měkkých dovedností a praktických zkušeností. Kritika je zaměřena na ekosystém npm v programování v jazycích JavaScript/Node.",
      "Dotýkáme se také úniku zdrojového kódu a rozhovorů o hratelnosti hry Wipeout."
    ],
    "points": 226,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1692974520
  },
  {
    "id": 37262857,
    "title": "HelloSystem: Grafický operační systém postavený na FreeBSD",
    "originLink": "https://hellosystem.github.io/docs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37262857",
    "commentBody": "",
    "originSummary": [
      "helloSystem je uživatelsky přívětivý desktopový systém založený na FreeBSD se zaměřením na jednoduchost a použitelnost pro tvůrce.",
      "Je navržen tak, aby vyhovoval uživatelům Maců, kteří chtějí přejít na jiný operační systém.",
      "Další podrobnosti a informace o helloSystem najdete na stránce GitHub."
    ],
    "commentSummary": [
      "HelloSystem je grafický operační systém postavený na FreeBSD, který je navržen tak, aby byl kompatibilní s aplikacemi pro macOS a FreeBSD.",
      "Diskuse se zabývá různými pohledy na stabilitu, design, uživatelské zkušenosti a výhody různých operačních systémů.",
      "Zmiňuje se o podobnostech mezi HelloSystem a RISC OS a také o možných obavách ohledně ochranné známky související s názvem operačního systému."
    ],
    "points": 220,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1692977551
  },
  {
    "id": 37260553,
    "title": "Webové stránky College Board sdílejí průměrné známky a výsledky testů SAT s TikTokem a Facebookem.",
    "originLink": "https://gizmodo.com/sat-college-board-tells-facebook-tiktok-your-scores-gpa-1850768077",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37260553",
    "commentBody": "",
    "originSummary": [
      "Bylo zjištěno, že společnost College Board, která spravuje zkoušky SAT a Advanced Placement, sdílí údaje studentů s velkými technologickými společnostmi, jako jsou Facebook a TikTok.",
      "Toto sdílení dat je umožněno prostřednictvím \"pixelů\", neviditelné sledovací technologie používané pro cílenou reklamu.",
      "Přestože College Board tvrdí, že osobní údaje nejsou sdíleny, testy provedené serverem Gizmodo ukázaly opak a vyvolaly obavy o ochranu soukromí.",
      "Povinná povaha služeb College Board v americkém vzdělávacím systému tyto obavy o soukromí ještě zvyšuje.",
      "Společnost College Board se v minulosti potýkala s problémy s ochranou soukromí, včetně prodeje údajů o studentech v minulosti.",
      "Není jasné, zda se organizace stále zavazuje k ochraně soukromí studentů, protože již není signatářem studentského závazku k ochraně soukromí.",
      "College Board obhajuje používání svých dat a tvrdí, že pomáhá studentům v přístupu na vysokou školu a v úspěchu na ní."
    ],
    "commentSummary": [
      "Společnost College Board sdílí s TikTokem a Facebookem výsledky testů GPA a SAT pomocí sledovacích pixelů, což vyvolává obavy o ochranu soukromí.",
      "Kritici tvrdí, že i sdílení historie vyhledávání je porušením soukromí, přestože to tvrdí College Board.",
      "Tato situace rovněž vyvolává obavy ohledně přístupu vlády k osobním údajům bez souhlasu soudu a zdůrazňuje význam zákonů o ochraně osobních údajů pro vládu i soukromý sektor."
    ],
    "points": 177,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1692963486
  },
  {
    "id": 37263708,
    "title": "Ověřování e-mailu: Příručka pro vývojáře",
    "originLink": "https://resend.com/blog/email-authentication-a-developers-guide",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37263708",
    "commentBody": "",
    "originSummary": [
      "Ověřování e-mailů je zásadní pro úspěšné doručení e-mailů a pro zabránění tomu, aby e-maily skončily ve složkách nevyžádané pošty.",
      "SPF, DKIM, DMARC a BIMI jsou klíčové ověřovací protokoly, které určují legitimitu odesílatelů e-mailů a zvyšují reputaci domény.",
      "Funkce Resend nabízí automatické zpracování ověření SPF a DKIM pro lepší doručitelnost e-mailů."
    ],
    "commentSummary": [
      "Článek zdůrazňuje význam ověřování e-mailů a používání protokolů SPF, DKIM a DMARC k ověřování legitimního odesílání e-mailů.",
      "Někteří čtenáři článku vytýkají nedostatek originality a používání analogií se startupy.",
      "BIMI je zmiňován jako způsob, jakým mohou značky zobrazovat své logo a důvěryhodnost v e-mailech, ale objevují se obavy ohledně jeho nákladů, účinnosti a nedostatečné podpory ze strany aplikace Microsoft Outlook. Někteří odborníci považují BIMI za ztrátu času a peněz."
    ],
    "points": 176,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1692981289
  }
]
