[
  {
    "id": 37237583,
    "title": "एआई रियल-टाइम मानव पूर्ण-शरीर फोटो जनरेटर",
    "originLink": "https://generated.photos/human-generator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37237583",
    "commentBody": "",
    "originSummary": [
      "मानव जनरेटर एक एपीआई उपकरण है जो वास्तविक समय में लोगों की हाइपररियलिस्टिक फुल-बॉडी फोटो उत्पन्न करने के लिए उन्नत एआई एल्गोरिदम का उपयोग करता है।",
      "उपकरण जातीयता, आयु और शरीर के प्रकार के संदर्भ में अधिकतम विविधता प्रदान करता है, और विभिन्न पोज़ और कपड़ों के विकल्पों का समर्थन करता है।",
      "यह गैर-व्यावसायिक उपयोग के लिए स्वतंत्र है और विविधताऔर एनिमेशन उत्पन्न करने जैसी अतिरिक्त सुविधाएँ प्रदान करता है।",
      "मानव जनरेटर उत्पादों के एक सूट का हिस्सा है जिसमें फेस जनरेटर, फेस गैलरी, एनोनिमाइज़र और डेटासेट शामिल हैं।",
      "उपयोगकर्ता जेनरेट की गई सामग्री के उपयोग, सुरक्षा और भंडारण के बारे में किसी भी प्रश्न या चिंताओं को दूर करने के लिए कंपनी से संपर्क कर सकते हैं।"
    ],
    "commentSummary": [
      "लेख यथार्थवादी मानव शरीर की छवियों को बनाने और स्केलेबिलिटी और छवि गुणवत्ता के संदर्भ में प्रसार मॉडल और जीएएन की तुलना के लिए जनरेटिव प्रतिकूल नेटवर्क (जीएएन) के उपयोग की पड़ताल करता है।",
      "डीपफेक तकनीक के आसपास की नैतिक चिंताओं और दुरुपयोग की संभावना पर चर्चा की जाती है, साथ ही वेबसाइटों के बारे में चिंताओं के साथ नापाक उद्देश्यों के लिए मानव जैसी छवियां उत्पन्न करने के लिए एआई का उपयोग करने के बारे में चिंताएं हैं।",
      "एआई-जनित कला के लिए कॉपीराइट के कानूनी निहितार्थ, एआई छवि पीढ़ी के उपकरणों के साथ उपयोगकर्ताओं के अनुभव, और एआई-जनित डेटा से संबंधित संभावित मुद्दों, पूर्वाग्रहों और चिंताओं को भी कवर किया गया है।"
    ],
    "points": 608,
    "commentCount": 312,
    "retryCount": 0,
    "time": 1692804525
  },
  {
    "id": 37239747,
    "title": "वेतन वार्ता में आम गलतियां",
    "originLink": "https://interviewing.io/blog/sabotage-salary-negotiation-before-even-start",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37239747",
    "commentBody": "",
    "originSummary": [
      "लेख वेतन वार्ता पर सलाह प्रदान करता है, नौकरी की खोज के शुरुआती चरणों के दौरान अत्यधिक जानकारी को रोकने के महत्व पर प्रकाश डालता है।",
      "यह बातचीत में उचित तैयारी और नियंत्रण के महत्व पर जोर देता है, और वेतन विवरण बहुत जल्दी साझा करने के खिलाफ चेतावनी देता है।",
      "लेख बातचीत के लिए एक संचार उपकरण के रूप में ईमेल का उपयोग करने का सुझाव देता है, क्योंकि यह अधिक विचारशील और रणनीतिक प्रतिक्रियाओं की अनुमति देता है।"
    ],
    "commentSummary": [
      "लेख वेतन वार्ता में सामान्य गलतियों और रणनीतियों पर चर्चा करता है।",
      "मुख्य बिंदुओं में नौकरी की पेशकश से दूर जाने के लिए तैयार होने और नियोजित होने के दौरान नए अवसरों का लाभ उठाने का महत्व शामिल है।",
      "चर्चा में वार्षिक वेतन वृद्धि, कई नौकरी की पेशकश का प्रबंधन और बाजार की जानकारी के लिए साक्षात्कार के मूल्य जैसे विषय भी शामिल हैं।"
    ],
    "points": 511,
    "commentCount": 373,
    "retryCount": 0,
    "time": 1692813375
  },
  {
    "id": 37240187,
    "title": "एसएसएच के लिए एक कष्टदायी विस्तृत गाइड (लेकिन केवल वे चीजें जो मुझे उपयोगी लगती हैं)",
    "originLink": "https://grahamhelton.com/blog/ssh-cheatsheet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37240187",
    "commentBody": "",
    "originSummary": [
      "यह ब्लॉग पोस्ट एसएसएच के लिए एक संपूर्ण मार्गदर्शिका प्रदान करता है, जिसमें पोर्ट अग्रेषण, एजेंट अग्रेषण और प्रॉक्सी जैसे विभिन्न पहलुओं की व्याख्या की गई है।",
      "यह सुरक्षा जोखिमों पर चर्चा करते हुए टीटीवाई कमांड आवंटन और एसएसएच कॉन्फ़िगरेशन फ़ाइल जैसी एसएसएच सुविधाओं की पड़ताल करता है।",
      "गाइड में एसएसएच सुरंगों की स्थापना और सर्वर तक पहुंचने के लिए व्यावहारिक उदाहरण, कमांड और सुझाव शामिल हैं, साथ ही आगे की जानकारी के लिए अतिरिक्त संदर्भ भी शामिल हैं।"
    ],
    "commentSummary": [
      "यह आलेख एसएसएच का उपयोग करने के लिए एक व्यापक मार्गदर्शिका है, जिसमें एसएसएच कॉन्फ़िगरेशन फ़ाइल में एक लापता निर्देश और होस्ट कॉन्फ़िगरेशन को व्यवस्थित करने जैसे विषयों को शामिल किया गया है।",
      "यह विभिन्न एन्क्रिप्शन एल्गोरिदम पर चर्चा करता है और एसएसएच कुंजी के सुरक्षित भंडारण की पड़ताल करता है।",
      "लेख माइक्रोसॉफ्ट और ऐप्पल द्वारा .local डोमेन के अतिव्यापी उपयोग से संबंधित जटिलताओं के साथ-साथ युवा पीढ़ियों के बीच डार्क मोड की प्राथमिकता और पठनीयता पर इसके प्रभाव के आसपास की बहस को भी छूता है।"
    ],
    "points": 382,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1692815235
  },
  {
    "id": 37235770,
    "title": "नीदरलैंड में € 3000 से अधिक के नकद भुगतान को गैरकानूनी घोषित किया जाएगा",
    "originLink": "https://www.rijksoverheid.nl/onderwerpen/geldzaken/vraag-en-antwoord/grote-aankopen-met-contant-geld",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37235770",
    "commentBody": "",
    "originSummary": [
      "नीदरलैंड में वर्तमान में नकद भुगतान के लिए कोई अधिकतम सीमा नहीं है।",
      "विक्रेताओं को € 10,000 से ऊपर नकद खरीद के लिए ग्राहक जांच करनी चाहिए।",
      "सरकार मनी लॉन्ड्रिंग और आतंकवाद के वित्तपोषण को रोकने के लिए € 3,000 से अधिक के नकद भुगतान पर प्रतिबंध लगाने के प्रस्ताव पर काम कर रही है।"
    ],
    "commentSummary": [
      "हाल ही में डच कानून मनी लॉन्ड्रिंग और आतंकवादी वित्तपोषण का मुकाबला करने के लिए € 3000 से ऊपर नकद भुगतान पर प्रतिबंध लगाता है।",
      "विभिन्न देशों में पते के प्रमाण के लिए अलग-अलग आवश्यकताओं के कारण स्थिर पते के बिना व्यक्तियों के लिए चुनौतियां उत्पन्न होती हैं।",
      "बड़े नकद लेनदेन के संभावित जोखिमों और निहितार्थों के साथ-साथ नकदी और डिजिटल भुगतान के फायदे और नुकसान पर बहस की जाती है।"
    ],
    "points": 330,
    "commentCount": 722,
    "retryCount": 0,
    "time": 1692798395
  },
  {
    "id": 37241487,
    "title": "एनवीडिया ने वित्त वर्ष 2024 की दूसरी तिमाही के लिए वित्तीय परिणामों की घोषणा की",
    "originLink": "https://nvidianews.nvidia.com/news/nvidia-announces-financial-results-for-second-quarter-fiscal-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37241487",
    "commentBody": "",
    "originSummary": [
      "एनवीडिया ने वित्त वर्ष 2024 की दूसरी तिमाही में पिछले वर्ष से 101% की वृद्धि के साथ रिकॉर्ड तोड़ राजस्व हासिल किया है।",
      "कंपनी के डेटा सेंटर राजस्व में भी 171% की वृद्धि हुई।",
      "एनवीडिया के सीईओ ने त्वरित कंप्यूटिंग और जनरेटिव एआई की ओर बदलाव पर प्रकाश डाला और शेयर पुनर्खरीद और नकद लाभांश की योजना की घोषणा की।"
    ],
    "commentSummary": [
      "एनवीडिया ने वेतन कटौती और इंटेल से प्रतिस्पर्धा जैसी चुनौतियों के बावजूद वित्त वर्ष 2024 की दूसरी तिमाही में मजबूत वित्तीय वृद्धि दर्ज की है।",
      "उपयोगकर्ता कंप्यूटर बेंचमार्क, सीपीयू प्रदर्शन और एएमडी और इंटेल प्रोसेसर के बीच तुलना सहित विभिन्न विषयों पर चर्चा कर रहे हैं।",
      "एआई बाजार में एनवीडिया के प्रभुत्व, एएमडी जैसे अन्य खिलाड़ियों से प्रतिस्पर्धा और तकनीकी उद्योग में प्राकृतिक एकाधिकार की संभावना के आसपास बहस चल रही है।"
    ],
    "points": 312,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1692822280
  },
  {
    "id": 37244012,
    "title": "Bn v0.8",
    "originLink": "https://bun.sh/blog/bun-v0.8.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37244012",
    "commentBody": "",
    "originSummary": [
      "Bun v0.8.0 संगतता और स्थिरता के लिए नई सुविधाएँ, बग फिक्स और सुधार लाता है।",
      "बन 1.0 7 सितंबर को रिलीज के लिए तैयार है, जो अतिरिक्त संवर्द्धन और बग फिक्स का वादा करता है।",
      "अद्यतनों के बारे में अधिक विस्तृत जानकारी के लिए, दिए गए लिंक को देखें."
    ],
    "commentSummary": [
      "आलेख टाइपस्क्रिप्ट के लिए बन और डेनो रनटाइम के बीच अंतर और उपयोगकर्ता वरीयताओं पर चर्चा करता है।",
      "विषयों में सुरक्षा कमजोरियां, प्रदर्शन लाभ और बन परियोजना के संभावित भविष्य के विकास शामिल हैं।",
      "अतिरिक्त बिंदुओं में कोड पठनीयता और अनुकूलन, बन ढांचे में एलएसपी का एकीकरण, एज सर्वर का उपयोग, विंडोज समर्थन, सर्वर घटक, अन्य भाषाओं के साथ संगतता और बन के भविष्य के संस्करणों के लिए योजनाएं शामिल हैं।"
    ],
    "points": 279,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1692840062
  },
  {
    "id": 37237246,
    "title": "मदरबोर्ड के लोगों के एक समूह ने अभी अपना खुद का नया स्वतंत्र आउटलेट बनाया है।",
    "originLink": "https://www.404media.co/welcome-to-404-media/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37237246",
    "commentBody": "",
    "originSummary": [
      "404 मीडिया एक नई डिजिटल मीडिया कंपनी है जिसकी स्थापना वाइस के मदरबोर्ड के पूर्व पत्रकारों द्वारा की गई थी।",
      "कंपनी प्रौद्योगिकी पत्रकारिता के उत्पादन पर केंद्रित है जिसका एक महत्वपूर्ण सामाजिक प्रभाव है और एक स्थायी, पाठक-समर्थित व्यवसाय के रूप में संचालित होता है।",
      "वे अनूठी कहानियों पर रिपोर्ट करने, गलत काम का पर्दाफाश करने और गंभीर और अपमानजनक सामग्री प्रदान करने की योजना बनाते हैं।",
      "साइट शुरू में लेखों तक मुफ्त पहुंच प्रदान करेगी, लेकिन भविष्य में कुछ सामग्री के लिए एक पेवॉल पेश किया जाएगा।",
      "ग्राहकों को विशेष लेख, टिप्पणी विशेषाधिकार और बोनस पॉडकास्ट एपिसोड जैसे लाभ प्राप्त होंगे।",
      "कंपनी के दीर्घकालिक लक्ष्यों में पुस्तकों, वृत्तचित्रों और फिल्मों जैसे अन्य मीडिया प्रारूपों में विस्तार करना शामिल है।",
      "वे हैकिंग, साइबर सुरक्षा, सेक्स, एआई, उपभोक्ता अधिकार, निगरानी और गोपनीयता जैसे विषयों पर ध्यान देने के साथ पारदर्शिता, ग्राउंड-अप रिपोर्टिंग और खोजी पत्रकारिता को प्राथमिकता देते हैं।",
      "संस्थापकों का उद्देश्य गुणवत्ता पत्रकारिता को प्राथमिकता देकर, लागत प्रभावी निर्णय लेने और अपने दर्शकों से समर्थन प्राप्त करके एक लाभदायक मीडिया कंपनी बनाना है।"
    ],
    "commentSummary": [
      "मदरबोर्ड के कर्मचारियों ने पत्रकारिता का समर्थन करने और नई मीडिया कंपनियों के त्रुटिपूर्ण व्यवसाय मॉडल से बचने के लिए एक स्वतंत्र आउटलेट 404 मीडिया लॉन्च किया है।",
      "404 मीडिया का उद्देश्य पत्रकारों को भुगतान करना और छोटे व्यावहारिक लेखों और लंबी जांच पर ध्यान केंद्रित करना है, संभावित रूप से एक मंच के रूप में मास्टोडॉन का उपयोग करना।",
      "सदस्यता मूल्य निर्धारण, सामग्री साइट चलाने की चुनौतियों और विश्वसनीयता और पूर्वाग्रहों के बारे में चिंताओं के बारे में चर्चाएं हैं। इस बीच, मदरबोर्ड जवाबदेही पत्रकारिता प्रदान करने और अपरंपरागत विषयों को कवर करने के लिए एक सदस्यता सेवा भी शुरू कर रहा है। कंपनी अपनी सदस्यता सेवा की सफलता में आश्वस्त है और तकनीकी पत्रकारिता में एक महत्वपूर्ण प्रकाशन बनने का लक्ष्य रखती है।"
    ],
    "points": 257,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1692803375
  },
  {
    "id": 37236916,
    "title": "रस्ट सीखने के लिए आधे घंटे का समय (2020)",
    "originLink": "https://fasterthanli.me/articles/a-half-hour-to-learn-rust",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37236916",
    "commentBody": "",
    "originSummary": [
      "यह लेख रस्ट प्रोग्रामिंग भाषा के लिए एक व्यापक परिचय प्रदान करता है, जिसमें वाक्यविन्यास, अवधारणाओं, सुविधाओं और कोड उदाहरणों को शामिल किया गया है।",
      "यह पैटर्न मिलान, परिवर्तनीय बाइंडिंग और संदर्भ, जेनेरिक, जीवनकाल, उधार और त्रुटि हैंडलिंग जैसे महत्वपूर्ण विषयों की पड़ताल करता है।",
      "लेख रस्ट कंपाइलर की उपयोगिता पर जोर देता है और आगे सीखने के लिए अतिरिक्त संसाधन प्रदान करता है।"
    ],
    "commentSummary": [
      "30 मिनट में रस्ट सिखाने का दावा करने वाले एक संसाधन पर चर्चा की गई है, जिसमें उपयोगकर्ता रस्ट की उधार और स्वामित्व प्रणाली के साथ अपने अनुभव साझा करते हैं।",
      "रस्ट की जटिलता पर बहस की जाती है, सरलीकरण के लिए तर्क और अभिव्यंजक भाषाओं में जटिलता की आवश्यकता को स्वीकार करते हुए।",
      "संकलन-समय स्मृति सुरक्षा के साथ एक सरल भाषा की संभावना का उल्लेख किया गया है, साथ ही उन लोगों के लिए बेयर मेटल रस्ट का उपयोग करने का सुझाव दिया गया है जो मौजूदा कोडबेस से बंधे नहीं हैं।"
    ],
    "points": 210,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1692802171
  },
  {
    "id": 37244292,
    "title": "इतना लंबा, ट्विटर और Reddit",
    "originLink": "https://andrewkelley.me/post/goodbye-twitter-reddit.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37244292",
    "commentBody": "",
    "originSummary": [
      "सॉफ्टवेयर डेवलपर एंड्रयू केली ने अपने मानसिक स्वास्थ्य पर नकारात्मक प्रभाव के कारण ट्विटर और रेडिट छोड़ दिया है।",
      "केली का मानना है कि ट्विटर गुस्से और चरम सामग्री को बढ़ावा देता है, जो नकारात्मक विश्वदृष्टि में योगदान देता है।",
      "वह Reddit की इसके लाभ-संचालित दृष्टिकोण और गुणवत्ता में गिरावट के लिए भी आलोचना करता है, / r / zig सबरेडिट को बंद करता है और Ziggit विकल्प का सुझाव देता है।"
    ],
    "commentSummary": [
      "सोशल मीडिया या फोरम प्लेटफॉर्म के रूप में डिस्कॉर्ड की सीमाएं और कमियां हैं, जिसमें डिजाइन के मुद्दे और गैर-गेमिंग उद्देश्यों के लिए अनुपयुक्तता शामिल है।",
      "डिस्कॉर्ड पर स्पैम और ट्रोल के बारे में बहस चल रही है, जिसमें उपयोगकर्ता समाधान सुझाते हैं और चिंता व्यक्त करते हैं।",
      "चर्चा में भाग लेने वालों ने लेमी, फ़ोरम, ट्विटर और रेडिट जैसे अन्य ऑनलाइन प्लेटफार्मों का उल्लेख किया, उनकी प्राथमिकताओं और चिंताओं पर चर्चा की। कुछ प्रतिभागी एक ब्लॉग को बढ़ावा देने के लिए सोशल मीडिया का उपयोग करने पर चर्चा करते हैं, जबकि अन्य सभी सोशल मीडिया खातों को हटाने की वकालत करते हैं। आरएसएस फीड और एक ट्रोल के सबरेडिट पर कब्जा करने का भी उल्लेख किया गया है।"
    ],
    "points": 200,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1692843242
  },
  {
    "id": 37234404,
    "title": "कॉफी के मैदान कंक्रीट को 30% मजबूत बनाते हैं",
    "originLink": "https://www.rmit.edu.au/news/all-news/2023/aug/coffee-concrete",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37234404",
    "commentBody": "",
    "originSummary": [
      "ऑस्ट्रेलिया में इंजीनियरों ने भुने हुए प्रयुक्त-कॉफी के मैदानों को शामिल करके कंक्रीट की ताकत बढ़ाने की एक विधि की खोज की है।",
      "इस तकनीक में अपशिष्ट कॉफी के मैदान को बायोचार में बदलना शामिल है, जिसके परिणामस्वरूप कंक्रीट 30% मजबूत है।",
      "इस दृष्टिकोण का उपयोग करके, न केवल कंक्रीट के प्रदर्शन में सुधार होता है, बल्कि यह लैंडफिल में भेजे जाने वाले कचरे की मात्रा को भी कम करता है।",
      "टीम विभिन्न उद्योगों के साथ साझेदारी करने और उनके निष्कर्षों को लागू करने के लिए क्षेत्र परीक्षण करने का इरादा रखती है।",
      "इस नवाचार में जैविक कचरे के पुनर्चक्रण को बढ़ाने और रेत जैसे मूल्यवान संसाधनों को संरक्षित करने में मदद करने की क्षमता है।"
    ],
    "commentSummary": [
      "ऑस्ट्रेलिया में आरएमआईटी विश्वविद्यालय के वैज्ञानिकों के अनुसार, कंक्रीट में कॉफी के मैदान जोड़ने से इसकी ताकत 30% तक बढ़ सकती है।",
      "इस खोज में कार्बन पृथक्करण और निर्माण उद्योग में कार्बन उत्सर्जन को कम करने की क्षमता के लिए निहितार्थ हैं।",
      "हालांकि, लापता कार्बन पर कर को लागू करने के अनपेक्षित परिणामों और विकृत प्रोत्साहनों के बारे में चिंताएं हैं।",
      "चर्चा एकमुश्त प्रतिबंध के बजाय निवारक के रूप में उच्च शुल्क के उपयोग और इस तरह के दृष्टिकोण के फायदे और नुकसान की भी पड़ताल करती है।",
      "जलवायु परिवर्तन को संबोधित करने के लिए प्रदूषण पर कार्बन कर या कर लागू करने के बारे में बहस चल रही है, इसके प्रभाव पर विभिन्न दृष्टिकोण ों के साथ।",
      "कंक्रीट उत्पादन में कॉफी के मैदान के संभावित लाभ और खाद एजेंट के रूप में उनके उपयोग पर भी चर्चा की जाती है।",
      "कंक्रीट में कॉफी के मैदान का उपयोग करने के रसद, ऊर्जा आवश्यकताएं और संभावित पर्यावरणीय प्रभाव विचार के विषय हैं।",
      "बातचीत में पारंपरिक कंक्रीट और अपशिष्ट प्रबंधन चुनौतियों के विकल्पों का उल्लेख किया गया है।"
    ],
    "points": 192,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1692791125
  }
]
