[
  {
    "id": 36506865,
    "timestamp": 1687961892,
    "title": "We raised a bunch of money",
    "url": "https://fly.io/blog/we-raised-a-bunch-of-money/",
    "hn_url": "http://news.ycombinator.com/item?id=36506865",
    "content": "AuthorNameKurt MackeySocial Media@mrkurtView Twitter ProfileThis past July, we raised $25MM from A16Z and our existing investors, including Intel Capital and Dell. Recently, we raised an additional $70MM led by EQT Ventures.Why do startups write announcements like these? We went back and forth on it. There are lots of reasons, most of them dumb.Our first reason is obvious, and mercenary. It’s the same reason we write anything: to woo customers. We’re all adults here, we can talk about this stuff, right? There are customers who are comfortable engaging with tiny Fly.io, and others who are comfortable engaging with the Fly.io that raised an additional $70MM led by EQT ventures. Alcoa: ring us up!More compellingly, it's an opportunity to gaze deeply into our own navels. We’ve been talking to users, fans, and detractors about what we’ve been doing, for years. We evolved, and got religion about a particular vision of what we’re building. We shared that with investors, and they bought it (suckers). Now we'll share with you.The Two Hour ProblemHere’s what we believed in 2020: apps work better when they run closer to their users. Some kinds of apps, like video or real-time presence, can't be done without physical locality. So, that’s what we expected to talk about on our HN launch thread: WebRTC, edge caching, game servers.What people actually wanted to talk about, though? Databases.Here’s what we missed: we thought there was a particular kind of “edgy” app that demanded global deployment. But it turns out, most apps want to be edgy… if it's easy.What's going on here? Why is edge deployment table stakes for a game server and an untenable science project for an online bookstore? We think it's because game servers have to be edgy, and online bookstores don't. The game server team will bang on edge deployment until it's solved. The bookstore team will try for about two hours, not find a clear path forward, and then give up and move on to other things.The result of this is an Internet where all of the world's CRUD apps are hosted in Loudoun County, VA (motto: \"where tradition meets innovation\"), at Amazon's us-east-1 in Ashburn, a city with so many Rails apps that one of them was elected to the county Board of Supervisors.We think everybody understands that it'd be better to run close to users rather than in the Internet's least worst data center. But with ordinary tooling, getting an app running in more than one city at the same time isn't a two-hour problem: in two hours, you'll learn that it's possible to run simultaneously in Sydney, Frankfurt, and Dallas, but not how to do it, or how long it'll take.So our bet is simple: with the right platform and toolchain, people building bookstores, sandwich rating apps, music recommenders, mailing list managers for churches, and every other kind of app will build apps that run fast globally. Not just walking distance from Carolina Brothers BBQ in Ashburn, but in Chicago, or Sydney, or Singapore, or São Paulo. Because being fast in more than one city at the same time is a super valuable feature!We think this pattern holds for a lot of things. We're going to track those things down and build them.For example: sandboxing, code editors and REPLs, and CI/CD applications all have to figure out how to run untrusted customer code. They all figure out how to spin up locked down containers on demand. But being able to spin up a VM on the fly is a super valuable feature for all kinds of apps (as anyone who's ever debugged a stuck job queue can attest). Why doesn't everybody do it? Because it isn't clear after two hours of investigation how to do it. So we built Fly Machines, which makes spinning up a VM as straightforward as calling a function.We've got more things like this coming. Real-time features and user presence are two-hour features. So is encryption and secret storage. And clustered databases. And hardware-accelerated inferencing.There are other companies looking to solve \"two hour window\" problems for developers: distributed databases, data locality, storage, AI, app frameworks. If we get Fly.io right, we'll give those platforms new primitives to build on top of, get new ideas in front of users faster, and ratchet up the quality of every application anywhere.Sounds like an investment pitch? Well, yeah, it was.Why We Raised A Bunch Of MoneyHere's what we think it takes to build this kind of platform:A hardware fleet. Fly.io has always run on its own hardware. There are fun, technical, “control your own destiny” reasons to rack hardware instead of layering on top of commodity clouds. But it's really just economics. If you want to get people to build apps on your platform, you need a shot at being around 10 years from now. Hardware is what makes the margins work.All the regions. This is subtle! We launched with 19 regions, which, if you’re just serving individual application developers, is plenty. But alongside individual apps, we want other platforms running on us — managed databases, developer tools. And those companies need all the regions. We’re up to 33 regions now, and we’re getting much faster at lighting new ones up.Support and reliability. We’re under no illusions about the platform reliability task we’re facing, or about our ability to clever our way through it (we’re not that clever to begin with).Those things are all capital intensive, and alongside them we’d like to place more bets: on advanced storage, on security capabilities, on new kinds of hardware. So you see where the money goes.Here’s What’s Not Changing🎶 There are two kinds of platform companies 🎶 : the kind where you can sign up online and be playing with them in 5 minutes, and the kind where you can sign up online and get a salesperson to call and quote you a price and arrange a demo.🎶 There are two kinds of platform companies 🎶 : the kind you can figure out without reading the manual, and the kind where publishers have competing books on how to use them, the kind where you can get professionally certified in actually being able to boot up an app on them.🎶 There are two kinds of platform companies 🎶 : the kind where you can get your Python or Rust or Julia code running nicely, and the kind where you find a way to recompile it to Javascript.The kind of platform company we want to be hasn’t changed since 2020. Our features are all generally a command or two in flyctl, and they work for any app that can packaged in a container.You can take our word for that, but if you’ve already got a working Docker container for your app, you can put us to the test. From a standing start, you should be able to get it running on Fly.io in single digit minutes, and on every continent in just a minute or two more.LAST UPDATED•JUN 27, 2023Share this post on TwitterShare this post on Hacker NewsShare this post on RedditPrevious post ↓Python Async Workers on Fly Machines",
    "summary": "- The company Fly.io recently raised a significant amount of money from investors, including A16Z, Intel Capital, and Dell.\n- The primary reasons for announcing this fundraising are to attract customers and to share their vision and progress with users, fans, and detractors.\n- Fly.io aims to provide a platform and toolchain that allows developers to build apps that run fast globally, not just in one location, through features like edge deployment and spinning up virtual machines on demand.",
    "hn_title": "We raised a bunch of money",
    "original_title": "We raised a bunch of money",
    "score": 609,
    "hn_content": "- Reader concerns about companies that rely heavily on VC funding and the potential impact on stability and future costs\n- VC funding can be seen as a hidden subsidy that may not be sustainable in the long term\n- The analogy of hiring a lawn guy who keeps adding additional services and increasing prices resonates with reader experiences\n- Competition and customer needs can drive innovation and prevent companies from becoming too dependent on VC funding\n- The market concentration of VC capital and the lack of competition from smaller players can contribute to wealth inequality in the industry\n- Some readers prefer to support small teams or indie developers who may offer more personalized and customer-focused services- Fly.io, a cloud infrastructure company, has raised $70 million in a funding round led by EQT Ventures.\n- Fly.io runs its own hardware and offers a full-stack platform for hosting apps.\n- The company focuses on providing reliable and fast infrastructure, particularly for developers and small to medium-sized businesses.\n- Fly.io distinguishes itself from other cloud providers by offering pay-per-minute pricing and a high level of control over app deployment.\n- The company's funding will allow it to continue expanding and improving its services.\n- The company emphasizes the importance of maintaining good margins and optimizing costs in the highly competitive cloud hosting market.\n- Fly.io's unique offering includes its built-in multi-region single-write-leader clustered Postgres offering.\n- The company's target audience includes developers who value control, performance, and the ability to easily deploy their apps close to users.- The post discusses the concept of venture funding in the tech industry and its impact on startups and customers.\n- The comment section explores different perspectives on the benefits and drawbacks of venture-funded companies.\n- Some argue that venture funding allows for rapid growth and innovation, while others caution against the potential negative consequences for customers and employees.\n- The discussion touches on the pricing strategies of venture-backed startups and the potential for increased prices as companies mature.\n- The comparison between different cloud hosting providers, such as Fly.io, Hetzner, and AWS, is also mentioned.\n- The post prompts readers to consider their own stance on venture-funded companies and their willingness to support them.\n- The comment section features a mix of opinions, from those who support venture funding and its role in supporting startups to those who advocate for alternative models, such as bootstrapping or seed-strapping.\n- The role of forums like Hacker News in discussing and debating these topics is highlighted.\n- The concept of capitalism and its relationship to venture funding is briefly mentioned.\n- The importance of managing customer expectations and being prepared to switch providers if necessary is emphasized.\n- The need for capital investment in infrastructure and the challenges of scaling a business are discussed.\n- The potential advantages and disadvantages of venture-backed startups are explored from both customer and company perspectives.\n- The diversity of opinions and debate in the comment section reflects the complexities of the topic and the varying perspectives within the tech industry.",
    "hn_summary": "- Fly.io, a cloud infrastructure company, has raised $70 million in funding to expand and improve its services.\n- The company distinguishes itself by offering pay-per-minute pricing and a high level of control over app deployment.\n- The comments discuss the impact of venture funding on startups and customers, including concerns about stability, future costs, and potential wealth inequality."
  },
  {
    "id": 36503983,
    "timestamp": 1687942394,
    "title": "Fast machines, slow machines",
    "url": "https://jmmv.dev/2023/06/fast-machines-slow-machines.html",
    "hn_url": "http://news.ycombinator.com/item?id=36503983",
    "content": "Well, that was unexpected. I recorded a couple of crappy videos in 5 minutes, posted them on a Twitter thread, and went viral with 8.8K likes at this point. I really could not have predicted that, given that I’ve been posting what-I-believe-is interesting content for years and… nothing, almost-zero interest. Now that things have cooled down, it’s time to stir the pot and elaborate on those thoughts a bit more rationally.To summarize, the Twitter thread shows two videos: one of an old computer running Windows NT 3.51 and one of a new computer running Windows 11. In each video, I opened and closed a command prompt, File Explorer, Notepad, and Paint. You can clearly see how apps on the old computer open up instantly whereas apps on the new computer show significant lag as they load. I questioned how computers are actually getting better when trivial things like this have regressed. And boom, the likes and reshares started coming in. Obviously some people had issues with my claims, but there seems to be an overwhelming majority of people that agree we have a problem.To open up, I’ll stand my ground: latency in modern computer interfaces, with modern OSes and modern applications, is terrible and getting worse. This applies to smartphones as well. At the same time, while UIs were much more responsible on computers of the past, those computers were also awful in many ways: new systems have changed our lives substantially. So, what gives?The original comparisonLet’s address the elephant in the room first. The initial comparison I posted wasn’t fair and I was aware of that going in. That said, I knew repeating the experiment “properly” would yield the same results, so I plowed ahead with whatever I had right then. The videos were unplanned because the idea for the Tweets came to mind when I booted the old machine, clicked on Command Prompt, and was blown away by the immediacy to start the app.The original comparison videos showed:An AMD K7-600 with 128MB of RAM and a 5400 RPM HDD running Windows NT 3.51. This was a machine from the year 1999-2000 with an OS that was about 5 years older than it. Hardware was experiencing really fast improvements back then, particularly in CPU speeds, and you were kinda expected to keep up with the 2-year upgrade treadmill or suffer from incredibly slowness. All this is to say that this machine was indeed overpowered for the OS I used.Please remind me how we are moving forward. In this video, a machine from the year ~2000 (600MHz, 128MB RAM, spinning-rust hard disk) running Windows NT 3.51. Note how incredibly snappy opening apps is. 👇 pic.twitter.com/YEO824vIqI— Julio Merino (@jmmv) June 22, 2023A Surface Go 2 with an Intel Core m3 CPU, 8GB of RAM, and an SSD running Windows 11. This is a 3-year old machine that shipped with Windows 10, but Windows 11 is officially supported on it—and as you know, that means you are tricked into upgrading. This is not a powerful machine by any means, but: first, it’s running the verbatim Microsoft experience, and second, it should be much more powerful than the K7 system, shouldn’t it? We are continuously reminded that any computer or phone today has orders of magnitude more power than past machines.Now look at opening the same apps on Windows 11 on a Surface Go 2 (quad-core i5 processor at 2.4GHz, 8GB RAM, SSD). Everything is super sluggish. pic.twitter.com/W722PNEGv0— Julio Merino (@jmmv) June 22, 2023Oh, and yes, I quoted the wrong hardware specs in the original tweet. Looking again on how I made that mistake: I searched for “Surface Go 2” in Bing, I landed on the “Surface Laptop Go 2” page, and copied what I saw there without noticing that it wasn’t accurate.All apps had been previously open, so they should all have been comfortably sitting in RAM.The better comparisonObviously various people noticed that there was something off with my comparison (unfair hardware configurations, wrong specs), so I redid the comparison once the thread started gaining attention:Windows 2000 on the K7-600 machine (see installation thread). This is an OS from 1999 running on hardware from that same year. And, if you ask me, this was the best Windows release of all times: super-clean UI on an NT core, carrying all of the features you would want around performance and stability (except with terrible boot times). As you can see, things still fare very well for the old machine in terms of UI responsiveness.For those thinking that the comparison was unfair, here is Windows 2000 on the same 600MHz machine. Both are from the same year, 1999. Note how the immediacy is still exactly the same and hadn’t been ruined yet. pic.twitter.com/Tpks2Hd1Id— Julio Merino (@jmmv) June 23, 2023Windows 11 on a Mac Pro 2013 (see installation instructions) with a 6-core Xeon E5-1650v2 at 3.5GHz, 32GB of RAM, dual GPUs, and an SSD that can sustain up to 1GB/s. I know, this is a 10-year old machine at this point running a more modern OS. But please, go ahead, tell me with a straight face how hardware with these specs cannot handle opening trivial desktop applications without delay. I’ll wait.Oh, and one more thing. Yes, yes, the Surface Go 2 is underpowered and all you want. But look at this video. Same steps on a 6-core Mac Pro @ 3.5GHz with 32GB of RAM. All apps cached. Note how they get painted in chunks. It's not because of animations or mediocre hardware. pic.twitter.com/9TOGAdaTXO— Julio Merino (@jmmv) June 23, 2023The reason I used the Mac Pro is because it is the best machine I have running Windows right now and, in fact, it’s my daily driver. But again, I do not care about how running this comparison on an “old” machine might be “inaccurate”. Back when I left Microsoft last year, I was regularly using a Z4 desktop from 2022, a maxed-out quad-core i7 ThinkPad with 32GB of RAM, and an i7 Surface Laptop 3 with 16GB of RAM. Delays were shorter on these, of course, but interactions were still noticeably slow.So, in any case: I agree the original comparison was potentially flawed, but as you can see, a better comparison yields the same results—which I knew it would. After years upon years of computer usage, you gain intuition on how things should behave, and trusting such intuition tends to work well as long as you validate your assumptions later, don’t get me wrong!Computer advancementsLet’s put the tweets aside and talk about how things have changed since the 2000s. I jokingly asked how we are “moving forward” as an industry, so it’s worth looking into it.Indeed, we have moved forward in many aspects: we now have incredible graphics and high-resolution monitors, super-fast networks, real-time video editing, and much more. All of these have improved over the years and it is very true that these advancements have allowed for certain life transformations to happen. Some examples: the ability to communicate with loved ones much more easily thanks to great-quality videoconferencing; the ability to have a streaming “cinema at home”; and the painless switch to remote work during the pandemic1.We have also moved forward on the I/O side. Disk I/O had always been the weakest spot on past systems. Floppy disks were unreliable and slow. CDs and DVDs were slightly-more-reliable but also slow. HDDs were the bottleneck for lots of things: their throughput improved over time, allowing things like higher-resolution video editing and the like, but random I/O hit physical limits—and fast random I/O is what essentially drives desktop responsiveness.Then, boom, SSDs appeared and started showing up on desktops. These were a game-changer because they fixed the problem of random I/O. All of a sudden, booting a computer, launching a heavy game, opening folders with lots of small photos, or simply just using your computer… all improved massively. It’s hard to explain the usability improvements that these brought if you did not live through this transition, and it’s scary how those improvements are almost gone; more on that later.Other stuff also improved, like the simplicity to install new hardware, the pervasiveness of wireless connections and devices, the internationalization of text and apps (Unicode isn’t easy nor cheap, I’ll grant that)… all providing more usable machines in more contexts than ever.So yeah, things are better in many areas and we have more power than ever. Otherwise, we couldn’t do things like ML-assisted photo processing on a tiny phone, which was unimaginable in the 2000s.Terrible latencyYet… none of these advancements justify why things are as excruciatingly slow as they are today in terms of UI latency. Old hardware from the year 1999, combined with an OS from that same year, shows that responsive systems have existed2. If anything, all these hardware improvements I described should have made things better, not worse, shouldn’t they?Some replied to the comparison telling me that graphical animations and bigger screens are “at fault” because we have to draw more pixels, and thus the fact that we have these new niceties means we have to tolerate slowness. Well, not quite. Witness for yourself:And... one more thing? To those saying: \"it's the higher 4K resolution!\" or \"it's the good-looking animations!\" or \"it's the pretty desktop background!\"—no, they aren't at fault. See, the slowness is still visible with all of these disabled. In the end... blog post coming soon. pic.twitter.com/9BQy6IpK6a— Julio Merino (@jmmv) June 26, 2023GPUs are a commodity now, and they lift the heavy burden of graphics management from the CPU. The kinds of graphical animations that a desktop renders are extremely cheap to compute, and this has been proven by macOS since its launch: all graphical effects on a macOS desktop feel instant. The effects do delay interactions though—the desktop switching animation is particularly intrusive, oh god how I hate that thing—but the delays generally come from intentional pauses during the animation. And when the effects introduce latency because the GPU cannot keep up, such as when you attach a 4K display to a really old Mac, then it’s painfully obvious that animations stutter due to lack of power. I haven’t encountered the latter in any of the videos above though, which is why animations and the like have nothing to do with my concerns.So, please, think about it with a critical mind. How is the ability to edit multiple 4K video streams in real time or the ability to stream a 4K movie supposed to make starting apps like Notepad slower? Or opening the context menu in the desktop? Or reading your email? The new abilities we acquired much more power from the CPU and GPU, but they shouldn’t remove performance from tasks that are essentially I/O-bound. Opening a simple app shouldn’t be slower than it was more than 20 years ago; it really shouldn’t be. Yet here we are. The reasons for the desktop latency come from elsewhere, and I have some guesses for those. But first, a look at a couple of examples.ExamplesOn Windows land, there are two obvious examples I want to bring up and that were mentioned in the Twitter thread:Notepad had been a native app until very recently, and it still opened pretty much instantaneously. With its rewrite as a UWP app, things went downhill. The before and after are apparent, and yet… the app continues to be as unfeatureful as it had always been. This is extra slowness for no user benefit.As for Windows Terminal, sure, it is nicer than anything that came before it, but it is visibly much, much heavier than the old Command Prompt. And if you add PowerShell into the mix, we are talking about multiple seconds for a new terminal window to be operational unless you have top-of-the-line hardware.macOS fares better than Windows indeed, but it still has its issues. See this example contributed by @AlexRugerMusic. Even the mighty M1 has trouble opening up the system settings app:Another example:Left: 2006 MBP (2GHz Core 2 Duo, 2GB DDR2 RAM, Max OS X 10.6.8; has SSD)Right: 2021 MacBook Air (M1, 16GB RAM, macOS 13)Apps open about twice as fast on the Pro as they do on the Air (most, not just System Preferences/Settings). pic.twitter.com/PjMX1DI4uz— rewgs (@AlexRugerMusic) June 27, 2023Linux is probably the system that suffers the least from these issues as it still feels pretty snappy on modest hardware. Fedora Linux 38, released in April 2023, runs really well on a micro PC from 11 years ago—even if Gnome or KDE had been resource hogs back in the day. That said, this is only an illusion. As soon as you start installing any modern app that wasn’t developed exclusively for Linux… the slow app start times and generally poor performance show up.Related, but I feel this needs saying: the biggest shock for me was when I joined Google back in 2009. At the time, Google Search and GMail had stellar performance: they were examples to follow. From the inside though… I was quite shocked by how all internal tools crawled, and in particular by how slow the in-house command line tools were. I actually fault Google for the situation we are in today due to their impressive internal systems and their relentless push for web apps at all costs, which brings us to…CausesHow does this all happen? It’s easy to say “Bloat!”, but that’s a hard thing to define because bloat can be justified: what one person considers as bloat is not the same as what another person considers as bloat. After all, “80% of users only use 20% of the software they consume” (see Pareto principle), but the key insight is that the 20% that each user consumes is different from one another. So bloat isn’t necessarily in the features offered by the software; it’s elsewhere.So then we have frameworks and layers of abstraction, which seem to introduce bloat for bloat’s sake. But I’m not sure this is correct either: abstraction doesn’t inherently have to make things slower, as Rust has proven. What makes things slower are priorities. Nobody prioritizes performance anymore unless for the critical cases where it matters (video games, transcoding video, and the like). What people (companies) prioritize is developer time. For example: you might not want to use Rust because its steep learning curve means you’ll spend more time learning than delivering, or its higher compiler times mean that you’ll spend more time waiting for the compiler than shipping debugging production. Or another example: you might not want to develop native apps because that means “duplicate work”, so you reach out for a cross-platform web framework. That is, Electron.I know it’s easy to dunk on Electron, but there are clear telltale signs that this platform is at fault for a lot of the damage done to desktop latency. Take 1Password’s 8th version, which many of users that migrated from the 7th version despise due to the slowness of the new interface. Or take Spotify, which used to prioritize startup and playback latency over anything else in its inception and, as you know if you use it, that’s not true any more:2009 version: 20MB fully native cocoa app, launches in less than a second, instant feedback when you click stuff, playback usually starts within 50ms pic.twitter.com/Enzi40PDCX— Rasmus Andersson (@rsms) May 10, 2023These apps were rewritten in Electron to offer a unified experience across desktops and to cut down costs… but for whom? The cost cuts were for the companies owning the products, not for the users. Such cuts impose a tax on every one of us due to our day-to-day frustrations and the need to unnecessarily upgrade our hardware. Couple these rewrites with the fact that OSes cannot reuse the heavy framework across apps (same idea as how using all RAM as a cache is a flawed premise)… and the bloat quickly adds up when you run these apps concurrently.Leaving Electron aside, another decision that likely introduces latency is the mass adoption of managed and interpreted languages. I know these are easy to dunk on as well, but that’s because we have reasons to do so. Take Java or .NET: several Windows apps have been slowly rewritten in C# and, while I have no proof of this, I’m convinced from past experience that this can be behind the sluggishness we notice. The JDK and the CLR do amazing jobs at optimizing long-running processes (their JIT can do PGO with real time data), but handling quick startup times is not something they manage well. This is why, for example, Bazel spawns a background server process to paper over startup latency and why Android has gone through multiple iterations of AOT compilation. (Edit: there must be other reasons though that I have not researched. As someone pointed out, my assumption that Windows Terminal was mostly C# is not true.)More on this in Wirth’s law.One-off improvements eaten awayTo conclude, let me end with a pessimistic note by going back to hardware advancements.The particular improvement that SSDs brought us was a one-off transformation. HDDs kept getting faster for years indeed, but they never could deliver the kind of random I/O that desktops require to be snappy. The switch to SSDs brought a kind of improvement that was at a different level. Unfortunately… we could only buy those benefits once: there is no other technology to switch to that provides such a transformative experience. And thus, once the benefits brought by the new technology were eaten away by careless software, we are almost back to square one. Yes, SSDs are getting faster, but newer drives won’t bring the kind of massive differences that the change from HDDs to SSDs brought.You can see this yourself if you try using recent versions of Windows or macOS without an SSD: it is nigh impossible. These systems now assume that computers have SSDs in them, which is a fair assumption, but a problematic one due to what I mentioned above. The same applies to “bloat” in apps: open up your favorite resource monitor, look for the disk I/O bandwidth graph, and launch any modern app. You’ll see a stream of MBs upon MBs being loaded from disk into memory, all of which must complete before the app is responsive. This is the kind of bloat that Electron adds and that SSDs permitted, but that could be avoided altogether with different design decisions.Which makes me worried about Apple Silicon. Remember all the rage with the M1 launch and how these new machines had superb performance, extremely long battery life, and no fan noise? Well, wait and see: these benefits will be eaten away if we continue on the same careless path. And once that has happened, it’ll be too late. Retrofitting performance into existing applications is very difficult technically, and almost impossible to prioritize organizationally.So… will computer architects be able to save us with other revolutionary technology shifts? I wouldn’t want to rely on that. Not because the shifts might not exist, but because we shouldn’t need them.Oh wait: remote work does not qualify. I’m sorry: if you did any kind of open source development in the 90s or 2000s, you know that fully-distributed and truly-async work was perfectly possible back then. ↩︎For a more detailed analysis, Dan Luu already covered this type of slowdown introduced by latency in his famous article “Computer latency: 1977-2017”. Note how the article goes further back than 1999 and that the computer with the best latency he found is from 1983. But, yeah, that old computer cannot match the workloads we put our computers through these days, so I don’t think comparing it to a modern desktop would be fair. ↩︎",
    "summary": "- The author conducted a comparison between an old computer running Windows NT 3.51 and a new computer running Windows 11, showing that the old computer had significantly faster app loading times.\n- The author argues that despite advancements in hardware and technology, modern computer interfaces, including smartphones, have terrible latency and are getting worse.\n- The author suggests that bloat in software, frameworks, layers of abstraction, and the mass adoption of managed and interpreted languages could be contributing factors to the slow UI latency experienced on modern computers.",
    "hn_title": "Fast machines, slow machines",
    "original_title": "Fast machines, slow machines",
    "score": 532,
    "hn_content": "- The current state of software development practices is criticized for being inefficient and slow.\n- The prevalence of intermittent performance issues due to distributed computing is highlighted as a problem.\n- The lack of emphasis on parallel computing and utilization of multiple cores in software development is discussed.\n- The issue of time and budget constraints affecting coding quality and efficiency is brought up.\n- The need for a shift in coding practices and a focus on optimization and efficiency is emphasized.\n- The impact of changing technology and the need to keep up with new languages and frameworks is mentioned.\n- The challenges of software development in a rapidly evolving industry are highlighted.\n- The importance of code reviews and the need for thorough understanding of stack details is discussed.\n- The impact of changing hardware performance over time is mentioned.\n- The influence of aesthetic preferences and the impact on performance is highlighted.\n- The focus on user experience and the impact of sluggish software on productivity is discussed.\n- The trade-off between faster software and the need for security measures is mentioned.\n- The need for efficient cross-platform tools to improve software performance is highlighted.\n- The tendency to add more features and complexity to software can slow down performance.\n- The importance of speed as a crucial feature and the need for faster software is emphasized.- Younger generations of software developers prioritize functionality more than the look and feel of applications.\n- The use of modern frameworks and languages can contribute to slower application performance.\n- The focus on cross-platform development often leads to suboptimal performance on different platforms.\n- Companies prioritize cost-efficiency over user experience, resulting in slower and less responsive applications.\n- Open-source projects are not exempt from the decline in software performance over time.\n- Older applications and tools tend to be faster and more efficient than their modern counterparts.\n- Smaller, lightweight applications like SumatraPDF prioritize speed and responsiveness over advanced functionality.\n- Linux-based operating systems and desktop environments are generally considered to be more responsive than Windows or macOS.\n- Using older technologies, such as C++, and adhering to standard user interface elements can result in faster applications.\n- Reader-recommended applications that are known for their speed and responsiveness include Zathura and Evince on Linux, as well as MuPDF and WinDjView on Windows.",
    "hn_summary": "- The current state of software development practices is criticized for being inefficient and slow.\n- The need for a shift in coding practices and a focus on optimization and efficiency is emphasized.\n- The importance of speed as a crucial feature and the need for faster software is emphasized."
  },
  {
    "id": 36502366,
    "timestamp": 1687926993,
    "title": "Plastics are poisoning us",
    "url": "https://www.newyorker.com/magazine/2023/07/03/book-reviews-plastic-waste",
    "hn_url": "http://news.ycombinator.com/item?id=36502366",
    "content": "Annals of ScienceJuly 3, 2023 IssueHow Plastics Are Poisoning UsThey both release and attract toxic chemicals, and appear everywhere from human placentas to chasms thirty-six thousand feet beneath the sea. Will we ever be rid of them?By Elizabeth KolbertJune 26, 2023Annual production of plastic exceeds eight hundred billion pounds; much of it ends up as microplastics, spreading across the ocean.Illustration by Daniel LiévanoListen to this storyIn 1863, when much of the United States was anguishing over the Civil War, an entrepreneur named Michael Phelan was fretting about billiard balls. At the time, the balls were made of ivory, preferably obtained from elephants from Ceylon—now Sri Lanka—whose tusks were thought to possess just the right density. Phelan, who owned a billiard hall and co-owned a billiard-table-manufacturing business, also wrote books about billiards and was a champion billiards player. Owing in good part to his efforts, the game had grown so popular that tusks from Ceylon—and, indeed, elephants more generally—were becoming scarce. He and a partner offered a ten-thousand-dollar reward to anyone who could come up with an ivory substitute.A young printer from Albany, John Wesley Hyatt, learned about the offer and set to tinkering. In 1865, he patented a ball with a wooden core encased in ivory dust and shellac. Players were unimpressed. Next, Hyatt experimented with nitrocellulose, a material made by combining cotton or wood pulp with a mixture of nitric and sulfuric acids. He found that a certain type of nitrocellulose, when heated with camphor, yielded a shiny, tough material that could be molded into practically any shape. Hyatt’s brother and business partner dubbed the substance “celluloid.” The resulting balls were more popular with players, although, as Hyatt conceded, they, too, had their drawbacks. Nitrocellulose, also known as guncotton, is highly flammable. Two celluloid balls knocking together with sufficient force could set off a small explosion. A saloon owner in Colorado reported to Hyatt that, when this happened, “instantly every man in the room pulled a gun.”It’s not clear that the Hyatt brothers ever collected from Phelan, but the invention proved to be its own reward. From celluloid billiard balls, the pair branched out into celluloid dentures, combs, brush handles, piano keys, and knickknacks. They touted the new material as a substitute not just for ivory but also for tortoiseshell and jewelry-grade coral. These, too, were running out, owing to slaughter and plunder. Celluloid, one of the Hyatts’ advertising pamphlets promised, would “give the elephant, the tortoise, and the coral insect a respite in their native haunts.”Hyatt’s invention, often described as the world’s first commercially produced plastic, was followed a few decades later by Bakelite. Bakelite was followed by polyvinyl chloride, which was, in turn, followed by polyethylene, low-density polyethylene, polyester, polypropylene, Styrofoam, Plexiglas, Mylar, Teflon, polyethylene terephthalate (familiarly known as pet)—the list goes on and on. And on. Annual global production of plastic currently runs to more than eight hundred billion pounds. What was a problem of scarcity is now a problem of superabundance.In the form of empty water bottles, used shopping bags, and tattered snack packages, plastic waste turns up pretty much everywhere today. It has been found at the bottom of the Mariana Trench, thirty-six thousand feet below sea level. It litters the beaches of Svalbard and the shores of the Cocos (Keeling) Islands, in the Indian Ocean, most of which are uninhabited. The Great Pacific Garbage Patch, a collection of floating debris that stretches across six hundred thousand square miles between California and Hawaii, is thought to contain some 1.8 trillion plastic shards. Among the many creatures being done in by all this junk are corals, tortoises, and elephants—in particular, the elephants of Sri Lanka. In recent years, twenty of them have died after ingesting plastic at a landfill near the village of Pallakkadu.How worried should we be about what’s become known as “the plastic pollution crisis”? And what can be done about it? These questions lie at the heart of several recent books that take up what one author calls “the plastic trap.”“Without plastic we’d have no modern medicine or gadgets or wire insulation to keep our homes from burning down,” that author, Matt Simon, writes in “A Poison Like No Other: How Microplastics Corrupted Our Planet and Our Bodies.” “But with plastic we’ve contaminated every corner of Earth.”Simon, a science journalist at Wired, is especially concerned about plastic’s tendency to devolve into microplastics. (Microplastics are usually defined as bits smaller than five millimetres across.) This process is taking place all the time, in many different ways. Plastic bags drift into the ocean, where, after being tossed around by the waves and bombarded with UV radiation, they fall apart. Tires today contain a wide variety of plastics; as they roll along, they abrade, sending clouds of particles spinning into the air. Clothes made with plastics, which now comprise most items for sale, are constantly shedding fibres, much the way dogs shed hairs. A study published a few years ago in the journal Nature Food found that preparing infant formula in a plastic bottle is a good way to degrade the bottle, so what babies end up drinking is a sort of plastic soup. In fact, it is now clear that children are feeding on microplastics even before they can eat. In 2021, researchers from Italy announced that they had found microplastics in human placentas. A few months later, researchers from Germany and Austria announced that they’d found microplastics in meconium—the technical term for an infant’s first poop.The hazards of ingesting large pieces of plastic are pretty straightforward; they include choking and perforation of the intestinal tract. Animals that fill their guts with plastics eventually starve to death. The risks posed by microplastics are subtler, but not, Simon argues, any less serious. Plastics are made from by-products of oil and gas refining; many of the chemicals involved, such as benzene and vinyl chloride, are carcinogens. In addition to their main ingredients, plastics may contain any number of additives. Many of these—for example, polyfluoroalkyl substances, or PFASs, which confer water resistance—are also suspected carcinogens. Many of the others have never been adequately tested.As plastics fall apart, the chemicals that went into their manufacture can leak out. These can then combine to form new compounds, which may prove less dangerous than the originals—or more so. A couple of years ago, a team of American scientists subjected disposable shopping bags to several days of simulated sunlight, in order to mimic the conditions that they’d encounter flying or floating loose. The researchers found that a single bag from CVS leached more than thirteen thousand compounds; a bag from Walmart leached more than fifteen thousand. “It is becoming increasingly clear that plastics are not inert in the environment,” the team wrote. Steve Allen, a researcher at Canada’s Ocean Frontier Institute who specializes in microplastics, tells Simon, “If you’ve got an IQ above room temperature, you have to understand that this is not a good material to have in the environment.”VIDEO FROM THE NEW YORKERDad Can Dance: My Father’s Secret Ballet CareerMicroplastics, meanwhile, don’t just leach nasty chemicals; they attract them. “Persistent bioaccumulative and toxic substances,” or PBTs, are a hodgepodge of harmful compounds, including DDT and PCBs. Like microplastics, which are often referred to in the scientific literature as MPs, PBTs are everywhere these days. When PBTs encounter MPs, they preferentially adhere to them. “In effect, plastics are like magnets for PBTs” is how the Environmental Protection Agency has put it. Consuming microplastics is thus a good way to swallow old poisons.Then, there’s the threat posed by the particles themselves. Microplastics—and in particular, it seems, microfibres—can get pulled deep into the lungs. People who work in the synthetic-textile industry, it has long been known, suffer from high rates of lung disease. Are we breathing in enough microfibres that we are all, in effect, becoming synthetic-textile workers? No one can say for sure, but, as Fay Couceiro, a researcher at England’s University of Portsmouth, observes to Simon, “We desperately need to find out.”Whatever you had for dinner last night, the meal almost certainly left behind plastic in need of disposal. Before tossing your empty sour-cream tub or mostly empty ketchup bottle, you may have searched it for a number, and if you found one, inside a cheerful little triangle, you washed it out and set it aside to be recycled. You might also have imagined that with this effort you were doing your part to stem the global plastic-pollution tide.The British journalist Oliver Franklin-Wallis used to be a believer. He religiously rinsed his plastics before depositing them in one of the five color-coded rubbish bins that he and his wife kept at their home in Royston, north of London. Then Franklin-Wallis decided to find out what was actually happening to his garbage. Disenchantment followed.“If a product is seen as recycled, or recyclable, it makes us feel better about buying it,” he writes in “Wasteland: The Secret World of Waste and the Urgent Search for a Cleaner Future.” But all those little numbers inside the triangles “mostly serve to trick consumers.”Franklin-Wallis became interested in the fate of his detritus just as the old order of Britain’s rubbish was collapsing. Up until 2017, most of the plastic waste collected in Europe and in the United States was shipped to China, as was most of the mixed paper. Then Beijing imposed a new policy, known as National Sword, that prohibited imports of yang laji, or “foreign garbage.” The move left waste haulers from California to Catalonia with millions of mildewy containers they couldn’t get rid of. “plastics pile up as china refuses to take the west’s recycling,” a January, 2018, headline in the Times read. “It’s tough times,” Simon Ellin, the chief executive of Britain’s Recycling Association, told the paper.Trash, though, finds a way. Not long after China stopped taking in foreign garbage, waste entrepreneurs in other nations—Malaysia, Indonesia, Vietnam, Sri Lanka—started to accept it. Mom-and-pop plastic-recycling businesses sprang up in places where they were regulated laxly, if at all. Franklin-Wallis visited one such informal recycling plant, in New Delhi; the owner allowed him inside on the condition that he not reveal exactly how the business operates or where it is situated. He found workers in a fiendishly hot room feeding junk into a shredder. Workers in another, equally hot room fed the shreds into an extruder, which pumped out little gray pellets known as nurdles. The ventilation system consisted of an open window. “The thick fug of plastic fumes in the air left me dazed,” Franklin-Wallis writes.Nurdles, which are key to manufacturing plastic products, are small enough to qualify as microplastics. (It’s been estimated that ten trillion nurdles a year leak into the oceans, most from shipping containers that tip overboard.) Usually, nurdles are composed of “virgin” polymers, but, as the New Delhi plant demonstrates, it is also possible to produce them from used plastic. The problem with the process, and with plastic recycling more generally, is that a polymer degrades each time it’s heated. Thus, even under ideal circumstances, plastic can be reused only a couple of times, and in the waste-management business very little is ideal. Franklin-Wallis toured a high-end recycling plant in northern England that handles pet, the material that most water and soda bottles are made from. He learned that nearly half the bales of pet that arrive at the plant can’t be reprocessed because they’re too contaminated, either by other kinds of plastic or by random crap. “Yield is a problem for us,” the plant’s commercial director concedes.Franklin-Wallis comes to see plastic recycling as so much (potentially toxic) smoke and mirrors. Over the years, he writes, “a kind of playbook” has emerged. Under public pressure, a company like Coca-Cola or Nestlé pledges to insure that the packaging for its products gets recycled. When the pressure eases, it quietly abandons its pledge. Meanwhile, it lobbies against any kind of legislation that would restrict the sale of single-use plastics. Franklin-Wallis quotes Larry Thomas, the former president of the Society of the Plastics Industry, who once said, “If the public thinks recycling is working, then they are not going to be as concerned about the environment.”Right around the time that Franklin-Wallis started tracking his trash, Eve O. Schaub decided to spend a year not producing any. Schaub, who has been described as a “stunt memoirist,” had previously spent a year avoiding sugar and forcing her family to do the same, an exercise she chronicled in a book titled “Year of No Sugar.” The year of no sugar was followed by “Year of No Clutter.” When she proposes a trash-free annum to her husband, he says he doubts it is possible. Her younger daughter begs her to wait until she goes away to college. Schaub plunges ahead anyway.“As the beginning of the new year loomed, I was feeling pretty good about our chances,” she recalls in “Year of No Garbage.” “I mean, really. How hard could it be?”What Schaub means by “no garbage” is not exactly no garbage. Under her scheme, refuse that can be composted or recycled is allowed, so her family can keep tossing out old cans and empty wine bottles along with food scraps. What turns out to be hard—really, really hard—is dealing with plastic.At first, Schaub divides plastic waste into two varieties. There’s the kind with the little numbers, which her trash hauler accepts as part of its “single stream” recycling program and so, by her definition, doesn’t count as trash. Then, there’s the kind with no numbers, which isn’t supposed to go in the recycling bin and therefore does count. Schaub finds that even when she purchases something in a numbered container—guacamole, say—there’s usually a thin sheet of plastic under the lid that’s numberless. A lot of her time goes into rinsing off these sheets and other stray plastic bits and trying to figure out what to do with them. She is excited to find a company called TerraCycle, which promises—for a price—to “recycle the unrecyclable.” For a hundred and thirty-four dollars, she purchases a box that can be returned to TerraCycle filled with plastic packaging, and for an additional forty-two dollars she buys another box that can be filled with “oral care waste,” such as used toothpaste tubes. “I sent my TerraCycle Plastic Packaging box as densely packed with plastic as any box could be,” she writes.Eventually, though, like Franklin-Wallis, Schaub comes to see that she’s been living a lie. Midway through her experiment, she signs up for an online course called Beyond Plastic Pollution, offered by Judith Enck, a former regional administrator for the E.P.A. Only containers labelled No. 1 (pet) and No. 2 (high-density polyethylene) get melted down with any regularity, Schaub learns, and to refashion the resulting nurdles into anything useful usually requires the addition of lots of new material. “No matter what your garbage service provider is telling you, numbers 3, 4, 6 and 7 are not getting recycled,” Schaub writes. (The italics are hers.) “Number 5 is a veeeery dubious maybe.”TerraCycle, too, proves a disappointment. It gets sued for deceptive labelling and settles out of court. A documentary-film crew finds that dozens of bales of waste sent to the company for recycling have instead been shipped off to be burned at a cement kiln in Bulgaria. (According to the company’s founder, this is the result of an unfortunate mistake.)“I had wanted so badly to believe that TerraCycle and Santa Claus and the Easter bunny were real, that I had been willing to overlook the fact that Santa’s handwriting looks suspiciously like Mom’s,” Schaub writes. Toward the end of the year, she concludes that pretty much all plastic waste—numbered, unnumbered, or shipped off in boxes—falls under her definition of garbage. She also concludes that, “in this day, age and culture,” such waste is pretty much impossible to avoid.A few months ago, the E.P.A. issued a “draft national strategy to prevent plastic pollution.” Americans, the report noted, produce more plastic waste each year than the residents of any other country—almost five hundred pounds per person, nearly twice as much as the average European and sixteen times as much as the average Indian. The E.P.A. declared the “business-as-usual approach” to managing this waste to be “unsustainable.” At the top of its list of recommendations was “reduce the production and consumption” of single-use plastics.Just about everyone who contemplates the “plastic pollution crisis” arrives at the same conclusion. Once a plastic bottle (or bag or takeout container) has been tossed, the odds of its ending up in landfill, on a faraway beach, or as tiny fragments drifting around in the ocean are high. The best way to alter these odds is not to create the bottle (or bag or container) in the first place.“So long as we’re churning out single-use plastic . . . we’re trying to drain the tub without turning off the tap,” Simon writes. “We’ve got to cut it out.”“We can’t rely on half-measures,” Schaub says. “We have to go to the source.” Her own local supermarket, in southern Vermont, stopped handing out plastic bags in late 2020, she notes. “Do you know what happened? Nothing. One day we were poisoning the environment with plastic bags in the name of ultra-convenience and the next? We weren’t.”“We now know that we can’t start to reduce plastic pollution without a reduction of production,” Imari Walker-Franklin and Jenna Jambeck, both environmental engineers, observe in “Plastics,” forthcoming from M.I.T. Press. “Upstream and systemic change is needed.”Of course, it’s a lot easier to talk about “turning off the tap” and changing the system than it is to actually do so. First, there are the political obstacles. For all intents and purposes, the plastics industry is a subsidiary of the fossil-fuel industry. ExxonMobil, for instance, is the world’s fourth-largest oil company and also its largest producer of virgin polymers. The connection means that any effort to reduce plastic consumption is bound to be resisted, either openly or surreptitiously, not just by companies such as Coca-Cola and Nestlé but also by corporations like Exxon and Shell. In March, 2022, diplomats from a hundred and seventy-five nations agreed to try to fashion a global treaty to “end plastic pollution.” At the first negotiating session, held later that year in Uruguay, the self-described High Ambition Coalition, which includes the members of the European Union as well as Ghana and Switzerland, insisted that the treaty include mandatory measures that apply to all countries. This idea was opposed by major oil-producing nations, including the U.S., which has called for a “country-driven” approach. According to the environmental group Greenpeace, lobbyists for the “major fossil fuel companies were out in force” at the session.There are also practical hurdles. Precisely because plastic is now ubiquitous, it’s difficult to imagine how to replace all of it, or even much of it. Even in cases where substitutes are available, it’s not always clear that they’re preferable. Franklin-Wallis cites a 2018 study by the Danish Environmental Protection Agency which analyzed how different kinds of shopping bags compare in terms of life-cycle impacts. The study found that, to have a lower environmental impact than a plastic bag, a paper bag would have to be used forty-three times and a cotton tote would have to be used an astonishing seventy-one hundred times. “How many of those bags will last that long?” Franklin-Wallis asks. Walker-Franklin and Jambeck also note that exchanging plastic for other materials may involve “tradeoffs,” including “energy and water use and carbon emissions.” When Schaub’s supermarket stopped handing out plastic shopping bags, it may have reduced one problem only to exacerbate others—deforestation, say, or pesticide use.“In the grand scheme of human existence, it wasn’t that long ago that we got along just fine without plastic,” Simon points out. This is true. It also wasn’t all that long ago that we got along just fine without Coca-Cola or packaged guacamole or six-ounce bottles of water or takeout everything. To make a significant dent in plastic waste—and certainly to “end plastic pollution”—will probably require not just substitution but elimination. If much of contemporary life is wrapped up in plastic, and the result of this is that we are poisoning our kids, ourselves, and our ecosystems, then contemporary life may need to be rethought. The question is what matters to us, and whether we’re willing to ask ourselves that question. ♦",
    "summary": "- Plastics are causing serious pollution and health risks due to their widespread use and improper disposal.\n- Microplastics, tiny pieces of plastic, are particularly concerning as they can release toxic chemicals and attract harmful substances.\n- Addressing the plastic pollution crisis requires reducing plastic production and consumption, as well as implementing systemic changes and global cooperation.",
    "hn_title": "Plastics are poisoning us",
    "original_title": "Plastics are poisoning us",
    "score": 415,
    "hn_content": "- The word 'Plastic' needs to be more specific about the type of plastic being discussed, such as Teflon, PLA, ABS, etc.\n- Better labeling of plastic products could help consumers track potential problems and make informed choices.\n- Some labeling is informative and useful, while others are just a way for corporations to shift blame onto consumers.\n- Brand names were introduced to combat product adulteration, but it's important to ensure that they actually deliver on their promises.\n- Many recycling labels are misleading, and only a small percentage of plastics are actually recycled.\n- The problem of plastic waste is further exacerbated by the export of plastics to other countries and the dumping of plastic waste in the ocean.\n- Target is an example of a company that has implemented useful labels to inform consumers about the safety and environmental impact of their products.\n- Teflon cookware contains a substance known as Polytetrafluoroethylene (PTFE), which can release harmful gases when overheated.\n- PLA (polylactic acid) is a biocompatible material used in medical implants and can be broken down into lactic acid, which the body can safely metabolize.\n- The impact of plastics on human health and the environment is a complex issue that requires further research and regulation.\n- Personal lifestyle choices, such as reducing single-use plastics and supporting sustainable practices, can contribute to mitigating the negative effects of plastic pollution.- Collecting rainwater and using less water can help reduce environmental impact.\n- Walking and using non-motorized transportation options is a more minimalistic and environmentally friendly choice.\n- Choosing durable shoes and clothing can help reduce waste.\n- Using composting toilets and finding alternatives for water and sewer usage can save money and resources.\n- Drinking tap water or using a copper water bottle can be a more sustainable choice than buying bottled water.\n- Eating a plant-based diet and reducing meat consumption can reduce the environmental impact of food production.\n- Living in smaller, more walkable spaces can reduce the overall energy and resource consumption.\n- Donating to sensible causes and participating in political activism can have a larger impact than individual lifestyle choices.\n- Using secondhand items and buying less can reduce waste and promote a circular economy.\n- Considering the environmental impact of pet ownership and family size can be part of a more sustainable lifestyle.",
    "hn_summary": "- Better labeling of plastic products could help consumers make informed choices and track potential problems.\n- The problem of plastic waste is worsened by the export of plastics and dumping in the ocean.\n- Personal lifestyle choices, such as reducing single-use plastics and supporting sustainable practices, can mitigate the negative effects of plastic pollution."
  },
  {
    "id": 36508811,
    "timestamp": 1687969705,
    "title": "Type-safe, K-sortable, globally unique identifier inspired by Stripe IDs",
    "url": "https://github.com/jetpack-io/typeid",
    "hn_url": "http://news.ycombinator.com/item?id=36508811",
    "content": "TypeIDA type-safe, K-sortable, globally unique identifier inspired by Stripe IDsWhat is it?TypeIDs are a modern, type-safe extension of UUIDv7. Inspired by a similar use of prefixes in Stripe's APIs.TypeIDs are canonically encoded as lowercase strings consisting of three parts:A type prefix (at most 63 characters in all lowercase ASCII [a-z])An underscore '_' separatorA 128-bit UUIDv7 encoded as a 26-character string in base32 (using Crockford's alphabet in lowercase).Here's an example of a TypeID of type user: user_2x4y6z8a0b1c2d3e4f5g6h7j8k └──┘ └────────────────────────┘ type  uuid suffix (base32)BenefitsType-safe: you can't accidentally use a user ID where a post ID is expected. When debugging, you can immediately understand what type of entity a TypeID refers to thanks to the type prefix.Compatible with UUIDs: TypeIDs are a superset of UUIDs. They are based on the upcoming UUIDv7 standard. If you decode the TypeID and remove the type information, you get a valid UUIDv7.K-Sortable: TypeIDs are K-sortable and can be used as the primary key in a database while ensuring good locality. Compare to entirely random global ids, like UUIDv4, that generally suffer from poor database locality.Thoughtful encoding: the base32 encoding is URL safe, case-insensitive, avoids ambiguous characters, can be selected for copy-pasting by double-clicking, and is a more compact encoding than the traditional hex encoding used by UUIDs (26 characters vs 36 characters).ImplementationsLanguage StatusGo ✓ ImplementedPython ... Coming SoonRust ... Coming SoonSQL ✓ ImplementedTypeScript ... Coming SoonWe are looking for community contributions to implement TypeIDs in other languages.Command-line ToolThis repo includes a command-line tool for generating TypeIDs. To install it, run:curl -fsSL https://get.jetpack.io/typeid | bashTo generate a new TypeID, run:$ typeid new prefixprefix_01h2xcejqtf2nbrexx3vqjhp41To decode an existing TypeID into a UUID run:$ typeid decode prefix_01h2xcejqtf2nbrexx3vqjhp41type: prefixuuid: 0188bac7-4afa-78aa-bc3b-bd1eef28d881And to encode an existing UUID into a TypeID run:$ typeid encode prefix 0188bac7-4afa-78aa-bc3b-bd1eef28d881prefix_01h2xcejqtf2nbrexx3vqjhp41Related WorkUUIDv7 - The upcoming UUID standard that TypeIDs are based on.Alternatives to UUIDv7 that are also worth considering (but not type-safe like TypeIDs):xidulidksuid",
    "summary": "- TypeIDs are a type-safe, K-sortable, globally unique identifier inspired by Stripe IDs.\n- They are an extension of UUIDv7 and include a type prefix and a 128-bit UUIDv7 encoded in base32.\n- TypeIDs have benefits such as type safety, compatibility with UUIDs, K-sortability, and thoughtful encoding.",
    "hn_title": "Type-safe, K-sortable, globally unique identifier inspired by Stripe IDs",
    "original_title": "Type-safe, K-sortable, globally unique identifier inspired by Stripe IDs",
    "score": 377,
    "hn_content": "- There is a new type-safe, K-sortable globally unique identifier called \"TypeID\"\n- It includes a prefix string that represents the type of the identifier (e.g., \"user\", \"post\")\n- TypeID provides a concise and standardized way to generate and manage unique IDs in software systems\n- The prefix string helps ensure that the correct type of ID is used in different contexts\n- It allows for easy navigation and identification of data within a system\n- The inclusion of the prefix string makes the IDs easily copy-pasteable by double-clicking\n- The TypeID libraries support validation and manipulation of the IDs in different programming languages\n- The Go implementation of TypeID has no tests, but the author plans to add more extensive testing\n- There are- The discussion revolves around identifying and sorting database entries.\n- UUIDv4 suffers from poor database locality due to randomly sorted bytes.\n- Counter-based indexing is a solution, but it becomes problematic in distributed databases with parallel insertions.\n- UUIDv7 combines a counter (Unix time) with a randomly-generated number to maintain sort order while allowing for distinct entries.\n- Sorting random IDs can eliminate the need for additional indexes for scanning.\n- TypeID is based on UUIDv7 and offers type safety and more compact string encoding compared to raw UUIDv7.\n- Some consider leaking information in identifiers to be a concern, while others do not see it as significant.\n- The use case and requirements determine the appropriateness of using a prefix in identifiers.\n- The idea of DB frameworks automatically generating identifiers based on code type names raises concern about leaking internal system architecture information.",
    "hn_summary": "- There is a new type-safe, K-sortable globally unique identifier called \"TypeID\" that provides a standardized way to generate and manage unique IDs in software systems.\n- The inclusion of a prefix string helps ensure the correct type of ID is used in different contexts, allows for easy navigation and identification of data within a system, and makes the IDs easily copy-pasteable.\n- TypeID is based on UUIDv7 and offers type safety and more compact string encoding compared to raw UUIDv7, making it a potential solution for sorting and identifying database entries without the need for additional indexes."
  },
  {
    "id": 36505859,
    "timestamp": 1687957627,
    "title": "Show HN: Open-source background removal in the browser",
    "url": "https://github.com/imgly/background-removal-js",
    "hn_url": "http://news.ycombinator.com/item?id=36505859",
    "content": "Background Removal in the BrowserRemove backgrounds from images directly in the browser environment with ease and no additional costs or privacy concerns. Explore an interactive demo.Overview@imgly/background-removal is a powerful npm package that allows developers to seamlessly remove the background from images directly in the browser. With its unique features and capabilities, this package offers an innovative and cost-effective solution for background removal tasks without compromising data privacy.The key features of @imgly/background-removal are:In-Browser Background Removal: Our one-of-a-kind solution performs the entire background removal process directly in the user's browser, eliminating the need for additional server costs. By leveraging the computing power of the local device, users can enjoy a fast and efficient background removal process.Data Protection: As @imgly/background-removal runs entirely in the browser, users can have peace of mind knowing that their images and sensitive information remain secure within their own devices. With no data transfers to external servers, data privacy concerns are effectively mitigated.Seamless Integration with IMG.LY's CE.SDK: @imgly/background-removal provides seamless integration with IMG.LY's CE.SDK, allowing developers to easily incorporate powerful in-browser image matting and background removal capabilities into their projects.The Neural Network (ONNX model) and WASM files used by @imgly/background-removal are hosted on UNPKG, making it readily available for download to all users of the library. See the section Custom Asset Serving if you want to host data on your own servers.InstallationYou can install @imgly/background-removal via npm or yarn. Use the following commands to install the package:NPMnpm install @imgly/background-removalUsageimport imglyRemoveBackground from \"@imgly/background-removal\"let image_src: ImageData | ArrayBuffer | Uint8Array | Blob | URL | string = ...;imglyRemoveBackground(image_src).then((blob: Blob) => { // The result is a blob encoded as PNG. It can be converted to an URL to be used as HTMLImage.src const url = URL.createObjectURL(blob);})Note: On the first run the wasm and onnx model files are fetched. This might, depending on the bandwidth, take time. Therefore, the first run takes proportionally longer than each consecutive run. Also, all files are cached by the browser and an additional model cache.Advanced ConfigurationThe library does not need any configuration to get started. However, there are optional parameters that influence the behaviour and give more control over the library.type Config = { publicPath: string; // The public path used for model and wasm files debug: bool; // enable or disable useful console.log outputs proxyToWorker: bool; // Whether to proxy the calculations to a web worker. (Default true) model: 'small' | 'medium'; // The model to use. (Default \"medium\")};Download Size vs QualityThe onnx model is shipped in various sizes and needs.small (~40 MB) is the smallest model and is in most cases working fine but sometimes shows some artifacts. It's a quantized model.medium (~80MB) is the default model.Download Progress MonitoringOn the first run, the necessary data will be fetched and stored in the browser cache. Since the download might take some time, you have the option to tap into the download progress.let config: Config = { progress: (key, current, total) => {  console.log(`Downloading ${key}: ${(current} of ${total}`); }}PerformanceThe performance is largely dependent on the feature set available. Most prominently, ensure that SharedArrayBuffer is available MDN. Due to the security requirements of SharedArrayBuffer two headers need to be set to cross-origin isolate your site:'Cross-Origin-Opener-Policy': 'same-origin','Cross-Origin-Embedder-Policy': 'require-corp'Custom Asset ServingCurrently, the wasm and onnx neural networks are served via unpkg. For production use, we advise you to host them yourself. Therefore, copy all .wasm and .onnx files to your public path $PUBLIC_PATH and reconfigure the library.cp node_modules/@imgly/background-removal/dist/*.wasm $PUBLIC_PATHcp node_modules/@imgly/background-removal/dist/*.onnx $PUBLIC_PATHimport imglyRemoveBackground, {Config} from \"@imgly/background-removal\"const public_path = \"https://example.com/assets/\" ; // the path assets are served fromlet config: Config = { publicPath: public_path, // path to the wasm files};let image_src: ImageData | ArrayBuffer | Uint8Array | Blob | URL | string = ...;imglyRemoveBackground(image_src, config).then((blob: Blob) => { // result is a blob encoded as PNG. // It can be converted to an URL to be used as HTMLImage.src const url = URL.createObjectURL(blob);})Debug OutputsEnable debug outputs and logging to the consolelet config: Config = { debug: true};Cross-Origin Resource Sharing (CORS)If you are running into CORS issues you might want to pass additional parameters to the fetch function vialet config: Config = { fetchArgs: {  mode: 'no-cors' }};fetchArgs are passed as second parameters to the fetch function as described in MDN.Who is it for?@imgly/background-removal is ideal for developers and projects that require efficient and cost-effective background removal directly in the browser. It caters to a wide range of use cases, including but not limited to:E-commerce applications that need to remove backgrounds from product images in real time.Image editing applications that require background removal capabilities for enhancing user experience.Web-based graphic design tools that aim to simplify the creative process with in-browser background removal.Whether you are a professional developer or a hobbyist, @imgly/background-removal empowers you to deliver impressive applications and services with ease.LicenseThe software is free for use under the GPL License. Please contact support@img.ly for questions about other licensing options.Authors & ContributorsThis library is made by IMG.LY shipping the world's premier SDKs for building creative applications. Start your trial of the CreativeEditor SDK, PhotoEditor SDK & VideoEditor SDK.",
    "summary": "- '@imgly/background-removal' is an open-source npm package that allows developers to remove backgrounds from images directly in the browser, without the need for additional server costs.\n- It ensures data privacy because the background removal process runs entirely in the user's browser, eliminating concerns about data transfers to external servers.\n- The package seamlessly integrates with other powerful tools, like IMG.LY's CE.SDK, making it easier for developers to incorporate background removal capabilities into their projects.",
    "hn_title": "Show HN: Open-source background removal in the browser",
    "original_title": "Show HN: Open-source background removal in the browser",
    "score": 361,
    "hn_content": "Hacker News new | past | comments | ask | show | jobs | submit loginShow HN: Open-source background removal in the browser (github.com/imgly)361 points by buss_jan 1 day ago | hide | past | favorite | 33 comments@imgly/background-removal is a powerful javascript library that allows seamlessly background removal of images directly in the browser. With its unique features and capabilities, this package offers an innovative and cost-effective solution for background removal tasks without compromising data privacy.culi 21 hours ago | next [–]Seems to be on par with the other best background remover I've tried.[0] The first one I've come across that's open source and this good. And it works in the browser! This is great, thanks[0] https://www.remove.bg/replyculi 21 hours ago | parent | next [–]After looking into there are actually a ton of these websites out there. This is the first actual open source one I've come across that runs in the browser (using WASM)Non-OS freemium competitors:- https://www.erase.bg/- https://www.remove.bg/- https://pixcleaner.com/- https://removal.ai/- https://bgremover.vanceai.com/- https://www.no-background.coffee/- https://icons8.com/bgremoverreplytoshiyori 19 hours ago | root | parent | next [–]Thank you for this list! Some of them have excellent quality in terms of processing time and output. The reason we shipped this library is that it's now possible to run the background removal on the client, which can save a lot of costs. Especially, if this is not a one off feature, but used frequently by each user / customer. We also believe that client side processing will only get better and even more optimised, so we're happy to kick this race off with the library :)replylazylion2 7 hours ago | root | parent | prev | next [–]https://github.com/Sanster/lama-cleanerreplyjrd79 20 hours ago | root | parent | prev | next [–]Another competitor that has AFAIK the best unit pricing is: https://pixian.aireplyjtriangle 20 hours ago | root | parent | prev | next [–]https://www.photoroom.com is also very good for some things.replyisuleman 20 hours ago | root | parent | next [–]yes good for creating product images but it leaves a watermark in the free version.replyisuleman 20 hours ago | root | parent | prev | next [–]How can you forget Stability Ai's Clipdrop.coreplyiamflimflam1 23 hours ago | prev | next [–]I didn’t realise that the preview app on Mac’s now has background removal built in. But I’ll also be bookmarking this site!replystephenr 21 hours ago | parent | next [–]You can also just right click a file and choose \"Remove background\" from the Actions menu - on iOS this same behaviour is available just by long-press on a photo almost anywhere and drag the resulting foreground-only image, or alternatively hold and then choose \"Copy Subject\".Quite different (arguably better but I guess your use case will determine if it's better or worse) results for some images too, e.g. this image (https://www.southwiltonvet.com/files/HedgehogSouthWiltonVet....). The linked demo removes the hands/arms, macOS retains the hands/arms.On this image (https://media-cldnry.s-nbcnews.com/image/upload/streams/2014...) the linked demo makes the hands fade away like Greg Kinnearreplyelishah 16 hours ago | parent | prev | next [–]Yeah, and as is usually the case, it's not Preview in particular doing it. Preview itself does almost nothing, it's just a wrapper around the standard file handling libraries that everything on the platform uses.So this is just a normal thing you can do in nearly any context that any image is displayed anywhere on macos/ios. Not only no external site required, but not even any particular application required.replyianbicking 10 hours ago | prev | next [–]This was the first time I heard of img.ly and had a little hobby project I was considering where the tools might be a nice fit... but the terms and cost is extremely opaque. Feels a little surprising given how pleasingly usable and straight-forward this open source software is.(I _think_ as long as I'm doing a hobby project I could use the img.ly CE.SDK for free indefinitely...? The only restriction is on \"production\" but what does that mean?)Probably these products don't match what I'm looking for, but it was all a little hard to ingest. That said, background-removal looks very easy to use and probably does fit my needs, so kudos for that. As someone who loves the ease of prototyping 100% in the browser this is also great!replynimrody 21 hours ago | prev | next [–]Unrelated: anything similar for increasing photo resolution? I frequently encounter cases where users upload low resolution images (transferred using Whatsapp or similar) and need to increase the resolution to get something suitable for printing.replyjtriangle 20 hours ago | parent | next [–]There's nothing automated that produces reliably good results with a variety of content currently.I've tried https://bigjpg.com https://imglarger.com https://vanceai.com/image-enlarger/ https://www.upscale.media https://photoaid.com/en/tools/ai-image-enlarger https://waifu2x.org <- specifically for animated stuffGiven the similarity of the results of some of these, I'd guess they're using the same model with some input parameter tweaks.Waifu2x is probably the closest to \"reliable\" if you're looking to enlarge some sort of animated content.replyrand0mx1 19 hours ago | parent | prev | next [–]https://news.ycombinator.com/item?id=32628761replyhackernewds 23 hours ago | prev | next [–]amazing library! I've been using pixian.ai but this is a game changerreplyculi 21 hours ago | prev | next [–]Now if someone can just do this for a WASM AI-powered bitmap to vector conversion library, I'll be setreplytoshiyori 19 hours ago | parent | next [–]Is there already something like that in the markets? As an API?replykekub 16 hours ago | root | parent | next [–]I found this one to be really good: https://vectorizer.ai/replymydriasis 23 hours ago | prev | next [–]That's awesome! I'm bookmarking this for later. This is something I always find myself wanting.replyGelob 10 hours ago | prev | next [–]how can i modify this if i have product images that have white in them but it keeps getting removed as this think its blended in the background?replyibrarmalik 21 hours ago | prev | next [–]Where does the model come from? Hard to trust the license when we have no idea with what data it has been trained.replyiamflimflam1 21 hours ago | prev | next [–]What are the licensing options? Can I use the npm package in a commercial project?replydec0dedab0de 21 hours ago | parent | next [–]It says it's GPL. So yes you can use it in a commercial project as long as it is also GPL. Also, any license that restricts commercial use is neither Open Source as defined by the OSI, nor is it Free Software as defined by the FSF.replypcthrowaway 12 hours ago | root | parent | next [–]IANAL, but I think it'd be OK to use it as long as you're not transpiling/minifying/bundling it in with your code[1].Since it's Typescript, you obviously need to transpile to Javascript and host it somewhere you control for security (your own server is fine, just make sure the GPL license text is embedded). This is your GPL-respecting distribution of the softwareThen in your webpage's index.html or other markup, include a `<script>` tag that links to it.I believe this is all you need to be compliant with GPL.[1]: https://unbiased-coder.com/can-you-use-gpl-in-closed-source/...edit: much more detail in this answer: https://opensource.stackexchange.com/a/4385/10533If there's any doubt, it seems like you'd be safe releasing a GPL-ed service worker which your website calls, as the boundary when calling a service worker is definitely enough for it to be deemed communication between two distinct pieces of software. This might be a bit difficult with a library that removes the background from your webcam thoughreplydec0dedab0de 4 hours ago | root | parent | next [–]I believe those links are talking about exceptions, and the LGPL.Any exception would have to be granted by the copyright holder, and the LGPL is a different license which is designed for allowing libraries to be linked into non GPL code.replyjjohansson 23 hours ago | prev | next [–]Amazing tech, congratulations!replymoffkalast 23 hours ago | prev | next [–]Hmm it works surprisingly well, but it would be practical to have some kind of background area selector to help guide it and a threshold to adjust the removal, since the default setup sometimes messes up ever so slightly in some areas.replyjtriangle 20 hours ago | parent | next [–]The only software I've seen do that is Topazlab's product, which works based on trimapping with some AI edge detection/cleaning thrown in on top of it. Takes some fiddling to get good results, but, easily print quality.replylionkor 17 hours ago | prev | next [–]Is there a similar tool as an android app?replysyuzannah 7 hours ago | prev | next [–]Great addition!replyrevskill 17 hours ago | prev [–]I need watermark removal version.replydathos 17 hours ago | parent [–]You need to pay for artreplyGuidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "- The article introduces an open-source JavaScript library called @imgly/background-removal that allows for seamless background removal of images directly in the browser.\n- Users praise the library for being on par with other popular background removal tools, but it stands out as the first open-source option that works in the browser.\n- Several non-open-source freemium background removal competitors are mentioned, highlighting the unique and cost-effective solution provided by @imgly/background-removal."
  },
  {
    "id": 36513881,
    "timestamp": 1687993286,
    "title": "National Geographic lays off its last remaining staff writers",
    "url": "https://www.washingtonpost.com/media/2023/06/28/national-geographic-staff-writers-laid-off/",
    "hn_url": "http://news.ycombinator.com/item?id=36513881",
    "content": "A bookstore owner in Islamabad shows off a copy of one of National Geographic's most famous covers, featuring Afghan refugee Sharbat Gula in 1984. (B.K. Bangash/AP)Listen4 minShare this articleShareComment1423Like one of the endangered species whose impending extinction it has chronicled, National Geographic magazine has been on a relentlessly downward path, struggling for vibrancy in an increasingly unforgiving ecosystem.On Wednesday, the Washington-based magazine that has surveyed science and the natural world for 135 years reached another difficult passage when it laid off all of its last remaining staff writers.The cutback — the latest in a series under owner Walt Disney Co. — involves some 19 editorial staffers in all, who were notified in April that these terminations were coming. Article assignments will henceforth be contracted out to freelancers or pieced together by editors. The cuts also eliminated the magazine’s small audio department.The layoffs were the second over the past nine months, and the fourth since a series of ownership changes began in 2015. In September, Disney removed six top editors in an extraordinary reorganization of the magazine’s editorial operations.AdvertisementDeparting staffers said Wednesday the magazine has curtailed photo contracts that enabled photographers to spend months in the field producing the publication’s iconic images.In a further cost-cutting move, copies of the famous bright-yellow-bordered print publication will no longer be sold on newsstands in the United States starting next year, the company said in an internal announcement last month.National Geographic writer Craig Welch noted the moment in a tweet on Wednesday: “My new National Geographic just arrived, which includes my latest feature — my 16th, and my last as a senior writer. … I’ve been so lucky. I got to work w/incredible journalists and tell important, global stories. It’s been an honor.”The magazine’s current trajectory has been years in the making, set in motion primarily by the epochal decline of print and ascent of digital news and information. In the light-speed world of digital media, National Geographic has remained an almost artisanal product — a monthly magazine whose photos, graphics and articles were sometimes the result of months of research and reporting.AdvertisementAt its peak in the late 1980s, National Geographic reached 12 million subscribers in the United States, and millions more overseas. Many of its devotees so savored its illumination of other worlds — space, the depths of the ocean, little-seen parts of the planet — that they stacked old issues into piles that cluttered attics and basements.It remains among the most widely read magazines in America, at a time when magazines are no longer widely read. At the end of 2022, it had just under 1.8 million subscribers, according to the authoritative Alliance for Audited Media.National Geographic was launched by Washington’s National Geographic Society, a foundation formed by 33 academics, scientists and would-be adventurers, including Alexander Graham Bell. The magazine was initially sold to the public as a perk for joining the society. It grew into a stand-alone publication slowly but steadily, reaching 1 million subscribers by the 1930s.AdvertisementThe magazine was eventually surpassed for profits and attention by the society’s video operations, including its flagship National Geographic cable channel and Nat Geo Wild, a channel focused on animals. While they produced documentaries equal in quality to the magazine’s rigorous reporting, the channels — managed by Rupert Murdoch’s 21st Century Fox — also aired pseudoscientific entertainment programming about UFOs and reality series like “Sharks vs. Tunas” at odds with the society’s original high-minded vision.The magazine’s place of honor continued to dim through a series of corporate reshufflings that began in 2015 when the Society agreed to form a for-profit partnership with 21st Century Fox, which took majority control in exchange for $725 million. The partnership came under the Disney banner in 2019 as part of a massive $71 billion deal between Fox and Disney.Among those who lost their jobs in the latest layoff was Debra Adams Simmons, who only last September was promoted to vice president of diversity, equity and inclusion at National Geographic Media, the entity that oversees the magazine and website.AdvertisementAt the time, David Miller, executive vice president of National Geographic Media, said the magazine was “realigning key departments to help deepen engagement with our readers while also nurturing existing business models and developing new lines of revenue.”In an email to The Post on Wednesday, National Geographic spokesperson Chris Albert said staffing changes will not affect the company’s plans to continue publishing a monthly magazine “but rather give us more flexibility to tell different stories and meet our audiences where they are across our many platforms.”1423CommentsShareView more",
    "summary": "- National Geographic magazine has laid off all of its remaining staff writers, marking another cutback in a series of layoffs under owner Walt Disney Co. This includes 19 editorial staffers and the elimination of the magazine's small audio department.\n- The magazine will now rely on contracted freelancers and editors to produce content, and it has also curtailed photo contracts that allowed photographers to spend extended periods of time in the field.\n- The decline of print media and the rise of digital news and information have significantly impacted National Geographic's trajectory. Despite being widely read, the magazine's subscriber numbers have dwindled, and it will no longer be sold on newsstands in the United States starting next year.\n\nThe most important thing people should know about this post is that National Geographic magazine has laid off all its remaining staff writers, which reflects the challenges faced by traditional print media in the digital age. This post is special because it highlights the impact of technological advancements on established publications and their struggle for survival. It is also noteworthy that National Geographic, known for its iconic visuals, will no longer be sold on newsstands in the US. This decision reflects the changing landscape of media consumption and the shift towards digital platforms.",
    "hn_title": "National Geographic lays off its last remaining staff writers",
    "original_title": "National Geographic lays off its last remaining staff writers",
    "score": 360,
    "hn_content": "National Geographic has laid off its last remaining staff writers under owner Walt Disney Co., leading to concerns over the future of its journalism.\nThe media landscape is changing rapidly, with traditional print publications struggling to compete with the popularity of streaming platforms and free online content.\nNational Geographic's decline began when its video operations, managed by Rupert Murdoch's 21st Century Fox, began airing reality series and pseudoscientific entertainment programming, deviating from its original high-minded vision.\nThe magazine's peak was in the late 1980s when it had 12 million subscribers in the United States. However, its popularity has declined over the years.\nThe magazine is transitioning to using more freelancers to write articles, rather than employing staff writers, raising concerns about the quality and depth of future content.\nThe decline of legacy media organizations reflects changing consumer habits and the rise of digital platforms, which offer cheaper or free content.- Many people are no longer paying for content and are watching more pulpy stuff.\n- The problem with the media landscape is that people are now the product, even when they pay.\n- Compensation is set by the law of supply and demand, not by equity.\n- The supply of top positions is artificially constrained, but workers should also be able to demand fair compensation.\n- It's hypocritical to complain about the decline of print journalism while not supporting it financially.\n- It's hard to justify paying for a single source unless you are a regular reader.\n- A possible solution is to have a payment aggregator for news that allows users to pay for articles from multiple sources.\n- The dream of a world where all content is available on all platforms is not feasible with the current networking physics and intellectual property enforcement.\n- Micropayments for news have been attempted before and have not been successful.\n- A possible solution is to create a compulsory licensing system for video and news.\n- There are challenges in implementing such a system, including enforcing equal payment for content and pricing when content creators gain popularity.\n- The payment process for online news needs to be simplified and made more seamless to encourage micropayments.\n- People are not willing to pay for small amounts of content because the payment flow is often cumbersome and time-consuming.\n- People are resistant to micropayments because they don't like spending money, even small amounts, for content they consider \"free.\"\n- A microtransaction model for news would need to address issues such as friction in the payment process and standardizing prices.\n- An alternate model is an all-you-can-read aggregated subscription service that allows access to content from multiple news sources.\n- Micropayments may not be the best solution for news articles, as people are hesitant to pay for individual articles.\n- The challenge is finding a balance between access to high-quality journalism and affordable pricing for users.\n- A micro-transactions model for news could benefit content creators by allowing them to monetize their work and incentivize quality journalism.\n- The difficulty lies in designing a payment flow that is user-friendly and efficient, with high levels of security and convenience.\n- People have had many ideas for micro-payment models for news, but the challenge lies in building a standard process that can onboard large news sources and gain user acceptance.\n- Micropayments have been tried in the past, but they have not gained widespread adoption due to various challenges such as payment friction and reluctance to pay for small amounts of content.\n- The viability of micropayments for news depends on the willingness of readers to pay for individual articles and the ability of news organizations to justify the value of their content.\n- Existing systems such as Apple News and Blendle offer alternatives to traditional subscription models, but they have not gained significant traction.\n- The challenge lies in finding a business model that balances user affordability, content quality, and the financial sustainability of news organizations.\n- Users are generally hesitant to pay for individual articles and prefer bundled subscription models.\n- The challenge lies in creating a payment model that benefits both users and content creators, taking into account factors such as quality, access, and affordability.\n- The micro-payments model for news content has been tried before with limited success, but improved user experience and standardized processes could make it more viable.\n- The main issue with micropayments is balancing the cost for readers and the revenue for content creators, while ensuring a seamless and accessible payment process.\n- A potential solution is compulsory licensing, which would allow multiple platforms to offer all content and distribute revenue among content creators.\n- The challenge lies in implementing a system that ensures fair compensation for content creators, prevents exclusivity, and provides flexibility for pricing and revenue distribution.\n- The idea of micropayments for news has been explored in various ways, but the challenge lies in finding a scalable and user-friendly solution that meets the needs of both readers and publishers.\n- Micropayments for news articles have been attempted and faced challenges from an implementation standpoint, as well as user adoption and willingness to pay for individual articles.\n- Finding a sustainable payment aggregator model for news that satisfies both readers and content creators remains a challenge.\n- While micropayments may seem like a logical solution, past attempts have shown that people are not willing to pay for content on a per-article basis.\n- A successful micropayments model for news would require a high level of convenience, ease of use, and a compelling value proposition for users.\n- Balancing the cost of individual articles with reader willingness to pay is a key challenge in implementing a micropayments model for news.\n- The market for micropayments in journalism is still in its early stages, with limited adoption and challenges around payment processing and friction for users.\n- Compulsory licensing could provide a viable solution for news distribution, allowing users to access a variety of content without individual payment and ensuring fair compensation for content creators.\n- Micropayments have been attempted in various forms, but they have yet to gain widespread acceptance due to challenges in implementation and user behavior.\n- A micropayments model may not be the best fit for the news industry, as users are generally reluctant to pay small amounts for individual articles.\n- A bundled subscription model, similar to Apple News+, could be a more viable solution, allowing users to access multiple news sources for a monthly fee.\n- The challenge lies in finding a balance between providing affordable access to high-quality journalism and ensuring fair compensation for content creators.\n- A successful micropayments model for news would require a seamless user experience, an attractive value proposition, and sufficient adoption to create a sustainable revenue stream for content creators.",
    "hn_summary": "- National Geographic has laid off its last remaining staff writers, raising concerns about the future of its journalism.\n- The decline of legacy media organizations reflects changing consumer habits and the rise of digital platforms.\n- The magazine is transitioning to using more freelancers, raising concerns about the quality and depth of future content."
  },
  {
    "id": 36505152,
    "timestamp": 1687953415,
    "title": "Canada plans brain drain of H-1B visa holders, with no-job, no-worries permits",
    "url": "https://www.theregister.com/2023/06/28/canada_tech_talent_h1b_plan/",
    "hn_url": "http://news.ycombinator.com/item?id=36505152",
    "content": "LEGALCanada plans brain drain of H-1B visa holders, with no-job, no-worries work permits59They're vetted, almost acculturated, and will be booted from the US if they lose their gigSimon SharwoodWed 28 Jun 2023 // 02:44 UTCCanada has launched a bid to attract techies working in the USA on the notorious H-1B visa, by offering them the chance to move north.The offer, announced on Wednesday as part of the nation's first ever tech talent strategy, means H-1B visa holders can move to Canada without having a job waiting for them.The H-1B visa is contentious in the USA. Its purpose is to attract skilled people whose talents are in short supply stateside, thus adding flexibility to the economy, but the visa is believed to be widely abused – by employers who use it to find employees willing to work for less than their American peers.But the visa is vey popular in India – one of the main sources of H-1B applicants. Indeed it's so popular that the Biden Administration last week announced moderate reforms to the program during the state visit by Indian prime minster Narendra Modi.The H-1B also made news early in 2023 amid mass layoffs in the tech sector, because visa holders who don't have jobs have just 90 days to leave the Land of the Free.Canada has clearly spotted an opportunity to nab some talent that needs a bolt-hole – and can get that talent safe in the knowledge that its southern neighbor has vetted H-1B holders, and they already have some experience of working in North America.Uncle Sam probes H-1B abuse surge: What do our vultures make of it?Uncle Sam sounds like it may actually do something about rampant visa H-1B fraudGermany to court Indian IT talent – starting with easier visa application processesChina, India face tech brain drain through US universitiesCanada has created 10,000 places for H-1B holders, which must be filled within a year as of July 16. The work permits issued under the program last three years.The talent acquisition plan also includes:STEM-specific categories for the Express Enty program targeting skilled workers;Promotions to attract digital nomads;Visas that make it easier for workers to move to Canada to work at startups other than their own companies;The development of an \"Innovation Stream\" offering five-year work permits for those with skills in certain occupations, or who will work for businesses contributing the Canada's industrial innovation goals.The Great White North is also keen on growing more local talent.Skilled people – especially techies – are in short supply everywhere. Canada's revamped talent acquisition program is therefore not unusual, but is doubtless designed with the hope of giving it an edge.One audience the strategy doesn't explicitly address is Russians. Hundreds of thousands of skilled techies are thought to have fled Russia – either to avoid conscription, or just to seek greener pastures in light of economic sanctions. ®Whitepaper: Top 5 Tips For Navigating Your SASE JourneySimilar topicsCanadaH-1BTech JobsMore like these59 COMMENTSTIP US OFFSend us news",
    "summary": "- Canada is offering tech professionals with H-1B visas in the USA the opportunity to move to Canada without a job waiting for them.\n- The H-1B visa is controversial in the USA and is believed to be widely abused by employers.\n- Canada has created 10,000 places for H-1B visa holders and has implemented various strategies to attract tech talent from around the world.",
    "hn_title": "Canada plans brain drain of H-1B visa holders, with no-job, no-worries permits",
    "original_title": "Canada plans brain drain of H-1B visa holders, with no-job, no-worries permits",
    "score": 352,
    "hn_content": "- Canada is planning a new program to attract H-1B visa holders from the United States\n- The program would offer no-job, no-worries permits to H-1B visa holders who lose their jobs in the US\n- The goal of the program is to benefit Canada's economy by attracting highly skilled immigrants who can contribute to economic growth and pay taxes\n- Some argue that H-1B immigrants are a perfect profit center for government taxes as they typically have higher salaries and contribute more to the economy than native-born workers\n- The program presents an alternative option for H-1B visa holders who may be frustrated with the US immigration system or seeking better opportunities in Canada\n- The program could potentially impact wage levels in Canada and lead to a brain drain in the United States if skilled workers choose to move to Canada\n- There are mixed opinions on the program, with some praising it as a smart move by Canada and others expressing concerns about competition for jobs and potential negative effects on wages in Canada.- Salaries for IT workers in Canada have not seen significant growth and have even remained stagnant over the past decade.\n- One commenter points out that Canada ranks among the top countries in terms of paying software engineers.\n- There is a debate about the impact of immigration on Canadian culture, with arguments made for both diversity and assimilation.\n- The H-1B visa program in the United States is seen as a vetting process for skilled immigrants.\n- It is argued that immigrants bring economic benefits to aging countries with low birth rates.\n- Some commenters express concerns about the potential erosion of democratic values and societal integration.\n- The debate also touches on issues of caste discrimination, religious and cultural preservation, and the impact on native-born populations.\n- The article mentions criticisms of the lack of wage growth, high cost of living, and limited career opportunities for IT workers in Canada.\n- It is suggested that increasing skilled migration may lead to a brain drain as talented workers seek better opportunities elsewhere.\n- The impact of remote work and the potential for international job opportunities are mentioned as factors that may influence migration patterns.\n\nOverall, the article highlights the ongoing discussion about the impact of skilled immigration on wages, culture, and economic growth in Canada. It emphasizes the need for thoughtful policies and considerations regarding the integration of immigrants into the workforce and society.",
    "hn_summary": "- Canada is planning to attract H-1B visa holders from the United States by offering no-job, no-worries permits to those who lose their jobs.\n- The program aims to benefit Canada's economy by attracting highly skilled immigrants who can contribute to economic growth and pay taxes.\n- The program could potentially impact wage levels in Canada and lead to a brain drain from the United States."
  },
  {
    "id": 36500448,
    "timestamp": 1687910483,
    "title": "The damaging results of mandated return to office",
    "url": "https://www.entrepreneur.com/growing-a-business/the-damaging-results-of-the-mandated-return-to-office-is/454043",
    "hn_url": "http://news.ycombinator.com/item?id=36500448",
    "content": "We're Now Finding Out The Damaging Results of The Mandated Return to Office — And It's Worse Than We Thought.Companies knew the mandated return to the office would cause some attrition, however, they were not prepared for the serious problems that would present.BY GLEB TSIPURSKY • JUN 26, 2023ShareOpinions expressed by Entrepreneur contributors are their own.We're now finding out the damaging consequences of the mandated return to office. And it's not a pretty picture.A trio of compelling reports — the Greenhouse Candidate Experience Report, the Federal Reserve's Survey of Household Economics and Decisionmaking (SHED), and Unispace's \"Returning for Good\" report — collectively paint a stark picture of this brewing storm.Unispace finds that nearly half (42%) of companies that mandated office returns witnessed a higher level of employee attrition than they had anticipated. And almost a third (29%) of companies enforcing office returns are struggling with recruitment. Imagine that — nearly half! In other words, they knew it would cause some attrition, but they weren't ready for the serious problems that would result.Perhaps they should have. According to the same Greenhouse report, a staggering 76% of employees stand ready to jump ship if their companies decide to pull the plug on flexible work schedules. Moreover, employees from historically underrepresented groups are 22% more likely to consider other options if flexibility goes out the window.In the SHED survey, the gravity of this situation becomes more evident. The survey equates the displeasure of shifting from a flexible work model to a traditional one to that of experiencing a 2 to 3% pay cut.Related: You Should Let Your Team Decide Their Approach to Hybrid Work. A Behavioral Economist Explains Why and How You Should Do It.The talent hunt: A game of chess with flexibility as the queenIn the game of talent acquisition and retention, flexible work policies have swiftly emerged as the queen on the chessboard — commanding, decisive and game-changing. The Greenhouse, SHED, and Unispace reports — when viewed together — provide compelling evidence to back this assertion.Greenhouse finds that 42% of candidates would outright reject roles that lack flexibility. In turn, the SHED survey affirms that employees who work from home a few days a week greatly treasure the arrangement. It's like enjoying a day at the beach while still being connected to the digital world.Curious about what's luring employees away? The Greenhouse report has cracked the code:Increased compensation (48%)Greater job security (34%)Career advancement opportunities (32%)Better flexible work policies (28%)A more positive company culture (27%)In other words, excluding career-centric factors such as pay, security and promotion, flexible work policies shine brighter than the Vegas Strip in employee desires.Interestingly, Unispace throws another factor into the mix — choice. According to their report, overall, the top feelings employees revealed they felt towards the office were happy (31%), motivated (30%) and excited (27%). However, all three of these feelings decrease for those with mandated office returns (27%, 26% and 22% respectively). This highlights that staff are more open to returning to the office if it is out of choice, rather than forced.Case studies of attrition with the return to officeTake, for example, a regional insurance company with a workforce of around 2000 employees. The company enforced a return to the office policy, causing waves of unrest. It soon became evident that their attrition rates were climbing steadily. It echoed the Greenhouse report's findings: a majority of employees, 76%, would actively seek a new job if flexible work policies were retracted. The underrepresented groups were even more prone to leave, making the situation more daunting.At that point, they called me to help as a hybrid work expert that The New York Times called the \"Office Whisperer.\" We worked on adapting their return-to-office plan, switching it from a top-down mandate to a team-driven approach, focusing on welcoming staff to the office for the sake of collaboration and mentoring. As a result, their attrition rates dropped and the feelings of employees toward the office improved, in line with what the Unispace report suggests.In another case study, a large financial services company began noticing employee turnover despite offering competitive salaries and growth opportunities. Upon running an internal survey, they realized that, aside from better compensation and career advancement opportunities, employees were seeking better flexible work policies. This aligned with the Greenhouse and SHED findings, which ranked flexible work policies as a crucial factor influencing job changes. After consulting with me, they adjusted their policies to be more competitive in offering flexibility.A late-stage SaaS startup decided to embrace this wave of change. They worked with me to introduce flexible work policies, and the result was almost immediate - they noticed a sharp decrease in employee turnover and an uptick in job applications. Their story echoes the collective message from all three reports: companies must adapt to flexible work policies or risk being swept away.Related: Why Empowering Your Hybrid Workers to Co-Create a Winning Return to Office Plan Leads to Longterm GainThe brain factor: How cognitive biases play a roleAs we navigate these shifting landscapes of work, we cannot ignore the human elements at play. Like unseen puppeteers, cognitive biases subtly shape our decisions and perceptions. In the context of flexibility and retention, two cognitive biases come into sharp focus: the status quo bias and anchoring bias.Imagine a thriving tech startup, successfully operating in a hybrid model during the pandemic. As the world normalized, leadership decided to return to pre-pandemic, in-person work arrangements. However, they faced resistance and an unexpected swell of turnover.This situation illustrates the potent influence of the status quo bias. This bias, deeply entrenched in our human psyche, inclines us towards maintaining current states or resisting change. Employees, having tasted the fruits of flexible work, felt averse to relinquishing these newfound freedoms. The Greenhouse report bears testament to this, with 76% of employees open to job hunting if their company rolled back flexible work policies.Consider a large financial institution that enforced a full return to office after the pandemic. Many employees, initially attracted by the brand and pay scale, felt disgruntled. The crux of the problem lies in the anchoring bias, which leads us to heavily rely on the first piece of information offered (the 'anchor') when making decisions.When initially joining the company, the employees were primarily concerned with compensation and job security, the \"anchors\" in their decision-making process. However, once within the fold, the pandemic caused them to shift their focus to work-life balance and flexibility, as confirmed by both the Greenhouse and SHED reports. Unfortunately, the rigid return-to-office policy made these new anchors seem less attainable, resulting in dissatisfaction and an increased propensity to leave.So, as we steer our ships through these tumultuous waters, understanding these cognitive biases can help illuminate our path. Recognizing and accounting for the status quo and anchoring biases can enable us to create a workplace that not only attracts but also retains its employees in this age of flexibility. After all, success in the world of business is as much about understanding people as it is about numbers and strategy.Embracing the wave of changeIf there's one overarching theme resonating from the Greenhouse, SHED, and Unispace reports, it's this: Companies need to embrace the wave of flexible work policies or risk being left adrift. As we set sail into the future of work, flexibility isn't just a passing trend; it's a necessity, the new standard. After all, the key to not just attracting talent, but retaining it, lies in one simple word: flexibility. To ignore it is like trying to run a marathon with one shoe. Possible, perhaps, but far from comfortable or efficient.",
    "summary": "- The mandated return to the office has resulted in higher attrition rates and recruitment struggles for companies.\n- A majority of employees value flexible work policies and are willing to switch jobs if those policies are revoked.\n- Companies that embrace flexible work policies will have a better chance of attracting and retaining talent.",
    "hn_title": "The damaging results of mandated return to office",
    "original_title": "The damaging results of mandated return to office",
    "score": 318,
    "hn_content": "- The post discusses the impact of mandating a return to the office after experiencing the benefits of remote work.\n- Remote work is likened to an upgrade, comparing it to going from a black and white TV to a color one or from dial-up internet to fiber optic.\n- People value the natural desire to work from the place they live rather than commuting to an office every day.\n- The conversation evolves to discuss the historical context of agricultural contracts and the relationship between landowners and tenants.\n- The discussion diverges to compare the relationship between employees and employers in sharecropping and capitalism.\n- The challenges of managing remote teams and the preference for in-office work are discussed.\n- The conversation emphasizes the importance of giving employees a choice and accommodating different preferences.\n- The argument is made that companies should consider co-working spaces or individual office arrangements to provide options for those who prefer not to work from home.\n- The discussion highlights the need for companies and managers to adapt to and understand remote work culture.\n- The importance of open communication, clear guidelines, and structured onboarding processes for remote teams is acknowledged.\n- The potential advantages of remote work, such as access to a global talent pool and increased employee satisfaction, are mentioned.\n- It is acknowledged that not all jobs can be done remotely, but there is a rising trend of remote work in white-collar industries.\n- The post concludes by highlighting the need for new companies and workflows to take advantage of the remote work revolution and the potential impact on cities and communities.- Many people are finding remote work to be more fulfilling and productive than office work.\n- The necessity for in-person collaboration is being challenged, with remote collaboration tools like Zoom and Teams proving to be revolutionary.\n- Remote work allows for a better work-life balance and more time with loved ones.\n- Companies that mandate a return to the office are experiencing higher levels of attrition and struggling with recruitment.\n- Small companies and startups have an advantage over big corporations by offering fully remote positions.\n- The debate over remote work vs. office work is ongoing, with arguments on both sides.\n- Some employees miss the office environment and find it personally fulfilling, while others enjoy the flexibility and freedom of remote work.",
    "hn_summary": "- The post discusses the impact of mandating a return to the office after experiencing the benefits of remote work.\n- Remote work is likened to an upgrade, comparing it to going from a black and white TV to a color one or from dial-up internet to fiber optic.\n- The conversation emphasizes the importance of giving employees a choice and accommodating different preferences."
  },
  {
    "id": 36500935,
    "timestamp": 1687914233,
    "title": "Apple joins opposition to encrypted message app scanning",
    "url": "https://www.bbc.com/news/technology-66028773",
    "hn_url": "http://news.ycombinator.com/item?id=36500935",
    "content": "Apple joins opposition to encrypted message app scanningPublished1 day agoShareIMAGE SOURCE,REUTERSBy Chris VallanceTechnology reporter, BBC NewsApple has criticised powers in the Online Safety Bill that could be used to force encrypted messaging tools like iMessage, WhatsApp and Signal to scan messages for child abuse material.Its intervention comes as 80 organisations and tech experts have written to Technology Minister Chloe Smith urging a rethink on the powers.Apple told the BBC the bill should be amended to protect encryption.The government says companies must prevent child abuse on their platforms.End-to-end encryption (E2EE) stops anyone but the sender and recipient reading the message.Police, the government and some high-profile child protection charities maintain the tech - used in apps such as WhatsApp and Apple's iMessage - prevents law enforcement and the firms themselves from identifying the sharing of child sexual abuse material.But in a statement Apple said: \"End-to-end encryption is a critical capability that protects the privacy of journalists, human rights activists, and diplomats.\"It also helps everyday citizens defend themselves from surveillance, identity theft, fraud, and data breaches. The Online Safety Bill poses a serious threat to this protection, and could put UK citizens at greater risk.\"Apple urges the government to amend the bill to protect strong end-to-end encryption for the benefit of all.\"But the government told the BBC that \"companies should only implement end-to-end encryption if they can simultaneously prevent abhorrent child sexual abuse on their platforms.\"We will continue to work with them to seek solutions to combat the spread of child sexual abuse material while maintaining user privacy.\"The Online Safety Bill, currently going through Parliament, contains powers that could enable communications regulator Ofcom to direct platforms to use accredited technology to scan the contents of messages.The government said these powers would only be used as \"a last resort, and only when stringent privacy safeguards have been met\".Recently Home Office ministers have also been highly critical of Facebook's roll-out of the tech for messaging.IMAGE SOURCE,SOPA IMAGESImage caption,WhatsApp also opposes weakening the privacy of its encrypted appSeveral messaging platforms, including Signal and WhatsApp, have previously told the BBC they will refuse to weaken the privacy of their encrypted messaging systems if directed to do so.Signal said in February that it would \"walk\" from the UK if forced to weaken the privacy of its encrypted messaging app.Apple's statement now means that some of the most widely used encrypted apps oppose this part of the bill.The government argues it is possible to provide technological solutions that mean the contents of encrypted messages can be scanned for child abuse material.The only way of doing that, many tech experts argue, would be to install software that would scan messages on the phone or computer before they are sent, called client-side scanning.This, critics say, would fundamentally undermine the privacy of messages.In 2021 Apple announced plans to scan photographs on people's iPhones for abusive content before they were uploaded to iCloud but these were abandoned after a backlash. It has now clearly signalled its opposition to any measure that weakens the privacy of end-to-end encryption.'Routine scanning'Its announcement comes as the digital civil liberties campaigners The Open Rights Group sent an open letter to minister Chloe Smith.The letter, signed by more than 80 national and international civil society organisations, academics and cyber-experts, says: \"The UK could become the first liberal democracy to require the routine scanning of people's private chat messages, including chats that are secured by end-to-end encryption.\"As over 40 million UK citizens and 2 billion people worldwide rely on these services, this poses a significant risk to the security of digital communication services not only in the UK, but also internationally.\"Element, a British tech company whose products using E2EE are used by government and military clients, has previously told the BBC measures in the bill that are seen to weaken the privacy of encrypted messages would make customers less trustful of security products produced by UK firms.There is a growing expectation, the BBC has learned, that changes may be made to part of the bill which critics say could be used to mandate scanning. These could be included in a package of amendments to be revealed in the coming days.But it is not clear what the detail of those changes might be, or if they will satisfy the concerns of campaigners.Related TopicsEncryptionEnd-to-end encryptionAppleMore on this storyMinister attacks Meta boss over encryption planPublished24 MaySignal to quit UK if law changes on encryptionPublished24 February",
    "summary": "- Apple has joined a growing opposition to powers in the Online Safety Bill that would require encrypted messaging apps like iMessage and WhatsApp to scan messages for child abuse material.\n- The government argues that companies should only implement end-to-end encryption if they can also prevent child abuse on their platforms.\n- Apple and other encrypted messaging platforms argue that weakening encryption would undermine user privacy and put citizens at greater risk.",
    "hn_title": "Apple joins opposition to encrypted message app scanning",
    "original_title": "Apple joins opposition to encrypted message app scanning",
    "score": 309,
    "hn_content": "- Apple has joined opposition to encrypted message app scanning.\n- Some individuals argue that companies should only implement end-to-end encryption if they can prevent child sexual abuse on their platforms.\n- Comparisons have been made to banning locks on private homes due to the potential presence of bad actors.\n- The argument against scanning for CSAM on major messaging platforms is that those seeking to share illegal content could simply move to the next service that is encrypted.\n- Concerns have been raised about the scale of CSAM and the resources allocated to handle each case in a timely manner.\n- Examples of failures in child protection services have been highlighted.\n- The article discusses AI image manipulation and the challenges it poses in determining if an image is real or AI-generated.\n- The discussion touches on the ethics of possessing CSAM and the potential consequences for innocent individuals.\n- Apple previously recommended on-device scanning for CSAM, but has since opposed it.\n- Collaborating with law enforcement to prevent child sexual abuse has emotional weight and societal importance but raises concerns about privacy and government surveillance.\n- There is debate about the effectiveness and potential negative consequences of proposed solutions.- The post discusses the potential implications of the UK's proposed Online Safety Bill, which aims to combat illegal and harmful online content.\n- Some argue that the bill could undermine end-to-end encryption, leading to privacy concerns.\n- The government's goal is to protect children from online harm, but there are concerns about the impact on user privacy and civil liberties.\n- The debate highlights the tension between ensuring online safety and preserving individual rights.\n- It is important to consider the potential consequences and implications of government regulations and their impact on technology and society.",
    "hn_summary": "- Apple has joined the opposition against encrypted message app scanning.\n- The debate revolves around the trade-off between privacy and preventing child sexual abuse, with concerns about the effectiveness and potential negative consequences of proposed solutions.\n- The discussion also touches on the challenges of AI image manipulation, the ethics of possessing CSAM, and the potential implications of government regulations on technology and society."
  },
  {
    "id": 36505876,
    "timestamp": 1687957688,
    "title": "US Congress doubles down on claims of illegal UFO retrieval programs",
    "url": "https://thehill.com/opinion/technology/4067865-congress-doubles-down-on-explosive-claims-of-illegal-ufo-retrieval-programs/",
    "hn_url": "http://news.ycombinator.com/item?id=36505876",
    "content": "OPINION>TECHNOLOGYTHE VIEWS EXPRESSED BY CONTRIBUTORS ARE THEIR OWN AND NOT THE VIEW OF THE HILLCongress doubles down on explosive claims of illegal UFO retrieval programsBY MARIK VON RENNENKAMPFF, OPINION CONTRIBUTOR - 06/27/23 7:30 AM ETSHARETWEETAsked June 26 about allegations of secret UFO retrieval and reverse-engineering programs, Senate Intelligence Committee Vice Chairman Marco Rubio (R-Fla.) made several stunning statements.In an exclusive interview, Rubio told NewsNation Washington correspondent Joe Khalil that multiple individuals with “very high clearances and high positions within our government” “have come forward to share” “first-hand” UFO-related claims “beyond the realm of what [the Senate Intelligence Committee] has ever dealt with.”Rubio’s comments provide context for a bipartisan provision adopted unanimously by the Senate Intelligence Committee, which would immediately halt funding for any secret government or contractor efforts to retrieve and reverse-engineer craft of “non-earth” or “exotic” origin.This extraordinary language added to the Senate version of the Intelligence authorization bill mirrors and adds significant credibility to a whistleblower’s recent, stunning allegations that a clandestine, decades-long effort to recover, analyze and exploit objects of “non-human” origin has been operating illegally without congressional oversight.Additionally, the bill instructs individuals with knowledge of such activities to disclose all relevant information and grants legal immunity if the information is reported appropriately within a defined timeframe. Moreover, nearly 20 pages of the legislation appear to directly address recent events by enhancing a raft of legal protections for whistleblowers while also permitting such individuals to contact Congress directly.Researcher and congressional expert Douglas Johnson first reported on and analyzed the remarkable bill language, which, if it passes the House, could become law this calendar year.Beyond the Senate Intelligence Committee, the powerful investigative body that oversees the nation’s intelligence agencies found the aforementioned whistleblower’s allegations — that secret UFO-related programs are illegally withheld from Congress — to be “credible and urgent.”Moreover, according to two reports, multiple military, intelligence and contractor officials corroborated claims that the U.S. government or private companies possess multiple craft of possible “non-human” origin.Importantly, this intelligence bill is not the first instance of Congress addressing the possible existence of surreptitious UFO retrieval and reverse engineering programs.The 2023 National Defense Authorization Act, signed into law by President Joe Biden last December, established robust whistleblower protections for individuals with knowledge of secret UFO programs engaged in “material retrieval, material analysis, reverse engineering [and] research and development.”But the Senate Intelligence Committee’s legislation goes significantly further than previous laws. If enacted as drafted, the legislation would immediately halt funding for any secret, unreported programs that engage in “analyzing” retrieved UFOs “for the purpose of determining properties, material composition, method of manufacture, origin, characteristics, usage and application, performance, operational modalities, or reverse engineering of such craft or component technology.”At the same time, the legislation would cease funding for any personnel engaged in “capturing, recovering, and securing [UFOs] or pieces and components of such craft.”Funding would also be cut for “the development of propulsion technology, or aerospace craft that uses propulsion technology, systems, or subsystems, that is based on or derived from or inspired by inspection, analysis, or reverse engineering of recovered [UFOs] or materials.”Perhaps more importantly, the bill language prohibits legal prosecution of individuals with knowledge of surreptitious retrieval and reverse engineering of “non-human” craft. To avoid legal jeopardy, such individuals would have two months after passage of the legislation to inform the director of the Pentagon’s new UFO analysis office of the existence of relevant UFO-related information.These individuals would then have six months to turn over “all such material and information,” as well as “a comprehensive list of all non-earth origin or exotic [UFO] material.”Importantly, the Senate Intelligence Committee’s legislation contains a “sense of Congress” provision. Such resolutions typically convey a particular message from either the House or the Senate or, as in this case, from Congress as a whole.The “sense of Congress” is that any illegally hidden craft of “non-earth” or “exotic” origin must be brought out of the shadows for broader scientific and industrial analysis. In particular, the goal of the legislation is to “avoid technology stovepipes” — a reference to the non-sharing of information due to excessive secrecy and compartmentalization — and to integrate any recovered “exotic technology” into the nation’s broader “industrial base.”The “sense of Congress” provision aligns closely with concerns expressed by multiple officials that extraordinary secrecy prevents the robust scientific analysis required to make sense of the advanced, “non-human” craft allegedly retrieved in recent decades.Of note, there are indications that at least one law enforcement entity is engaged in a sweeping investigation of the U.S. government’s handling of UFOs.Freedom of Information Act (FOIA) requests are one of the few pathways through which private citizens can obtain government information on UFOs. Official documents and other data released under FOIA are frequently redacted to prevent the release of classified information. Importantly, each redaction must be grounded in a legal justification for why the relevant information is withheld.Recently, the U.S. government denied in full five FOIA requests encompassing a broad range of UFO-related topics. In a striking departure from previous practice, the government denied the requests on the grounds that release of the information may interfere with “enforcement proceedings” and “law enforcement investigations or prosecutions.”A rebellion at the Federal Reserve — can it avoid the next bank collapse?‘General Armageddon’ may be the key to Putin’s survivalThe application of such novel justifications for withholding government UFO information is circumstantial evidence that a law enforcement entity, such as the Department of Defense Office of Inspector General, is engaged in a broad, and possibly criminal, investigation of the U.S. government’s involvement with UFOs.After all, what government oversight body, explicitly charged with preventing unlawful activities, would fail to initiate a sweeping investigation of extraordinary and seemingly credible allegations of illegality?Marik von Rennenkampff served as an analyst with the U.S. Department of State’s Bureau of International Security and Nonproliferation, as well as an Obama administration appointee at the U.S. Department of Defense.    TAGS CONGRESS DAVID GRUSCH JOE BIDEN MARCO RUBIO PRESIDENT JOE BIDEN UFOSCopyright 2023 Nexstar Media Inc. All rights reserved. This material may not be published, broadcast, rewritten, or redistributed.SHARETWEETAround the WebCalifornia Will Cover Cost to Install Solar in These Zip CodesFINANCE DAILYOnly Weeks Remain to Shield Your Retirement Savings from Biden's Tax PlansGOLDCO.COMCheck Your Blood Glucose Level Right from Your Wrist with This Diabetes Watch!LIBIYIGutter Guards for One-story House: How Much Would It Cost?LEAFFILTER PARTNERA Pair of Reading Glasses That Can Look Far and Near. Smart Zoom!HILIPERTSurgeons In Shock: $140 Invention Rejuvenates Knee CartilageKNEEBLISS.COMMole & Skin Tag Removal Has Never Been Easier (No Surgery)HEALTH PRODUCTS GURU15 Surprising Foods You Should Not Eat at BreakfastHEALTH NATURALDon't Eat These 10 Dinner FoodsHEALTH NATURALA 80-year-old Grandmother Designed a Bra for Women That is Popular All overAAILSAAlways Squirt Dish Soap in Your Bath at Night, Here's WhySOGOODLYPut a Red Cup Under the Toilet Seat, Here's WhySOGOODLYCould This Invention Be the Answer to Chronic Knee Pain?KNEEBLISS.COMPsychiatrist: Many People Don't Know What Depression Really is (Know the Signs)DEPRESSION | SEARCH ADSThese 15 Animals Know How to Have FunVIRALSHARKS.NETPuppy Love! the Most Expensive Dog Breeds, Ranked!VIRALSHARKS.NETThe Best Walking Sandals for Women to Wear All Day Without DiscomfortSURSELLLoad MoreMore Technology NewsSEE ALLTECHNOLOGYThe Federal Trade Commission’s embarrassing antitrust crusadeBY STEPHEN KENT, OPINION CONTRIBUTOR23 HOURS AGOTECHNOLOGYBoeing’s Starliner saga is actually a NASA policy successBY ALEX DUBIN, OPINION CONTRIBUTOR2 DAYS AGOTECHNOLOGYTo control AI, its creators need to make some big changesBY JAMES DEMPSEY, OPINION CONTRIBUTOR3 DAYS AGOTECHNOLOGYOuter space is becoming a minefield of dangers — we need better visibility nowBY ERIC INGRAM, OPINION CONTRIBUTOR1 WEEK AGOVideo/Hill.TVSEE ALL HILL.TVSEE ALL VIDEORISINGRising: June 28, 2023BY THEHILL.COM06/28/23 11:58 AM ETRISINGRising: June 27, 2023BY THEHILL.COM06/27/23 11:20 AM ETRISINGRising: June 26, 2023BY THEHILL.COM06/26/23 11:25 AM ETTop StoriesSEE ALLCOURT BATTLESSupreme Court hands down blow to college affirmative actionBY ZACH SCHONFELD11 MINS AGOHOUSEGOP divided on first impeachment targetBY REBECCA BEITSCH AND EMILY BROOKS4 HOURS AGOMORNING REPORTThe Hill’s Morning Report — Biden pitches ‘record to run on’BY ALEXIS SIMENDINGER AND KRISTINA KARISCH4 HOURS AGOCOURT BATTLESThe latest Hunter Biden controversy, explainedBY NIALL STANAGE4 HOURS AGOMost PopularChristie bashes DeSantis’s Jan. 6 remarks: ‘Did he have a TV?’ GOP divided on first impeachment targetSupreme Court hands down blow to college affirmative actionStudent debt relief: Which way will the Supreme Court go?The latest Hunter Biden controversy, explainedWill the KGB be the last man standing in Russia?Retirement talk surrounding Thomas, Alito raises stakes for 2024 election Load moreVideoWatch live: White House press briefingVIDEOWatch live: Fed chair Powell testifies on Monetary Policy Report VIDEOWatch live: White House press briefingVIDEOSee all Video",
    "summary": "- Senate Intelligence Committee Vice Chairman Marco Rubio has stated that individuals with high clearances and positions in the US government have come forward with first-hand claims of UFO-related activities beyond what the committee has dealt with before.\n- The Senate Intelligence Committee has adopted a provision in an intelligence authorization bill that would halt funding for any secret government efforts to retrieve and reverse-engineer craft of non-earth or exotic origin. The legislation also grants legal immunity to individuals who disclose relevant information within a defined timeframe.\n- This legislation goes further than previous laws and aims to bring illegal UFO-related programs out of the shadows for scientific and industrial analysis, while also enhancing legal protections for whistleblowers.",
    "hn_title": "US Congress doubles down on claims of illegal UFO retrieval programs",
    "original_title": "US Congress doubles down on claims of illegal UFO retrieval programs",
    "score": 300,
    "hn_content": "- The US Congress is investigating claims of illegal UFO retrieval programs.\n- Leslie Kean and David Grusch made claims about non-human origin technology, but their sources lack firsthand knowledge and include proponents of questionable theories.\n- The \"Gimball Video\" has been cited but has not been conclusively discredited.\n- Congress is taking action based on mounting evidence for the existence of UFO-related programs.\n- Rubio's involvement in the investigation does not necessarily imply belief in the claims.\n- The bill focuses on Congress' authority to control funding and perform oversight.\n- There is a history of disinformation and deception related to UFO phenomena.\n- The topic generates widespread interest and discussion, but skepticism is warranted.\n- The existence of extraterrestrial life is a possibility, but extraordinary claims require extraordinary evidence.\n- Finding evidence of intelligent extraterrestrial life would be a significant scientific discovery.\n- Critiques of the claims and evidence should be evaluated based on the expertise and credibility of the sources.- There is ongoing speculation and debate about the existence of extraterrestrial life and whether intelligent, technological civilizations exist beyond Earth.\n- Detecting intelligent non-technological life is likely impossible without actually visiting such a planet, and the development of technological civilizations is uncertain.\n- The recent discussions about unidentified aerial phenomena (UAP) and the possibility of extraterrestrial visitation have generated interest and debate among the public and the government.\n- Some believe that the government may be using the UFO narrative as a distraction or to maintain the perception of military and intelligence superiority.\n- There is no clear evidence to support the claim that advanced extraterrestrial technologies are secretly being studied by the government.\n- The existence of advanced alien technology would raise significant questions about its implications, including energy solutions and advancements that could benefit humanity.\n- The government may have incentives to keep such technologies secret, such as maintaining military advantage or avoiding potential chaos and societal upheaval.",
    "hn_summary": "- The US Congress is investigating claims of illegal UFO retrieval programs, based on mounting evidence for the existence of UFO-related programs.\n- The existence of extraterrestrial life is a possibility, but skepticism is warranted and extraordinary claims require extraordinary evidence.\n- The government may have incentives to keep advanced alien technologies secret, such as maintaining military advantage or avoiding potential chaos and societal upheaval."
  }
]
