[
  {
    "id": 37112741,
    "title": "Azure ChatGPT: ChatGPT خاص وآمن للاستخدام الداخلي للمؤسسات",
    "originLink": "https://github.com/microsoft/azurechatgpt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112741",
    "commentBody": "",
    "originSummary": [
      "Azure ChatGPT هو حل مؤسسي من Microsoft يوفر تجربة مستخدم خاصة وآمنة مشابهة ل ChatGPT.",
      "يعطي الحل الأولوية لخصوصية البيانات ويوفر عزل الشبكة وضوابط الأمان على مستوى المؤسسة.",
      "يسمح بالتكامل مع مصادر البيانات والخدمات الداخلية ، ويتم تشجيع المساهمات في المشروع باتباع مدونة قواعد السلوك مفتوحة المصدر الخاصة ب Microsoft."
    ],
    "commentSummary": [
      "Azure ChatGPT هي أداة ChatGPT جديدة خاصة وآمنة مصممة للاستخدام الداخلي للمؤسسات.",
      "يقارن المستخدمون Azure ChatGPT بنماذج أخرى مثل Llama 2 ويناقشون أدائهم وقدراتهم.",
      "تثير المحادثة مخاوف بشأن خصوصية البيانات وسياسات الاحتفاظ بالبيانات والجدارة بالثقة لاستخدام OpenAI و Microsoft Azure.",
      "يتم استكشاف أهمية جودة البيانات وكميتها في أداء النموذج.",
      "يتكهن المستخدمون أيضا بخطط Microsoft لدمج ميزات LLM في Azure و Office365.",
      "تم ذكر تغييرات OpenAI على سياسات استخدام البيانات والاحتفاظ بها ، مع التأكيد على الحاجة إلى إذن صريح لاستخدام البيانات المقدمة من العملاء."
    ],
    "points": 754,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1691951715
  },
  {
    "id": 37112615,
    "title": "يجب أن يكون تنزيل مقطع فيديو \"استخداما عادلا\" مثل تسجيل أغنية من الراديو",
    "originLink": "https://mastodon.social/@HalvarFlake/110883667162838296",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112615",
    "commentBody": "",
    "originSummary": [
      "Mastodon هي شبكة اجتماعية لامركزية مع قاعدة مستخدمين كبيرة من 335,000 مستخدم نشط على خادم mastodon.social الخاص بها.",
      "تستضيف المنصة مناقشات حول شرعية تنزيل مقاطع فيديو YouTube والتأثير المحتمل على حقوق الاستخدام العادل.",
      "يقارن المستخدمون الممارسة التقليدية لتسجيل الأغاني من الراديو على أشرطة الكاسيت ، والتي تعتبر استخداما عادلا ، مع عملية تنزيل وتوزيع مقاطع فيديو خالية من إدارة الحقوق الرقمية ، والتي يعتبرها أصحاب حقوق الطبع والنشر مخاطرة مالية.",
      "تتضمن المحادثة مناقشات حول حماية إدارة الحقوق الرقمية ، وتغيير الوقت ، وقوانين حقوق النشر الألمانية."
    ],
    "commentSummary": [
      "يتعمق المقال في النقاش الدائر حول ما إذا كان تنزيل مقاطع الفيديو من YouTube يشكل استخداما عادلا أو انتهاكا لحقوق الطبع والنشر.",
      "ويسلط الضوء على دور جمعية صناعة التسجيلات الأمريكية (RIAA) في إنفاذ قوانين حق المؤلف.",
      "وتغطي المناقشة موضوعات مثل إدارة الحقوق الرقمية على يوتيوب، والتحايل على حماية النسخ، وفعالية تدابير حماية حقوق النشر، وتفسير قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية، مما يثير مخاوف بشأن القيود والآثار المترتبة على قانون حق المؤلف في مواجهة التقدم التكنولوجي."
    ],
    "points": 615,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1691950963
  },
  {
    "id": 37110628,
    "title": "أداة PDF - تعديل ملفات PDF في المتصفح دون تحميل",
    "originLink": "https://www.pdftool.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37110628",
    "commentBody": "",
    "originSummary": [
      "PDF-Tools هو موقع ويب يقدم تعديلات PDF مجانية وآمنة دون مطالبة المستخدمين بتحميل ملفاتهم.",
      "يستخدم الموقع التكنولوجيا الحديثة ويضمن بقاء البيانات الحساسة على جهاز المستخدم.",
      "يمكن للمستخدمين الوصول إلى أدوات مختلفة مثل التشفير وفك التشفير والتحسين والدمج والتدوير وإزالة صفحات ملفات PDF على موقع الويب. وهي متوفرة بلغات متعددة وتتضمن معلومات قانونية وتراخيص."
    ],
    "commentSummary": [
      "يناقش المستخدمون أداة متصفح تسمى PDF Tool والتي تتيح تعديلات PDF في وضع عدم الاتصال ، لكنهم يعبرون عن مخاوفهم بشأن الوثوق بالأداة وقدراتها في وضع عدم الاتصال.",
      "تستكشف المحادثة الأدوات البديلة لتحرير ملفات PDF وتناقش الأساليب والأدوات المختلفة لتحرير ملفات PDF ومعالجتها.",
      "كما يتم التشكيك في الجدارة بالثقة ومخاطر استخدام WebAssembly في أداة PDF ، مما يسلط الضوء على تحديات التحكم في نشاط الشبكة وتعطيل الوصول إلى الإنترنت."
    ],
    "points": 469,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1691938862
  },
  {
    "id": 37115626,
    "title": "لعبة فيديو حيث تكون نظام تشغيل",
    "originLink": "https://plbrault.com/blog-posts/i-created-the-nerdierst-game-ever-en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37115626",
    "commentBody": "",
    "originSummary": [
      "طور المؤلف لعبة فيديو نردي حيث يتولى اللاعبون دور نظام التشغيل ويجب عليهم إدارة نوى وحدة المعالجة المركزية والعمليات وصفحات الذاكرة ومساحة المبادلة لتجنب إحباط المستخدم.",
      "تتضمن اللعبة عناصر مختلفة مثل العمليات ووحدات المعالجة المركزية وأحداث الإدخال / الإخراج ومستويات صعوبة مختلفة.",
      "في حين أن اللعبة مصممة لإمكانية اللعب بدلا من الواقعية ، إلا أنها يمكن أن تكون بمثابة أداة تعليمية لطلاب علوم الكمبيوتر للتعرف على مبادئ نظام التشغيل.",
      "تم تجميع اللعبة إلى WebAssembly ، مما يسمح بلعبها في متصفحات الويب.",
      "إنه متاح للعب على itch.io ، وشفرة المصدر مفتوحة المصدر على GitHub."
    ],
    "commentSummary": [
      "يستكشف المقال مفهوم لعبة فيديو يأخذ فيه اللاعبون دور نظام التشغيل ويؤدون مهام تشبه إدارة الموارد وتعدد المهام في الحياة الواقعية.",
      "يجذب مفهوم اللعبة مراجعات متباينة ، حيث يجدها البعض مثيرة للاهتمام بينما يشعر البعض الآخر أنها تفتقر إلى المتعة.",
      "يظهر المشاركون في المناقشة حماسا للفكرة ويقدمون اقتراحات لتحسين تجربة اللعب ، وتسليط الضوء على قيمتها التعليمية المحتملة."
    ],
    "points": 415,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1691968891
  },
  {
    "id": 37113307,
    "title": "توكي بونا: لغة عالمية محاولة مع ~ 120 كلمة فقط",
    "originLink": "https://cohost.org/mcc/post/59045-mi-kama-sona-e-toki",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37113307",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربتهم الشخصية في تعلم Toki Pona ، وهي لغة بسيطة.",
      "تتم مناقشة الميزات الفريدة ل Toki Pona ومقارنتها بالإسبرانتو.",
      "يذكر المقطع تحديات تعلم توكي بونا والموارد المتاحة للمتعلمين."
    ],
    "commentSummary": [
      "تركز المناقشة على اللغة المبنية Toki Pona ومدى ملاءمتها كلغة عالمية.",
      "يسلط المشاركون الضوء على بساطة توكي بونا وإمكاناتها للإبداع والتعبير.",
      "ومع ذلك ، تشمل القيود صعوبات في التعبير عن المفاهيم المعقدة والمفردات المحددة ، فضلا عن التحديات في الترجمة الدقيقة."
    ],
    "points": 397,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1691954452
  },
  {
    "id": 37114141,
    "title": "إظهار HN: لقد كتبت RDBMS (استنساخ SQLite) من البداية في Python الخالصة",
    "originLink": "https://github.com/spandanb/learndb-py",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37114141",
    "commentBody": "",
    "originSummary": [
      "أنشأ الكاتب نظام إدارة قواعد البيانات العلائقية (RDBMS) باستخدام Python من البداية ، دون الاعتماد على أي أطر عمل أو مكتبات موجودة مسبقا.",
      "يوضح هذا مهارة الكاتب ومعرفته في كل من برمجة Python ومبادئ إدارة قواعد البيانات.",
      "من المحتمل أن تستغرق عملية التطوير وقتا وجهدا كبيرين ، حيث يتطلب إنشاء RDBMS دون استخدام الأدوات الحالية فهما عميقا لمفاهيم قاعدة البيانات وتنفيذها."
    ],
    "commentSummary": [
      "طور المؤلف LearnDB ، وهو نظام إدارة قواعد بيانات علائقية في Python مبني على SQLite.",
      "يهدف LearnDB إلى تكرار SQLite ويتضمن محلل وتنفيذ B + tree ، مع التركيز على الأغراض التعليمية.",
      "لا يقدم المشروع ميزات متقدمة وهو مخصص للتعلم بدلا من استخدام الإنتاج."
    ],
    "points": 306,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1691958731
  },
  {
    "id": 37113336,
    "title": "القاضي يرفض التماس HP لإسقاط دعوى إغلاق طابعة الكل في واحد",
    "originLink": "https://www.theregister.com/2023/08/11/judge_denies_hps_request_to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37113336",
    "commentBody": "",
    "originSummary": [
      "تم رفض اقتراح HP برفض دعوى قضائية رفعها مالكو طابعات HP All-in-one ، مما سمح بالمضي قدما في القضية.",
      "يجادل المدعون بأن HP عطلت عمدا وظائف عدم الطباعة عندما كانت مستويات الحبر منخفضة ، دون إبلاغ المشترين.",
      "واجهت HP سابقا إجراءات قانونية بشأن مشكلات تأمين الطابعة ، وقامت Canon بتسوية قضية مماثلة في أواخر عام 2021."
    ],
    "commentSummary": [
      "رفض قاض محاولة HP رفض دعوى قضائية تتهمها بممارسات مناهضة للمستهلك تتعلق بطابعاتها الشاملة.",
      "تتناول مناقشة Hacker News فكرة تطوير طابعة مفتوحة المصدر بالكامل وتقيم جودة طابعات الليزر Brother وموثوقيتها.",
      "يحلل المشاركون مزايا وعيوب الطابعات النافثة للحبر وطابعات الليزر لمتطلبات الطباعة المختلفة ويعبرون عن عدم رضاهم عن قضايا مثل الحبر باهظ الثمن وقيود الطابعة والحد الأدنى من الابتكار في الصناعة."
    ],
    "points": 295,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1691954609
  },
  {
    "id": 37111855,
    "title": "حرب النخبة على العمل عن بعد لا علاقة لها بالإنتاجية",
    "originLink": "https://www.okdoomer.io/heres-why-they-want-you-back-at-the-office-so-bad/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37111855",
    "commentBody": "",
    "originSummary": [
      "الدافع وراء العمل عن بعد هو الرغبة في تجنب انهيار العقارات التجارية بدلا من زيادة الإنتاجية.",
      "لقد سلط الوباء الضوء على عيوب البيئات المكتبية التقليدية ، مثل الانحرافات والمهام التي لا معنى لها.",
      "تواجه صناعة العقارات أزمة بسبب شعبية العمل عن بعد ، مع حالات إفلاس محتملة لأصحاب العقارات والمساحات المكتبية الشاغرة."
    ],
    "commentSummary": [
      "تدور المناقشات حول العمل عن بعد ، والعقارات ، والرأسمالية ، والاشتراكية ، والنقابات ، وتأثيراتها على الموظفين والمجتمع.",
      "يجادل البعض بأن الدفع نحو العمل عن بعد مدفوع بزيادة الإنتاجية ، بينما يشير آخرون إلى أنه قد يتأثر بالنخب أو السياسيين الذين يحاولون حماية قيم العقارات.",
      "هناك مناقشات حول تعريفات الرأسمالية والاشتراكية، ودور المديرين، والتحيزات، والتفاعل البشري في مكان العمل، وأهمية النقابات في حماية حقوق العمال."
    ],
    "points": 291,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1691946616
  },
  {
    "id": 37112625,
    "title": "\"ليس لدي ما أخفيه\" وغيرها من سوء فهم الخصوصية (2007)",
    "originLink": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=998565",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112625",
    "commentBody": "",
    "originSummary": [
      "تحلل الورقة البحثية التي أعدها البروفيسور دانيال سولوف حجة \"لا شيء لإخفائه\" المستخدمة في مناقشات الخصوصية والمراقبة.",
      "وتعارض الصحيفة الادعاء بأن الأفراد الذين ليس لديهم ما يخفونه يجب ألا يهتموا بالخصوصية.",
      "يتحدى Solove الاعتقاد بأن الخصوصية مهمة فقط لأولئك المتورطين في أنشطة غير قانونية."
    ],
    "commentSummary": [
      "تتمحور مناقشات المنتدى حول حجة \"ليس لدي ما أخفيه\" فيما يتعلق بالخصوصية والمراقبة.",
      "يناقش المشاركون المراقبة الحكومية وحرية التعبير وعنف الشرطة وانتهاكات الخصوصية والأمثلة التاريخية لإساءة استخدام المعلومات الخاصة.",
      "يتم التأكيد على أهمية حماية المعلومات الشخصية والخصوصية كحق أساسي بسبب المخاطر والعواقب المحتملة لنقص الخصوصية."
    ],
    "points": 287,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1691951009
  },
  {
    "id": 37111317,
    "title": "أدركت اليوم أنني أثق الآن في Microsoft أكثر من Google. ماذا يحدث؟",
    "originLink": "https://old.reddit.com/r/degoogle/comments/15pd5si/today_i_realized_i_now_trust_microsoft_more_than/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37111317",
    "commentBody": "",
    "originSummary": [
      "يناقش المستخدمون على Reddit الثقة المتزايدة في Microsoft مقارنة ب Google ، مشيرين إلى مخاوف بشأن نتائج البحث وقضايا الخصوصية.",
      "يعبر العديد من المستخدمين عن تفضيلهم لمنتجات Microsoft مثل VS Code و GitHub ، مما يسلط الضوء على ثقتهم في هذه الأنظمة الأساسية.",
      "تتم مناقشة الخيارات البديلة للتخزين والبرامج ، مما يشير إلى الرغبة في بدائل خارج أنظمة Microsoft و Google البيئية. تتطرق المحادثة أيضا إلى المخاوف المتعلقة بالقياس عن بعد والخصوصية."
    ],
    "commentSummary": [
      "تركز المناقشة على الثقة والمخاوف المحيطة بشركات التكنولوجيا مثل Microsoft و Google.",
      "يفضل بعض المستخدمين VSCode من Microsoft على Google Chrome ، مشيرين إلى مشكلات الثقة مع Google.",
      "كما تتم مناقشة موضوعات مثل الخصوصية وتتبع البيانات وتحقيق الدخل من بيانات المستخدم والتحكم من قبل شركات التكنولوجيا."
    ],
    "points": 260,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1691943549
  }
]
