[
  {
    "id": 37112741,
    "title": "Azure ChatGPT: आंतरिक एंटरप्राइज़ उपयोग के लिए निजी और सुरक्षित ChatGPT",
    "originLink": "https://github.com/microsoft/azurechatgpt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112741",
    "commentBody": "",
    "originSummary": [
      "Azure ChatGPT Microsoft द्वारा एक एंटरप्राइज़ समाधान है जो ChatGPT के समान एक निजी और सुरक्षित उपयोगकर्ता अनुभव प्रदान करता है।",
      "समाधान डेटा गोपनीयता को प्राथमिकता देता है और नेटवर्क अलगाव और एंटरप्राइज़-ग्रेड सुरक्षा नियंत्रण प्रदान करता है।",
      "यह आंतरिक डेटा स्रोतों और सेवाओं के साथ एकीकरण की अनुमति देता है, और Microsoft के ओपन सोर्स आचार संहिता के बाद परियोजना में योगदान को प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "Azure ChatGPT एक नया निजी और सुरक्षित ChatGPT उपकरण है जो आंतरिक उद्यम उपयोग के लिए डिज़ाइन किया गया है।",
      "उपयोगकर्ता Azure ChatGPT की तुलना लामा 2 जैसे अन्य मॉडलों से करते हैं और उनके प्रदर्शन और क्षमताओं पर चर्चा करते हैं।",
      "वार्तालाप डेटा गोपनीयता, डेटा प्रतिधारण नीतियों, और OpenAI और Microsoft Azure का उपयोग करने की विश्वसनीयता के बारे में चिंताओं को लाता है।",
      "मॉडल प्रदर्शन में डेटा गुणवत्ता और मात्रा के महत्व का पता लगाया जाता है।",
      "उपयोगकर्ता Azure और Office 365 में LLM सुविधाओं को एकीकृत करने के लिए Microsoft की योजनाओं पर भी अटकलें लगाते हैं।",
      "ओपनएआई के डेटा उपयोग और प्रतिधारण नीतियों में परिवर्तनों का उल्लेख किया गया है, जो ग्राहक-सबमिट किए गए डेटा का उपयोग करने के लिए स्पष्ट अनुमति की आवश्यकता पर जोर देता है।"
    ],
    "points": 754,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1691951715
  },
  {
    "id": 37112615,
    "title": "एक वीडियो डाउनलोड करना रेडियो से एक गीत रिकॉर्ड करने के रूप में \"उचित उपयोग\" होना चाहिए।",
    "originLink": "https://mastodon.social/@HalvarFlake/110883667162838296",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112615",
    "commentBody": "",
    "originSummary": [
      "Mastodon एक विकेन्द्रीकृत सामाजिक नेटवर्क है जिसमें अपने mastodon.social सर्वर पर 335,000 सक्रिय उपयोगकर्ताओं का एक बड़ा उपयोगकर्ता आधार है।",
      "मंच यूट्यूब वीडियो डाउनलोड करने की वैधता और उचित उपयोग अधिकारों पर संभावित प्रभाव के बारे में चर्चा की मेजबानी कर रहा है।",
      "उपयोगकर्ता रेडियो से कैसेट टेप पर गाने रिकॉर्ड करने के पारंपरिक अभ्यास की तुलना कर रहे हैं, जिसे उचित उपयोग माना जाता है, डीआरएम-मुक्त वीडियो डाउनलोड करने और वितरित करने के कार्य के साथ, जिसे कॉपीराइट धारक वित्तीय जोखिम के रूप में देखते हैं।",
      "बातचीत में डीआरएम संरक्षण, समय-स्थानांतरण और जर्मन कॉपीराइट कानूनों पर बहस शामिल है।"
    ],
    "commentSummary": [
      "लेख इस बात पर चल रही बहस में शामिल है कि क्या YouTube से वीडियो डाउनलोड करना उचित उपयोग या कॉपीराइट उल्लंघन है।",
      "यह कॉपीराइट कानूनों को लागू करने में रिकॉर्डिंग इंडस्ट्री एसोसिएशन ऑफ अमेरिका (आरआईएए) की भूमिका पर प्रकाश डालता है।",
      "चर्चा में यूट्यूब पर डीआरएम, कॉपी सुरक्षा दरवाजे, कॉपीराइट संरक्षण उपायों की प्रभावशीलता और डीएमसीए की व्याख्या जैसे विषयों को शामिल किया गया है, जो तकनीकी प्रगति के सामने कॉपीराइट कानून की सीमाओं और निहितार्थों के बारे में चिंताओं को बढ़ाता है।"
    ],
    "points": 615,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1691950963
  },
  {
    "id": 37110628,
    "title": "पीडीएफ उपकरण - अपलोड किए बिना ब्राउज़र में पीडीएफ को संशोधित करें",
    "originLink": "https://www.pdftool.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37110628",
    "commentBody": "",
    "originSummary": [
      "पीडीएफ-टूल्स एक वेबसाइट है जो उपयोगकर्ताओं को अपनी फ़ाइलों को अपलोड करने की आवश्यकता के बिना मुफ्त और सुरक्षित पीडीएफ संशोधन प्रदान करती है।",
      "वेबसाइट आधुनिक तकनीक का उपयोग करती है और यह सुनिश्चित करती है कि संवेदनशील डेटा उपयोगकर्ता के डिवाइस पर बना रहे।",
      "उपयोगकर्ता वेबसाइट पर एन्क्रिप्शन, डिक्रिप्शन, ऑप्टिमाइज़ेशन, विलय, रोटेशन और पीडीएफ के पेज हटाने जैसे विभिन्न उपकरणों तक पहुंच सकते हैं। यह कई भाषाओं में उपलब्ध है और इसमें कानूनी जानकारी और लाइसेंस शामिल हैं।"
    ],
    "commentSummary": [
      "उपयोगकर्ता पीडीएफ टूल नामक एक ब्राउज़र टूल पर चर्चा कर रहे हैं जो ऑफ़लाइन पीडीएफ संशोधनों को सक्षम करता है, लेकिन टूल और इसकी ऑफ़लाइन क्षमताओं पर भरोसा करने के बारे में चिंता व्यक्त करता है।",
      "वार्तालाप पीडीएफ को संपादित करने के लिए वैकल्पिक उपकरणों की पड़ताल करता है और पीडीएफ फाइलों को संपादित करने और हेरफेर करने के लिए विभिन्न तरीकों और उपकरणों पर चर्चा करता है।",
      "एक पीडीएफ टूल में वेबअसेंबली का उपयोग करने की विश्वसनीयता और जोखिमों पर भी सवाल उठाया जाता है, जो नेटवर्क गतिविधि को नियंत्रित करने और इंटरनेट एक्सेस को अक्षम करने की चुनौतियों को उजागर करता है।"
    ],
    "points": 469,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1691938862
  },
  {
    "id": 37115626,
    "title": "एक वीडियो गेम जहां आप एक ऑपरेटिंग सिस्टम हैं",
    "originLink": "https://plbrault.com/blog-posts/i-created-the-nerdierst-game-ever-en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37115626",
    "commentBody": "",
    "originSummary": [
      "लेखक ने एक अजीब वीडियो गेम विकसित किया है जहां खिलाड़ी एक ऑपरेटिंग सिस्टम की भूमिका निभाते हैं और उपयोगकर्ता को निराश करने से बचने के लिए सीपीयू कोर, प्रक्रियाओं, मेमोरी पृष्ठों और स्वैप स्पेस का प्रबंधन करना चाहिए।",
      "खेल में प्रक्रियाओं, सीपीयू, आई / ओ घटनाओं और विभिन्न कठिनाई स्तरों जैसे विभिन्न तत्व शामिल हैं।",
      "जबकि खेल यथार्थवाद के बजाय खेलने के लिए डिज़ाइन किया गया है, यह कंप्यूटर विज्ञान के छात्रों के लिए ऑपरेटिंग सिस्टम सिद्धांतों के बारे में जानने के लिए एक शैक्षिक उपकरण के रूप में भी काम कर सकता है।",
      "गेम को वेबअसेंबली में संकलित किया गया है, जिससे इसे वेब ब्राउज़र में खेला जा सकता है।",
      "यह itch.io पर खेलने के लिए उपलब्ध है, और स्रोत कोड GitHub पर खुला स्रोत है।"
    ],
    "commentSummary": [
      "लेख एक वीडियो गेम अवधारणा की पड़ताल करता है जिसमें खिलाड़ी एक ऑपरेटिंग सिस्टम की भूमिका निभाते हैं और वास्तविक जीवन में संसाधनों के प्रबंधन और मल्टीटास्किंग जैसे कार्य करते हैं।",
      "खेल की अवधारणा मिश्रित समीक्षा आकर्षित करती है, कुछ को यह पेचीदा लगता है जबकि अन्य को लगता है कि इसमें आनंद की कमी है।",
      "चर्चा में भाग लेने वाले लोग विचार के लिए उत्साह दिखाते हैं और गेमप्ले अनुभव को बेहतर बनाने के लिए सुझाव प्रदान करते हैं, इसके संभावित शैक्षिक मूल्य पर प्रकाश डालते हैं।"
    ],
    "points": 415,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1691968891
  },
  {
    "id": 37113307,
    "title": "टोकी पोना: केवल ~ 120 शब्दों के साथ एक सार्वभौमिक भाषा का प्रयास",
    "originLink": "https://cohost.org/mcc/post/59045-mi-kama-sona-e-toki",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37113307",
    "commentBody": "",
    "originSummary": [
      "लेखक ने टोकी पोना सीखने के अपने व्यक्तिगत अनुभव को साझा किया, जो एक न्यूनतम भाषा है।",
      "टोकी पोना की अनूठी विशेषताओं पर चर्चा की जाती है और एस्पेरांतो की तुलना की जाती है।",
      "गद्यांश में टोकी पोना सीखने की चुनौतियों और शिक्षार्थियों के लिए उपलब्ध संसाधनों का उल्लेख किया गया है।"
    ],
    "commentSummary": [
      "चर्चा निर्मित भाषा टोकी पोना और एक सार्वभौमिक भाषा के रूप में इसकी उपयुक्तता पर केंद्रित है।",
      "प्रतिभागियों ने टोकी पोना की सादगी और रचनात्मकता और अभिव्यक्ति के लिए इसकी क्षमता पर प्रकाश डाला।",
      "हालांकि, सीमाओं में जटिल अवधारणाओं और विशिष्ट शब्दावली को व्यक्त करने में कठिनाइयों के साथ-साथ सटीक अनुवाद में चुनौतियां शामिल हैं।"
    ],
    "points": 397,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1691954452
  },
  {
    "id": 37114141,
    "title": "एचएन दिखाएं: मैंने शुद्ध पायथन में खरोंच से एक आरडीबीएमएस (एसक्यूलाइट क्लोन) लिखा था।",
    "originLink": "https://github.com/spandanb/learndb-py",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37114141",
    "commentBody": "",
    "originSummary": [
      "लेखक ने किसी भी पहले से मौजूद ढांचे या पुस्तकालयों पर भरोसा किए बिना, स्क्रैच से पायथन का उपयोग करके एक रिलेशनल डेटाबेस मैनेजमेंट सिस्टम (आरडीबीएमएस) बनाया।",
      "यह पायथन प्रोग्रामिंग और डेटाबेस प्रबंधन सिद्धांतों दोनों में लेखक के कौशल और ज्ञान को प्रदर्शित करता है।",
      "विकास प्रक्रिया में संभवतः महत्वपूर्ण समय और प्रयास शामिल थे, क्योंकि मौजूदा उपकरणों का उपयोग किए बिना आरडीबीएमएस बनाने के लिए डेटाबेस अवधारणाओं और कार्यान्वयन की गहरी समझ की आवश्यकता होती है।"
    ],
    "commentSummary": [
      "लेखक ने लर्नडीबी विकसित किया है, पायथन में एक रिलेशनल डेटाबेस प्रबंधन प्रणाली जो एसक्यूलाइट पर बनाई गई है।",
      "LearnDB का उद्देश्य SQLite को दोहराना है और इसमें शैक्षिक उद्देश्यों पर ध्यान केंद्रित करते हुए एक पार्सर और एक बी + ट्री कार्यान्वयन शामिल है।",
      "परियोजना उन्नत सुविधाओं की पेशकश नहीं करती है और उत्पादन उपयोग के बजाय सीखने के लिए अभिप्रेत है।"
    ],
    "points": 306,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1691958731
  },
  {
    "id": 37113336,
    "title": "जज ने ऑल-इन-वन प्रिंटर लॉकडाउन मुकदमे को खारिज करने की एचपी की याचिका खारिज की",
    "originLink": "https://www.theregister.com/2023/08/11/judge_denies_hps_request_to/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37113336",
    "commentBody": "",
    "originSummary": [
      "एचपी ऑल-इन-वन प्रिंटर के मालिकों द्वारा दायर मुकदमे को खारिज करने के एचपी के प्रस्ताव को अस्वीकार कर दिया गया है, जिससे मामले को आगे बढ़ने की अनुमति मिल गई है।",
      "वादी का तर्क है कि एचपी ने जानबूझकर गैर-मुद्रण कार्यों को अक्षम कर दिया जब स्याही का स्तर कम था, खरीदारों को सूचित किए बिना।",
      "एचपी को पहले प्रिंटर लॉकडाउन के मुद्दों पर कानूनी कार्रवाई का सामना करना पड़ा था, और कैनन ने 2021 के अंत में इसी तरह के मामले का निपटारा किया था।"
    ],
    "commentSummary": [
      "एक न्यायाधीश ने एचपी के उस मुकदमे को खारिज करने के प्रयास को खारिज कर दिया है, जिसमें उन पर अपने ऑल-इन-वन प्रिंटर से संबंधित उपभोक्ता विरोधी प्रथाओं का आरोप लगाया गया था।",
      "हैकर न्यूज चर्चा एक पूरी तरह से ओपन सोर्स प्रिंटर विकसित करने के विचार पर विचार करती है और ब्रदर लेजर प्रिंटर की गुणवत्ता और निर्भरता का मूल्यांकन करती है।",
      "प्रतिभागी विभिन्न मुद्रण आवश्यकताओं के लिए इंकजेट प्रिंटर और लेजर प्रिंटर के फायदे और नुकसान का विश्लेषण करते हैं और महंगी स्याही, प्रिंटर प्रतिबंध और न्यूनतम उद्योग नवाचार जैसे मुद्दों पर असंतोष व्यक्त करते हैं।"
    ],
    "points": 295,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1691954609
  },
  {
    "id": 37111855,
    "title": "दूरस्थ कार्य पर अभिजात वर्ग के युद्ध का उत्पादकता से कोई लेना-देना नहीं है।",
    "originLink": "https://www.okdoomer.io/heres-why-they-want-you-back-at-the-office-so-bad/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37111855",
    "commentBody": "",
    "originSummary": [
      "दूरस्थ काम के लिए धक्का उत्पादकता बढ़ाने के बजाय वाणिज्यिक अचल संपत्ति दुर्घटना से बचने की इच्छा से प्रेरित है।",
      "महामारी ने पारंपरिक कार्यालय वातावरण की खामियों को उजागर किया है, जैसे कि विकर्षण और अर्थहीन कार्य।",
      "रियल एस्टेट उद्योग रिमोट वर्क की लोकप्रियता के कारण संकट का सामना कर रहा है, जिसमें मकान मालिकों और खाली कार्यालय स्थानों के लिए संभावित दिवालियापन है।"
    ],
    "commentSummary": [
      "चर्चाएं दूरस्थ कार्य, अचल संपत्ति, पूंजीवाद, समाजवाद, यूनियनों और कर्मचारियों और समाज पर उनके प्रभावों के आसपास घूमती हैं।",
      "कुछ का तर्क है कि दूरस्थ काम के लिए धक्का उत्पादकता में वृद्धि से प्रेरित है, जबकि अन्य का सुझाव है कि यह अभिजात वर्ग या राजनेताओं से प्रभावित हो सकता है जो अचल संपत्ति मूल्यों की रक्षा करने की कोशिश कर रहे हैं।",
      "पूंजीवाद और समाजवाद की परिभाषाओं, प्रबंधकों की भूमिका, पूर्वाग्रह, और कार्यस्थल में मानव बातचीत और श्रमिकों के अधिकारों की रक्षा में यूनियनों के महत्व पर बहस होती है।"
    ],
    "points": 291,
    "commentCount": 325,
    "retryCount": 0,
    "time": 1691946616
  },
  {
    "id": 37112625,
    "title": "'मेरे पास छिपाने के लिए कुछ भी नहीं है' और गोपनीयता की अन्य गलतफहमियां (2007)",
    "originLink": "https://papers.ssrn.com/sol3/papers.cfm?abstract_id=998565",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37112625",
    "commentBody": "",
    "originSummary": [
      "प्रोफेसर डैनियल सोलोव के शोध पत्र में गोपनीयता और निगरानी चर्चाओं में उपयोग किए जाने वाले \"छिपाने के लिए कुछ भी नहीं\" तर्क का विश्लेषण किया गया है।",
      "पेपर इस दावे का विरोध करता है कि जिन व्यक्तियों के पास छिपाने के लिए कुछ भी नहीं है, उन्हें गोपनीयता के बारे में चिंतित नहीं होना चाहिए।",
      "सोलोव इस विश्वास को चुनौती देता है कि गोपनीयता केवल अवैध गतिविधियों में शामिल लोगों के लिए महत्वपूर्ण है।"
    ],
    "commentSummary": [
      "मंच की चर्चा गोपनीयता और निगरानी के बारे में \"मेरे पास छिपाने के लिए कुछ भी नहीं है\" के तर्क के आसपास केंद्रित है।",
      "प्रतिभागी सरकारी निगरानी, मुक्त भाषण, पुलिस हिंसा, गोपनीयता उल्लंघनों और निजी जानकारी के दुरुपयोग के ऐतिहासिक उदाहरणों पर चर्चा करते हैं।",
      "गोपनीयता की कमी के संभावित जोखिमों और परिणामों के कारण एक मौलिक अधिकार के रूप में व्यक्तिगत जानकारी और गोपनीयता की रक्षा के महत्व पर जोर दिया जाता है।"
    ],
    "points": 287,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1691951009
  },
  {
    "id": 37111317,
    "title": "आज मुझे एहसास हुआ कि मैं अब Google से ज्यादा माइक्रोसॉफ्ट पर भरोसा करता हूं। क्या हो रहा है?",
    "originLink": "https://old.reddit.com/r/degoogle/comments/15pd5si/today_i_realized_i_now_trust_microsoft_more_than/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37111317",
    "commentBody": "",
    "originSummary": [
      "Reddit पर उपयोगकर्ता खोज परिणामों और गोपनीयता के मुद्दों के बारे में चिंताओं का हवाला देते हुए Google की तुलना में Microsoft में बढ़ते विश्वास पर चर्चा कर रहे हैं।",
      "कई उपयोगकर्ता वीएस कोड और गिटहब जैसे माइक्रोसॉफ्ट उत्पादों के लिए प्राथमिकता व्यक्त करते हैं, इन प्लेटफार्मों में उनके विश्वास को उजागर करते हैं।",
      "भंडारण और सॉफ़्टवेयर के लिए वैकल्पिक विकल्पों पर चर्चा की जाती है, जो माइक्रोसॉफ्ट और Google पारिस्थितिक तंत्र के बाहर विकल्पों की इच्छा का संकेत देती है। बातचीत टेलीमेट्री और गोपनीयता के बारे में चिंताओं को भी छूती है।"
    ],
    "commentSummary": [
      "चर्चा माइक्रोसॉफ्ट और गूगल जैसी तकनीकी कंपनियों के आसपास विश्वास और चिंताओं पर केंद्रित है।",
      "कुछ उपयोगकर्ता Google के साथ विश्वास के मुद्दों का हवाला देते हुए, Google Chrome पर Microsoft के VSकोड को पसंद करते हैं।",
      "गोपनीयता, डेटा ट्रैकिंग, उपयोगकर्ता डेटा के मुद्रीकरण, और तकनीकी कंपनियों द्वारा नियंत्रण जैसे विषयों पर भी चर्चा की जाती है।"
    ],
    "points": 260,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1691943549
  }
]
