[
  {
    "id": 41114839,
    "title": "எங்கள் ஹோம்ப்ரூ ஆடிட்",
    "originLink": "https://blog.trailofbits.com/2024/07/30/our-audit-of-homebrew/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114839",
    "commentBody": "",
    "originSummary": [
      "Homebrew, macOS மற்றும் Linux க்கான முக்கியமான பாக்கேஜ் மேலாளர், பற்றிய ஒரு தணிக்கை, எதிர்பாராத குறியீட்டு செயல்பாட்டை அனுமதிக்கும் மற்றும் CI/CD வேலைநடவடிக்கைகளை பாதிக்கக்கூடிய முக்கியமற்ற பாதுகாப்பு பிரச்சினைகளை வெளிப்படுத்தியது.",
      "முக்கிய கண்டுபிடிப்புகளில் brew CLI இல் உள்ள பலவீனங்கள், உதாரணமாக சாண்ட்பாக்ஸ் தப்பிப்புகள் மற்றும் привிலேஜ் உயர்வுகள், மற்றும் CI/CD வேலைநடவடிக்கைகளில் உள்ள சிக்கல்கள், உதாரணமாக ஷெல் இன்ஜெக்ஷன் பலவீனங்கள் அடங்கும்.",
      "ஆடிட், ஓபன் டெக் ஃபண்ட் ஆதரவில், முக்கியமான இணைய உள்கட்டமைப்பை பாதுகாப்பதற்காக, ஹோம்ப்ரூவின் பாதுகாப்பின் முக்கியத்துவத்தை அதன் பரந்த அளவிலான பயன்பாட்டை கருத்தில் கொண்டு வலியுறுத்தியது."
    ],
    "commentSummary": [
      "Trail of Bits, macOS க்கான பிரபலமான திறந்த மூல பாக்கேஜ் மேலாளரான Homebrew இன் முழுமையான பாதுகாப்பு தணிக்கையை நடத்தியது, பல பாதுகாப்பு கவலைகள் மற்றும் மேம்படுத்த வேண்டிய பகுதிகளை வெளிப்படுத்தியது.",
      "ஆடிட் திறந்த மூல தொகுப்பு மேலாண்மை தளங்களில் உள்ள உட்பிறப்பு வழங்கல் சங்கிலி பாதுகாப்பு பிரச்சினைகள் குறித்து விவாதங்களைத் தூண்டியுள்ளது, நம்பகமற்ற மூலங்களுக்கு எதிராக சிறந்த பரிசோதனை செயல்முறைகள் மற்றும் விரைவான பதில்கள் தேவை என்பதை வலியுறுத்துகிறது.",
      "ஆடிட் கண்டுபிடிப்புகள், அதன் சிக்கலின்போதும், சில பயனர்கள் அதை அதிக பாதுகாப்பானதும் நெகிழ்வானதுமாகக் காண்பதால், Nix போன்ற மாற்று தொகுப்பு மேலாளர்களில் அதிக ஆர்வத்தை ஏற்படுத்தியுள்ளது."
    ],
    "points": 713,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1722379161
  },
  {
    "id": 41116473,
    "title": "டாக்கர் இல் க்யூஎம்யூ இல் மாக்ஓஎஸ்",
    "originLink": "https://github.com/sickcodes/Docker-OSX",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116473",
    "commentBody": "",
    "originSummary": [
      "டாக்கர்-ஓஎஸ்எக்ஸ் பயனர்களுக்கு ஹை சியார்ரா முதல் சோனோமா வரை உள்ள பதிப்புகளை ஆதரித்து, டாக்கர் கண்டெய்னரில் மாக் ஓஎஸ்ஐயை அருகிலுள்ள இயல்பான செயல்திறனுடன் இயக்க அனுமதிக்கிறது.",
      "திட்டம் Sick.Codes மூலம் பராமரிக்கப்படுகிறது மற்றும் X11 முன்னேற்றம், iMessage பாதுகாப்பு ஆராய்ச்சி, மற்றும் iPhone USB பாஸ்த்ரூ போன்ற அம்சங்களை உள்ளடக்கியது.",
      "இந்த கருவி, லினக்ஸ் மற்றும் விண்டோஸ் சூழல்களைப் பயன்படுத்தி macOS இல் பாதுகாப்பு ஆராய்ச்சிகளை நடத்துவதற்கு குறிப்பாக பயனுள்ளதாகும்."
    ],
    "commentSummary": [
      "QEMU-இல் Docker-இல் macOS-ஐ இயக்குவது சாத்தியமாக உள்ளது, ஆனால் குறிப்பாக GPU வேகப்படுத்தலுடன் சில வரம்புகள் உள்ளன, ஏனெனில் புதிய Intel மற்றும் NVIDIA GPU-க்கள் ஆதரிக்கப்படவில்லை.",
      "டாக்கர்-ஓஎஸ்எக்ஸ், டாக்கரில் மாக் ஓஎஸ் வெர்ச்சுவல் மெஷின்களை இயக்குவதற்கு உதவுகிறது, இது யூனிட்டி அல்லது ரியாக்ட் நேட்டிவ் போன்ற கருவிகளைப் பயன்படுத்தி iOS கட்டுமானங்களுக்கு பயனுள்ளதாகும்.",
      "macOS படங்களை மறுவிநியோகம் செய்வது, macOS ஐ Apple உபகரணங்களுக்கு மட்டுமே கட்டுப்படுத்தும் Apple இன் இறுதி பயனர் உரிமம் ஒப்பந்தத்தை (EULA) மீறக்கூடும், இருப்பினும் இந்த திட்டம் மேம்பாடு மற்றும் சோதனைக்காக பிரபலமாக உள்ளது."
    ],
    "points": 445,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1722401472
  },
  {
    "id": 41115941,
    "title": "`find` + `mkdir` என்பது ட்யூரிங் முழுமையானது.",
    "originLink": "https://ogiekako.vercel.app/blog/find_mkdir_tc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115941",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "\"find\" மற்றும் \"mkdir\" கட்டளைகளைப் பயன்படுத்துவது Turing முழுமையானது என்ற கூற்று, தவறான சான்றின் காரணமாக திரும்பப் பெறப்பட்டது.",
      "இந்த விவாதம் கோப்பு முறைமைகள், அடைவு நுழைவுகள், மற்றும் விண்டோஸில் உள்ள மாஸ்டர் கோப்பு அட்டவணை (MFT) பற்றிய தொழில்நுட்ப விவரங்களை, மேலும் C மற்றும் பைதான் போன்ற பல்வேறு முறைமைகளின் டூரிங் முழுமைதன்மை குறித்த விவாதங்களை உள்ளடக்கியது.",
      "இந்த உரையாடல், ட்யூரிங் இயந்திரங்கள், விதி 110, மற்றும் செயல்பாட்டு முழுமை ஆகியவற்றின் கோட்பாட்டியல் அம்சங்களையும் ஆராய்கிறது, சான்று திருத்தப்பட்டால் புதுப்பிப்பு வழங்கப்படும் என்று வாக்குறுதி அளிக்கிறது."
    ],
    "points": 287,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1722392561
  },
  {
    "id": 41116635,
    "title": "மெட்டா செக்மென்ட் எதிங்க் மாடல் 2 ஐ அறிமுகப்படுத்துகிறது",
    "originLink": "https://ai.meta.com/sam2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116635",
    "commentBody": "",
    "originSummary": [
      "Meta நிறுவனம் Segment Anything Model 2 (SAM 2) என்ற பகுப்பாய்வு மாதிரியை அறிமுகப்படுத்தியுள்ளது, இது படங்கள் மற்றும் வீடியோக்களில் உள்ள பொருட்களை துல்லியமாகத் தேர்ந்தெடுக்க கிளிக்குகள், பெட்டிகள் அல்லது முகமூடிகளை உள்ளீடாகக் கொண்டு செயல்படுகிறது.",
      "SAM 2 பொருள்களைப் பிரிப்பதில் உள்ள மாடல்களை விட சிறப்பாக செயல்பட்டு, சுழற்சி இல்லாத செயல்திறன், நேரடி தொடர்பு மற்றும் திறமையான வீடியோ செயலாக்கத்தில் சிறந்து விளங்குகிறது.",
      "மெட்டா முன்பயிற்சி செய்யப்பட்ட SAM 2 மாதிரியை, SA-V தரவுத்தொகுப்பை, ஒரு டெமோவை, மற்றும் குறியீட்டினை ஆராய்ச்சி சமூகத்திற்கு வெளியிடுகிறது, திறந்த புதுமையை மற்றும் மேலதிக ஆராய்ச்சியை ஊக்குவிக்கிறது."
    ],
    "commentSummary": [
      "Meta Segment Anything Model 2 ஐ அறிமுகப்படுத்தியுள்ளது, இது AI ஆராய்ச்சி மற்றும் தொழில்நுட்பத் துறையில் அதன் சாத்தியமான தாக்கத்தைப் பற்றி குறிப்பிடத்தக்க ஆர்வத்தை உருவாக்கியுள்ளது.",
      "சில நிபுணர்கள், மெட்டா கூகுளை ஏ.ஐ முன்னேற்றங்கள் மற்றும் சமூக பங்களிப்புகளில் முந்திவிட்டதாகக் கூறுகின்றனர், இது புதிய கண்டுபிடிப்புகள் மற்றும் வணிக மதிப்பை உருவாக்கக்கூடும்.",
      "சர்ச்சையில் மெட்டாவின் திறந்த மூல முயற்சிகள் மற்றும் AI தொழில்நுட்பத்தின் பரந்த விளைவுகள், மேலும் முக்கிய தொழில்நுட்ப நிறுவனங்களுக்கிடையிலான போட்டி மாறுபாடுகள் பற்றியும் அடங்கும்."
    ],
    "points": 264,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1722404557
  },
  {
    "id": 41114825,
    "title": "படைப்பாற்றல் அடிப்படையாகவே நினைவில் கொள்ளுதல் மூலம் வருகிறது",
    "originLink": "https://shwin.co/blog/creativity-fundamentally-comes-from-memorization",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114825",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர், டிஜே மாற்றங்கள் மற்றும் நகைச்சுவை முறைப்பாடுகள் போன்ற படைப்பாற்றல் முயற்சிகளில் அமைப்புகளைப் பயன்படுத்துவது, அறிவு மற்றும் முறைப்பாடுகளை உள்ளடக்குவதன் மூலம் படைப்பாற்றலை மேம்படுத்துகிறது என்று வாதிடுகிறார்.",
      "அவர்கள் நினைவில் கொள்ளும் முறை மற்றும் பல்வேறு வழக்குகளை சந்திக்கும் முறையை உள்ளடக்கிய ஒரு கற்றல் முறையை ஆதரிக்கின்றனர், இது கல்வியைத் தாண்டி விளையாட்டு மற்றும் விற்பனை போன்ற துறைகளிலும் பயன்படுத்தப்படலாம்.",
      "ஆசிரியர் அடிப்படைத் திறன்களை முறைமைகளின் மூலம் கற்றுக்கொள்வது மேம்பட்ட கண்டுபிடிப்பு மற்றும் படைப்பாற்றலை ஏற்படுத்துகிறது என்று பரிந்துரைக்கிறார், இது தொடக்க நிறுவனங்கள் மற்றும் இசையில் துறைமுக திறன்களில் காணப்படுகிறது."
    ],
    "commentSummary": [
      "படைப்பாற்றல் பெரும்பாலும் உள்ளார்ந்த அறிவுடன் தொடர்புடையது, இது நினைவில் கொள்ளுதலின் விளைவாக இருக்கலாம்.",
      "தற்காலிகமாக மனப்பாடம் செய்வது படைப்பாற்றலுக்கு அவசியமா என்ற விவாதம் உள்ளது, சிலர் வெறும் மீளுரைப்பை விட புரிதலும் சூழலும் முக்கியம் என்று வாதிடுகின்றனர்.",
      "குறிப்புகளை மீண்டும் மீண்டும் சந்திப்பதன் மூலம் உள்ளீடு செய்வது, படைப்பாற்றல் பயன்பாடுகளுக்கு பயனுள்ள சுருக்கவியல் மற்றும் மாதிரிகளை உருவாக்க உதவலாம்."
    ],
    "points": 255,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1722379044
  },
  {
    "id": 41114569,
    "title": "பிரச்சினைகளை தீர்க்குதல்: டெர்மினல் லாக்",
    "originLink": "https://lock.cmpxchg8b.com/slowterm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114569",
    "commentBody": "",
    "originSummary": [
      "பயனர் ஒரு Windows 11 கணினியில் xterm திறக்கும்போது குறிப்பிடத்தக்க தாமதத்தை அனுபவித்தார், இது ஒரு Fedora Linux வேலைநிலையத்துடன் ஒப்பிடுகையில், Windows ஆரம்பத்தில் சுமார் 1600ms எடுத்தது.",
      "Profiling and debugging revealed that disabling window effects and certain xterm features, such as the toolbar and Tektronix emulation, improved performance.\" \"சுயவிவரமிடல் மற்றும் பிழைத்திருத்தம், சாளர விளைவுகளை மற்றும் குறிப்பிட்ட xterm அம்சங்களை, உதாரணமாக கருவிப்பட்டி மற்றும் Tektronix பின்பற்றலை முடக்குவது செயல்திறனை மேம்படுத்தியது என்பதை வெளிப்படுத்தியது.",
      "ஒரு LD_PRELOAD நூலகத்தைப் பயன்படுத்தி ஒத்திவைக்கப்பட்ட வரைபடத்துடன் ஒரு சர்வர் முறையை செயல்படுத்துவது, விண்டோஸில் தொடக்க நேரத்தை சுமார் 366 மில்லி விநாடிகளாகக் குறைத்தது, இதனால் இது ஃபெடோராவில் உள்ளதைப் போலவே வேகமாக உள்ளது."
    ],
    "commentSummary": [
      "கட்டுரை டெர்மினல் லாக் பிரச்சினைகளை தீர்க்கும் முறைகளை விவரிக்கிறது, குறிப்பாக மைக்ரோசாஃப்ட் கன்சோல் டிபக்கர் (cdb) மற்றும் அதன் கட்டளைகளை பயன்படுத்தி செயல்பாட்டு நடத்தை மாற்றுவது குறித்தும் கவனம் செலுத்துகிறது.",
      "இது `eb win32u!NtUserSetLayeredWindowAttributes c3` கட்டளையைப் பயன்படுத்தி ஒரு செயல்பாட்டை முடக்குவதைக் குறிப்பிடுகிறது, அதன் முதல் பைட்டை `ret` கட்டளையால் மாற்றி, உடனடியாக திரும்பச் செய்யும்.",
      "இந்த விவாதத்தில் பல்வேறு பயனர் அனுபவங்கள் மற்றும் `hyperfine` பெஞ்ச்மார்க்கிங் கருவி மற்றும் வெவ்வேறு டெர்மினல் எமுலேட்டர்களைப் பயன்படுத்தி டெர்மினல் தொடக்க நேரத்தை அளவிடவும் குறைக்கவும் உள்ள முறைகள் அடங்கும்."
    ],
    "points": 188,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722377079
  },
  {
    "id": 41116639,
    "title": "ரஸ்ட்கோ: கோவில் இருந்து ரஸ்டை அழைப்பது, மிகக் குறைந்த மேலதிகச் செலவுடன் (2017)",
    "originLink": "https://words.filippo.io/rustgo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116639",
    "commentBody": "",
    "originSummary": [
      "இந்த பதிவில், ஆஸெம்பிளி குறியீட்டினை மாற்றுவதற்காக ரஸ்ட் மொழியிலிருந்து கோ மொழியை அழைப்பது பற்றி ஆராய்கிறது, ஆழமான ரஸ்ட் அல்லது கம்பைலர் அறிவைத் தேவையில்லாமல், மிகக் குறைந்த மேலதிகச் செலவுடன்.",
      "Rust ஐ அதன் உயர் மேம்படுத்தக்கூடிய தன்மை மற்றும் வாசிக்கக்கூடிய தன்மை காரணமாக தேர்வு செய்கிறார்கள், மேலும் இந்த அணுகுமுறை சிறிய, சூடான செயல்பாடுகளுக்கு cgo ஐப் பயன்படுத்துவதைக் காட்டிலும் சிறந்த செயல்திறனைக் காட்டுகிறது.",
      "முன்னேற்றத்தை மதிப்பீடு செய்வது ரஸ்ட்டை கோவில் இருந்து அழைப்பது, ஒரு சொந்த கோ செயல்பாட்டு அழைப்பை விட வேகமாகவும், cgo விட குறிப்பிடத்தக்க வகையில் வேகமாகவும் இருப்பதை காட்டுகிறது, இதனால் இது செயல்திறன் முக்கியமான பணிகளுக்கு ஏற்றதாக உள்ளது."
    ],
    "commentSummary": [
      "Rustgo என்பது செயல்திறன் முக்கியமான பயன்பாடுகளுக்கு மிகக் குறைந்த செலவுடன் Go இலிருந்து Rust குறியீட்டு அழைப்புகளை அனுமதிக்கும் ஒரு கருவியாகும்.",
      "இந்த விவாதம், வெவ்வேறு நிரலாக்க மொழிகளுக்கு இடையில் வெளிநாட்டு செயல்பாட்டு இடைமுகம் (FFI) பயன்படுத்துவதின் சிக்கல்களையும் சாத்தியமான சிக்கல்களையும், குறிப்பாக Go மற்றும் Rust மொழிகளுக்கு இடையில், விளக்குகிறது.",
      "மற்ற மொழிகள் போன்ற C# மற்றும் Python உடன் ஒப்பீடுகள் செய்யப்படுகின்றன, FFI செயல்திறனில் வர்த்தக-offs மற்றும் வேலைக்கு சரியான கருவியைத் தேர்ந்தெடுப்பதின் முக்கியத்துவத்தை வலியுறுத்துகின்றன."
    ],
    "points": 173,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1722404613
  },
  {
    "id": 41120254,
    "title": "நான் Markdown விட rST ஐ விரும்புகிறேன்",
    "originLink": "https://buttondown.email/hillelwayne/archive/why-i-prefer-rst-to-markdown/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41120254",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் \"Logic for Programmers v0.2\" ஐ வெளியிட்டுள்ளார், இதில் epub ஆதரவு, கட்டுப்பாட்டு தீர்வு மற்றும் அதிகாரப்பூர்வ விவரக்குறிப்பு உள்ளடக்கம் ஆகியவை இடம்பெற்றுள்ளன.",
      "ஆசிரியர் reStructuredText (rST) ஐ Markdown விட விரும்புகிறார், ஏனெனில் அதன் மேம்பட்ட தனிப்பயனாக்கல் மற்றும் விரிவாக்கத்திறன், குறிப்பாக சிக்கலான ஆவண தேவைகளுக்கு பயனுள்ளதாக இருக்கும்.",
      "rST இல் ஒரு தனிப்பயன் உடற்பயிற்சி நீட்டிப்பு HTML, epub, மற்றும் PDF வடிவங்களுக்கான மாறுபட்ட காட்சிப்படுத்தல் தேவைகளை நிர்வகிக்க இந்த புத்தகத்திற்காக உருவாக்கப்பட்டது."
    ],
    "commentSummary": [
      "reStructuredText (rST) என்பது அதன் விரிவாக்கத்தன்மை மற்றும் அர்த்தமுள்ள திறன்களுக்காக, குறிப்பாக Sphinx உடன் சேர்க்கப்பட்ட போது, தொழில்நுட்ப புத்தகங்களுக்கு விரும்பப்படுகிறது.",
      "Markdown எளிமையானதும் வாசிக்க எளிதானதும் ஆகும், இது விரைவான குறிப்புகள் மற்றும் அன்றாட ஆவணங்களுக்குப் பொருத்தமாகும்.",
      "rST இன் தனிப்பயன் உரை பொருட்கள் மற்றும் உள் இணைப்பு தீர்மானத்தை உறுதிப்படுத்துதல் போன்ற அம்சங்கள் சிக்கலான ஆவண திட்டங்களுக்கு முக்கியமானவை, ஆனால் Markdown இன் எளிமை மற்றும் ஆதரவு அதை பொதுவாகப் பயன்படுத்துவதற்கு மிகவும் பிரபலமாக்குகிறது."
    ],
    "points": 172,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1722440995
  },
  {
    "id": 41115619,
    "title": "கால் ஆஃப் டியூட்டி: வார்ஜோன் கல்டேரா தரவுத்தொகுப்பு கல்வி பயன்பாட்டிற்காக",
    "originLink": "https://blog.activision.com/activision/2024/activision-releases-call-of-duty-warzone-caldera-data-set",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115619",
    "commentBody": "",
    "originSummary": [
      "Activision கல்வி பயன்பாட்டிற்காக Call of Duty®: Warzone™ Caldera தரவுத்தொகுப்பை வெளியிட்டுள்ளது, பக்கத்தின் மெட்டாடேட்டா மூலம் குறிப்பிடப்பட்டுள்ளது.",
      "இந்த வெளியீடு விளையாட்டு தரவுப் பகுப்பாய்வில் ஆர்வமுள்ள ஆராய்ச்சியாளர்கள் மற்றும் கல்வியாளர்களுக்கு முக்கியமானதாகும் மற்றும் விளையாட்டு துறையில் புதிய ஆய்வுகள் மற்றும் பார்வைகளை ஊக்குவிக்கக்கூடும்.",
      "தரவுத்தொகுப்பு Activision இன் வலைப்பதிவின் மூலம் அணுகக்கூடியது, இது கல்வி ஆராய்ச்சி மற்றும் தரவுத் தெளிவுத்தன்மைக்கு நிறுவனத்தின் ஆதரவை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "Activision கல்வி பயன்பாட்டிற்காக GitHub இல் Call of Duty: Warzone Caldera தரவுத்தொகுப்பை வெளியிட்டுள்ளது, இதில் விளையாட்டு நிலை சொத்துக்கள் மற்றும் வீரர் இயக்கம் தரவுகள் அடங்கும்.",
      "தரவுத்தொகுப்பு கிராபிக்ஸ் ஆராய்ச்சி, இயந்திர மேம்பாடு, மூலோபாய இடங்களை வரையறுத்தல், மற்றும் கதிர்வீச்சு கண்காணிப்பு அல்காரிதம்களை சோதனை செய்வதில் பயனுள்ளதாக உள்ளது, மேலும் AI மேம்பாடு மற்றும் ஏமாற்று கண்டறிதல் போன்ற பயன்பாடுகளுக்கும் சாத்தியமாகும்.",
      "வெளியீடு கல்வி மற்றும் ஆராய்ச்சி நோக்கங்களுக்காக பயனுள்ளதாகக் கருதப்படுகிறது, ஆனால் சிலர் அதை வணிகமற்ற உரிமம் காரணமாக ஆட்கள் சேர்க்கும் கருவியாகக் காண்கிறார்கள்."
    ],
    "points": 159,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1722387969
  },
  {
    "id": 41114601,
    "title": "லினக்ஸில் கோ மூலம் நிலையான பைனரிகளை உருவாக்குதல்",
    "originLink": "https://eli.thegreenplace.net/2024/building-static-binaries-with-go-on-linux/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114601",
    "commentBody": "",
    "originSummary": [
      "யுனிக்ஸ் அமைப்புகளில் நிலையான இணைக்கப்பட்ட பைனரிகளை கோ உருவாக்க முடியும், ஆனால் இது குறிப்பிட்ட கட்டுமான குறிச்சொற்கள் அல்லது cgo ஐ முடக்க வேண்டும்.",
      "`file`, `ldd`, மற்றும் `nm` போன்ற கருவிகள் ஒரு Go பைனரி நிலையான இணைப்புடன் இருக்கிறதா என்பதை சரிபார்க்க முடியும்.",
      "Zig ஐ ஒரு C கம்பைலராகப் பயன்படுத்துவது செயல்முறையை எளிமையாக்குகிறது மற்றும் நிலையான இணைப்புக்கான குறுக்கு-கம்பைலேஷனை ஆதரிக்கிறது."
    ],
    "commentSummary": [
      "லினக்ஸில் Go மூலம் நிலையான பைனரிகளை உருவாக்குவது குறிப்பிட்ட கொடிகள் மற்றும் பரிந்துரைகளை உள்ளடக்கியது, உதாரணமாக, எந்த நீட்டிப்புகளும் பயன்படுத்தப்படாதால் SQLite க்கான `-tags sqlite_omit_load_extension` பயன்படுத்தப்படுகிறது.",
      "இந்த விவாதம் SQLite க்கான WebAssembly (WASM) பயன்பாட்டை முக்கியமாகக் குறிப்பிடுகிறது, இது பாரம்பரிய முறைகளான modernc transpile போன்றவற்றுடன் ஒப்பிடும்போது சிறந்த செயல்திறன் மற்றும் பராமரிப்பு திறனை வழங்குகிறது.",
      "முஸ்ல் போன்ற மாறுபட்ட ஒதுக்கீட்டாளர்கள் மற்றும் libc செயலாக்கங்களைப் பயன்படுத்துவதால், நிலையான கோ பைனரிகளை உருவாக்கும்போது சவால்கள் மற்றும் செயல்திறன் பிரச்சினைகள் ஏற்படுகின்றன, எனது அனுபவத்தில் Tailscale போன்ற நிறுவனங்கள் சந்தித்துள்ளன."
    ],
    "points": 153,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1722377273
  },
  {
    "id": 41115591,
    "title": "சூப்பர் கண்டக்டிங் மைக்ரோபிராசஸர்கள்? அவை மிகுந்த திறனுடையவை என்று தெரியவந்தது (2021)",
    "originLink": "https://spectrum.ieee.org/new-superconductor-microprocessor-yields-a-substantial-boost-in-efficiency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115591",
    "commentBody": "",
    "originSummary": [
      "2.5 GHz அதிநவீன சூப்பர் கண்டக்டிங் மைக்ரோபிராசஸர் மாதிரி உருவாக்கப்பட்டுள்ளது, இது பாரம்பரிய அரைமூலக்கூறு மைக்ரோபிராசஸர்களைவிட 80 மடங்கு குறைவான ஆற்றலைப் பயன்படுத்துகிறது, குளிரூட்டலைக் கணக்கில் எடுத்தாலும்.",
      "மாணா மைக்ரோபிராசஸர், அடியாபடிக் குவாண்டம்-ஃப்ளக்ஸ்-பராமெட்ரான் (AQFP) தொழில்நுட்பத்தை அடிப்படையாகக் கொண்டது, 20,000 க்கும் மேற்பட்ட சூப்பர் கண்டக்டர் ஜோசெப்சன் சந்திகளை கொண்டுள்ளது.",
      "இது முதல் அடியாபடிக் சூப்பர் கண்டக்டிங் மைக்ரோபிராசஸர் ஆகும், இது ஆற்றல் திறன் கொண்ட கணினி தொழில்நுட்பத்தில் முக்கிய முன்னேற்றத்தை குறிக்கிறது."
    ],
    "commentSummary": [
      "ஜப்பானில் ஆராய்ச்சியாளர்கள், கணக்கீட்டின் போது ஆற்றல் இழப்பு அல்லது அதிகரிப்பை தவிர்க்கும் வகையில், அடியாபடிக்கமாக செயல்படும் மிகக் குறைந்த ஆற்றல் இழப்புடைய சூப்பர் கண்டக்டிங் மைக்ரோபிராசஸர்களை உருவாக்கி வருகின்றனர்.",
      "இந்த தொழில்நுட்பம், தகவலை அழிப்பதற்கு ஆற்றல் தேவைப்படும் என்று கூறும் லாண்டவேரின் கோட்பாட்டை சவாலுக்கு உட்படுத்துகிறது, குறிப்பிட்ட லாஜிக் கேடுகள் போன்ற டொஃபோலி கேட் பயன்படுத்தி ஆற்றல் செலவினத்தை குறைக்கக்கூடிய மாறுபாடான கணினியை பயன்படுத்துவதன் மூலம்.",
      "அதன் வாக்களிக்கப்பட்ட திறனுக்குப் பிறகும், நடைமுறை அமலாக்கம் முக்கிய சவால்களை எதிர்கொள்கிறது, குறிப்பாக குளிரூட்டல் மற்றும் நடைமுறை பயன்பாட்டிற்கான அளவீட்டில், மேலும் ஆரம்ப பிட்டுகளை அமைக்கவும் சுற்றுச்சூழல் சத்தத்தை நிர்வகிக்கவும் இன்னும் ஆற்றல் தேவைப்படுகிறது."
    ],
    "points": 136,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1722387626
  },
  {
    "id": 41119874,
    "title": "ஏன் CrowdStrike பிழை வங்கிகளை கடுமையாக தாக்கியது",
    "originLink": "https://www.bitsaboutmoney.com/archive/crowdstrike-bug-hit-banks-hard/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41119874",
    "commentBody": "",
    "originSummary": [
      "ஜூலை 19ஆம் தேதி, எண்ட்பாயிண்ட் கண்காணிப்பு மென்பொருளான க்ரவுட்ஸ்ட்ரைக் ஃபால்கனில் உள்ள ஒரு கட்டமைப்பு பிழை, வின்டோஸ் அமைப்புகளில் பேரழிவுகளை ஏற்படுத்தியது, வங்கி துறை மற்றும் பிற தொழில்களை கடுமையாக பாதித்தது.",
      "பிழை பரவலான செயல்பாட்டு இடையூறுகளை ஏற்படுத்தியது, இதில் டெல்லர்கள் மற்றும் வங்கியாளர்கள் வேலை செய்யாமல் இருந்தனர், மேலும் சில வங்கிகள் பிசியலான பணம் இல்லாமல் போகவும் காரணமாக இருந்தது, இது நிதி அடுக்குமாடியில் உள்ள பலவீனங்களை வெளிப்படுத்தியது.",
      "அமெரிக்க வங்கி ஒழுங்குமுறை அதிகாரிகள் பாதுகாப்பு கருவிகளை ஏற்கும் செயல்முறையை மறைமுகமாகத் தூண்டினர், அவை பாதுகாப்பிற்காக நோக்கப்பட்டிருந்தாலும், அவற்றின் உயர் சலுகைகள் மற்றும் பரவலான பயன்பாட்டினால் முக்கியமான பாதிப்புகளை ஏற்படுத்தக்கூடும்."
    ],
    "commentSummary": [
      "ஒரு CrowdStrike பிழை, உள்ளமைக்கப்பட்ட கட்டுப்பாடுகளை புறக்கணிக்கும் தானியங்கி புதுப்பிப்பின் காரணமாக வங்கிகளில் முக்கியமான இடையூறுகளை ஏற்படுத்தியது.",
      "இந்த சம்பவம் தனிப்பட்ட விற்பனையாளர்களை நம்புவதின் ஆபத்துகள் மற்றும் மேம்பட்ட புதுப்பிப்பு உத்தியோகங்கள் தேவையென்பதைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது.",
      "பரவலாக உள்ள பிரச்சினைகள் இருந்தபோதிலும், சில பயனர்கள் குறைந்த பாதிப்பை சந்தித்தனர், இது சில அமைப்புகளின் பொறுமையை வெளிப்படுத்துகிறது."
    ],
    "points": 135,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1722438444
  },
  {
    "id": 41116253,
    "title": "AT&T லாங் லைன்ஸ் \"செஷயர்\" நிலத்தடி தளத்தின் கட்டுமானம்",
    "originLink": "https://coldwar-ct.com/Home_Page_S1DO.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116253",
    "commentBody": "",
    "originSummary": [
      "Cheshire ATT வசதி, 1966 இல் கட்டப்பட்டது, முக்கிய இராணுவ தொடர்புகளுக்காக வடிவமைக்கப்பட்ட ஒரு நிலத்தடி வளாகமாகும், இது ஒரு கடினமான அனலாக் L4 கேரியர் கேபிள் மற்றும் AUTOVON 4-கம்பி சுவிட்ச் ஆகியவற்றைக் கொண்டுள்ளது.",
      "இக்கட்டிடம் காற்று வடிகட்டி, மின்சார உற்பத்தி மற்றும் வெடிப்பு பாதுகாப்பு ஆகியவற்றிற்கான விரிவான உள்கட்டமைப்புகளை கொண்டுள்ளது, அணு நிகழ்வுகளின் போது செயல்பாட்டு தொடர்ச்சியை உறுதிப்படுத்துகிறது.",
      "இந்த தளம் ஹார்ட்ஃபோர்டு மற்றும் நியூ ஹேவனுக்கான ஒரு பெருநகர சந்திப்பாகவும், பல முக்கியமான தொடர்பு பாதைகள் மற்றும் வசதிகளுடன் இணைப்பாகவும் செயல்பட்டது."
    ],
    "commentSummary": [
      "AT&T லாங் லைன்ஸ் \"செஷைர்\" நிலத்தடி தளம் ஒரு AUTOVON மாறுதல் மையமாக இருந்தது, இது மேற்கு மின்சாரத்தின் 1ESS தொழில்நுட்பத்தைப் பயன்படுத்தி அணு போருக்கு தாங்கும் வகையில் கட்டப்பட்டது.",
      "இந்த மையங்கள் முக்கிய நகரங்கள் மற்றும் இராணுவ இலக்குகளிலிருந்து தூரமாகยุழைக்கப்பட்டு, மீண்டும் மீண்டும் இணைப்புகள், உறுதியான கட்டமைப்புகள், மற்றும் பணியாளர்களுக்கான குளிரூட்டல் மற்றும் மாசுபாடு பாதுகாப்பு ஆகியவற்றை கொண்டிருந்தன.",
      "குளிர்போரின் போது உருவாக்கப்பட்ட உட்கட்டமைப்பு, விரிவான மைக்ரோவேவ் பாயிண்ட்-டு-பாயிண்ட் இணைப்புகளை உள்ளடக்கியது மற்றும் 1ESS மற்றும் நம்பர் 5 கிராஸ்பார் சுவிட்ச்களை பயன்படுத்தியது, இதன் நிலைத்தன்மை மற்றும் சிக்கல்தன்மையை வெளிப்படுத்துகிறது."
    ],
    "points": 124,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1722397662
  },
  {
    "id": 41119080,
    "title": "மாபெரும் ஆக்சிடேஷன் நிகழ்வு எவ்வளவு பெரியது?",
    "originLink": "https://eos.org/science-updates/how-great-was-the-great-oxidation-event",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41119080",
    "commentBody": "",
    "originSummary": [
      "அறிவியலாளர்கள் பரந்த ஆராய்ச்சிகளுக்கு பிறகும், பூமியின் வளிமண்டலத்தில் ஆரம்ப கால விலங்குகளின் வாழ்க்கையை ஆதரிக்க போதுமான ஆக்சிஜன் எப்போது இருந்தது என்பது குறித்து உறுதியாகத் தெரியவில்லை.",
      "புதிய கண்டுபிடிப்புகள் ரியோ டின்டோ, ஸ்பெயின், nearly 2 பில்லியன் ஆண்டுகளுக்கு முன்பு விலங்குகள் தோன்றுவதற்கு போதுமான ஆக்சிஜன் இருந்திருக்கலாம் என்று பரிந்துரைக்கின்றன.",
      "சமீபத்திய ஆராய்ச்சிகள், மாறுபடும் கடல் ஆக்சிஜன் நிலைகள், உணவின் பற்றாக்குறை, அல்லது மரபணு வளர்ச்சி நேரம் ஆகியவை, ஆக்சிஜன் நிலைகளுக்கு பதிலாக, விலங்குகளின் பரிணாமத்தை தாமதப்படுத்தியிருக்கலாம் என்பதைக் குறிக்கின்றன."
    ],
    "commentSummary": [
      "பெரிய ஆக்சிடேஷன் நிகழ்வு (GOE) குறைந்தது 400 மில்லியன் ஆண்டுகளாக ஒளிச்சேர்க்கை நுண்ணுயிரிகளால் பூமியின் வளிமண்டல ஆக்சிஜனில் ஒரு முக்கியமான உயர்வை குறித்தது.",
      "இந்த ஆக்சிஜன் அதிகரிப்பு சிக்கலான உயிரினங்களின் வளர்ச்சியையும் தீயின் சாத்தியத்தையும் இயலுமைப்படுத்தியது, ஆனால் ஆக்சிஜன் இல்லாத உயிரினங்களின் பெருமளவிலான அழிவை ஏற்படுத்தியது.",
      "GOE என்பது அஸ்ட்ரோபயாலஜிக்காக மிகவும் முக்கியமானது, ஏனெனில் எக்ஸோபிளானெட்களில் அதிக ஆக்ஸிஜன் நிலைகள் உயிரியல் செயல்பாட்டின் சாத்தியத்தை குறிக்கக்கூடும், தொடர்ந்து நடைபெறும் ஆராய்ச்சிகள் எங்கள் புரிதலை தொடர்ந்து மேம்படுத்துகின்றன."
    ],
    "points": 119,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1722433249
  },
  {
    "id": 41116414,
    "title": "FakeTraveler: உங்கள் தொலைபேசி எங்கு உள்ளது என்பதை போலியாகக் காட்டுங்கள் (ஆண்ட்ராய்டுக்கான போலி இடம்)",
    "originLink": "https://github.com/mcastillof/FakeTraveler",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116414",
    "commentBody": "",
    "originSummary": [
      "FakeTraveler என்பது பயனர்களுக்கு தனியுரிமை அல்லது பயன்பாட்டு சோதனை நோக்கங்களுக்காக தங்களின் தொலைபேசி இருப்பிடத்தை போலியாக காட்ட அனுமதிக்கும் ஒரு ஆண்ட்ராய்டு பயன்பாடாகும்.",
      "பயனர்கள் ஒரு இடத்தை வரைபடத்தின் மூலம் தேர்ந்தெடுக்கலாம் அல்லது குறிப்பிட்ட அகலாங்கு மற்றும் நீளாங்கு கோடிகளை உள்ளிடலாம், பின்னர் மாற்றங்களைப் பயன்படுத்தலாம்.",
      "FakeTraveler ஐ பயன்படுத்த, பயனர்கள் Developer விருப்பங்களை இயக்கி, FakeTraveler ஐ mock location பயன்பாடாக அமைக்க வேண்டும்."
    ],
    "commentSummary": [
      "FakeTraveler என்பது Android க்கான ஒரு போலி இடம் பயன்பாடாகும், இது பயனர்களுக்கு தங்கள் தொலைபேசி இடத்தை போலியாக்க அனுமதிக்கிறது.",
      "அப்பிளிகேஷன் திறந்த மூலமாகும் மற்றும் இலவச மற்றும் திறந்த மூல ஆண்ட்ராய்டு பயன்பாடுகளுக்கான களஞ்சியமான F-Droid இல் கிடைக்கிறது.",
      "அதன் செயல்பாட்டைத் தவிர, சில பயனர்கள், வங்கி பயன்பாடுகள் அல்லது Pokémon Go போன்ற குறிப்பிட்ட பயன்பாடுகளின் கட்டுப்பாடுகளை அது கடக்க முடியாது என்று குறிப்பிடுகின்றனர், சாதனத்தை rooting போன்ற கூடுதல் நடவடிக்கைகள் இல்லாமல்."
    ],
    "points": 109,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1722400215
  }
]
