[
  {
    "id": 41114839,
    "title": "Homebrew-auditimme",
    "originLink": "https://blog.trailofbits.com/2024/07/30/our-audit-of-homebrew/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114839",
    "commentBody": "",
    "originSummary": [
      "Auditointi Homebrew-ohjelmistonhallintajärjestelmästä, joka on kriittinen macOS- ja Linux-järjestelmille, paljasti ei-kriittisiä tietoturvaongelmia, jotka voisivat mahdollistaa odottamattoman koodin suorittamisen ja vaarantaa CI/CD-työnkulut.",
      "Keskeisiin havaintoihin kuuluivat haavoittuvuudet brew CLI:ssä, kuten hiekkalaatikosta pakenemiset ja oikeuksien korotukset, sekä ongelmat CI/CD-työnkuluissa, kuten shell-injektiohaavoittuvuudet.",
      "Open Tech Fundin sponsoroiman auditoinnin tavoitteena oli turvata kriittinen internetin infrastruktuuri, korostaen Homebrewin turvallisuuden merkitystä sen laajan käytön vuoksi."
    ],
    "commentSummary": [
      "Trail of Bits suoritti kattavan turvallisuustarkastuksen Homebrew'lle, suositulle avoimen lähdekoodin pakettienhallinnalle macOS:lle, paljastaen useita turvallisuusongelmia ja parannuskohteita.",
      "Auditointi on herättänyt keskusteluja avoimen lähdekoodin pakettienhallinta-alustojen luontaisista toimitusketjun turvallisuusongelmista, korostaen parempien tarkastusprosessien ja nopeampien vastausten tarvetta epäluotettaviin lähteisiin.",
      "Auditointitulokset ovat lisänneet kiinnostusta vaihtoehtoisiin pakettienhallintaohjelmiin, kuten Nixiin, jota jotkut käyttäjät pitävät turvallisempana ja joustavampana, sen monimutkaisuudesta huolimatta."
    ],
    "points": 713,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1722379161
  },
  {
    "id": 41116473,
    "title": "macOS QEMU:ssa Dockerissa",
    "originLink": "https://github.com/sickcodes/Docker-OSX",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116473",
    "commentBody": "",
    "originSummary": [
      "Docker-OSX mahdollistaa macOS:n ajamisen Docker-kontissa lähes alkuperäisellä suorituskyvyllä, tukien versioita High Sierrasta Sonomaan.",
      "Projektia ylläpitää Sick.Codes ja siihen sisältyy ominaisuuksia kuten X11-välitys, iMessage-turvallisuustutkimus ja iPhonen USB-läpivienti.",
      "Tämä työkalu on erityisen hyödyllinen suoritettaessa tietoturvatutkimusta macOS:llä käyttäen sekä Linux- että Windows-ympäristöjä."
    ],
    "commentSummary": [
      "macOS:n ajaminen QEMU:ssa Dockerin sisällä on mahdollista, mutta siinä on rajoituksia, erityisesti GPU-kiihdytyksen osalta, sillä uudemmat Intelin ja NVIDIA:n GPU:t eivät ole tuettuja.",
      "Docker-OSX mahdollistaa macOS-virtuaalikoneiden ajamisen Dockerissa, mikä on hyödyllistä iOS-rakennuksissa, joissa käytetään työkaluja kuten Unity tai React Native.",
      "macOS-kuvien uudelleenjakaminen saattaa rikkoa Applen loppukäyttäjän lisenssisopimusta (EULA), joka rajoittaa macOS:n käytön Apple-laitteisiin, mutta projekti on silti suosittu kehitykseen ja testaukseen."
    ],
    "points": 445,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1722401472
  },
  {
    "id": 41115941,
    "title": "find + mkdir on Turing-täydellinen",
    "originLink": "https://ogiekako.vercel.app/blog/find_mkdir_tc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115941",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Väite, että `find`- ja `mkdir`-komentojen käyttö olisi Turing-täydellistä, on peruttu virheellisen todistuksen vuoksi.",
      "Keskustelu käsittelee teknisiä yksityiskohtia tiedostojärjestelmistä, hakemisto-merkinnöistä ja Master File Table (MFT) -taulukosta Windowsissa, sekä väittelyitä eri järjestelmien, kuten C:n ja Pythonin, Turing-täydellisyydestä.",
      "Keskustelu tutkii myös Turingin koneiden, Sääntö 110:n ja funktionaalisen täydellisyyden teoreettisia näkökohtia, ja päivitys luvataan, jos todistus korjataan."
    ],
    "points": 287,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1722392561
  },
  {
    "id": 41116635,
    "title": "Meta esittelee Segment Anything Model 2",
    "originLink": "https://ai.meta.com/sam2/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116635",
    "commentBody": "",
    "originSummary": [
      "Meta on esitellyt Segment Anything Model 2:n (SAM 2), segmentointimallin, joka mahdollistaa tarkan kohteiden valinnan kuvissa ja videoissa käyttämällä syötteenä klikkauksia, laatikoita tai maskeja.",
      "SAM 2 loistaa zero-shot-suorituksessa, reaaliaikaisessa vuorovaikutuksessa ja tehokkaassa videonkäsittelyssä, ylittäen nykyiset mallit kohteiden segmentoinnissa.",
      "Meta julkaisee esikoulutetun SAM 2 -mallin, SA-V-datasarjan, demon ja koodin tutkimusyhteisölle edistäen avointa innovointia ja jatkotutkimusta."
    ],
    "commentSummary": [
      "Meta on julkaissut Segment Anything Model 2:n, mikä on herättänyt suurta kiinnostusta sen mahdollisesta vaikutuksesta tekoälytutkimukseen ja teknologiateollisuuteen.",
      "Jotkut asiantuntijat ehdottavat, että Meta on ohittamassa Googlen tekoälyn edistysaskeleissa ja yhteisöllisissä panoksissa, mikä voisi johtaa uusiin innovaatioihin ja liiketoiminta-arvoon.",
      "Keskustelu sisältää myös Metan avoimen lähdekoodin ponnistelut ja tekoälyteknologian laajemmat vaikutukset sekä suurten teknologiayritysten välisen kilpailudynamiikan."
    ],
    "points": 264,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1722404557
  },
  {
    "id": 41114825,
    "title": "Luovuus pohjimmiltaan kumpuaa muistamisesta",
    "originLink": "https://shwin.co/blog/creativity-fundamentally-comes-from-memorization",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114825",
    "commentBody": "",
    "originSummary": [
      "Kirjoittajan mukaan järjestelmien soveltaminen luoviin pyrkimyksiin, kuten DJ-siirtymiin ja huumorikuvioihin, lisää luovuutta sisäistämällä tietoa ja malleja.",
      "He kannattavat oppimismenetelmää, joka sisältää kaavojen ulkoa opettelua ja altistumista erilaisille tapauksille, mikä voidaan soveltaa akateemisen maailman ulkopuolelle, kuten urheiluun ja myyntiin.",
      "Kirjoittaja ehdottaa, että perusteiden hallitseminen järjestelmien avulla mahdollistaa korkeamman tason innovaation ja luovuuden, kuten nähdään startup-yritysten ja musiikin alojen asiantuntijuudessa."
    ],
    "commentSummary": [
      "Luovuus yhdistetään usein sisäistettyyn tietoon, joka voi olla seurausta ulkoa oppimisesta.",
      "On käynnissä keskustelu siitä, onko ulkoa opettelu välttämätöntä luovuudelle, ja jotkut väittävät ymmärryksen ja kontekstin olevan tärkeämpiä kuin pelkkä toisto.",
      "Konseptien sisäistäminen toistuvan altistumisen kautta voi auttaa kehittämään heuristiikkoja ja malleja, jotka ovat hyödyllisiä luovissa sovelluksissa."
    ],
    "points": 255,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1722379044
  },
  {
    "id": 41114569,
    "title": "Vianmääritys: Terminaalin viive",
    "originLink": "https://lock.cmpxchg8b.com/slowterm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114569",
    "commentBody": "",
    "originSummary": [
      "Windows 11 -koneella xterm-ohjelman avaaminen aiheutti merkittävää viivettä verrattuna Fedora Linux -työasemaan, ja Windowsilla avautuminen kesti aluksi noin 1600 ms.",
      "Profilointi ja virheenkorjaus paljastivat, että ikkunatehosteiden ja tiettyjen xterm-ominaisuuksien, kuten työkalupalkin ja Tektronix-emuloinnin, poistaminen käytöstä paransi suorituskykyä.",
      "Palvelintilan toteuttaminen viivästetyllä kartoituksella käyttäen LD_PRELOAD-kirjastoa vähensi käynnistysajan noin 366 millisekuntiin Windowsilla, tehden siitä lähes yhtä nopean kuin Fedorassa."
    ],
    "commentSummary": [
      "Artikkeli käsittelee terminaalin viiveen vianmääritystä, erityisesti keskittyen Microsoft Console Debuggeriin (cdb) ja sen komentoihin, joilla voidaan muokata funktioiden käyttäytymistä.",
      "Se korostaa `eb win32u!NtUserSetLayeredWindowAttributes c3` -komennon käyttöä toiminnon poistamiseksi käytöstä korvaamalla sen ensimmäinen tavu `ret`-käskyllä, jolloin se palauttaa välittömästi.",
      "Keskustelu sisältää erilaisia käyttäjäkokemuksia ja menetelmiä terminaalin käynnistysajan mittaamiseen ja vähentämiseen, kuten `hyperfine`-vertailutyökalun ja erilaisten terminaaliemulaattoreiden käyttöä."
    ],
    "points": 188,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722377079
  },
  {
    "id": 41116639,
    "title": "Rustgo: Rustin kutsuminen Go:sta lähes nollakustannuksilla (2017)",
    "originLink": "https://words.filippo.io/rustgo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116639",
    "commentBody": "",
    "originSummary": [
      "Kirjoitus tutkii Rustin kutsumista Go:sta korvaamaan assembly-koodia, pyrkien lähes nollakustannuksiin ilman syvällistä Rust- tai kääntäjäosaamista.",
      "Ruostetta valitaan sen korkean optimointikyvyn ja luettavuuden vuoksi verrattuna assemblyyn, ja lähestymistapa osoittaa parempaa suorituskykyä kuin cgo:n käyttö pienissä, kuumissa funktioissa.",
      "Vertailut osoittavat, että Rustin kutsuminen Go:sta on lähes yhtä nopeaa kuin Go:n natiivi funktiokutsu ja merkittävästi nopeampaa kuin cgo, mikä tekee siitä sopivan suorituskykyä vaativiin tehtäviin."
    ],
    "commentSummary": [
      "Rustgo on työkalu, joka mahdollistaa Rust-koodin kutsumisen Go:sta lähes nollakustannuksilla, mikä on merkittävää suorituskykyherkille sovelluksille.",
      "Keskustelu tuo esiin monimutkaisuudet ja mahdolliset sudenkuopat, jotka liittyvät Foreign Function Interfacen (FFI) käyttöön eri ohjelmointikielten, erityisesti Go:n ja Rustin, välillä.",
      "Vertailuja tehdään muihin kieliin, kuten C# ja Python, korostaen FFI-suorituskyvyn kompromisseja ja oikean työkalun valinnan tärkeyttä."
    ],
    "points": 173,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1722404613
  },
  {
    "id": 41120254,
    "title": "Pidän rST:stä enemmän kuin Markdownista",
    "originLink": "https://buttondown.email/hillelwayne/archive/why-i-prefer-rst-to-markdown/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41120254",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja on julkaissut \"Logic for Programmers v0.2\", joka sisältää epub-tuen, rajoitteiden ratkaisun ja muodollisen spesifikaation sisältöä.",
      "Kirjoittaja suosii reStructuredTextiä (rST) Markdownin sijaan sen paremman muokattavuuden ja laajennettavuuden vuoksi, mikä on erityisen hyödyllistä monimutkaisten dokumentointitarpeiden kannalta.",
      "Kirjaa varten luotiin mukautettu harjoituslaajennus rST:ssä käsittelemään erilaisia renderöintivaatimuksia HTML-, epub- ja PDF-muodoille."
    ],
    "commentSummary": [
      "reStructuredText (rST) on suosittu teknisten kirjojen kirjoittamiseen sen laajennettavuuden ja semanttisten ominaisuuksien vuoksi, erityisesti yhdistettynä Sphinxiin.",
      "Markdown on yksinkertaisempi ja helpommin luettava, mikä tekee siitä ihanteellisen nopeisiin muistiinpanoihin ja jokapäiväiseen dokumentointiin.",
      "rST:n ominaisuudet, kuten mukautetut tekstiobjektit ja taattu sisäisten linkkien ratkaisu, ovat ratkaisevan tärkeitä monimutkaisissa dokumentointiprojekteissa, mutta Markdownin yksinkertaisuus ja tuki tekevät siitä suositumman yleiskäytössä."
    ],
    "points": 172,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1722440995
  },
  {
    "id": 41115619,
    "title": "Call of Duty: Warzone Caldera -aineisto akateemiseen käyttöön",
    "originLink": "https://blog.activision.com/activision/2024/activision-releases-call-of-duty-warzone-caldera-data-set",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115619",
    "commentBody": "",
    "originSummary": [
      "Activision on julkaissut Call of Duty®: Warzone™ Caldera -datan akateemiseen käyttöön, kuten sivun metatiedoista käy ilmi.",
      "Julkaisu on merkittävä pelidatan analyysistä kiinnostuneille tutkijoille ja akateemikoille, ja se voi edistää uusia tutkimuksia ja oivalluksia pelialalla.",
      "Aineisto on saatavilla Activisionin blogin kautta, mikä korostaa yhtiön tukea akateemiselle tutkimukselle ja datan läpinäkyvyydelle."
    ],
    "commentSummary": [
      "Activision on julkaissut Call of Duty: Warzone Caldera -datan akateemiseen käyttöön GitHubissa, sisältäen pelitasojen aineistoja ja pelaajien liikkumistietoja.",
      "Datajoukko on hyödyllinen grafiikkatutkimuksessa, moottorikehityksessä, strategisten sijaintien määrittelyssä ja säteenseuranta-algoritmien testaamisessa, ja sillä on potentiaalisia sovelluksia tekoälyn kehityksessä ja huijausten havaitsemisessa.",
      "Julkaisua pidetään hyödyllisenä akateemisiin ja tutkimustarkoituksiin, vaikka jotkut näkevät sen rekrytointivälineenä sen ei-kaupallisen lisenssin vuoksi."
    ],
    "points": 159,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1722387969
  },
  {
    "id": 41114601,
    "title": "Staattisten binäärien rakentaminen Go:lla Linuxissa",
    "originLink": "https://eli.thegreenplace.net/2024/building-static-binaries-with-go-on-linux/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41114601",
    "commentBody": "",
    "originSummary": [
      "Go voi tuottaa staattisesti linkitettyjä binäärejä Unix-järjestelmissä, mutta se vaatii tiettyjä build-tageja tai cgo:n poistamista käytöstä.",
      "Työkalut kuten `file`, `ldd` ja `nm` voivat varmistaa, onko Go-binaari staattisesti linkitetty.",
      "Zig-kääntäjän käyttäminen C-kääntäjänä yksinkertaistaa prosessia ja tukee ristiinkääntämistä staattista linkitystä varten."
    ],
    "commentSummary": [
      "Staattisten binäärien rakentaminen Go:lla Linuxissa vaatii tiettyjä lippuja ja huomioita, kuten `-tags sqlite_omit_load_extension` käyttö SQLite:lle, jos laajennuksia ei käytetä.",
      "Keskustelussa korostetaan WebAssemblyn (WASM) käyttöä SQLite-tietokannassa, mikä tarjoaa paremman suorituskyvyn ja ylläpidettävyyden verrattuna perinteisiin menetelmiin, kuten modernc-transpilointiin.",
      "On olemassa haasteita ja suorituskykyongelmia, jotka liittyvät erilaisten allokaattoreiden ja libc-toteutusten, kuten musl, käyttöön staattisten Go-binaarien rakentamisessa, kuten Tailscale on kokenut."
    ],
    "points": 153,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1722377273
  },
  {
    "id": 41115591,
    "title": "Suprajohteiset mikroprosessorit? Osoittautuvat erittäin energiatehokkaiksi (2021)",
    "originLink": "https://spectrum.ieee.org/new-superconductor-microprocessor-yields-a-substantial-boost-in-efficiency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41115591",
    "commentBody": "",
    "originSummary": [
      "2,5 GHz:n suprajohtava mikroprosessoriprototyyppi on kehitetty, ja se käyttää 80 kertaa vähemmän energiaa kuin perinteiset puolijohdemikroprosessorit, vaikka jäähdytys otettaisiin huomioon.",
      "MANA-mikroprosessori, joka perustuu adiabaattiseen kvanttivirtaparametroni (AQFP) -teknologiaan, sisältää yli 20 000 suprajohtavaa Josephson-liitosta.",
      "Tämä on ensimmäinen adiabaattinen suprajohtava mikroprosessori, mikä merkitsee merkittävää edistysaskelta energiatehokkaassa tietotekniikassa."
    ],
    "commentSummary": [
      "Tutkijat Japanissa kehittävät erittäin tehokkaita suprajohtavia mikroprosessoreita, jotka toimivat adiabaattisesti, teoreettisesti välttäen energian häviön tai lisääntymisen laskennan aikana.",
      "Tämä teknologia haastaa Landauerin periaatteen, jonka mukaan tiedon poistaminen vaatii energiaa, käyttämällä käänteistä laskentaa erityisillä logiikkaporteilla, kuten Toffoli-portilla, minimoidakseen energiankulutuksen.",
      "Huolimatta lupaavasta tehokkuudestaan, käytännön toteutus kohtaa merkittäviä haasteita, erityisesti jäähdytyksessä ja skaalauksessa käytännön käyttöä varten, ja se vaatii edelleen energiaa alkuarvojen asettamiseen ja ympäristön melun hallintaan."
    ],
    "points": 136,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1722387626
  },
  {
    "id": 41119874,
    "title": "Miksi CrowdStrike-virhe iski pankkeihin kovaa",
    "originLink": "https://www.bitsaboutmoney.com/archive/crowdstrike-bug-hit-banks-hard/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41119874",
    "commentBody": "",
    "originSummary": [
      "Heinäkuun 19. päivänä CrowdStrike Falcon -ohjelmiston, päätepisteiden valvontaohjelmiston, konfiguraatiovirhe aiheutti katastrofaalisia vikoja Windows-järjestelmissä, mikä vaikutti vakavasti pankkisektoriin ja muihin teollisuudenaloihin.",
      "Vika johti laajoihin toiminnallisiin häiriöihin, mukaan lukien kassanhoitajien ja pankkiirien joutuminen toimettomiksi, ja aiheutti jopa joidenkin pankkien käteisvarojen loppumisen, mikä korosti rahoitusinfrastruktuurin haavoittuvuuksia.",
      "Yhdysvaltain pankkivalvojat vaikuttivat epäsuorasti tällaisten turvatyökalujen käyttöönottoon, jotka, vaikka ne on tarkoitettu suojaukseen, voivat tuoda merkittäviä haavoittuvuuksia korkean käyttöoikeustasonsa ja laajan käytön vuoksi."
    ],
    "commentSummary": [
      "Virhe CrowdStrikessa aiheutti merkittäviä häiriöitä pankeissa automaattisen päivityksen vuoksi, joka ohitti olemassa olevat valvontamekanismit.",
      "Tapauksen johdosta on syntynyt keskustelua yksittäisiin toimittajiin luottamisen riskeistä ja parempien päivitysstrategioiden tarpeesta.",
      "Huolimatta laajalle levinneistä ongelmista, jotkut käyttäjät kokivat vain vähäistä vaikutusta, mikä osoittaa tiettyjen järjestelmien kestävyyden."
    ],
    "points": 135,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1722438444
  },
  {
    "id": 41116253,
    "title": "AT&T Long Lines \"Cheshire\" maanalaisen kohteen rakentaminen",
    "originLink": "https://coldwar-ct.com/Home_Page_S1DO.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116253",
    "commentBody": "",
    "originSummary": [
      "Cheshiren ATT-laitos, joka rakennettiin vuonna 1966, on maanalainen kompleksi, joka on suunniteltu kriittisiä sotilasviestintätarkoituksia varten. Se sisältää vahvistetun analogisen L4-kantokaapelin ja AUTOVON 4-johtimisen kytkimen.",
      "Tilat sisältävät laajan infrastruktuurin ilman suodatukseen, sähkön tuotantoon ja räjähdyssuojaukseen, mikä varmistaa toiminnan jatkuvuuden ydinonnettomuuksien aikana.",
      "Sivusto toimi myös metropolialueen solmukohtana Hartfordille ja New Havenille, yhdistäen useisiin muihin kriittisiin viestintäreitteihin ja -laitoksiin."
    ],
    "commentSummary": [
      "AT&T Long Linesin \"Cheshire\" maanalainen kohde oli AUTOVON-kytkentäkeskus, joka rakennettiin kestämään ydinsodan käyttäen Western Electricin 1ESS-teknologiaa.",
      "Nämä keskukset sijaitsivat strategisesti kaukana suurista kaupungeista ja sotilaskohteista, ja niissä oli redundantit yhteydet, vahvistetut rakenteet sekä jäähdytys- ja saastumissuoja työntekijöille.",
      "Infrastruktuuri, joka kehitettiin kylmän sodan aikana, sisälsi laajoja mikroaaltopisteiden välisiä yhteyksiä ja käytti sekä 1ESS- että Number 5 Crossbar -kytkimiä, mikä korostaa sen kestävyyttä ja monimutkaisuutta."
    ],
    "points": 124,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1722397662
  },
  {
    "id": 41119080,
    "title": "Kuinka merkittävä oli suuri hapettumistapahtuma?",
    "originLink": "https://eos.org/science-updates/how-great-was-the-great-oxidation-event",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41119080",
    "commentBody": "",
    "originSummary": [
      "Tutkijat eivät ole varmoja, milloin Maan ilmakehässä oli tarpeeksi happea varhaisen eläinelämän tukemiseen, huolimatta laajasta tutkimuksesta.",
      "Uudet löydökset Rio Tintosta, Espanjasta, viittaavat siihen, että riittävästi happea eläinten evoluutiolle saattoi olla läsnä lähes 2 miljardia vuotta ennen eläinten ilmestymistä.",
      "Viimeaikaiset tutkimukset osoittavat, että vaihtelevat valtameren happitasot, ruoan niukkuus tai geneettinen kehitysaika, pikemminkin kuin happitasot, saattavat olla syynä eläinten evoluution viivästymiseen."
    ],
    "commentSummary": [
      "Suuri hapettumistapahtuma (GOE) merkitsi merkittävää nousua Maan ilmakehän hapessa fotosynteettisten mikrobien ansiosta vähintään 400 miljoonan vuoden ajan.",
      "Tämä hapen lisääntyminen mahdollisti monimutkaisten elämänmuotojen kehittymisen ja tulen mahdollisuuden, mutta aiheutti anaerobisten eliöiden joukkosukupuuton.",
      "GOE on ratkaisevan tärkeä astrobiologialle, sillä korkeat happitasot eksoplaneetoilla voivat viitata mahdolliseen biologiseen aktiivisuuteen, ja jatkuva tutkimus tarkentaa jatkuvasti ymmärrystämme."
    ],
    "points": 119,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1722433249
  },
  {
    "id": 41116414,
    "title": "FakeTraveler: Väärennä puhelimesi sijainti (Mock location Androidille)",
    "originLink": "https://github.com/mcastillof/FakeTraveler",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41116414",
    "commentBody": "",
    "originSummary": [
      "FakeTraveler on Android-sovellus, joka mahdollistaa käyttäjien puhelimen sijainnin väärentämisen yksityisyyden suojaamiseksi tai sovellusten testaustarkoituksiin.",
      "Kayttäjät voivat valita sijainnin kartan avulla tai syöttää tietyt leveys- ja pituusasteen koordinaatit, ja sitten soveltaa muutoksia.",
      "FakeTravelerin käyttämiseksi käyttäjien on otettava käyttöön Kehittäjäasetukset ja asetettava FakeTraveler sijaintihuijaussovellukseksi."
    ],
    "commentSummary": [
      "FakeTraveler on Android-sovellus, joka mahdollistaa käyttäjien puhelimen sijainnin väärentämisen.",
      "Sovellus on avoimen lähdekoodin ja saatavilla F-Droidissa, joka on ilmaisia ja avoimen lähdekoodin Android-sovelluksia tarjoava arkisto.",
      "Huolimatta sen toiminnallisuudesta, jotkut käyttäjät huomauttavat, että se ei välttämättä ohita tiettyjä sovellusrajoituksia, kuten pankkisovelluksissa tai Pokémon Go:ssa, ilman lisätoimenpiteitä, kuten laitteen roottausta."
    ],
    "points": 109,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1722400215
  }
]
