[
  {
    "id": 41623467,
    "title": "저는 디터 람스에서 영감을 받은 아이폰 도크를 디자인했습니다",
    "originLink": "https://arslan.io/2024/09/23/dieter-rams-inspired-iphone-dock/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41623467",
    "commentBody": "",
    "originSummary": [
      "저자는 빈티지 브라운 알람 시계와 현대적인 BC21 시계에서 영감을 받아 디터 람스 스타일의 아이폰 도크를 디자인했습니다.",
      "여러 차례의 반복과 피드백을 거친 후, 최종 디자인은 트레이, 충전기, 시계를 하나의 유닛으로 결합하여 브라운의 550 헤어 드라이어를 연상시킵니다.",
      "3D 모델은 무료로 공유되며, Gumroad에서 기부 옵션이 제공됩니다."
    ],
    "commentSummary": [
      "디터 람스에서 영감을 받은 아이폰 도크가 한 사용자가 디자인하여 공유했으며, 해당 모델은 Gumroad에서 무료로 다운로드할 수 있습니다.",
      "도크는 MagSafe 충전기를 특징으로 하며, 휴대폰을 쉽게 제거할 수 있도록 구멍이 있습니다. 그러나 각 iPhone 크기는 고정된 MagSafe 부분 때문에 맞춤형 재설계가 필요합니다.",
      "디자이너는 eSun PLA+ 필라멘트를 사용한 Bambulab X1C 3D 프린터를 사용했으며, 도크는 사용 중에도 전화기를 충전할 수 있습니다."
    ],
    "points": 648,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1727077886
  },
  {
    "id": 41620198,
    "title": "브레인퍽 엔터프라이즈 솔루션즈",
    "originLink": "https://github.com/bf-enterprise-solutions",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41620198",
    "commentBody": "",
    "originSummary": [
      "Brainfuck Enterprise Solutions (BES)는 Brainfuck 프로그래밍 언어를 사용한 현대 소프트웨어 개발을 전문으로 합니다.",
      "주요 제품으로는 OS.bf(운영 체제), ed.bf(텍스트 편집기), meta.bf(메타순환 평가기), 그리고 str.bf(문자열 조작 라이브러리)가 있습니다.",
      "다가오는 제품들은 비동기 웹 서버, 신뢰할 수 있는 키-값 저장소, 그리고 머신 러닝 프레임워크를 특징으로 하며, 이는 그들의 제공 범위가 크게 확장될 것임을 나타냅니다."
    ],
    "commentSummary": [
      "Brainfuck은 종종 농담으로 여겨지지만, arXiv에 게재된 최근 논문에서 강조된 바와 같이 그 단순성 때문에 특정 연구에서 가치가 있습니다.",
      "토론에는 Brainfuck을 기업 솔루션에 통합하는 것에 대한 다양한 유머러스하고 진지한 견해가 포함되어 있으며, 일부는 법적 문제를 피하기 위해 대체 이름을 제안하기도 합니다.",
      "그 게시물은 기술적 논의와 가벼운 농담이 어우러져 프로그래밍 커뮤니티의 독특한 문화를 반영하기 때문에 많은 관심을 끌고 있습니다."
    ],
    "points": 477,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1727040247
  },
  {
    "id": 41622632,
    "title": "이 카페의 QR 코드 메뉴 안에는 무엇이 있나요?",
    "originLink": "https://peabee.substack.com/p/whats-inside-the-qr-code-menu-at",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41622632",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "카페의 QR 코드 메뉴 시스템의 취약점으로 인해 고객 및 재무 데이터에 대한 무단 접근이 가능해져 윤리적 공개 관행에 대한 논쟁이 촉발되었습니다.",
      "저자는 회사에 먼저 알리지 않고 취약점을 공개적으로 공개하여 비공개 공개와 공개 공개 중 어느 것이 더 적절한지에 대한 논의를 불러일으켰다.",
      "게시물이 법적 문제로 인해 삭제된 것으로 보이며, 논의에서는 디지털 메뉴와 전통적인 종이 메뉴의 장단점도 강조되었습니다."
    ],
    "points": 434,
    "commentCount": 291,
    "retryCount": 0,
    "time": 1727069625
  },
  {
    "id": 41620304,
    "title": "우버는 계정에 크레딧이 있으면 더 많이 청구합니다",
    "originLink": "https://viewfromthewing.com/uber-caught-overcharging-how-having-credits-in-your-account-might-be-costing-you/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41620304",
    "commentBody": "",
    "originSummary": [
      "사용자들은 아메리칸 익스프레스나 우버 기프트 카드와 같은 크레딧을 사용할 때 우버 요금이 현금으로 지불할 때보다 더 높게 나타난다고 보고했습니다.",
      "예를 들어, $20의 요금이 크레딧이 적용되면 $30로 증가하는 경우가 있으며, 동일한 요금이 크레딧이 없는 다른 전화에서는 $20로 유지됩니다.",
      "이는 우버가 크레딧을 가진 사용자들에게 더 높은 요금을 실험하고 있을 가능성을 시사하며, 과도한 요금 부과에 대한 우려를 불러일으킵니다."
    ],
    "commentSummary": [
      "사용자 계정에 크레딧이 있는 경우 우버가 더 많은 요금을 부과한다는 주장이 제기되어 큰 논란과 토론을 불러일으켰습니다.",
      "일화적인 증거에 따르면, 크레딧을 가진 사용자가 그렇지 않은 사용자에 비해 더 높은 가격을 볼 수 있다는 주장이 있지만, 이는 아직 검증되지 않았고 논란의 여지가 있습니다.",
      "이 주제는 우버의 가격 책정 알고리즘과 사용자 신뢰에 미칠 잠재적 영향으로 인해 주목받고 있으며, 승차 공유 서비스의 투명성과 공정성에 대한 우려를 부각시키고 있습니다."
    ],
    "points": 405,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1727041088
  },
  {
    "id": 41623251,
    "title": "아이폰 16의 전기적으로 방출되는 접착제 작동 방식",
    "originLink": "https://www.ifixit.com/News/100352/we-hot-wired-the-iphone-16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41623251",
    "commentBody": "",
    "originSummary": [
      "아이폰 16은 전기 전류로 분리되는 새로운 배터리 접착제, 프로 모델을 위한 단단한 강철 배터리 케이스, 그리고 더 쉬운 수리를 위한 이중 진입 디자인을 포함하여 중요한 수리 용이성 개선 사항을 도입합니다.",
      "iOS 18의 수리 도우미는 부품 페어링 소프트웨어 장벽을 제거하여 부품 페어링 및 보정을 원활하게 만드는 것을 목표로 합니다.",
      "아이폰 16은 더 나아진 수리 매뉴얼, 새로운 배터리 절차, 그리고 이중 진입 디자인 덕분에 작년보다 개선된 10점 만점에 7점의 수리 용이성 점수를 받았습니다."
    ],
    "commentSummary": [
      "아이폰 16은 전기적으로 분리되는 접착제를 도입하여 배터리 제거를 더 쉽게 하고 수리를 간소화했다고 iFixit에서 칭찬했습니다.",
      "이러한 혁신에도 불구하고, 일부 사용자들은 애플의 수리 용이성 점수 7/10이 높은 부품 비용과 제3자 부품에 대한 제한 때문에 오해의 소지가 있다고 주장합니다.",
      "수리 가능성의 더 넓은 의미는 DIY 수리에 대한 경제적 및 실질적 도전 과제를 포함하며, 더 접근 가능하고 저렴한 수리 옵션의 필요성에 대한 지속적인 논쟁을 포함합니다."
    ],
    "points": 381,
    "commentCount": 182,
    "retryCount": 0,
    "time": 1727075914
  },
  {
    "id": 41621020,
    "title": "런던은 초저배출구역의 놀라운 혜택을 보았다: 더 활동적인 아이들",
    "originLink": "https://grist.org/cities/london-fining-polluting-cars-more-active-kids/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41621020",
    "commentBody": "",
    "originSummary": [
      "도시에서 배출량이 높은 차량을 제한하면 공기가 더 깨끗해지고 거리가 조용해져, 유럽 전역의 300개 이상의 지역에서 청정 공기 구역이 조성되고 있습니다.",
      "런던의 초저배출구역은 케임브리지 대학교와 퀸 메리 대학교의 연구에 따르면 5명 중 2명의 학생들이 학교에 걸어가거나 자전거를 타고 가도록 전환하게 하여, 어린이들의 건강과 학업 성과에 긍정적인 영향을 미쳤습니다.",
      "미국에서 이러한 구역을 복제하는 것은 법적 도전에 직면하지만, 걷기와 자전거 타기를 위한 인프라를 개선하고 자동차 여행을 억제하는 것이 효과적인 전략이 될 수 있습니다."
    ],
    "commentSummary": [
      "런던의 초저배출구역(ULEZ)은 자동차 교통량 감소로 인해 걷기와 자전거 타기 조건이 안전해져 더 많은 아이들이 활동적으로 변하게 되었습니다.",
      "이 이니셔티브는 네덜란드의 성공적인 모델에서 영감을 받아 도로 안전을 개선하고 자동차 사용을 줄이기 위한 더 넓은 도시 계획 노력의 일환입니다.",
      "저소득 주민들에게 불균형적으로 영향을 미친다는 비판에도 불구하고, ULEZ는 깨끗한 공기와 어린이들의 신체 활동 증가에 기여하여 신중한 도시 설계의 가치를 강조하고 있습니다."
    ],
    "points": 313,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1727048188
  },
  {
    "id": 41622640,
    "title": "원격 근무에 대한 전쟁은 생산성과는 아무런 관련이 없다",
    "originLink": "https://www.the-sentinel-intelligence.com/p/heres-why-they-want-you-back-at-the-office-so-bad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41622640",
    "commentBody": "",
    "originSummary": [
      "CEO들과 주류 언론은 생산성 문제를 이유로 사무실 복귀를 주장하지만, 근본적인 문제는 빈 사무실 건물에 대한 부채입니다.",
      "원격 근무는 직원들에게 더 적은 방해 요소와 더 나은 일과 삶의 균형을 제공하여 생산성이 동등하게 높다는 것이 입증되었습니다.",
      "사무실로 복귀하려는 압박은 상업용 부동산의 금융 위기로 인해 촉발되었으며, 사무실 건물에 대한 1.2조 달러의 대출이 위험에 처해 있어 더 광범위한 금융 불안정으로 이어질 가능성이 있습니다."
    ],
    "commentSummary": [
      "원격 근무에 대한 논쟁은 생산성을 넘어 부동산 가치, 직원 이직률, 심리적 역학과 같은 요소들을 포함합니다.",
      "아마존과 같은 회사들은 통제, 영향력, 그리고 도심의 활기를 유지하기 위한 우려로 인해 사무실 복귀를 지지하고 있습니다.",
      "사무실 복귀 정책에 대한 동기는 회사와 리더들마다 크게 다릅니다."
    ],
    "points": 248,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1727069754
  },
  {
    "id": 41625903,
    "title": "Cloudflare의 새로운 마켓플레이스는 웹사이트가 AI 봇에게 스크래핑 요금을 부과할 수 있게 합니다",
    "originLink": "https://techcrunch.com/2024/09/23/cloudflares-new-marketplace-lets-websites-charge-ai-bots-for-scraping/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41625903",
    "commentBody": "",
    "originSummary": [
      "Cloudflare는 웹사이트 소유자가 AI 모델 제공업체에 자신의 콘텐츠를 스크랩할 수 있는 접근 권한을 판매할 수 있는 마켓플레이스를 내년에 출시하여 출판사들이 AI 봇에 대한 더 많은 통제권을 가질 수 있도록 할 예정입니다.",
      "이 이니셔티브에는 AI 봇을 모니터링하고 차단하는 무료 도구인 AI 감사가 포함되어 있으며, 이는 웹사이트 소유자가 무단 스크래핑을 관리하는 데 도움을 줍니다.",
      "이 마켓플레이스는 AI 제공업체와의 거래를 통해 소규모 출판사들이 콘텐츠를 수익화할 수 있도록 돕고, 보상받지 못한 콘텐츠 스크래핑이 트래픽과 수익에 미치는 영향을 해결하는 것을 목표로 합니다."
    ],
    "commentSummary": [
      "클라우드플레어는 웹사이트가 AI 봇에게 스크래핑에 대한 요금을 부과할 수 있는 마켓플레이스를 도입하여 보상 없이 자원 소비 문제를 해결했습니다.",
      "이 이니셔티브는 웹 접근의 미래에 대한 우려를 제기하며, 콘텐츠 접근을 지불할 수 있는 사람들로 제한할 가능성이 있어 봇과 인간 모두에게 영향을 미칠 수 있습니다.",
      "사용자들은 특히 프라이버시 도구나 비표준 브라우저를 사용할 때 캡차와 접근 제한으로 인해 더 많은 어려움을 겪고 있으며, 이는 소규모 단체와 개인 사용자에게 불리할 수 있습니다."
    ],
    "points": 234,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1727098300
  },
  {
    "id": 41620955,
    "title": "저가형 CO2 센서 비교: 광음향식 vs. 비분산 적외선식 (NDIR)",
    "originLink": "https://www.airgradient.com/blog/co2-sensors-photo-acoustic-vs-ndir-updated/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41620955",
    "commentBody": "",
    "originSummary": [
      "이 기사는 NDIR(비분산 적외선) 센서와 광음향 센서의 두 가지 주요 CO2 센서를 비교하며, 이들의 성능 차이를 강조합니다.",
      "NDIR 센서, 예를 들어 SenseAir S8은 실내외 모두에서 정확하고 성능이 우수한 반면, Sensirion SCD40/41과 같은 광음향 센서는 더 작지만 환경 변화로 인해 실외 측정에서 어려움을 겪습니다.",
      "결론은 SenseAir S8이 모든 조건에서 신뢰할 수 있는 반면, Sensirion SCD4x는 실내 사용에만 가장 적합하다는 것을 시사합니다."
    ],
    "commentSummary": [
      "이 논의는 실내 공기질 모니터링을 위한 저가 CO2 센서, 특히 광음향 및 비분산 적외선(NDIR) 기술을 비교합니다.",
      "사용자들은 Aranet4와 AirGradient 같은 센서에 대한 경험을 공유하며, 일부는 Senseair S8과 같은 부품을 사용한 DIY 옵션을 제안합니다.",
      "이 대화는 인지 기능을 위한 정확한 CO2 모니터링의 중요성과 COVID-19 위험의 대리 지표로서의 중요성을 강조하며, 오픈 소스 모델과 긴 배터리 수명을 선호하는 점을 언급하고 있습니다."
    ],
    "points": 211,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1727047474
  },
  {
    "id": 41619808,
    "title": "Valve는 인기 게임에 대한 ARM64 지원을 테스트하고 있습니다",
    "originLink": "https://www.notebookcheck.net/Valve-is-testing-ARM64-support-for-popular-games-sparking-speculations-about-new-future-hardware.891851.0.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41619808",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Valve는 인기 있는 게임에 대한 ARM64 지원을 테스트하고 있으며, 이는 독립형 VR 헤드셋인 Deckard를 위한 것으로 보입니다. 이는 기존 Steam 라이브러리와의 호환성을 향상시킬 수 있습니다.",
      "이 조치는 새로운 Steam Deck과 같은 향후 ARM 기반 장치, ARM 크롬북 및 ARM 기반 Mac을 지원하기 위한 준비일 수도 있습니다.",
      "더 넓은 목표는 x86 아키텍처에 대한 의존도를 줄이고, 더 다재다능한 게임 하드웨어를 목표로 하는 것으로 보입니다."
    ],
    "points": 177,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1727037051
  },
  {
    "id": 41620002,
    "title": "커피 통계 – 카페인 섭취를 최대화하고 밤에 잠자리에 들기",
    "originLink": "https://github.com/Eliya-G/coffee-o-clock",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41620002",
    "commentBody": "",
    "originSummary": [
      "이 프로젝트는 사용자가 취침 시 카페인 수치에 대한 통계를 제공하여 또 한 잔의 커피를 마셔야 할지 결정하는 데 도움을 줍니다.",
      "사용자가 카페인 양과 수면 시간을 맞춤 입력할 수 있으며, Python 3.12.5와 호환됩니다.",
      "컴파일된 Windows 릴리스는 사용자가 건강하고, 일반적인 유전자를 가지고 있으며, 카페인 내성을 알고 있다는 가정 하에 다운로드할 수 있습니다."
    ],
    "commentSummary": [
      "카페인 대사 유형을 결정하려면 Nebula.org를 통해 유전체를 시퀀싱하고 Genetic Life Hacks를 사용하여 데이터를 분석할 수 있습니다.",
      "네뷸라.org는 익명으로 유전체 시퀀싱을 제공하며, Genetic Life Hacks는 CYP1A2 유전자를 통해 당신의 대사 유형을 확인할 수 있는 지역 분석을 제공합니다.",
      "또한, 23andMe는 '카페인 소비' 보고서를 제공하며, 실용적인 테스트로는 카페인 섭취 전후의 혈압을 측정하여 얼마나 빨리 정상으로 돌아오는지를 관찰하는 방법이 있습니다."
    ],
    "points": 158,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1727038567
  },
  {
    "id": 41621680,
    "title": "이더넷을 통한 테슬라 전송 프로토콜 (TTPoE)",
    "originLink": "https://github.com/teslamotors/ttpoe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41621680",
    "commentBody": "",
    "originSummary": [
      "HotChips 2024에서 테슬라는 이더넷을 통한 테슬라 전송 프로토콜(TTPoE)의 오픈 소스화와 AI, ML, 데이터 센터를 위한 새로운 고속/저지연 패브릭을 표준화하기 위해 울트라 이더넷 컨소시엄(UEC)에 가입했다고 발표했습니다.",
      "TCP와 유사하게 TTPoE는 패킷 손실과 재전송에도 불구하고 완전한 데이터 전송을 보장하며, CPU나 운영체제를 필요로 하지 않고 전적으로 하드웨어에서 작동합니다. 이는 처음에 테슬라 도조 v1에 배포되었습니다.",
      "GitHub 저장소에는 TTPoE 전송 헤더, 사양 세부 정보, Linux 커널 소프트웨어 모델, 단위 테스트, 패킷 생성 유틸리티 및 프로토콜의 기능을 보여주는 예제 세션이 포함되어 있습니다."
    ],
    "commentSummary": [
      "이더넷을 통한 테슬라 전송 프로토콜(TTPoE)은 AI, 머신 러닝 및 데이터 센터에서 저지연 애플리케이션을 위해 TCP를 대체하는 것을 목표로 하며, 높은 성능과 분산 혼잡 제어를 약속합니다.",
      "비평가들은 TTPoE가 혁신성과 진지함이 부족하다고 주장하며, 특히 IPv4를 사용하기 때문에 이를 혁명적인 변화라기보다는 마케팅 전략으로 보는 경향이 있다.",
      "TTPoE는 Infiniband 및 RoCE와 같은 기존 프로토콜과 경쟁하며, GitHub에서 사용할 수 있지만 그 문서화와 실질적인 이점은 검토 중에 있습니다."
    ],
    "points": 155,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1727056073
  },
  {
    "id": 41628167,
    "title": "지능의 시대",
    "originLink": "https://ia.samaltman.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41628167",
    "commentBody": "",
    "originSummary": [
      "딥러닝에 의해 주도되는 AI의 발전은 전례 없는 문제 해결과 기회를 가능하게 하여, 의료 및 과학적 발견을 포함한 삶의 다양한 측면을 향상시킬 것입니다.",
      "미래 세대는 개인 가상 전문가와 튜터와 같은 AI 도구의 혜택을 받아 전 세계적인 번영과 삶의 질 향상을 누리게 될 것입니다.",
      "AI가 모든 사람에게 혜택을 주도록 하려면 컴퓨팅 자원을 풍부하고 저렴하게 만들고, 노동 시장을 현명하게 변화시키며 인간의 창의성을 증대시키는 것이 필요합니다."
    ],
    "commentSummary": [
      "샘 올트먼의 블로그 게시물이 AI의 미래에 대한 논쟁을 촉발했으며, 의견은 낙관적인 것부터 비판적인 것까지 다양합니다.",
      "비평가들은 AI 응용 프로그램이 의료 관리 조정과 같은 작업에 집중할 뿐, 체계적인 문제를 해결하지 못하는 상상력이 부족하다고 주장합니다.",
      "우려 사항에는 AI가 일자리를 대체할 가능성, 부유층에게 혜택이 집중될 가능성, 그리고 광범위한 접근성을 위해 상당한 에너지와 컴퓨팅 자원이 필요하다는 점이 포함됩니다."
    ],
    "points": 131,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1727110875
  },
  {
    "id": 41622419,
    "title": "앨런 튜링의 1950년 마크 I 전자 컴퓨터 매뉴얼 [pdf]",
    "originLink": "https://archive.computerhistory.org/resources/text/Knuth_Don_X4100/PDF_index/k-4-pdf/k-4-u2780-Manchester-Mark-I-manual.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41622419",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "앨런 튜링의 1950년 마크 I 전자 컴퓨터 매뉴얼은 현대의 명령어 집합 아키텍처(ISAs)에서 흔히 볼 수 있는 네 가지 명령어인 LZCNT, POPCNT, RDRAND, 그리고 RDTSC를 포함한 명령어 집합을 자세히 설명했습니다.",
      "이러한 명령어는 CDC와 Cray의 슈퍼컴퓨터를 제외한 후속 컴퓨터에서는 거의 사라졌으나, 현대 CPU에서는 다시 도입되었습니다.",
      "매뉴얼에는 'The hooter'라고 유머러스하게 불리는 가청 비프음을 생성하는 지침도 포함되어 있어 이러한 지침의 역사적 맥락과 진화를 보여줍니다."
    ],
    "points": 128,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1727066219
  },
  {
    "id": 41622653,
    "title": "자신의 물건을 공동 배치하는 끔찍한 방법",
    "originLink": "http://rachelbythebay.com/w/2024/09/22/colo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41622653",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "이 게시물은 보안과 비용 효율성을 강조하며, 콜로케이션 서버를 설정하고 관리하는 모범 사례와 개인적인 경험에 대해 논의합니다.",
      "주요 권장 사항에는 SSH에 대한 비밀번호 접근을 비활성화하고, Hetzner와 같은 전용 서버 제공업체를 사용하며, IPMI/BMC와 같은 적절한 원격 관리 도구를 갖추는 것이 포함됩니다.",
      "대화는 신뢰할 수 있는 데이터 센터를 찾는 것의 중요성, 클라우드 서비스보다 하드웨어를 임대하는 것의 이점, 그리고 물리적 서버 관리를 위한 실용적인 팁을 강조합니다."
    ],
    "points": 119,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1727069972
  }
]
