[
  {
    "title": "Lunit Approved to Acquire Volpara: AI Expansion in Healthcare",
    "originLink": "https://www.auntminnie.com/imaging-informatics/artificial-intelligence/article/15666254/lunit-gets-nod-in-bid-to-acquire-volpara",
    "originBody": "IMAGING INFORMATICS ARTIFICIAL INTELLIGENCE Lunit gets nod in bid to acquire Volpara AuntMinnie.com staff writers Mar 13, 2024 South Korean AI software developer Lunit has secured initial approval from the High Court of New Zealand for its bid to acquire Volpara Health Technologies. If the acquisition is endorsed by shareholders in an upcoming meeting on April 12, Lunit will proceed to acquire the entire shareholding at the agreed price, amounting to $292 million Australian dollars ($193 million U.S.), the company said. The finalization of the deal would be expected by May 2024, Lunit added. Based in New Zealand, Volpara is perhaps best known for its AI-based breast density assessment software. Latest in Artificial Intelligence AI flags rare humeral bone tumors on chest x-rays MARCH 13, 2024 Study calls for improvement of commercial AI algorithms MARCH 8, 2024 ECR: Radiographers optimistic about AI's role in future work MARCH 5, 2024 ECR: AI boosts junior radiologists' breast cancer detection metrics MARCH 4, 2024 Related Stories Artificial Intelligence Lunit secures two East and Southeast Asia contracts Artificial Intelligence Lunit to present studies at ECR 2024 Digital X-Ray Lunit enters supply contract with Samsung Electronics Artificial Intelligence Lunit bids for Volpara Health",
    "originSummary": [
      "Lunit, a South Korean AI software developer, is set to acquire Volpara Health Technologies, a New Zealand company famous for its AI-based breast density assessment software, pending shareholder approval.",
      "The acquisition, valued at $292 million Australian dollars, is expected to be completed by May 2024, showcasing Lunit's advancements in artificial intelligence and expansion into East and Southeast Asia.",
      "Lunit's presence in the AI field is further highlighted by its presentation of studies at the ECR 2024 conference."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  },
  {
    "title": "Lunit's Acquisition of Volpara Approved in New Zealand",
    "originLink": "https://www.kedglobal.com/artificial-intelligence/newsView/ked202403140005",
    "originBody": "Skip to content KOSPI 2718.76 +25.19 +0.94% KOSDAQ 887.52 -2.41 -0.27% KOSPI200 366.68 +3.64 +1.01% USD/KRW 1320.5 +4.5 +0.34% JPY100/KRW 892.56 +2.14 +0.24% EUR/KRW 1442.65 +1.96 +0.14% CNH/KRW 183.5 +0.53 +0.29% STOP View Market Snapshot KED Global - The Korea Economic Daily Global Edition Open Menu Search SIGN IN JOIN Companies Companies Home Latest on Korean Startups Future Unicorns Hidden Champions Branded Content Get It Made In Korea Companies A to Z Korean Investors Korean Investors Home Who's Who in Korean Investors Asset Owners Report Asset Managers' Perspectives Best Asset Managers by Korean Investors RFP Alert Deals M&A ECM/DCM Markets Culture & Trends Perspectives Hidden Champions Future Unicorns Open Menu Artificial intelligence Lunit gets court approval for Volpara acquisition in New Zealand New Zealand high court makes first-phase approval on Volpara acquisition plan, process expected to be finalized in May By Yena Kim 8 HOURS AGO 1 Min read yena@hankyung.com Most Read Korea, new darling of Maybach, Bentley, Rolls-Royce Lotte puts Lotte Chemical Titan in Malaysia on market S.Korea's LS Materials set to boost earnings ahead of IPO process MBK’s Michael ByungJu Kim: Most influential in Korea’s capital market Brookfield taps ARA Korea as preferred bidder for Conrad Seoul Related Articles Lunit to supply AI image analysis solutions to Samsung Electronics Lunit acquires NZ-based AI diagnostics firm Volpara Lunit selected as contractor for building medical AI platform in Singapore South Korean medical AI company Lunit announced on Thursday that it received the first approval from the High Court of New Zealand for its plan to acquire New Zealand-based AI breast cancer diagnostics solutions company Volpara Health Technologies. According to Lunit, the acquisition approval process of the New Zealand court consists of two main steps. The first step is the approval of the shareholders' meeting and the sale vote, and the second is to review the validity and effectiveness of the meeting results. Following approval for the acquisition investment from the New Zealand financial authorities last month, Volpara will hold a shareholders meeting on April 12. In December last year, Lunit signed a deal to acquire 100% of Volpara's shares for $193.1 million. Volpara was Established in 2009 in Wellington. It has specialized in breast cancer diagnostic AI platforms. Its products are used in more than 2,000 medical institutions, accounting for a third of the breast imaging screening facilities in the US. \"Volpara will contribute to Lunit's bid to build a super AI platform and secure sales in the United States,\" CEO of Lunit Suh Beom-Seok said. \"We expect to complete the acquisition by May.\" Write to Yena Kim at yena@hankyung.com #Lunit #Volpara Health Technologies #High Court of New Zealand #super AI platform More to Read Artificial intelligence Lunit to supply AI image analysis solutions to Samsung Electronics Jan 16, 2024 (Gmt+09:00) 1 Min read Bio & Pharma Lunit acquires NZ-based AI diagnostics firm Volpara Dec 14, 2023 (Gmt+09:00) 1 Min read Bio & Pharma Lunit selected as contractor for building medical AI platform in Singapore Dec 01, 2023 (Gmt+09:00) 1 Min read Artificial intelligence Lunit gets FDA approval for AI cancer diagnosis solution Nov 14, 2023 (Gmt+09:00) 1 Min read Bio & Pharma Lunit participates in US gov't Cancer Moonshot Nov 10, 2023 (Gmt+09:00) 1 Min read Comment 0 LOG IN 0/300 THE KOREA ECONOMIC DAILY GLOBAL EDITION BRANDED CONTENT Companies Companies Home Latest on Korean Startups Future Unicorns Hidden Champions Branded Content Get It Made In Korea Companies A to Z Korean Investors Korean Investors Home Who's Who in Korean Investors Asset Owners Report Asset Managers' Perspectives Best Asset Managers by Korean Investors RFP Alert Deals M&A ECM/DCM Markets Culture & Trends Perspectives Hidden Champions Future Unicorns Follow us Facebook Twitter Linkedin Family Site The Korea Economic Daily The Korea Economic TV The Korea Economic Daily Magazine Hankyung BP Ten Asia About us Help Center Contact us Advertise with KED Global Terms of Service Privacy Policy Copyright Policy Editorial Policy & Code of Practice Online newspaper registration No: 서울, 아53319 Date of registration: Oct 7 2020 Publisher: Park HaeyoungAddress: 13F The Korea Economic Daily Bldg., 463, Cheongpa-ro, Jung-gu, Seoul, Korea 04505Business registration No: 796-87-01625Contact: kedglobal@hankyung.com, +82-2-360-4319KED Global ENGKED Global 中文(Chinese)KED Global 日本語(Japanese)SitemapCompany listNews topic Copyright© 2023 KED Global News Network . All Rights reserved Cookies on KED Global We use cookies to provide the best user experience. By continuing to browse this website, you will be considered to accept cookies. Please review our Privacy Policy to learn our cookie policy. KED Global Privacy Policy Accept & continue KONOMY by the korea economic daily Close Menu SIGN IN JOIN Companies Companies Home Latest on Korean Startups Future Unicorns Hidden Champions Branded Content Get It Made In Korea Companies A to Z Korean Investors Deals Markets Culture & Trends Perspectives Hidden Champions Future Unicorns Follow us ×",
    "originSummary": [
      "Lunit, a South Korean medical AI company, has been authorized by the High Court of New Zealand to purchase Volpara Health Technologies, a New Zealand-based AI firm specializing in breast cancer diagnostics.",
      "The acquisition is progressing in two key phases, set to conclude by May, as Lunit intends to develop an advanced AI platform and enhance its market presence in the United States.",
      "This move signifies Lunit's strategic efforts to bolster its capabilities and geographical reach by acquiring an established player in the AI-driven healthcare sector."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  },
  {
    "title": "AI Enhances Pathologist Accuracy in Assessing Breast Cancer Subtypes",
    "originLink": "https://en.prnasia.com/releases/global/lunit-scope-ai-enhances-pathologist-concordance-and-accuracy-in-her2-er-and-pr-assessment-new-study-in-breast-cancer-research-439790.shtml",
    "originBody": "Languages 简体中文 繁體中文 English 日本語 한국어 Bahasa Indonesia Tiếng Việt Sign In Send a Release Products News Resources Contact Search Search Products News Resources Contact Overview Content Creation Distribution Monitoring & Insights Influencer Database Falcon All Products Send a Release News Products Resources Contact Overview Latest Regional Mainland China Japan Korea Indonesia Malaysia Singapore Thailand Vietnam Australia Industry Auto & Transportation Business Technology Consumer Products & Retail Consumer Technology Energy Entertainment & Media Environment Financial Services General Business Health Heavy Industry & Manufacturing Policy & Public Interest Sports Telecommunications Travel Food and Beverages Advertising, Marketing and Media Exhibition Real Estate and Furniture Trending Topics Earnings Artificial Intelligence Virtual Reality (VR) Co-Working Space Belt & Road Blockchain Investment & Financing Personnel Announcements World Economic Forum COVID-19 / Coronavirus Live Streaming New Technologies & New Products Web Summit Carbon Neutral China International Consumer Products Expo Biotech Summer Event Environmental, Social, Governance (ESG) RE+ 2023 UN Climate Change Conference (COP28) Lunar New Year Mobile World Congress (MWC) IFA 2023 Holiday Season Consumer Electronics Show (CES) Canton Fair Earth Day Fortune Global 500/ Fortune China 500 Asian Games China International Import Expo 5G International Women's Day Auto Shanghai 2023 World Environment Day Multimedia Other Languages Malaysian Thai Public Company News Send a Release Resources Products News Contact Overview Beyond PR Blog Media Coffee Client Stories White Papers Events in APAC Media Room Send a Release Contact Products Resources News Asia Pacific Offices Request More Information Alert / Newsletter Subscription Our Presence on Social Media Sites FAQs Send a Release Products News Resources Contact Send a Release Lunit SCOPE AI Enhances Pathologist Concordance and Accuracy in HER2, ER, and PR Assessment - New Study in Breast Cancer Research Lunit 2024-03-14 21:00 Share: - Lunit SCOPE HER2 and Lunit SCOPE ER/PR significantly improve pathologist concordance and accuracy, paving the way for improved breast cancer molecular subtype analysis for informed decision-making and precision patient care SEOUL, South Korea, March 14, 2024 /PRNewswire/ -- Lunit (KRX:328130.KQ), a leading provider of AI-powered solutions for cancer diagnostics and therapeutics, today announced the publication of a new study featuring Lunit SCOPE HER2 and Lunit SCOPE ER/PR, Lunit's AI-powered analyzer of human epidermal growth factor receptor 2 (HER2), estrogen receptor (ER), and progesterone receptor (PR). Lunit SCOPE The study, in collaboration with Prof. So-Woon Kim from Kyung Hee University College of Medicine and Prof. Minsun Jung from Yonsei University College of Medicine, was recently published in the Breast Cancer Research (BCR), an international peer-reviewed journal. The study aimed to evaluate the role of Lunit SCOPE in enhancing pathologists' consistency and accuracy of breast cancer molecular subtype classification, including expression levels of HER2, ER, and PR. Breast cancer treatment strategies and clinical outcome predictions heavily rely on the accurate determination of these receptors' expression levels. However, conventional immunohistochemistry (IHC) analysis poses challenges to classification accuracy. There can be variability in interpretation among pathologists, especially when dealing with intermediate expressions. The study highlights Lunit SCOPE HER2 and Lunit SCOPE ER/PR, developed using a dataset of thousands of HER2, ER, and PR-stained IHC breast cancer whole-slide images. An external validation cohort of 201 breast cancer cases underwent analysis using these AI analyzers. Results from the study demonstrated a significant increase in agreement among pathologists on the status of HER2, ER, and PR, especially in cases with intermediate weakly positive expressions. Notably, AI assistance led to an increase in agreement on HER2 status from 49.3% to 74.1%, ER from 93.0% to 96.5%, and PR from 84.6% to 91.5%. This improvement was particularly pronounced in intermediate weakly positive cases with HER2 2+ and HER2 1+, showing concordance increases from 46.2% to 68.4% and 26.5% to 70.7%, respectively. Consequently, with AI assistance, the agreement among pathologists in classification of breast cancer molecular subtypes saw an increase from 58.2% to 78.6%. The study concludes that Lunit SCOPE HER2 and Lunit SCOPE ER/PR significantly improve pathologists' concordance in classifying breast cancer molecular subtypes. These solutions hold immense potential in enhancing treatment strategies and ensuring more accurate and personalized approaches for patients. \"In this study, not only do we validate the performance of Lunit SCOPE HER2 and Lunit SCOPE ER/PR, but we also reveal the potential application of AI biomarkers in predicting treatment responses, particularly for HER2-targeted therapies. We also expect this breakthrough to open new avenues for future drug development,\" said Brandon Suh, CEO of Lunit. \"At Lunit, we enhance healthcare providers' accuracy and concordance, and we empower them to make informed decisions that directly impact patients' lives. Our mission is to transform the landscape of personalized cancer diagnostics and therapeutics.\" About Lunit Founded in 2013, Lunit is a deep learning-based medical AI company on a mission to conquer cancer. We are committed to harnessing AI to ensure accurate diagnosis and optimal treatment for each cancer patient using AI-powered medical image analytics and AI biomarkers. As a medical AI company grounded on clinical evidence, our findings are presented in major peer-reviewed journals, such as the Journal of Clinical Oncology and the Lancet Digital Health, and global conferences, including ASCO and RSNA. After receiving FDA clearance and the CE Mark, our flagship Lunit INSIGHT suite is clinically used in approximately 3,000+ hospitals and medical institutions across 40+ countries. Lunit is headquartered in Seoul, South Korea, with offices and representatives worldwide. For more information, please visit lunit.io. About Lunit SCOPE Lunit SCOPE is a suite of AI-powered software that analyzes tissue slide images for digital pathology and AI biomarker development, aiming to optimize workflow and facilitate more accurate and predictive clinical data for clinicians and researchers. Lunit SCOPE platform offers multiple AI-powered tissue analysis products and assays that can streamline digital pathology workflow and diagnostics and enhance the drug development process. Lunit SCOPE IO analyzes the tumor microenvironment (TME) based on H&E analysis and provides AI-based predictive clinical outcome information. In addition, AI-driven Immunohistochemistry (IHC) slide analysis services are offered through products such as Lunit SCOPE PD-L1, Lunit SCOPE HER2, Lunit SCOPE ER/PR, and others. Source: Lunit Related Stocks: Korea:328130 Keywords: Health Care/Hospital Medical/Pharmaceuticals Pharmaceuticals Share: Media Room more Update on Lunit's Acquisition of Volpara: New Zealand High Court Initial Approval Secured 2024-03-13 21:00 844 Lunit Presents Seven Study Results at ECR 2024: Showcasing AI's Robust Performance in Diverse Clinical Settings 2024-02-28 22:03 947 New Study Demonstrates Predictive Value of Lunit SCOPE IO to Predict Outcomes of Immune Checkpoint Inhibitor Therapy Across Diverse Tumors - published in the JITC 2024-02-16 22:03 2122 Lunit INSIGHT CXR Excels in Lung Nodule Detection - Exceptional Performance in Head-to-Head Study published in Radiology 2024-01-17 22:15 1292 Lunit AI Solutions to Power Samsung's X-ray Devices for Advanced Chest Screening 2024-01-16 22:04 1560 Lunit to Acquire Volpara: Scheme Implementation Agreement Signed 2023-12-14 22:05 1265 Related News Study of Kintor's c-Myc Degrader Published in Subsidiary Journal of Nature 2024-03-14 12:22 714 Alphamab Oncology to Present Clinical Data of JSKN003 for the Treatment of HER2-expressing Solid Tumors at AACR 2024 2024-03-14 08:39 854 Novel Molecules From Generative AI to Phase II: First Novel TNIK Inhibitors for Fibrotic Diseases Discovered and Designed Using Generative AI 2024-03-13 08:00 1271 Mabwell to Present Pre-clinical Results at the 2024 American Association for Cancer Research (AACR) Annual Meeting 2024-03-12 22:00 1027 Longbio Pharma Presented Positive Phase 1 Results for LP-003 at 2024AAD 2024-03-12 20:00 838 SK Biopharmaceuticals Announces 100,000 Patients Globally Have Been Treated with Cenobamate Through Sales of XCOPRI® and ONTOZRY® in the U.S., Europe, Israel, and Canada 2024-03-12 08:00 1238 Share： Share to wechat： Products Content Creation Distribution Monitoring & Insights Influencer Database Falcon All Products About PR Newswire About PR Newswire About Cision Careers Global Sites America Brazil Canada Czech Denmark Finland France Germany India Israel Italy Mexico Middle East Netherlands Norway Poland Portugal Russia Slovakia Spain Sweden United Kingdom Contact PR Newswire hkcs@prnasia.com Contact Us Asia Pacific Offices Request More Information Alert / Newsletter Our Presence on Social Media FAQs Legal Privacy Policy Information Security Policy Site Map RSS Cookie Settings Copyright © 2024 PR Newswire Asia Ltd. All Rights Reserved. Share toX",
    "originSummary": [
      "Lunit SCOPE AI enhances pathologists' accuracy in identifying breast cancer molecular subtypes, as per a study in Breast Cancer Research.",
      "Pathologists demonstrate substantial consensus on HER2, ER, and PR expression levels, particularly in cases with intermediate weakly positive expressions, aided by AI.",
      "AI support boosts agreement in classification, suggesting better treatment plans and personalized care options for patients, with Lunit specializing in cancer diagnostics through AI solutions like Lunit SCOPE AI."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  },
  {
    "title": "Lunit Secures Initial Approval for Volpara Acquisition",
    "originLink": "https://www.itnonline.com/content/lunit%C2%A0issues-update-acquisition-volpara-initial-approval-secured-new-zealand-high-court",
    "originBody": "Skip to main content Toolbar items Back to site Manage Administration menu Tools Index Flush all caches Flush CSS and JavaScript Flush plugins cache Flush render cache Flush routing and links cache Flush static cache Flush twig cache Flush views cache Rebuild theme registry Run cron Run updates Content Scheduled Add content 360 Photos Basic page Blog Author Blog Series Blog Case Study Company Comparison Charts Digital Whitepaper Emails with PDF Event Feature Gallery Issue Media Kit Video Migrate example - dates Multiple choice question News Podcast Premium Content Types Products Promo Quiz RSNA 2016 Branding Opportunities Select brightcove videos Technology Text Ad Videos Webform Webinar Whitepapers Comments Files Media Add media Audio Document Image Remote video Soundcloud Video Media library Newsletter Generator Create Newsletter Brightcove Videos Brightcove Playlists Commerce Orders Product attributes Products Promotions Configuration Store Currencies Stores Store types Products Product types Product variation types Payment Payment gateways Orders Order types Order item types Checkout flows Order settings Number patterns Structure Block layout Add custom block Block types Custom block library Comment types Default comments Manage fields Manage form display Manage display Delete Contact forms Add contact form Personal contact form Manage fields Manage form display Manage display Delete Website feedback Manage fields Manage form display Manage display Delete Content types Add content type All types 360 Photos Manage fields Manage form display Manage display Delete Basic page Manage fields Manage form display Manage display Delete Blog Author Manage fields Manage form display Manage display Delete Blog Series Manage fields Manage form display Manage display Delete Blog Manage fields Manage form display Manage display Delete Case Study Manage fields Manage form display Manage display Delete Company Manage fields Manage form display Manage display Delete Comparison Charts Manage fields Manage form display Manage display Delete Digital Whitepaper Manage fields Manage form display Manage display Delete Emails with PDF Manage fields Manage form display Manage display Delete Event Manage fields Manage form display Manage display Delete Feature Manage fields Manage form display Manage display Delete Gallery Manage fields Manage form display Manage display Delete Issue Manage fields Manage form display Manage display Delete Media Kit Video Manage fields Manage form display Manage display Delete Migrate example - dates Manage fields Manage form display Manage display Delete Multiple choice question Manage fields Manage form display Manage display Delete News Manage fields Manage form display Manage display Delete Podcast Manage fields Manage form display Manage display Delete RSNA 2016 Branding Opportunities Manage fields Manage form display Manage display Delete DFP Ad Tags Display modes Form modes Add form mode View modes Add view mode Entityqueues Homepage Slider Manage fields Manage form display Manage display Delete Media types Add media type Audio Manage fields Manage form display Manage display Delete Document Manage fields Manage form display Manage display Delete Image Manage fields Manage form display Manage display Delete Remote video Manage fields Manage form display Manage display Delete Soundcloud Manage fields Manage form display Manage display Delete Video Manage fields Manage form display Manage display Delete Menus Add menu Bottom Menu Add link Delete Eyebrow Menu Add link Delete Features Add link Delete Footer Add link Main menu Add link Management Add link Media Kit Menu Add link Delete Navigation Add link User menu Add link TB Mega Menu Taxonomy Add vocabulary Brightcove video tags Edit Manage fields Manage form display Manage display Delete Classification Edit Manage fields Manage form display Manage display Delete DFP Ad Categories Edit Manage fields Manage form display Manage display Delete Digital Pathology Edit Manage fields Manage form display Manage display Delete Font Designer Edit Manage fields Manage form display Manage display Delete Font Foundry Edit Manage fields Manage form display Manage display Delete Font Tags Edit Manage fields Manage form display Manage display Delete Languages Supported Edit Manage fields Manage form display Manage display Delete Product Categories Edit Manage fields Manage form display Manage display Delete Tags Edit Manage fields Manage form display Manage display Delete Views Add view Activity Archive Blog Entry Display Blog Series Blogs Philips RSS Blogs Brightcove Videos By API Client Brightcove Videos Brightcove video browser Bulk Node Delete Buyers Guide Cart block Cart form Carts CaseStudy Whitepaper Checkout order summary Comments Companies for Editing Company Display Company Merger Comparison Charts Content Display Content Feed Content Content by Author Coupons Custom block library Digital Whitepapers Events Files FontYourFace Font Manager Frontpage Gallery Image Gallery Main Gallery Glossary Home Page Slider Issues Media Kit VIdeos Media Media library Menu Blocks Native Ad Newsletter Generator Node Count Order items Orders Payments People Podcasts Products Profiles Promotions REST Issue Cover RSNA Recent comments Recent content Redirect 404 Redirect Related Content Scheduled content Stores Taxonomy Header Taxonomy term Technology Report Video Technology Report Technology Term Count Trending Now API User orders Video Company Videos For Editing Videos Webform submissions Webinar Content Display Webinars Who's new Who's online block promo form test test Webforms Forms Submissions Manage Purge Options Options Images Configuration Forms Elements Submissions Handlers Variants Exporters Libraries Advanced Add-ons Help Brightcove Video settings Brightcove Playlist settings Appearance Install new theme Settings Bartik Bootstrap Seven itn Update @font-your-face Browse Font display Settings Extend Install new module Uninstall module Update Configuration People Account settings Manage fields Manage form display Manage display CAPTCHA module settings CAPTCHA examples reCAPTCHA Profile types Customer Professional Information System Basic site settings EU Cookie Compliance Settings Categories Mail System SMTP Authentication Support Statistics Brightcove Cron Brightcove Subscriptions Brightcove proxy File metadata manager Google Tag Manager Wainscot Adops Cron Delete orphaned composite entities Content authoring Entity Print Entity browsers Font Awesome Settings Scheduler Text formats and editors Text editor embed buttons User interface Admin Toolbar Tools Admin Toolbar Module filter Shortcuts Sidr settings Development Performance Logging and errors Maintenance mode Configuration synchronization Import Export New Relic Media File system Image Effects Image styles Imce File Manager Media Library settings Media settings PhotoSwipe Responsive image styles Image toolkit Brightcove API Client FlexSlider Search and metadata Search pages URL aliases Metatag Settings URL redirects Add redirect Fix 404 pages Settings Regional and language Regional settings Date and time formats Newsletter Generator Google Ads Settings Newsletter Generator Omeda Settings Omeda Omeda Settings Omeda Manual Brand Comprehensive Lookup Video Settings Web services AddToAny CloudFlare RSS publishing Workflow Site Config Custom Excel Data Migrate Customize Sidebar Upload Files Content key value information Taxonomy key value information Extract Chart Visitor Data Remove extra space from content title Custom Content Migrate Site wide configuration Wainscot Commerce People Add user Permissions Profiles Roles Add role anonymous user Edit permissions authenticated user Edit permissions administrator Delete Edit permissions editor Delete Edit permissions charts Delete Edit permissions seo Delete Edit permissions Marketing Delete Edit permissions Designer Delete Edit permissions Image Uploader Delete Edit permissions advertiser Delete Edit permissions advertiseradmin Delete Edit permissions Reports Status report Available updates Brightcove Status Overview Comparison Charts - Reporting Field list Used in views Metatag plugins Redis Views plugins Webform plugins Help Adops Reports Email Campaigns Summary Report Transmission Report Engagement Report Videos Website Campaigns Taxonomy Vertical orientation Shortcuts User-defined shortcuts Create News Product Categories Add content Add content Edit shortcuts Edit Tour christine.book User account actions View profile Edit profile Log out Search this site Eyebrow Menu Magazine About Advertise Archive Contact Us ITN Awards Subscribe to magazine Subscribe to newsletters Photo Galleries Podcasts Comparison Charts Blogs Blogs Blog Series Calendar 360 Photos Case Studies Buyer's Guide Search this site Logout FDA COVID-19 Imaging 3-D Printing Angiography Computed Tomography (CT) Contrast media/injectors Digital Radiography (DR) Magnetic Resonance Imaging (MRI) Molecular Imaging Pediatric Imaging Radiation dose management Radiographic Fluoroscopy (RF) Ultrasound Imaging Information Technology Advanced visualization Analytics Software Archive/storage Artificial Intelligence Clinical decision support Digital Pathology Enterprise Imaging Flat panel displays Imaging software development PACS Population Health Remote viewing systems Teleradiology Vendor neutral archives (VNA) Women's Health Breast Biopsy Systems Breast Density Breast Imaging Breast MRI Ultrasound Women's Health Radiation Oncology Oncology information management systems (OIMS) Patient positioning/immobilization Proton Therapy Radiation therapy Treatment planning software/systems Video Webinars Conference Coverage AAPM ACC ACR AHRA AIMed ARRS ASTRO ECR HIMSS RSNA SBI SCCT SIIM SIR SNMMI If you enjoy this content, please share it with a colleague Email Facebook Twitter LinkedIn Share Primary tabs View(active tab) Edit Delete Revisions Entityqueue NewsRadiology BusinessMarch 13, 2024 Lunit Issues Update on Acquisition of Volpara with Initial Approval Secured from New Zealand High Court Lunit has announced a significant update on its acquisition of Volpara Health Technologies. Lunit, a South Korea-based artificial intelligence (AI) solution provider focused on cancer diagnostics and therapeutics, has announced a significant update on its acquisition of Volpara Health Technologies, the Wellington, New Zealand-based developer of AI-enabled software for personalized screening and early detection of breast cancer. An initial order from the High Court of New Zealand has been granted, and all necessary consents under New Zealand's Overseas Investment Act and Overseas Investment Regulations have been secured to facilitate the implementation of the Scheme. Image courtesy: Lunit March 13, 2024 — Lunit, a South Korea-based provider of AI-powered solutions for cancer diagnostics and therapeutics, has announced a significant update on its acquisition of Wellington, New Zealand-based Volpara Health Technologies Ltd., which provides AI-enabled software for personalized screening and early detection of breast cancer. An initial order from the High Court of New Zealand has been granted, and all necessary consents under New Zealand's Overseas Investment Act and Overseas Investment Regulations have been secured to facilitate the implementation of the Scheme. The initial order signals approval and mandates the upcoming shareholder meeting as the next step. Additional details released by Lunit in a written statement shared today follow. The Scheme, which involves Lunit acquiring all of Volpara's shares at a price of AUD 1.15 (USD 0.76) per share, is now set to progress to a shareholder meeting. Volpara shareholders are invited to attend the Scheme meeting scheduled for April 12, 2024. During this meeting, shareholders will cast their votes on the proposed acquisition. Should Volpara shareholders endorse the Scheme, Lunit will proceed to acquire the entire shareholding at the agreed price. This acquisition encompasses a total of 254 million shares, amounting to a substantial deal valued at about AUD 292 million (USD 193 million). The takeover is expected to be finalized by May 2024, marking a pivotal moment in Lunit's global expansion and commitment to conquer cancer through AI. \"We're pleased to announce the High Court's approval, a significant step in our remarkable journey. As we approach the final stage where Volpara's shareholders will cast their votes, I would also like to share that our funding for this acquisition is progressing seamlessly, ensuring everything is on track,\" said Brandon Suh, CEO of Lunit. Suh added, \"We are confident that the synergies between Lunit and Volpara will create a powerful force in advancing AI-driven solutions for the benefit of cancer care professionals and patients worldwide.\" The acquisition is poised to position Lunit as a leading force in the American market, leveraging Volpara's mammography solutions operational in over 2,000 U.S. medical sites. Additionally, Volpara's repository of over 100 million high-quality mammography images significantly contributes to enhancing Lunit's AI-powered solutions and laying the foundation for the development of autonomous AI models in the future. In its written statement, Lunit noted that after receiving FDA clearance and the CE Mark, its flagship Lunit INSIGHT suite is clinically used in approximately 3,000+ hospitals and medical institutions across 40+ countries. Lunit is headquartered in Seoul, South Korea, with offices and representatives worldwide. Volpara Health Technologies offers AI-powered image analysis enabling radiologists to quantify breast tissue with precision and helps technologists produce mammograms with optimal image quality. The company further notes that, in an industry facing increasing staff shortages, its software helps streamline operations and provides key performance insights that support continuous quality improvement. A Certified B Corporation, Volpara maintains the most rigorous security certifications and holds over 100 patents and numerous regulatory registrations, including FDA clearance and CE marking. Volpara is based in Wellington, New Zealand, with an office in Seattle, WA. More information: www.lunit.io, www.volparahealth.com Related content: Lunit to Acquire Volpara: Scheme Implementation Agreement Signed If you enjoy this content, please share it with a colleague Email Facebook Twitter LinkedIn Share Related Content NewsArtificial Intelligence ScreenPoint Medical Announces Deployment of Transpara Breast AI at Johns Hopkins to Improve Cancer Detection March 13, 2024 — ScreenPoint Medical has announced that its industry leading Transpara Breast AI is available to improve ... March 13, 2024 NewsHIMSS GE HealthCare and Biofourmis Collaborate on Virtual Care-at-Home Solutions March 12, 2024 — GE HealthCare and Biofourmis have announced a strategic collaboration aimed at enhancing continuity of ... March 12, 2024 NewsCybersecurity AMA Response to UnitedHealth Group Update on Change Healthcare Cyberattack March 8, 2024 — The following statement was issued by the American Medical Association (AMA) on behalf of Jesse M ... March 08, 2024 NewsHIMSS Deetptek.ai Showcases Chest X-ray AI solution, Augmento X-ray, at HIMSS 2024 March 8, 2024 — DeepTek.ai, a leading medical imaging AI company, will showcase its groundbreaking US FDA-cleared chest ... March 08, 2024 NewsInformation Technology Siemens Healthineers Launches Cinematic Reality App for Apple Vision Pro March 7, 2024 — Siemens Healthineers has launched an app designed for Apple Vision Pro that enables users such as ... March 07, 2024 NewsDigital Pathology Digital Pathology Provider Proscia Announces Pramana, Inc. Joins Partner Alliance Ahead of USCAP 2024 March 7, 2024 — Software company Proscia, a provider of digital and computational pathology solutions, has announced ... March 07, 2024 NewsPoint-of-Care Ultrasound (POCUS) Wellstar MCG Health Reports 47% Increase in Revenue Capture with Implementation of Exo Works Point-of-Care Ultrasound (POCUS) Software March 7, 2024 — Augusta, GA-based Wellstar MCG Health reported it has implemented Exo Works, a point-of-care ultrasound ... March 07, 2024 FeatureComputed Tomography (CT)By Melinda Taschetta-Millane The Evolving Computed Tomography Market Computed Tomography (CT) continues to be a rapidly evolving technology with many new advancements, as displayed and ... March 07, 2024 NewsCybersecurity As Cyberattack Jeopardizes Physician Practices, AMA Demands Action March 6, 2024 — As the cyber-takedown of Change Healthcare has forced medical practices to go without revenue for a ... March 06, 2024 FeatureRadiation OncologyBy Christine Book Practical Considerations for the Use of Artificial Intelligence in Radiation Oncology Appreciating the considerable advances in the clinical application of artificial intelligence (AI) within healthcare ... March 06, 2024 Webinars ON-DEMAND WEBINAR: Strategies to Optimize Imaging Performance to Save Time for Radiologists Read More Sponsored Content WEBINAR: Advanced Diagnostic Technology for Accurate Imaging Read More WEBINAR: Utilization of AI for Echocardiography Analysis and Outcome Prediction Read More See All Webinars Current Issue March/April 2024 Subscribe to Magazine Subscribe to Newsletters Issue Archives itnTV VIDEO: One on One with Hal Wolf, FHIMSS, HIMSS President and CEO See All Videos BLOGS Melinda Taschetta-Millane, Editorial Director Words We All Wanted to Hear: “RSNA is Back” Melinda Taschetta-Millane, Editorial Director RSNA23: Leading Through Change Melinda Taschetta-Millane, Editorial Director Reinforcing the Importance of Early Detection See All Blogs Comparison Charts Digital Breast Tomosynthesis Radiation Therapy Quality Assurance Platforms Artificial Intelligence Mobile DR Systems Cardiac CT Systems See All Comparison Charts Editorial Staff: Editorial Director Melinda Taschetta-Millane melinda.taschetta-millane@wainscotmedia.com P: 630-482-9932 Managing Editor Christine Book christine.book@wainscotmedia.com © Copyright Wainscot Media. All Rights Reserved. Bottom Menu Topics We Cover Glossary Advertise Contact Privacy Policy Cookie Policy Terms and Conditions Subscribe Now × E-newsletter Subscription form FDA COVID-19 Imaging 3-D Printing Angiography Computed Tomography (CT) Contrast media/injectors Digital Radiography (DR) Magnetic Resonance Imaging (MRI) Molecular Imaging Pediatric Imaging Radiation dose management Radiographic Fluoroscopy (RF) Ultrasound Imaging Information Technology Advanced visualization Analytics Software Archive/storage Artificial Intelligence Clinical decision support Digital Pathology Enterprise Imaging Flat panel displays Imaging software development PACS Population Health Remote viewing systems Teleradiology Vendor neutral archives (VNA) Women's Health Breast Biopsy Systems Breast Density Breast Imaging Breast MRI Ultrasound Women's Health Radiation Oncology Oncology information management systems (OIMS) Patient positioning/immobilization Proton Therapy Radiation therapy Treatment planning software/systems Video Webinars Conference Coverage AAPM ACC ACR AHRA AIMed ARRS ASTRO ECR HIMSS RSNA SBI SCCT SIIM SIR SNMMI By continuing to browse or by clicking “Accept” you agree to the storing of cookies on your device to enhance your site experience and for analytical and marketing purposes. To learn more about how we use cookies, please see our cookie policy. OK, I agree No, thanks",
    "originSummary": [
      "The document covers a comprehensive list of settings and configurations in a webform management system, including managing forms, submissions, and content management settings.",
      "Lunit's acquisition of Volpara Health Technologies, a provider of AI-enabled software for breast cancer screening, has secured initial approval from the High Court of New Zealand, aiming to solidify Lunit's position in the American market with a deal valued at approximately AUD 292 million.",
      "The article explores recent advancements in AI in healthcare, focusing on radiation oncology, and offers insights into webinars and sponsored content related to imaging performance and AI."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  },
  {
    "title": "Lunit Offers Premium Takeover Bid for Volpara",
    "originLink": "https://businessdesk.co.nz/article/markets/volpara-takeover-by-lunit-gets-tick-from-grant-samuel",
    "originBody": "Home Markets Volpara takeover by Lunit gets tick from Grant Samuel A technician uses Volpara's system to screen for breast cancer. (Image: Getty) Pattrick Smellie Thu, 14 Mar 2024 Directors in Wellington-headquartered health-tech firm Volpara are recommending shareholders accept a 100% takeover bid from a Korean-listed counterpart after a favourable independent valuation.ASX-listed Volpara was judged by independent valuer Grant Samuel to be worth between A67c (72c) and A82c per share, compared with the takeover from Seoul-based Lunit pitched at A$1.15.The offer represented a 47% premium to the A87cps that Volpara was trading at before the Lunit bid on Dec 14, and 55% above the weighted average share price in the month be... Unlock all stories free for 10 days Stay informed on business, government and financial developments across New Zealand. Deeply researched, twice-edited and fact-checked news Annual subscribers also receive a complimentary subscription to The Wall Street Journal Personalised email news alerts, plus gift up to 5 stories a month to non-subscribers We won’t charge for 10 days. You can cancel anytime with two clicks, an email or a phone call. Find out more. We are serious about journalism. Name Email address Phone Number Job Title Password Minimum password length of 8 characters. Require at least one upper and lowercase, numeric, and special character. Repeat password Or use the information you’ve already given Google to create your subscription. Not convinced yet? Subscribe to our free 7am Headlines newsletter. A quick summary of everything BusinessDesk has published in the previous 24 hours. No BusinessDesk subscription needed. Markets Market close NZ sharemarket drifts aimlessly as investors hibernate The S&P/NZX 50 Index closed at 11,808.33, down 0.68 points or 0.01%. Graham Skellern 14 Mar 2024 Economy Public markets risk being strangled, says Steven Joyce NZX listing unattractive to way too many companies, says former finance minister. Pattrick Smellie 14 Mar 2024 Markets Spark staff called into restructure meetings The telco’s 2023 annual report said it had 5,432 employees. Staff reporters 14 Mar 2024 Sponsored 2024’s hottest travel trends NZ’s first 5 Green Star hotel ready as green travel trends emerge The Hotel Britomart Sponsored Cybersecurity: get the board on board Cybersec professionals must be experts - and expert storytellers. Spark More Markets Markets Market close NZ sharemarket drifts aimlessly as investors hibernate The S&P/NZX 50 Index closed at 11,808.33, down 0.68 points or 0.01%. Graham Skellern 14 Mar 2024 Economy Public markets risk being strangled, says Steven Joyce NZX listing unattractive to way too many companies, says former finance minister. Pattrick Smellie 14 Mar 2024 Markets DGL relocating head office to Sydney CFO will not be jumping the Ditch and has resigned. Staff reporters 14 Mar 2024 Markets Spark staff called into restructure meetings The telco’s 2023 annual report said it had 5,432 employees. Staff reporters 14 Mar 2024",
    "originSummary": [
      "Volpara, a health-tech company from Wellington, has been offered a takeover bid by Korean-listed Lunit at A$1.15 per share.",
      "An independent valuation by Grant Samuel valued Volpara between A67c to A82c per share, making Lunit's bid a 47% premium.",
      "Shareholders are advised to consider accepting the takeover bid from Lunit for Volpara."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  },
  {
    "title": "Lunit's Acquisition of Volpara Health Advances Cancer Care",
    "originLink": "https://www.econotimes.com/New-Zealand-Court-Greenlights-Lunits-Acquisition-of-Volpara-Health-Technologies-1673532",
    "originBody": "Lunit, a deep learning-based medical AI company based in South Korea, moved closer to acquiring Volpara Health Technologies Ltd. after the high court in New Zealand issued first-phase approval for the deal. Lunit is trying to buy Volpara Health, which specializes in making software to save people from cancer. To fulfill its mission of conquering the deadly disease through modern technology, Lunit needs to secure approval from regulators in NZ since the latter is headquartered in the region. Moving Forward With the Buyout Deal According to The Korea Economic Daily, the Lunit and Volpara Health agreement is finally moving forward after the high court gave its \"go-ahead\" for the deal to proceed. With how things are progressing, it was reported that the companies may finalize their acquisition contract by May. On Thursday, May 14, the South Korean medical AI firm announced it had secured the first approval from the High Court of New Zealand for its plan to buy the NZ-based AI breast cancer diagnostics solutions company. Moreover, Lunit shared that the acquisition process required by the local court in the region consists of key steps. The first is obtaining the shareholders' approval and the sale vote, and the second is assessing the validity and effectiveness of the meeting's outcome. It was noted that Volpara scheduled a shareholders' meeting for April 12. Lunit in the American Market Meanwhile, Lunit's acquisition of Volpara will position the company as a dominant force in the U.S. market for mammography solutions. Once merged, the companies will also improve related artificial intelligence solutions while laying out the foundation for the development of autonomous AI models in the future. \"We are pleased to announce the High Court's approval, a significant step in our remarkable journey. As we approach the final stage where Volpara's shareholders will cast their votes, I would also like to share that our funding for this acquisition is progressing seamlessly, ensuring everything is on track,\" Lunit's chief executive officer, Brandon Suh, said in a press release. \"We are confident that the synergies between Lunit and Volpara will create a powerful force in advancing AI-driven solutions for the benefit of cancer care professionals and patients worldwide.\" Photo by: Lunit Press Release",
    "originSummary": [
      "Lunit, a medical AI firm from South Korea, is progressing towards acquiring Volpara Health Technologies Ltd. in New Zealand, having obtained initial approval from the high court.",
      "The acquisition is anticipated to be formalized by May, establishing Lunit as a significant player in the U.S. mammography solutions market and enhancing AI-driven cancer care solutions worldwide.",
      "This move signifies a step towards advancing AI technology in the medical field, benefiting cancer care professionals and patients on a global scale."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1710421883972
  }
]
