[
  {
    "id": 37149349,
    "title": "LK-99 není supravodič",
    "originLink": "https://www.nature.com/articles/d41586-023-02585-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37149349",
    "commentBody": "",
    "originSummary": [
      "Bylo zjištěno, že LK-99, který byl kdysi považován za supravodič pro pokojovou teplotu, je izolantem kvůli nečistotám v materiálu, jako je sulfid mědi.",
      "Tento objev zdůrazňuje význam použití monokrystalů pro přesné zkoumání vlastností materiálů.",
      "Vyvrácení LK-99 jako supravodiče je považováno za rychlý a přesvědčivý výsledek."
    ],
    "commentSummary": [
      "Nedávná tvrzení o supravodičích s pokojovou teplotou se setkala se zklamáním a skepsí.",
      "Účastníci diskusí vyjadřují obavy ohledně omezení a výzev technologie supravodičů.",
      "Při hodnocení vědeckých tvrzení je zdůrazňován význam replikace, vzájemného hodnocení a pečlivého hodnocení."
    ],
    "points": 1714,
    "commentCount": 588,
    "retryCount": 0,
    "time": 1692202637
  },
  {
    "id": 37144985,
    "title": "Htmx je součástí GitHub Accelerator",
    "originLink": "https://htmx.org/posts/2023-06-06-htmx-github-accelerator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37144985",
    "commentBody": "",
    "originSummary": [
      "Společnost htmx byla vybrána do první třídy GitHub Open Source Accelerator.",
      "Tento program nabízí vývojářům htmx možnost spolupracovat s úspěšnými vývojáři open source a učit se od nich.",
      "S cílem učinit z práce na htmx práci na plný úvazek plánuje htmx pracovat na htmx 2.0 a podporuje zkoumání dalších open source projektů z akcelerátoru."
    ],
    "commentSummary": [
      "Rozhovor se zabývá popularitou a výhodami knihovny pro vývoj webových stránek HTMX, včetně její jednoduchosti a výkonu na mobilních zařízeních.",
      "Účastníci diskutují o integraci HTMX s dalšími technologiemi a jeho potenciálním dopadu na paradigmata vývoje webových stránek, včetně jeho využití jako doménově specifického jazyka (DSL) pro vývoj front-endu.",
      "Rozhovor se také dotýká problémů spojených s používáním Reactu pro komplexní aplikace, role webových vývojových rámců, důležitosti jednoduchosti webových rámců a vztahu mezi HTMX a HATEOAS (Hypermedia as the Engine of Application State)."
    ],
    "points": 975,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1692181172
  },
  {
    "id": 37154414,
    "title": "Naomi Wu a ticho, které mluví za vše",
    "originLink": "https://www.hackingbutlegal.com/naomi-wu-and-the-silence-that-speaks-volumes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37154414",
    "commentBody": "",
    "originSummary": [
      "Čínská technologická influencerka Naomi Wu, známá jako \"Sexy Cyborg\", byla umlčena, což vyvolává obavy ohledně státních represí a vnímání čínských aktivistů ze strany Západu.",
      "Článek vyzdvihuje Wuovu technickou odbornost a přívětivost, stejně jako nepříznivé zacházení ze strany západních médií a nedostatek informací o její situaci.",
      "Diskutuje se o uzavření pekingského LGBT centra a zvýšeném útlaku, kterému čelí LGBTQ komunita v Číně, a také o obviněních ze spolčení se zahraničními silami a o zranitelnosti v oblasti kybernetické bezpečnosti. To vyvolává obavy z důsledků pro jednotlivce, kteří promluví nahlas, a z čínských taktik dohledu a cenzury."
    ],
    "commentSummary": [
      "Známá hackerka a obhájkyně COVID-19 Naomi Wu je obtěžována a sledována čínskou vládou, což ji vede k omezení aktivit na sociálních sítích.",
      "Spekuluje se, že Wuova kritika čínských klávesnic může souviset s kroky vlády proti ní.",
      "Tento incident poukazuje na problémy, kterým čelí osoby, které vystupují proti čínské vládě, a otevírá témata, jako je rozlišení názvů DNS, cenzura a omezení svobody projevu v Číně."
    ],
    "points": 366,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1692222944
  },
  {
    "id": 37147617,
    "title": "Zbrusu nová verze systému Linux, kterou nazývám Debian Linux Release (1993)",
    "originLink": "https://wiki.debian.org/DebianHistory?action=AttachFile&do=get&target=Debian-announcement-1993.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37147617",
    "commentBody": "",
    "originSummary": [
      "Ian A. Murdock oznamuje nadcházející vydání systému Debian Linux, který byl vyvinut od základu.",
      "Murdock žádá linuxovou komunitu o návrhy a zpětnou vazbu ohledně konkrétních balíčků a funkcí.",
      "Cílem vydání Debianu Linux je být elegantnější, aktuálnější, jednodušší na instalaci a údržbu, se systémem nabídek, rozsáhlou dokumentací a možnostmi pro uživatele, kteří nejsou připojeni k internetu, získávat aktualizační balíčky a přístup k dalším balíčkům."
    ],
    "commentSummary": [
      "Diskuse se týkají celé řady témat, včetně vydání a dopadu systému Debian Linux a nešťastného úmrtí jeho zakladatele Iana Murdocka.",
      "Diskutuje se o výhodách a omezeních používání Debianu ve srovnání s jinými linuxovými distribucemi, o výkonnostních problémech některých grafických karet a o instalaci Ubuntu na domácím serveru.",
      "Jsou zde také doporučení pro používání Debianu vzhledem k jeho stabilitě a diskuse o benzodiazepinových lécích, jejich účincích a použití GABA jako doplňku. Kromě toho je zde zmíněn haloperidol jako možnost léčby odvykání od alkoholu."
    ],
    "points": 341,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1692196215
  },
  {
    "id": 37145491,
    "title": "Jak se mě snažili zabít",
    "originLink": "https://www.nplusonemag.com/online-only/online-only/how-they-tried-to-kill-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145491",
    "commentBody": "",
    "originSummary": [
      "V Mnichově byla otrávena ruská novinářka Jelena Kostjučenková, která uprchla z Ukrajiny poté, co informovala o únosech a mučení osob ruskými vojáky.",
      "Její reportáž byla stažena a bylo jí vyhrožováno, takže se kvůli bezpečnosti přestěhovala do Berlína.",
      "Kosťučenko onemocní dlouhou COVID a má podezření, že mohla být otrávena, ačkoli policejní vyšetřování je uzavřeno pro nedostatek důkazů."
    ],
    "commentSummary": [
      "Článek se zaměřuje na rizika, kterým jsou novináři vystaveni zejména v autoritářských režimech.",
      "Pojednává o sledování prováděném ruskými bezpečnostními službami a o problémech, kterým čelí novináři v zemích, jako jsou Turecko a Spojené arabské emiráty.",
      "Článek se rovněž zabývá občanskými nepokoji, zákony na ochranu osob, politickými hony na čarodějnice a dezinformacemi v souvislosti s bezpečností novinářů."
    ],
    "points": 300,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692185598
  },
  {
    "id": 37146398,
    "title": "Jak šetříme vodou: Přestat pěstovat vojtěšku v okrese Imperial",
    "originLink": "https://www.desertsun.com/story/opinion/contributors/valley-voice/2023/02/05/growing-alfalfa-in-imperial-county-and-california-wastes-water/69860506007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146398",
    "commentBody": "",
    "originSummary": [
      "Pěstování vojtěšky v Kalifornii vede ke značnému plýtvání vodou a prohlubuje krizi v zásobování státu vodou.",
      "Tato praxe je výhodná především pro velké zemědělské společnosti a umožňuje prodávat vodu za nízkou cenu.",
      "Autor zpochybňuje udržitelnost pěstování vojtěšky v poušti a navrhuje omezit její pěstování, aby se zmírnil problém se zásobami vody."
    ],
    "commentSummary": [
      "Diskuse se zaměřuje na problematiku nesprávného oceňování vody a jeho dopady na zemědělství, především v Kalifornii.",
      "Mezi zkoumaná témata patří ceny a využívání vody pro zemědělské účely, obtíže při využívání vody v pouštích, nesrovnalosti v právech na vodu, hospodaření s vodními zdroji a možné výsledky reforem v oblasti cen vody.",
      "Navrhovaná řešení zahrnují poskytování kompenzací zemědělcům, změnu vodních práv a podporu udržitelnějších zemědělských postupů. Debata se zabývá také obavami z nedostatku vody, neefektivního využívání vody a dopadu zemědělství na životní prostředí."
    ],
    "points": 273,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1692190826
  },
  {
    "id": 37146268,
    "title": "Dnes jsem se dozvěděl, že můžete pozastavit Správce úloh systému Windows přesouváním aplikací.",
    "originLink": "https://www.theverge.com/2023/8/16/23834125/microsoft-windows-task-manager-pause-shortcut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146268",
    "commentBody": "",
    "originSummary": [
      "Podržením klávesy CTRL můžete pozastavit Správce úloh systému Windows a zabránit tak pohybu aplikací.",
      "Tohoto zástupce lze použít v systému Windows 10, Windows 11 a případně i ve starších verzích operačního systému.",
      "Společnost Microsoft sice pro systém Windows 11 připravuje možnost vynuceného ukončení, ale pro uživatele, kteří ještě neprovedli aktualizaci, bude klávesová zkratka CTRL stále cenná."
    ],
    "commentSummary": [
      "Uživatelé vyjadřují nespokojenost s designem a uživatelským rozhraním Správce úloh systému Windows a dalších operačních systémů Windows.",
      "Hlavním důvodem nespokojenosti jsou nedostatečně jasné pokyny a nedostatečná zjistitelnost funkcí.",
      "Uživatelé porovnávají systém Windows s jinými operačními systémy a navrhují alternativní možnosti správce úloh, přičemž někteří z nich dokonce přešli na Linux kvůli frustraci z Windows."
    ],
    "points": 268,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1692190178
  },
  {
    "id": 37151220,
    "title": "Funkce systému Windows, která resetuje systémové hodiny na základě náhodných dat, způsobuje chaos",
    "originLink": "https://arstechnica.com/security/2023/08/windows-feature-that-resets-system-clocks-based-on-random-data-is-wreaking-havoc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37151220",
    "commentBody": "",
    "originSummary": [
      "Funkce Secure Time Seeding systému Windows způsobuje významné poruchy, protože resetuje hodiny na nesprávný čas, což má dopad na kritické systémy, jako jsou směrovací tabulky pro mobilní telefonní čísla.",
      "Tato funkce, která má udržovat přesné systémové hodiny, byla označena za hlavní příčinu resetování času, které bylo hlášeno od roku 2016.",
      "Inženýři a správci byli frustrováni problémy způsobenými touto málo známou funkcí, což vedlo k nepříjemnostem a nedostupnosti služeb."
    ],
    "commentSummary": [
      "Synchronizace času v systému Windows je zkoumána kvůli možným bezpečnostním zranitelnostem a rizikům zneužití a vydávání se za někoho jiného.",
      "Uživatelé vyjadřují nespokojenost s funkčností systému a naléhavě požadují zlepšení, například používání důvěryhodných serverů, pevných podpisů a alternativních mechanismů pro měření času.",
      "Někteří uživatelé se rozhodli přejít na Linux kvůli obavám z přesnosti, spolehlivosti a bezpečnosti synchronizace času v systému Windows."
    ],
    "points": 244,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1692209500
  },
  {
    "id": 37145427,
    "title": "Nintendo se snaží patentovat některé rozsáhlé mechaniky hry Tears of the Kingdom",
    "originLink": "https://kotaku.com/nintendo-is-trying-to-patent-some-really-broad-tears-of-1850730637",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145427",
    "commentBody": "",
    "originSummary": [
      "Společnost Nintendo se pokouší patentovat několik prvků a mechanik ze hry The Legend of Zelda: Tears of the Kingdom, například mapy načítací obrazovky a fyziku pohybu postav.",
      "Patenty jsou považovány za široké a nepřiměřené, což může bránit inovacím jiných vývojářů.",
      "Jeden obzvláště unikátní patent se týká fyziky postavy jedoucí na pohybujícím se vozidle a jejich odpovídajících reakcí."
    ],
    "commentSummary": [
      "Patentové přihlášky společnosti Nintendo týkající se herních mechanismů ve hře The Legend of Zelda: Breath of the Wild vyvolaly obavy z potlačování inovací a možných soudních sporů v herním průmyslu.",
      "Diskutuje se také o dopadu patentů na rytmické hry a minihry s načítací obrazovkou a o různých pohledech na účel a nedostatky patentů.",
      "Kritika se snáší na opakované herní postupy společnosti Nintendo a vedou se debaty o výhodách a nevýhodách patentů v herním průmyslu. Zmíněna je také polemika týkající se her Genshin Impact a The Legend of Zelda: Breath of the Wild."
    ],
    "points": 240,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692185120
  },
  {
    "id": 37152978,
    "title": "Ts_zip: Komprese textu pomocí velkých jazykových modelů",
    "originLink": "https://bellard.org/ts_server/ts_zip.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37152978",
    "commentBody": "",
    "originSummary": [
      "Nástroj ts_zip, který je součástí softwaru ts_server, umožňuje kompresi textu pomocí Large Language Models a nabízí vyšší kompresní poměry než jiné nástroje.",
      "Textové soubory různých velikostí mají různé kompresní poměry, spolu s podrobnostmi o rychlosti komprese a paměťových nárocích pro konkrétní modely.",
      "Pro kompresi textu se doporučují menší modely RWKV díky své struktuře RNN a vyššímu výkonu."
    ],
    "commentSummary": [
      "Ts_zip je metoda komprese textu, která využívá velké jazykové modely (LLM) a má potenciál překonat tradiční kompresní metody.",
      "Je diskutována účinnost kompresních algoritmů založených na LLM a zdůrazněna potřeba objektivního testování na nových datech.",
      "Zkoumají se problémy při zahrnutí LLM do komprimované velikosti a nepraktičnost širokého použití."
    ],
    "points": 218,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1692216492
  }
]
