[
  {
    "id": 37149349,
    "title": "LK-99 ei ole suprajohde.",
    "originLink": "https://www.nature.com/articles/d41586-023-02585-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37149349",
    "commentBody": "",
    "originSummary": [
      "LK-99:n, jonka uskottiin aikoinaan olevan huoneenlämpötilan suprajohde, on todettu olevan eriste, joka johtuu materiaalissa olevista epäpuhtauksista, kuten kuparisulfidista.",
      "Löytö korostaa, että on tärkeää käyttää yksittäisiä kiteitä materiaalien ominaisuuksien tarkkaan tutkimiseen.",
      "LK-99:n kumoamista suprajohteena pidetään nopeana ja ratkaisevana tuloksena."
    ],
    "commentSummary": [
      "Viimeaikaiset väitteet huoneenlämpötilan suprajohteista ovat herättäneet pettymystä ja skeptisyyttä.",
      "Keskustelujen osallistujat ilmaisevat huolensa suprajohdeteknologian rajoituksista ja haasteista.",
      "Tieteellisten väitteiden arvioinnissa korostetaan toistamisen, vertaisarvioinnin ja huolellisen arvioinnin merkitystä."
    ],
    "points": 1714,
    "commentCount": 588,
    "retryCount": 0,
    "time": 1692202637
  },
  {
    "id": 37144985,
    "title": "Htmx on osa GitHub-kiihdyttämöä.",
    "originLink": "https://htmx.org/posts/2023-06-06-htmx-github-accelerator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37144985",
    "commentBody": "",
    "originSummary": [
      "htmx on valittu GitHub Open Source Acceleratorin ensimmäiseen luokkaan.",
      "Tämä ohjelma tarjoaa htmx-kehittäjille mahdollisuuden tehdä yhteistyötä menestyneiden avoimen lähdekoodin kehittäjien kanssa ja oppia heiltä.",
      "Tavoitteena on tehdä htmx:n parissa työskentelystä kokopäivätyö, ja htmx suunnittelee työskentelevänsä htmx 2.0:n parissa ja kannustaa tutustumaan muihin kiihdyttämön avoimen lähdekoodin projekteihin."
    ],
    "commentSummary": [
      "Keskustelussa tarkastellaan web-kehityskirjaston HTMX:n suosiota ja etuja, kuten sen yksinkertaisuutta ja suorituskykyä mobiililaitteissa.",
      "Osallistujat keskustelevat HTMX:n integroinnista muihin teknologioihin ja sen mahdollisista vaikutuksista web-kehitysparadigmoihin, mukaan lukien sen käyttö aluespesifisenä kielenä (DSL) front-end-kehityksessä.",
      "Keskustelussa käsitellään myös Reactin käytön haasteita monimutkaisissa sovelluksissa, web-kehityskehysten roolia, yksinkertaisuuden merkitystä web-kehyksissä sekä HTMX:n ja HATEOAS:n (Hypermedia as the Engine of Application State) välistä suhdetta."
    ],
    "points": 975,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1692181172
  },
  {
    "id": 37154414,
    "title": "Naomi Wu ja hiljaisuus, joka puhuttelee ääniä",
    "originLink": "https://www.hackingbutlegal.com/naomi-wu-and-the-silence-that-speaks-volumes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37154414",
    "commentBody": "",
    "originSummary": [
      "Kiinalainen teknologiavaikuttaja Naomi Wu, joka tunnetaan nimellä \"Seksikäs kyborgi\", on vaiennettu, mikä herättää huolta valtion sorrosta ja länsimaiden käsityksestä kiinalaisista aktivisteista.",
      "Artikkelissa korostetaan Wun teknistä asiantuntemusta ja samaistuttavuutta sekä hänen länsimaisissa tiedotusvälineissä saamaansa epäsuotuisaa kohtelua ja sitä, että hänen tilanteensa ei ole saanut riittävästi julkisuutta.",
      "Keskusteluissa käsitellään Pekingin LGBT-keskuksen sulkemista ja LGBTQ-yhteisön lisääntynyttä sortoa Kiinassa sekä syytöksiä salaliitosta ulkomaisten voimien kanssa ja kyberturvallisuuden haavoittuvuuksia. Tämä herättää huolta siitä, mitä seurauksia on seurauksista, jotka kohdistuvat avoimesti puhuviin henkilöihin ja Kiinan valvonta- ja sensuuritaktiikoihin."
    ],
    "commentSummary": [
      "Tunnettu hakkeri ja COVID-19:n puolestapuhuja Naomi Wu joutuu Kiinan hallituksen häirinnän ja valvonnan kohteeksi, minkä vuoksi hän on joutunut rajoittamaan sosiaalisen median toimintaansa.",
      "Spekulaatioiden mukaan Wun kritiikki kiinalaisia näppäimistösovelluksia kohtaan saattaa liittyä hallituksen toimiin häntä vastaan.",
      "Tapaus tuo esiin haasteita, joita Kiinan hallitusta vastaan puhuvat henkilöt kohtaavat, ja nostaa esiin muun muassa DNS-nimien resoluution, sensuurin ja sananvapauden rajoitukset Kiinassa."
    ],
    "points": 366,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1692222944
  },
  {
    "id": 37147617,
    "title": "Upouusi Linux-julkaisu, jota kutsun Debian Linux -julkaisuksi (1993).",
    "originLink": "https://wiki.debian.org/DebianHistory?action=AttachFile&do=get&target=Debian-announcement-1993.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37147617",
    "commentBody": "",
    "originSummary": [
      "Ian A. Murdock ilmoittaa tulevasta Debian Linuxin julkaisusta, joka on kehitetty tyhjästä.",
      "Murdock pyytää Linux-yhteisöltä ehdotuksia ja palautetta tietyistä paketeista ja ominaisuuksista.",
      "Debian Linux -julkaisun tavoitteena on olla tyylikkäämpi, ajantasaisempi, helpompi asentaa ja ylläpitää, sisältää valikkojärjestelmän, laajan dokumentaation ja vaihtoehtoja päivityspakettien saamiseksi ja lisäpakettien saamiseksi muille kuin internetin käyttäjille."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään monia aiheita, kuten Debian Linuxin julkaisua ja vaikutusta sekä sen perustajan Ian Murdockin valitettavaa kuolemaa.",
      "Keskustellaan Debianin käytön eduista ja rajoituksista muihin Linux-jakeluihin verrattuna, tiettyjen näytönohjainten suorituskykyongelmista ja Ubuntun asentamisesta kotipalvelimelle.",
      "Lisäksi on suosituksia Debianin käytöstä sen vakauden vuoksi ja keskusteluja bentsodiatsepiinilääkkeistä, niiden vaikutuksista ja GABA:n käytöstä lisäaineena. Lisäksi haloperidoli mainitaan hoitovaihtoehtona alkoholin vieroitusoireisiin."
    ],
    "points": 341,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1692196215
  },
  {
    "id": 37145491,
    "title": "Kuinka he yrittivät tappaa minut",
    "originLink": "https://www.nplusonemag.com/online-only/online-only/how-they-tried-to-kill-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145491",
    "commentBody": "",
    "originSummary": [
      "Venäläinen toimittaja Elena Kostyuchenko myrkytettiin Münchenissä, ja hän pakeni Ukrainasta raportoituaan venäläisten sotilaiden tekemistä sieppauksista ja kidutuksista.",
      "Hänen raportointinsa poistettiin, ja hän sai uhkauksia, minkä vuoksi hän muutti Berliiniin turvaan.",
      "Kostjuchenko sairastuu pitkään COVIDiin ja epäilee, että hänet on ehkä myrkytetty, vaikka poliisitutkinta lopetetaan todisteiden puuttuessa."
    ],
    "commentSummary": [
      "Artikkelissa keskitytään riskeihin, joita toimittajat kohtaavat erityisesti autoritaarisissa järjestelmissä.",
      "Siinä käsitellään Venäjän turvallisuuspalvelujen harjoittamaa valvontaa ja haasteita, joita toimittajat kohtaavat Turkin ja Arabiemiraattien kaltaisissa maissa.",
      "Artikkelissa käsitellään myös kansalaislevottomuuksia, yksityishenkilöiden suojelua koskevia lakeja, poliittista noitavainoa ja väärää tietoa toimittajien turvallisuuden kannalta."
    ],
    "points": 300,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692185598
  },
  {
    "id": 37146398,
    "title": "Miten säästämme vettä: Imperial Countyn sinimailasen viljelyn lopettaminen",
    "originLink": "https://www.desertsun.com/story/opinion/contributors/valley-voice/2023/02/05/growing-alfalfa-in-imperial-county-and-california-wastes-water/69860506007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146398",
    "commentBody": "",
    "originSummary": [
      "Sinimailasen viljely Kaliforniassa aiheuttaa merkittävää veden tuhlausta ja pahentaa osavaltion vedenjakelukriisiä.",
      "Käytäntö hyödyttää ensisijaisesti suuria maatalousyrityksiä ja mahdollistaa veden myymisen edulliseen hintaan.",
      "Kirjoittaja kyseenalaistaa sinimailasen viljelyn kestävyyden aavikolla ja ehdottaa viljelyn vähentämistä vedensaantiongelman ratkaisemiseksi."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään veden vääränlaiseen hinnoitteluun ja sen vaikutuksiin maatalouteen pääasiassa Kaliforniassa.",
      "Aiheita ovat muun muassa veden hinnoittelu ja käyttö maataloustarkoituksiin, aavikkoveden käytön vaikeudet, vesioikeuksien erot, vesivarojen hallinta ja veden hinnoittelun uudistamisen mahdolliset tulokset.",
      "Ratkaisuehdotuksia ovat muun muassa korvausten maksaminen maanviljelijöille, vesioikeuksien muuttaminen ja kestävämpien maatalouskäytäntöjen edistäminen. Keskustelussa käsitellään myös huolenaiheita, jotka liittyvät veden niukkuuteen, tehottomaan vedenkäyttöön ja maatalouden ympäristövaikutuksiin."
    ],
    "points": 273,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1692190826
  },
  {
    "id": 37146268,
    "title": "Tänään opin, että voit pysäyttää Windowsin Tehtävienhallinnan siirtämällä sovelluksia ympäriinsä",
    "originLink": "https://www.theverge.com/2023/8/16/23834125/microsoft-windows-task-manager-pause-shortcut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146268",
    "commentBody": "",
    "originSummary": [
      "Pitämällä CTRL-näppäintä alhaalla käyttäjät voivat pysäyttää Windowsin Tehtävienhallinnan, jolloin sovellusten liikkuminen estyy.",
      "Tätä pikakuvaketta voi käyttää Windows 10:ssä, Windows 11:ssä ja mahdollisesti vanhemmissa käyttöjärjestelmäversioissa.",
      "Vaikka Microsoft kehittää Windows 11:een pakkokäynnistystä, CTRL-näppäimen pikanäppäin on edelleen arvokas käyttäjille, jotka eivät ole vielä päivittäneet."
    ],
    "commentSummary": [
      "Käyttäjät ovat turhautuneita Windowsin Tehtävienhallinnan ja muiden Windows-käyttöjärjestelmien suunnitteluun ja käyttöliittymään.",
      "Selkeiden ohjeiden puute ja ominaisuuksien löydettävyys ovat suurimpia tyytymättömyyttä aiheuttavia seikkoja.",
      "Käyttäjät vertailevat Windowsia muihin käyttöjärjestelmiin ja ehdottavat vaihtoehtoisia tehtävienhallintavaihtoehtoja, ja jotkut jopa vaihtavat Linuxiin, koska ovat turhautuneita Windowsiin."
    ],
    "points": 268,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1692190178
  },
  {
    "id": 37151220,
    "title": "Windows-ominaisuus, joka nollaa järjestelmän kellot satunnaisten tietojen perusteella, aiheuttaa tuhoa",
    "originLink": "https://arstechnica.com/security/2023/08/windows-feature-that-resets-system-clocks-based-on-random-data-is-wreaking-havoc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37151220",
    "commentBody": "",
    "originSummary": [
      "Windowsin Secure Time Seeding -ominaisuus aiheuttaa merkittäviä häiriöitä nollaamalla kellot väärään aikaan, mikä vaikuttaa kriittisiin järjestelmiin, kuten matkapuhelinnumeroiden reititystaulukoihin.",
      "Ominaisuus, jonka tarkoituksena on ylläpitää tarkkoja järjestelmäkelloja, on todettu syyksi vuodesta 2016 lähtien raportoituihin ajan nollauksiin.",
      "Insinöörit ja ylläpitäjät ovat olleet turhautuneita tämän vähän tunnetun ominaisuuden aiheuttamiin ongelmiin, jotka ovat johtaneet epämukavuuteen ja palveluiden käyttämättömyyteen."
    ],
    "commentSummary": [
      "Windowsin aikasynkronointia tutkitaan sen mahdollisten tietoturva-aukkojen sekä hyväksikäyttö- ja henkilöitymisriskien vuoksi.",
      "Käyttäjät ovat turhautuneita järjestelmän toimintaan ja vaativat parannuksia, kuten luotettavien palvelimien käyttöä, kiinteitä allekirjoituksia ja vaihtoehtoisia ajanottomekanismeja.",
      "Jotkut käyttäjät ovat päättäneet siirtyä Linuxiin, koska he ovat huolissaan Windowsin aikasynkronoinnin tarkkuudesta, luotettavuudesta ja turvallisuudesta."
    ],
    "points": 244,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1692209500
  },
  {
    "id": 37145427,
    "title": "Nintendo yrittää patentoida joitakin Tears of the Kingdomin laajoja mekanismeja",
    "originLink": "https://kotaku.com/nintendo-is-trying-to-patent-some-really-broad-tears-of-1850730637",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145427",
    "commentBody": "",
    "originSummary": [
      "Nintendo yrittää patentoida useita The Legend of Zelda: Tears of the Kingdom -pelin komponentteja ja mekaniikkoja, kuten latausnäytön karttoja ja hahmojen liikkumisfysiikkaa.",
      "Patentteja pidetään laajoina ja kohtuuttomina, mikä voi estää muiden kehittäjien innovaatiotoimintaa.",
      "Yksi erityisen ainutlaatuinen patentti koskee liikkuvan ajoneuvon kyydissä olevan hahmon fysiikkaa ja sen reaktioita."
    ],
    "commentSummary": [
      "Nintendon The Legend of Zelda: Breath of the Wild -pelin pelimekaniikkaa koskevat patenttihakemukset ovat herättäneet huolta innovaation tukahduttamisesta ja mahdollisista oikeudenkäynneistä pelialalla.",
      "Lisäksi keskustellaan patenttien vaikutuksesta rytmipeleihin ja latausruutuisiin minipeleihin sekä erilaisista näkökulmista patenttien tarkoitukseen ja puutteisiin.",
      "Nintendon toistuvia pelikäytäntöjä arvostellaan, ja patenttien eduista ja haitoista pelialalla käydään keskustelua. Myös Genshin Impactiin ja The Legend of Zelda: Breath of the Wildiin liittyvä kiista mainitaan."
    ],
    "points": 240,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692185120
  },
  {
    "id": 37152978,
    "title": "Ts_zip: Tekstin pakkaaminen suurten kielimallien avulla",
    "originLink": "https://bellard.org/ts_server/ts_zip.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37152978",
    "commentBody": "",
    "originSummary": [
      "Ts_server-ohjelmistoon kuuluva ts_zip-apuohjelma mahdollistaa tekstin pakkaamisen Large Language Models -mallien avulla ja tarjoaa muita työkaluja paremman pakkaussuhteen.",
      "Erikokoisissa tekstitiedostoissa on eri pakkaussuhteet, ja lisäksi on tietoja pakkauksen nopeudesta ja muistivaatimuksista tietyissä malleissa.",
      "Pienempiä RWKV-malleja suositellaan tekstin pakkaamiseen niiden RNN-rakenteen ja nopeamman suorituskyvyn vuoksi."
    ],
    "commentSummary": [
      "Ts_zip on tekstinpakkausmenetelmä, joka hyödyntää suuria kielimalleja (LLM) ja jolla on potentiaalia ylittää perinteiset pakkausmenetelmät.",
      "LLM-pohjaisten pakkausalgoritmien tehokkuudesta keskustellaan ja korostetaan tarvetta puolueettomaan testaukseen uusilla tiedoilla.",
      "Tarkastellaan haasteita, jotka liittyvät LLM:n sisällyttämiseen pakattuun kokoon, ja sen epäkäytännöllisyyttä laajamittaiseen käyttöön."
    ],
    "points": 218,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1692216492
  }
]
