[
  {
    "id": 37149349,
    "title": "LK-99 nie je supravodič",
    "originLink": "https://www.nature.com/articles/d41586-023-02585-7",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37149349",
    "commentBody": "",
    "originSummary": [
      "Zistilo sa, že LK-99, ktorý sa kedysi považoval za supravodič pri izbovej teplote, je izolantom kvôli nečistotám v materiáli, ako je sulfid medi.",
      "Tento objav zdôrazňuje význam používania monokryštálov na presné skúmanie vlastností materiálov.",
      "Vyvrátenie LK-99 ako supravodiča sa považuje za rýchly a presvedčivý výsledok."
    ],
    "commentSummary": [
      "Nedávne tvrdenia o supravodičoch s izbovou teplotou sa stretli so sklamaním a skepticizmom.",
      "Účastníci diskusií vyjadrujú obavy z obmedzení a výziev technológie supravodičov.",
      "Pri hodnotení vedeckých tvrdení sa zdôrazňuje význam replikácie, vzájomného hodnotenia a dôkladného hodnotenia."
    ],
    "points": 1714,
    "commentCount": 588,
    "retryCount": 0,
    "time": 1692202637
  },
  {
    "id": 37144985,
    "title": "Htmx je súčasťou nástroja GitHub Accelerator",
    "originLink": "https://htmx.org/posts/2023-06-06-htmx-github-accelerator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37144985",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť htmx bola vybraná do prvej triedy GitHub Open Source Accelerator.",
      "Tento program ponúka vývojárom htmx možnosť spolupracovať s úspešnými vývojármi open source a učiť sa od nich.",
      "S cieľom, aby sa práca na htmx stala prácou na plný úväzok, plánuje pracovať na htmx 2.0 a podporuje skúmanie ďalších projektov s otvoreným zdrojovým kódom z akcelerátora."
    ],
    "commentSummary": [
      "V rozhovore sa skúma popularita a výhody knižnice HTMX pre vývoj webových stránok vrátane jej jednoduchosti a výkonu na mobilných zariadeniach.",
      "Účastníci diskutujú o integrácii HTMX s inými technológiami a o jeho potenciálnom vplyve na paradigmy vývoja webových stránok vrátane jeho použitia ako doménovo špecifického jazyka (DSL) na vývoj front-endu.",
      "Rozhovor sa dotýka aj výziev používania Reactu pre komplexné aplikácie, úlohy webových vývojových rámcov, dôležitosti jednoduchosti webových rámcov a vzťahu medzi HTMX a HATEOAS (Hypermedia as the Engine of Application State)."
    ],
    "points": 975,
    "commentCount": 442,
    "retryCount": 0,
    "time": 1692181172
  },
  {
    "id": 37154414,
    "title": "Naomi Wu a ticho, ktoré hovorí veľa",
    "originLink": "https://www.hackingbutlegal.com/naomi-wu-and-the-silence-that-speaks-volumes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37154414",
    "commentBody": "",
    "originSummary": [
      "Čínska technologická influencerka Naomi Wu, známa ako \"Sexy Cyborg\", bola umlčaná, čo vyvoláva obavy zo štátnych represií a vnímania čínskych aktivistov Západom.",
      "V článku sa vyzdvihuje Wuova technická odbornosť a príťažlivosť, ako aj nepriaznivé zaobchádzanie západných médií a nedostatok informácií o jej situácii.",
      "Diskutuje sa o zatvorení pekinského centra LGBT a zvýšenom útlaku, ktorému čelí komunita LGBTQ v Číne, ako aj o obvineniach zo spolčenia so zahraničnými silami a o zraniteľnosti v oblasti kybernetickej bezpečnosti. To vyvoláva obavy z dôsledkov pre jednotlivcov, ktorí sa vyjadrujú, a z taktiky sledovania a cenzúry v Číne."
    ],
    "commentSummary": [
      "Známa hackerka a obhajkyňa COVID-19 Naomi Wu zažíva prenasledovanie a sledovanie zo strany čínskej vlády, čo ju vedie k obmedzeniu jej aktivít na sociálnych sieťach.",
      "Špekuluje sa, že Wuova kritika čínskych aplikácií s klávesnicou môže súvisieť so zásahmi vlády proti nej.",
      "Tento incident poukazuje na problémy, ktorým čelia jednotlivci, ktorí vystupujú proti čínskej vláde, a otvára témy, ako je rozlíšenie názvov DNS, cenzúra a obmedzenia slobody prejavu v Číne."
    ],
    "points": 366,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1692222944
  },
  {
    "id": 37147617,
    "title": "Úplne nová verzia Linuxu, ktorú nazývam Debian Linux Release (1993)",
    "originLink": "https://wiki.debian.org/DebianHistory?action=AttachFile&do=get&target=Debian-announcement-1993.txt",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37147617",
    "commentBody": "",
    "originSummary": [
      "Ian A. Murdock oznamuje nadchádzajúce vydanie systému Debian Linux, ktorý bol vyvinutý úplne od začiatku.",
      "Murdock žiada komunitu Linuxu o návrhy a spätnú väzbu na konkrétne balíky a funkcie.",
      "Cieľom vydania Debian Linux je byť elegantnejší, aktuálnejší, jednoduchší na inštaláciu a údržbu, so systémom menu, rozsiahlou dokumentáciou a možnosťami pre používateľov, ktorí nie sú pripojení na internet, prijímať aktualizačné balíky a mať prístup k ďalším balíkom."
    ],
    "commentSummary": [
      "Diskusie sa týkajú rôznych tém vrátane vydania a vplyvu systému Debian Linux a nešťastnej smrti jeho zakladateľa Iana Murdocka.",
      "Diskutuje sa o výhodách a obmedzeniach používania Debianu v porovnaní s inými distribúciami Linuxu, o problémoch s výkonom niektorých grafických kariet a o inštalácii Ubuntu na domáci server.",
      "Sú tu aj odporúčania na používanie Debianu vzhľadom na jeho stabilitu a diskusie o benzodiazepínových liekoch, ich účinkoch a používaní GABA ako doplnku. Okrem toho sa spomína haloperidol ako možnosť liečby pri odvykaní od alkoholu."
    ],
    "points": 341,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1692196215
  },
  {
    "id": 37145491,
    "title": "Ako sa ma pokúsili zabiť",
    "originLink": "https://www.nplusonemag.com/online-only/online-only/how-they-tried-to-kill-me/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145491",
    "commentBody": "",
    "originSummary": [
      "Ruská novinárka Jelena Kosťučenková bola otrávená v Mníchove a utiekla z Ukrajiny po tom, ako informovala o únose a mučení osôb ruskými vojakmi.",
      "Jej reportáž bola stiahnutá a vyhrážali sa jej, čo ju viedlo k tomu, že sa kvôli bezpečnosti presťahovala do Berlína.",
      "Kosťučenko ochorie na dlhý COVID a má podozrenie, že mohol byť otrávený, hoci policajné vyšetrovanie je uzavreté pre nedostatok dôkazov."
    ],
    "commentSummary": [
      "Článok sa zameriava na riziká, ktorým čelia novinári najmä v autoritárskych režimoch.",
      "Rozoberá sledovanie vykonávané ruskými bezpečnostnými službami a problémy, ktorým čelia novinári v krajinách ako Turecko a Spojené arabské emiráty.",
      "Článok sa zaoberá aj občianskymi nepokojmi, zákonmi na ochranu jednotlivcov, politickým honom na čarodejnice a dezinformáciami v kontexte bezpečnosti novinárov."
    ],
    "points": 300,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692185598
  },
  {
    "id": 37146398,
    "title": "Ako šetríme vodou: Prestaňte pestovať lucernu v okrese Imperial",
    "originLink": "https://www.desertsun.com/story/opinion/contributors/valley-voice/2023/02/05/growing-alfalfa-in-imperial-county-and-california-wastes-water/69860506007/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146398",
    "commentBody": "",
    "originSummary": [
      "Pestovanie lucerny v Kalifornii vedie k značnému plytvaniu vodou a zhoršuje krízu zásobovania štátu vodou.",
      "Táto prax je výhodná predovšetkým pre veľké poľnohospodárske spoločnosti a umožňuje predaj vody za nízku cenu.",
      "Autor spochybňuje udržateľnosť pestovania lucerny v púšti a navrhuje obmedziť jej pestovanie, aby sa zmiernil problém so zásobami vody."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na problematiku nesprávneho oceňovania vody a jeho vplyv na poľnohospodárstvo, predovšetkým v Kalifornii.",
      "Medzi skúmané témy patria ceny a využívanie vody na poľnohospodárske účely, ťažkosti pri využívaní vody v púšti, rozdiely v právach na vodu, hospodárenie s vodnými zdrojmi a možné výsledky reforiem v oblasti cien vody.",
      "Navrhované riešenia zahŕňajú poskytovanie kompenzácií poľnohospodárom, zmenu práv na vodu a podporu udržateľnejších poľnohospodárskych postupov. Diskusia sa zaoberá aj obavami týkajúcimi sa nedostatku vody, neefektívneho využívania vody a vplyvu poľnohospodárstva na životné prostredie."
    ],
    "points": 273,
    "commentCount": 245,
    "retryCount": 0,
    "time": 1692190826
  },
  {
    "id": 37146268,
    "title": "Dnes som sa dozvedel, že môžete pozastaviť Správcu úloh systému Windows, ktorý presúva aplikácie",
    "originLink": "https://www.theverge.com/2023/8/16/23834125/microsoft-windows-task-manager-pause-shortcut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37146268",
    "commentBody": "",
    "originSummary": [
      "Podržaním klávesu CTRL môžete pozastaviť Správcu úloh systému Windows a zabrániť tak aplikáciám v pohybe.",
      "Túto skratku možno použiť v systémoch Windows 10, Windows 11 a prípadne aj v starších verziách operačného systému.",
      "Hoci spoločnosť Microsoft pripravuje možnosť vynúteného ukončenia pre systém Windows 11, klávesová skratka CTRL bude stále cenná pre používateľov, ktorí ešte neuskutočnili aktualizáciu."
    ],
    "commentSummary": [
      "Používatelia vyjadrujú nespokojnosť s dizajnom a používateľským rozhraním Správcu úloh systému Windows a iných operačných systémov Windows.",
      "Hlavnými bodmi nespokojnosti sú nedostatok jasných pokynov a prehľadnosť funkcií.",
      "Používatelia porovnávajú systém Windows s inými operačnými systémami a navrhujú alternatívne možnosti správcu úloh, pričom niektorí z nich dokonca prechádzajú na Linux z dôvodu frustrácie zo systému Windows."
    ],
    "points": 268,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1692190178
  },
  {
    "id": 37151220,
    "title": "Funkcia systému Windows, ktorá resetuje systémové hodiny na základe náhodných údajov, spôsobuje chaos",
    "originLink": "https://arstechnica.com/security/2023/08/windows-feature-that-resets-system-clocks-based-on-random-data-is-wreaking-havoc/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37151220",
    "commentBody": "",
    "originSummary": [
      "Funkcia Secure Time Seeding systému Windows spôsobuje významné poruchy, pretože resetuje hodiny na nesprávny čas, čo má vplyv na kritické systémy, ako sú smerovacie tabuľky pre mobilné telefónne čísla.",
      "Táto funkcia, ktorej cieľom je udržiavať presné systémové hodiny, bola identifikovaná ako hlavná príčina resetovania času, ktoré bolo hlásené od roku 2016.",
      "Inžinieri a správcovia boli frustrovaní z problémov spôsobených touto málo známou funkciou, čo viedlo k nepríjemnostiam a nedostupnosti služieb."
    ],
    "commentSummary": [
      "Synchronizácia času v systéme Windows sa skúma z hľadiska potenciálnych bezpečnostných zraniteľností a rizík zneužitia a vydávania sa za niekoho iného.",
      "Používatelia vyjadrujú nespokojnosť s funkčnosťou systému a žiadajú jeho zlepšenie, napríklad používanie dôveryhodných serverov, pevných podpisov a alternatívnych mechanizmov na meranie času.",
      "Niektorí používatelia sa rozhodli prejsť na Linux z dôvodu obáv o presnosť, spoľahlivosť a bezpečnosť synchronizácie času v systéme Windows."
    ],
    "points": 244,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1692209500
  },
  {
    "id": 37145427,
    "title": "Spoločnosť Nintendo sa snaží patentovať niektoré rozsiahle mechaniky hry Tears of the Kingdom",
    "originLink": "https://kotaku.com/nintendo-is-trying-to-patent-some-really-broad-tears-of-1850730637",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37145427",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Nintendo sa pokúša patentovať niekoľko komponentov a mechaník z hry The Legend of Zelda: Tears of the Kingdom, ako sú mapy načítacích obrazoviek a fyzika pohybu postáv.",
      "Patenty sa považujú za rozsiahle a neprimerané, čo môže brániť inováciám iných vývojárov.",
      "Jeden obzvlášť jedinečný patent sa týka fyziky postavy jazdiacej na pohybujúcom sa vozidle a jej príslušných reakcií."
    ],
    "commentSummary": [
      "Patentové prihlášky spoločnosti Nintendo týkajúce sa herných mechaník v hre The Legend of Zelda: Breath of the Wild vyvolali obavy z potláčania inovácií a potenciálnych súdnych sporov v hernom priemysle.",
      "Diskutuje sa aj o vplyve patentov na rytmické hry a minihry s načítavacou obrazovkou, ako aj o rôznych pohľadoch na účel a nedostatky patentov.",
      "Kritika je zameraná na opakujúce sa herné postupy spoločnosti Nintendo a diskutuje sa o výhodách a nevýhodách patentov v hernom priemysle. Spomína sa aj polemika týkajúca sa hier Genshin Impact a The Legend of Zelda: Breath of the Wild."
    ],
    "points": 240,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692185120
  },
  {
    "id": 37152978,
    "title": "Ts_zip: Kompresia textu pomocou veľkých jazykových modelov",
    "originLink": "https://bellard.org/ts_server/ts_zip.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37152978",
    "commentBody": "",
    "originSummary": [
      "Nástroj ts_zip, ktorý je súčasťou softvéru ts_server, umožňuje kompresiu textu pomocou veľkých jazykových modelov a ponúka vyšší kompresný pomer ako iné nástroje.",
      "Textové súbory rôznych veľkostí majú rôzne kompresné pomery spolu s podrobnosťami o rýchlosti kompresie a požiadavkách na pamäť pre konkrétne modely.",
      "Na kompresiu textu sa odporúčajú menšie modely RWKV vďaka ich štruktúre RNN a rýchlejšiemu výkonu."
    ],
    "commentSummary": [
      "Ts_zip je metóda kompresie textu, ktorá využíva veľké jazykové modely (LLM) a má potenciál prekonať tradičné kompresné metódy.",
      "Diskutuje sa o účinnosti kompresných algoritmov založených na LLM, pričom sa zdôrazňuje potreba objektívneho testovania na nových údajoch.",
      "Skúmajú sa problémy pri zahrnutí LLM do komprimovanej veľkosti a nepraktickosť širokého používania."
    ],
    "points": 218,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1692216492
  }
]
