[
  {
    "title": "외부 전원 없이 작동하는 친환경 양자점 광센서 개발 완료",
    "originLink": "https://m.hankookilbo.com/News/Read/A2023110715470004219",
    "originBody": "보내는 기사 외부전원 없어도 작동하는 친환경 양자점 광센서 개발",
    "originSummary": [
      "외부 전력 없이 작동하는 친환경 양자 점 광 센서의 개발.",
      "이 센서는 양자점의 빛을 감지하고, 이 정보를 전력 없이 전송하게 해주는 기술을 사용.",
      "이 새로운 발전은 더 효율적이고 지속 가능한 센서 기술의 가능성을 열어줌."
    ],
    "commentBody": "",
    "commentSummary": [
      "외부 전원 없이 작동하는 친환경 양자 도트 광 센서 개발에 관한 내용입니다.",
      "이 센서는 양자 도트 기술을 활용하여, 전원 없이도 빛을 감지하는 능력을 가지고 있습니다.",
      "친환경적이고 에너지 절약을 위한 신기술인 만큼, 이 통신 기술에 관심이 집중되고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "아워홈의 재사용 가능한 배달 도시락, '2023 우수 디자인'에서 GD 마크 획득",
    "originLink": "https://www.donga.com/news/Economy/article/all/20231107/122065887/1",
    "originBody": "본문바로가기 문장공유 트위터 카카오톡 동아일보에서만 볼 수 있는 ‘오늘의 콘텐츠’를 만나보세요! 디지털콘텐츠 주간 편성표 보기 광화문 7:307:30am 공개오늘의 1면 톱기사부터 촌철살인 칼럼까지, 한 눈에 볼 수 있습니다 층간소음 이렇게 푼다10:00am 공개층간소음 문제를 전문으로 취재한 김광현 기자가 알려주는 갈등 해법 헬스동아 행복 레터12:00pm 공개건강해지는 정보, 행복해지는 뉴스를 함께 담았습니다 복수자들4:00pm 공개그 복수(復讐) 아닙니다~. 우리 시대 찐 투잡러들의 이야기 펼쳐보기/닫기 전체메뉴 검색 최근검색어 최근 검색어 내역이 없습니다. 검색어 저장 끄기 닫기 오피니언 정치 경제 국제 사회 문화 연예 스포츠 헬스동아 매거진 공유하기 북마크 로그인 공유하기 닫기 오피니언 사설 오늘과 내일 횡설수설 동아광장 동아시론 광화문에서 현장에서 POLL 뉴스 정치 경제 국제 사회 문화 연예 스포츠 매거진 신동아 주간동아 여성동아 매거진동아 동아비즈니스리뷰 하버드비즈니스 리뷰코리아 어린이동아 과학동아 어린이과학·수학동아 수학동아 에듀동아 브랜더쿠 섹션 책의 향기 스타일매거진Q 골든걸 edu+ 히어로콘텐츠 디스페셜 헬스동아 실시간 뉴스 이슈 포인트 연재 포인트 트렌드뉴스 뉴스레터 신청 기자 구독 동아APP서비스 지면보기 PDF서비스 구독신청 동아디지털아카이브 보도자료 보이스뉴스 RSS 동아방송 DBS 채널A 스포츠동아 비즈N EV라운지 MLB파크 보스 VODA IT동아 게임동아 동아경제|경제 아워홈, 보온도시락 굿디자인상 수상… ‘디자인·친환경·기능성’ 호평 동아닷컴 김상준 기자 입력 2023-11-07 17:47업데이트 2023-11-07 17:49 읽기모드 글자크기 설정 레이어 열기 뉴스듣기 프린트 글자크기 설정 가 가 가 가 닫기 크게보기 아워홈은 산업통상자원부가 주최하고 한국디자인진흥원이 주관하는 ‘2023 우수디자인(GD) 상품선정’에서 특허 청장상을 수상했다고 7일 밝혔다. ‘우수디자인 상품선정’은 1985년부터 매년 시행 중이며 디자인이 우수한 상품에 정부인증 GD(Good Design)마크를 부여하는 제도다. 올해는 총 1176여 제품이 출품됐으며 심사를 거쳐 최종 80점을 대상으로 본상을 수여했다. 아워홈은 리빙디자인 부문에서 ’리유저블(Reusable) 배달용 보온 도시락’을 출품해 특허청장상을 수상했다. 용기 밀폐 구조와 보온을 강화한 용기 설계로 기존 제품 대비 최대 30%까지 보온성을 향상 시킨 것이 특징이다. 2단 또는 3단으로 조립이 가능한 구조로 공간 활용이 우수해 고객 요구 맞춰 다양한 메뉴 구성이 가능하다. 재활용 용이성 등 친환경적인 면에서도 호평받았다. 친환경 단열 소재 EPP(Expanded PolyPropylene: 발포 폴리프로필렌) 재질을 적용한 다회용기로 원가를 개선한 것은 물론, 쓰레기 배출량도 절감해 ESG활동 측면에도 기여 중이다. 고급스러운 디자인과 기능적인 편의성도 인정받았다. EPP 소재 표면에 3D 조각 패턴 기술을 적용해 기존 보온 도시락에서는 볼 수 없는 고급화를 구현했다. 현장 도시락 포장 작업자의 사용성을 고려, 각 용기의 뚜껑과 단별로 컬러를 다르게 적용해 직관적으로 구분이 가능하도록 했다. 전용 배달 가방을 적용해 도시락 보관, 취급 등에 대한 배송 편의성 및 위생성도 개선했다. 현재 아워홈은 리유저블 배달용 보온 도시락을 현장에서 적극 사용 중이다. 도시락 배달 수요만 일 1500식 이상 발생한다고 한다. 대규모 부지 생산시설 등 근무지와 사내식당 간 거리가 먼 점포에서 활용도가 높다. 향후 오피스 사내식당에도 수요 조사 후 확대 적용해 나갈 계획이다. 서원호 아워홈 솔루션센터장은 “우수디자인상품 선정은 디자인뿐 아니라 사회 가치성, 환경 친화성 등 엄격한 심사기준을 통해 평가받는 자리인 만큼, 자사 제품이 우수성을 인정받게 돼 매우 기쁘다. 앞으로도 고객 편의를 높이고 환경도 고려한 다양한 기능의 우수한 상품과 서비스를 개발하는데 집중할 계획이다”고 말했다. 동아닷컴 김상준 기자 ksj@donga.com 좋아요 이미지좋아요 슬퍼요 이미지슬퍼요 화나요 이미지화나요 공유 이미지공유 기사추천 이미지기사추천 공유하기 닫기 Copyright ⓒ 동아일보 & donga.com 당신이 좋아할 만한 콘텐츠 댓글 0개 의견을 남겨주세요. 동아일보는 독자 여러분의 의견을 경청하겠습니다. 많이 본 뉴스 베스트 추천 뉴스 1 “안철수씨 조용하세요!”…식당 옆방서 소리친 이준석, 왜? 2 페라리로 시속 167㎞ 밟아…구자균 LS일렉트릭 회장 약식기소 3 한동훈 “사형제도 필요…영구히 격리해야 할 범죄자 분명히 있어” 4 유동규, 이재명 앞에서 “한때 李 지키려 죽을 생각…끔찍해” 5 尹 “박정희 주재 회의 자료 공부”… 박근혜 “어떻게 그걸 다 읽었나” 6 “KTX 타고 왔는데 빈대 봤다”…목격담 확산 [e글e글] 7 차도-인도 넘나들며 필사의 도주…김길수 검거 영상 8 英 찰스 3세, 70년 만에 ‘킹스 스피치’…“尹대통령 방문 고대” 9 이준석 “인요한, 혁신 위해 환자 ‘개복수술’ 단행해야”[중립기어 라이브] 10 ‘불법 공매도’ 칼 뺀 게 작년 7월인데 이제 와 “유리 다 깨진 시장”[사설] 1 한동훈 “사형제도 필요…영구히 격리해야 할 범죄자 분명히 있어” 2 경제부총리 최상목-보훈장관 최원일 유력 검토 3 ‘2023 대한민국 소상공인대회’서 눈길 끈 K-스마트 상점 기술 4 ‘전청조 공범 의혹’ 조사받은 남현희…“11억 사기당한 부부가 고소” 5 이복현 “이자로 60조 번 은행권, 삼성전자-현대차만큼 혁신했나” 6 “딸 같아서 나섰다”…폭행당하는 편의점 알바생 돕다 물어뜯긴 50대 7 부부 싸움 화풀이로 아이 그네서 내동댕이친 아빠…3m 날아갔다 8 귀화 인요한에 영어로 응대한 이준석… “인종차별” 지적 이어져 9 尹, 朴 사저서 환담…“박정희 시절 배울 점, 국정에 반영” 10 尹 “박정희 주재 회의 자료 공부”… 박근혜 “어떻게 그걸 다 읽었나” 지금 뜨는 뉴스 ‘불법 공매도’ 칼 뺀 게 작년 7월인데 이제 와 “유리 다 깨진 시장”[사설] 尹대통령 “박정희 주재 회의 자료 공부”… 박근혜 “어떻게 그걸 읽었나” 대통령실, 총선 앞두고 개편-개각 작업…김대기·이관섭 주도 ‘2기 체제’ 이준석 “인요한, 혁신 위해 환자 ‘개복수술’ 단행해야”[중립기어 라이브] “안철수씨 조용하세요!\"…식당 옆방서 소리친 이준석, 왜? 당신의 혈당이 걱정되시나요? 구독 추천설명 · 인기 구독물 순위 : '이슈' , '연재' 구독물 중 가장 인기 있는 구독물을 보여드립니다. 인기 구독물 순위는 30분마다 업데이트됩니다. 실시간 누적숫자와 다를 수 있습니다. · 최신 업데이트 : '이슈 , '연재' 구독물 중 기사가 최신 업데이트된 순으로 보여드립니다. · 실시간 구독 : 다른 회원들이 실시간 구독한 '이슈' . '연재' 구독물을 보여드립니다. 닫기 인기 구독물 순위 최신 업데이트 실시간 구독 김대기, 文정부 ‘통계조작’에 “민간선 분식회계로 큰 처벌받는 사안” 2023 국정감사구독 10구독 산타 오토바이 고양이 눈구독 36구독 [알립니다]디리스킹 시대, AI혁신과 생존 전략 4차 산업혁명 시대구독 32구독 홍준표 “김포시 서울 편입은 ‘떴다방’…지방화 시대 역행” ‘김포, 서울 편입’ 논란구독 2구독 DAMG 동아미디어그룹 소개 > 문화스포츠사업펼치기/닫기 동아 신춘문예 동아국악콩쿠르 동아음악콩쿠르 동아뮤지컬콩쿠르 동아무용콩쿠르 동아주니어음악콩쿠르 동아주니어국악콩쿠르 동아마라톤 동아연극상 LG와 함께 하는 서울국제음악콩쿠르 세계보도사진전 제주 국제사진공모전 동아 Family펼치기/닫기 인촌기념회 일민미술관 신문박물관 화정 평화재단 하서학술재단 오피니언 사설 오늘과 내일 횡설수설 동아광장 동아시론 광화문에서 현장에서 POLL 뉴스 정치 경제 국제 사회 문화 연예 스포츠 매거진 신동아 주간동아 여성동아 매거진동아 동아비즈니스리뷰 하버드비즈니스 리뷰코리아 어린이동아 과학동아 어린이과학·수학동아 수학동아 에듀동아 브랜더쿠 섹션 책의 향기 스타일매거진Q 골든걸 edu+ 히어로콘텐츠 디스페셜 헬스동아 실시간 뉴스 이슈 포인트 연재 포인트 트렌드뉴스 뉴스레터 신청 기자 구독 동아APP서비스 지면보기 PDF서비스 구독신청 동아디지털아카이브 보도자료 보이스뉴스 RSS 동아방송 DBS 채널A 스포츠동아 비즈N EV라운지 MLB파크 보스 VODA IT동아 게임동아 동아일보 회사소개| 문화스포츠사업| 신문박물관| 인촌기념회| 화정 평화재단| 신문광고안내| 독자라운지(구독신청)| 저작물 이용| 기사의견·제보| 정정보도 신청 주소: 서울특별시 종로구 청계천로 1☎: 02-2020-0114 동아닷컴 회사소개| 광고 (인터넷, 전광판)| 제휴안내| 고객센터| 이용약관| 개인정보처리방침| 청소년보호정책(책임자: 구민회)| 사이트맵| RSS 주소: 서울특별시 서대문구 충정로 29Tel: 02-360-0400등록번호: 서울아00741발행일자: 1996.06.18등록일자: 2009.01.16발행·편집인: 박원재 Copyright by dongA.com All rights reserved.",
    "originSummary": [
      "동아일보의 오늘의 콘텐츠는 소음 문제 해결, 건강, 흥미로운 이야기 등 다양한 주제를 표현하며, 하루 중 다른 시간대에 발표됩니다.",
      "마지막으로, '우리집'의 재사용 가능한 배달 도시락이 '2023 우수 디자인' 경쟁에서 GD (Good Design) 마크를 획득한 뉴스를 전하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "동아일보의 '오늘의 콘텐츠' 소개를 하는 기사이며, 소음 문제 해결, 건강, 그리고 영감을 주는 이야기 등 다양한 주제를 다룹니다.",
      "하루 중 다양한 시간대에 프로모션을 발표한다고 합니다.",
      "마지막으로, '우리집' 의 재사용 가능한 배달 도시락 상자가 '2023년 우수 디자인' 경진대회에서 GD (Good Design) 마크를 수상했다는 소식을 전합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "친환경 기술 투자 유도를 위한 '한국판 IRA' 도입 촉구 - 한화 솔루션, 순환에너지 기술 개발 투자",
    "originLink": "https://biz.chosun.com/science-chosun/nature-environment/2023/11/07/NLBUQYTSKJEDVBCNSTCWK4UV3U/",
    "originBody": "이병철 기자 입력 2023.11.07 15:09 최승혁 맥킨지앤컴퍼니 파트너가 7일 '그린 빅뱅 프렐류드'에 참석해 국내 친환경 정책과 산업에 대한 분석 결과를 소개하고 있다. 그는 \"적극적 투자를 통한 실행력이 친환경 기술 경쟁력을 좌우할 것\"이라고 강조했다./이병철 기자 국내 친환경 산업 육성을 위해 정부가 더 적극적인 역할을 해야 한다는 전문가들의 지적이 나왔다. 친환경 기술 시장에서 주도권을 잡으려면 미국과 유사한 ‘인플레이션 감축법(IRA)’을 도입해 적극적인 투자와 육성이 이뤄져야 한다는 것이다. 김기홍 한화솔루션(009830) 실장은 7일 서울 중구 더플라자호텔에서 열린 ‘그린 빅뱅 플렐류드’에 참석해 “미국 정부가 지난해 IRA를 통과한 시기를 기점으로 태양광에너지 발전량이 크게 늘었다”며 “한국도 산업 육성을 위해 신재생에너지 생산에 대한 세제 혜택과 보조금 지원이 이뤄져야 한다”고 강조했다. 김 실장은 “한화솔루션은 페로브스카이트 텐덤을 차세대 기술로 지정하고 개발에 투자하고 있다”며 “2026년 양산을 이뤄내 글로벌 시장을 주도하겠다”고 말했다. 텐덤은 실리콘 전지에 페로브스카이트 전지를 쌓는 방식으로 서로 다른 영역의 빛을 흡수할 수 있어 에너지 효율을 크게 높일 수 있다. 현재 상용화된 실리콘 태양전지가 이론적으로 약 29%의 태양광을 전기에너지로 바꿀 수 있다면 텐덤을 활용했을 때는 44%까지 효율성을 높일 수 있다. 문제는 글로벌 기업들도 텐덤에 적극 투자하고 있는 만큼 치열한 시장 경쟁이 예상된다는 점이다. 특히 미국과 중국은 정부 차원에서 친환경 산업을 육성하기 위한 정책을 적극 추진하고 있다. 국내 기업들이 정부의 지원 정책을 요청하는 이유다. 지난해 8월 조 바이든 미국 대통령의 서명으로 발효된 IRA는 표면상으로는 물가상승 억제를 위해 제정됐지만 실질적으로 청정에너지 기술과 관련 산업 인프라 개발과 확충에 역점을 두고 있다. 에너지 안보와 기후위기 대응 관련 지출, 전기차 산업 활성화를 주요 내용으로 하고 있다. 사단법인 ‘우리들의 미래’가 주최한 이날 행사에는 50여명의 글로벌 전문가가 참석해 기술, 금융, 외교를 비롯한 다양한 분야에서 탄소 중립 달성을 위한 방안을 논의했다. 이날 한화솔루션 외에도 현대차, LG에너지솔루션, SK E&S, 네이버랩스를 비롯한 국내 주요 기업들이 기술 개발을 통한 탄소 배출 절감 방안과 정부의 지원 정책에 대해 발표했다. 7일 오전 서울 중구 더플라자호텔에서 열린 '그린 빅뱅 프렐류드'의 발표 세션 현장. 이날 오전 발표 세션에서는 국내 기업들의 주요 기술 현황과 정부에 필요한 정책이 발표됐다./이병철 기자 이차전지 재사용을 위한 공공 기반시설(인프라) 구축이 필요하다는 목소리도 나왔다. 박진원 LG에너지솔루션(373220) 부사장은 “배터리는 초기 성능의 70~80%로 하락하면 교체해야 하는 만큼 재활용을 통한 순환 경제 구축이 중요하다”며 “정부가 사용후 배터리를 재활용할 수 있는 공공 인프라와 실증 연구에 투자해주길 바란다”고 말했다. 박 부사장은 배터리 산업이 온실가스 배출 절감에 중요한 역할을 할 것이라고 강조했다. 그는 “넷제로 달성을 위해서는 온실가스 배출량의 절반을 차지하는 발전 분야와 25%를 차지하는 이동 수단에서 친환경 기술 도입이 필요하다”며 “배터리가 중요한 역할을 할 것”이라고 설명했다. 최승혁 맥킨지앤컴퍼니 파트너도 정부가 친환경 산업에 얼마나 투자하냐에 따라 국가 경쟁력이 결정될 것이라고 분석했다. 최 파트너는 “한국 기업의 전략은 글로벌 산업에서도 결코 뒤쳐지지 않는 수준”이라며 “다만 중요한 것은 계획을 얼마나 빠르게 실행할 수 있느냐에 달린 만큼 2배, 3배 실행 속도를 높일 필요가 있다”고 강조했다. 최 파트너 “그동안 한국 산업계에서는 ‘파트너’에 대한 개념이 많이 없었다”며 “정부가 친환경 산업 기업을 묶어 하나의 팀처럼 발전시킬 필요가 있다”고 말했다. 정부도 산업계의 목소리를 듣고 이를 정책에 최대한 반영하겠다는 의지를 보이고 있다. 김상협 대통령직속 탄소중립녹색성장위원회 공동위원장은 “정부에게 요구하는 정책에 대해 잘 검토하고 응답하겠다”며 “정부와 기업이 친환경 산업에 적극 투자해 선순환할 수 있는 구조를 만들겠다”고 말했다. 이병철 기자 안녕하세요. 조선비즈 이병철입니다. 과학계 전반을 취재하고 있습니다. 흥미롭고 생생한 과학 소식을 전합니다. 안녕하세요. 조선비즈 이병철입니다. 과학계 전반을 취재하고 있습니다. 흥미롭고 생생한 과학 소식을 전합니다. 오늘의 핫뉴스 싸도 너무 싸… '초저가' 中 직구 상품에 휘청이는 韓 유통 계속 쓰러지던 환자가 '벌떡'… 파킨슨병 위한 '新 치료법' 갑질의 대명사… 스스로 자초한 위기에 발목 잡힌 대기업 저가 공세로 中에 밀렸다… 시장 되찾을 韓 동박의 타개책 능력 보이려 HMM 인수 추진?… 시험대 오른 하림 큰아들 IT 많이 본 뉴스 삼성전자, 낸드플래시 가격 20% 더 올린다… 공급자 중심으로 바뀐 메모리 반도체 시장 삼성전자가 올 3분기에 이어 내년 상반기에도 낸드플래시 가격을 20% 인상하며 메모리 반도체 수익성 강화에 나설 것이라는 관측이... 롤드컵 4강 진출 1팀만 LCK… “안방서 LPL 잔치” 한국에서 열린 2023 리그 오브 레전드(LoL) 월드 챔피언십(롤드컵)에서 중국 ‘LoL 프로 리그(LPL)’의 기세가 거세다. T... [위기의 카카오]① ‘혁신의 아이콘’에서 ‘갑질 플랫폼’으로 낙인 카카오는 2010년 3월 국민 메신저 ‘카카오톡’을 출시, 서비스 1년여 만에 가입자 1000만명을 확보했다. 당시 통신사들이 유료로 ... 100자평 도움말삭제기준",
    "originSummary": [
      "전문가들은 대한민국 정부가 국내 친환경 산업 촉진을 위해 더 적극적인 역할을 수행해야 한다고 주장하였습니다.",
      "아메리카 인플레이션 감소법(IRA) 모델 채택을 권장하여 친환경 기술에 대한 투자를 장려하는 것이 필요하다고 합니다.",
      "한화솔루션의 김기홍 대표는 재생에너지 생산에 대한 세금 혜택과 보조금의 필요성을 강조했으며, 페로브스카이트 탠덤을 다음 세대 기술로 개발하는 데 투자하고 있습니다. 또한 전문가들은 2차 배터리 재활용을 촉진하기 위한 공공 인프라가 필요하다고 촉구하였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "전문가들은 한국 정부가 국내 친환경 산업을 적극적으로 홍보하는데 더 역할을 해야한다고 촉구하였습니다. 또한 그들은 환경친화적 기술 투자를 촉진하기 위해 미국의 인플레이션 감소법 (IRA) 모델을 채택할 것을 권장하였습니다.",
      "한화 솔루션의 김기홍 사장은 재생 에너지 생산에 대한 세금 혜택과 보조금의 필요성을 강조하였습니다. 그의 회사는 차세대 기술로서의 페로브스카이트 탄덤 개발에 투자하고 있습니다.",
      "전문가들은 또한 부차 배터리 재활용을 촉진하기 위한 공공 인프라를 촉구하였고, 정부는 산업 관련 정책 요구사항을 검토할 의향을 보이고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "현대백화점 지누스, 월마트의 지속 가능성 중시하는 2023 소싱 재생정상회의에서 탑4 협력사 선정",
    "originLink": "https://biz.sbs.co.kr/article/20000142926",
    "originBody": "현대백화점 지누스, 美 월마트 친환경 협력사에 선정 - SBS Biz {\"@context\":\"http://schema.org\",\"@id\":\"20000142926\",\"@type\":\"NewsArticle\",\"headline\":\"현대백화점 지누스, 美 월마트 친환경 협력사에 선정\",\"datePublished\":\"2023-11-07T10:08:00+09:00\",\"dateModified\":\"2023-11-07T10:24:00+09:00\",\"description\":\"현대백화점그룹 계열의 글로벌 가구&middot;매트리스 전문기업 지누스는 세계 최대 소매 유통업체 ‘월마트(Walmart)&#39;가 주관한 &#39;2023 자원 재생 회담(2023 Sourcing Regeneration Summit)&#39;에서 지속 가능성을 중시하는 대표 협력사 TOP4에 선정됐다고 오늘(7일) 밝혔습니다.&…\",\"author\":{\"@type\":\"Person\",\"name\":\"전서인 기자\"},\"image\":{\"@type\":\"ImageObject\",\"url\":\"https://img.biz.sbs.co.kr/upload/2023/11/07/iWs1699319273174-850.png\"},\"alternateName\":\"SBS Biz\",\"publisher\":{\"@type\":\"Organization\",\"name\":\"SBS Biz\",\"logo\":{\"@type\":\"ImageObject\",\"url\":\"https://biz.sbs.co.kr/favicon.ico\",\"width\":60,\"height\":60}},\"url\":\"https://biz.sbs.co.kr\",\"mainEntityOfPage\":{\"@type\":\"WebPage\",\"@id\":\"https://biz.sbs.co.kr/article/20000142926\"}}window.dataLayer = window.dataLayer || []; function gtag(){dataLayer.push(arguments);} gtag('js', new Date()); gtag('config', 'UA-135761934-1'); gtag('config', 'G-H4172WGJY4');location.href=\"http://oops.cloud.sbs.co.kr/browser.html\"var gnbContainer = {}; var articleContainer = {}; $(document).ready(function() { if(typeof GnbContainer !== 'undefined') { gnbContainer = new GnbContainer('app-cnbc-front'); gnbContainer.event.rendered = function(target) { articleContainer = new ArticleContainer(target, 20000142926); articleContainer.initialize(); articleContainer.render(); }; gnbContainer.initialize({ type : 'common' }); gnbContainer.render(); } });",
    "originSummary": [
      "현대백화점의 가구 및 매트리스 전문 기업 '지너스'가 지속 가능성을 중요시하는 월마트에서 주최한 2023 Sourcing Regeneration Summit의 상위 4개 협력 기업 중 하나로 선정되었습니다.",
      "이는 월마트에서 친환경에 대한 중요성을 인지하고 지속 가능한 비즈니스 모델을 적극적으로 지원하려는 의지를 보여주고 있습니다.",
      "이번 선정을 통해 '지너스'는 지속 가능한 가치 창출에 대한 기업의 이해와 그에 따른 실질적인 행동을 인정받았다는 의미입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "현대백화점의 가구 및 매트리스 전문 브랜드인 Zinus가 지속가능성을 중요시하는 월마트가 주최하는 2023년 Sourcing Regeneration Summit의 상위 네 공동기업 중 하나로 선정되었습니다.",
      "이는 월마트가 지속 가능성을 중요시하는 곳에서 인정받은 Zinus의 지속 가능한 가치를 보여줍니다.",
      "현대백화점의 가구 및 매트리스 전문업체로서의 Zinus의 성공은 월마트와 같은 글로벌 소싱 플랫폼에서 인정받음으로써 크게 부각되었습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "'오마이뉴스', 모바일 앱에서 실행하는 '친환경 서비스'로 기부 포인트 얻어 사회적 환경 책임 이행",
    "originLink": "https://www.ohmynews.com/NWS_Web/View/at_pg.aspx?CNTN_CD=A0002975817",
    "originBody": "메뉴 건너뛰기 사이트 전체보기 오마이뉴스 인기기사 topHistory 오마이뉴스 이용가이드 모바일 이용안내 뉴스 전체기사 정치 경제 사회 교육 미디어 민족·국제 여성 만평·만화 해외리포트 피클 카드뉴스 사는이야기+ 사는이야기 여행 책동네 문화 지역 광주전라 부산경남 대전충청 인천경기 대구경북 강원제주 서울 시리즈 전체연재 프리미엄연재 전체 연재기사 인기 연재기사 추천 연재기자 스타 전체기사 인터뷰 스페셜 갤러리 스포츠 페북 트위터 카스 TV 전체영상 추천영상 저자와의 대화 10만인특강 페북 트위터 유튜브 Photo 오늘의사진 포토갤러리 뉴스사진 스타사진 페북 트위터 10만인클럽 소개 후원하기 추천기사 특강 게시판 내클럽정보 페북 트위터 로고오마이북 로고시민기자학교 로고꿈틀비행기 오마이뉴스 SNS 페이스북 트위터 카카오스토리 네이버포스트 인스타그램 유튜브 오마이스타 오마이포토 오마이TV 10만인클럽 오마이북 검색 기사제보 공지사항 로그인 전체기사 사는이야기+ 지역 랭킹30 특별면 시리즈 논쟁 팩트체크 그룹 오마이뉴스취재후원 시민기자기사쓰기 내방 로그인 회원가입 정치 경제 사회 교육 미디어 민족·국제 여성 만평·만화 해외리포트 피클 카드뉴스 사는이야기 문화 여행 책동네 광주전라 대전충청 부산경남 강원제주 대구경북 인천경기 서울 연재 특별기획 카드뉴스 특별면 '친환경 우정서비스' 이용하고~ 기부 포인트도 쌓고~ 페이스북 트위터 공유하기 추천 댓글 원고료로 응원원고료로 응원 오마이뉴스(스타)에서는 누구나 글을 쓸 수 있습니다 춘천 0.6℃ 경제 '친환경 우정서비스' 이용하고~ 기부 포인트도 쌓고~ 우체국 앱 '에코 챔피언 챌린지' 8일 오픈... \"경품도 받고 친환경 단체에 기부도 하세요\" 23.11.07 14:01l최종 업데이트 23.11.07 14:22l 유창재(karma50) 크게l 작게l 인쇄l URL줄이기 스크랩 0 원고료로 응원하기 공감0 댓글댓글달기 ▲ 우정사업본부는 우체국 모바일 앱에서 친환경 서비스를 이용할 때마다 고객에게 기부 포인트가 지급되는 ‘에코 챔피언 챌린지’를 8일부터 진행한다. ⓒ 우정사업본부관련사진보기 우체국 모바일 앱에서 친환경 서비스를 이용할 때마다 고객에게 기부 포인트가 지급되는 '에코 챔피언 챌린지'가 8일부터 진행된다. 과학기술정보통신부 우정사업본부(본부장 조해근)는 7일 이같이 밝히면서 \"기부 포인트는 우체국뱅킹과 우체국페이, 우체국쇼핑 등 우체국 모바일 앱에서 친환경 서비스를 이용 시 지급된다\"고 설명했다. 우정사업본부에 따르면, 우체국뱅킹 앱에서 '초록별사랑 정기예금' 상품 가입시 2000포인트, '디지털 OTP'를 발급하면 300포인트가 각각 기부금으로 쌓인다. 또 우체국페이 앱으로 우편창구에서 '우편·소포요금 간편결제'를 하면 회당 300포인트, 우체국쇼핑 앱 또는 웹에서 '에코 챔피언 챌린지 기획전' 친환경 상품 구입시 회당 500포인트의 기부 포인트를 적립 받을 수 있다. 이렇게 적립된 기부 포인트는 다음달 중 '사랑의열매 그린열매 나눔캠페인'에 고객 명의로 기부될 예정이다. 우정사업본부는 다음달 3일까지 진행되는 '에코 챔피언 챌린지'의 활성화를 위해 친환경 서비스 이용 고객 100명을 추첨해 친환경 제품(3만 원 상당)을 증정한다. 그리고 기부 포인트 누적액이 가장 많은 고객 3명을 '에코 챔피언'으로 선정, 감사패 등 추가 혜택을 제공한다. 한편, 우정사업본부는 한 달여간 프로모션을 거친 뒤 내년에 정식 서비스로 출시할 계획이다. 조해근 우정사업본부장은 \"평소 친환경 실천에 관심이 있었다면 이번 기회에 우체국 에코 챔피언에 도전해 보기 바란다\"면서 \"우체국 고객에게 가치소비를 손쉽게 경험할 수 있는 계기를 마련함과 동시에, 정부기관으로서 사회적·환경적 책임을 다하는 ESG경영을 지속할 수 있도록 노력하겠다\"고 말했다. 저작권자(c) 오마이뉴스(시민기자), 무단 전재 및 재배포 금지 오탈자 신고 태그:#우정사업본부, #에코챔피언챌린지 추천 댓글 스크랩 페이스북 트위터 공유 이 기사가 마음에 드시나요? 좋은기사 원고료로 응원하세요 원고료로 응원하기 네이버 채널구독 다음 채널구독 글 유창재 (karma50) 내방 구독하기 트위터 용산 대통령실 마감, 세종에 둥지를 틉니다. 진실 너머 저편으로... 이 기자의 최신기사복지부 \"지역·필수의료 혁신은 국민 생명·건강 지키기 위한 것\" 갤러리 오마이포토 ＞ 대화 나누며 걷는 윤석열-박근혜 1/7 이태원참사 1주기'기억과 안전의 길' 조성 '완벽한 결혼의 정석' 회귀 로맨스 복수극 '뉴 노멀' 고립과 말세의 뉴 호러 태민 네 번째 미니앨범 'Guilty', 통제된 삶을 벗어나 독자의견 l댓글 0개ll독자원고료 0원 /0건 오마이TV [이 사람, 10만인] “윤석열식 ‘자유’는 힘센 자만을 위한 것”...박호성... top 클럽아이콘10만인클럽 가입으로 오마이뉴스를 후원해 주세요. Tel. 02-733-5505 (내선번호 0번) 오마이뉴스 취재후원 모바일 팟캐스트 RSS 페이스북 트위터 카카오스토리 네이버포스트(새창) 인스타그램 유튜브 뉴스 전체기사 정치 경제 사회 교육 미디어 민족·국제 여성 만화·만평 해외리포트 피클 카드뉴스 사는이야기+ 사는이야기 여행 책동네 문화 지역 광주전라 부산경남 대전충청 인천경기 대구경북 강원제주 시리즈 전체연재 프리미엄연재 전체 연재기사 인기 연재기사 추천 연재기자 특별면 스타 전체기사 인터뷰 스페셜 갤러리 스포츠 TV 전체영상 추천영상 저자와의 대화 10만인특강 Photo 오늘의 사진 포토갤러리 뉴스사진 스타사진 10만인클럽 소개 후원하기 추천기사 특강 게시판 내클럽정보 인기기사 생나무글 Top History 오마이뉴스 이용가이드 모바일 이용안내 공지사항 오마이북 시민기자학교 international 회사소개 광고안내 이용안내/문의 언컷정보 제휴문의 개인정보처리방침 청소년보호정책(책임자 이준호) RSS 페이스북 트위터 제호 : (주)오마이뉴스 사업자번호: 101-81-53828 인터넷신문 등록번호: 서울아00045등록일자 : 2005.09.09최초발행일 1999.12.21발행·편집인: 오연호 (주)오마이뉴스 주소: 서울특별시 마포구 월드컵로14길 42-5 ㅣ TEL(02)733-5505 ㅣ FAX(02)733-5011,5077 Copyright ⓒ 1999 - 2023 OhmyNews all rights reserved",
    "originSummary": [
      "한국의 뉴스 플랫폼 \"오마이뉴스\"가 모바일 앱에서 환경 친화적인 서비스인 \"에코 챔피언 챌린지\"를 출시하였습니다.",
      "사용자들은 앱 내에서 환경 친화적인 서비스를 이용함으로써 기부 점수를 얻고, 이 점수는 \"사랑의 과일 녹색과일 나눔 캠페인\"에 기부됩니다.",
      "이 서비스는 녹색 행동을 장려하고 사회적, 환경적 책임을 이행하는 데 도움을 줍니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 뉴스 플랫폼 \"오마이뉴스\"가 모바일 앱에서 \"에코 챔피언 챌린지\"라는 친환경 서비스를 시작합니다.",
      "이 앱의 친환경 서비스를 활용하면 사용자에게 기부 포인트가 주어지며, 이들 포인트는 \"사랑의 열매 녹색 열매 나눔 캠페인\"에 기부됩니다.",
      "이 서비스는 녹색 행동을 촉구하고 사회 및 환경 책임을 이행하는 것을 장려합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "한국섬유개발연구원·에코플레이스, 친환경 플라스틱 대체 토목자재 개발",
    "originLink": "https://www.hankyung.com/article/202311079089h",
    "originBody": "산업 한국섬유개발연구원· 에코플레이스, 친환경 포장 토목자재 개발 오경묵 기자 기자 구독 입력2023.11.07 16:09 수정2023.11.07 16:09 글자크기 조절 기사 스크랩 기사 스크랩 공유 공유 댓글 0 댓글 클린뷰 클린뷰 프린트 프린트 칡 활용 친환경 부직포 식품 포장 용기. 한국섬유개발연구원 제공 에코플레이스(대표 박철준)가 한국섬유개발연구원(원장 호요승)에서 지원하는 ‘이업종융합 비즈니스기반 조성’ 사업으로 산림자원인 칡에서 추출한 천연섬유를 활용해 식품 포장용 일회용기와 보행 매트를 개발, 출시를 앞두고 있다. 칡은 생명력이 강하고 주위 다른 식물의 양분을 모조리 빨아먹는 탓에 주변을 황폐하게 만들기 때문에 음식 재료로 보편화된 국내에서조차 유해식물로 지정되어 칡 제거를 전문적으로 하는 직업까지도 존재한다. 수거한 칡을 자연건조 및 고열 롤러에서 건조한 뒤 전분과 같은 이물질과 불순물을 제거하는 등의 전처리 과정을 거쳐 부직포를 제조한 후 제품화했다. 개발된 부직포는 내구성능 평가를 거쳐 기존 플라스틱과 스티로폼을 대체하는 일회용 식품 포장 용기로 제조하였다. 해당 제품은 유해 원소 및 잔류농약 검출 시험(KS K 0732)과 어린이 제품 공통안전기준(산업통상자원부 고시 제2021-229호)을 통과하여 안전하게 사용할 수 있으며, 생산된 제품은 주로 과일, 육류 등을 포장하는 용도로 사용하게 된다. 특히, 해당 소재로 만든 식품 용기는 폐기 후 생분해되어 다시 자연으로 돌아가는 친환경 자원순환 제품이다. 개발 부직포 소재는 토목 자재로도 사용된다. 등산로와 산책로에 주로 사용되는 기존 야자 보행매트는 밧줄 형태로 엮여 있어 단단하지 못해 시간이 조금만 지나면 풀어지거나 부서지는 문제가 발생한다. 풀린 밧줄에 보행자가 걸려 넘어지는 사고도 빈번하게 발생하기 때문에 합성섬유를 섞어 강도를 높인 제품이 많이 사용되는데 이는 사용 후 폐기 시 환경 문제를 유발한다. 하지만 에코플레이스가 개발한 보행매트는 밧줄 형태가 아닌 부직포 형태로 표면이 매끈하여 풀어지거나 보행자가 밧줄에 걸려 넘어질 위험이 없다. 또한 제품 가격 및 설치를 포함한 비용이 기존 제품 대비 1/10 수준으로 저렴하다. 현재 전라남도 신안군 신의면에 위치한 황성금리해수욕장의 해안 보도에 칡 보행 매트를 설치하여 시범 사용 중이다. ktdi와 에코플레이스는 지난 1월 전라남도 산림자원연구소와 함께 ‘산림자원 활용 친환경 소재 개발’을 위한 업무협약을 체결했다. 또 ktdi가 수행하는 ‘이업종융합 비즈니스기반 조성사업’은 지역 섬유 기업을 대상으로 섬유산업과 타 산업의 융합기술 및 제품개발을 통해 매년 탁월한 성과를 내고 있다. 오경묵 기자 기사 스크랩 기사 스크랩 공유 공유 프린트 프린트 좋아요 싫어요 후속기사 원해요 ⓒ 한경닷컴, 무단전재 및 재배포 금지 한국경제 구독신청 모바일한경 보기 관련 뉴스 1 인공지능 피트니스 플랫폼 '하이랙스', 선릉점 오픈 피트니스 시장의 디지털 트랜스포메이션을 리드하고 있는 인공지능 피트니스 플랫폼 '하이랙스(HIRAX)'가 강남점, 평촌점에 이어 선릉점을 개장했다.피트니스 센터의 게임 체인저로 주목받고 있는 하이랙스는 '도심 속 나만의 활력 충전소'를 슬로건으로 내세워 기술적, 공간적 혁신을 통해 만족감 높은 운동 경험을 제공하는 데 초점을 맞춘 곳이다.들어서는 순간, 오감으로 느낄 수 있는 호텔 피트니스 센터 수준의 세련되고 프리미엄한 공간부터 인상적이라는 평이다. 공기 정화 시스템이 실시간으로 공기를 모니터링하여 땀 냄새 등이 전혀 없는 쾌적함을 운동 내내 느낄 수 있다. 공간 곳곳은 편안한 운동을 만들어 내는 인테리어와 식물들이 배치되어 마치 자연에서 운동하는 것과 같은 힐링을 느낄 수 있다.운동 후 손쉽게 단백질 보충을 도와주는 무인 멀티 판매기, 커피를 마시며 휴식과 업무도 볼 수 있는 라운지도 마련되어 단순히 운동만이 아닌 지속 가능한 웰니스 라이프 공간을 구현시켰다. 샤워실은 개인의 프라이버시를 고려한 1인 부스형이며, 다이슨 드라이어기, 록시땅 어메니티 등이 구비되어 있어 운동 후의 시간까지 높은 만족감을 선사한다.공간뿐만 아니라 혁신적인 운동 프로그램과 시설도 좋은 평가를 받고 있다. 디랙스가 개발한 인공지능 운동 가이드 랙스(RAX)가 하루 40분의 운동만으로도 최상의 효과를 누릴 수 있게 맞춤형 운동 솔루션을 제공한다. 랙스는 10여 년간의 스포츠 과학 데이터를 스터디해 사용자의 체형별 특성과 운동 목적, 수행 능력에 따라 운동 프로그램을 제공해 주며 개인의 운동 데이터를 분석하여 매일 매일 다른 운동가이드를 제공하기 때문에 하이랙스에선 누구나 균형 잡힌 헬스케어가 가능하다. 웨이트와 유산소, 스트레칭 머신 등 수십 여종의 다양한 기구가 배치되어 기다림없이 운동할 수 있다.특히 이번에 개장한 선릉점은 등록부터 예약, 결제까지 센터 이용에 필요한 전 과정을 100% 자동화한 디지털 매니지먼트 시스템을 도입해 오픈과 동시에 호평을 받고 있다. 회원 등록은 디랙스핏 앱 또는 키오스크를 통해 셀프로 가입 가능하며, 결제는 디랙스핏 앱에 카드만 등록해 두면 매달 자동으로 처리된다. 사용할수록 월회비가 저렴해지는 구독시스템은 디지털 매니지먼트 시스템의 백미이다. 센터 이용 시엔 입구에 배치된 안면 인식 시스템을 통해 간편하게 입장하고 락커까지 무인으로 배정받을 수 있어 안내데스크를 방문하고 대기하는 번거로움이 일절 없다.또한 선릉점은 피트니스를 병행하는 골프인들의 니즈를 적극 수용해 스크린 골프 머신 7개와 골프 퍼팅존을 마련하였다.하이랙스의 유선경 대표는 \"건강수명은 현시대의 키워드이며 개인 삶의 질을 결정하는 핵심가치가 되었다. 이에 따라 운동을 통한 체력 및 체형관리의 부가가치는 나날로 높아지고 있다\"면서 \"이러한 가치 소비 시대를 맞아 하이랙스는 단순히 운동만 하는 곳이 아니라, 이용자를 쾌적하고 편안한 프리미엄 공간에서 최첨단 인공지능 피트니스 솔루션을 통해 '운동의 품격을 높여주는 곳'으로 만들고자 기획하였으며, 실제 강남점 이용객을 보았을 때 주변 2030대의 많은 직장인들이 운동을 계속하고 싶게 만드는 공간이라는 평과 함께 매우 높은 재등록률을 보이고 있다\"고 말했다.박준식기자 parkjs@wowtv.co.kr 2 안성터미널~이천터미널 시내버스 노선 13일 운행 개시 경기 안성시는 오는 13일 안성~이천 직행좌석형 시내버스 8203번 노선이 운행을 시작한다고 7일 밝혔다. 안성시와 이천시는 인접해 있으면서도 오가는 대중교통편이 마땅하지 않아 시민들이 불편을 겪어왔다. 이번에 신설된 8203번 노선은 안성종합버스터미널에서 동아방송예술대, 두원공대, 죽산시장, 이천테르메덴, 이천역, 이천종합터미널 등을 경유한다. 이천역에서 경강선 전철을 이용하면 판교역은 30분, 여주역은 15분 안에 이동할 수 있다. 시는 시내버스 노선 시설로 서울이나 이천에서 관내 대학이나 '소부장 특화단지' 등에 접근성이 개선될 것으로 전망했다. 안성시 관계자는 \"경기 동부권역을 오가는 시내버스 노선 신설로 인접 도시인 이천시와의 교류도 활성화할 것\"이라며 \"향후 해당 노선을 경기도 공공버스 노선으로 전환하는 계획도 검토 중\"이라고 말했다. '경기도 공공버스'는 영구면허로 운영하는 민영제와 달리 버스 노선을 공공이 소유하고 경쟁입찰을 통해 선정한 운송사업자에게 한정면허를 줘 운영하는 제도다. /연합뉴스 3 카카오모빌리티, 다른 택시 플랫폼에 카카오T 개방 13일 택시 단체 간담회 원칙 밝혀…'매각설'엔 선 그어 카카오모빌리티가 다른 택시 플랫폼에 카카오T 플랫폼을 개방하기로 했다. 카카오모빌리티는 7일 기자들에게 배포한 '알림 자료'를 통해 오는 13일 택시 단체들과 비공개 간담회에 임하는 원칙과 기준을 천명하면서 이같이 밝혔다. 카카오모빌리티는 \"앞으로의 카카오T 플랫폼 전반의 운영 방식을 전향적으로 바꾸겠다\"며 \"특히 독과점 논란과 관련해 다른 택시 플랫폼에 카카오T 플랫폼을 개방하는 등 이동의 질을 높이고 상생하는 데 집중하겠다\"고 강조했다. 그간 카카오T 블루 외 다른 가맹 택시나 일반 택시를 호출(콜)에서 배제한다는 차별 문제가 꾸준히 제기된 데 따른 조처로 풀이된다. 회사는 이어 모빌리티 종사자들을 위해 추진하는 상생 협력 활동을 확대하고, 적극적인 해외 진출을 통해 글로벌 모빌리티 기업으로 환골탈태하겠다고 덧붙였다. 카카오모빌리티는 윤석열 대통령의 공개 비판을 받은 카카오 택시의 운영 방식과 시스템 체계를 전면 개편 방침도 공언했다. 회사는 \"공공재적 성격이 있는 택시의 특수성을 고려해 택시 기사들과의 간담회를 통해 저렴한 수수료 체계를 구체화·현실화하겠다\"면서 \"비판받아온 가맹 택시 사업 구조 역시 원점에서 재검토하겠다\"고 역설했다. 앞서 윤 대통령은 지난 1일 서울 마포구의 한 북카페에서 비상경제민생회의를 주재하며 \"소위 약탈적 가격이라고 해서 돈을 거의 안 받거나 아주 낮은 가격으로 해서 경쟁자를 다 없애버리고, 시장을 완전히 장악한 다음에 독점이 됐을 때 가격을 올려서 받아먹는 것\"이라며 카카오모빌리티를 강하게 질타했다. 카카오모빌리티의 가맹 택시 사업은 기사들이 운임 20%를 카카오모빌리티에 수수료로 내는 가맹 계약과 회사가 운임의 15∼17%를 기사들에게 돌려주는 제휴 계약으로 이뤄져 있다. 지난해 국정감사 등에서 이런 이중구조 계약 방식이 문제로 지적된 데 이어, 올해 금융감독원은 이를 분식회계로 간주하고 카카오모빌리티를 감리 중이다. 다만, 카카오모빌리티는 일부에서 제기하는 매각설은 모회사인 카카오가 전혀 고려하는 사항이 아니라고 강조했다. 카카오모빌리티는 오는 13일 오후 택시 4단체를 비롯한 전국 가맹 택시 단체들과 의견 수렴을 위한 비공개 간담회를 개최한다. 이 자리에는 카카오모빌리티 류긍선 대표가 참석할 예정이다. 카카오 창업자인 김범수 미래이니셔티브 센터장은 간담회에 참석하지 않는다. 카카오모빌리티는 연내 의견 수렴을 끝내고 실행안을 발표할 계획이다. /연합뉴스 오늘의 주요뉴스 가계빚 조이려 주담대 금리 올리더니 다시 내렸다…'대혼란' '최대 20%'…주세 깎아 소주·위스키 가격 낮춘다 단독 직원이 '2800억 대출계약서' 위조…미래에셋 '발칵' \"3000만원 내더라도 사업 접겠다\"…다주택자들 '줄포기' 환율 10.6원 반등…전날 하락폭 40% 반납 한경 외환시장 워치 이 시각 관심정보 AD",
    "originSummary": [
      "EcoPlace와 한국 섬유 발전 연구소는 침엽 능선 섬유로부터 친환경 포장재와 보행 경로를 개발하고 있습니다.",
      "이들 생분해성 제품들은 플라스틱과 폼을 대체할 수 있습니다.",
      "이 제품들은 이미 한국의 한 해변에서 테스트 되었습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "에코플레이스와 한국섬유개발원은 칡 섬유로 생태 친화적인 포장재와 보행용 매트를 개발 중입니다.",
      "이 생분해성 제품들은 플라스틱과 폼을 대체할 수 있으며, 한국의 해변에서 테스트 되었습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "BC카드와 환경부, 50% 이상 생물 자원 플라스틱으로 만든 친환경 신용카드 '어디로든 그린카드' 출시",
    "originLink": "https://m.ddaily.co.kr/page/view/2023110715143776835",
    "originBody": "검색 실시간 뉴스 검색 뉴스 산업 경제 생활 오피니언 거버넌스 세미나/컨퍼런스 뉴스 BC카드, 친환경 소비 '어디로든 그린카드' 출시…\"탄소 중립 실현 앞장\" 디지털데일리 발행일 2023-11-07 16:05:00 권유승 기자 공유하기 카카오톡 페이스북 트위터 네이버블로그 URL복사 BC카드가 환경부와 함께 리뉴얼된 ‘어디로든 그린카드’ 상품을 출시했다. 사진은 7일 오후 명동에서 열린 ‘어디로든 그린카드 출시’ 기념행사장에서 한화진 환경부 장관(왼쪽 다섯번째), 최원석 BC카드 대표이사 사장(왼쪽 첫번째) 등 주요 관계자가 기념사진을 촬영하는 모습. ⓒBC카드 [디지털데일리 권유승 기자] BC카드는 친환경 신용카드 상품 ‘어디로든 그린카드’로 녹색소비 문화 정착을 넘어 국가적 탄소중립 실현에 앞장서겠다고 7일 밝혔다. ‘어디로든 그린카드’ 출시 기념행사가 이날 오후 명동에서 한화진 환경부 장관, 정완규 여신금융협회 회장, 최원석 BC카드 대표이사 사장 등 주요 관계자가 참석한 가운데 열렸다. 그린카드는 BC카드가 환경부와 함께 녹색소비 문화 유도를 위해 지난 2011년 처음 출시한 신용카드 상품이다. 녹색소비에 특화된 카드인 만큼 재생플라스틱이 50% 이상 함유된 친환경 플레이트로 발급하고 있다. 친환경 소비 생활을 실천할 때마다 ‘에코머니 포인트’ 적립 혜택을 제공하고 있다. 이번에 새롭게 리뉴얼한 ‘어디로든 그린카드’는 친환경 이동수단에 특화된 혜택으로 구성됐다. 기존 그린카드 상품의 경우 범용적인 녹색소비에 대한 소비자 관심을 ‘유도’하는 차원이었다면, ‘어디로든 그린카드’는 집중적인 녹색소비 유도를 통해 본격적으로 탄소배출 저감에 기여할 것이라는 게 BC카드의 설명이다. 먼저 전기차 및 수소차 등 친환경 차량 충전요금에 대해 전월실적에 따라 20~40% 에코머니 포인트 적립 혜택을 제공한다. 특히 내년 12월 31일까지 해당 카드를 발급받고 전 가맹점에서 월 30만원 이상 이용 시 친환경 차량 충전요금에 대해 최대 40% 캐시백을 매월 추가 제공한다. 도합 최대 80% 수준이다. 또 쏘카·그린카 등 공유모빌리티, 대중교통, 고속버스 이용요금에 대해서도 각각 10% 적립 혜택을 제공한다. 전 가맹점 0.2% 적립, 커피전문점 10% 적립 등 일상 영역에서도 에코머니 포인트 혜택을 제공한다. 주요 편의점, 백화점, 마트, 서점 등 에코머니 제휴 가맹점에서 친환경제품 구매 시 최대 25% 에코머니 포인트를 적립해준다. 기존 그린카드 상품 대비 적립 혜택을 10%p 강화했다. 체육센터, 문화센터, 수영장 등 전국 공공시설 이용요금에 대해 할인 또는 무료 입장 혜택도 제공한다. 고객은 전월실적에 따라 매월 최대 4만 에코머니 포인트를 적립할 수 있다. 적립 혜택을 적용 받은 매출 건도 전월실적에 포함된다. 소비자는 적립한 에코머니 포인트를 ▲BC TOP포인트·현금 전환 ▲이동통신 요금·대중교통 결제 ▲상품권 교환(롯데마트, 이마트, 홈플러스) ▲친환경 기부 등 실생활 곳곳에서 사용할 수 있다. ‘어디로든 그린카드’는 현재 IBK기업은행, NH농협카드, 대구은행, 부산은행, 경남은행, BC바로카드를 통해 발급받을 수 있다. 제주은행, 우체국에서도 내년 중 발급 개시 예정이다. 최원석 BC카드 사장은 “'어디로든 그린카드'는 결제 서비스를 기반으로 녹색소비 문화를 넘어 탄소중립 실현을 앞당길 핵심 매개체”라며 “앞으로도 BC카드는 글로벌 기업시민으로서 소비자 후생 제고는 물론 녹색소비의 긍정적 외부효과를 통해 친환경 산업 발전과 기후변화 대응에 앞장설 것”이라고 말했다. Copyright ⓒ 디지털데일리. 무단전재 및 재배포 금지 당신이 좋아할 만한 뉴스 KAIST에 두번째 양자대학원…\"2031년까지 박사급 180명\" [KT컨콜] IoT 회선 늘린 LGU+ 저격…4분기 영업익 개선 전망(종합) LGU+ 인터넷 장애 발생…“오류 복구 후 순차 정상화” 안랩, 디자인 간판 기업 ‘아트시스’에 보안 특화 클라우드 관리 서비스 지원 [KT컨콜] “최적의 DX 파트너”…초거대 AI ‘믿음’으로 B2B 시장 공략 박차 [KT컨콜] 4분기 영업익 개선 전망…“사업성장·비용절감 노력 지속” DD 마이크로 사이트 자세히 보기 > 자세히 보기 > 오피니언 인터뷰 [인터뷰] AI 급부상으로 수혜 누리는 서버 시장… ‘1위’ 자신감 내비치는 델 인터뷰 [인터뷰] 트렌드마이크로 “급증하는 공격표면, 비즈니스 위협으로 이어진다” 통신*방송 알카텔-루슨트 엔터프라이즈, 韓 기업시장 본격 공략…“올해 20% 성장 목표” 클라우드 [인터뷰] 빠르고 편한 해외 환전 내세우는 트래블월렛, AWS로 클라우드화 [KT컨콜] IoT 회선 늘린 LGU+ 저격…4분기 영업익 개선 전망(종합) 2023-11-07 17:55:26 LGU+ 인터넷 장애 발생…“오류 복구 후 순차 정상화” 2023-11-07 17:39:45 [KT컨콜] “최적의 DX 파트너”…초거대 AI ‘믿음’으로 B2B 시장 공략 박차 2023-11-07 17:22:10 [DD퇴근길] KT-LGU+, 나란히 영업익 감소…챗GPTs 공개 2023-11-07 17:15:33 [KT컨콜] 4분기 영업익 개선 전망…“사업성장·비용절감 노력 지속” 2023-11-07 17:15:17 [KT컨콜] 5년 내 100MW IDC 추가 확보…공공 클라우드·AI 풀스택 수요 기대 2023-11-07 17:01:16 현장 목소리 빠진 플랫폼 간담회…정부 입장 재확인에 그쳐 2023-11-07 19:45:02 [DD's톡] 넷마블, 5688억원 규모 ‘하이브’ 지분 왜 팔았을까? 2023-11-07 18:45:53 위메이드, 역대 분기 최대 매출 경신… ‘나이트크로우’‧‘미르’가 쌍끌이 2023-11-07 17:58:17 [컨콜종합] 제2의 배그, 성수동서 나올까…배동근 CFO “앱수수료 많이 내고파” 2023-11-07 17:56:37 [컨콜] 크래프톤 “BGMI 더 성장할 것… 수익성 보다는 이용자가 우선” 2023-11-07 17:54:28 [컨콜] 크래프톤, ‘다크앤다커모바일’ 내년 상반기 출시… “법적 판단 보고 합리적 운영 계획” 2023-11-07 17:21:50 x 로그인 뉴스레터 구독 PC버전 주소 : (04057)서울특별시 마포구 신촌로14길 24(노고산동 54-46)전화 : 02-334-7781 사업자 등록번호 : 101-86-13419등록번호 : 서울아00039 대표자 : 양경진편집국장 : 채수웅청소년보호책임자 : 오주엽 댓글 삭제 Close 댓글삭제",
    "originSummary": [
      "BC 카드와 환경부는 50% 이상의 바이오자원 플라스틱으로 만든 친환경 신용카드 '어디서나 그린 카드'를 소개하였습니다.",
      "이 카드는 친환경적인 소비를 위한 혜택을 제공하며, 탄소 배출을 줄이고 전국적인 탄소 중립을 달성하기 위해 녹색 교통 수단 사용을 촉진합니다.",
      "이는 환경 친화적인 제품으로의 방향전환을 보여주는 특별한 사례로, 기술과 환경 보호의 중요성이 조화롭게 이루어졌다는 점에서 주목할 만합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "BC 카드와 환경부는 50% 이상의 생물자원 플라스틱으로 만든 친환경 신용카드인 '어디든그린카드'를 소개했습니다.",
      "이 카드는 친환경적인 소비를 위한 혜택을 제공하며, 탄소 배출을 줄이고 전국적인 탄소 중립을 달성하기 위해 녹색 교통 수단의 사용을 장려합니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  },
  {
    "title": "DKSH 코리아, Uteco와 함께 친환경 플렉소 인쇄 세미나 'FLEX-ON-ROAD' 개최",
    "originLink": "https://www.industrynews.co.kr/news/articleView.html?idxno=51444",
    "originBody": "친환경 선진 포장 솔루션 공급 나서 [인더스트리뉴스 최종윤 기자] 이탈리아의 인쇄기 제조 전문 업체인 우테코(Uteco)와 글로벌 마켓 확장 서비스 기업 ‘DKSH 코리아’가 지난 2일 양재 엘타워에서 친환경 플렉소 인쇄 세미나를 개최했다. 사진왼쪽부터 DKSH 기계사업부 김계림 대표, UTECO 리카르도 카마타 아시아 총괄 [사진=DKSH] FLEX-ON-ROAD란 이름의 이번 행사는 우테코가 전세계 플렉소 인쇄 산업 고객들을 대상으로 하는 기술 세미나로 유럽, 미국, 캐나다 등 다른 해외 국가에 이어 한국에서 15번째를 맞았다. 우테코 뿐만 아니라 코닥 미라클론(Kodak miraclon), 감마(GAMA), 대틀로이어(Daetwyler), 브로파인드(Brofind)를 포함한 인쇄 관련 4개 업체들도 각 기업의 제품과 기술력을 소개했다. DKSH 코리아 기계사업부 이근성 상무는 “종이 및 연포장 플렉소 인쇄 전문 기업 우테코를 통해 국내에도 친환경 선진 포장 솔루션을 공급하게 돼 무척 기쁘다”며, “다양한 국내 업체들과 만남을 가지면서 포장 인쇄 기술과 더불어 잉크, 닥터 블레이드, 솔벤트 회수 재활용 시스템과 같은 제반 솔루션에 대한 관심도 크다는 것을 알게 됐다”고 밝혔다. 우테코 리카르도 카마타(Ricarrdo Camatta) 아시아 총괄 매니져도 “DKSH와의 파트너십을 통해 한국 시장이 요구하는 최적의 솔루션을 공급할 수 있도록 최선을 다하겠다”고 말했다. 저작권자 © 인더스트리뉴스 무단전재 및 재배포 금지 최종윤 기자 다른기사 보기",
    "originSummary": [
      "이탈리아의 인쇄 장비 제조사 Uteco와 글로벌 시장 확장 서비스인 DKSH Korea가 양재 Eltower에서 친환경적인 플렉소그래픽 인쇄 세미나를 공동 개최하였습니다.",
      "'FLEX-ON-ROAD'라는 이름의 이번 세미나는 다양한 인쇄 회사들의 발표를 피처링한 것으로, 한국에서 15번째로 열린 세미나였습니다.",
      "DKSH Korea는 Uteco를 통한 첨단 친환경 포장 솔루션을 국내 공급에 가져오게 되어 기쁘다고 밝혔습니다. 또한, 잉크, 닥터 블레이드, 그리고 용매 회수 재활용 시스템 등을 포함한 전반적인 솔루션에 대한 관심이 증가하고 있다고 덧붙였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "이탈리아 프린팅 장비 제조사 Uteco와 글로벌 시장 확장 서비스 DKSH Korea는 양재의 Eltower에서 친환경 유연형 인쇄 세미나를 공동으로 주최하였습니다.",
      "'FLEX-ON-ROAD'라는 이번 행사는 다양한 인쇄 회사에서 발표를 특징으로 한 세미나로, 이는 한국에서 15번째로 개최된 것입니다.",
      "Uteco를 통해 고급 친환경 포장 솔루션을 국내 공급으로 가져올 것이라며 DKSH Korea는 잉크, 닥터 블레이드, 솔벤트 회수 재활용 시스템을 포함한 종합 솔루션에 대한 관심이 증가하고 있다고 밝혔습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699371476859
  }
]
