[
  {
    "id": 37425007,
    "title": "NSO ryhmä iPhone nollaklikkaus, nollapäivän hyödyntää kaapattu luonnossa",
    "originLink": "https://citizenlab.ca/2023/09/blastpass-nso-group-iphone-zero-click-zero-day-exploit-captured-in-the-wild/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37425007",
    "commentBody": "",
    "originSummary": [
      "Apple on julkaissut päivityksen, jolla korjataan Citizen Labin havaitsema nollaklikkaushaavoittuvuus, jota hyödynnettiin NSO Groupin Pegasus-vakoiluohjelman käyttöönotossa.",
      "Hyödyntämisketju, joka tunnetaan nimellä BLASTPASS, voi vaarantaa iPhonen, jossa on uusin iOS-versio, ilman uhrin vuorovaikutusta. Vastauksena Apple julkaisi kaksi CVE:tä (Common Vulnerabilities and Exposures), jotka ovat tunnuksia julkisesti tunnetuille tietoturvariskeille.",
      "Käyttäjien suositellaan päivittävän laitteensa ja ottavan Lockdown Mode -tilan käyttöön, mikä voi estää tämän hyökkäyksen. Tämä tapaus korostaa kansalaisyhteiskunnan organisaatioiden kohteeksi joutumista ja tarvetta niiden kyberturvallisuuden tukemiseen."
    ],
    "commentSummary": [
      "Keskustelu pyörii israelilaisen kyberturvallisuusyrityksen NSO Groupin ympärillä, jota on arvosteltu siitä, että se myy nollaklikkaamattomia nollapäivähyökkäyksiä iPhoneen, ja se on huolissaan siitä, että autoritaariset valtiot käyttävät sen ohjelmistoja aktivistien ja toimittajien tarkkailuun ja tukahduttamiseen.",
      "Käsitellään esimerkiksi Applen Lockdown Mode -rajoituksia, iMessagen turvallisuutta, turvatoimien tehokkuutta ja tarvetta vahvempiin suojauksiin haavoittuvuuksien poistamiseksi, mukaan lukien iPhonen aluelukituksen mahdolliset seuraukset.",
      "Keskustelu sisältää ehdotuksia turvallisuuden vahvistamiseksi, kuten fuzzing, muistinvarmojen kielten (kuten Rust) käyttö, hiekkalaatikkorajoitusten voittaminen sekä eettisten näkökohtien ja sääntelytoimenpiteiden merkitys kyberturvallisuusalalla."
    ],
    "points": 1113,
    "commentCount": 611,
    "retryCount": 0,
    "time": 1694118061
  },
  {
    "id": 37427227,
    "title": "Chrome seuraa nyt käyttäjiä ja jakaa \"aihealueluettelon\" mainostajien kanssa.",
    "originLink": "https://arstechnica.com/gadgets/2023/09/googles-widely-opposed-ad-platform-the-privacy-sandbox-launches-in-chrome/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37427227",
    "commentBody": "",
    "originSummary": [
      "Google on ottanut käyttöön Chromessa uuden mainosalustan nimeltä \"Privacy Sandbox\", joka tarkkailee käyttäjien toimintaa ja muokkaa verkkosivustojen mainosaiheiden luetteloa.",
      "Vaikka Google pitää tätä välttämättömänä vaihtoehtona kolmansien osapuolten seurantaevästeille - ja aikoo estää ne vuoden 2024 loppuun mennessä - kriitikot ehdottavat, että maailma ilman kohdennettuja mainoksia olisi jo kaukana.",
      "Chrome-käyttäjät voivat hallita tätä ominaisuutta selaimensa asetusten kautta, mikä antaa heille jonkinlaisen mahdollisuuden hallita prosessia."
    ],
    "commentSummary": [
      "Keskustelu käsittää lukuisia selaimiin liittyviä aiheita, kuten yksityisyyden suojaan liittyvät kysymykset, seurantakäytännöt, vaikutukset kilpailuun, uusien ominaisuuksien ja mainosten käyttöönotto, selaimen suorituskyky ja tiukemman sääntelyn tarpeellisuus.",
      "Keskustelua käydään myös mahdollisista vaihtoehdoista Google Chromen kaltaisille valtavirtaisille selaimille, sivustojen boteista, tietoturvan ja helppokäyttöisyyden välisestä kompromissista, käyttäjäagenttijonoista ja Googlen suhtautumisesta käyttäjätietoihin.",
      "Nämä keskustelut korostavat vallitsevia keskusteluja ja huolenaiheita verkkoselaimista ja käyttäjien yksityisyydestä."
    ],
    "points": 652,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1694130084
  },
  {
    "id": 37420281,
    "title": "Kagi Small Web",
    "originLink": "https://blog.kagi.com/small-web",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37420281",
    "commentBody": "",
    "originSummary": [
      "Kagi, web-hakualusta, on esitellyt Kagi Small Webin, innovatiivisen aloitteen, jossa keskitytään Internetin ei-kaupalliseksi segmentiksi kutsutun \"Small Webin\" näkyvyyden lisäämiseen.",
      "Tämä uusi palvelu kerää tuoretta tietoa käsin valituista blogeista, näyttää sen hakutuloksissa ja tarjoaa myös RSS-syötteen. Se on avoimen lähdekoodin palvelua, ja se sisältää erityisesti kuratoidun luettelon lähes 6 000 tarkistetusta verkkosivustosta. Kagi Small Webin tavoitteena on antaa henkilökohtaisempi hakukokemus, tuoda esiin vähemmän tunnettuja verkkopuolia ja korostaa Small Webin merkitystä.",
      "Kagi on myös esitellyt Kagi Small Web -sivuston, joka toimii ilman JavaScriptiä ja mahdollistaa käyttäjän vuorovaikutuksen, kuten viestien arvostamisen ja muistiinpanojen tekemisen. Käyttäjät voivat käyttää Kagi Small Webiä RSS-syötteen tai API:n kautta ja antaa palautetta tai osallistua eri alustojen kautta."
    ],
    "commentSummary": [
      "Kagi, pieni web-hakukone, on ottanut käyttöön uudenlaisen ominaisuuden, \"Small Web\", joka esittelee nimenomaisesti riippumattomien blogien ja verkkosivustojen sisältöä.",
      "Vaikka Kagi on saanut kiitosta käyttäjäystävällisestä käyttöliittymästä, yksityisyydensuojasta ja arvosta, sen sisältämiä linkkejä keskitettyihin alustoihin, kuten Twitteriin, on arvosteltu jonkin verran, mikä on johtanut ehdotuksiin Mastodonin kaltaisista korvaavista vaihtoehdoista tai liittovaltiokohtaisista, libre-ohjelmistovalinnoista.",
      "Vaikka skaalautuvuuteen ja liiketoimintamalleihin liittyy epävarmuustekijöitä, Kagin uusi aloite herättää yleisesti innostusta ja kannatusta."
    ],
    "points": 598,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1694100146
  },
  {
    "id": 37420053,
    "title": "Mullvad on Tailscale: Mullcale: Selaa verkkoa yksityisesti",
    "originLink": "https://tailscale.com/blog/mullvad-integration/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37420053",
    "commentBody": "",
    "originSummary": [
      "Mullvad, yksityisyyteen keskittyvä VPN-palvelu (Virtual Private Network), on tehnyt yhteistyötä Tailscalen kanssa tarjotakseen Tailscalen asiakkaille Mullvadin VPN-palvelimien käytön. Tämä kumppanuus parantaa käyttäjien yksityisyyttä ja turvallisuutta verkkoselaamisen aikana.",
      "Tailscale, joka luo yksityisen internet-ympäristön, toimii koordinointikerroksena laitteiden ja Mullvadin verkon reunan välillä ja takaa päästä päähän -salauksen ja yksityisyyden.",
      "Vaikka Tailscale tietää käyttäjien henkilöllisyydet, se ei jaa henkilökohtaisia tietoja Mullvadin kanssa, mikä korostaa yksityisyyttä entisestään. Tämä kumppanuus mahdollistaa Mullvadin poistumissolmujen erilaiset käyttötarkoitukset Tailscalen kanssa."
    ],
    "commentSummary": [
      "Artikkelin keskeinen teema on virtuaaliset yksityisverkot (VPN) ja verkkovälityspalvelimet, ja siinä korostetaan niiden mahdollisia riskejä ja erilaisia näkökulmia niiden käyttöön.",
      "Siinä keskitytään yksityiskohtaisesti kahden VPN-palvelun, Tailscalen ja Mullvadin, integrointiin ja käsitellään niiden etuja ja rajoituksia.",
      "Painopisteinä ovat yksityisyys, sensuurikysymykset ja VPN:ien käyttö rajoitetun sisällön käyttämiseksi internetissä."
    ],
    "points": 527,
    "commentCount": 297,
    "retryCount": 0,
    "time": 1694099359
  },
  {
    "id": 37420831,
    "title": "Pohjois-Korean kampanja kohdistuu tietoturvatutkijoihin",
    "originLink": "https://blog.google/threat-analysis-group/active-north-korean-campaign-targeting-security-researchers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37420831",
    "commentBody": "",
    "originSummary": [
      "Googlen uhka-analyysiryhmä tiedottaa Pohjois-Korean kampanjasta, joka kohdistuu haavoittuvuustutkimukseen ja -kehitykseen keskittyviin tietoturvatutkijoihin.",
      "Hallituksen tukemat toimijat käyttävät 0-päivän haavoittuvuuksia, luovat suhteita kohteisiinsa sosiaalisen median välityksellä ja lähettävät sitten haitallisia tiedostoja salattujen viestialustojen kautta.",
      "Ryhmä on luonut Windows-työkalun, joka pystyy lataamaan ja suorittamaan määrittelemätöntä koodia hyökkääjän hallitsemasta verkkotunnuksesta. Google ryhtyy parhaillaan toimenpiteisiin suojellakseen käyttäjiään ja levittääkseen tuloksia tietoturvayhteisössä."
    ],
    "commentSummary": [
      "Pohjoiskorealaiset hakkerit ovat kohdistaneet tietoturvatutkijoille haitallista koodia GitHubin kautta, mikä on herättänyt huolta avoimen lähdekoodin käytön turvallisuudesta.",
      "Keskusteluissa käsitellään mahdollisia uhkia, kuten vaarannettuja ylläpitäjiä, GitHub-tähtien väärinkäyttöä ja kysymyksiä, jotka liittyvät kyberhyökkäysten yhdistämiseen Pohjois-Koreaan.",
      "Keskustelussa tarkastellaan myös pohjoiskorealaisten hakkereiden koulutusta, rekrytointitaktiikoita ja elinolosuhteita, mikä herättää keskustelua turvallisuustiedusteluraporttien uskottavuudesta ja näiden hakkereiden aiheuttamista riskeistä."
    ],
    "points": 521,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1694102003
  },
  {
    "id": 37420885,
    "title": "Microsoft ottaa vastuun Copilotin tekijänoikeudellisista riskeistä.",
    "originLink": "https://blogs.microsoft.com/on-the-issues/2023/09/07/copilot-copyright-commitment-ai-legal-concerns/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37420885",
    "commentBody": "",
    "originSummary": [
      "Microsoftin uusi Copilotin tekijänoikeussitoumus suojaa asiakkaita kanteilta, jotka koskevat Microsoftin Copilot-palvelujen tai niiden tuottamien tuotosten käyttöön liittyviä tekijänoikeusrikkomuksia.",
      "Sitoumus koskee Copilot-palvelujen maksullisia versioita, ja se velvoittaa asiakkaita käyttämään sisällönsuodattimia ja pidättäytymään loukkaavan materiaalin tuottamisesta.",
      "Microsoftin tavoitteena on seisoa asiakkaidensa takana, ottaa vastuu tuotteidensa käyttöön liittyvistä oikeudellisista ongelmista ja varmistaa tekoälytavoitteiden, tekijänoikeuksien kunnioittamisen, kilpailun ja innovoinnin edistäminen."
    ],
    "commentSummary": [
      "Microsoft on luvannut kantaa kaikki Copilot- tekoälytyökaluunsa liittyvät tekijänoikeusriskit, vaikka käyttäjät ovat huolissaan mahdollisista tekijänoikeusrikkomuksista ja vaikutuksista laajempaan koodivarastoon.",
      "Keskustelua käydään jatkuvasti generatiivisen tekoälyn laillisuudesta ja oikeudenmukaisesta käytöstä sisällön luomisessa, ja siinä keskitytään erityisesti sen ja tekijänoikeuslainsäädännön väliseen vuorovaikutukseen ja oikeudellisen selvennyksen tarpeeseen.",
      "Keskustelua on käyty myös Copilotin käyttöön liittyvästä vastuusta ja siitä, kuinka täytäntöönpanokelpoinen Microsoftin sitoumus todella on. Keskustelussa on eriäviä mielipiteitä, ja jotkut kyseenalaistavat tiettyjen koodinpätkien tekijänoikeuskelpoisuuden ja toiset korostavat immateriaalioikeuksien kunnioittamista."
    ],
    "points": 488,
    "commentCount": 335,
    "retryCount": 0,
    "time": 1694102191
  },
  {
    "id": 37420382,
    "title": "Tailscale on tehnyt yhteistyötä Mullvadin kanssa",
    "originLink": "https://mullvad.net/en/blog/2023/9/7/tailscale-has-partnered-with-mullvad/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37420382",
    "commentBody": "",
    "originSummary": [
      "Tailscale on aloittanut yhteistyön Mullvad VPN:n kanssa, ja sen asiakkaat voivat käyttää molempia palveluja samanaikaisesti.",
      "Tämän kumppanuuden ansiosta Tailscalen asiakkaat voivat tavoittaa laitteensa Tailscalen mesh-verkon kautta ja lähettää lähtevät yhteydet Mullvad VPN:n WireGuard-palvelimien kautta.",
      "Yhteistyö tarjoaa käyttäjille entistä enemmän toiminnallisuutta ja monipuolisuutta."
    ],
    "commentSummary": [
      "Tailscale on aloittanut yhteistyön Mullvadin kanssa, joka on internetin tietoturvan ja yksityisyyden suojan alalla toimiva yritys.",
      "Kumppanuuden yksityiskohtia ja sen mahdollisia vaikutuksia ei toistaiseksi julkisteta."
    ],
    "points": 450,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1694100525
  },
  {
    "id": 37418424,
    "title": "Tekstuaalinen verkko: TUIs for the Web",
    "originLink": "https://textual.textualize.io/blog/2023/09/06/what-is-textual-web/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37418424",
    "commentBody": "",
    "originSummary": [
      "Textual Web on projekti, jossa Textualin tukemat päätelaitesovellukset muunnetaan verkkosovelluksiksi, jolloin palomuuri- ja porttimäärityksiä ei tarvita.",
      "Se yksinkertaistaa sovellusten jakamista URL-osoitteiden kautta, mikä tekee verkkosovellusten kehittämisestä helpommin saavutettavaa Python-kehittäjille, joilla ei ole kokemusta verkkokehityksestä.",
      "Tulevien päivitysten tavoitteena on lisätä web-alustan sovellusrajapintoja ja tukea päätelaite-, web- ja työpöytäsovellusten rakentamista samasta koodipohjasta. Tällä hetkellä Textual Web -projekti on julkisessa beta-versiossa."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan tekstuaalisten käyttöliittymien käsitettä ja niiden ja graafisten käyttöliittymien (GUI) välistä vertailua sekä valotetaan niiden mahdollista rinnakkaiseloa.",
      "Siinä korostetaan joitakin työkaluja, kuten AutoCAD ja Emacs, jotka tarjoavat sekä TUI- että GUI-vaihtoehtoja, mikä osoittaa käyttöliittymän suunnittelun joustavuuden.",
      "Tekstuaalisovellus, Pythonille kehitetty käyttöliittymäkehys, esitellään, ja esitellään käyttäjien kokemuksia ja näkemyksiä Tekstuaalisovelluksesta, joka tarjoaa todellisen sovelluksen ja reaktion käyttöliittymiin."
    ],
    "points": 265,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1694092395
  },
  {
    "id": 37421529,
    "title": "Mojo on ladattavissa paikallisesti",
    "originLink": "https://www.modular.com/blog/mojo-its-finally-here",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37421529",
    "commentBody": "",
    "originSummary": [
      "Mojo, tekoälyn kehittäjille räätälöity suorituskykyinen ohjelmointikieli, on nyt ladattavissa paikallisesti. Se integroituu Python-kieleen, mikä mahdollistaa Mojon kaikkien ominaisuuksien, kuten kääntäjän ominaisuuksien ja IDE-työkalujen, käytön.",
      "Mojo Software Development Kit (SDK) tarjoaa työkaluja, kuten Mojo-ajurin, Visual Studio Code Extensionin ja Jupyter-integraation. Sen avulla kehittäjät voivat hyödyntää Pythonin suorituskykyä ja käyttää Python-ekosysteemiä saumattomasti.",
      "Mojon tulevaisuuden suunnitelmiin kuuluu kielen joidenkin osien avoin hankinta jatkokehitystä ja parantamista varten."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään Mojo-ohjelmointikieleen, jonka lisensointimalli, suljetun lähdekoodin luonne ja avoimen lähdekoodin epäselvä tulevaisuus herättävät huolta.",
      "Käyttäjät ovat haluttomia sijoittamaan aikaa Mojoon sen suljetun lähdekoodin ja tekijöiden avoimuuteen liittyvän epävarmuuden vuoksi.",
      "Mielipiteet Mojon syntaksityylistä, suorituskyvystä ja sen tehokkuudesta verrattuna Pythoniin ohjelmointi- ja koneoppimistehtävissä jakautuvat."
    ],
    "points": 251,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1694104335
  },
  {
    "id": 37421241,
    "title": "Grindr menettää lähes puolet henkilökunnastaan 2 päivän RTO-vaatimuksen vuoksi",
    "originLink": "https://www.bloomberg.com/news/articles/2023-09-07/grindr-loses-nearly-half-its-staff-to-strict-return-to-office-rule",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37421241",
    "commentBody": "",
    "originSummary": [
      "LGBTQ-deittisovellus Grindr on nähnyt, että noin 45 prosenttia sen työntekijöistä on irtisanoutunut sen jälkeen, kun se on ottanut käyttöön jäykän back-to-office-politiikan liittoutumissuunnitelmien keskellä.",
      "Grindrin käytäntö edellytti, että työntekijöiden oli työskenneltävä henkilökohtaisesti kaksi päivää viikossa, tai he olivat vaarassa irtisanoutua.",
      "Tämän seurauksena noin 80 työntekijää 178:sta joutui irtisanoutumaan, koska he olivat eri mieltä yrityksen uudesta strategiasta."
    ],
    "commentSummary": [
      "Tässä yhteenvedossa käsitellään tiettyjä asioita, nimittäin Grindrin henkilöstövähennyksiä sekä väitteitä työntekijöiden epäasiallisesta kohtelusta ja mahdollisista turvallisuusuhista.",
      "Se panee merkille Elon Muskin väitteen, jonka mukaan Twitterin mainostulot vähenivät Anti-Defamation League (ADL) ja Center for Countering Digital Hate (CCDH) -järjestöjen vuoksi.",
      "Tiivistelmässä käsitellään myös ohjelmistoyrityksen hallinnoinnista aiheutuvia kustannuksia, yritysten erottamista ohjelmistoyrityksiksi ja niiden kykyä mukautua markkinoiden vaatimuksiin ohjelmistotilausten avulla."
    ],
    "points": 249,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1694103365
  }
]
