[
  {
    "id": 37011324,
    "title": "பிராம் மூலனார் காலமானார்",
    "originLink": "https://groups.google.com/g/vim_announce/c/tWahca9zkt4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37011324",
    "commentBody": "",
    "originSummary": [
      "விஐஎம்-ஐ உருவாக்கிய பிராம் மூலனார் துரதிர்ஷ்டவசமாக ஆகஸ்ட் 3, 2023 அன்று காலமானார்.",
      "நெதர்லாந்தில் இறுதிச் சடங்குக்கு ஏற்பாடு செய்யப்பட்டுள்ளது, மேலும் funer...@gmail.com இரங்கல் தெரிவிக்கலாம்.",
      "வேறு ஏதேனும் விஷயங்களுக்கு, குடும்பத்தினரையும் தொடர்பு கொள்ளலாம்."
    ],
    "commentSummary": [
      "விம் படத்தின் படைப்பாளியான பிராம் மூலனார் காலமானார், மென்பொருள் சமூகத்திற்கு அவர் செய்த பங்களிப்புகளுக்கு நன்றியும் பாராட்டும் குவிந்து வருகிறது.",
      "மூலனார் விம் பற்றிய அவரது பணிக்காக மட்டுமல்லாமல், உகாண்டாவில் தொண்டு முயற்சிகளில் ஈடுபட்டதற்காகவும் அங்கீகரிக்கப்பட்டார்.",
      "விம் பயனர்கள் அவரது இழப்பிற்கு இரங்கல் தெரிவித்து வருகின்றனர் மற்றும் அவருடனான அவர்களின் தொடர்புகளைப் பற்றிய தனிப்பட்ட கதைகளைப் பகிர்ந்து வருகின்றனர், இது விம் தங்கள் வேலையில் ஏற்படுத்திய தாக்கத்தை எடுத்துக்காட்டுகிறது. மூலனார் ஆதரவு பெற்ற தொண்டு நிறுவனத்திற்கும் சிலர் நன்கொடை அளித்துள்ளனர். விம்மின் எதிர்காலம் நிச்சயமற்றதாகவே உள்ளது, ஆனால் நிரலாக்க உலகில் அதன் பாரம்பரியம் மற்றும் செல்வாக்கு பரவலாக ஏற்றுக்கொள்ளப்பட்டுள்ளது."
    ],
    "points": 3926,
    "commentCount": 391,
    "retryCount": 0,
    "time": 1691238207
  },
  {
    "id": 37013396,
    "title": "சாதாரண வலை விஷயங்கள்",
    "originLink": "https://heather-buchel.com/blog/2023/07/just-normal-web-things/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013396",
    "commentBody": "",
    "originSummary": [
      "வலைத்தளங்கள் உரையை நகலெடுப்பது, இணைப்புகளை வழிநடத்துவது மற்றும் உலாவிகளில் ஜூம் செய்வது போன்ற அடிப்படை வலை செயல்பாடுகளை அதிகரித்து வருகின்றன.",
      "ஹோவர் பாணிகள் இல்லாமை மற்றும் உலாவி குறுக்குவழிகளின் கடத்தல் ஆகியவையும் சிக்கல்களாக அடையாளம் காணப்படுகின்றன.",
      "ஆசிரியர் சாதாரண வலை தொடர்பு அம்சங்களைப் பாதுகாப்பதன் முக்கியத்துவத்தை வலியுறுத்துகிறார் மற்றும் வலை வளர்ச்சியின் தற்போதைய நிலை குறித்து அதிருப்தியை வெளிப்படுத்துகிறார்."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் விவாதம் வலைத்தளங்களின் ஜாவாஸ்கிரிப்ட் கையாளுதல், எச்.டி.எம்.எல் கூறுகளை தவறாகப் பயன்படுத்துதல் மற்றும் வலை கட்டமைப்புகளில் அதிகப்படியான சார்பு உள்ளிட்ட வலைத்தள வடிவமைப்பு மற்றும் செயல்பாட்டின் விரக்திகளைச் சுற்றி வருகிறது.",
      "மேம்பட்ட பயன்பாட்டிற்கு இணைப்பு நடத்தையைப் பாதுகாத்தல் மற்றும் பழக்கமான வடிவமைப்பு வடிவங்களைப் பின்பற்றுவது வலியுறுத்தப்படுகிறது.",
      "நவீன வலை பயன்பாடுகளின் செயல்திறன், பயனர் அனுபவத்தை பாதிக்கும் பாதுகாப்பு நடவடிக்கைகள் மற்றும் சிறந்த கடவுச்சொல் நடைமுறைகளின் முக்கியத்துவம் ஆகியவை விவாதிக்கப்பட்ட பிற தலைப்புகளில் அடங்கும்."
    ],
    "points": 530,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1691251660
  },
  {
    "id": 37015585,
    "title": "nic.funet.fi: 1990 முதல் FTP உடன் இலவசமாக விநியோகிக்கக்கூடிய கோப்புகளை வழங்குதல்",
    "originLink": "https://www.funet.fi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37015585",
    "commentBody": "",
    "originSummary": [
      "NIC.FUNET.FI ஒரு நீண்டகால வலைத்தளமாகும், இது 1990 முதல் எஃப்.டி.பி மூலம் இலவசமாக விநியோகிக்கக்கூடிய கோப்புகளை வழங்கி வருகிறது.",
      "லினக்ஸ் விநியோகங்கள், நிரலாக்க கருவிகள், நெட்வொர்க்கிங் மென்பொருள் மற்றும் பலவற்றை உள்ளடக்கிய பரந்த அளவிலான உள்ளடக்கத்திற்கு தளம் குறுக்குவழிகளை வழங்குகிறது.",
      "இது அறிவியலுக்கான பின்லாந்து ஐடி மையமான சி.எஸ்.சியால் இயக்கப்படுகிறது மற்றும் அதிவேக இணைய இணைப்புடன் சக்திவாய்ந்த லினக்ஸ் சேவையகத்தில் இயங்குகிறது."
    ],
    "commentSummary": [
      "பங்கேற்பாளர்கள் 1990 முதல் கோப்புகளை விநியோகிக்க எஃப்.டி.பியைப் பயன்படுத்தி வரும் Nic.funet.fi போன்ற தளங்களின் வரலாற்று முக்கியத்துவம் மற்றும் நாஸ்டால்ஜியாவைப் பற்றி விவாதிக்கின்றனர்.",
      "உரையாடல் ஒரு நெறிமுறையாக எஃப்.டி.பியின் காலாவதியான தன்மையை எடுத்துக்காட்டுகிறது மற்றும் எஸ்.எஸ்.எச் போன்ற மாற்றுகளைக் குறிப்பிடுகிறது.",
      "பங்கேற்பாளர்கள் நிகழ்வுகளைப் பகிர்ந்துகொள்கிறார்கள் மற்றும் ஆரம்பகால இணையம் மற்றும் எஃப்.டி.பி ஆகியவற்றை ஒரு வளமான நெறிமுறையாக பாராட்டுகிறார்கள்."
    ],
    "points": 357,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1691264189
  },
  {
    "id": 37013704,
    "title": "புதிய ஒலி தாக்குதல் கீஸ்ட்ரோக்குகளிலிருந்து தரவை 95% துல்லியத்துடன் திருடுகிறது",
    "originLink": "https://www.bleepingcomputer.com/news/security/new-acoustic-attack-steals-data-from-keystrokes-with-95-percent-accuracy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013704",
    "commentBody": "",
    "originSummary": [
      "www.bleepingcomputer.com வலைத்தளம் செயல்திறன் மற்றும் பாதுகாப்பை மேம்படுத்த கிளவுட்ஃப்ளேரைப் பயன்படுத்துகிறது.",
      "பயனர்கள் தொடர அனுமதிப்பதற்கு முன், வலைத்தளம் அவர்களின் இணைப்பின் பாதுகாப்பை சரிபார்க்கிறது.",
      "இந்த நடவடிக்கை அதன் பார்வையாளர்களுக்கு பாதுகாப்பான உலாவல் அனுபவத்தை உறுதி செய்வதை நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "கீஸ்ட்ரோக்குகளிலிருந்து தரவைத் திருடக்கூடிய ஒலி தாக்குதலை ஆராய்ச்சியாளர்கள் உருவாக்கியுள்ளனர், இது உரத்த இயந்திர விசைப்பலகைகளில் பாதுகாப்பு குறைபாடுகளை அம்பலப்படுத்துகிறது.",
      "இந்த அபாயங்களைக் குறைக்க கடவுச்சொல் மேலாளர்கள் மற்றும் வலுவான பாதுகாப்பு நடவடிக்கைகள் போன்ற எதிர் நடவடிக்கைகள் பரிந்துரைக்கப்படுகின்றன.",
      "விசைப்பலகை தட்டச்சு இரைச்சல் மற்றும் ஜூம் பயன்படுத்தி சாத்தியமான தாக்குதல்களை அகற்ற ஆர்டிஎக்ஸ் குரலைப் பயன்படுத்துவது விவாதிக்கப்படுகிறது, மேலும் ஆராய்ச்சி மற்றும் ஒலி பக்க-சேனல் தாக்குதல்களுக்கு எதிரான பாதுகாப்புகளின் அவசியத்தை எடுத்துக்காட்டுகிறது."
    ],
    "points": 343,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1691253236
  },
  {
    "id": 37016413,
    "title": "MK-1",
    "originLink": "https://mkone.ai/blog/introducing-mk1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016413",
    "commentBody": "",
    "originSummary": [
      "எம்.கே -1 தங்கள் முதல் தயாரிப்பான எம்.கே.எம்.எல் ஐ அறிமுகப்படுத்தியுள்ளது, இது செயற்கை நுண்ணறிவு மாதிரிகளின் செயல்திறன் மற்றும் செயல்திறனை மேம்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது.",
      "எம்.கே.எம்.எல் பைத்தான் குறியீட்டின் சில வரிகளுடன் ஜி.பி.யுக்களில் பெரிய மொழி மாதிரி (எல்.எல்.எம்) அனுமான செலவுகளை 2 மடங்கு குறைக்க உதவுகிறது.",
      "இது ஹக்கிங் ஃபேஸ் மற்றும் பைடார்ச் போன்ற பிரபலமான சுற்றுச்சூழல் அமைப்புகளுடன் தடையின்றி ஒருங்கிணைக்கிறது மற்றும் மாதிரி அளவை சுமார் 60% சுருக்குவதன் மூலம் பெரிய நினைவக தேவைகளின் சிக்கலை நிவர்த்தி செய்கிறது. இந்த தேர்வுமுறை ஜிபியு நினைவகத்தை சேமிப்பது மட்டுமல்லாமல், அனுமான வேகத்தையும் அதிகரிக்கிறது."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் கருத்து நூல் எம்.கே -1 எனப்படும் புதிய செயற்கை நுண்ணறிவு மாதிரியைப் பற்றி விவாதிக்கிறது, இது குவாண்டிசேஷன் முறைகளை வழங்குகிறது.",
      "தற்போதுள்ள முறைகளுடன் ஒப்பீடு இல்லாததால் பயனர்கள் சந்தேகம் கொண்டுள்ளனர் மற்றும் அதன் சந்தைப்படுத்தல் மொழி மற்றும் இலக்கு பயன்பாட்டு வழக்குகளை கேள்வி எழுப்புகிறார்கள்.",
      "இணை நிறுவனர் ஒப்பீட்டின் பற்றாக்குறையை நியாயப்படுத்துகிறார், வெவ்வேறு வர்த்தகங்கள் மற்றும் பயன்பாட்டு வழக்குகளை முன்னிலைப்படுத்துகிறார்."
    ],
    "points": 268,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1691270419
  },
  {
    "id": 37013887,
    "title": "விம் படத்தின் படைப்பாளி பிராம் மூலனார் காலமானார்",
    "originLink": "https://news.slashdot.org/story/23/08/05/1632219/vims-creator-bram-moolenaar-dies-at-age-62",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013887",
    "commentBody": "",
    "originSummary": [
      "விம் உரை ஆசிரியரை உருவாக்கிய பிராம் மூலனார் தனது 62 வயதில் காலமானார்.",
      "விம் சமூகம் தொடர்ந்து விம் முன்னேறுவதற்கு ஆதரவளிக்கும்.",
      "இக்கட்டுரை விம் சமூகத்திற்கு மூலனாரின் குறிப்பிடத்தக்க பங்களிப்புகளையும், அறப்பணிகளில் அவர் ஆற்றிய பணிகளையும் எடுத்துக்காட்டுகிறது. நவீன எடிட்டர்களில் விம் முறைகள் மற்றும் செருகுநிரல்களின் பிரபலத்தையும் இது குறிப்பிடுகிறது. மென்பொருள் மேம்பாட்டு சமூகத்திற்கு மூலனார் ஆற்றிய அளப்பரிய பங்களிப்பிற்காக அவருக்கு அஞ்சலி செலுத்தப்படுகிறது."
    ],
    "commentSummary": [
      "விம் படத்தை உருவாக்கிய பிராம் மூலனார் தனது 62வது வயதில் காலமானார்.",
      "அவரது மரணச் செய்தி அவரைப் பற்றிய பல கதைகள் முதல் பக்கத்தில் இடம்பெற வேண்டுமா அல்லது ஒரு செய்தி போதுமா என்ற விவாதங்களை ஆன்லைன் மன்றங்களில் தூண்டியது.",
      "சில பயனர்கள் அவரது தாக்கத்தின் தனித்தனி கணக்குகள் படிக்கத்தக்கவை என்று வாதிடுகின்றனர், மற்றவர்கள் ஒரு கதை போதுமானது என்று நம்புகிறார்கள்."
    ],
    "points": 265,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1691254074
  },
  {
    "id": 37019228,
    "title": "தி சாட் பாஸ்டர்ட் சமையல் புத்தகம்: நீங்கள் இறக்காமல் இருக்க நீங்கள் செய்யக்கூடிய உணவு",
    "originLink": "https://traumbooks.itch.io/the-sad-bastard-cookbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37019228",
    "commentBody": "",
    "originSummary": [
      "சாட் பாஸ்டர்ட் சமையல் புத்தகம் கடினமான நேரங்களை கடந்து செல்லும் மற்றும் சமாளிக்க நடைமுறை வழிகள் தேவைப்படும் நபர்களுக்கு ஒரு இலவச ஆதாரமாகும்.",
      "இது குறிப்பாக அதிகப்படியான, சோகம் மற்றும் அமானுஷ்ய சூழ்நிலைகளைக் கையாள்வதற்கான பலவிதமான சமையல் குறிப்புகளை வழங்குகிறது.",
      "சமையல் புத்தகத்தின் முக்கிய நோக்கம் உணவு நேரத்தில் ஆறுதலையும் இணைப்பையும் வழங்குவதாகும், இது மற்றவர்களும் இதேபோன்ற சவால்களை எதிர்கொள்ளக்கூடும் என்பதை நினைவூட்டுகிறது."
    ],
    "commentSummary": [
      "\"தி சாட் பாஸ்டர்ட் குக்புக்\" என்பது பிஸியான அல்லது உற்சாகமற்ற நபர்களுக்காக வடிவமைக்கப்பட்ட ஒரு நடைமுறை வழிகாட்டியாகும், இது ரெடிமேட் ரொட்டிசேரி கோழிகள் மற்றும் உறைந்த காய்கறிகளை வாங்குவது போன்ற எளிதான சமையல் குறிப்புகளை வழங்குகிறது.",
      "உடனடி பானைகள் மற்றும் ஏர் பிரையர்கள் போன்ற உபகரணங்களைப் பயன்படுத்துவது உட்பட பல்வேறு சமையல் விருப்பங்களை இந்த புத்தகம் ஆராய்கிறது.",
      "சமூக வாழ்க்கை, வசதியான மாடுலர் சமையலறை உபகரணங்கள், உணவு மாற்று விருப்பங்கள், மேற்பார்வை செய்யப்படாத உண்ணாவிரதத்தின் சுகாதார அபாயங்கள் மற்றும் சர்க்கரை உணவுகள் மற்றும் ஆரோக்கியமற்ற எண்ணெய்களை வெட்டுவதன் மூலம் ஆரோக்கியமான உணவைப் பின்பற்றுவதற்கான உதவிக்குறிப்புகள் பற்றிய விவாதங்களில் வாசகர்கள் ஈடுபடலாம்."
    ],
    "points": 251,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1691299799
  },
  {
    "id": 37015290,
    "title": "ஐபிஎம் மற்றும் நாசா திறந்த மூல மிகப்பெரிய ஜியோஸ்பேஷியல் ஏஐ ஃபவுண்டேஷன் மாடல்",
    "originLink": "https://newsroom.ibm.com/2023-08-03-IBM-and-NASA-Open-Source-Largest-Geospatial-AI-Foundation-Model-on-Hugging-Face?sf180690117=1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37015290",
    "commentBody": "",
    "originSummary": [
      "ஐபிஎம் மற்றும் ஹக்கிங் ஃபேஸ் இணைந்து ஐபிஎம்மின் watsonx.ai ஜியோஸ்பேஷியல் ஃபவுண்டேஷன் மாடலை ஹக்கிங் ஃபேஸ் பிளாட்ஃபார்மில் வெளியிட உள்ளன.",
      "நாசாவுடன் இணைந்து உருவாக்கப்பட்ட இந்த மாடல், ஹக்கிங் ஃபேஸில் மிகப்பெரிய ஜியோஸ்பேஷியல் ஃபவுண்டேஷன் மாடல் மற்றும் நாசாவின் முதல் திறந்த மூல செயற்கை நுண்ணறிவு அறக்கட்டளை மாதிரி ஆகும்.",
      "நாசாவின் செயற்கைக்கோள் தரவுகளிலிருந்து உருவாக்கப்பட்ட இந்த மாதிரி காலநிலை மற்றும் புவி அறிவியலில் செயற்கை நுண்ணறிவின் அணுகல் மற்றும் பயன்பாட்டை ஜனநாயகப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது மற்றும் நாசாவின் திறந்த மூல அறிவியல் முன்முயற்சியின் ஒரு பகுதியாகும்."
    ],
    "commentSummary": [
      "ஐபிஎம் மற்றும் நாசா இணைந்து ஹக்கிங் ஃபேஸ் பிளாட்ஃபார்மில் ஜியோஸ்பேஷியல் ஏஐ மாடலை வெளியிடுகின்றன.",
      "watsonx.ai ஜியோஸ்பேஷியல் ஃபவுண்டேஷன் மாடல் என்று அழைக்கப்படும் இந்த மாதிரி நாசாவின் செயற்கைக்கோள் தரவுகளில் பயிற்சியளிக்கப்படுகிறது மற்றும் கிரீன்ஹவுஸ் வாயுக்களைக் கண்காணித்தல், பயிர் விளைச்சலைக் கணித்தல் மற்றும் காடழிப்பைக் கண்காணித்தல் போன்ற பல்வேறு பணிகளுக்குப் பயன்படுத்தப்படலாம்.",
      "மாதிரியின் திறந்த மூல வெளியீடு செயற்கை நுண்ணறிவு துறையில் ஒத்துழைப்பு மற்றும் முன்னேற்றங்களை ஊக்குவிக்கிறது மற்றும் காலநிலை மற்றும் புவி அறிவியல் ஆராய்ச்சிக்கு செயற்கை நுண்ணறிவைப் பயன்படுத்துவதில் முன்னேற்றத்தைக் குறிக்கிறது."
    ],
    "points": 242,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1691262322
  },
  {
    "id": 37016876,
    "title": "ட்விட்டரில் @music உருவாக்க ஜெர்மி வாக்ட் 16 ஆண்டுகள் செலவிட்டார், பின்னர் எக்ஸ் அதை எடுத்துக் கொண்டார்",
    "originLink": "https://syzito.xyz/@selzero/110837319716739179",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016876",
    "commentBody": "",
    "originSummary": [
      "தனது ட்விட்டர் பயனர்பெயரை \"@music\" உருவாக்க 16 ஆண்டுகள் செலவிட்ட ஜெர்மி வாக்ட், அவரது பயனர்பெயரை \"@Musicfan\" என்று மாற்றினார்.",
      "இந்த சம்பவம் பில்லியனர்களுக்கு சொந்தமான தளங்கள் மீதான விமர்சனங்களைத் தூண்டியுள்ளது மற்றும் மாஸ்டோடன் போன்ற மாற்று தளங்களுக்கு மாறுவது குறித்த விவாதங்களைத் தூண்டியுள்ளது.",
      "சில பயனர்கள் வாக்ட் ஒரு தீர்வு அல்லது இடஒதுக்கீடு அல்லாத பிரிவை ஏற்றுக்கொண்டிருக்கலாம் என்று ஊகிக்கின்றனர். இருப்பினும், அவர் ட்விட்டரை தனது விருப்பமான சமூக ஊடக தளமாகக் கருதுகிறார்."
    ],
    "commentSummary": [
      "எலான் மஸ்க் தனது அசல் பயனரிடமிருந்து \"@music\" என்ற பயனர்பெயரை நீக்கியது ட்விட்டர் போன்ற சமூக ஊடக தளங்களில் டிஜிட்டல் உரிமை மற்றும் பயனர்பெயர்கள் மீதான கட்டுப்பாடு குறித்த விவாதத்தைத் தூண்டியுள்ளது.",
      "திறந்த நெறிமுறைகள் அல்லது பிளாக்செயின் தொழில்நுட்பம் போன்ற மாற்று விருப்பங்கள் உட்பட டிஜிட்டல் தளங்களில் முறைப்படுத்தப்பட்ட தரநிலைகள் மற்றும் கடமைகளின் தேவை குறித்த விவாதங்களுக்கு இந்த சம்பவம் வழிவகுத்துள்ளது.",
      "தளக் கொள்கைகளில் செய்யப்பட்ட மாற்றங்கள், டிஜிட்டல் அடையாளங்கள் மீதான கட்டுப்பாடு இல்லாதது குறித்த கவலைகள் மற்றும் மூடப்பட்ட தளங்களை நம்புவதன் அபாயங்கள் குறித்து பயனர்கள் அதிருப்தியை வெளிப்படுத்துகிறார்கள்."
    ],
    "points": 237,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1691274699
  },
  {
    "id": 37016424,
    "title": "ஆல்பாபெட் மற்றும் மைக்ரோசாப்ட் போன்ற தொழில்நுட்ப ஜாம்பவான்களில் பணிநீக்கங்களுக்கு முன்பு தலைமை நிர்வாக அதிகாரிகளின் சம்பளம் உயர்ந்தது",
    "originLink": "https://southernillinoisnow.com/2023/08/05/ceos-pay-climbed-before-layoffs-at-tech-giants-like-alphabet-and-microsoft-data-shows/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016424",
    "commentBody": "",
    "originSummary": [
      "ஆல்பாபெட் மற்றும் மைக்ரோசாப்ட் போன்ற தொழில்நுட்ப ஜாம்பவான்கள் பணிநீக்கங்களை அறிவித்த போதிலும், 2022 ஆம் ஆண்டில் தலைமை நிர்வாக அதிகாரி இழப்பீட்டில் கணிசமான அதிகரிப்புகளை அனுபவித்தனர்.",
      "ஆல்பாபெட் தலைமை நிர்வாக அதிகாரி சுந்தர் பிச்சையின் சம்பளம் 3,474% அதிகரித்து 225 மில்லியன் டாலராகவும், மைக்ரோசாப்ட் தலைமை நிர்வாக அதிகாரி சத்ய நாதெள்ளா கிட்டத்தட்ட 55 மில்லியன் டாலராகவும், 10% அதிகரிப்புடன் 225 மில்லியன் டாலராகவும் உயர்ந்துள்ளது.",
      "வேலை இழப்புகள் நிகழும்போது தலைமை நிர்வாக அதிகாரி சம்பள உயர்வு தொழில்நுட்பத் துறையில் தலைமை நிர்வாக அதிகாரி மற்றும் ஊழியர் சம்பளங்களுக்கு இடையில் வளர்ந்து வரும் ஏற்றத்தாழ்வை எடுத்துக்காட்டுகிறது மற்றும் நிறுவனங்கள் தங்கள் முடிவுகளை எடுப்பதில் மற்ற பங்குதாரர்களுக்கு முன்னுரிமை அளிக்க வேண்டுமா என்ற கேள்விகளை எழுப்புகிறது."
    ],
    "commentSummary": [
      "சுந்தர் பிச்சையின் 225 மில்லியன் டாலர் இழப்பீடு உட்பட ஆல்பாபெட் மற்றும் மைக்ரோசாப்ட் போன்ற தொழில்நுட்ப ஜாம்பவான்களின் தலைமை நிர்வாக அதிகாரிகளின் அதிக சம்பளம் விவாதத்தின் மைய புள்ளியாகும்.",
      "விமர்சகர்கள் இந்த ஊதியங்கள் மிகையானவை என்றும், அதிக ஊழியர்கள் அல்லது பொது மக்களின் நலனுக்காக சிறப்பாக பயன்படுத்தப்படலாம் என்றும் வாதிடுகின்றனர்.",
      "தலைமை நிர்வாக அதிகாரி ஊதியத்தின் நியாயப்படுத்தல் மற்றும் அளவீடு, அத்துடன் சமூகம், சுற்றுச்சூழல், பங்குதாரர்களின் நலன்கள் மற்றும் செல்வ சமத்துவமின்மை ஆகியவற்றில் அவர்களின் முடிவுகளின் தாக்கம் ஆகியவற்றைச் சுற்றியுள்ள விவாதத்தை இந்த கட்டுரை ஆராய்கிறது."
    ],
    "points": 227,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1691270511
  }
]
