[
  {
    "id": 37011324,
    "title": "Bram Moolenaar on kuollut",
    "originLink": "https://groups.google.com/g/vim_announce/c/tWahca9zkt4",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37011324",
    "commentBody": "",
    "originSummary": [
      "VIM:n luoja Bram Moolenaar menehtyi valitettavasti 3. elokuuta 2023 nopeasti edenneen sairauden jälkeen.",
      "Hautajaiset järjestetään Alankomaissa, ja surunvalittelut voi lähettää osoitteeseen funer...@gmail.com.",
      "Mahdollisissa muissa asioissa voi ottaa yhteyttä myös perheeseen."
    ],
    "commentSummary": [
      "Vimin luoja Bram Moolenaar on valitettavasti kuollut, mikä on johtanut kiitollisuuden ja arvostuksen vuodatukseen hänen panoksestaan ohjelmistoyhteisölle.",
      "Moolenaar sai tunnustusta paitsi työstään Vimin parissa myös osallistumisestaan hyväntekeväisyyteen Ugandassa.",
      "Vimin käyttäjät surevat hänen menetystään ja jakavat henkilökohtaisia tarinoita vuorovaikutuksestaan hänen kanssaan ja korostavat Vimin vaikutusta heidän työhönsä. Jotkut ovat jopa tehneet lahjoituksia Moolenaarin tukemalle hyväntekeväisyysjärjestölle. Vimin tulevaisuus on edelleen epävarma, mutta sen perintö ja vaikutus ohjelmointimaailmaan on laajalti tunnustettu."
    ],
    "points": 3926,
    "commentCount": 391,
    "retryCount": 0,
    "time": 1691238207
  },
  {
    "id": 37013396,
    "title": "Ihan tavallisia verkkojuttuja",
    "originLink": "https://heather-buchel.com/blog/2023/07/just-normal-web-things/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013396",
    "commentBody": "",
    "originSummary": [
      "Verkkosivustot rajoittavat yhä useammin perustoimintoja, kuten tekstin kopiointia, linkkien navigointia ja selaimen zoomausta.",
      "Ongelmiksi on havaittu myös leijutustyylien puuttuminen ja selaimen pikanäppäinten kaappaaminen.",
      "Kirjoittaja korostaa, että on tärkeää säilyttää normaalit verkkovuorovaikutusominaisuudet, ja ilmaisee tyytymättömyytensä verkkokehityksen nykytilaan."
    ],
    "commentSummary": [
      "Hacker Newsin keskustelu pyörii verkkosivujen suunnitteluun ja toimivuuteen liittyvien turhautumien ympärillä, mukaan lukien linkkien JavaScript-manipulointi, HTML-elementtien väärinkäyttö ja liiallinen riippuvuus verkkokehyksistä.",
      "Linkkien käyttäytymisen säilyttämistä ja tuttujen suunnittelumallien noudattamista korostetaan käytettävyyden parantamiseksi.",
      "Muita keskustelunaiheita ovat nykyaikaisten verkkosovellusten tehokkuus, käyttäjäkokemukseen vaikuttavat turvatoimet ja parempien salasanakäytäntöjen merkitys."
    ],
    "points": 530,
    "commentCount": 203,
    "retryCount": 0,
    "time": 1691251660
  },
  {
    "id": 37015585,
    "title": "nic.funet.fi: FTP:llä vapaasti levitettävien tiedostojen palveleminen vuodesta 1990 lähtien.",
    "originLink": "https://www.funet.fi/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37015585",
    "commentBody": "",
    "originSummary": [
      "NIC.FUNET.FI on pitkäaikainen verkkosivusto, joka on tarjonnut vapaasti jaettavia tiedostoja FTP:n kautta vuodesta 1990 lähtien.",
      "Sivusto tarjoaa pikakuvakkeita monenlaiseen sisältöön, kuten Linux-jakeluihin, ohjelmointityökaluihin, verkko-ohjelmistoihin ja muuhun.",
      "Sitä ylläpitää CSC, Suomen tieteen tietotekniikkakeskus, ja se toimii tehokkaalla Linux-palvelimella, jossa on nopea Internet-yhteys."
    ],
    "commentSummary": [
      "Osallistujat keskustelevat Nic.funet.fi:n kaltaisten alustojen historiallisesta merkityksestä ja nostalgiasta, sillä se on käyttänyt FTP:tä tiedostojen jakeluun vuodesta 1990 lähtien.",
      "Keskustelussa korostetaan FTP:n vanhentunutta luonnetta protokollana ja mainitaan vaihtoehtoja, kuten SSH.",
      "Osallistujat kertovat anekdootteja ja ilmaisevat arvostavansa varhaista internetiä ja FTP:tä hyödyllisenä protokollana."
    ],
    "points": 357,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1691264189
  },
  {
    "id": 37013704,
    "title": "Uusi akustinen hyökkäys varastaa tietoja näppäinpainalluksista 95 prosentin tarkkuudella",
    "originLink": "https://www.bleepingcomputer.com/news/security/new-acoustic-attack-steals-data-from-keystrokes-with-95-percent-accuracy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013704",
    "commentBody": "",
    "originSummary": [
      "Verkkosivusto www.bleepingcomputer.com käyttää Cloudflarea suorituskyvyn ja turvallisuuden parantamiseksi.",
      "Ennen kuin käyttäjä pääsee jatkamaan, verkkosivusto tarkistaa yhteyden turvallisuuden.",
      "Tällä toimenpiteellä pyritään varmistamaan kävijöiden turvallinen selauskokemus."
    ],
    "commentSummary": [
      "Tutkijat ovat kehittäneet akustisen hyökkäyksen, jolla voidaan varastaa tietoja näppäinpainalluksista, mikä paljastaa äänekkäiden mekaanisten näppäimistöjen tietoturva-aukot.",
      "Näiden riskien vähentämiseksi suositellaan vastatoimia, kuten salasanojen hallintaa ja vahvoja turvatoimia.",
      "Keskustellaan RTX Voice -tekniikan käytöstä näppäimistön kirjoituskohinan poistamiseksi ja mahdollisista Zoomin avulla tapahtuvista hyökkäyksistä, ja korostetaan lisätutkimuksen ja akustisten sivukanavahyökkäysten torjunnan tarvetta."
    ],
    "points": 343,
    "commentCount": 201,
    "retryCount": 0,
    "time": 1691253236
  },
  {
    "id": 37016413,
    "title": "MK-1",
    "originLink": "https://mkone.ai/blog/introducing-mk1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016413",
    "commentBody": "",
    "originSummary": [
      "MK-1 on esitellyt ensimmäisen tuotteensa, MKML:n, joka on päättelyajuri, jonka tavoitteena on parantaa tekoälymallien suorituskykyä ja tehokkuutta.",
      "MKML mahdollistaa suurten kielimallien (LLM) päättelykustannusten kaksinkertaisen vähentämisen GPU:lla vain muutamalla rivillä Python-koodia.",
      "Se integroituu saumattomasti suosittuihin ekosysteemeihin, kuten Hugging Faceen ja PyTorchiin, ja se ratkaisee suurten muistivaatimusten ongelman paketoimalla mallin kokoa noin 60 %. Tämä optimointi ei ainoastaan säästä GPU:n muistia vaan myös parantaa päättelynopeutta."
    ],
    "commentSummary": [
      "Hacker Newsin kommenttiketjussa keskustellaan uudesta MK-1-nimisestä tekoälymallista, joka tarjoaa kvantifiointimenetelmiä.",
      "Käyttäjät suhtautuvat epäilevästi, koska menetelmää ei voida verrata olemassa oleviin menetelmiin, ja kyseenalaistavat sen markkinointikielen ja kohdennetut käyttötapaukset.",
      "Yhteisperustaja puolustaa vertailun puuttumista ja korostaa erilaisia kompromisseja ja käyttötapauksia."
    ],
    "points": 268,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1691270419
  },
  {
    "id": 37013887,
    "title": "Vimin luoja Bram Moolenaar kuolee 62-vuotiaana - Slashdot",
    "originLink": "https://news.slashdot.org/story/23/08/05/1632219/vims-creator-bram-moolenaar-dies-at-age-62",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37013887",
    "commentBody": "",
    "originSummary": [
      "Vim-tekstieditorin luoja Bram Moolenaar on valitettavasti kuollut 62-vuotiaana.",
      "Vim-yhteisö jatkaa Vimin ylläpitoa ja tukemista jatkossakin.",
      "Artikkelissa korostetaan Moolenaarin merkittävää panosta Vim-yhteisölle ja hänen työtään hyväntekeväisyysohjelmistojen parissa. Siinä mainitaan myös Vim-moodien ja -liitännäisten suosio nykyaikaisissa editoreissa. Moolenaarille osoitetaan kunnioitusta hänen korvaamattomasta panoksestaan ohjelmistokehitysyhteisölle."
    ],
    "commentSummary": [
      "Vimin luoja Bram Moolenaar on valitettavasti kuollut 62-vuotiaana.",
      "Uutinen hänen kuolemastaan herätti nettifoorumeilla keskustelua siitä, pitäisikö hänestä julkaista useita juttuja etusivulla vai riittääkö yksi juttu.",
      "Joidenkin käyttäjien mielestä hänen vaikutuksestaan kannattaa lukea erilliset kertomukset, kun taas toisten mielestä yksi tarina riittää."
    ],
    "points": 265,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1691254074
  },
  {
    "id": 37019228,
    "title": "The Sad Bastard Cookbook: Food you can make so you don't die",
    "originLink": "https://traumbooks.itch.io/the-sad-bastard-cookbook",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37019228",
    "commentBody": "",
    "originSummary": [
      "The Sad Bastard Cookbook on ilmainen resurssi henkilöille, jotka käyvät läpi vaikeita aikoja ja tarvitsevat käytännön keinoja selviytyä.",
      "Se tarjoaa erilaisia reseptejä, jotka on erityisesti räätälöity käsittelemään ylivoimaisuuden ja surun tunteita ja jopa yliluonnollisten tilanteiden käsittelyä.",
      "Keittokirjan päätavoitteena on tarjota lohdutusta ja yhteenkuuluvuuden tunnetta ruokailun aikana ja muistuttaa siitä, että myös muilla voi olla samanlaisia haasteita."
    ],
    "commentSummary": [
      "\"The Sad Bastard Cookbook\" on kiireisille tai epämotivoituneille henkilöille tarkoitettu käytännön opas, joka tarjoaa helppoja reseptejä, kuten valmiiden paistettujen kanojen ja pakastevihannesten ostamista.",
      "Kirjassa tarkastellaan erilaisia ruoanlaittovaihtoehtoja, mukaan lukien pikaruokien ja ilmakeittimien kaltaisten laitteiden käyttö.",
      "Lukijat voivat osallistua keskusteluihin yhteisöllisestä asumisesta, kätevistä modulaarisista keittiökoneista, ateriankorvausvaihtoehdoista, valvomattoman paaston terveysriskeistä ja vinkeistä terveellisemmän ruokavalion omaksumiseksi jättämällä pois sokeripitoiset elintarvikkeet ja epäterveelliset öljyt."
    ],
    "points": 251,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1691299799
  },
  {
    "id": 37015290,
    "title": "IBM ja NASA avaavat suurimman geospatiaalisen tekoälyn perustamismallin avoimen lähdekoodin Hugging Facessa",
    "originLink": "https://newsroom.ibm.com/2023-08-03-IBM-and-NASA-Open-Source-Largest-Geospatial-AI-Foundation-Model-on-Hugging-Face?sf180690117=1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37015290",
    "commentBody": "",
    "originSummary": [
      "IBM ja Hugging Face ovat yhteistyössä julkaisseet IBM:n watsonx.ai geospatial foundation -mallin Hugging Face -alustalla.",
      "Malli, joka on kehitetty yhteistyössä NASAn kanssa, on Hugging Facen suurin geospatiaalinen perusmalli ja NASAn ensimmäinen avoimen lähdekoodin tekoälyn perusmalli.",
      "NASAn satelliittidatasta rakennetulla mallilla pyritään demokratisoimaan tekoälyn saatavuutta ja soveltamista ilmasto- ja geotieteissä, ja se on osa NASAn Open-Source Science Initiative -aloitetta."
    ],
    "commentSummary": [
      "IBM ja NASA ovat yhteistyössä julkaisseet geospatiaalisen tekoälymallin Hugging Face -alustalla.",
      "Malli, nimeltään watsonx.ai geospatial foundation model, on koulutettu NASAn satelliittidatalla, ja sitä voidaan käyttää erilaisiin tehtäviin, kuten kasvihuonekaasujen seurantaan, sadonkorjuun ennustamiseen ja metsäkadon seurantaan.",
      "Mallin avoimen lähdekoodin julkaisu kannustaa yhteistyöhön ja edistymiseen tekoälyn alalla ja edustaa edistystä tekoälyn käyttämisessä ilmasto- ja maantieteen tutkimuksessa."
    ],
    "points": 242,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1691262322
  },
  {
    "id": 37016876,
    "title": "Jeremy Vaught käytti 16 vuotta rakentaakseen @musicin Twitteriin, sitten X vei sen pois",
    "originLink": "https://syzito.xyz/@selzero/110837319716739179",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016876",
    "commentBody": "",
    "originSummary": [
      "Jeremy Vaught, joka käytti 16 vuotta Twitter-käyttäjätunnuksensa \"@music\" rakentamiseen, muutti käyttäjätunnuksensa \"@Musicfaniksi\" ilman, että hänen seuraajansa siirrettiin asianmukaisesti.",
      "Tapaus on herättänyt kritiikkiä miljardöörien omistamia alustoja kohtaan ja herättänyt keskustelua siirtymisestä vaihtoehtoisiin alustoihin, kuten Mastodoniin.",
      "Jotkut käyttäjät arvelevat, että Vaught on saattanut hyväksyä sovinnon tai syrjimättömyyslausekkeen. Hän pitää kuitenkin edelleen Twitteriä ensisijaisena sosiaalisen median alustanaan."
    ],
    "commentSummary": [
      "Käyttäjätunnuksen \"@music\" poistaminen alkuperäiseltä käyttäjältään Elon Muskin toimesta on herättänyt keskustelua digitaalisesta omistajuudesta ja käyttäjätunnusten hallinnasta sosiaalisen median alustoilla, kuten Twitterissä.",
      "Tapaus on herättänyt keskustelua virallisten standardien ja velvollisuuksien tarpeesta digitaalisissa alustoissa, mukaan lukien vaihtoehtoiset vaihtoehdot, kuten avoimet protokollat tai lohkoketjuteknologia.",
      "Käyttäjät ovat tyytymättömiä alustojen käytäntöihin tehtyihin muutoksiin, ovat huolissaan digitaalisten identiteettien hallinnan puutteesta ja suljettuihin alustoihin luottamisen riskeistä."
    ],
    "points": 237,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1691274699
  },
  {
    "id": 37016424,
    "title": "Toimitusjohtajien palkat nousivat ennen Alphabetin ja Microsoftin kaltaisten teknologiajättien irtisanomisia.",
    "originLink": "https://southernillinoisnow.com/2023/08/05/ceos-pay-climbed-before-layoffs-at-tech-giants-like-alphabet-and-microsoft-data-shows/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37016424",
    "commentBody": "",
    "originSummary": [
      "Alphabetin ja Microsoftin kaltaisten teknologiajättien toimitusjohtajakorvaukset kasvoivat merkittävästi vuonna 2022, vaikka ne ilmoittivat irtisanomisista.",
      "Alphabetin toimitusjohtajan Sundar Pichain korvaus nousi 3 474 prosenttia yli 225 miljoonaan dollariin, kun taas Microsoftin toimitusjohtajan Satya Nadellan palkka nousi lähes 55 miljoonaa dollaria eli 10 prosenttia.",
      "Toimitusjohtajien palkkojen nousu samaan aikaan, kun työpaikkoja menetetään, korostaa toimitusjohtajien ja työntekijöiden palkkojen välistä kasvavaa eroa teknologiateollisuudessa ja herättää kysymyksiä siitä, pitäisikö yritysten asettaa muut sidosryhmät etusijalle päätöksenteossaan."
    ],
    "commentSummary": [
      "Keskustelun keskiössä ovat Alphabetin ja Microsoftin kaltaisten teknologiajättien toimitusjohtajien korkeat palkat, mukaan lukien Sundar Pichain 225 miljoonan dollarin korvaus.",
      "Kriitikot väittävät, että nämä palkat ovat kohtuuttomia ja että niitä voitaisiin käyttää paremmin useampien työntekijöiden tai väestön hyväksi.",
      "Artikkelissa syvennytään keskusteluun, joka koskee toimitusjohtajien palkkojen oikeutusta ja mittaamista sekä heidän päätöstensä vaikutusta yhteiskuntaan, ympäristöön, osakkeenomistajien etuihin ja varallisuuden epätasa-arvoon."
    ],
    "points": 227,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1691270511
  }
]
