[
  {
    "id": 40172033,
    "title": "ரஸ்ட் கேம்தேவில் தரம் மற்றும் வேகத்தை சமநிலைப்படுத்துதல்",
    "originLink": "https://loglog.games/blog/leaving-rust-gamedev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40172033",
    "commentBody": "",
    "originSummary": [
      "கடன் வாங்கும் சரிபார்ப்பு, மெதுவான முன்மாதிரி மற்றும் ஜி.யு.ஐ மேம்பாடு ஆகியவற்றுடனான சவால்கள் காரணமாக ஒரு இண்டி டெவலப்பர் ரஸ்ட் கேம்தேவிலிருந்து விலக முடிவு செய்தார், நடைமுறை விளையாட்டு உருவாக்கத்தில் தொழில்நுட்ப அம்சங்களில் சமூகத்தின் கவனத்தை விமர்சித்தார்.",
      "இந்த இடுகை தலைமுறை அரங்கங்கள், நிறுவனம்-கூறு-அமைப்பு (ECS) மற்றும் ரஸ்டில் உள்ள GUI நூலகங்களின் கட்டுப்பாடுகள் ஆகியவற்றை ஆராய்கிறது, குறியீடு தரம், மறு செய்கை வேகம், திறமையான தரவு மேலாண்மை மற்றும் ரஸ்ட் கேம் வளர்ச்சியில் தொகுத்தல் நேரங்களை மேம்படுத்துதல் ஆகியவற்றை சமநிலைப்படுத்துவதன் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "சூடான ரீலோடிங், UI கட்டமைப்பு மற்றும் உலகளாவிய நிலை ஒருங்கிணைப்பு போன்ற தடைகள் இருந்தபோதிலும், ஆசிரியர் ரஸ்டின் கம்பைலர் உந்துதல் முறை, உயர் செயல்திறன் மற்றும் CLI கருவிகள் மற்றும் தரவு கையாளுதலுக்கான பயன்பாட்டினை மதிக்கிறார்."
    ],
    "commentSummary": [
      "விளையாட்டு மேம்பாட்டில் ரஸ்டைப் பயன்படுத்தும் டெவலப்பர்கள் மெதுவான தொகுத்தல் நேரங்கள், சுற்றுச்சூழல் வரம்புகள் மற்றும் அசின்க் அமைப்புகள் போன்ற மேம்பட்ட அம்சங்களை செயல்படுத்தும் போராட்டங்கள் போன்ற சவால்களை எதிர்கொள்கின்றனர்.",
      "பங்கேற்பாளர்கள் கோ மற்றும் சி ++ போன்ற பிற மொழிகளுக்கு எதிராக ரஸ்டின் நன்மை தீமைகள் பற்றி விவாதிக்கிறார்கள், விளையாட்டு இயந்திரங்கள் மற்றும் அமைப்புகள் நிரலாக்கத்திற்கான அதன் பொருத்தத்தை விவாதிக்கின்றனர்.",
      "விளையாட்டு வளர்ச்சியில் நினைவக பாதுகாப்பு, இணையான தன்மை மற்றும் உற்பத்தித்திறன் ஆகியவற்றின் முக்கியத்துவத்தை உரையாடல் எடுத்துக்காட்டுகிறது, மாற்று மொழிகளை ஆராய்தல் மற்றும் திட்டங்களில் செயல்திறன் மற்றும் நெகிழ்வுத்தன்மையை மேம்படுத்துவதற்கான அணுகுமுறைகள்."
    ],
    "points": 1219,
    "commentCount": 740,
    "retryCount": 0,
    "time": 1714152836
  },
  {
    "id": 40168519,
    "title": "வணிக பயன்பாட்டிற்கான இலவச உயர்தர CC0 அமைப்புகள் மற்றும் 3D மாதிரிகள்",
    "originLink": "https://www.sharetextures.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40168519",
    "commentBody": "",
    "originSummary": [
      "sharetextures' CC0 டெக்ஸ்ச்சர்ஸ் மற்றும் 3D மாடல்கள் வணிகத் திட்டங்களுக்கான 184 மாதிரிகள் மற்றும் 1502 அமைப்புகள் உட்பட பதிப்புரிமை இல்லாத ஆதாரங்களை வழங்குகின்றன.",
      "தளம் புரவலர்களால் நிலைநிறுத்தப்படுகிறது மற்றும் அடிக்கடி சேர்த்தல்களுடன் அதன் சேகரிப்பை தொடர்ந்து விரிவுபடுத்துகிறது.",
      "பல்வேறு திட்டத் தேவைகளுக்கு இணையதளத்தில் 37 க்கும் மேற்பட்ட அட்லஸ்களை அணுகவும்."
    ],
    "commentSummary": [
      "டோல்கார்ஸ்லான் 2018 முதல் sharetextures.com இல் பிபிஆர் அமைப்புகள் மற்றும் 3 டி மாடல்களை இலவசமாகப் பகிர்ந்து கொள்கிறார், மென்பொருள் கருவி பரிந்துரைகளை வழங்குகிறார் மற்றும் ஒத்துழைப்புகளைத் தேடுகிறார்.",
      "பயனர்கள் மென்பொருள் கருவிகள், பதிப்புரிமை, உரிமம், பதிப்புரிமை இல்லாத படைப்புகள் மற்றும் பொது டொமைன் பொருட்கள் பற்றிய உரையாடல்களில் ஈடுபடுகிறார்கள், அத்துடன் விளையாட்டு மேம்பாட்டு இயந்திரங்களுடன் அமைப்பு அட்லஸ்கள் மற்றும் அனுபவங்களை மேம்படுத்துகிறார்கள்.",
      "இலவச பொருட்களை வழங்குவதற்காக கட்டிடக் கலைஞர்களின் குழுவால் தொடங்கப்பட்ட ஷேர்டெக்ஸ்ச்சர்ஸ், படைப்பாளிகள் பணம் பெற வேண்டுமா என்பது குறித்த விவாதத்தைத் தூண்டுகிறது, அதே நேரத்தில் பயனர்கள் தளத்தில் கருத்துக்களைப் பகிர்ந்து கொள்கிறார்கள் மற்றும் 3 டி மாடல்களுக்கான ஆதாரங்களை பரிந்துரைக்கிறார்கள், ஃபோட்டோகிராமெட்ரி, முனை அடிப்படையிலான எடிட்டர்கள் மற்றும் 3 டி மாடலிங்கில் பிபிஆர் அமைப்புகளைப் பயன்படுத்துவது போன்ற தலைப்புகளை ஆராய்கின்றனர்."
    ],
    "points": 406,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1714134195
  },
  {
    "id": 40171183,
    "title": "Bun Zig மற்றும் C++ இல் திறமையான செயலிழப்பு அறிக்கையை அறிமுகப்படுத்துகிறது",
    "originLink": "https://bun.sh/blog/bun-report-is-buns-new-crash-reporter",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40171183",
    "commentBody": "",
    "originSummary": [
      "Bun மென்பொருள் 2,600 க்கும் மேற்பட்ட GitHub சிக்கல்களிலிருந்து செயலிழப்புகளை இனப்பெருக்கம் செய்து பிழைத்திருத்தம் செய்வதற்கான சவாலை எதிர்கொள்ள Zig மற்றும் C++ இல் ஒரு புதிய செயலிழப்பு அறிக்கை வடிவமைப்பை அறிமுகப்படுத்துகிறது.",
      "சிறிய வடிவம் தனிப்பட்ட தரவைக் குறைக்கிறது மற்றும் பெரிய பிழைத்திருத்த சின்னங்களின் தேவையை நீக்குகிறது, இதில் குறியிடப்பட்ட ஸ்டேக் ட்ரேஸ் முகவரிகள் மற்றும் திறமையான சேவையக பகுப்பாய்வுக்கான அம்சக் கொடிகள் இடம்பெறுகின்றன.",
      "பாரம்பரிய மைய டம்ப்களில் சிக்கல் கண்டறிதலுக்கான அத்தியாவசிய தரவை அனுப்புவதன் நன்மைகளை இந்த அமைப்பு காட்டுகிறது, தனியுரிமை உணர்வுள்ள மற்றும் உயர் செயல்திறன் செயலிழப்பு அறிக்கையை நிரூபிக்கிறது."
    ],
    "commentSummary": [
      "பிழைத்திருத்த சின்னங்களுக்கு மாற்றாக பன்னின் புதிய க்ராஷ் ரிப்போர்ட்டரை பயனர்கள் விவாதிக்கின்றனர், ஹேக்கர் நியூஸில் பிழைத்திருத்த அட்டவணையில் செயல்பாட்டு பெயர்களைச் சேர்ப்பது குறித்து விவாதிக்கின்றனர்.",
      "Vue மற்றும் Svelte இடையேயான பிழைத்திருத்த கருவிகள் மற்றும் தொகுப்பு மேலாண்மை குறித்த வெவ்வேறு முன்னோக்குகள் உரையாடலில் முன்னிலைப்படுத்தப்படுகின்றன, பயனர்கள் Bun இன் செயல்பாட்டைப் பாராட்டுகிறார்கள், ஆனால் மேம்பாடுகளை பரிந்துரைக்கின்றனர்.",
      "பின்னூட்டத்தில் uwebsocket மற்றும் Bun உடனான நேர்மறையான அனுபவங்கள், REPL செயல்பாட்டு சிக்கல்கள் மற்றும் Node.js க்கு மாற்றாக Bun ஐப் பயன்படுத்துவது பற்றிய கவலைகள் ஆகியவை அடங்கும்."
    ],
    "points": 299,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1714148430
  },
  {
    "id": 40168242,
    "title": "PEP 686: பைதான் UTF-8 பயன்முறைக்கு இயல்புநிலையாக இருக்கும்",
    "originLink": "https://peps.python.org/pep-0686/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40168242",
    "commentBody": "",
    "originSummary": [
      "தொழில்துறை தரங்களுடன் சீரமைக்கவும், பிற தொழில்நுட்பங்களுடன் பொருந்தக்கூடிய தன்மையை மேம்படுத்தவும், தேவைப்பட்டால் விலகுவதற்கான விருப்பத்துடன், பைத்தானின் இயல்புநிலை குறியாக்கத்தை UTF-8 க்கு மாற்றுவதை PEP 686 முன்மொழிகிறது.",
      "இந்த முன்மொழிவு விண்டோஸில் பின்தங்கிய இணக்கத்தன்மையை நிவர்த்தி செய்கிறது மற்றும் பிழை மேலாண்மைக்கான வழிகாட்டுதல்களை வழங்குகிறது, இது உள்ளூர் குறியாக்க பயன்பாட்டில் நிலைத்தன்மையை உறுதி செய்வதை நோக்கமாகக் கொண்டுள்ளது.",
      "ஜாவா மற்றும் ரூபியைப் போலவே, பைதான் புதியவர்களுக்கான உரை குறியாக்கத்தை நெறிப்படுத்துவதை நோக்கமாகக் கொண்டுள்ளது, அதே நேரத்தில் ஏற்கனவே உள்ள பயனர்களை ஆதரிக்கிறது, மறைமுக குறியாக்கத்தை நீக்குதல் மற்றும் பைப்களுக்கான பைத்தோனியோஎன்கோடிங் போன்ற மாற்றுகளை நிராகரிக்கிறது."
    ],
    "commentSummary": [
      "python.org இல் PEP 686 இல் விவாதம் UTF-8 ஐ இயங்குதளம் சார்ந்த சவால்களை எதிர்கொள்ளவும், பைத்தானில் குறியாக்கத்தைக் குறிப்பிடுவதில் நிலைத்தன்மையை உறுதிப்படுத்தவும் இயல்புநிலை உரை கோப்பு குறியாக்கமாக மாற்ற முன்மொழிகிறது.",
      "விண்டோஸை யுடிஎஃப் -8 க்கு இயல்புநிலைக்கு மாற்றும்போது மரபு பயன்பாட்டு பொருந்தக்கூடிய தன்மை பற்றிய கவலைகளுடன், பைட் சரங்கள் மற்றும் யூனிகோட் குறியீடு புள்ளிகளுக்கு இடையிலான வேறுபாடுகளைப் புரிந்துகொள்வதன் முக்கியத்துவத்தை பங்களிப்பாளர்கள் எடுத்துக்காட்டுகின்றனர்.",
      "இந்த விவாதத்தில் பைட் ஆர்டர் மார்க்ஸ் (BOMs) பயன்படுத்துதல், பல்வேறு இயக்க முறைமைகளில் UTF-8 க்கு மாறுதல் மற்றும் பைதான் மற்றும் ஜாவாவில் செயல்திறன் மற்றும் நினைவக பயன்பாட்டில் குறியாக்க தரங்களின் தாக்கம் போன்ற தலைப்புகள் அடங்கும்."
    ],
    "points": 224,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1714132514
  },
  {
    "id": 40167742,
    "title": "பாரோ 12: பொருள் சார்ந்த எளிமை & மேம்படுத்தப்பட்ட கருவிகள்",
    "originLink": "https://pharo.org/news/2024-04-26-pharo12-released.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40167742",
    "commentBody": "",
    "originSummary": [
      "ஃபாரோ 12, எளிமை மற்றும் உடனடி கருத்துக்களை மையமாகக் கொண்ட பயனர் சார்ந்த நிரலாக்க மொழி, நேரடி சூழல் மற்றும் விதிவிலக்கான பிழைத்திருத்த திறன்களுடன் தொடங்கப்பட்டுள்ளது.",
      "பதிப்பு 12 இன் முக்கிய சிறப்பம்சங்கள் ஒரு புதிய பிரேக்பாயிண்ட் அமைப்பு, கருவிகள் மேம்பாடுகள் மற்றும் கணினி மற்றும் மெய்நிகர் இயந்திரத்தில் முன்னேற்றங்கள் ஆகியவற்றை உள்ளடக்கியது.",
      "1895 புல் கோரிக்கைகள் மற்றும் உலகெங்கிலும் உள்ள 70+ பங்களிப்பாளர்களின் பங்களிப்புகளால் ஆதரிக்கப்படும் இந்த வெளியீடு, ஃபாரோவின் திறந்த மூல இயல்பு மற்றும் சமூகம் சார்ந்த வளர்ச்சியைக் காட்டுகிறது."
    ],
    "commentSummary": [
      "பயனர்கள் ஸ்மால்டாக் நிரலாக்க மொழியான ஃபாரோவுடன் பணிபுரிவதில் உள்ள சவால்கள் மற்றும் நன்மைகளைப் பற்றி விவாதிக்கின்றனர், அதன் வழக்கத்திற்கு மாறான தன்மையைப் புரிந்துகொள்வதில் உள்ள சிரமங்கள் மற்றும் எடுத்துக்காட்டுகள் இல்லாததைக் குறிப்பிடுகின்றனர்.",
      "ஃபாரோ கற்றல் அனுபவத்தை மேம்படுத்துவதற்கான பரிந்துரைகளில் மாநாடுகளில் கலந்துகொள்வது, டிஸ்கார்ட் போன்ற சமூக வளங்களைப் பயன்படுத்துதல் மற்றும் கூடுதல் கல்விப் பொருட்களை உருவாக்குதல் ஆகியவை அடங்கும்.",
      "உரையாடல் சிறந்த ஆவணங்கள், மேம்பட்ட பயனர் இடைமுகம் மற்றும் ஃபாரோவில் இணைத்தன்மையை செயல்படுத்துவதற்கான சாத்தியமான தடைகள் ஆகியவற்றை உள்ளடக்கியது, அதே நேரத்தில் ஸ்கீக் மற்றும் குயிஸ் போன்ற பிற ஸ்மால்டாக் அமைப்புகளுடன் ஒப்பிடுகிறது."
    ],
    "points": 217,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1714128065
  },
  {
    "id": 40174424,
    "title": "நியூயார்க் $ 15 பிராட்பேண்ட் சட்டத்தை நீதிமன்றம் உறுதி செய்தது",
    "originLink": "https://arstechnica.com/tech-policy/2024/04/court-upholds-new-york-law-that-says-isps-must-offer-15-broadband/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40174424",
    "commentBody": "",
    "originSummary": [
      "குறைந்த வருமானம் கொண்ட பயனர்களுக்கு $15 பிராட்பேண்ட் திட்டங்களை வழங்க ISPகள் கட்டாயப்படுத்தும் நியூயார்க் சட்டத்தை ஒரு கூட்டாட்சி மேல்முறையீட்டு நீதிமன்றம் உறுதிப்படுத்தியுள்ளது, இந்த முடிவு கூட்டாட்சி விதிகளால் மீறப்படவில்லை மற்றும் ISP களைப் பிரதிநிதித்துவப்படுத்தும் வர்த்தகக் குழுக்களால் ஆதரிக்கப்படுகிறது.",
      "இந்த தீர்ப்பு பிராட்பேண்ட் சேவைகளை மேற்பார்வையிடுவதற்கான மாநிலங்களின் அதிகாரத்திற்கு ஒரு முக்கியமான வெற்றியாகும், இது வரவிருக்கும் நெட் நியூட்ராலிட்டி சட்டத்தை பாதிக்கும்."
    ],
    "commentSummary": [
      "இந்த விவாதம் இணைய உள்கட்டமைப்பின் உரிமை, விலை நிர்ணயம் மற்றும் ஒழுங்குமுறை ஆகியவற்றை ஆராய்கிறது, அமெரிக்காவிலும் உலகளவிலும் அரசாங்கத்திற்கு எதிராக தனியார் உரிமையை வலியுறுத்துகிறது.",
      "தொலைத்தொடர்பு ஏகபோகங்களை உடைப்பதில் உள்ள சவால்கள், இணைய தனியுரிமையில் அரசாங்கத்தின் தாக்கம் மற்றும் குறைந்த வருமானம் கொண்ட குழுக்களுக்கு மலிவு இணையத்தை வழங்குதல் ஆகியவை முக்கிய தலைப்புகளில் அடங்கும்.",
      "முக்கிய கருப்பொருள்கள் அரசாங்க ஒழுங்குமுறை மற்றும் தனியார்மயமாக்கலுக்கு இடையிலான சமநிலை, அத்தியாவசிய பயன்பாடுகளில் தேசியமயமாக்கல் விளைவுகள் மற்றும் தொலைத் தொடர்புத் துறையில் போட்டி மற்றும் அணுகலின் முக்கியத்துவம் ஆகியவற்றை உள்ளடக்கியது."
    ],
    "points": 213,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1714166317
  },
  {
    "id": 40168765,
    "title": "இங்கிலாந்தின் 'ஸ்னூப்பர்ஸ் சார்ட்டர்' மசோதா தொழில்நுட்ப தொழில்துறை எதிர்ப்புக்கு மத்தியில் சட்டமாகிறது",
    "originLink": "https://www.theregister.com/2024/04/26/investigatory_powers_bill/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40168765",
    "commentBody": "",
    "originSummary": [
      "\"ஸ்னூப்பர்ஸ் சாசனம்\" என்று அழைக்கப்படும் இங்கிலாந்தின் புலனாய்வு அதிகாரங்கள் மசோதா, சிறிய மாற்றங்களுடன் அங்கீகரிக்கப்பட்டுள்ளது, தேசிய பாதுகாப்பு அச்சுறுத்தல்கள் மற்றும் ஆன்லைன் குழந்தை துஷ்பிரயோகத்தை எதிர்த்துப் போராட டிஜிட்டல் கண்காணிப்பு அதிகாரங்களை விரிவுபடுத்துகிறது.",
      "இந்த மசோதா தனியுரிமையை சமரசம் செய்யும், வெகுஜன தரவு சேகரிப்பை செயல்படுத்தும் மற்றும் பாதுகாப்பு புதுப்பிப்புகளை மெதுவாக்கும், இது இங்கிலாந்தை சைபர் கிரைமுக்கு அதிக வாய்ப்புள்ளதாக மாற்றும் என்று விமர்சகர்கள் கவலைப்படுகின்றனர்.",
      "தொழில்நுட்ப நிறுவனங்கள், தனியுரிமை வக்கீல்கள் மற்றும் டெக் யுகே மற்றும் பிரைவசி இன்டர்நேஷனல் போன்ற நிறுவனங்கள் தனியுரிமை, பாதுகாப்பு கண்டுபிடிப்பு மற்றும் சர்வதேச சட்ட மோதல்கள் ஆகியவற்றில் மசோதாவின் தாக்கங்கள் குறித்து கவலை தெரிவித்துள்ளன, இதில் தேசிய பாதுகாப்பு காரணங்களுக்காக இறுதி முதல் இறுதி குறியாக்கத்தை உடைப்பதில் அரசாங்கத்தின் நிலைப்பாடு உட்பட."
    ],
    "commentSummary": [
      "இங்கிலாந்தின் புலனாய்வு அதிகார மசோதா சட்டமாக மாறியுள்ளது, தொழில்நுட்ப துறையின் எதிர்ப்பை எதிர்கொள்கிறது.",
      "இந்த முக்கியமான விஷயத்தை போதுமான அளவு உயர்த்திக் காட்டவில்லை என்பதற்காக ஊடகங்கள், குறிப்பாக பிபிசி மீது விமர்சனங்கள் செலுத்தப்படுகின்றன.",
      "விவாதங்கள் தனியுரிமை கவலைகள், அரசாங்க கண்காணிப்பு, ஐரோப்பிய ஒன்றிய சட்ட விளைவுகள், சமூக நடத்தை, வரலாற்று சூழல் மற்றும் சட்டமியற்றுவதில் முடியாட்சியின் ஈடுபாடு ஆகியவற்றை உள்ளடக்கியது."
    ],
    "points": 194,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1714135547
  },
  {
    "id": 40167905,
    "title": "Veilid: DEF CON 31 இல் பரவலாக்கப்பட்ட பயன்பாட்டு வெளியீடு",
    "originLink": "https://cultdeadcow.com/tools/veilid.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40167905",
    "commentBody": "",
    "originSummary": [
      "Veilid என்பது ஒரு புதிய பரவலாக்கப்பட்ட பயன்பாடாகும், இது பயனர் தரவை லாபத்திற்காக சுரண்டாமல் ஆன்லைன் தொடர்புகளை வழங்க வடிவமைக்கப்பட்டுள்ளது.",
      "லாஸ் வேகாஸில் உள்ள DEF CON 31 இல் இந்த தளம் அறிமுகப்படுத்தப்படும், இதில் நிகழ்வுகள், டெமோக்கள் மற்றும் அடித்தளம், பங்களிப்பாளர்கள் மற்றும் பத்திரிகை வெளியீடுகள் பற்றிய விவரங்கள் இடம்பெறும்.",
      "தனியுரிமையை வலியுறுத்தி, வெய்லிட்டின் வெளியீடு தொழில்நுட்பத் துறையில் அதிக நெறிமுறை அணுகுமுறைகளை நோக்கிய நகர்வைக் குறிக்கிறது."
    ],
    "commentSummary": [
      "இறந்த பசுவின் வழிபாட்டு முறை 2023 இல் வெய்லிட் என்ற திறந்த மூல பயன்பாட்டு கட்டமைப்பை வெளியிட்டது, இது பிரையர் மற்றும் பெர்டியுடன் ஒப்பீடுகளைத் தூண்டியது.- பயனர்கள் வெய்லிட்டின் அணுகல் மற்றும் ஆவணங்கள் குறித்து கவலைகளை எழுப்பியுள்ளனர், இது இணைய வணிகமயமாக்கலுக்கு மத்தியில் கவலைகளை பிரதிபலிக்கிறது.- விவாதங்களில் ஆரம்பகால இணைய தொழில்நுட்பத்திற்கான ஏக்கம், ஜாவாஸ்கிரிப்டைப் பயன்படுத்தி வலைத்தள அணுகல், ஹேக்கர் கலாச்சாரம் மற்றும் இறந்த பசுவின் வழிபாட்டு முறை போன்ற குழுக்களின் குறிப்பிடத்தக்க வரலாறு ஆகியவை அடங்கும்,  ஹேக்கிங் சமூகத்தில் அதன் செல்வாக்கு மற்றும் பெட்டோ ஓ'ரூர்கே போன்ற நபர்களுடனான இணைப்புகளைப் பற்றி நினைவுபடுத்துகிறது."
    ],
    "points": 180,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1714129569
  },
  {
    "id": 40173237,
    "title": "இடைவெளி மீண்டும் மீண்டும் கருவியுடன் மாஸ்டர் கோடிங் சிக்கல்கள்",
    "originLink": "https://www.lanki.xyz/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40173237",
    "commentBody": "",
    "originSummary": [
      "LeetCode கேள்வி தீர்க்கும் கருவி பயனர்கள் கேள்விகளை கடினமான, நடுத்தர அல்லது எளிதானதாக வகைப்படுத்த உதவுகிறது மற்றும் கடைசி மதிப்பாய்விலிருந்து சிரமம் மற்றும் நேரத்தின் அடிப்படையில் மதிப்பாய்வு செய்ய பரிந்துரைக்கிறது.",
      "தனிப்பயனாக்கப்பட்ட பரிந்துரைகளிலிருந்து பயனடைய, பயனர்கள் கருவியின் செயல்திறனை மேம்படுத்த ஆரம்பத்தில் சிக்கல்களை முயற்சித்து வகைப்படுத்த வேண்டும்.",
      "இடைவெளி மீண்டும் மீண்டும் மற்றும் கற்றலை ஆதரிக்கும் கோட்பாட்டின் விளக்கம் வழங்கப்பட்ட இணைப்பு மூலம் கிடைக்கிறது."
    ],
    "commentSummary": [
      "வேலை நேர்காணல்களுக்கான குறியீட்டு கருத்துக்களை மாஸ்டரிங் செய்வதில் இடைவெளி மறுபடியும் செய்தல், மனப்பாடம் செய்தல் மற்றும் சிக்கல் தீர்க்கும் முறைகளின் செயல்திறனை விவாதம் ஆராய்கிறது, குறிப்பாக லீட்கோட் போன்ற தளங்களைப் பயன்படுத்துகிறது.",
      "கல்வி மற்றும் தனிப்பட்ட வளர்ச்சியில் மனப்பாடம் செய்வதன் பங்கு குறித்து பல்வேறு முன்னோக்குகள் பகிரப்படுகின்றன, தனிப்பட்ட கற்றல் பாணிகளுக்கு பாரம்பரிய மனப்பாடம் அணுகுமுறைகளை வடிவமைப்பதில் முக்கியத்துவம் அளிக்கப்படுகிறது.",
      "மனப்பாடம் செய்வதுடன் புரிதலை இணைப்பதன் முக்கியத்துவம் மற்றும் தொழில்நுட்ப நேர்காணல்களில் தரப்படுத்தப்பட்ட லீட்கோட்-பாணி கேள்விகளின் செல்வாக்கு ஆகியவை வேலை நேர்காணல்களின் போது குறியீட்டு திறன்கள் மற்றும் செயல்திறனை மேம்படுத்துவதில் முன்னிலைப்படுத்தப்படுகின்றன."
    ],
    "points": 158,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1714160325
  },
  {
    "id": 40169578,
    "title": "ஸ்கலா சமூக நீதிமன்ற வழக்கில் ஜான் பிரெட்டி நிரூபிக்கப்பட்டார்",
    "originLink": "https://pretty.direct/statement.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40169578",
    "commentBody": "",
    "originSummary": [
      "ஸ்கலா டெவலப்பர் மற்றும் பேச்சாளர் ஜான் ப்ரெட்டி முக்கிய ஸ்கலா சமூக உறுப்பினர்களிடமிருந்து தவறான குற்றச்சாட்டுகளை எதிர்கொண்டார், இதன் விளைவாக மூன்று ஆண்டுகளுக்கு முன்பு அவர் ரத்து செய்யப்பட்டார்.",
      "ப்ரெட்டி சட்ட நடவடிக்கை எடுத்தார், அவதூறு வழக்குத் தொடர்ந்தார், இரண்டு வருட போருக்குப் பிறகு, கட்சிகள் குடியேறின, குற்றம் சாட்டியவர்கள் தவறை ஒப்புக்கொண்டு மன்னிப்பு கேட்டனர்.",
      "இந்த சம்பவம் பிரட்டியின் தொழில் மற்றும் தனிப்பட்ட வாழ்க்கையில் எதிர்மறையான தாக்கத்தை ஏற்படுத்தியது, ஆனால் அவர் இப்போது நியாயப்படுத்தலைப் பெற்றுள்ளார் மற்றும் ஸ்கலா 3 உடன் தனது பணியைத் தொடர்வதற்கான நல்லிணக்கம் மற்றும் நோக்கங்களை நோக்கமாகக் கொண்டுள்ளார்."
    ],
    "commentSummary": [
      "ஜான் பிரெட்டி ஸ்கலா சமூகத்திற்குள் பாலியல் துன்புறுத்தல் குற்றச்சாட்டுகளை ஒப்புதல் உத்தரவைப் பயன்படுத்தி தீர்த்துள்ளார், இது நீண்டகால சட்ட நடவடிக்கைகளைத் தவிர்த்துள்ளது.",
      "அவதூறு சட்டங்கள், அமெரிக்காவிற்கும் இங்கிலாந்திற்கும் இடையிலான ஏற்றத்தாழ்வுகள் குறித்து விவாதங்கள் எழுகின்றன, ஆதாரத்தின் சுமை மற்றும் பொறுப்புக்கூறல் மாறுபாடுகளில் கவனம் செலுத்துகின்றன.",
      "இந்த சொற்பொழிவு ரத்துசெய்யும் கலாச்சாரம், ஒருங்கிணைந்த குற்றச்சாட்டுகளின் குற்றச்சாட்டுகள் மற்றும் ஸ்கலா சமூக உறுப்பினர்களிடையே சாத்தியமான நிகழ்ச்சி நிரல்களை ஆராய்கிறது, வெறுக்கத்தக்க பேச்சை வெளிப்படுத்துவதற்கும், அவர்களின் அரசியல் கருத்துக்களுக்காக தனிநபர்களை ரத்து செய்வதற்கும் அறியப்பட்ட டிராவிஸ் பிரவுன், மையத்தில், வழக்கில் கட்சிகளுடன் போதை மற்றும் தனிப்பட்ட தொடர்புகள் குற்றச்சாட்டுகளை எதிர்கொள்கிறார்."
    ],
    "points": 130,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1714140316
  },
  {
    "id": 40171551,
    "title": "அமேசானின் ஆக்கிரமிப்பு வணிக தந்திரங்களை அம்பலப்படுத்துகிறது",
    "originLink": "https://www.vanityfair.com/news/story/inside-amazon-business-practices",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40171551",
    "commentBody": "",
    "originSummary": [
      "வேனிட்டி ஃபேருடனான டானா மாட்டியோலியின் நேர்காணல், விமர்சனங்களை அடக்குவது, போட்டியாளர்களை நீக்குவது மற்றும் உள் போட்டியை வளர்ப்பது போன்ற அமேசானின் ஆக்கிரமிப்பு தந்திரோபாயங்களை வெளிப்படுத்துகிறது.",
      "அவரது புத்தகம், \"தி எவ்ரிதிங் வார்\", நிறுவனத்தின் ரகசியம் காரணமாக அமேசானின் ஆதிக்கம், பரப்புரை முயற்சிகள் மற்றும் சவாலான அறிக்கையிடல் அனுபவங்களை ஆராய்கிறது.",
      "அமேசானின் பரப்புரை, மக்கள் தொடர்பு உத்திகள், சிறு நிறுவனங்கள் மீதான செல்வாக்கு, ஜனாதிபதி டிரம்புடனான பகை மற்றும் வாஷிங்டனில் அதிகரித்து வரும் நம்பிக்கையற்ற இயக்கத்திற்கு மத்தியில் பைடன் நிர்வாகத்தின் கீழ் சாத்தியமான நம்பிக்கையற்ற தடைகள் குறித்து இந்த கட்டுரை விவாதிக்கிறது."
    ],
    "commentSummary": [
      "உயர் மற்றும் உயர்-நடுத்தர வர்க்கங்கள் அமேசானை ஆதரிப்பது, ஆனால் வால்மார்ட்டை விமர்சிப்பது, தனிச்சலுகையில் இருந்து உருவாகும் \"ஆடம்பர நம்பிக்கைகளை\" விவாதிப்பது ஆகியவற்றின் பாசாங்குத்தனத்தை அக்கட்டுரை அம்பலப்படுத்துகிறது.",
      "இது \"காவல்துறைக்கு நிதியளிக்கவும்\" என்ற தவறாகப் புரிந்து கொள்ளப்பட்ட கருத்தை ஆராய்கிறது, அதன் பல்வேறு விளக்கங்களையும் தாக்கங்களையும் ஆராய்கிறது.",
      "பணியாளர் இழப்பீடு, பணி நிலைமைகள், சிறு வணிகங்களில் போட்டி மற்றும் அமேசானின் நடைமுறைகள் குறித்த கவலைகள் ஆகியவற்றில் அமேசான் மற்றும் வால்மார்ட்டின் தாக்கம் ஆகியவை அமேசான் ஊழியர்களின் நுண்ணறிவு மற்றும் முன்னாள் ஊழியர்களின் எதிர்மறை அனுபவங்கள் உட்பட முன்னிலைப்படுத்தப்படுகின்றன."
    ],
    "points": 129,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1714150149
  },
  {
    "id": 40174316,
    "title": "Factorio: விளையாட்டு புள்ளிவிவரங்கள் மற்றும் லினக்ஸ் ஆதரவை மேம்படுத்துதல்",
    "originLink": "https://factorio.com/blog/post/fff-408",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40174316",
    "commentBody": "",
    "originSummary": [
      "வூப் அணியின் வெள்ளிக்கிழமை உண்மைகள் #408 அக்யூமர் சார்ஜ் மற்றும் சயின்ஸ் பேக் பயன்பாடு போன்ற ஃபேக்டரியோவில் விளையாட்டு புள்ளிவிவரங்களை மேம்படுத்துவதை எடுத்துக்காட்டுகிறது.",
      "ரைகார்ட் இப்போது குழுவின் ஒரு பகுதியாக உள்ளது, லினக்ஸ் ஆதரவை வலியுறுத்துகிறது, பல்வேறு கம்பைலர்கள் மற்றும் நூலகங்கள் போன்ற சவால்களை எதிர்கொள்கிறது.",
      "ஃபேக்டரியோ 2.0 இன் அலெக்ரோவிலிருந்து எஸ்.டி.எல்-க்கு இடம்பெயர்வது சார்புகள் மற்றும் குறியீடு அளவைக் குறைக்கிறது, ஸ்வேயில் சாளர மறுஅளவிடல் சிக்கல்களை சரிசெய்யவும் லினக்ஸ் செயல்திறனை மேம்படுத்தவும் முயற்சிகள் நடந்து வருகின்றன."
    ],
    "commentSummary": [
      "ஃபேக்டரியோ டெவலப்பர்கள் பதிப்பு 2.0 க்கான விளையாட்டை மேம்படுத்துகிறார்கள், எக்ஸ் 11 சார்புநிலையை நீக்கி, எக்ஸ் 11 அல்லது வேலாண்டுடன் இணக்கமான நூலகத்தை இணைத்து, புரோட்டான் வழியாக விண்டோஸ் பயனர்களுக்கு எக்ஸ் 11 ஆதரவை உறுதி செய்கிறார்கள்.",
      "பயனர்கள் க்னோமின் சாளர அலங்காரங்களில் அதிருப்தி தெரிவித்து, கே.டி.இ இன் தனிப்பயனாக்குதல் விருப்பங்களைப் பாராட்டுகின்றனர், இது பல த்ரெட்டிங் சவால்கள் மற்றும் நினைவக ஒதுக்கீடு சிக்கல்கள் உள்ளிட்ட ஃபேக்டரியோவின் மாநில சேமிப்பு சிக்கல்கள் குறித்த விவாதங்களைத் தூண்டுகிறது.",
      "இந்த இடுகை ஃபேக்டரியோ விளையாட்டில் புள்ளிவிவர முன்னேற்றங்களை உரையாற்றுகிறது மற்றும் க்னோமின் பயன்பாட்டினை குறித்த கவலைகளை எடுத்துக்காட்டுகிறது, ஃபேக்டரியோவின் வரவிருக்கும் வெளியீட்டு மாற்றங்கள் மற்றும் டெஸ்க்டாப் சூழல் ஒப்பீடுகளுக்கு கவனத்தை ஈர்க்கிறது."
    ],
    "points": 124,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1714165754
  },
  {
    "id": 40167933,
    "title": "புனித நவீனத்துவம்: ஐரோப்பாவின் மிருகத்தனமான தேவாலயங்களை ஆராய்தல்",
    "originLink": "https://www.dezeen.com/2024/04/24/sacred-modernity-brutalist-churches-book-jamie-mcgregor-smith/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40167933",
    "commentBody": "",
    "originSummary": [
      "புகைப்படக் கலைஞர் ஜேமி மெக்ரிகோர் ஸ்மித்தின் புத்தகம் \"புனித நவீனத்துவம்\" ஐரோப்பா முழுவதும் 100 தேவாலயங்களைக் காட்டுகிறது, இத்தாலி, ஜெர்மனி மற்றும் இங்கிலாந்து போன்ற நாடுகளில் மிருகத்தனமான மற்றும் நவீனத்துவ கட்டிடக்கலை பாணிகளில் கவனம் செலுத்துகிறது.",
      "இந்த வழக்கத்திற்கு மாறான தேவாலயங்களின் புதுமையான வடிவமைப்புகளை முன்னிலைப்படுத்துவதும், பாரம்பரிய தேவாலய அழகியலுக்கு சவால் விடுவதும், சிற்ப கான்கிரீட் வடிவங்கள் மற்றும் வழக்கத்திற்கு மாறான வடிவங்களை இணைப்பதும் இந்த புத்தகத்தின் நோக்கமாகும்.",
      "வியப்பு மற்றும் ஆர்வத்தின் உணர்வை உருவாக்க படைப்பாற்றல், வடிவம் மற்றும் ஒளியைத் தூண்டும் புதிய கட்டிடக்கலை பாணிகளுக்கு ஆதரவாக பாரம்பரிய தேவாலய வடிவமைப்பை போருக்குப் பிந்தைய நிராகரிப்பை மெக்ரிகோர் ஸ்மித் வலியுறுத்துகிறார்."
    ],
    "commentSummary": [
      "இந்த உரையாடல் தேவாலயங்களில், குறிப்பாக பின்லாந்து மற்றும் ஸ்காண்டிநேவிய லூத்தரன் தேவாலயங்களில் மிருகத்தனமான கட்டிடக்கலையின் எழுச்சியில் கவனம் செலுத்துகிறது.",
      "மிருகத்தனமான தேவாலயங்களில் கருத்துக்கள் வேறுபடுகின்றன, சிலர் கவலை அல்லது சங்கடமாக உணர்கிறார்கள், மற்றவர்கள் நவீன அழகியலைப் பாராட்டுகிறார்கள்.",
      "மிருகத்தனமான தேவாலயங்கள் தெய்வீகத்தை அல்லது ஒடுக்குமுறையை வெளிப்படுத்துகின்றனவா என்பது குறித்து பிளவுபட்ட கருத்துக்கள் உள்ளன, அறிவியல் புனைகதை அமைப்புகளுடன் ஒப்பிடுகையில், இத்தாலியின் லாங்கரோனில் உள்ள ஒரு வரலாற்று தேவாலயம் உட்பட வெவ்வேறு இடங்களிலிருந்து எடுத்துக்காட்டுகள் விவாதிக்கப்படுகின்றன."
    ],
    "points": 122,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1714129886
  }
]
