[
  {
    "title": "Apple Vision Pro's EyeSight Display Reveals New Potential for Engagement and Functionality",
    "originLink": "https://www.dexerto.com/tech/apple-vision-pro-external-display-has-more-potential-than-we-thought-2387336/",
    "originBody": "",
    "originSummary": [
      "A beta version of Apple's VisionOS for the upcoming Apple Vision Pro headset introduces a new external display feature called EyeSight.",
      "EyeSight allows others to see the wearer's eyes, indicating if they are engaged in the virtual world or looking at them.",
      "Users can create an avatar by scanning their face with the headset's cameras, and this avatar is displayed through the EyeSight display. This opens up possibilities for developers to use EyeSight for various purposes like showing messages or advertisements."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Apple to Add RCS Support to iPhones in 2024",
    "originLink": "https://9to5mac.com/2023/11/16/happy-hour-460/",
    "originBody": "",
    "originSummary": [
      "Apple plans to introduce RCS (Rich Communication Services) support for iPhones in the coming year.",
      "RCS is an advanced messaging system that offers features like read receipts, typing indicators, group chats, and high-quality media sharing.",
      "This move will bring iPhone users closer to the rich messaging experience already available on Android devices."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Apple's Vision Pro Wows Fans with Mesmerizing Animations and Intuitive UI",
    "originLink": "https://www.creativebloq.com/news/vision-pro-ui",
    "originBody": "",
    "originSummary": [
      "Apple has introduced a new product called Vision Pro, along with visionOS, a new operating system.",
      "The latest beta version of visionOS includes instructional videos for setting up Vision Pro, known for its captivating animations and user-friendly interface.",
      "Aspects of visionOS are being integrated into other Apple products like iOS and Apple Watch, but there are concerns about the potential dystopian implications of Vision Pro."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Telegram to Launch App for Apple Vision Pro, Enabling Messaging on Mixed Reality Headsets",
    "originLink": "https://www.news18.com/viral/telegram-teases-tailored-app-for-apple-vision-pro-heres-what-to-expect-8665489.html",
    "originBody": "",
    "originSummary": [
      "-",
      "Telegram, a popular messaging app, will be accessible on Apple's Vision Pro mixed reality headset through a new app called visionOS, starting from next year.",
      "Owners of the Apple Vision Pro will enjoy features such as a translucent interface, the ability to dictate messages, and a virtual keyboard when accessing Telegram on their mixed reality devices.",
      "The app follows the design guidelines of visionOS and will be compatible with the upcoming operating system for the headset, which is set to release in early 2024."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Apple TV App Adds 3D Movie Support, Hints at Vision Pro Headset",
    "originLink": "https://www.opp.today/apple/the-apple-vision-pros-first-3d-movies-have-just-shown-up-in-the-app-store/198162/",
    "originBody": "",
    "originSummary": [
      "Apple's TV app now supports 3D movies, which has led to speculation about the potential launch of their Vision Pro headset.",
      "The addition of popular films in 3D format hints at Apple possibly developing a specialized file format for the upcoming device.",
      "While no original 3D content is currently available, Apple's focus on providing a comfortable and immersive viewing experience is clear, raising the possibility of a resurgence in 3D TVs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "iPhone 15 Pro's Spatial Video expands to Meta Quest: a glimpse into future VR experiences",
    "originLink": "https://www.phonearena.com/ar-vr/news/iphone-15-pros-3d-videos-quest-3_id152654",
    "originBody": "",
    "originSummary": [
      "Apple's iPhone 15 Pro brings a new feature called Spatial Video, enabling users to capture 3D videos.",
      "The videos are optimized for the Apple Vision Pro headset, but a developer's app called Spatialify allows viewing on VR headsets like the Meta Quest.",
      "Although not as immersive as the Vision Pro, this development signifies progress towards making 3D video accessible to a broader audience."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Apple Unveils New Macs with Custom M3 Chips, Highlighting Focus on AI",
    "originLink": "https://finance.yahoo.com/news/apple-scary-fast-upgrades-hint-172357540.html",
    "originBody": "",
    "originSummary": [
      "Apple has unveiled new Mac computers with custom-designed M3 chips optimized for artificial intelligence (AI), offering faster computing, longer battery life, and using 3 nanometer technology.",
      "The move reflects Apple's recognition of the growing importance of AI and the need for powerful computing capabilities, as it aims to gain ground in the PC and laptop market.",
      "Apple is positioning itself as a performance leader and aims to create its own ecosystem for developers to build AI-based tools, reaffirming the company's commitment to integrating AI into its products."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "iOS 17.2 Update Enables 3D Video Capture on iPhone 15 Pro for VR Viewing",
    "originLink": "https://techhq.com/2023/11/how-to-watch-spatial-video-ios-17-2-unlocks-3d-viewing/",
    "originBody": "",
    "originSummary": [
      "The iOS 17.2 update introduces a new feature that allows iPhone 15 Pro users to capture 3D scenes using their smartphone cameras.",
      "The primary purpose of this feature is to be used with Apple's Vision Pro headset; however, there are alternative options for viewing the spatial videos.",
      "Users can utilize the Zapbox app on their iPhone with a compatible headset or view the spatial videos on Meta's Quest 2, Quest 3, and other devices supporting the YouTube VR app. This makes recording and viewing 3D videos more accessible to users without expensive equipment."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  },
  {
    "title": "Apple's Vision Pro VR headset's spatial video feature unlocked by VR headsets",
    "originLink": "https://www.dexerto.com/tech/this-killer-apples-vision-pro-feature-has-already-been-unlocked-by-vr-headsets-2387154/",
    "originBody": "",
    "originSummary": [
      "Apple's Vision Pro VR headset will include spatial video, allowing for a more immersive experience.",
      "VR users can currently convert videos recorded with the iPhone 15 Pro using an app called Spatialify.",
      "Standalone VR headset users can transfer the converted video file to the headset via USB for viewing."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700229364401
  }
]
