[
  {
    "title": "Chinese Online Marketplace Temu Under Fire for Safety Concerns",
    "originLink": "https://www.opp.today/uncategorized-en/weapons-banned-in-uk-apparently-found-on-shopping-app-temu/218047/",
    "originBody": "Uncategorized xES xPL New Investigation Reveals Safety Concerns with Chinese Online Marketplace Temu 2 min read 5 mins ago Allan Ellis An in-depth investigationUK consumer champion Which? has uncovered alarming safety issues with the Chinese online marketplace, Temu. The investigation found listings for what appear to be illegal weapons, as well as knives and axes that should be age-restricted under UK law. Shockingly, researchers were able to purchase age-restricted items without any age verification checks being conducted. Which?’s researchers stumbled upon listings for batons and folding knives that closely resembled items banned in the UK, raising concerns about the regulations and checks in place on the platform. Moreover, some of the products were available for as low as £4.48, raising questions about the quality and safety of these items. Sue Davies, the head of consumer protection at Which?, expressed her concern over Temu’s rising popularity and called for the platform to improve its checking process, remove dangerous items from sale, and hold third-party sellers accountable for any breaches found. Temu has gained significant traction since its launch in September last year, with close to 38.8 million worldwide downloads, making it the most downloaded app in the UK this year. The platform’s success can be attributed to its widespread advertising on social media platforms like TikTok. Which?’s investigation discovered several items on Temu that were believed to be illegal weapons, including folding knives, key-ring knives, a survival knife, and a baton. Many of these items were listed as “self-defense” or “portable knives,” making them easily accessible through simple search terms like “weapons.” The sale of these illegal weapons online poses a grave risk, as they can easily end up in the wrong hands, potentially leading to devastating consequences. It is therefore crucial that platforms like Temu are held to the same safety standards as high-street retailers. FAQ: Q: What safety concerns were uncovered with Temu? A: The investigation revealed listings for illegal weapons and age-restricted knives and axes on the platform. Age verification checks were not carried out, allowing researchers to purchase these items without any restrictions. Q: How cheap were the products on Temu? A: Some of the products were shockingly cheap, starting from £4.48. Q: What action is Which? calling for? A: Which? is urging Temu to improve its checking process, remove dangerous items from sale, and hold third-party sellers accountable for any regulations they violate. Q: How popular is Temu? A: Temu has experienced rapid growth since its launch and recorded close to 38.8 million downloads worldwide, making it the most downloaded app in the UK this year. Continue Reading Previous Sector’s Valuable Private Company Sierra Space Reshapes Workforce Strategy Next New Advances in Cellulite Reduction: Beyond Diet and Exercise",
    "originSummary": [
      "Consumer advocacy group Which? has conducted an investigation on the Chinese online marketplace Temu, revealing safety issues.",
      "The investigation uncovered illegal weapons and age-restricted knives and axes listed without proper age verification checks, raising concerns about their quality and safety.",
      "Temu, which has gained significant popularity with almost 38.8 million worldwide downloads, is being urged by Which? to enhance its verification process, remove dangerous items, and hold third-party sellers responsible."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Chinese shopping app Temu found selling banned weapons and age-restricted items",
    "originLink": "https://www.theguardian.com/money/2023/nov/17/weapons-banned-in-uk-apparently-found-on-shopping-app-temu-which",
    "originBody": "Which? is calling for Temu to improve its checking process, remove dangerous items and hold third-party sellers to account where breaches are found. Photograph: Rafael Henrique/Sopa Images/Shutterstock Online shopping Weapons banned in UK apparently found on shopping app Temu Which? says it bought age-restricted knives and axes without checks from sellers on China’s answer to Amazon Sarah Marsh @sloumarsh Thu 16 Nov 2023 19.01 EST The Chinese online marketplace Temu is selling what appear to be illegal weapons, as well as knives and axes that should be age-restricted, an investigation has found. The UK consumer champion Which? says it discovered listings for batons and folding knives on the site that resembled items banned under UK law. Its researchers say they were also able to buy age-restricted items such as knives and axes without checks being carried out on how old the purchaser was. Some of the products were extremely cheap, starting from £4.48. Which? is calling for Temu to improve its checking process, remove dangerous items and hold third-party sellers to account where breaches are found. Age-restricted knives and axes that Which? researchers said they bought without checks being carried out on how old the purchaser was. Photograph: Which? Sue Davies, the head of consumer protection at Which?, said Temu, which has been touted as China’s answer to Amazon, “had a surge in popularity in the last 12 months”. She added: “Problems with dangerous products are only going to get worse if new tech giants like Temu continue to be held to weaker standards than high-street retailers.” Temu was launched in September last year and has since boomed thanks to widespread advertising on social media platforms such as TikTok. In August it recorded close to 38.8m downloads worldwide, and was the most downloaded app in the UK for the year to date. Shop like a billionaire? I bought six items from Temu – the app that’s sweeping the world Read more The products for sale on Temu that Which? researchers believed to be illegal weapons included two folding knives, two knives disguised as key-rings, a survival knife and a baton. Researchers said several of the items were listed as “self-defence” items and “portable knives”, and they were easily able to find them on Temu by searching simple terms including “weapons”. Products for sale on Temu that Which? researchers believed to be illegal weapons included knives disguised as key-rings. Photograph: Which? The Criminal Justice Act (Offensive Weapons) Order 1988 bans “any knife which has a concealed blade or concealed sharp point and is designed to appear to be an everyday object” and “a straight, side-handled or friction-lock truncheon (sometimes known as a baton)”. Anyone caught with such an item could face arrest and a prison sentence. The sale of such weapons online means they could easily end up in the wrong hands, Which? said. skip past newsletter promotion Sign up to Business Today Free daily newsletter Get set for the working day – we'll point you to all the business news and analysis you need every morning Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion In total, researchers identified six weapons they believed to be illegal, and said they were able to buy seven age-restricted products without any checks, but saw dozens of other listings with products that looked as if they could cause harm. They said they were able to set up several accounts on Temu without being asked for a date of birth, order seven age-restricted items and have them delivered without any age verification taking place at any stage. Which? researchers said they bought five knives and two axes, all of which can not be sold to anyone below 18 under the Criminal Justice Act 1988. They added that several of the items bought were also inaccurately labelled, including a weapon that was clearly an axe described as a “knife for preparing vegetables”. A Temu spokesperson said: “Temu is committed to complying fully with relevant rules and regulations in all of the markets that we operate in, and we take all reports of violations very seriously. “After receiving a complaint of a person under 18 purchasing a bladed article from our platform, we immediately removed all related product listings. We also initiated a comprehensive investigation and review of our processes to further strengthen our safeguards and prevent similar cases from occurring again.” Explore more on these topics Online shopping E-commerce Retail industry Consumer affairs news Reuse this content",
    "originSummary": [
      "Temu, a Chinese online marketplace often compared to Amazon, has come under fire for selling illegal weapons and age-restricted knives and axes without proper checks.",
      "A consumer investigation by UK watchdog Which? found listings for banned items and was able to purchase age-restricted products without verification.",
      "Which? is urging Temu to enhance its checking processes and remove dangerous items, while Temu claims it takes violations seriously and has already removed related product listings."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Temu under fire: Banned weapons found on popular shopping app",
    "originLink": "https://www.standard.co.uk/news/tech/temu-chinese-bargain-shopping-app-ecommerce-b1082134.html",
    "originBody": "NEWSTECH Who owns Temu? Weapons banned in UK apparently found on shopping app The Chinese e-commerce site has come under pressure to enhance its verification procedure, get rid of hazardous products, and make independent sellers accountable when security breaches are discovered TEMU IS THE NUMBER ONE FREE APP IN APPLE’S APP STORE FLORENCE LO / TEMU / REUTERS SEREN MORRIS|TAMARA DAVISON 1 HOUR AGO An investigation by Which? has discovered that knives and axes that ought to be age-restricted, along with what appear to be illegal weapons, are being sold on the Chinese internet marketplace Temu. The UK consumer advocate claims to have seen listings on the website for folding knives and batons that looked like things that were illegal in the country. According to its analysts, they were also able to purchase age-restricted goods like axes and knives without having their age verified. A few items were quite inexpensive, with prices as low as £4.48. Which? demands that Temu enhance its verification procedure, get rid of hazardous products, and make independent sellers accountable when security flaws are discovered. Meanwhile, the Chinese shopping app has been on the rise after being launched in the UK in April, keeping its grip on the number-one spot among shopping apps downloaded in the UK in the past six months. Some reports suggest that the discount e-commerce site's growth could even crack Amazon's dominance in the online retail space. However, the platform's growth hasn't been without controversy. Temu is currently embroiled in a US-based legal battle with its rival Shein. What's more, the US government said that there is an “extremely high risk” that products sold on Chinese bargain shopping site Temu were produced using forced labour. With items costing just pennies, sceptical customers are wondering: is Temu too good to be true? What is the Temu app? Temu is a Chinese ultra-low-cost shopping app that launched in the US last September and has expanded into the UK. It has been compared to other discount e-commerce sites, like AliExpress and Wish, which also sell a wide range of items at incredibly low prices. The platform sells a range of products directly from Chinese sellers, such as clothing, jewellery, beauty products, and homeware, at ultra-low prices. Temu’s prices are made even lower with its “lightning deals” and various sales, including deals promising up to 99 per cent off. For example, at the time of writing, Temu’s “lightning deals” included a ring for 77p and a bracelet for 89p. According to a report by the US-China Economic and Security Review Commission (USCC), Temu placed more than 8,000 ads across Meta platforms in 2023, and spent around $14 million (£11.2 m) on two adverts during the Super Bowl. The app also relies on influencer marketing, rewarding its affiliates with shopping perks and rewards, and encourages users to share the app with friends for deals in return. TEMU SELLS A WIDE RANGE OF PRODUCTS AT ULTRA-LOW PRICES FLORENCE LO / TEMU / REUTERS Where is Temu available? Temu was previously only available in the US, Canada, Australia, and New Zealand. As of April 2023, Temu also became available in the UK as well as a number of other European countries, including France, Spain, Germany, Italy, and the Netherlands, as reported by Reuters. It then entered the market in Japan and South Korea. At the start of September, Temu also rolled out in the Phillippines, marking the app's wider expansion in Southeast Asia. Mobile intelligence firm Sensor Tower reported that Temu was downloaded 19 million times in the first quarter of 2022, and was the most downloaded app on the Apple and Google Play stores in the US. Who owns Temu? Temu says it's headquartered in Boston. It's actually owned by the multinational commerce group PDD Holdings, which was founded by Chinese billionaire Colin Huang. It’s the sister site of the Chinese e-commerce platform Pinduoduo, which was valued at $200 billion(£160 bn) in 2021, according to the Financial Times. In March 2021, Huang stepped down from his executive roles at Pinduoduo and turned over the voting rights for his 29 per cent stake in the company. In 2020, Huang was briefly ranked the second-richest person in China thanks to a surge in sales at Pinduoduo, as reported by the BBC. Why is the US government concerned about Temu? The US government published a report over the summer saying there is an “extremely high risk” that Temu uses an online shipping loophole to avoid requirements of forced labour screenings. The report, published by the US Select Committee on the Chinese Communist Party (USCC), raises “serious concerns about the continued presence of products made with forced labour contaminating American imports”. “Temu does not have any system to ensure compliance with the Uyghur Forced Labor Prevention Act (UFLPA). This all but guarantees that shipments from Temu containing products made with forced labor are entering the United States on a regular basis,” it continued. The claims are part of an ongoing investigation into compliance with a 2021 US law that bars the import of goods made using forced Uyghur labour. Nike, Adidas and Chinese ultra-fast fashion brand Shein are also being investigated. The US government also accused Temu, alongside Shein, of “data risks, sourcing violations, and trade loopholes,” in a report published by the USCC in April. The report also raises concerns about quality and copyright: “Like Shein, Temu’s success raises flags about its business practices.” Temu has 3.3 stars on Trustpilot, with 33 per cent of reviews rating the platform one star. Negative reviews complain about the quality of the products and the number of notifications the app sends. The USCC report also says that PDD Holdings has been accused by China’s Labour Watch of forcing employees to work “extreme overtime”, and that CNN reported that sophisticated malware was found on the Pinduoduo sister app (though Temu itself was not implicated in either accusation). A report by CNN Business also raised concerns about Temu’s sustainability, with the company telling CNN that it offsets emissions for every order with “carbon credits which support wildlife conservation efforts” in the US. MORE ABOUT E-COMMERCE APP CHINESE JEWELLERY HOMEWARE Have your say... VIEW COMMENTS MOST READ 1 SHOWBIZ I’m A Celebrity star reveals she’s cut ties with Matt Hancock following jungle stint 2 WORLD If you don’t get cancelled, you’re not cool: Azealia Banks lets rip 3 FOOTBALL Chelsea best youngsters: Mauricio Pochettino pick, midfield star and next big English hope 4 LONDON London steak restaurant denies ‘guilt-tripping’ customers only ordering tap water with meal 5 FOOTBALL West Ham: Top two contenders emerge in battle for London Stadium naming rights Voucher Codes £50 off 2024 bookings over £800 with this TUI discount code 15% off all orders over £100 using this ASOS discount code 5% off all bookings with this Travelodge discount code 20% off everything with The Body Shop discount code 15% of all orders with The Perfume Shop birthday discount",
    "originSummary": [
      "Temu, a Chinese e-commerce app, is under scrutiny for selling banned weapons and age-restricted items without proper verification, according to consumer advocate group Which?",
      "Which? is urging Temu to improve its verification process and remove hazardous products.",
      "Despite the controversy, Temu has become the top free app in Apple's UK App Store, posing a potential challenge to Amazon's dominance in online retail."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Temu: Revolutionizing E-commerce with Unbeatable Prices and Quality Control",
    "originLink": "https://www.cincinnati.com/story/special/contributor-content/2023/11/16/is-temu-really-too-good-to-be-true/71598195007/",
    "originBody": "CONTRIBUTOR CONTENT Is Temu Really Too Good To Be True? David StubblefieldContributor In the world of e-commerce, Temu has emerged as a fast-growing player. After launching its business in the US in September 2022, Temu has quickly gained a reputation as an online superstore for its wide selection of everyday products at super-low prices. The Boston-based e-commerce platform has now expanded to 48 markets and is available to residents in countries including the US, Mexico, France, Germany, Italy, and Spain. Why is Temu so popular? “We are in a cost of living crisis and people are looking for anything to save a bit of money,” says Miya Knights, the publisher of Retail Technology magazine and the co-author of a book about Amazon. “Everyone likes a bargain and Temu ticks those boxes.” Many consumers are both enamored by Temu’s ultra-low prices and also a little wary, believing in the old adage that “if it’s too good to be true, it probably isn’t.” In this article, we take a close look at how Temu operates its business and how it can achieve the balance of offering functional merchandise at factory-like prices. A Brief Overview Of Temu Temu, headquartered in Boston, operates an online marketplace that offers a wide selection of products from international suppliers at competitive prices. The platform was launched in September 2022 and has since attracted a global user base by providing a convenient website and application, emphasizing value and customer service. Following its launch, Temu has expanded its inventory to include a vast variety of products, such as electronics, home essentials, clothing, and beauty products, covering more than 30 primary categories. What does Temu mean? Temu means “Team Up, Price Down.” The name Temu is derived from its motto, which expresses the goal of helping consumers fulfill their aspirations by lowering costs using economies of scale generated on the platform. How can Temu achieve such low prices? Feedback regarding Temu merchandise often highlights the exceptionally low prices. Customers can purchase a decent dress for under $2 and obtain wearable electronics for less than $5. Temu also carries a wider product variety compared to many local dollar stores, and it maintains lower prices than most e-commerce platforms, even during discount periods. The secret recipe behind Temu’s price competitiveness is its “fully-entrusted business model,” according to Wendy Chen, senior investment analyst at GAM Investments. Temu’s model which stands between the usual first-party (1P) e-commerce model (where the platform acts as a retailer to sell products directly) and third-party (3P) e-commerce model (where the platform acts as a marketplace for retailers to sell product themselves). Temu operates under a model where it sources products directly from factories, which are responsible solely for shipping to Temu’s warehouses in the destination countries, according to GAM. Thereafter, Temu manages customer acquisition, pricing strategies, logistics, and after-sales service. This approach allows Temu to maintain control over quality, delivery, and customer satisfaction—advantages typically associated with a first-party (1P) model. At the same time, it enjoys the diverse product selection and scalability characteristic of a third-party (3P) model. By streamlining the supply chain from the factory to the platform, Temu not only reduces costs but also minimizes inventory risk, says GAM’s Chen. Temu Explains Its Business Model By streamlining the supply chain and cutting out extraneous costs, Temu says it is possible to achieve both quality and affordability. Temu says that its ability to offer competitive prices stems from establishing a direct connection with cost-efficient producers, eliminating the need for middleman fees and enabling consumers to purchase goods at factory wholesale rates. The company's direct-to-consumer model is designed to avoid the additional markups that are common in retail, thereby providing products at substantially lower prices. The company also states that it leverages the consolidation of tens of thousands of consumer orders into bulk shipments to achieve economies of scale, which significantly lowers the shipping cost per item. According to Temu, this strategy ensures that the gross profit covers shipping costs and allows for fair profit margins for merchants on the platform. According to the company, its direct-from-factory model disrupts traditional retail by minimizing the number of times goods are transferred, which leads to significant cost reductions. By dispatching goods directly from the production source, Temu bypasses multiple levels of transportation and warehousing, addressing what it views as one of the biggest costs and inefficiencies in conventional retail operations. Temu says that its business model is strategically efficient, ensuring that the pricing not only covers the costs of products, transportation, and sales but also provides sellers with ample margins for business development and expansion. Is it safe to shop on Temu? Temu says that unlike other e-commerce platforms, it does not allow dropshipping. Dropshipping refers to the retail method where a store sells products without keeping them in stock, instead purchasing items from a third party to ship directly to customers after a sale. Instead, Temu follows a model where listed merchandise must be in stock by the merchants themselves and stored in or sent to Temu-affiliated warehouses. Temu says that it conducts quality control spot checks on these goods, ensuring adherence to quality and compliance standards. Temu states that its clear chain of custody for products reduces the incidence of wrong or empty package deliveries, thereby increasing customer satisfaction. The company maintains that shopping on its site is safe, highlighting its status as a TrustedSite Certified Secure Site and its adherence to the Payment Card Industry Data Security Standard (PCI DSS) for encrypting card information during storage and transmission. Furthermore, Temu collaborates with major payment networks that have robust security and authentication protocols, including Visa Secure, MasterCard ID Check, American Express SafeKey, Discover ProtectBuy, and JCB J/Secure, according to its website. Lastly, according to the company, Temu's purchase protection program ensures a secure shopping experience by offering refunds to customers for orders that are not as described or if the products arrive damaged, giving buyers the peace of mind to “shop like a billionaire.” More from Contributor Content Decoding Bitcoin: Essential Insights for Smart Investing Top Things to Do in Cincinnati this Fall",
    "originSummary": [
      "Temu is an e-commerce platform known for its extensive product range and affordable prices.",
      "The company follows a direct-to-consumer business model, sourcing products directly from factories and handling customer acquisition, pricing, logistics, and after-sales service.",
      "Temu's model eliminates middleman fees, achieves economies of scale, and allows the company to offer competitive prices. The platform also prioritizes customer safety through quality control spot checks, secure payment systems, and a purchase protection program."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Weapons sold on shopping app Temu without age checks, says Which?",
    "originLink": "https://news.sky.com/story/weapons-being-sold-on-shopping-app-temu-with-no-age-checks-consumer-group-which-finds-13010099",
    "originBody": "Weapons being sold on shopping app Temu with no age checks, consumer group Which? finds Consumer group Which? says it bought knives and axes off the popular shopping app with no age checks. Some weapons were on sale for as little £4.48. Friday 17 November 2023 11:16, UK Why you can trust Sky News Weapons including knives and axes have been sold on the shopping app Temu without any age checks taking place, a consumer group has found. Which? found some weapons on sale for as little £4.48. Researchers also found weapons they believe to be illegal for sale on Temu including two folding knives, two knives disguised as keyrings, a survival knife and a baton. These weapons are classed as banned weapons under the Criminal Justice Act, Which? said. Anyone caught with one of them could face arrest and a prison sentence, and they could easily fall into the wrong hands, the group added. In total, researchers identified six weapons they believed to be illegal and were able to buy seven age-restricted products - five knives and two axes - without any age checks; but said they saw dozens of other listings with products that looked like they could potentially cause harm. Temu was only launched in September 2022, but has quickly become one of the most popular online marketplaces worldwide. In the UK it was the most downloaded app for the year to August. Which? said the lack of controls to stop children purchasing age-restricted items and even what it said were illegal weapons was particularly concerning given how widely advertised Temu is on sites like TikTok. The group is calling for Temu to improve its checking system, remove dangerous items and hold third-party sellers to account where breaches are found. Be the first to get Breaking News Install the Sky News app for free Read more from Sky News: Adverts for Temu banned for sexualising a child Police crack down on machetes and zombie knives Advertisement \"Problems with dangerous products are only going to get worse if new tech giants like Temu continue to be held to weaker standards than high-street retailers,\" said Sue Davies, Which? head of consumer protection policy. \"The online marketplace needs to improve its checks, monitoring and takedown processes, and ensure third-party sellers cannot list these dangerous items - particularly to young people under the age of 18.\" A Temu spokesperson said: \"Temu is committed to complying fully with relevant rules and regulations in all of the markets that we operate in, and we take all reports of violations very seriously. \"After receiving a complaint of a person under 18 purchasing a bladed article from our platform, we immediately removed all related product listings. \"We also initiated a comprehensive investigation and review of our processes to further strengthen our safeguards and prevent similar cases from occurring again.\" Related Topics Retail",
    "originSummary": [
      "Consumer group Which? has found that weapons, including knives and axes, are being sold on the shopping app Temu without any age verification checks.",
      "Some weapons are being sold for as little as £4.48 on Temu, with the group identifying illegal items such as folding knives, keyring knives, a survival knife, and a baton.",
      "Temu, a popular online marketplace launched in September 2022, is being urged by Which? to enhance its checking system, remove dangerous items, and take responsibility for third-party sellers."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Illegal weapons and age-restricted items sold on popular UK online marketplace",
    "originLink": "https://www.mirror.co.uk/news/uk-news/knives-axes-batons-sold-via-31459544",
    "originBody": "Knives, axes and batons are sold via online marketplace with no age checks A probe showed the products were being traded on Temu – the most downloaded app in the UK for the year to August - and age-restricted items were also being sold Baton thought to be illegal on sale on Temu ( Image: PR HANDOUT) NEWS POLITICS FOOTBALL CELEBS TV CHOICE By Natasha WynarczykConsumer Editor 00:01, 17 Nov 2023 || Bookmark Illegal weapons including folding knives and batons are being sold on a fast-growing online marketplace, an investigation found. The products were being traded on Temu – the most downloaded app in the UK for the year to August. And age-restricted items such as axes were also being sold on the site without the required age checks. Researchers identified six weapons they believed to be illegal – two folding knives, two knives disguised as keyrings, a survival knife and a baton – and were able to buy seven age-restricted products without checks. On three listings that stated how many of the products had been sold, sales were near 102,000. The investigators, from consumer magazine Which?, did not need to provide proof of age to buy five knives and two axes, all of which cannot be sold to under-18s under the Criminal Justice Act 1988. Two boys, 12, charged with murder after 19-year-old stabbed to death in Wolverhampton Penknife disguised as a keyring ( Image: PR HANDOUT) Researchers set up several accounts on Temu without giving a date of birth, then ordered weap-ons and had them delivered with no age verification. Some of the products were extremely cheap, with listings from just £4.48. Temu – which launched in September last year and is based in Boston, US – is widely advertised on sites popular with young people such as TikTok and Instagram. Operated by Ireland-based Chinese e-commerce company PDD Holdings, it offers heavily discounted goods shipped from China. Sue Davies, Which? head of consumer protection policy, said: “Problems with dangerous products will get worse if new tech giants like Temu continue to be held to weaker standards than high-street retailers.” Knife crime lawyer Caroline Liggins, of Hodge Jones & Allen, said: “Public safety must come before profits. It’s shocking how cheap the items are on Temu – they are pocket money prices.” There were 282 knife deaths in the year to March 2022, up 19% on the previous year. The largest rise was among boys aged 16 to 17, up from 10 to 24. Temu said it is “committed to complying fully with relevant rules and regulations” in markets it operates in and takes “all reports of violations very seriously”. It added: “After a complaint of a person under 18 purch-asing a bladed article, we immediately removed all related product listings. We also initiated a comprehensive investigation and review to further strengthen safeguards.” Ninja toaster with a hidden talent that 'saves energy' sees price cut for Black Friday FollowMirror FacebookTwitter Comment Promoted Stories MORE ON AppsCrimeKnife crime Get email updates with the day's biggest stories Sign up",
    "originSummary": [
      "Illegal weapons, such as knives and batons, are being sold on the UK online marketplace Temu.",
      "Age-restricted items are also being sold on the platform without proper age verification checks.",
      "Researchers were able to purchase six illegal weapons and seven age-restricted products without age verification, raising concerns about the safety of online marketplaces and the necessity for stricter regulations."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Troubling Findings on Chinese Online Marketplace Temu: Illegal Weapons and Age-Restricted Items Sold Without Verification",
    "originLink": "https://citylife.capetown/uncategorized/weapons-banned-in-uk-apparently-found-on-shopping-app-temu/452720/",
    "originBody": "A recent investigation by consumer champion Which? has uncovered concerning practices on the Chinese online marketplace, Temu. The investigation revealed that Temu is selling what appear to be illegal weapons, as well as knives and axes that should be age-restricted. Which? researchers were able to identify listings for batons and folding knives on Temu that resembled items banned under UK law. Shockingly, they were also able to purchase age-restricted items such as knives and axes without any age verification checks being carried out. This raises serious concerns about the potential for these dangerous items to end up in the wrong hands. Not only were the items available on Temu potentially illegal or age-restricted, but some of them were also extremely cheap, with prices starting as low as £4.48. According to Sue Davies, the head of consumer protection at Which?, Temu’s surge in popularity over the last year poses a significant threat. She emphasizes the need for Temu to improve its checking process, remove dangerous items from its platform, and hold third-party sellers accountable for any breaches. Temu, often referred to as China’s answer to Amazon, has gained widespread attention and popularity since its launch in September last year. With close to 38.8 million worldwide downloads in August alone, it has become the most downloaded app in the UK for the year. The products identified by Which? researchers on Temu that appeared to be illegal weapons included folding knives, knives disguised as key-rings, a survival knife, and a baton. Some of these items were listed as “self-defense” or “portable knives,” making them easily accessible to users searching for weapons. The sale of such weapons online is alarming, as it facilitates easy access for individuals who may intend harm. The Criminal Justice Act (Offensive Weapons) Order 1988 clearly bans the sale of concealed blades designed to appear as everyday objects, as well as side-handled or friction-lock truncheons. To address the issue, Which? is calling on Temu to enhance its checking procedures, remove dangerous items from the platform, and enforce stricter standards for third-party sellers. It is crucial that online marketplaces prioritize consumer safety and work diligently to prevent the sale of illegal and dangerous products. FAQs Q: What did the investigation reveal about Temu? A: The investigation discovered that Temu was selling potentially illegal weapons, as well as knives and axes that should be age-restricted. Q: How were these items accessible on Temu? A: Which? researchers found listings on Temu that resembled banned items under UK law, and they were able to purchase age-restricted items without any age verification checks being carried out. Q: What is Which? calling for? A: Which? is calling for Temu to improve its checking process, remove dangerous items, and hold third-party sellers accountable for any breaches. Q: How popular is Temu? A: Temu has gained significant popularity, with close to 38.8 million worldwide downloads in August alone. It has become the most downloaded app in the UK for the year. Q: What is banned under the Criminal Justice Act (Offensive Weapons) Order 1988? A: The act bans concealed blades designed to appear as everyday objects and side-handled or friction-lock truncheons. Anyone caught with such items could face arrest and a prison sentence. Post navigation New Features Unveiled in Samsung’s Galaxy Enhance-X Update",
    "originSummary": [
      "An investigation by consumer advocacy group Which? has exposed concerning practices on the Chinese online marketplace Temu.",
      "The investigation revealed that Temu was selling potential illegal weapons and age-restricted items such as knives and axes without proper age verification checks.",
      "Which? is urging Temu to improve its checking procedures, remove dangerous items, and hold third-party sellers accountable.",
      "Temu has gained immense popularity, with nearly 38.8 million worldwide downloads in August alone, making it the most downloaded app in the UK for the year.",
      "This revelation raises concerns about the easy availability of dangerous items through online marketplaces.",
      "Which? stresses the need for online platforms to prioritize consumer safety and prevent the sale of illegal and hazardous products."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  },
  {
    "title": "Temu Accused of Selling Dangerous Weapons Without Age Checks, Investigation Reveals",
    "originLink": "https://www.the-sun.com/tech/9648382/dangerous-weapons-road-rage-knives-temu-which-investigation/",
    "originBody": "Tech NOT 'APPY Dangerous weapons including ‘road rage knives’ found on Temu for less than a fiver, investigation reveals Plus, how much prison time you could receive for carrying one Millie Turner, Technology & Science Reporter Published: 19:01 ET, Nov 16 2023Updated: 6:02 ET, Nov 17 2023 Click to share on X/Twitter (Opens in new window) Click to share on Facebook (Opens in new window) CHINESE mega-store Temu has been accused of selling dangerous and 'illegal' weapons without age checks, according to a Which? investigation. Consumer organisation Which? allegedly found axes, switchblades disguised as key rings and knives marketed as \"road rage self-defence\" weapons on the platform. 3 Nine dangerous items that Which? looked at are thought to have been sold more than 120,000 times collectivelyCredit: Which? 3 Which? believes some of these weapons are illegal, including the batons and folding knivesCredit: Which? 3 Listing prices for potentially lethal weapons began at just £4.48, Which?'s investigation foundCredit: Which? Nine dangerous items that Which? looked at are thought to have been sold more than 120,000 times collectively. Which? believes some of these weapons are illegal, including the batons and folding knives. In the UK, it is illegal carry any knife in public without good reason, unless it has a manual folding blade less than 3 inches long. Anyone who is carrying a knife with the intention of using it as a weapon – even in self-defence - can be arrested, go to court and receive a police record or prison sentence of up to four years. Age-restricted items like axes and knives were also being sold with no age checks, the organisation said. Much like Temu's other products, some of these items were incredibly cheap. Prices for potentially lethal weapons began at just £4.48, Which?'s investigation found. Why is Temu so cheap? MOST READ IN TECH STOP SNOOPING Snoop Dogg begs fans to respect his privacy after 'giving up smoke' DOGG TIRED Fans ask if Snoop Dogg 'OK' as rapper posts cryptic claim he's 'giving up smoke' BREAST YOU LEAVE Danii Banks flashes in stands during NFL game and is kicked out stadium O-EM-G! Emily Ratajkowski flashes bare butt in thong bikini for sultry swimwear campaign Temu, which launched last September, has quickly become people's number one retail destination in the UK and the US, with the promise of letting customers 'shop like a billionaire on a budget'. It was this year's most downloaded app in the UK, an achievement that was almost certainly buoyed by its popularity on TikTok. You can buy anything from kitchen gadgets, electronics and outdoor furniture to makeup, baby clothes and power tools on the site. Most of it is up for sale for less than £10. Which? believes the lack of controls to prevent minors purchasing age-restricted items and 'illegal' weapons is concerning given how widely advertised the marketplace is on TikTok. “Temu has topped the app download charts and is heavily advertised on social media sites used by many young people. We are concerned they may be exposed to adverts and listings for these weapons and based on our research, be able to buy them easily,\" Sue Davies, Which? Head of Consumer Protection Policy, told The Sun. “Sales appear to be worryingly high - with listings suggesting 120,000 purchases made by shoppers on just nine of the items we looked at. “Temu needs to step up and show it can be a responsible online marketplace. Our findings are a reminder that we desperately need new laws to tackle unsafe products on online marketplaces - with tough penalties when tech firms fall short of what's needed to keep people safe.” A Temu spokesperson said: “Temu is committed to complying fully with relevant rules and regulations in all of the markets that we operate in, and we take all reports of violations very seriously. READ MORE ON THE US SUN 'GETS DARK' Members of Sean 'Diddy' Combs' girl band 'praying' for Cassie after allegations ‘SICK SCAM’ Missing woman's mom tells of eerie Cash App requests after disappearance “After receiving a complaint of a person under 18 purchasing a bladed article from our platform, we immediately removed all related product listings. \"We also initiated a comprehensive investigation and review of our processes to further strengthen our safeguards and prevent similar cases from occurring again.” Topics Crime Police Temu London YOU MIGHT LIKE",
    "originSummary": [
      "Chinese mega-store Temu is facing allegations of selling dangerous and potentially illegal weapons without age verification checks.",
      "An investigation by consumer organization Which? found items like axes, switchblades disguised as key rings, and knives marketed as \"road rage self-defense\" weapons sold on the platform.",
      "Temu, heavily promoted on social media platforms like TikTok and the most downloaded app in the UK and US, is being called out by Which? for unsafe products and is urging for new laws to address this issue."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700227469637
  }
]
