[
  {
    "id": 38023891,
    "title": "الكمبيوتر السحابي",
    "originLink": "https://oxide.computer/blog/the-cloud-computer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38023891",
    "commentBody": "",
    "originSummary": [
      "تعلن Oxide عن التوافر العام لما تدعي أنه أول كمبيوتر سحابي تجاري في العالم ، إلى جانب 44 مليون دولار في تمويل السلسلة A.",
      "تتضمن رؤية الشركة جهاز كمبيوتر سحابي قابل للشراء بدلا من نموذج التأجير الحالي ، والدعوة إلى نموذج على مستوى الرف حيث يتم تصميم البرامج والأجهزة بشكل مشترك.",
      "يهدف كمبيوتر Oxide السحابي إلى تقليل زمن الوصول والضوضاء ، وإزالة الكابلات غير الضرورية ، وتقديم حل متكامل مفتوح المصدر دون ترخيص منفصل."
    ],
    "commentSummary": [
      "Oxide.computer هي شركة تبيع الخوادم إلى جانب البرامج مفتوحة المصدر ، وتضع نفسها كجسر بين بائعي السحابة التقليديين وشركات الخوادم المستقلة. إنهم يخططون لاستخدام سلسلة شرائح AMD التالية في المنتجات القادمة.",
      "على الرغم من المخاوف التي تدور حول استخدام خوادم الجيل السابق وتراجع Solaris ، فقد حصلت Oxide على ردود فعل إيجابية من AMD وأظهرت كفاءتها في السوق ، مما أثار مناقشات حول اضطراب السوق المحتمل.",
      "بالإضافة إلى ذلك ، خلق النقاش استفسارات حول مزايا البرامج الثابتة مفتوحة المصدر ، وامتلاك الأجهزة مقابل استئجارها. في النهاية ، تسعى Oxide إلى تقديم بيئة أجهزة / برامج متكاملة كبديل للخدمات السحابية باهظة الثمن."
    ],
    "points": 1519,
    "commentCount": 838,
    "retryCount": 0,
    "time": 1698317039
  },
  {
    "id": 38025767,
    "title": "التأثير السلبي لتصميم الويب للجوال أولا على سطح المكتب",
    "originLink": "https://www.nngroup.com/articles/content-dispersion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025767",
    "commentBody": "",
    "originSummary": [
      "تركز المقالة على عيوب تصميم الويب للجوال أولا فيما يتعلق بقابلية استخدام سطح المكتب ، خاصة بسبب \"تشتت المحتوى\" حيث يتم عرض الصفحات المحسنة للجوال بشكل سيئ على الشاشات الكبيرة.",
      "تكشف نتائج اختبارات قابلية الاستخدام عن ارتفاع الحمل المعرفي وتكاليف التفاعل وإحباط المستخدم الناتج عن تشتت المحتوى.",
      "يقترح السرد إرشادات للتخفيف من هذه المشكلات ، مع تسليط الضوء على الأهمية المستمرة لتصميم الجوال أولا وجماليات الحد الأدنى وسط زيادة حركة مرور الويب على الأجهزة المحمولة."
    ],
    "commentSummary": [
      "تتناول المناقشة جوانب تصميم الويب المختلفة ، بما في ذلك عيوب تصميم الجوال أولا التي تؤثر على مستخدمي سطح المكتب وفكرة \"hinternet\" ، بهدف تجربة فائقة وشاملة عبر الإنترنت.",
      "يتناول تفضيلات المستخدم واحتياجاته ، وقيود السوق ، والتحديات التي يواجهها مهندسو الواجهة الأمامية ، مع التركيز على المهمة الصعبة المتمثلة في تطوير الواجهة الأمامية.",
      "يتم تناول انتقادات تصميم الويب الحديثة ، مثل الخيارات والوظائف المحجوبة ، مما يعزز أهمية التصميم المتمحور حول المستخدم ، وسهولة الاستخدام ، وإمكانية الوصول ، ومراجعات الأقران في تصميم الويب."
    ],
    "points": 708,
    "commentCount": 434,
    "retryCount": 0,
    "time": 1698329205
  },
  {
    "id": 38026736,
    "title": "I2P: إنترنت مشفر من طرف إلى طرف ومجهول",
    "originLink": "https://github.com/PurpleI2P/i2pd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38026736",
    "commentBody": "",
    "originSummary": [
      "مستودع GitHub \"PurpleI2P / i2pd\" مخصص لتنفيذ C ++ لعميل بروتوكول الإنترنت غير المرئي (I2P) ، والذي يتيح اتصالات مجهولة ومشفرة بشكل آمن.",
      "يتميز المستودع بالتعليمات البرمجية والوثائق والموارد لتطوير واستخدام عميل i2pd.",
      "تم ترخيص المشروع بموجب ترخيص BSD المكون من 3 بنود ، ويتمتع المشروع بصيانة نشطة من قبل مجتمع من المساهمين."
    ],
    "commentSummary": [
      "يركز النقاش على I2P ، وهو مشروع إنترنت مشفر ومجهول مصمم لتجنب التحكم في إخفاء هوية المستخدم من قبل كيان واحد. على الرغم من ذلك ، لم تشهد I2P شعبية كبيرة ، وغالبا ما يتم تجاهلها لمشروع Tor الممول بسخاء.",
      "يقترح المستخدمون أن تظل شبكات VPN ضرورية لتحسين الاتصال حتى يستثمر مزودو خدمات الإنترنت أكثر في الأجهزة والنظير. كما يدرس التحول من نظير إلى نظير إلى بنية مركزية وعيوبها المحتملة.",
      "تم تسليط الضوء على المقارنة بين سرعة I2P وفائدته في التورنت مقابل البدائل مثل Tor و VPN. تشير المناقشة أيضا إلى الأداء المحتمل والقدرات عبر الأنظمة الأساسية لجافا في سياق الأنظمة اللامركزية الأخرى مثل Freenet و PerfectDark و Maidsafe."
    ],
    "points": 336,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1698333504
  },
  {
    "id": 38032288,
    "title": "مقدمة تفاعلية عن التظليل",
    "originLink": "https://www.mayerowitz.io/blog/a-journey-into-shaders",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38032288",
    "commentBody": "",
    "originSummary": [
      "يوضح المقال عملية الكاتب في دراسة وإنشاء التظليل ، ويغطي المبادئ والإمكانيات الأساسية التي يقدمونها.",
      "يشرح وظائف المسافة الموقعة (SDFs) ويتضمن عينات ترميز لتشكيل التفاعل ودمجه.",
      "يثني الكاتب على تجربة التظليل ويقدم توجيهات لمزيد من الفهم والبحث المتعمق."
    ],
    "commentSummary": [
      "يقدم المؤلف برنامجا تعليميا تفاعليا حول التظليل ، مما يجعله متاحا بأمثلة عملية ، والتي استقبلها القراء بشكل جيد.",
      "يوصي المؤلف أيضا بموارد وفنانين آخرين في مجال الفن التوليدي ، مما يدل على التزامهم بالتدوين الصادق.",
      "يشير بعض القراء إلى قيود التظليل للرسومات غير 3D ، مما يضيف منظورا متنوعا للمناقشة حول البرنامج التعليمي."
    ],
    "points": 292,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1698357787
  },
  {
    "id": 38024665,
    "title": "صور الأقمار الصناعية للحرب الباردة تكشف عن حصون رومانية مجهولة",
    "originLink": "https://www.theguardian.com/science/2023/oct/26/cold-war-satellite-images-hundreds-unknown-roman-forts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38024665",
    "commentBody": "",
    "originSummary": [
      "حدد علماء الآثار 396 حصنا رومانيا لم تكن معروفة من قبل في سوريا والعراق ، من خلال صور الأقمار الصناعية التجسسية التي رفعت عنها السرية من حقبة الحرب الباردة.",
      "يعتقد الآن أن هذه الحصون ، التي كان يعتقد في السابق أنها جزء من خط دفاعي ، قد دعمت التجارة والاتصالات عبر الحدود ، متحدية فكرة الحدود الرومانية الصارمة والإقصائية.",
      "يسلط الباحثون الضوء على قيمة صور الأقمار الصناعية في توثيق القطع الأثرية قبل اختفائها، ويتطلعون إلى اكتشافات إضافية مع إمكانية الوصول إلى المزيد من الصور."
    ],
    "commentSummary": [
      "كشفت صور الأقمار الصناعية التي تعود إلى حقبة الحرب الباردة النقاب عن حصون رومانية غير معروفة ، بعضها دمر بالفعل ، مما يوفر سياقا وأهمية تاريخية مهمة.",
      "تسلط المناقشة الضوء على استخدام صور الأقمار الصناعية التاريخية للبحث الأثري ، والصعوبات في الحفاظ على القطع الأثرية التاريخية ، وإمكانية الاستفادة من الذكاء الاصطناعي واستخراج البيانات.",
      "علاوة على ذلك ، يتم استكشاف مواضيع مثل تكنولوجيا الكاميرا والإمبراطورية الرومانية وعدم استقرار شرق البحر الأبيض المتوسط وتاريخ العبودية."
    ],
    "points": 276,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1698323518
  },
  {
    "id": 38025998,
    "title": "يمكن حصاد الأخشاب الصلبة الحصرية بشكل غير قانوني",
    "originLink": "https://www.chalmers.se/en/current/news/75-percent-of-exclusive-hardwood-may-be-illegally-harvested,c3863187/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025998",
    "commentBody": "",
    "originSummary": [
      "كشفت دراسة أجرتها جامعة تشالمرز للتكنولوجيا أن أكثر من 75٪ من ipê ، وهو خشب استوائي مرغوب فيه يستخدم في الطوابق ، ربما تم حصاده بشكل غير قانوني من منطقة الإنتاج الرئيسية في البرازيل.",
      "واكتشفت الدراسة أن 16 في المائة من الأخشاب المتداولة في السوق يتم تسجيلها دون تصاريح مناسبة، وأن كمية الخشب المتداولة تتجاوز إحصاءات الإنتاج الرسمية.",
      "يسلط البحث الضوء على الدور الحاسم الذي يلعبه المستهلكون في ضمان مصادر الأخشاب المستدامة ، من خلال التشكيك في أصل الخشب وطلب الوثائق قبل الشراء."
    ],
    "commentSummary": [
      "يستكشف الحوار استخدام الخشب على عكس المواد البديلة في البناء والأرضيات ، ويقيم العواقب البيئية لقطع الأشجار غير القانوني.",
      "ينظر المناقشون أيضا في إمكانات تقنية blockchain لتتبع أصل الخشب ، وقضايا حصاد الأخشاب غير المصرح بها وإزالة الغابات ، إلى جانب المزايا والعيوب المتعلقة بأنواع مختلفة من الأرضيات.",
      "يقترح الإنفاذ التنظيمي مثل CITES (اتفاقية التجارة الدولية في الأنواع المهددة بالانقراض من الحيوانات والنباتات البرية) للتخفيف من الطلب غير القانوني على الخشب ، مع تقديم حلول مثل زراعة الأشجار وإنشاء وثائق المصدر."
    ],
    "points": 275,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1698330234
  },
  {
    "id": 38025177,
    "title": "نما الناتج المحلي الإجمالي الأمريكي بوتيرة سنوية بلغت 4.9٪ في الربع الثالث ، أفضل من المتوقع",
    "originLink": "https://www.cnbc.com/2023/10/26/us-gdp-grew-at-a-4point9percent-annual-pace-in-the-third-quarter-better-than-expected.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025177",
    "commentBody": "",
    "originSummary": [
      "شهد الاقتصاد الأمريكي معدل نمو أعلى من المتوقع بنسبة 4.9٪ في الربع الثالث بسبب عوامل متعددة بما في ذلك الإنفاق الاستهلاكي القوي وزيادة المخزونات والصادرات والاستثمار السكني والإنفاق الحكومي.",
      "يتوقع الاقتصاديون تباطؤا وشيكا في النمو في الأشهر التالية.",
      "يمكن أن يوفر التقرير الاقتصادي القوي أسبابا لمجلس الاحتياطي الفيدرالي للحفاظ على أسعار الفائدة المرتفعة ، على الرغم من أن توقع زيادة أسعار الفائدة في اجتماع البنك المركزي القادم منخفض بين المتداولين."
    ],
    "commentSummary": [
      "تشمل المناقشة مجموعة واسعة من الموضوعات مثل نمو الناتج المحلي الإجمالي للولايات المتحدة ، ومزايا العيش في الولايات المتحدة ، ومقارنة أنظمة الرعاية الصحية بين الولايات المتحدة وأوروبا ، وسياسات الهجرة.",
      "يتم التأكيد على وجهات نظر متنوعة حول المجتمع الأمريكي والاقتصاد الأمريكي وتأثير السياسات على الأفراد والمهاجرين في المحادثة.",
      "كما يذكر مقارنات بين الولايات المتحدة والدول المتقدمة الأخرى فيما يتعلق بشبكات الأمان الاجتماعي وفرص العمل والتقدم الاقتصادي."
    ],
    "points": 271,
    "commentCount": 665,
    "retryCount": 0,
    "time": 1698326583
  },
  {
    "id": 38030932,
    "title": "تاكيو بن: شحن الأمتعة في اليابان",
    "originLink": "https://craigmod.com/ridgeline/170/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030932",
    "commentBody": "",
    "originSummary": [
      "يقدم المقال نصيحة سفر مفيدة لأولئك الذين يسافرون في اليابان ، حيث يقدم \"takkyu-bin\" ، وهي خدمة شحن الأمتعة المتوفرة في الفنادق والمتاجر.",
      "تقدم خدمة takkyu-bin مزايا لا تعد ولا تحصى مثل تخفيف عبء نقل الأمتعة الثقيلة وتضمن وصول أمتعتك إلى وجهتك اللاحقة.",
      "بالإضافة إلى الخدمة المذكورة ، يقدم المقال إشارة موجزة لكتاب المؤلف القادم وينقل امتنانهم للدعم الذي حصلوا عليه."
    ],
    "commentSummary": [
      "يروي المؤلف حادثة شخصية لاستخدام خدمة شحن الأمتعة في اليابان ، والمعروفة باسم \"takkyu-bin\".",
      "تدور المناقشة الرئيسية في قسم التعليقات حول إيجابيات وسلبيات هذه الخدمات ، وتتطرق إلى ملاءمتها وجداول التسليم.",
      "تشمل الموضوعات الإضافية للمناقشة تعلم اللغة ونصائح السفر وأهمية حمل جوازات السفر ، وتحديدا في سياق اليابان والدول الأخرى."
    ],
    "points": 238,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1698350179
  },
  {
    "id": 38029479,
    "title": "تعمل Cities Skylines 2 بمعدل 20 إطارا في الثانية على Nvidia RTX4090",
    "originLink": "https://www.dsogaming.com/pc-performance-analyses/cities-skylines-2-runs-with-20fps-on-an-nvidia-rtx4090-at-4k-high-even-on-an-empty-map/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38029479",
    "commentBody": "",
    "originSummary": [
      "أطلقت Paradox Interactive لعبة Cities Skylines 2 ، وهي لعبة بناء مدن ، والتي تعاني حاليا من ضعف الأداء على جهاز الكمبيوتر ، حتى مع بطاقات الرسومات المتطورة مثل NVIDIA GeForce RTX 4090.",
      "على الرغم من عدم استخدام التأثيرات المرئية المتقدمة مثل Ray Tracing أو Path Tracing ، إلا أن اللعبة تكافح مع معدلات الإطارات ، حيث تعمل بمعدل 20 إطارا في الثانية تقريبا على إعدادات 4K / High.",
      "بينما يعمل مطور اللعبة ، Colossal Order ، على تحسينات الأداء ، فإن الحلول الحالية مثل خفض إعداد عمق جودة المجال تقدم تحسينات طفيفة فقط."
    ],
    "commentSummary": [
      "تدور المناقشة المركزية حول قضايا الأداء والتحسين في لعبة الفيديو Cities Skylines 2 ، حيث يعبر المستخدمون عن إحباطهم من انخفاض معدلات الإطارات وضعف التحسين.",
      "يناقش المستخدمون قدرات الأجهزة وإعدادات الرسومات وتأثير أداء محرك لعبة Unity ، ويتطرقون إلى أهمية سرعة المحاكاة وتوقعات اللاعبين.",
      "هناك وجهات نظر متنوعة بين المستخدمين ، حيث يدافع البعض عن أداء اللعبة وينتقد البعض الآخر المطورين بسبب خيبة الأمل من صور اللعبة. كما تتم مناقشة أفكار التحسينات أو الإصلاحات المحتملة."
    ],
    "points": 238,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1698343725
  },
  {
    "id": 38026119,
    "title": "إجراء حصوات الكلى \"لديه القدرة على تغيير قواعد اللعبة\"",
    "originLink": "https://komonews.com/news/local/uw-medicine-kidney-stone-breakthrough-procedure-treatment-nasa-mars-astronaut-research-patients-game-changer-seattle-clinical-trial-harborview-medical-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38026119",
    "commentBody": "",
    "originSummary": [
      "UW Medicine هي عملية ثورية تعرف باسم تفتيت الحصوات بموجة الانفجار لعلاج حصوات الكلى ، مما يلغي الحاجة إلى التخدير.",
      "يستخدم الإجراء عصا الموجات فوق الصوتية والموجات الصوتية لتفكيك حصوات الكلى ، مما يوفر الراحة في أقل من 10 دقائق. يمكن أن يكون في متناول المرضى في بيئة مكتبية خلال العام المقبل.",
      "قد يكون هذا الابتكار مفيدا لرواد الفضاء الذين يسافرون إلى المريخ والذين لديهم احتمالية أكبر للإصابة بحصوات الكلى."
    ],
    "commentSummary": [
      "تمثل حصوات الكلى ، التي تتفاقم بسبب ظروف انعدام الوزن وإزالة المعادن من العظام ، خطرا كبيرا على رواد الفضاء ، خاصة بالنسبة لبعثات المريخ.",
      "تبحث ناسا عن طرق للتخفيف من هذه المشكلة ، مع احتمال واحد هو الجاذبية الاصطناعية.",
      "كما يتم فحص علاجات مختلفة لحصوات الكلى ، بما في ذلك تقنية جديدة تسمى تفتيت الحصوات بالموجات الانفجارية وتقنية جديدة بالموجات فوق الصوتية. يتم تضمين التجارب الشخصية والمخاوف المتعلقة بهذه العلاجات في المناقشة."
    ],
    "points": 231,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1698330722
  },
  {
    "id": 38031839,
    "title": "أضف الآن الفظ: الهندسة الفورية في DALL-E 3",
    "originLink": "https://simonwillison.net/2023/Oct/26/add-a-walrus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38031839",
    "commentBody": "",
    "originSummary": [
      "يستكشف المؤلف نموذج توليد الصور الخاص ب OpenAI ، DALL-E 3 ، ويقدم رؤى حول تشغيله من خلال ChatGPT.",
      "كما تتم مناقشة التقنيات المستخدمة في الهندسة الفورية لضمان الاتساق وتقليل التحيزات في الصور التي تم إنشاؤها.",
      "تعطي التجارب المشتركة فهما عميقا لتطبيق الهندسة السريعة في نموذج توليد الصور الخاص ب OpenAI."
    ],
    "commentSummary": [
      "يتحدث المقال عن أحدث ميزات DALL-E 3 من OpenAI ، مثل قدرته على توليد أحرف متسقة وزيادة التحكم في الصور باستخدام مطالبات من ChatGPT.",
      "هناك مخاوف بشأن خصوصية البيانات ، ويتم التعبير عن خيبة الأمل بشأن قيود الإنتاج. DALL-E 3 متاح لمشتركي ChatGPT Pro.",
      "تتضمن موضوعات المناقشة في التعليقات مشكلات مثل ملكية المخرجات وجودة GPT-3 ودمج DALL-E في ChatGPT ، إلى جانب تجارب المستخدم مع هذه النماذج."
    ],
    "points": 214,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1698355162
  },
  {
    "id": 38030050,
    "title": "الكود المصدري لمحرك وأدوات Dagor من Gaijin Games KFT",
    "originLink": "https://github.com/GaijinEntertainment/DagorEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030050",
    "commentBody": "",
    "originSummary": [
      "يناقش النص محرك Dagor ، وهو محرك ألعاب مفتوح المصدر أنشأته Gaijin Entertainment. يتم استضافته على مستودع مع آخر تحديث من مستودع dagor4 بتاريخ 22 أكتوبر 3033.",
      "يحتوي المستودع على ملفات وأدوات مختلفة لإدارة المحرك. لغات الترميز الأساسية المستخدمة هي C ++ و C.",
      "على GitHub ، اكتسب المحرك اعترافا كبيرا ، مع 205 نجوم و 18 شوكة وإصدارين ، مما يدل على شعبيته المتزايدة بين المطورين."
    ],
    "commentSummary": [
      "قامت Gaijin Games بفتح شفرة مصدر Dagor Engine ، المستخدمة في اللعبة ، War Thunder ، مما قد يمكن الشركات الروسية الأخرى من البناء على الكود دون الحاجة إلى اتفاقيات ترخيص.",
      "وقد يكون القرار أيضا استراتيجية للحد من الاعتماد على محركات الألعاب الغربية وتأمين التمويل الحكومي.",
      "أثارت هذه الخطوة جدلا حول مزايا وعيوب شفرة المصدر مفتوحة المصدر ، إلى جانب التكهنات حول متطلبات ترخيص ITAR ، والتي استلزمها تسرب المعلومات السرية من منتديات اللعبة."
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1698346062
  },
  {
    "id": 38027346,
    "title": "موافقة البرلمان الأوروبي على إزالة التحكم في الدردشة وحماية التشفير الآمن",
    "originLink": "https://www.patrick-breyer.de/en/historic-agreement-on-child-sexual-abuse-proposal-csar-european-parliament-wants-to-remove-chat-control-and-safeguard-secure-encryption/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38027346",
    "commentBody": "",
    "originSummary": [
      "شكل البرلمان الأوروبي اتفاقا تاريخيا بشأن اقتراح لمكافحة الاعتداء الجنسي على الأطفال، واستبدال التحكم العشوائي في الدردشة بالمراقبة المستهدفة للأفراد والجماعات المشتبه بها.",
      "يحافظ الاقتراح على استخدام التشفير الآمن ، بهدف حماية الشباب بشكل أكثر كفاءة وضمان الخصوصية الرقمية وأمن الاتصالات.",
      "ستؤكد لجنة الحريات المدنية هذا الاتفاق ، مما يؤدي إلى اعتماد ومفاوضات أوسع."
    ],
    "commentSummary": [
      "وافق برلمان الاتحاد الأوروبي على إلغاء التحكم في الدردشة غير الخاضع للرقابة وحماية التشفير الآمن ، مما يسمح بالمراقبة المستهدفة لحالات الاعتداء الجنسي على الأطفال ولكن باستثناء برامج المراسلة المشفرة من طرف إلى طرف.",
      "يهدف هذا الاقتراح إلى توحيد التشريعات وحماية الشباب ، لكن المخاوف بشأن الضغط والتجاوزات المحتملة لا تزال قائمة.",
      "على الرغم من كونها خطوة ضد مشروع قانون مقترح يهدف إلى حظر التشفير من طرف إلى طرف ، إلا أن هذا الاتفاق ينتظر تأكيدا من لجنة الحريات المدنية بالبرلمان الأوروبي ويتطلب مراحل أخرى قبل التشريع ليصبح قانونا."
    ],
    "points": 213,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1698335728
  },
  {
    "id": 38030705,
    "title": "طائر مع نظام تحديد المواقع يطير إلى الإعصار",
    "originLink": "https://newatlas.com/biology/bird-typhoon-ride/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030705",
    "commentBody": "",
    "originSummary": [
      "نجا طائر بحري ذكر من رحلة غير عادية لمسافة 700 ميل فوق إعصار ، حيث وصل ارتفاعه إلى 15,420 قدما وسرعته 106 ميلا في الساعة تختلف اختلافا كبيرا عن أنماط طيرانه العادية.",
      "تم تتبع رحلة الطائر ، إلى جانب رحلات 13 طائرا بحريا آخر ، باستخدام أجهزة التسجيل الحيوي لنظام تحديد المواقع العالمي (GPS) المرفقة من قبل العلماء ، مما يسلط الضوء على الآثار المحتملة لتغير المناخ والطقس القاسي على مجموعات الطيور البحرية.",
      "ومن الضروري إجراء المزيد من البحوث لفهم كيفية تكيف الطيور البحرية مع هذه التغيرات المناخية. ونشرت نتائج هذه الدراسة في مجلة علم البيئة."
    ],
    "commentSummary": [
      "نجح طائر مزود بنظام تحديد المواقع العالمي (GPS) في السفر عبر إعصار عائدا إلى أرض تكاثره ، مما يعرض القدرات الملاحية للطيور وإمكانات تقنية GPS في الأبحاث الحيوانية.",
      "تتعمق المحادثة في موضوعات تشمل ملاحة الطيور عبر المجالات المغناطيسية ، وفسيولوجيا الطيور ، وتكوينات السحب ، والسلوك في العواصف ، والآثار المترتبة على تقنيات النقل المستقبلية المستوحاة من طيران الطيور.",
      "كما تتطرق المناقشات إلى استخدام الأعاصير للتخلص من القمامة، ومعدلات بقاء الطيور على قيد الحياة في الأعاصير، وآثار تغير المناخ على مجموعات الطيور البحرية، والخلاف حول ما إذا كان تغير المناخ يسبب الأعاصير بشكل مباشر أو يزيد من تواترها وشدتها."
    ],
    "points": 209,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1698349027
  },
  {
    "id": 38032242,
    "title": "محاولة فهم سبب انفجار أوتيس في طريقه إلى أكابولكو",
    "originLink": "https://theeyewall.com/trying-to-make-sense-of-why-otis-exploded-en-route-to-acapulco-this-week/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38032242",
    "commentBody": "",
    "originSummary": [
      "خضع إعصار أوتيس في المكسيك لتكثيف سريع غير متوقع ، يعزى إلى قص الرياح ودرجات حرارة سطح البحر الدافئة ، مما يوضح صعوبة التنبؤ بدقة بسلوك الإعصار.",
      "تحول إعصار تامي إلى عاصفة خارج مدارية ، مع فيضانات متوقعة في السهول الجنوبية واستمرار تساقط الثلوج في جميع أنحاء شمال الولايات المتحدة.",
      "هناك تكهنات مستمرة حول وجود علاقة بين الكسوف الأخير وشدة الظواهر الجوية."
    ],
    "commentSummary": [
      "ينتقد المقال القيود المفروضة على نماذج التنبؤ بالطقس الحالية ويؤكد على الحاجة إلى تحسين استيعاب البيانات للتنبؤ بدقة بالأحداث المناخية.",
      "يسلط الضوء على فشل النماذج في التنبؤ بشكل صحيح بقوة إعصار أوتيس ، مما يجسد التحديات التي يفرضها تغير المناخ في التنبؤ بظواهر الطقس بدقة.",
      "يتناول المقال أيضا المخاوف المتعلقة بالوصول إلى المعلومات الرقمية وعرقلة صناعة الوقود الأحفوري في معالجة تغير المناخ بشكل فعال."
    ],
    "points": 186,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1698357502
  }
]
