[
  {
    "id": 38023891,
    "title": "Bulut Bilgisayar",
    "originLink": "https://oxide.computer/blog/the-cloud-computer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38023891",
    "commentBody": "",
    "originSummary": [
      "Oxide, dünyanın ilk ticari bulut bilgisayarı olduğunu iddia ettiği ürününün genel kullanıma sunulduğunu ve 44 milyon dolarlık Seri A finansmanını duyurdu.",
      "Şirketin vizyonu, mevcut kiralama modeli yerine satın alınabilir bir bulut bilgisayarı içeriyor ve yazılım ile donanımın birlikte tasarlandığı raf düzeyinde bir paradigmayı savunuyor.",
      "Oxide'ın bulut bilgisayarı gecikme ve gürültüyü azaltmayı, gereksiz kabloları ortadan kaldırmayı ve ayrı lisanslama olmadan entegre, açık kaynaklı bir çözüm sunmayı amaçlıyor."
    ],
    "commentSummary": [
      "Oxide.computer, geleneksel bulut satıcıları ile bağımsız sunucu şirketleri arasında bir köprü olarak kendini konumlandıran, açık kaynaklı yazılımlarla birleştirilmiş sunucular satan bir firmadır. Gelecek ürünlerinde bir sonraki AMD çip serisini kullanmayı planlıyorlar.",
      "Önceki nesil sunucuların kullanımı ve Solaris'in düşüşüyle ilgili endişelere rağmen Oxide, AMD'den olumlu tepkiler aldı ve pazardaki yeterliliklerini göstererek potansiyel pazar yıkımıyla ilgili tartışmalara yol açtı.",
      "Tartışma ayrıca, açık kaynaklı ürün yazılımının avantajları ve donanım kiralamaya karşı donanım sahibi olmak hakkında sorulara da yol açtı. Sonuç olarak Oxide, pahalı bulut hizmetlerine alternatif olarak entegre bir donanım/yazılım ortamı sunmayı amaçlıyor."
    ],
    "points": 1519,
    "commentCount": 838,
    "retryCount": 0,
    "time": 1698317039
  },
  {
    "id": 38025767,
    "title": "Mobil öncelikli web tasarımının masaüstü üzerindeki olumsuz etkisi",
    "originLink": "https://www.nngroup.com/articles/content-dispersion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025767",
    "commentBody": "",
    "originSummary": [
      "Makale, mobil öncelikli web tasarımının masaüstü kullanılabilirliği ile ilgili dezavantajlarına, özellikle de mobil cihazlar için optimize edilmiş sayfaların daha büyük ekranlarda kötü görünmesine neden olan \"içerik dağılımına\" odaklanıyor.",
      "Kullanılabilirlik testlerinden elde edilen bulgular, içerik dağılımından kaynaklanan yüksek bilişsel yük, etkileşim maliyetleri ve kullanıcı hayal kırıklığını ortaya koymaktadır.",
      "Anlatı, artan mobil web trafiği karşısında mobil öncelikli tasarımın ve minimalist estetiğin önemini vurgulayarak bu sorunları hafifletmek için yönergeler öneriyor."
    ],
    "commentSummary": [
      "Tartışmada, mobil öncelikli tasarımın masaüstü kullanıcılarını etkileyen dezavantajları ve üstün, kapsayıcı bir çevrimiçi deneyimi amaçlayan \"hinternet\" fikri de dahil olmak üzere çeşitli web tasarımı konuları ele alınıyor.",
      "Kullanıcı tercihlerini ve ihtiyaçlarını, pazarın sınırlamalarını ve ön uç mühendislerinin karşılaştığı zorlukları ele alarak ön uç geliştirmenin zorlu görevine vurgu yapıyor.",
      "Gizlenmiş seçenekler ve işlevsellik gibi modern web tasarım eleştirileri ele alınmakta ve web tasarımında kullanıcı merkezli tasarım, kullanılabilirlik, erişilebilirlik ve akran değerlendirmelerinin önemi vurgulanmaktadır."
    ],
    "points": 708,
    "commentCount": 434,
    "retryCount": 0,
    "time": 1698329205
  },
  {
    "id": 38026736,
    "title": "I2P: Uçtan uca şifreli ve anonim internet",
    "originLink": "https://github.com/PurpleI2P/i2pd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38026736",
    "commentBody": "",
    "originSummary": [
      "GitHub deposu \"PurpleI2P/i2pd\", anonim ve güvenli bir şekilde şifrelenmiş iletişim sağlayan Görünmez İnternet Protokolü (I2P) istemcisinin C++ uygulamasına adanmıştır.",
      "Depo, i2pd istemcisini geliştirmek ve kullanmak için kod, dokümantasyon ve kaynaklar içerir.",
      "BSD 3-clause lisansı altında lisanslanan proje, katkıda bulunan bir topluluk tarafından aktif bakıma sahiptir."
    ],
    "commentSummary": [
      "Tartışma, kullanıcı anonimliğinin tek bir varlık tarafından kontrol edilmesini önlemek için tasarlanmış şifreli ve anonim bir internet projesi olan I2P'ye odaklanıyor. Buna rağmen, I2P önemli bir popülerlik görmedi ve genellikle daha cömertçe finanse edilen Tor projesi için göz ardı edildi.",
      "Kullanıcılar, İSS'ler donanım ve eşleştirmeye daha fazla yatırım yapana kadar VPN'lerin gelişmiş bağlantı için gerekli olmaya devam edeceğini öne sürüyor. Ayrıca eşler arası bağlantıdan merkezi bir mimariye geçişi ve bunun olası dezavantajlarını da inceliyor.",
      "I2P'nin torrent kullanımındaki hızı ve faydası ile Tor ve VPN gibi alternatiflerin karşılaştırılması vurgulanmaktadır. Tartışmada ayrıca Freenet, PerfectDark ve Maidsafe gibi diğer merkezi olmayan sistemler bağlamında Java'nın potansiyel performansı ve platformlar arası yeteneklerinden de bahsedilmektedir."
    ],
    "points": 336,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1698333504
  },
  {
    "id": 38032288,
    "title": "Gölgelendiricilere interaktif giriş",
    "originLink": "https://www.mayerowitz.io/blog/a-journey-into-shaders",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38032288",
    "commentBody": "",
    "originSummary": [
      "Makale, yazarın gölgelendiricileri inceleme ve yaratma sürecini özetliyor, temel ilkeleri ve sundukları olanakları ele alıyor.",
      "İşaretli Uzaklık Fonksiyonlarını (SDF'ler) açıklar ve etkileşimi şekillendirmek ve birleştirmek için kodlama örnekleri içerir.",
      "Yazar, gölgelendiricileri denemeyi tavsiye ediyor ve daha derinlemesine anlayış ve araştırma için yönergeler sunuyor."
    ],
    "commentSummary": [
      "Yazar, gölgelendiriciler hakkında interaktif bir eğitim sunmakta ve okuyucular tarafından iyi karşılanan pratik örneklerle erişilebilir hale getirmektedir.",
      "Yazar ayrıca üretici sanat alanındaki diğer kaynakları ve sanatçıları da tavsiye ederek dürüst blog yazmaya olan bağlılığını gösteriyor.",
      "Bazı okuyucular, 3B olmayan grafikler için gölgelendiricilerin sınırlamalarına dikkat çekerek, eğitimle ilgili tartışmaya farklı bir bakış açısı katıyor."
    ],
    "points": 292,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1698357787
  },
  {
    "id": 38024665,
    "title": "Soğuk savaş uydu görüntüleri bilinmeyen Roma kalelerini ortaya çıkardı",
    "originLink": "https://www.theguardian.com/science/2023/oct/26/cold-war-satellite-images-hundreds-unknown-roman-forts",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38024665",
    "commentBody": "",
    "originSummary": [
      "Arkeologlar, Soğuk Savaş döneminden kalma gizliliği kaldırılmış casus uydu görüntüleri aracılığıyla Suriye ve Irak'ta daha önce bilinmeyen 396 Roma kalesi tespit etti.",
      "Önceleri savunma hattının bir parçası olduğuna inanılan bu kalelerin, artık sınır ötesi ticareti ve iletişimi desteklediği ve katı ve dışlayıcı Roma sınırları fikrine meydan okuduğu düşünülmektedir.",
      "Araştırmacılar, arkeolojik eserlerin kaybolmadan önce belgelenmesinde uydu görüntülerinin değerinin altını çiziyor ve daha fazla görüntü erişilebilir hale geldikçe yeni keşifler yapılmasını bekliyor."
    ],
    "commentSummary": [
      "Soğuk Savaş döneminden kalma uydu görüntüleri, bazıları çoktan yıkılmış olan bilinmeyen Roma kalelerini ortaya çıkararak önemli bir tarihi bağlam ve önem kazandırdı.",
      "Tartışmada, arkeolojik araştırmalar için tarihi uydu görüntülerinin kullanımı, tarihi eserlerin korunmasındaki zorluklar ve yapay zeka ve veri madenciliğinden yararlanma potansiyeli vurgulanmaktadır.",
      "Ayrıca, kamera teknolojisi, Roma İmparatorluğu, Doğu Akdeniz'in istikrarsızlığı ve köleliğin tarihi gibi konular da incelenmektedir."
    ],
    "points": 276,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1698323518
  },
  {
    "id": 38025998,
    "title": "Özel sert ağaçlar yasa dışı olarak hasat edilmiş olabilir",
    "originLink": "https://www.chalmers.se/en/current/news/75-percent-of-exclusive-hardwood-may-be-illegally-harvested,c3863187/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025998",
    "commentBody": "",
    "originSummary": [
      "Chalmers Teknoloji Üniversitesi tarafından yapılan bir araştırma, güvertelerde kullanılan ve rağbet gören tropikal bir ahşap olan ipê'nin %75'inden fazlasının Brezilya'nın önemli üretim bölgesinden yasadışı olarak toplanmış olabileceğini ortaya koyuyor.",
      "Çalışma, piyasadaki ipê'nin %16'sının uygun izinler olmadan kesildiğini ve dolaşımdaki odun miktarının resmi üretim istatistiklerini aştığını ortaya çıkardı.",
      "Araştırma, tüketicilerin ahşabın menşeini sorgulayarak ve satın almadan önce belge isteyerek sürdürülebilir kereste tedarikinin sağlanmasında oynadıkları önemli rolü vurgulamaktadır."
    ],
    "commentSummary": [
      "Diyalog, inşaat ve yer döşemelerinde alternatif malzemelerin aksine ahşap kullanımını inceliyor ve yasadışı ağaç kesiminin çevresel sonuçlarını değerlendiriyor.",
      "Tartışmacılar ayrıca blockchain teknolojisinin ahşap menşeini takip etme potansiyelini, izinsiz ahşap hasadı ve ormansızlaşma sorunlarını ve çeşitli döşeme türlerine ilişkin avantaj ve dezavantajları da değerlendiriyor.",
      "Yasadışı ahşap talebini azaltmak için CITES (Nesli Tehlike Altında Olan Yabani Hayvan ve Bitki Türlerinin Uluslararası Ticaretine İlişkin Sözleşme) gibi düzenleyici yaptırımlar önerilmekte, ağaç dikimi ve menşe belgelerinin oluşturulması gibi çözümler öne sürülmektedir."
    ],
    "points": 275,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1698330234
  },
  {
    "id": 38025177,
    "title": "ABD GSYİH'si üçüncü çeyrekte yıllık %4,9 ile beklenenden daha hızlı büyüdü",
    "originLink": "https://www.cnbc.com/2023/10/26/us-gdp-grew-at-a-4point9percent-annual-pace-in-the-third-quarter-better-than-expected.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38025177",
    "commentBody": "",
    "originSummary": [
      "ABD ekonomisi, güçlü tüketici harcamaları, artan stoklar, ihracat, konut yatırımları ve hükümet harcamaları gibi birçok faktörün etkisiyle üçüncü çeyrekte %4,9 ile beklentilerin üzerinde bir büyüme kaydetmiştir.",
      "Ekonomistler önümüzdeki aylarda büyümenin yavaşlayacağını tahmin ediyor.",
      "Güçlü ekonomik rapor, Federal Rezerv'in yüksek faiz oranlarını sürdürmesi için zemin sağlayabilir, ancak önümüzdeki merkez bankası toplantısında oranlarda bir artış beklentisi tüccarlar arasında düşük."
    ],
    "commentSummary": [
      "Tartışma, ABD GSYİH büyümesi, ABD'de yaşamanın avantajları, ABD ve Avrupa arasındaki sağlık sistemleri karşılaştırması ve göç politikaları gibi geniş bir yelpazedeki konuları kapsamaktadır.",
      "Amerikan toplumu, ABD ekonomisi ve politikaların bireyler ve göçmenler üzerindeki etkisine ilişkin farklı bakış açıları bu söyleşide vurgulanmaktadır.",
      "Ayrıca, ABD ile diğer gelişmiş ülkeler arasında sosyal güvenlik ağları, iş fırsatları ve ekonomik ilerleme açısından yapılan karşılaştırmalara da değinilmektedir."
    ],
    "points": 271,
    "commentCount": 665,
    "retryCount": 0,
    "time": 1698326583
  },
  {
    "id": 38030932,
    "title": "Takkyu-bin: Japonya'da bagaj taşımacılığı",
    "originLink": "https://craigmod.com/ridgeline/170/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030932",
    "commentBody": "",
    "originSummary": [
      "Makale, Japonya'da seyahat edenler için kullanışlı bir seyahat ipucu sunarak, otellerde ve marketlerde bulunan bir bagaj taşıma hizmeti olan \"takkyu-bin \"i tanıtıyor.",
      "Takkyu-bin hizmeti, ağır bagaj taşıma yükünü hafifletmek gibi sayısız avantaj sunar ve bagajınızın sonraki varış noktanıza ulaşmasını sağlar.",
      "Söz konusu hizmete ek olarak, makalede yazarın yakında çıkacak kitabından da kısaca bahsediliyor ve alınan destek için teşekkür ediliyor."
    ],
    "commentSummary": [
      "Yazar, Japonya'da \"takkyu-bin\" olarak bilinen bir bagaj taşıma hizmetinden yararlanırken başından geçen kişisel bir olayı anlatıyor.",
      "Yorumlar bölümündeki ana tartışma, bu tür hizmetlerin artıları ve eksileri etrafında dönmekte, kolaylıklarına ve teslimat programlarına değinmektedir.",
      "Diğer tartışma konuları arasında dil öğrenimi, seyahat tavsiyeleri ve özellikle Japonya ve diğer ülkeler bağlamında pasaport taşımanın önemi yer almaktadır."
    ],
    "points": 238,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1698350179
  },
  {
    "id": 38029479,
    "title": "Cities Skylines 2, Nvidia RTX4090 üzerinde 20 fps ile çalışıyor",
    "originLink": "https://www.dsogaming.com/pc-performance-analyses/cities-skylines-2-runs-with-20fps-on-an-nvidia-rtx4090-at-4k-high-even-on-an-empty-map/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38029479",
    "commentBody": "",
    "originSummary": [
      "Paradox Interactive, NVIDIA GeForce RTX 4090 gibi üst düzey ekran kartlarıyla bile PC'de şu anda düşük performans gösteren bir şehir kurma oyunu olan Cities Skylines 2'yi piyasaya sürdü.",
      "Ray Tracing veya Path Tracing gibi gelişmiş görsel efektler kullanmamasına rağmen, oyun 4K/Yüksek ayarlarda yaklaşık 20 fps'de çalışarak kare hızlarında zorlanıyor.",
      "Oyunun geliştiricisi Colossal Order, performans optimizasyonları üzerinde çalışıyor olsa da, Alan Derinliği Kalite ayarını düşürmek gibi mevcut geçici çözümler yalnızca küçük iyileştirmeler sunuyor."
    ],
    "commentSummary": [
      "Ana tartışma, Cities Skylines 2 video oyunundaki performans ve optimizasyon sorunları etrafında dönüyor ve kullanıcılar düşük kare hızları ve zayıf optimizasyon nedeniyle hayal kırıklıklarını dile getiriyor.",
      "Kullanıcılar donanım özellikleri, grafik ayarları ve Unity oyun motorunun performans etkisi hakkında tartışıyor, simülasyon hızının önemine ve oyuncuların beklentilerine değiniyor.",
      "Kullanıcılar arasında farklı bakış açıları var; bazıları oyunun performansını savunurken, diğerleri oyunun görselleriyle ilgili hayal kırıklığı nedeniyle geliştiricileri eleştiriyor. Potansiyel iyileştirmeler veya düzeltmeler için fikirler de tartışılıyor."
    ],
    "points": 238,
    "commentCount": 361,
    "retryCount": 0,
    "time": 1698343725
  },
  {
    "id": 38026119,
    "title": "Böbrek taşı prosedürü \"oyunun kurallarını değiştirme potansiyeline sahip\"",
    "originLink": "https://komonews.com/news/local/uw-medicine-kidney-stone-breakthrough-procedure-treatment-nasa-mars-astronaut-research-patients-game-changer-seattle-clinical-trial-harborview-medical-center",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38026119",
    "commentBody": "",
    "originSummary": [
      "UW Medicine, böbrek taşlarının tedavisinde anestezi ihtiyacını ortadan kaldıran ve patlama dalgası litotripsisi olarak bilinen devrim niteliğinde bir sürece öncülük ediyor.",
      "Prosedür, böbrek taşlarını parçalamak için bir ultrason çubuğu ve ses dalgaları kullanarak 10 dakikadan daha kısa bir sürede rahatlama sağlıyor. Önümüzdeki yıl içinde ofis ortamında hastalar için erişilebilir olabilir.",
      "Bu yenilik, böbrek taşı geliştirme olasılığı daha yüksek olan Mars'a seyahat eden astronotlar için faydalı olabilir."
    ],
    "commentSummary": [
      "Ağırlıksızlık koşulları ve kemik demineralizasyonu ile daha da kötüleşen böbrek taşları, özellikle Mars görevleri için astronotlar için önemli bir risk teşkil etmektedir.",
      "NASA bu sorunu hafifletmenin yollarını araştırıyor, olasılıklardan biri de yapay yerçekimi.",
      "Burst wave lithotripsy adı verilen yeni bir teknoloji ve yeni bir ultrason tekniği de dahil olmak üzere böbrek taşları için farklı tedaviler de incelenmektedir. Bu tedavilerle ilgili kişisel deneyimler ve endişeler de tartışmaya dahil edilmektedir."
    ],
    "points": 231,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1698330722
  },
  {
    "id": 38031839,
    "title": "Şimdi bir mors ekleyin: DALL-E 3'te hızlı mühendislik",
    "originLink": "https://simonwillison.net/2023/Oct/26/add-a-walrus/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38031839",
    "commentBody": "",
    "originSummary": [
      "Yazar, OpenAI'nin görüntü oluşturma modeli DALL-E 3'ü inceliyor ve ChatGPT aracılığıyla işleyişine dair içgörüler sunuyor.",
      "Oluşturulan görüntülerde tutarlılığı sağlamak ve önyargıları en aza indirmek için istem mühendisliğinde kullanılan teknikler de tartışılmaktadır.",
      "Paylaşılan deneyimler, OpenAI'nin görüntü oluşturma modelindeki hızlı mühendislik uygulamasının derinlemesine anlaşılmasını sağlıyor."
    ],
    "commentSummary": [
      "Makale, OpenAI'nin DALL-E 3'ünün tutarlı karakterler üretme yeteneği ve ChatGPT'den gelen istemleri kullanarak görüntüler üzerinde daha fazla kontrol gibi en son özelliklerinden bahsediyor.",
      "Veri gizliliği konusunda endişeler var ve çıktı sınırlamaları konusunda hayal kırıklığı dile getiriliyor. DALL-E 3, ChatGPT Pro aboneleri tarafından kullanılabilir.",
      "Yorumlardaki tartışma konuları arasında çıktı sahipliği, GPT-3'ün kalitesi ve DALL-E'nin ChatGPT'ye entegrasyonu gibi konuların yanı sıra bu modellerle ilgili kullanıcı deneyimleri de yer alıyor."
    ],
    "points": 214,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1698355162
  },
  {
    "id": 38030050,
    "title": "Gaijin Games KFT'den Dagor Motoru ve Araçları kaynak kodu",
    "originLink": "https://github.com/GaijinEntertainment/DagorEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030050",
    "commentBody": "",
    "originSummary": [
      "Metin, Gaijin Entertainment tarafından oluşturulan açık kaynaklı bir oyun motoru olan Dagor Motorunu tartışmaktadır. En son güncellemesi 22 Ekim 3033 tarihli dagor4 deposunda bulunan bir depoda barındırılmaktadır.",
      "Depo, motoru yönetmek için farklı dosyalar ve araçlar içerir. Kullanılan birincil kodlama dilleri C++ ve C'dir.",
      "GitHub'da motor 205 yıldız, 18 çatal ve iki sürümle önemli ölçüde tanındı ve geliştiriciler arasında artan popülaritesini gösterdi."
    ],
    "commentSummary": [
      "Gaijin Games, War Thunder oyununda kullanılan Dagor Engine'in kaynak kodunu açık kaynaklı hale getirerek, diğer Rus şirketlerinin lisans anlaşmalarına ihtiyaç duymadan kodu geliştirmelerine olanak sağladı.",
      "Bu karar aynı zamanda Batılı oyun motorlarına bağımlılığı azaltma ve hükümet fonlarını güvence altına alma stratejisi de olabilir.",
      "Bu hamle, oyunun forumlarından sızan gizli bilgilerin gerektirdiği ITAR lisansı gerekliliğiyle ilgili spekülasyonların yanı sıra, kaynak kodunun açık kaynak kullanımının yararları ve sakıncaları üzerine tartışmalara yol açtı."
    ],
    "points": 214,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1698346062
  },
  {
    "id": 38027346,
    "title": "AB parlamentosu sohbet kontrolünü kaldırmak ve güvenli şifrelemeyi korumak için anlaştı",
    "originLink": "https://www.patrick-breyer.de/en/historic-agreement-on-child-sexual-abuse-proposal-csar-european-parliament-wants-to-remove-chat-control-and-safeguard-secure-encryption/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38027346",
    "commentBody": "",
    "originSummary": [
      "Avrupa Parlamentosu, çocuklara yönelik cinsel istismarla mücadele için, gelişigüzel sohbet kontrolünün yerine şüpheli kişi ve grupların hedefli gözetimini öngören bir teklif üzerinde tarihi bir anlaşma sağladı.",
      "Teklif, gençleri daha etkin bir şekilde korumayı ve dijital gizlilik ve iletişim güvenliğini sağlamayı amaçlayan güvenli şifreleme kullanımını koruyor.",
      "Sivil Özgürlükler Komitesi bu anlaşmayı onaylayacak, daha geniş çaplı kabul ve müzakereleri takip edecektir."
    ],
    "commentSummary": [
      "AB Parlamentosu, kontrolsüz sohbet kontrolünü ortadan kaldırmayı ve güvenli şifrelemeyi korumayı, çocuklara yönelik cinsel istismar vakaları için hedefli gözetime izin vermeyi ancak uçtan uca şifrelenmiş mesajlaşma programlarını muaf tutmayı kabul etti.",
      "Bu teklif, mevzuatı birleştirmeyi ve genç bireyleri korumayı hedeflese de lobicilik ve potansiyel bypasslara ilişkin endişeler devam etmektedir.",
      "Uçtan uca şifrelemenin yasaklanmasını amaçlayan yasa tasarısına karşı bir adım olmasına rağmen, bu anlaşma Avrupa Parlamentosu'nun sivil özgürlükler komitesinin onayını beklemektedir ve yasalaşmadan önce daha ileri aşamaların geçilmesi gerekmektedir."
    ],
    "points": 213,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1698335728
  },
  {
    "id": 38030705,
    "title": "GPS'li kuş tayfunun içine uçtu",
    "originLink": "https://newatlas.com/biology/bird-typhoon-ride/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38030705",
    "commentBody": "",
    "originSummary": [
      "Bir erkek deniz kuşu, bir tayfunun üzerinde 700 millik alışılmadık bir uçuş gerçekleştirerek 15.420 ft yüksekliğe ve 106 mil/saat hıza ulaşarak normal uçuş düzenlerinden önemli ölçüde farklı bir şekilde hayatta kaldı.",
      "Kuşun yolculuğu, diğer 13 deniz kuşunun yolculuklarıyla birlikte, bilim insanları tarafından takılan GPS biyo-kaydediciler kullanılarak izlendi ve iklim değişikliği ile aşırı hava koşullarının deniz kuşu popülasyonları üzerindeki potansiyel etkileri vurgulandı.",
      "Pelajik kuşların bu iklim değişikliklerine nasıl uyum sağladığını anlamak için daha fazla araştırma yapılması gerekiyor. Bu çalışmanın bulguları Ecology dergisinde yayımlanmıştır."
    ],
    "commentSummary": [
      "GPS takılı bir kuş, bir tayfunun içinden geçerek üreme alanına başarıyla geri döndü ve kuşların yön bulma yeteneklerini ve hayvan araştırmalarında GPS teknolojisinin potansiyelini gözler önüne serdi.",
      "Sohbet, kuşların manyetik alanlar aracılığıyla yön bulması, kuş fizyolojisi, bulut oluşumları, fırtınalardaki davranışları ve kuş uçuşundan esinlenen gelecekteki ulaşım teknikleri için çıkarımlar gibi konuları ele alıyor.",
      "Tartışmalarda ayrıca siklonların çöplerin bertarafı için kullanımı, tayfunlarda kuşların hayatta kalma oranları, iklim değişikliğinin deniz kuşu popülasyonları üzerindeki etkileri ve iklim değişikliğinin doğrudan kasırgalara mı neden olduğu yoksa sadece sıklık ve şiddetlerini mi artırdığı konusundaki tartışmalara da değiniliyor."
    ],
    "points": 209,
    "commentCount": 94,
    "retryCount": 0,
    "time": 1698349027
  },
  {
    "id": 38032242,
    "title": "Otis'in Acapulco'ya giderken neden patladığını anlamaya çalışıyorum",
    "originLink": "https://theeyewall.com/trying-to-make-sense-of-why-otis-exploded-en-route-to-acapulco-this-week/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38032242",
    "commentBody": "",
    "originSummary": [
      "Meksika'da meydana gelen Otis Kasırgası, rüzgar kesmesi ve sıcak deniz yüzeyi sıcaklıklarına atfedilen beklenmedik hızlı bir yoğunlaşma geçirerek kasırga davranışını doğru bir şekilde tahmin etmenin zorluğunu göstermiştir.",
      "Tammy Kasırgası ekstratropikal bir fırtınaya dönüşmüş olup, güney ovalarında sel baskınları ve kuzey ABD'de kar yağışının devam etmesi beklenmektedir.",
      "Son tutulmalar ile hava olaylarının şiddeti arasında bir ilişki olduğuna dair spekülasyonlar devam etmektedir."
    ],
    "commentSummary": [
      "Makale, mevcut hava tahmin modellerinin sınırlılıklarını eleştirmekte ve iklim olaylarını doğru bir şekilde tahmin etmek için gelişmiş veri asimilasyonuna duyulan ihtiyacı vurgulamaktadır.",
      "Modellerin Otis Kasırgası'nın gücünü doğru bir şekilde tahmin edememesi, iklim değişikliğinin hava olaylarını doğru bir şekilde tahmin etmede yarattığı zorluklara örnek teşkil etmektedir.",
      "Makalede ayrıca dijital bilgiye erişim ve fosil yakıt endüstrisinin iklim değişikliğiyle etkin bir şekilde mücadele edilmesini engellemesiyle ilgili endişelere de değiniliyor."
    ],
    "points": 186,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1698357502
  }
]
