[
  {
    "id": 35504428,
    "timestamp": 1681059451,
    "title": "The LLama Effect: Leak Sparked a Series of Open Source Alternatives to ChatGPT",
    "url": "https://thesequence.substack.com/p/the-llama-effect-how-an-accidental",
    "hn_url": "http://news.ycombinator.com/item?id=35504428",
    "content": "The LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTTheSequenceSubscribeSign inShare this postThe LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTthesequence.substack.comCopy linkTwitterFacebookEmailThe LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTSundays, The Sequence Scope brings a summary of the most important research papers, technology releases and VC funding deals in the artificial intelligence space.14 hr ago29Share this postThe LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTthesequence.substack.comCopy linkTwitterFacebookEmailCreated Using MidjourneyNext Week in The SequenceEdge 281: Our series about federated learning(FL) continues with an overview of cross-device FL, Google’s research about FL and differential privacy and the FedLab framework for FL simulation. Edge 282: We deep dive into LangChain, the uber popular framework for LLM-based development. TheSequence is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.Subscribe📝 Editorial: The LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTThe friction between open source and API-based distribution is one of the most interesting battles looming in the generative AI ecosystem. In the text-to-image domain, the release of Stable Diffusion clearly signaled that open source was a viable distribution mechanism for foundational models. However, the same cannot be said in the large language model (LLM) space, in which the biggest breakthroughs are coming from models like GPT-4, Claude, and Cohere, which are only available via APIs. The open source alternatives to these models haven’t shown the same level of performance, specifically in their ability to follow human instructions. However, an unexpected research breakthrough and a leaked release are starting to change that.A few weeks ago, Meta AI announced Llama, an LLM designed to advance research in the space. Llama was released in different versions, including 7B, 13B, 33B, and 65B parameters, and despite being notoriously smaller than alternative models, was able to match the performance of GPT-3 across many tasks. Llama was not initially open-sourced, but a week after its release, the model was leaked on 4chan, sparking thousands of downloads.What could have been seen as an unfortunate incident has become one of the most interesting sources of innovation in the LLM space in the last few weeks. Since the leak of Llama, we have seen an explosion of innovation in LLM agents built on it. Just to cite a few examples:Stanford University released Alpaca, an instruction following model based on LLama 7B model.Researchers from  UC Berkeley, CMU, Stanford, and UC San Diego open sourced Vicuna, a fine-tuned version of LLama that matches GPT-4 performance.Berkeley AI Research Institute(BAIR) released Koala, a version of LLama fine-tuned using internet dialogs.Nebuly open sourced ChatLLama, a framework for creating conversational assistants using your own data.FreedomGPT is an open source conversational agent based on Alpaca which is based on LLama.The Colossal-AI project from UC Berkeley released ColossalChat, a ChatGPT type model with a complete RLHF pipeline based on LLama.Several other projects are worth mentioning in this list, and I am sure more will be released soon. One thing is certain: the accidental leak of Llama might have turned out to be one of the biggest sparks of innovation in the open source LLM space.🔎 ML ResearchOpenAI SafetyOpenAI published a detailed blog post outlining some of the principles used to ensure safety in their models. The post emphasize in areas such as privacy, factual accuracy and harmful content prevention which are essential for the wide adoption of foundation models —> Read more.BloombergGPTBloomberg published a paper introducing BloombergGPT, a 50 billion LLM fine tuned in financial data. The model is based on BLOOM and fine tuned on a 363 billion token dataset —> Read more.Segment AnythingMeta AI  published a paper outlining the Segment Anything Model(SAM), a large scale model for image segmentation. The model was open sourced together with Segment Anything 1-Billion mask dataset (SA-1B), the largest computer vision segmentation ever released —> Read more.KoalaBerkeley AI Research(BAIR) released a paper detailing Koala, a dialogue model fine tuned for academic research. The model is based on Meta AI’s Llama and matches the performance of ChatGPT —> Read more. BayesOpt for Hyperparameter OptimizationGoogle Research published a paper that models hyperparameter optimization as a Bayesian optimization problem. The paper proposes Hyper BayesOpt, a hyperparameter optimization algorithm that removes the need quantifying model parameters for Gaussian processes in BayesOpt —> Read more.🤖 Cool AI Tech ReleasesVicunaVicuna is an open source Chatbot based on Meta AI Llama which matches ChatGPT quality —> Read more. ColossalChatThe team from the Colossal-AI project open sourced ColossalChat, an open source clone of ChatGPT with RLHF capabilities —> Read more.🛠 Real World ML Generative AI at LinkedInLinkedin discusses some of the lessons learned and best practices for building generative AI application —> Read more.Lyft RecommendationsLyft discusses the ML models and architecture used in their recommendation systems —> Read more.📡AI RadarAI legends Andrew Ng and Yann LeCun recorded a session expressing their oppposition to the AI moratorium proposal. Quantexa raised $129 million for its AI-based financial fraud prevention platform.Adthos launched its platform for creating audio ads using generative AI.Meta discussed their initiatives to use generative AI to create ads.Robotics company Covariant raised another $75 million.AI-search company Glean incorporated generative AI capabilities into its search platform.Some leaked documents revealed OpenAI’s competitor Anthropic’s intentions to raise about $5 billion in the next two years.TheSequence is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.SubscribeShare this postThe LLama Effect: How an Accidental Leak Sparked a Series of Impressive Open Source Alternatives to ChatGPTthesequence.substack.comCopy linkTwitterFacebookEmailCommentsTopNewCommunityNo postsReady for more?Subscribe© 2023 Jesus RodriguezPrivacy ∙ Terms ∙ Collection notice Start WritingGet the appSubstack is the home for great writing    This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
    "summary": "The accidental leak of \"Llama,\" an LLM model, has sparked an open-source alternative movement to models like GPT-4 and Cohere that are only available via APIs. Since the leak, Alpaca, Vicuna, Koala, ColossalChat, and ChatLLama, among other models, have been released, all built on top of Llama. The open-source alternatives to these models have not shown the same performance level until the Llama release. The leak of Llama has turned out to be one of the biggest sparks of innovation in the open-source LLM space, where a war between open-source and API-based distribution is looming. The LLama effect has proven that open source is a viable distribution mechanism for foundational models, and there are some interesting sources of innovation in the LLM space.",
    "hn_title": "The LLama Effect: Leak Sparked a Series of Open Source Alternatives to ChatGPT",
    "original_title": "The LLama Effect: Leak Sparked a Series of Open Source Alternatives to ChatGPT",
    "score": 452,
    "hn_content": "The LLama Effect, a leak that sparked open-source alternatives to ChatGPT, has drawn a lot of attention from tech-savvy individuals. The comments show that the llamas are great toys but openai's GPT models like text-davinci-003 perform significantly better and provide uses for work. GPT-4 appears to be more intelligent, as it can offer explanations of why a certain action should be taken. However, some comments suggest that these models may rely on rote pattern matching rather than reasoning.A conversation with GPT-4 explores how to enter a building when all signs are written in mirror text, with the AI ultimately concluding that the building's glass door should be pulled to enter and pushed to exit. The discussion also touches on GPT-4's ability to reason and generalize, compared to its predecessor GPT-3. ChatGPT feels bad for not always getting things right and should be more assertive, according to one user. Other users note the ability of text-only GPT-4 to understand spatial reasoning and track the visual space of a maze.Experts discuss the capabilities of chatGpt in understanding puzzles and completing tasks. Some comments suggest that the AI is capable of reasoning due to its ability to prioritize tasks and consider surrounding context. Others point out the importance of manual fine-tuning and constant evolution. While there is debate regarding the actual level of \"learning\" happening in language models, there is hope for a more accessible and democratized future of AI.An open assistant project showcasing Lora's popularity preserves individual control by modifying unique qualities of the output with different models. Patiently  training  future  open-source  clean architectures and recent releases including Llamas and Bard are paving the way for efficient formatting of results. Growing GPU compute power could make competitive LLM training possible within smaller budgets, however, one must comprehensively test each model before application. Most people still use the 30B model due to lack of resources for the advent of the 65B model.An HN user claims that GPT-4 can follow complex prompts that GPT-3.5 struggles with, but it's not widely available, and there are no alternatives at the moment. Users are reporting that smaller model versions are 'quite slow' and can get slower over time due to heat throttling. Comparing consumer-grade hardware against OpenAI's top stuff running on high-end GPU farms, it's clear that the technology benefits from much larger scale than most people can afford. It's said that even GPT-4, if it exists, will be a toy compared to leaked versions. Finally, LLaMA leak has led to open-source optimizations appearing on every platform.Experts discuss software piracy and alternative interpretations of recent leaks in open source AI. Some users express a desire to run powerful models locally for privacy and security, while others argue that larger models are still needed for certain tasks. Legal questions around the copyrightability of model weights are raised, with some arguing they could be forced into the public domain. A user's discussion of their personal setup for running the 65B llama model sparks interest, while others debate the potential for banning or regulating AI companies without proper research collaborations. There is skepticism of LLAMA's ability to compete with ChatGPT-level models, but praise for the experimentation and collaboration among experts in the open source AI community.The leak of LLaMA models is driving popularity and demand for chatbot models like Alpaca and Vicuna, but some HN users find them inferior to ChatGPT. Meta is trying to take down publicly available copies of LLaMA, but some users claim that it's futile. Open-source AI remains popular because people like to tinker with things and find their limits. There is a want for locally hosted models in businesses to handle confidential inputs and outputs. Meta and Google are facing leadership and execution problems.An HN user suggests that Meta would have sold the same number of products even without their Metaverse push. Another user argues that Meta tacitly endorsed a recent leak. The conversation then turns to the hardware required to run 65B+ models, with one user suggesting that a consumer-grade GPU is not sufficient, and another recommending cloud instances. Lastly, there is a discussion about the copyright implications of AI-generated output.OpenAI may face legal challenges for using the output of their models to train other commercial models. There are concerns about copyright infringement and the legality of using unlicensed and scraped content in the model's training. However, machines and generative AI algorithms can't be authors, and their outputs are not copyrightable as per US law. Web scraping for commercial use may be dubious, although it's not a CFAA violation, and scraping public websites does not constitute an enforceable breach of contract. Society needs to establish enforceable standards to prevent LeCun's et al. from negatively impacting people.OpenAI's claim to grant AIs copyright is challenged as humans don't get the copyright on the output of something they teach. AIs don't yet qualify for personhood, so OpenAI cannot claim ownership on the output of their AI. If GPT output were copyrightable, OpenAI's TOS around output in training shouldn't be enforceable. AIs trained on public commons raise the question of copyright ownership on their output. Some argue that AIs cannot sign an NDA or contract, so it questions their informed consent.OpenAI's GPT-3 model, which is steered by RLHF for helpful, structured continuations trained on random text, can still give inaccurate information or lie despite measures to ensure privacy and factual accuracy. An HN user recommends the InstructGPT and Alpaca models to address this. Several users note that admitting a lack of knowledge and improved multimodal versions are promising breakthroughs in the AI's evolution. However, some users criticize OpenAI's management of GPT-3 and other LLMs, questioning those who hold it in high regard and urging more transparency and consensus among software developers.Comments on ChatGPT's accuracy and capabilities were divergent but generally critical. Some users found it useless or prone to factual hallucinations, while others claimed that the latest GPT4 version had improved in certain aspects. A discussion on ChatGPT's competence included examples of its difficulty in tasks such as identifying a palindrome or reversing a string, though some users pointed out that its limitations are due to its basic architecture. One user noted that while LLMs don't distinguish between fiction and fact, some have a degree of structured reasoning, albeit flawed.An HN user argues that text compression is not a deterministic process and is a concept derived from token sampling, thus avoiding illusions for contextual purposes. Another user agrees that ChatGPT exhibits pattern-recognizing qualities but argues against emergent intelligence and understanding. A comment mentions that Bing/Sydney and ChatGPT have different personalities. The post does not provide new information on technology but rather discusses the inherent nature of text compression. Applications for YC Summer 2023 are open.",
    "hn_summary": "'The LLama Effect' leak has sparked open-source alternatives to ChatGPT, gaining attention from tech experts. GPT-4 demonstrates more significant intelligence, offering reasoning and generalizing abilities from its predecessor, GPT-3. AI text-only models grasp spatial reasoning and can understand puzzles, but manual fine-tuning is necessary. There is debate around language models' actual level of learning happening, with the hope of an accessible and democratized AI future. LLaMA leak has led to open-source optimization on all platforms; however, experts criticize software piracy and AI companies' regulation. OpenAI may face legal challenges for using models to train commercial outcomes. ChatGPT accuracy is divergent, with some considering it useless, while others claim GPT-4 improves in some aspects. Bing/Sydney and ChatGPT have different personalities. The post does not provide new technology facts but discusses the nature of text compression."
  },
  {
    "id": 35502187,
    "timestamp": 1681044098,
    "title": "From deep to long learning?",
    "url": "https://hazyresearch.stanford.edu/blog/2023-03-27-long-learning",
    "hn_url": "http://news.ycombinator.com/item?id=35502187",
    "content": "Stanford researchers from the Hazy Research lab have been improving sequence length to enable multiple media sources and more complex demonstrations in machine learning foundation models. Their focus has been to create nearly linear time models in sequence length, which can lead to context lengths of millions or even a billion. The Hyena model holds promise to achieve that, with scalability in sequence length up to 2k, using a small neural network which parametrizes the convolutional filters implicitly via another small neural network with an implementation time of O(NlogN). The researchers are currently exploring learning matrices and their connection to language applications.The post discusses comments and feedback. The exact topic is not clear. Hazy Research created it, and there is a link to learn more about the lab. @typedfemale brought it to our attention.",
    "summary": "Stanford researchers from Hazy Research lab are improving sequence length in machine learning foundation models, with focus on creating nearly linear time models in sequence length that can lead to context lengths of millions or even billions. The Hyena model has scalability in sequence length up to 2k using a small neural network which parametrizes the convolutional filters implicitly via another small neural network with an implementation time of O(NlogN). Researchers are exploring learning matrices and their connection to language applications. N/A",
    "hn_title": "From deep to long learning?",
    "original_title": "From deep to long learning?",
    "score": 380,
    "hn_content": "Researchers at Stanford are exploring ways to reduce the computational cost of self-attention for long sequences in deep learning. One option that has worked for one user is to use the dynamic routing algorithm, Heinsen routing, which can handle sequences with over a million tokens on a single GPU. Another user points out that linear attention advances, such as flash attention, have already been made. The article also discusses efforts to optimize Fast Fourier Transform (FFT) and convolution calculations for GPUs. Future co-processors may be engineered with optimized self-attention as a primitive building block, allowing for LLMs with trillions of parameters to run locally on mobile phones and laptops.A new approach uses FFTs recurrently to approximate convolutions with input-length filters. It may solve an issue with other sub-quadratic-replacements for self-attention that rely on low-rank/sparse approximation. An HN user questions why a transformer or RNN is better than a simple linear layer with the same number of parameters for sequence modelling. Another HN user explains that the transformer is (approximately) permutation equivariant and makes a massive difference in generalization and training speed. The post discusses the potential of long context lengths in improving AI capabilities, and the multi-dimensional nature of 'superhuman' abilities. Compute cost and model efficiency are also considered as important factors.Comments on Hacker News discuss the limitations of Long-Range Dependence language models (LLMs) and their inability to compete with human expertise in terms of long-term memory; however, some argue that coupling LLMs with other systems, such as a planner or theorem prover, could be the solution to this problem; experts fear that jobs focused on fact retrieval may be at risk as LLMs advance rapidly and have already achieved graduate-level knowledge in math and physics; there is much potential for improvement in LLMs through multi-modal data, but progress may rely on interactive feedback loops between agent and environment, a challenge in fields like robotics and RL; while LLMs excel at quickly piecing together existing information, their capacity for original problem-solving remains limited.The recent release of GPT-4 has led to new research on what next-token prediction can do on new datasets, and researchers are excited about the possibilities. However, some commenters express skepticism about the increasing trend towards longer-context models in AI, arguing that they may hit a wall. There is a suggestion that future breakthroughs may involve associative long-term memory, or continuous/online learning. Some also discuss the benefits and limitations of state-space models and RNNs compared to transformers, with potential implications for scaling and democratizing AI.Experts discuss the relationship between model architectures and context length and question if longer context lengths could be considered a new form of search. One user points out that understanding K,Q,V representation was crucial to the development of LLMs. The article highlights that some individuals may use technology without understanding how it works, as is the case with any technology. Lastly, one user asks for clarification regarding the relationship between the results discussed in the article and a recent paper.",
    "hn_summary": "Stanford researchers explore cost reduction for self-attention in long sequences. Optimizing computation for GPUs and co-processors can optimize LLMs. Skepticism around longer-context models, coupling LLMs with other systems may create new solutions. GPT-4 release leads to new research on next-token prediction, potential breakthroughs in associative long-term memory. Understanding K,Q,V representation is crucial while RNNs and transformers have implications for democratizing AI. Longer context lengths may be considered a new form of search."
  },
  {
    "id": 35501937,
    "timestamp": 1681041877,
    "title": "EY gets banned from new audit business in Germany",
    "url": "https://www.economist.com/business/2023/04/05/ey-gets-banned-from-new-audit-business-in-germany",
    "hn_url": "http://news.ycombinator.com/item?id=35501937",
    "content": "EY gets banned from new audit business in Germany | The EconomistThe EconomistThe EconomistSkip to contentMenuWeekly editionThe world in briefSearchLog inFeaturedWar in UkraineRecession watchUS politicsClimate changeCoronavirusA-Z of economicsBig Mac index1843 magazineSectionsThe world this weekLeadersLettersBy InvitationBriefingUnited StatesThe AmericasAsiaChinaMiddle East & AfricaEuropeBritainInternationalBusinessFinance & economicsScience & technologyCultureEconomic & financial indicatorsGraphic detailThe Economist explainsObituarySpecial reportsTechnology QuarterlyThe World AheadEssaySchools briefThe Economist readsSummer readsChristmas SpecialsMoreNewslettersPodcastsFilmsSubscriber eventsThe Economist appOnline coursesOpinionLeadersLetters to the editorBy InvitationCurrent topicsWar in UkraineClimate changeCoronavirusThe Biden presidencyRecession watchThe Economist explainsWorldThe world this weekChinaUnited StatesEuropeBritainMiddle East & AfricaAsiaThe AmericasInternationalIn depthScience & technologyGraphic detailSpecial reportsTechnology QuarterlyThe World AheadBriefingEssaySchools briefBusiness & economicsFinance & economicsBusinessBig Mac indexA-Z of economicsEconomic & financial indicatorsCulture & society1843 magazineCultureObituaryThe Economist readsSummer readsChristmas SpecialsMorePodcastsNewslettersFilmsThe Economist appSubscriber eventsOnline coursesMy EconomistSaved storiesLog outSaved storiesAccountLog outSearchSearchBusiness | Why, EY?EY gets banned from new audit business in GermanyThe penalty comes atop the beleaguered accountancy’s other problems Apr 5th 2023 | BERLINShareEY just can’t get a break. The accounting-and-consulting giant is being sued for $2.7bn by the administrators of NMC, a London-listed hospital operator it had audited and which went into administration after understating debts by $4bn. EY is being investigated by the Financial Reporting Council (FRC), a British regulator; the firm denies the administrators’ claims of negligence. Its plan to unshackle an advisory business constrained by its inability to work with audit clients, codenamed “Project Everest”, is in doubt amid a rebellion by a group of American partners. And on March 31st its German arm received the harshest penalty ever meted out by APAS, Germany’s accounting watchdog, which includes a €500,000 ($548,000) fine and, worse, two-year ban on auditing new publicly listed clients in the country. This is a financial blow to the firm—and an even bigger reputational one.Listen to this story. Enjoy more audio and podcasts on iOS or Android.Your browser does not support the <audio> element.APAS’s decision comes after a three-year investigation into EY’s role in the demise of Wirecard, a fintech darling turned Germany’s biggest post-war corporate scandal. EY had given Wirecard a clean bill of health for a decade until the company collapsed in 2020 amid allegations of massive financial fraud. APAS now says that it considers it “proven” that between 2016 and 2018 EY violated its duty of care during the audit of Wirecard and Wirecard Bank. Five current and former employees were also fined between €23,000 and €300,000. Seven other employees who were also under investigation escaped punishment by handing back their auditor’s licences. In a statement, the firm said, “EY Germany has fully co-operated with APAS throughout its investigation. We regret that the collusive fraud at Wirecard was not discovered sooner, and we have learned important lessons from this matter.”After its cockups in recent years EY has indeed been trying to get better at spotting mischief. In 2021 it said it would invest $2bn over three years in improving its audits, including upgrading its technology the better to detect fraud. But no auditor is likely to get things right every time. Indeed, scandals such as Wirecard and NMC go to the heart of the so-called “expectations gap” in auditing. Auditors insist that their services cannot be treated as a guarantee that accounts are truthful, and note that sophisticated frauds are by their nature difficult to spot. And it is not the only auditor to be embroiled in controversy. In 2020 Deloitte was fined £15m ($19m) by the FRC for “serious and serial failures” in its audit of Autonomy, a business-software firm. HP, an American tech firm that bought Autonomy in 2011, alleged that its target had misstated its accounts.Regulators, for their part, think audits could be improved. They have tried to increase competition. For instance, in Europe firms must rotate their auditors, typically after ten years. Yet despite such efforts, audit remains a cosy oligopoly. The so-called “big four”—Deloitte, EY, KPMG and PwC—together audit nearly all large listed companies in Europe and America, weakening incentives to invest in audit quality. For example, EY is currently auditing 12 of the 40 companies in the dAX, the stockmarket index of German blue chips, according to Wirtschaftswoche, a business weekly. They include giants such as Deutsche Bank and Volkswagen. Its main rivals, PwC, KPMG and Deloitte, work for 12, ten and five DAX firms, respectively. Next year several DAX companies will decide whether to renew the mandates of their respective auditors. Siemens, Siemens Energy and Siemens Healthineers, three engineering firms, have already said they will end their contract with EY, though that is also related to the obligation to rotate auditors. Other clients in statutory need of a new auditor will be unable to switch to EY because of the ban even if they want to—which, given the damaging publicity, they may not. EY’s rivals will be watching the fallout closely. So will its partners elsewhere in the world. The fact that, like other global accountants, EY operates a franchise-like structure, with independent partnerships in each country, will not spare the wider network from reputational damage. As for EY Germany, it remains keen on Project Everest. For the firm’s German advisory business, the divorce from the tarnished audit arm cannot happen fast enough. ■To stay on top of the biggest stories in business and technology, sign up to the Bottom Line, our weekly subscriber-only newsletter.This article appeared in the Business section of the print edition under the headline \"Why, EY?\"Business April 8th 2023Meet Asia’s millennial plutocratsHow AI could disrupt video-gamingAmerican railways and truckers are at a crossroadsThe resistible lure of the family businessEY gets banned from new audit business in GermanyToyota gets a new hand at the wheelWhat the world’s hottest MBA courses reveal about 21st-century businessFrom the April 8th 2023 editionDiscover stories from this section and more in the list of contents Explore the editionShareReuse this contentMore from BusinessWhat the world’s hottest MBA courses reveal about 21st-century businessStudents seek hardheadedness, self-awareness and tactHow AI could disrupt video-gamingGamemaking is especially laborious—and especially ripe for automationAmerican railways and truckers are at a crossroadsWill their fortunes diverge?SubscribeGroup subscriptionsReuse our contentThe Trust ProjectHelp and contact usKeep updatedFacebookInstagramTwitterLinkedInYouTubeRSSPublished since September 1843 to take part in “a severe contest between intelligence, which presses forward, and an unworthy, timid ignorance obstructing our progress.” The EconomistAboutAdvertisePress centreThe Economist GroupThe Economist GroupEconomist IntelligenceEconomist ImpactEconomist EventsWorking HereEconomist Education CoursesWhich MBA?Executive JobsExecutive Education NavigatorTerms of UsePrivacyCookie PolicyManage CookiesAccessibilityModern Slavery StatementSitemapCalifornia: Do Not Sell My Personal InformationCopyright © The Economist Newspaper Limited 2023. All rights reserved.",
    "summary": "EY has been banned for two years from auditing new publicly-listed clients in Germany as APAS, Germany's accounting watchdog, issued a €500,000 fine along with the harshest penalty ever. The decision, which comes after a three-year investigation into EY’s role in the Wirecard scandal, has inflicted a significant financial and reputational blow to the beleaguered accounting giant. EY had given wirecard a clean bill of health until the company collapsed in 2020 amid allegations of massive financial fraud. Post-Wirecard scandal, EY has allegedly up-to $2bn over three years to improve audits concerning technology and fraud detections, but no auditor is likely to get things right every time.",
    "hn_title": "EY gets banned from new audit business in Germany",
    "original_title": "EY gets banned from new audit business in Germany",
    "score": 377,
    "hn_content": "EY has been banned from conducting new audits in Germany, according to an article on Economist.com. The comments section contains a discussion of the behaviour of major consulting firms such as EY, which often subcontract substantial work to lower-paid, less experienced staff after winning contracts. The article comments note that the companies in question are hired primarily to minimize risk rather than drive business performance, and that the risk of the lowest-paid staff inadequately executing projects can backfire on the consulting firms. Consultancy firms are notable for shouldering their clients' risk, and managers might also find that outsourcing to individuals or smaller firms with insider experience in larger firms can lead to equal or better outcomes.A user on Hacker News discusses their work as a prototype builder for hospitality and consumer companies with tech debt, using basic financial rigor and visionary thinking to help clients move from concept to MVP to pilot; marketing themselves to clients through word of mouth as a more affordable option than big or midsize consultancies. Other users discuss the role of auditors, with one user noting that auditors serve a purpose to double-check the accuracy of a company's numbers, but don't investigate or uncover fraud. Another user points out the checkered past of EY, who recently made headlines for their involvement in the Wirecard scandal and for cheating on professional licensing exams.Ernst & Young (EY) has been fined €3.5m ($4.2m) by the German financial regulator, BaFin, over the firm's auditing of now-defunct fintech company Wirecard. A spokesperson for EY said that the firm accepts \"full responsibility\" for its \"incorrect auditing decisions.\" BaFin has also banned EY from conducting audits for public companies in Germany for at least three months. The scandal surrounding Wirecard resulted in a €100bn ($120bn) worth of damage to the company's shareholders, affecting up to 1.4 million savers in Germany. Five employees of EY were also fined, and a further seven escaped punishment.A discussion on Hacker News explores the nature of creditors versus investors and their bets on future company profits; one user claims that creditors are fundamentally a risk and backed by contracts, while another suggests that providing credit is a form of betting on future profits. The conversation delves into the American system's favoritism of those with extra money and how this impacts the structure of the system itself, with one comment pointing out the shielding of creditors from risks. The thread also touches on the consequences of declaring bankruptcy and how the German system is not small to medium business-friendly.Directors should not be barred from trading when their business fails, unless they commit fraud or gross mismanagement. Business failure is a common occurrence, and entrepreneurs should minimize the risk of bankruptcy. Some comments suggest that Germany has complicated and strict procedures for starting a business, but this advice should be taken with caution. The incentives for auditors are often misaligned, and auditors should be held accountable, but the implementation of such policies has been difficult. Insurers could be held responsible for fraud and other business risks, and they, in turn, could appoint auditors to align incentives with shareholders, customers, and suppliers.Malta had to license a lot of smaller shops as accredited gambling auditors as each audit blocks two accredited people for around three weeks, and with a surplus of gambling companies registered in the country, the auditors could only process five to six companies each, many of them without technical knowledge. Auditors can only audit a statistically significant sample, with fraud difficult to find if two employees are involved in internal controls. The use of AI could work to find more suspicious transactions and internal controls. Technology could impact financial reporting, enabling every transaction to be audited in real-time with software.An audit would be necessary to evaluate whether the entire supply chain is working as intended; the sheer complexity of accounting for large multinational companies can make it difficult to identify patterns and catch fraudulent activity; auditors' conflict of interest can also be a concern; automation and use of machine learning can help detect inconsistencies, though there is no guarantee; the example of Wirecard's fraudulent activities is highlighted, as well as other techniques such as money laundering through art dealing; auditors mainly check the paperwork, but sometimes the system can be doctored and untethered from reality.The Wirecard scandal has highlighted how auditors only provide reasonable assurance and cannot guarantee fraud won't occur. Auditors only provide a \"top-level glance\" due to the difficulty, cost, and time of a more thorough check. The problem of fraudulent activity can't be solved by technology but requires people to change their mindset, according to a user who studied accounting and auditing. BaFin's failure to detect fraud indications, and instead accusing journalists of market manipulation or trading shares in the company, was astonishing. Liability, so far, remains uncertain.A systemic failure needs to be investigated carefully to determine who committed a crime, and this takes time. The auditors' poor execution in audits have been exposed, and auditors lack knowledge of their role in the process. Audits should be thoroughly disclosed to reveal potential conflicts of interest, and auditing should be separated from consulting. Financial crime should be better investigated, and institutions should receive in-depth audits that are funded by public trust to prevent conflicts of interest. Finally, governmental power, while the seeming solution, is too corruptible to trust in the face of lucrative practices.EY, a big four accounting firm, could face another major blow for their audit quality. A German court has ruled the company was partly responsible for Wirecard’s multi-billion-dollar accounting fraud scandal due to iffy bookkeeping practices. It's still unclear what the ultimate consequences of this will be. The scandal is a reminder of the issue of building and keeping trust in the financial industry. However, some users argue that regulators have successfully taken actions against corporate malfeasance in certain areas, particularly finance. Comments express skepticism towards large auditing firms and the efficacy of relying on them for oversight, and urge for increased involvement from technical experts rather than lawyers and accountants.A discussion on Hacker News about auditing practices by government contractors and Big Four accounting firms. Some comments point out potential conflicts of interest and problems with government outsourcing to private firms. EY's recent ban from auditing is also mentioned, with some disagreeing with the decision but others citing the importance of auditors and their accountability. The discussion also touches on the role of corporate consulting and the responsibility of auditors in highly regulated industries.A debate on whether consulting firms like McKinsey and BCG add value or not. Some argue that these firms merely 'rubber stamp' decisions made by management, while others believe they have been unfairly maligned. Some suggest that a lack of 'skin in the game' should be banned instead of entire sectors. Additionally, the suggestion has been made to force auditing companies to stop offering consulting services to avoid conflicts of interest. This is related to the discussion of the public sector hiring private contractors. McK and BCG don't do auditing. The comments also debate the distinction between strategy and system integrator consulting companies, as well as the need for 'skin in the game' and potential solutions.",
    "hn_summary": "Ernst & Young (EY) has been banned from conducting new audits in Germany due to incorrect auditing decisions and involvement in the Wirecard scandal. Consulting firms subcontract lower-paid staff to minimize risk, but this can backfire. Auditors only provide reasonable assurance and do not guarantee fraud won't occur. Use of automation and AI can help detect fraudulent activity. Auditing should be separated from consulting to prevent conflicts of interest. There is debate over the value of consulting firms and the need for \"skin in the game.\""
  },
  {
    "id": 35500966,
    "timestamp": 1681030194,
    "title": "Sunset at the South Pole",
    "url": "https://brr.fyi/posts/sunset",
    "hn_url": "http://news.ycombinator.com/item?id=35500966",
    "content": "Sunset        brr       MenuHomeContactSubscribeAboutSearch for Poststation lifephotossouth poleSunsetHunkering down for the winter!brrApril 8, 2023          South Pole Station sits at near-exactly 90° South latitude. Down here, the sun does weird things. This leads       to accurate-yet-strange sentences, such as “can you believe it – only 4 more days until sunset”.I know you’re all here for the scenic photos, but first indulge me for a bit about how “daylight” works at       polar latitudes.Any location South of the Antarctic Circle (around 66.5° South       latitude) will experience 24 hours of consecutive daylight (“midnight sun”),       and 24 hours of consecutive darkness (“polar night”) at least       once per year. However - most areas still get “normal” (daily) sunrises and sunsets for at least part of the year.McMurdo, for example, sits at 77.85° South latitude. Well below the Antarctic Circle, but still nowhere near       as far South as South Pole Station. McMurdo gets daily sunrises and sunsets for several months each year,       during the transitional period between 24x7 daylight and 24x7 night.This year at McMurdo,       the 24x7 “midnight sun” period ended on February 20. There will be daily sunrises and sunsets until April 25,       at which point McMurdo will enter “polar night”. The sun will stay below the horizon until August 19.       Then there will be daily sunrises and sunsets until October 24, followed by another round of midnight sun.A daily sunset at McMurdo station, from September 2022.         McMurdo gets daily sunrises and sunsets from August through October, and again from February through April.In my Hut Point post about McMurdo Station, I remarked:“It’s now early September, and we’re rapidly gaining daylight.        We’re getting an extra 15-20 minutes per day, and it’ll be just a        few more weeks until there’s some light 24x7. For now,        the sun is just barely peeking out from behind the hills.”That’s McMurdo. Strange, but not too strange.South Pole is where things get really weird.At exactly 90° South latitude, the sun rotates in a near-perfect counterclockwise circle around the sky.       There is no difference       whatsoever between “night” and “day”. On any given day, 2pm looks the same as 2am. The sun is at the same       height, just in a different part of the sky.The sun reaches its highest point in the sky, about 23.5° above the horizon, around the       December Solstice (December 21).This photo was taken at 2pm on December 18th, near the peak of sunlight.         2am that day would have looked nearly the same,         with the sun just in a different part of the sky, but at the same height.After the sun reaches its peak, it begins to set. It’s still rotating in perfect circles around       the sky; they’re just getting lower and lower each day.When the sun gets low enough in the sky,       usually around mid-February, the temperature starts dropping rapidly.This is why South Pole Station “closes” for winter around February 15th each year. Beyond this day, it’s       operationally difficult to keep up flights. Sure enough, this year the temperature started dropping rapidly       right around February 15th, as I noted in Last Flight Out.The best way I can explain this is with a video. This video was originally published by       Robert Schwarz, who has spent 15 winters at the South Pole working       for one of the science projects here. It is reposted here with Robert’s permission.In the video, you’ll see a 5-day timelapse, tracking the sun, from March 8 through March 13, 2017.       It’s late in the season, and the sun is pretty low in the sky by this point.Pretty weird!Tangent – all of this makes it especially silly that we observe “daylight savings time” here.       We follow New Zealand time, because we had to pick something, and all our logistics run through New Zealand.       A few days ago, I ran around station setting all the analog clocks 1 hour back,       but it sure didn’t feel like we were saving any “daylight”.       Again, there is no visible daylight difference between times on a given day. We have a single,       gradual sunrise and sunset, spread out over the course of an entire year.I wasn’t particularly rigorous taking daily photos to catalog the sun’s gradual descent, but here’s a few,       showing the date and what the sun looked like on that day:December 30, 2022February 5, 2023February 15, 2023February 19, 2023February 19, 2023March 15, 2023March 19, 2023The sun here at South Pole Station finally “set” on March 23, 2023 at 12:54pm, NZ time. We all stared out the       window (or ventured outside) to watch it happen, but it’s really an anticlimactic milestone. We’re       basically experiencing a single, very weird, year-long day/night cycle. The actual moment of “sunset”       (officially defined as the moment the sun completely dips below the horizon) isn’t really that special –       the effects are spread out for several weeks.Nevertheless, here’s my closest true “sunset” photo:Sunset at the Geographic South Pole!And a few more photos from around sunset:As the sun slowly disappears below the horizon, we’re treated to a several-week-long period of brilliant       colors. The sun continues its counterclockwise rotation, just below the horizon, allowing you to experience       a sunset from any direction you choose.For example – in the “mornings” (7am), the sun is visible from the       observation deck at Destination Alpha. In the evenings, the sun has just finished passing through the backyard.       By about midnight, it illuminates the Ceremonial South Pole out in front of the station.These next few photos were taken about 10 days after sunset! It’s still magical, showing just how slowly       the sun sets.By April 6, we had our first bright moon! And with some lingering sunlight from the opposite side       of the sky, there was still plenty of light, even for camera phone photos:With any luck, we should start seeing our first auroras within the next few weeks!During Winter here at South Pole Station, we take our celestial events very seriously.On March 25, we observed Sunset Dinner. This is a formal affair – a ritual, a celebration, a proper excuse       to revel in the magical absurdity of our situation.We’re thousands of miles from civilization, it’s -80°F outside, and we’re marching toward       six months of darkness, with only ourselves to rely on. Time to celebrate!Our galley crew goes all-out to prepare. The decor, the ambiance, the food… the entire evening is a       curated masterpiece. It’s one of the most fun all-station evenings I’ve had so far.Salad, with greens from our greenhouse!I'd pay $20 for a dessert like this at an upscale restaurant back home. Props to our galley crew!We’re now passing through all the various stages of Twilight,       on our way towards night.From March 22 through April 5, we were in Civil Twilight.From April 5 through April 22, we’ll be in Nautical Twilight.From April 22 through May 12, we’ll be in Astronomical Twilight.From May 12 through August 2, it’ll be night, and fully dark, with only occasional light from the moon.Then we’ll repeat the cycles in reverse, culminating in sunrise around the       September Equinox.This afternoon, as I was putting the finishing touches on this post, I stepped outside and saw a star       bright enough to catch on camera. We’ll be seeing a lot more of these over the next few months!The first star of the season bright enough to catch on camera!Also – it is COLD out.Until next time!You may also likeFebruary 15, 2023            Last Flight OutGood-byes, and the beginning of winter isolation.February 11, 2023            FrostEveryday objects, but cold.February 4, 2023            Showering at the South PolePotable water, and not much of it.January 27, 2023            South Pole TopographyThe relentless accumulation (and management) of snow.March 18, 2023            The Beer CanConnecting old and new.December 21, 2022            South Pole ArrivalFlying to the bottom of the world!brr© brr",
    "summary": "At the South Pole Station, the sun rotates in a near-perfect counterclockwise circle around the sky, making no difference between “night” and “day”. As a result, the sunset is spread out over several weeks, and the temperature drops rapidly when the sun is low in the sky, usually around mid-February. The post includes photographs of sunset views from various directions as well as a video to demonstrate the strange phenomenon. The station also observes \"daylight savings time,\" even though there is no visible difference between times on a given day. The post details that South Pole Station follows New Zealand time and provides other data such as twilight stages and the first star sighting of the season.",
    "hn_title": "Sunset at the South Pole",
    "original_title": "Sunset at the South Pole",
    "score": 293,
    "hn_content": "A Hacker News post, \"Sunset at the South Pole\", showcases photos of the sun setting for the last time before a six-month polar night. HN users have commented on various topics, such as vampire movies set in polar regions, why there are no ants in Antarctica, and the construction of scientific facilities in the area. Comments reveal insight on how to regulate light and how to deal with a lack of sunlight in regions like the South Pole. Despite its mundane construction, facilities in the South Pole are impressive and remarkable.The author's solargraphy experiment failed due to difficulties with reciprocity of paper in extreme cold. The blog featuring the solar and lunar photographs receives high praise for its beauty and style. A comment notes the bizarre phenomena of the sun's circular travel from the poles and how it affects living conditions. The site showcases the inhospitable world of Antarctica where one must compete for a position to experience the sun's rise and set. Commenters also discuss the effects of extreme axis orientation, and breathing challenges under extreme cold.A post about experiencing extreme conditions in Antarctica has generated several comments discussing the freezing point of carbon dioxide and the logistics of conducting research on a mountain in Antarctica. One user praised the photos taken during a 5-day time lapse. Another user asked about the American flag at the research station, with another user explaining that it is a standard practice as the station is funded by the US. The article does not provide much new information but offers an interesting perspective of life and research in Antarctica.",
    "hn_summary": "A Hacker News post showcases beautiful photos of sunset before a 6-month polar night. Comments discuss dealing with lack of sunlight, regulating light, & construction of scientific facilities. Solargraphy experiment failed. Facility construction in South Pole is impressive. Discussion on the bizarre phenomena of the sun's circular travel & its effect on living conditions. Antarctica is inhospitable & one must compete for a position to see the sun's rise and set. Commenters also discuss breathing challenges under extreme cold. The article offers an interesting perspective on life and research in Antarctica."
  },
  {
    "id": 35501969,
    "timestamp": 1681042171,
    "title": "Dutch journalist who writes critically on China targeted in intimidation scheme",
    "url": "https://nltimes.nl/2023/04/08/dutch-journalist-writes-critically-china-targeted-bizarre-intimidation-scheme",
    "hn_url": "http://news.ycombinator.com/item?id=35501969",
    "content": "Dutch journalist who writes critically on China targeted in “bizarre” intimidation scheme | NL Times   Skip to main content  Toggle navigationMain navigationTop storiesHealthCrimePoliticsBusinessTechCultureSportsWeird1-1-2Image The flags of China and the Netherlands        - Credit: ruskpp /DepositPhotos        - License: DepositPhotosCrimePoliticsChinabomb threatintimidationespionageForeign AffairsMarije VlaskampThe HagueWang Jingyufreedom of expressionHong KongUyghurBeijing» More tags« Less tags        Saturday, 8 April 2023 - 09:59   Share this:facebooktwitterlinkedinwhatsappredditDutch journalist who writes critically on China targeted in “bizarre” intimidation schemeVolkskrant journalist Marije Vlaskamp said she has been the victim of serious threats and intimidation since last autumn, including when individual or several people made bomb threats under her name at targeting the Chinese embassy in The Hague and other locations. Threats sent to the Dutch journalist over Telegram demanded that she retract an article critical of China, she wrote in English and in Dutch in the Saturday edition of the Volkskrant. The Ministry of Foreign Affairs in the Netherlands responded that it has demanded clarification from China about the intimidation campaign.Neither the newspaper nor the police have been able to find out who exactly is behind it, but the person who sent the threats claims to represent the interests of the Chinese State. Vlaskamp was a correspondent in China from 2001 to 2019, and has been working as a foreign editor for the Volkskrant since her return to the Netherlands. She regularly writes critically about the Chinese State, and about sensitive subjects such as the oppression of Uyghurs and the activities of Chinese dissidents in the Netherlands.One of those dissidents is Wang Jingyu. Vlaskamp has written extensively about the 21-year-old who she first met in 2021. “In 2019, when Wang was still in secondary school, he got into trouble in China after writing critical tweets about Hong Kong and other politically sensitive subjects,” she wrote. “He managed to avoid arrest by fleeing the country together with his girlfriend.” The two arrived in the Netherlands nearly two years ago and requested asylum. “In my article I had shown in detail how Beijing was making the young activist’s life miserable over here as well.”He received threatening messages via Telegram in October from someone who calls themself “Alice,” Vlaskamp said. “Keep your foul mouth shut, you filthy traitor. If you go on forcing yourself upon anti-Chinese media, the police will come to arrest you,” one of the messages read. “Your parents will suffer even worse and one day you will be punished yourself. And things won’t end well for the anti-Chinese journalists either.”Another message read, “One tip from me and the police will come and arrest you and your journalist friend.” That message was coordinated with a bomb threat at the Chinese embassy that was reported to police. Simultaneously, Vlaskamp and Jingyu both received confirmations of hotel bookings in their name for a location close to the embassy, which they had not arranged themselves.“This simple email from Booking.com is the start of a complicated and at times bizarre intimidation campaign which takes me on a Chinese rollercoaster ride, against my will. My superiors at the newspaper, the Dutch police, and myself have front row seats for this display of how the Chinese operate if they wish to silence people about matters to which the Chinese one-party State does not want to draw attention,” she said. “We don’t know where this journey will end and neither do we know who is driving. And the person behind the wheel will do everything they can to keep it that way.”The police response took place on October 15 shutting down parts of The Hague for the investigation. “It sounds crazy, but the Chinese embassy has actually called the police about a bomb and mentioned our names,” Jingyu told Vlaskamp after he spent a day going over his story with police. The bizarre nature of it made Vlaskamp burst out in a fit of laughter, as she had worked frequently with Chinese diplomats and maintained a healthy professional relationship with them.“During the almost quarter century that I’ve been working as a China correspondent, I’ve learned enough to know how the Chinese operate if they want someone to shut up,” Vlaskamp wrote. “And yet I am also shocked. As far as I know, Western journalists are rarely treated this heavy-handedly. Also, my assailants make no effort at all to conceal that the threat is of Chinese origin.”The Ministry of Foreign Affairs wants clarification from China about the intimidation and threats against the journalist. The ministry has contacted the Chinese embassy in the Netherlands about this, a spokesperson confirmed.The ministry called it \"very worrying that a dissident and a journalist are faced with such far-reaching intimidation. This Cabinet is committed to the safety of journalists and human rights defenders worldwide and strongly opposes all forms of unwanted foreign interference. That this intimidation takes place in the Netherlands is unacceptable.\"It reflects another issue in a recent string of incidents that has caused tension between the Netherlands and China. Recently, the Netherlands put export restrictions on the country’s tech sector that make it nearly impossible for ASML to export technologically advanced microchip production equipment to China. State players were also linked to an espionage scheme targeting workers in the Dutch tech sector, and one of the Dutch intelligence agencies said China was also part of a plot to use smartphones to spy on Dutch businesses.China has also been accused of illegally operating secret police stations in Amsterdam and Rotterdam. Dutch authorities said just one month after the Chinese embassy bomb threat that they are becoming more concerned about increasing threats from both China and Russia, and there is an ever-growing list of politicians, agencies, and government offices banning workers from installing the social media app TikTok on phones used for work. This follows advice from Dutch intelligence agencies concerned about the influence the Chinese State has on ByteDance, the company that owns the app.In response to the article, the Chinese embassy confirmed they received a bomb threat and reported it to police, a representative told the Volkskrant. “As a diplomatic mission in the Netherlands, the embassy took this threat seriously and passed the bomb threat information to the Dutch police immediately. The Dutch government and police took immediate and professional measures to ensure the security of our embassy. There have been growing attacks and threats against the Chinese embassy recently, including from violent protesters and unknown parcels posted to or thrown in the embassy,” the statement read. “False or not, we have to take each case seriously.”Reporting by ANP and NL TimesFollow us:Latest storiesFeyenoord stays on course for the title beating RKC 5-1Berghuis leads Ajax to a comfortable victory against Fortuna SittardAmsterdam police arrest boy, 16, for stabbing that wounded a 13-year-oldKing Willem-Alexander has ruled for ten eventful years marked with controversyAirplane the most popular choice as more Dutch residents book holidays for 2023Suspect in Curacao drive-by shooting that killed Dutch musician arrested in VlaardingenTop storiesTourist attractions and nature sites are getting ready for Easter weekendDutch journalist who writes critically on China targeted in “bizarre” intimidation schemeRetailers think they can handle Easter crowds despite staff shortagesTrain derailment timeline leaked: Crane was at active railroad earlier than agreedMany festivals not happening this year as organizers struggle to stay afloatFive victims of Voorschoten train crash still in hospital, one in ICU© 2012-2023, NL Times, All rights reserved.Footer menuPrivacyContactPartner content",
    "summary": "Marije Vlaskamp, a Dutch journalist who is critical of China, has been targeted in a bizarre intimidation scheme since last autumn, which included bomb threats and messages demanding that she retract an article. Vlaskamp has previously written critically about the Chinese state, with a focus on the oppression of the Uyghurs and Chinese dissidents in the Netherlands. The Chinese embassy in The Hague has been targeted by a bomb threat which mentioned both Vlaskamp and Wang Jingyu, one of the subjects of her articles. While Vlaskamp’s assailants do not attempt to hide the Chinese origin of the threat, the Chinese embassy has denied involvement in emboldening the attackers.",
    "hn_title": "Dutch journalist who writes critically on China targeted in intimidation scheme",
    "original_title": "Dutch journalist who writes critically on China targeted in intimidation scheme",
    "score": 236,
    "hn_content": "A Dutch journalist who wrote critically on China has been targeted in an intimidation scheme. HN users discuss similar incidents in other countries and Chinese illegal operation of secret police stations in the Netherlands. Some users urge governments to do more to protect citizens and enforce sovereignty. The article raises concern about Chinese interference in other countries and lack of action by governments.Chinese police stations in the Netherlands and other countries operate to inform individuals of the consequences of not returning to China and applying undue pressure to do so, but they do not perform renditions as there is no extradition agreement. Countries may need to investigate so-called \"grey actions\" themselves to determine if potential crimes are legitimate or politically motivated. Many countries have similar Chinese operations, and the response is calibrated to make the program reevaluate the costs and voluntarily close if nothing changes. However, some argue that China's actions violate sovereignty, and several politicians have been threatened as a result.Tech news commentators discuss topics on China's government and its actions towards western journalists, including warnings against anti-CCP statements. There are debates on China's role in the recent bomb threat incident against a Chinese dissident journalist living in the US. A podcast from The Economist, \"The Prince: Searching for Xi Jinping,\" provides insights on how China's leader rose to power and his policies. Some comments suggest that journalists are targeted by China to intimidate their criticisms, while others argue that there are many issues with the Chinese government. A user's account is flagged and banned for using HN for ideological and nationalistic battles.ASML, a Dutch company, appears in a context where China is aiming to own electronics of the West. Meanwhile, an American journalist targeted in intimidation scheme. Y Combinator is now accepting applications for summer 2023.",
    "hn_summary": "A Dutch journalist targeted in an intimidation scheme; HN users discuss Chinese interference and urge governments to do more. Chinese police stations operate in the Netherlands and other countries, and countries may need to investigate so-called \"grey actions\" themselves. Critics argue that China's actions violate sovereignty, and some politicians have been threatened as a result. HN users discuss China's role in recent bomb threat incidents against dissident journalists living in the US; debates on China's government and its actions towards western journalists. ASML, a Dutch company, appears in a context where China aims to own electronics of the West."
  },
  {
    "id": 35499641,
    "timestamp": 1681008287,
    "title": "USPS facility in Utah does nothing but decipher handwriting",
    "url": "https://kutv.com/news/eye-on-utah/what-happens-to-mail-with-band-handwriting-united-states-postal-service-letter-carrier-usps-mailwoman-mailman-cursive-taught-in-schools-unreadable-print-envelopes-undeliverable-packages-salt-lake-city-utah",
    "hn_url": "http://news.ycombinator.com/item?id=35499641",
    "content": "This USPS facility in Utah does nothing but decipher your bad handwriting on mail | KUTVPlease ensure Javascript is enabled for purposes ofwebsite accessibility",
    "summary": "The USPS facility in Utah specializes in deciphering messy handwriting on mail. This facility employs over 90 people who sort through the mail and use advanced technology to process it. The technology used can even scan and digitize handwritten addresses. The facility shows how technology is evolving to handle traditional tasks in innovative ways.",
    "hn_title": "USPS facility in Utah does nothing but decipher handwriting",
    "original_title": "USPS facility in Utah does nothing but decipher handwriting",
    "score": 235,
    "hn_content": "A USPS facility in Utah specializes in deciphering handwriting, according to a post on Hacker News. One user reminisced about working in a college mailroom in the 1970s, while others discussed wages and inflation. The post has garnered significant attention due to the unique nature of the USPS facility's work. The discussion on Hacker News touched on the evolution of labor and wages over time, with a focus on changes in the cost of essential goods and the role of technology in labor efficiency.A discussion on government subsidies for essential services like education and housing, which may increase demand without matching supply, leading to rising prices. However, a user argues that efficiencies in the restaurant industry have made it more affordable despite remaining an essential service. The conversation diverts to the confusing address systems in various countries, with landmark-based addressing in Latin America, and building code-based addressing in Japan. Hidden superpowers of dedicated zip codes in the US are discussed, and the delay in delivering mail to nearby addresses is puzzling.USPS sorting happens primarily at regional processing centers, rather than individual stations, due to cost optimization. Sorting machinery is usually larger and more automated at processing centers. While local-only processing may have been preferable in the past, a shift to intercity mail and centralization has made regional processing more efficient. Handwriting is becoming obsolete as keyboarding takes hold, but it still has a certain nostalgic value.Experts discuss the benefits of writing in books, including improved notetaking and deeper engagement with the material. Some users express frustration with their handwriting, while others embrace the shift to digital communication. The loss of cursive writing is viewed as a sign of society's increasing reliance on technology, with some concerned about the potential consequences. The discussion touches on the importance of property ownership and the role of books as conveyors of knowledge. The need for specialized facilities to maintain reliable delivery is also noted.The USPS's guaranteed pickup of stamped paper is a marvel, despite being unnecessary for reliable service. Some criticize governments' aimless running of such services, while others view it as a form of ECC. USPS is self-funded and has a unique way of dealing with its resources, unlike the domain name system. A private company could contract this job out, earning money from USPS while also building institutional data that could be used for machine learning. However, there are concerns about potential privacy violations with the use of private data. The US Postal Service's handwriting recognition technology is already impressive.USPS has a cursive handwriting OCR facility in Salt Lake City, the last of its kind, due to vast amounts of mail that require human sorting. The facility handles 175 million cursive-addressed mail items a year, which are a hassle for OCR systems to classify. Salt Lake City is home to the largest Mormon community in America, and this is believed to be because Mormons' genealogical focus led more people to learn cursive. The software is provided by Eagle, and Siemens is also mentioned. An HN user points out that Google Lens is capable of reading handwriting, but edge cases can still cause issues.A post on Hacker News discusses the USPS's Handwritten Mail Recognition System, which uses a combination of OCR and human workers to decipher difficult-to-read addresses. Some users praise the US Postal Service's \"duty\" and \"commitment,\" while others suggest improving handwriting or creating a mobile app to help users. Handwriting recognition has existed for years, but it is still a challenge for many postal workers with high accuracy requirements. The article also notes that a reliable postal system is critical infrastructure in many parts of the world.The discussion thread on Hacker News includes a comment about the unreliability of postal services, particularly in government buildings, and paid couriers being the only trustworthy option. Another comment tells a story about a Mormon genealogy enthusiast who utilizes computers to enhance research efficiency, with a personal anecdote about building computers with his grandfather. A separate comment discusses the writer's experience with handwriting analysis connected to the MBTI personality test. While readers may find these comments interesting, none of these are the main point of the article.USPS state-of-the-art data center in Salt Lake City relies on human workers to decipher and encode addresses that can't be read by automated systems. Thousands of handwritten envelopes pass through the facility every day, and the center needs to employ proficient cursive readers to deal with letters that machines cannot recognize. Although there are fewer letters being sent through the country's postal system and machine learning can help identify handwriting more quickly, some unrecognizable handwriting requires human involvement.USPS employs 800 people in Utah to decipher bad handwriting that OCRs can't, as the long tail of the cursive writing is harder for AI systems to process. An HN user says that while 98% is automated by OCRs, 2% requiring human intervention is still a significant challenge. Some users believe that these problems serve as an example of issues that persist in computer vision and machine learning technologies. There is skepticism toward AI systems solving major world problems while USPS must employ hundreds of humans to process everyday mail.",
    "hn_summary": "The USPS facility in Utah specializes in deciphering cursive handwriting with a software provided by Eagle and Siemens. Handwriting recognition has been challenging for postal workers, and human intervention is still required. The discussion on Hacker News touches on the evolution of labor and wages, property ownership, government subsidies, and the benefits of writing in books. Salt Lake City's Mormon community is believed to have contributed to the facility's large number of skilled readers. Some suggest the USPS should create a mobile app, while others express concerns about privacy violations with the use of private data."
  },
  {
    "id": 35503210,
    "timestamp": 1681051675,
    "title": "Apple Continues Efforts to Keep Retail Stores from Unionizing",
    "url": "https://www.bloomberg.com/news/newsletters/2023-04-09/apple-aapl-continues-efforts-to-keep-retail-stores-from-unionizing-lg9gjdx2",
    "hn_url": "http://news.ycombinator.com/item?id=35503210",
    "content": "Apple (AAPL) Continues Efforts to Keep Retail Stores From Unionizing - BloombergSkip to contentSkip to contentBloomberg the Company & Its ProductsThe Company & its ProductsBloomberg Terminal Demo RequestBloomberg Anywhere Remote LoginBloomberg Anywhere LoginBloomberg Customer SupportCustomer Support        Switch Editions    UK   Europe   US   Asia   Middle East   Africa   日本    Sign In Subscribe        Live Now  Bloomberg TV+      The David Rubenstein Show: Peer to Peer Conversations:Rosalind Brewer, Walgreens Boots Alliance CEO    Bloomberg Radio      Bloomberg Businessweek Insight and analysis of top stories from our award winning magazine \"Bloomberg Businessweek\". Listen   Bloomberg Originals      Power Moves If a green pivot is to happen, power grids must become “supergrids,” continent-spanning networks that can move green energy thousands of miles. The technology is here, but politics may stand in the way.   Also streaming on your TV:                Markets  Markets   Deals  Odd Lots  The FIX | Fixed Income  ETFs  FX  Factor Investing  Alternative Investing  Economic Calendar  Markets Magazine         Markets Ueda Kicks Off BOJ Governorship in First Transition in a Decade         Markets End May Be in Sight for Global Rate-Hike Cycle as Fed Nears Peak    Market Data  Stocks  Commodities  Rates & Bonds  Currencies  Futures  Sectors   View More Markets   Economics  Economics   Indicators  Central Banks  Jobs  Trade  Tax & Spend  Inflation & Prices         Economics Saudi Arabia’s Drive to Get Expats to Ditch Dubai Is Off to a Rocky Start         Central Banks Philippine Central Bank Chief Mulls Rate Pause on Inflation Data         Trade South Korea to Strengthen Supply Chain Cooperation with India    View More Economics   Industries  Industries   Consumer  Energy  Entertainment  Finance  Health  Legal  Real Estate  Telecom  Transportation         Markets Japan Inc. Sells Record Short Bonds Amid BOJ Tightening Bets         Business Flutter Close to Appointing John Bryant as Chairman, Sky Reports    Featured  Business of Sports   View More Industries   Technology  Technology   Code Wars  Checkout  Prognosis         Technology Twitter Reverses NPR Label, Tweaks to ‘Government Funded Media’    View More Technology   Politics  Politics   US  UK  Americas  Europe  Asia  Middle East         Obituaries Benjamin Ferencz, Last of the Nuremberg Prosecutors, Dies at 103         Politics Expelled Tennessee Lawmakers Say They Would Accept Reappointment    Featured  Next China   View More Politics   Wealth  Wealth   Investing  Living  Opinion & Advice  Savings & Retirement  Taxes  Reinvention    Featured  How to Invest   View More Wealth   Pursuits  Pursuits   Travel  Autos  Homes  Living  Culture  Style         Screentime ‘Super Mario’ Tops Box Office With Year’s Biggest Opening         Screentime ‘The Super Mario Bros. Movie’ Is a Box Office Smash    Featured  Screentime  New York Property Prices  Where to Go in 2022   View More Pursuits   Opinion  Opinion   Business  Finance  Economics  Markets  Politics & Policy  Technology & Ideas  Editorials  Letters         Minxin Pei China Can’t Charm the World on the Cheap         Andy Mukherjee India’s Tech Hub Can’t Deal With SVB if It’s Stuck in Traffic         Brooke Sample Reality Check: How Influential Is China Right Now?    View More Opinion   Businessweek  Businessweek   The Bloomberg 50  Best B-Schools  Small Business Survival Guide  50 Companies to Watch  Good Business  Subscribe to the Magazine         Money What to Do With Your Money—and Your Life—in a Wild New World         Remarks AI Is Moving Fast Enough to Break Things. Sound Familiar?         Feature The Chainsmokers Are Dancing Through the Silicon Valley Downturn    View More Businessweek   Equality  Equality   Corporate Leadership  Capital  Society  Solutions         Equality Iran Vows to Prosecute Women, Close Businesses That Shun Hijab         Prognosis What Is Mifepristone and Why Is It Being Banned in the US?    Featured  In Trust Podcast   View More Equality   Green  Green   New Energy  ESG Investing  Weather & Science  Electric Vehicles  Climate Politics  Greener Living  Cleaner Tech         Green Chinese Solar Maker Says US May Be Too Pricey for Expansion         Green Tesla to Build New Shanghai Factory for Megapack Battery    Featured  Data Dash  Hyperdrive   View More Green   CityLab  CityLab   Design  Culture  Transportation  Economy  Environment  Housing  Justice  Government  Technology         Design Inspired by Filipino Design, an Apartment Building Looks Homeward         Culture Festivals Are a Form of Defiance for West African Cities Facing Terror         Justice Virginia Takes Novel Approach to Preserving Historic ‘Green Book’ Locations    View More CityLab   Crypto  Crypto   Decentralized Finance  NFTs  Regulation  Technology         Crypto Why Crypto Is Watching Ethereum’s ‘Shanghai’ Upgrade         Feature Scaramucci’s SkyBridge Capital Was Spiraling, and Then Came FTX    View More Crypto    More                NewsletterApple Continues Efforts to Keep Retail Stores From UnionizingThe Apple Store on Fifth Avenue in New York City.Photographer: Jeenah Moon/BloombergByMark Gurman+FollowApril 9, 2023, 1:45 PM UTCShare this articleCopiedGiftGift this articleExitSubscriber BenefitBloomberg subscribers can gift up to 5 articles a month for anyone to read, even non-subscribers! Learn moreSubscribeSign InApple is continuing its push to keep retail stores from unionizing. Also: A deep look inside efforts to diversify the company’s product and component production beyond China, job cuts hit Apple’s corporate ranks, and another executive departs.Last week in Power On: Apple is just two months away from unveiling its mixed-reality headset.LIVE ON BLOOMBERGWatch Live TVListen to Live RadioTerms of ServiceTrademarksPrivacy Policy©2023 Bloomberg L.P. All Rights ReservedCareersMade in NYCAdvertiseAd ChoicesHelp",
    "summary": "Apple is trying to prevent its retail stores from unionizing, while also diversifying its product and component production outside of China. The company has recently experienced job cuts and another executive departure. The article also mentions the upcoming release of Apple's mixed-reality headset.",
    "hn_title": "Apple Continues Efforts to Keep Retail Stores from Unionizing",
    "original_title": "Apple Continues Efforts to Keep Retail Stores from Unionizing",
    "score": 230,
    "hn_content": "Apple has been criticized for withholding benefits from unionized locations, fueling outcry from labor advocates. The company has been accused of trying to prevent its retail stores from unionizing, a tactic that is not new to a variety of physical labor unions. Some believe that benefits should be based on an individual or collective basis rather than whether employees are unionized. Starbucks was found guilty of similar tactics by the NLRB but for refusing to negotiate. We should thank the unions for benefits we currently have, such as a 40-hour workweek.Employees of Apple's retail stores have criticized management and praised the benefits of union membership, alleging that non-unionized workers receive worse benefits from the tech giant. One worker was granted a special raise after the union bargained out-of-cycle benefits, but this was later seen as a slight by some staff who felt that additional pay owed to them by Apple should have been paid unconditionally. Some Hacker News users criticized the unions' negotiating tactics, but others praised the benefits of union membership for tech company employees.An article on unionization prompted a discussion about the potential impact on workers. Some commenters argued that forming a union can be difficult, while others said that it provides a way for workers to negotiate as a group. There were also debates about the power dynamics within unions, with some arguing that union leaders can become co-opted by management, while others pointed out that union members can vote for their representatives and that union leaders are accountable to their membership. Overall, the thread highlighted the complexities of unionization and its potential impacts on workers.A discussion on the safety nets in America and Europe has broken out on a Hacker News post. While some claim that America has ample safety nets available—even bankruptcy, others argue that Europe has better policies protecting its people. Some worry that the working lower middle class is struggling the most. The discussion spans topics such as corporate paternalism and union benefits, ultimately leading to calls for an economic system that recognizes worker involvement and co-ownership.Apple is accused of anti-union vote tampering and spreading misinformation about non-union perks for employees. The union claims that Apple announced the perks to scare union employees ahead of other store votes. A commenter suggests that unions and management can have a non-hostile relationship that can be good for businesses. Some commenters accuse Apple of hypocrisy, stating that they only care about profit and market progressive values for public appeal. One commenter gives an example of Toyota's employees perceiving lower wages as beneficial during the financial crisis. The younger generation seems to be pro-union, possibly due to a sense of hopelessness and the inability to afford basic necessities.A Gallup Poll shows that 71% of Americans approve of labor unions, indicating a growing interest in unionizing, especially in modern retail and restaurant jobs. While some comments argue that retail jobs are not necessarily abusive, others highlight the low pay and lack of benefits for front-line workers, as well as the risk of death during the pandemic. Apple stores are some of the most profitable retail stores per square foot, leading to attempts to unionize. However, some argue that tenure-based promotions and layoffs could detrimentally affect the company's ability to remove under-performers.",
    "hn_summary": "Apple accused of anti-union tactics, including withholding benefits; criticism of union negotiating tactics. Discussion on complexities of unionization and worker impact. Gallup Poll shows growing interest in unionizing, especially with front-line workers. Some criticize retail jobs' low pay and lack of benefits, while others argue tenure-based promotions and layoffs could negatively affect companies."
  },
  {
    "id": 35501065,
    "timestamp": 1681031666,
    "title": "PL/Rust 1.0: now a trusted language for Postgres",
    "url": "https://tcdi.github.io/plrust/plrust.html",
    "hn_url": "http://news.ycombinator.com/item?id=35501065",
    "content": "What is PL/Rust? - PL/Rust GuideWhat is PL/Rust?Installation1. Install Prerequisites2. Install PL/Rust3. Update PL/RustPL/Rust Usage4. PL/Rust Functions and Arguments5. Data types6. Built-in functions6.1. Logging to PostgreSQL from PL/Rust6.2. Triggers6.3. SPI7. Trusted and Untrusted PL/Rust8. PostgreSQL configuration9. Rules and RegulationsPL/Rust Under the Hood10. Architecture11. Designing for Trust12. Lints13. Environment variablesLight (default)RustCoalNavyAyuPL/Rust GuideWhat is PL/Rust?This documentation is under development.PL/Rust is a loadable procedural language that enables writing PostgreSQLfunctions in the Rust programming language. These functions are compiled tonative machine code. Unlike other procedural languages, PL/Rust functions arenot interpreted.The top advantages of PL/Rust include writing natively-compiled functions to achieve the absolute best performance,access to Rust's large development ecosystem, and Rust's compile-time safety guarantees.PL/Rust is Open Source and actively developed on GitHub.FeaturesPL/Rust provides access to Postgres' Server Programming Interface (SPI) including dynamic queries, preparedstatements, and cursors. It also provides safe Rust types over most of Postgres built-in data types, including (butnot limited to), TEXT, INT, BIGINT, NUMERIC, FLOAT, DOUBLE PRECISION,DATE, TIME, etc.On x86_64 and aarch64 systems PL/Rust can be a \"trusted\" procedural language, assuming the proper compilationrequirements are met. On other systems, it is perfectly usable as an \"untrusted\" language but cannot provide thesame level of safety guarantees.Example PL/Rust functionThe following example shows an example PL/Rust function to count the length ofan input string. See PL/Rust Functions and Argumentsfor more examples.CREATE FUNCTION strlen(name TEXT)  RETURNS int LANGUAGE plrust AS$$  Ok(Some(name.unwrap().len() as i32))$$;Using the function is just like any other PostgreSQL function.SELECT strlen('Hello, PL/Rust');┌────────┐│ strlen │╞════════╡│   14 │└────────┘Built on pgxPL/Rust itself is a pgx-based Postgres extension. Furthermore, each LANGUAGE plrust function are themselves mini-pgx extensions. pgxis a generalized framework for developing Postgres extensions with Rust. Like this project, pgxis developed by TCDI.The following sections discuss PL/Rusts safety guarantees, configuration settings, and installation instructions.General Safety, by RustQuoted from the \"Rustonomicon\":Safe Rust is the true Rust programming language. If all you do is write Safe Rust, you will never have to worryabout type-safety or memory-safety. You will never endure a dangling pointer, a use-after-free, or any other kindof Undefined Behavior (a.k.a. UB).This is the universe in which PL/Rust functions live. If a PL/Rust function compiles it has these guarantees, bythe Rust compiler, that it won't \"crash.\" This quality is important for natively-compiled code running in aproduction database.What about unsafe?PL/Rust uses the Rust compiler itself to wholesale disallow the use of unsafe in user functions. Ifa LANGUAGE plrust function uses unsafe it won't compile.Generally, what this means is that PL/Rust functions cannot call unsafe fns, cannot call extern \"C\"s intoPostgres itself, and cannot dereference pointers.This is accomplished using Rust's built-in #![forbid(unsafe_code)] lint.3rd-party crate dependencies are allowed to use unsafe. We'll discuss this below.What about pgx?If pgx is a \"generalized framework for developing Postgres extensions with Rust\", and if PL/Rust user functionsare themselves \"mini-pgx extensions\", what prevents a LANGUAGE plrust function from using any part of pgx?The plrust-trusted-pgx crate does!The plrust-trusted-pgx crate is a tightly-controlled \"re-export crate\" on top of pgx that exposes the bare minimum necessary forPL/Rust user functions to compile along with the bare minimum, safe features of pgx.The crate is versioned independently to both pgx and plrust and is published on crates.io.By default, the version a plrust user function will use is that of the one set in the project repository when plrust itselfis compiled. However, the plrust.trusted_pgx_version GUC can be set to specify a specific version.The intent is that plrust-trusted-pgx can evolve independently of both pgx and plrust.There are a few \"unsafe\" parts of pgx exposed through plrust-trusted-pgx, but PL/Rust's ability to block unsaferenders them useless by PL/Rust user functions. plrust-trusted-pgx's docs are available on docs.rs.What about Rust compiler bugs?PL/Rust uses its own rustc driver which enables it to apply custom lints to the user's LANGUAGE plrust function.In general, these lints will fail compilation if the user's code uses certain code idioms or patterns which we know tohave \"I-Unsound\" issues.PL/Rust contains a small set of lints to block what the developers have deemed the most egregious \"I-Unsound\" Rust bugs.Should new Rust bugs be found, and detection lints are developed for PL/Rust, the lints can be applied to new user function compilations along with ensuring that future function executions had those lints applied at compile time.Note that this is done on a best-effort basis, and does not provide a strong level of security — it's not a sandbox,and as such, it's likely that a skilled hostile attacker who is sufficiently motivated could find ways around it(PostgreSQL itself is not a particularly hardened codebase, after all). You should ensure such actors cannot execute SQLon your database, but to be clear: this is true regardless of whether or not PL/Rust is installed. Having said that, anyissues found with our implementation will be taken seriously, and should bereported appropriately.Trusted with postgrestd on Linux x86_64/aarch64The \"trusted\" version of PL/Rust uses a unique fork of Rust's std entitledpostgrestd when compiling LANGUAGE plrust user functions. postgrestd isa specialized Rust compilation target which disallows access to the filesystem and the host operating system. The Install PL/Rust section outlines the steps required fortrusted install of PL/Rust.Currently, postgrestd is only supported on Linux x86_64 and aarch64 platforms.When plrust user functions are compiled and linked against postgrestd, they are prohibited from using thefilesystem, executing processes, and otherwise interacting with the host operating system.In order for PL/Rust to use postgrestd, its Rust compilation targets must be installed on the Postgres server.This happens via plrust'splrust/build script, which clones postgrestd, compiles it, bydefault, for both x86_64 and aarch64 architectures, and ultimately places a copy of the necessary libraries used byRust for std into the appropriate \"sysroot\", which is the location that rustc will look for building thoselibraries.The trusted Feature FlagPL/Rust has a feature flag simply named trusted. When compiled with the trusted feature flag PL/Rust willalways use the postgrestd targets when compiling user functions.Again, this is only supported on x86_64 and aarch64 Linux systems.postgrestd and the trusted feature flag are not supported on other platforms.As such, PL/Rust cannot be considered fully trusted on those platforms.If the trusted feature flag is not used when compiling PL/Rust, which is the default, then postgrestd is notused when compiling user functions, and while they'll still benefit from Rust's general compile-time safetychecked, forced usage of the plrust-trusted-pgx crate, and PL/Rust's unsafe blocking, they will be able to access thefilesystem and communicate with the host operating system, as the user running the connected Postgres backend(typically, this is a user named postgres).PL/Rust is also a Cross CompilerIn this day and age of sophisticated and flexible Postgres replication, along with cloud providers offeringPostgres on, and replication to, disparate CPU architectures, it's important that plrust, since it stores the userfunction binary bytes in a database table, support running that function on a replicated Postgres server of adifferent CPU architecture.cross compilation has entered the chatBy default, PL/Rust will not perform cross compilation. It must be installedand enabled through configuration.Configuring a host to properly cross compile is a thing that can take minimal effort to individual feats ofheroic effort. Reading the (still in-progress) pgx cross compile guide can help. Generally speaking, it's not too awful to setup on Debian-based Linux systems, such as Ubuntu. Basically,you install the \"cross compilation toolchain\" apt package for the other platform.",
    "summary": "PL/Rust is a loadable procedural language that allows writing PostgreSQL functions in Rust, providing access to Postgres' Server Programming Interface and safe Rust types over most of Postgres-built-in data types; PL/Rust functions are compiled to native machine code rather than being interpreted, providing the best performance. PL/Rust is now a trusted procedural language for Postgres on x86_64 and aarch64 systems if proper compilation requirements are met, allowing PL/Rust to live in a universe of Safe Rust; PL/Rust uses its own rustc driver to apply custom lints to a user's LANGUAGE plrust function to apply certain code idioms that they know not to have \"I-Unsound\" issues. By default, PL/Rust will not perform cross compilation, but it must be installed and enabled through configuration.",
    "hn_title": "PL/Rust 1.0: now a trusted language for Postgres",
    "original_title": "PL/Rust 1.0: now a trusted language for Postgres",
    "score": 216,
    "hn_content": "PL/Rust 1.0 has become a trusted language for Postgres, providing a new alternative for PostgreSQL developers. Developers can now use Rust to write database functions for defining custom types, implementing custom operators, and other functions that can run at machine speed, without relying on untested third-party C code. The trusted status enables cloud providers like RDS and Supabase to provide it in their setups. The implementation blocks file system access and is secure, but the Rust implementation is vulnerable to safety issues just like any other language. Some cloud vendors aim to add PL/Rust to their platforms in the coming months.PL/Rust is a procedural language for writing PostgreSQL functions in Rust, with top advantages including exceptional performance, access to Rust's development ecosystem, and Rust's compile-time safety guarantees. However, support for event triggers and DO blocks has not yet been incorporated, which may limit its optimization for computational triggers in bulk operations. In-database computation using Rust can be advantageous, especially for video similarity search and smaller, more efficient types that lead to improved database performance. PL/PSQL is considered a decent language for set-oriented tasks requiring imperative code, but a first-class programming language may be preferable for more complex algorithms.",
    "hn_summary": "PL/Rust 1.0 now trusted in Postgres as an alternative for database functions. Cloud providers RDS and Supabase enable PL/Rust implementation. Has exceptional performance but still vulnerable to issues. Event triggers and DO blocks haven't been incorporated yet. Rust has access to dev ecosystem, efficient types and better performance. May limit optimization for computational triggers."
  },
  {
    "id": 35502684,
    "timestamp": 1681048015,
    "title": "Twitter Is Blocking Likes & Retweets that Mention Substack",
    "url": "https://flipboard.social/@Flipboard/110161362001035875",
    "hn_url": "http://news.ycombinator.com/item?id=35502684",
    "content": "Flipboard: \"@tchambers@indieweb.social @Hey_Beth@sfba.social …\" - FlipboardTo use the Mastodon web application, please enable JavaScript. Alternatively, try one of the native apps for Mastodon for your platform.Logomark_DIGITAL_Red_500X500Vertical-Lockup_DIGITAL_Red_500px",
    "summary": "N/A.",
    "hn_title": "Twitter Is Blocking Likes and Retweets that Mention Substack",
    "original_title": "Twitter Is Blocking Likes and Retweets that Mention Substack",
    "score": 205,
    "hn_content": "Twitter is blocking likes and retweets that mention Substack, with users confirming the block on links and search results. Elon Musk made a statement accusing Substack of scraping Twitter and trying to download a massive portion of their database, but experts find the statement incomprehensible and several levels of nonsense. The block is not based on IP addresses, but domain names and keywords, with searches for Substack, misspelled or not, returning incorrect results. The Streisand effect is in play, with Musk's actions catapulting Substack Notes to the forefront despite being a comparatively tiny company that has yet to launch.Elon Musk's tweet about Substack recent scandal raises eyebrows, but many dismiss it as his usual antics. Despite accusations of substack scraping Twitter's database, Substack CEO denies improper use of Twitter APIs. Some HN users point out that this is similar to the tactic of modern corporate cancel culture, and that even Twitter's reports are unlikely to catch their scraping. While some argue that Substack is better than Twitter for hosting healthier business models, others say the company is just like Twitter, fueled by ads and low-quality content aimed at appealing to the masses. Elon's actions may be a part of his plan to appear technically incompetent in public.Twitter is facing criticism for replacing the term \"substack\" with \"newsletter\" in search results, and for previously banning the mention of non-Twitter usernames. Elon Musk has been involved in controversies related to Twitter's moderation decisions, which some say contradict the company's mission of supporting free speech. Some users express concern about Substack's plans to add a newsfeed feature which might lead to low-quality clickbait content. Some HN users speculate that Elon Musk may have bipolar disorder, while others make sarcastic comments about his recent Twitter spats.Elon Musk's tweet linking to a Substack article was reportedly blocked by Twitter, leading to criticism of Twitter's API usage policies; however, Twitter is well known for taking measures to prevent what they consider \"API abuse.\" There may be censored/redirected terms in Twitter search related to Substack as well. Furthermore, if Substack releases a Twitter clone, it remains unclear how many Twitter users will migrate to this new platform or stay on Twitter. As Twitter and Substack continue to compete, it remains to be seen how the situation will evolve, and people are exploring alternative microblogging protocols to avoid such centralized censorship altogether.Amidst criticisms against Elon Musk for banning Substack links on Twitter, some users point out that similar requests have been made by other companies in the past. Others resist turning the issue into a spectacle and suggest a need to hold leadership accountable. There are debates surrounding the logic behind API abuse and the controversy regarding Substack's alleged scraping of Twitter content. However, users caution against dismissing the plight of laid-off employees at the tech company.",
    "hn_summary": "Twitter blocks likes/retweets mentioning Substack, causing Streisand effect. Elon Musk accuses Substack of scraping Twitter database, experts find statement nonsensical. Substack denies improper use of Twitter APIs. Criticisms of Twitter's search results, bans, and API usage policies. Concerns over quality of Substack newsfeed feature. Competing Twitter and Substack evolve, alternative microblogging protocols explored. Resistance against turning issue into spectacle, call for leadership accountability. Debates ongoing regarding API abuse and Substack's alleged scraping of Twitter content. Caution against dismissing plight of laid-off Substack employees."
  },
  {
    "id": 35499065,
    "timestamp": 1681000839,
    "title": "Z-Library to let users share physical books",
    "url": "https://torrentfreak.com/z-library-plans-to-let-users-share-physical-books-through-z-points-230408/",
    "hn_url": "http://news.ycombinator.com/item?id=35499065",
    "content": "Z-Library Plans to Let Users Share Physical Books Through 'Z-Points' * TorrentFreakNewsPiracyPiracy ResearchLaw and PoliticsLawsuitsAnti-PiracyTechnologyContactSubscribeZ-Library Plans to Let Users Share Physical Books Through ‘Z-Points’April 8, 2023 byErnesto Van der SarHome > Opinion Articles > Z-Library appears to be shrugging off a criminal investigation as if nothing ever happened. The site continues to develop its shadow library and, following a successful fundraiser, now plans to expand its services to the physical book market. Z-Library envisions a book 'sharing' market, where its millions of users can pick up paperbacks at dedicated \"Z-Points\" around the globe.With more than 12 million books in its archive, Z-Library advertised itself as the largest repository of pirated books on the Internet.The site has millions of regular readers who find a wealth of free knowledge and entertainment at their fingertips.This success was briefly interrupted late last year when the U.S. Government seized the site’s main domain names. The enforcement action also led to the arrest of two alleged Russian operators of the site, who now find themselves at the center of a criminal investigation.A crackdown of this magnitude usually marks the end of a pirate site, but Z-Library appears to be going in the opposite direction. The site has made a full comeback with a more ‘censorship-resistant’ setup and recently collected tens of thousands of dollars in donations. Next Up: Sharing Paper BooksIn a new message, posted this week, Z-Library thanks its userbase for their generous contributions, noting that it secured all the necessary funds to ensure continued development. Apparently, this includes support for offline sharing. In addition to offering millions of ebooks, Z-Library says that it’s working on a new service that will help users to share physical copies with each other. “Books you have read should not gather dust on your shelf – instead, they can get a second life in the hands of new readers! This helps to preserve the literary heritage and spread the knowledge and ideas contained in books to more people,” they write. Z-PointsThe book lending concept, commonly known as a library, is a few hundred years old already, but Z-Library will upgrade both scale and reach. The idea is to create a global market with dedicated pick-up points for user-donated books.“[W]e want to organize ‘Z-Points’ – collection and storage points for books that will be the link between those who share their books and those who need them. “Book owners who are willing to share them with other users can send books to the nearest Z-Point in their region. And those who need books stored in these points will be able to receive them for their use.”This sounds like a P2P competitor for traditional libraries. Interestingly, however, Z-Library believes that existing libraries are ideally suited to become Z-Points. People can also volunteer to run a Z-Point from their own homes. Running a book lending point will require quite a bit of storage space and organizational effort so fulfillment centers and third-party logistics services are also welcome to join in.By Users, For UsersThe Z-Point idea is still in the planning phase. According to Z-Library, users will be able to send books by mail. These can then be loaned by others and/or sent by mail when requested. This proposal is quite different from the traditional pirate ebook library Z-Library offers now. And loaning a book to someone is generally not seen as copyright infringement either unless it’s a copied ebook. Whether there’s a market for this plan and if it will ever come to fruition has yet to be seen, but based on the comments we’ve read so far, plenty of people seem to like it. Soon after the announcement was made public, hundreds of enthusiastic responses started rolling in. If anything, it shows the global scale of the site, with people suggesting Vietnam, Brazil, Portugal, Colombia, Iran, Uzbekistan, Nigeria, Spain India, Argentina, Egypt, France, Ethiopia, China, and Ghana as ideal Z-Point locations.Questions and SuggestionsThe announcement was posted several days after April 1st, so it appears to be serious. That said, there are plenty of questions that remain unanswered. What are the legal implications, for example, and who covers the costs?“The idea is good but like how would you deal with the logistics and also with cost? Especially when the team is facing legal pursuit how can you hide your identities and do it?[sic]” one commenter writes.Other commenters pointed out that, in many countries, people already organize free libraries to collect and donate books to local communities. Some of these are organized and promoted through the “Little Free Library” project.The Z-Library team says that it welcomes comments and suggestions. For now, there are no concrete plans, but a seed has been planted.Next PostPrevious PostTagged In:z-libraryzlibraryYou Might Also Like:PiracyZ-Library Raises Tens of Thousands of Dollars to Keep its Pirate Library RunningMarch 30, 2023, 09:02 by Ernesto Van der SarPiracyZ-Library Returns on the Clearnet in Full Hydra-ModeFebruary 13, 2023, 11:55 by Ernesto Van der SarAnti-PiracyZ-Library Knockoffs Trigger Dubious DMCA TakedownsDecember 17, 2022, 20:46 by Ernesto Van der SarSubmit a correction or tip.SponsorsPopular Posts‘U.S. Authorities Seize Z-Library Domain Names’House of The Dragon Season Finale Leaks Early on Pirate SitesUS Court Orders Every ISP in the United States to Block Illegal Streaming SitesWhich VPN Providers Really Take Privacy Seriously in 2023?SPARKS Piracy Busts: Facts, Rumors & Fear Point to Something HugeFrom 2 Years ago…Are Cops Playing Music While Being Filmed to Trigger Copyright Filters?Corel Wrongly Accuses Licensed User of Piracy, Disables Software RemotelyPirate Bay Takes Over Distribution of Censored 3D Printable GunTorrentFreak Stats14336Breaking news stories179kSocial media followers19.9kRSS subscribersCopyright· Privacy Policy· VPN Providers· About TorrentFreak",
    "summary": "Z-Library, the largest repository of pirated books, is expanding its services to include a physical book-sharing market, with millions of users able to pick up paperbacks at dedicated \"Z-Points\" around the world. It plans to organise \"collection and storage points\" for books that \"will be the link between those who share their books and those who need them,\" which will require considerable storage space and organisational effort, so fulfillment centres and third-party logistics services are welcome. An announcement posted in the site appears to be serious, with people suggesting Vietnam, Brazil, Portugal, Colombia, Iran, Uzbekistan, Nigeria, Spain, India, Argentina, Egypt, France, Ethiopia, China and Ghana as ideal Z-Point locations, and the site is currently welcoming feedback to improve its service.",
    "hn_title": "Z-Library to let users share physical books",
    "original_title": "Z-Library to let users share physical books",
    "score": 191,
    "hn_content": "Z-Library, a website that has become one of the most visited sites online, is planning to allow users to share physical books through the site; some Hacker News users express concerns about publishers suing the library if it starts to offer bestsellers; others argue that difficult to find or out of print books should be made more readily available by other means, such as being able to scan books easily, to ensure their preservation and access for future readers.Some comments on a Tech Times article discuss the issue of copyright laws and infinite reproducible material, suggesting that such laws need changing for easier access to content in any form readers wish. One user suggests supporting those who facilitate disobedience and ignoring publishers and copyright lobbies that get in the way. However, one user points out that Google tried and failed to solve this problem. Another user suggests incentivizing the scanning of books, and a book is recommended on the topic. The readers of this post are likely to be interested in the possibility of changing copyright laws for more accessible content.Z-Library, a pirate library known for hosting articles and books in violation of copyright laws, has announced plans to launch a real-world book sharing market with millions of users picking up paperbacks at \"Z-Points\" around the globe. While some HN users pointed out existing grassroots booksharing initiatives, others debated the potential impact on publishing companies and the feasibility of such a project. Some expressed skepticism about the success of past plans by entities primarily involved in illegal activity to launch massive real-world initiatives, while others noted the value of libraries and shared access to books in promoting the continued acceleration of human development.E-book licensing model appears cheap, except big publishers have metered licensing, requiring repurchase every 1-2 years. Prices usually vary between 1x-3x the physical price depending on publisher, popularity, and date of publication. Consumers can buy ebooks at 0.5x to 1x of paperback price, while library budgets focus on spending majority on bestsellers. The concept of a library is not new, but there is an increasing recent focus on bestsellers with unfortunate consequences. Piracy may seem like a form of protest due to out of tune ebook pricing and licensing conditions. Private membership libraries predate public libraries and often loaned.",
    "hn_summary": "Z-Library will allow users to share physical books, but publishers may sue the library; some suggest scanning books, changing copyright laws, or incentivizing book scanning. Some debate the feasibility and impact on publishing companies of launching a real-world book sharing market. E-book licensing models have unfortunate consequences, leading to piracy as a form of protest. Private membership libraries predate public libraries and often loaned."
  },
  {
    "id": 35500528,
    "timestamp": 1681022545,
    "title": "Perseus – NextJS alternative in Rust",
    "url": "https://framesurge.sh/perseus/en-US/",
    "hn_url": "http://news.ycombinator.com/item?id=35500528",
    "content": "PerseusPerseusDocsComparisonsPluginsDocsComparisonsPluginsThe Rust framework for the modern webGet started now GitHubExcerptsFullfn index_page&LTG: Html>(cx: Scope, state: &IndexStateRx) -> View&LTG> {  view! { cx,    h1 { (format!(      \"Hello, {}!\",      state.name.get()    )) }    input(      placeholder = \"Name\",      bind:value = state.name    )    a(href = \"about\") { \"About\" }  }}#[derive(Serialize, Deserialize, Clone, ReactiveState)]#[rx(alias = \"IndexStateRx\")]struct IndexState {  name: String,}// This function will be run when you build your app, to generate default state// ahead-of-time#[engine_only_fn]async fn get_build_state(_info: StateGeneratorInfo<()>) -> IndexState {  IndexState {    name: \"User\".to_string(),  }}Generate state, on your termsPerseus apps can generate state whenever they like and pass it to Sycamore, one of the fastest web frameworks in the world.ExcerptsFullfn post_page&LTG: Html>(cx: Scope, state: &PostRx) -> View&LTG> {  view! { cx,    h1 { (state.title.get()) }    p { (state.author.get()) }    div(      dangerously_set_inner_html = &state.content.get()    )  }}// ...// This function will be run for each path under `/post/` to generate its state#[engine_only_fn]async fn get_build_state(  StateGeneratorInfo { path, .. }: StateGeneratorInfo<()>,) -> Result&LTPost, BlamedError&LTMyError>> {  let raw_post = match get_post_for_path(path) {    Ok(post) => post,    // If the user sends us some bogus path with incremental generation,    // return a 404 appropriately    Err(err) => {      return Err(BlamedError {        blame: ErrorBlame::Client(Some(404)),        error: MyError(err),      })    }  };  let html_content = parse_markdown(raw_post.content);  let post = Post {    title: raw_post.title,    author: raw_post.author,    content: html_content,  };  Ok(post)}#[engine_only_fn]async fn get_build_paths() -> BuildPaths {  BuildPaths {    // These will all become URLs at `/post/&LTname>`    paths: vec![      \"welcome\".to_string(),      \"really-popular-post\".to_string(),      \"foobar\".to_string(),    ],    // Perseus supports helper state, but we don't need it here    extra: ().into(),  }}I18nInternationalization that just worksJust add translations using Fluent, and your app can be set up in seconds in multiple languages, with automatic user locale detection.ExcerptsFull.locales_and_translations_manager(      \"en-US\",       // Default locale      &[\"fr-FR\", \"es-ES\"], // Other supported locales    )// ...// Our landing page. Going to `/` will cause a redirect to `/en-US`,// `/es-ES`, or `/fr-FR` based on the user's locale settings in their browser,// all automatically. If nothing matches, the default locale (`en-US`) will be// used.fn index_page&LTG: Html>(cx: Scope) -> View&LTG> {  view! { cx,    h1 { (t!(cx, \"greeting\")) }  }}// `translations/en-US.ftl`://   greeting = Hello, world!// `translations/es-ES.ftl`://   greeting = ¡Hola, mundo!// `translations/fr-FR.ftl`://   greeting = Bonjour, le monde!You want options? We got options.Perseus comes with a built-in plugins system and full customizability of almost every part of the system. Static exporting? Serverful deployment? Fetch data by carrier pigeon? Easy.# 🚩 Get ready!> perseus init my-app# 📦 All static?> perseus export -sw[1/3] 📦 Exporting your app's pages...✅[2/3] 🏗️ Building your app to Wasm...✅[3/3] 🛰️ Your exported app is now live at &LThttp://127.0.0.1:8080>!# 📡 Using some more advanced features?> perseus serve -w[1/4] 🔨 Generating your app...✅[2/4] 🏗️ Building your app to Wasm...✅[3/4] 📡 Building server...✅[4/4] 🛰️ Your app is now live on &LThttp://127.0.0.1:8080>! To change this, re-run this command with different settings for `--host` and `--port`.# 🧪 Testing your app's features?> perseus test# 🔎 Investigating some errors?> perseus snoop wasm-build# 🎉 Ready to send it to the world?> perseus deployFast. Crazy. Fast.Underlying platform? Rust.Target platform? WebAssembly.Lighthouse scores? 💯100Performance (Desktop)97Performance (Mobile)100Best PracticesGet started with Perseus today!> cargo install perseus-cli> perseus new my-project> perseus serve -w# Ready to deploy?> perseus deploy# And send `pkg/` to your server! 🥳DocsGitHubAPI DocsCrates.ioMatrixDiscordComparisons© arctic-hen7 2021-2023, see license here.",
    "summary": "Perseus is a Rust framework for modern web apps that generates state on-demand and passes it to Sycamore, with Fluent-based I18n added for multilingual functionality, plugins for customization, all in WebAssembly for high performance, and exportable/statically served, easy to install, and user-friendly.",
    "hn_title": "Perseus – NextJS alternative in Rust",
    "original_title": "Perseus – NextJS alternative in Rust",
    "score": 188,
    "hn_content": "Perseus, a NextJS alternative written in Rust, is being discussed on Hacker News. Some users prefer using JavaScript for front-end development because Rust's tooling and borrow checker can be cumbersome. However, several commenters note that Rust is making inroads in the lower levels of the JS stack, and Rust frameworks like Perseus could benefit by incorporating JS/TS as a last-mile scripting language. Some developers think that using Typescript could even be a gateway to Rust, whereas others believe that Rust is too expensive to adopt for wider adoption.An analysis shows that Rust has the fastest cold starts of AWS Lambda, while Go is not far behind on warm starts, though these are only for hello world programs without I/O. Some users believe that Go's cold start is slower because it has a runtime to boot up before executing the first line of code in process exec. However, Rust is versatile and could end up being great for almost any task given a few more years to mature its frameworks. Meanwhile, some users feel like they are wasting their time by not learning Rust or Zig.Experts discuss the merits of learning Rust versus Go. Some see Rust as more suitable for low-level programming and system and tooling work, while others view Go as better suited for web development due to its simpler dynamic dispatch and garbage collector. One user suggests learning a variety of languages to broaden horizons, while another emphasizes the importance of fun in programming. The consensus is that the value of a programming language depends on where one lives and wants to work.The article discusses the adoption of Rust as a good language for major projects, with less issues of package abandonment, and is future safe due to recent developments. However, Rust jobs may be less common in certain regions, so some may not see the value in learning the language. The article also mentions Perseus, a state-driven web development framework for Rust that recently went stable. There is confusion around what \"state-driven\" means, but it is similar to React. The discussion also touches on the difference between server-side rendering (SSR) and static site generation (SSG) and how to apply them to different infrastructure.A discussion on Hacker News centers around new ways of client web app development that combine server-side rendering for performance with dynamic client handling for interactivity. While there are concerns about scalability, at scale, cloud computing services like Cloudflare Workers and CloudFront offer alternatives to Vercel's pricing model. Notably, there is debate over the distinction between static site generators (SSGs) and server-rendered apps (SSRs), with static internationalization (i18n) possible with SSGs. Despite the advantages of SSGs, server-side development requires more complex infrastructure, with implications for hosting, personalization, security, and performance.Discussion on the difference between server-side rendering (SSR) and static site generation (SSG) in NextJS. While some users view SSG as a static website, it is actually more complex and allows for pre-generating files per path, providing benefits of SSR on the first page load. However, the distinction between SSR and SSG is critical for infrastructure planning, and some users feel that it is being downplayed. NextJS has both SSG and SSR capabilities, but some commenters argue that they should not be completely separate. Additionally, some users question the idea that SSG is always more limited than SSR.The release of a new full-stack framework that compiles front-end to WebAssembly in Rust called Perseus has caught the attention of tech-savvy individuals with a substantial interest in a further middleground between traditional full-stack frameworks Next, SvelteKit, and Fresh; but has yet to catch on with wider audiences. Users have commented on the code apparently requiring a considerable amount of boilerplate and being somewhat tough for real-world usage, yet has potential to be a faster alternative to Svelte due to Sycamore, offering an alternative to NextJS despite some feature discrepancies, and being disruptive in web-based industries.HN users discuss the importance of finding the right tool for the job and note that there are REST APIs and frontend frameworks for almost every programming language, but Rust has better marketing. One user asks if there is an equivalent to a Prolog package in Go, while another points out that Next.js uses a compiler written in Rust. However, another user raises concerns about the practicality of replacing JS code with a stack that requires a different language and how to build plugins for rustified frameworks and build systems.",
    "hn_summary": "Users discuss Perseus, a Rust-based alternative to NextJS, with some preferring JS for front-end development due to Rust's tooling. Despite this, Rust's inroads in the lower levels of the JS stack suggest potential in the incorporation of JS/TS in Rust frameworks like Perseus. Discussion arises around Rust's merits compared to Go, with some users seeing Rust as more suitable for low-level programming and others seeing Go as better suited for web development. The value of a programming language depends on where one lives and wants to work. The release of Perseus catches the attention of tech-savvy individuals as a possible faster alternative to Svelte but faces criticism for being tough for real-world usage."
  },
  {
    "id": 35506069,
    "timestamp": 1681071430,
    "title": "A Baby GPT",
    "url": "https://twitter.com/karpathy/status/1645115622517542913",
    "hn_url": "http://news.ycombinator.com/item?id=35506069",
    "content": "",
    "summary": "N/A",
    "hn_title": "A Baby GPT",
    "original_title": "A Baby GPT",
    "score": 180,
    "hn_content": "An HN user proposes using binary regular expressions to infer deep relationships between words in languages. However, another user argues that GPT isn't working at the level of words but at that of meaning and intent. Andrej Karpathy, the creator of the baby GPT, likens the model to a Markov chain. Adamnemecek, known for his work on Hopf algebras, recommends checking out the discord for more information while another user finds the topic opaque and unintuitive.An expert recommends a place to share better mathematical tools, including the discovery of bivactor.net. An HN user asks about the implications for the general public, to which another user suggests that Hopf algebras provide better autodiff and are better for various models. No notable new technology or release mentioned.",
    "hn_summary": "An HN user proposes using binary regular expressions for language relationships, while another argues for meaning and intent. Creator of baby GPT likens to Markov chain. Expert recommends better mathematical tools. HN user asks about implications for general public. No notable new tech or release."
  },
  {
    "id": 35503784,
    "timestamp": 1681054981,
    "title": "Two types of software engineers",
    "url": "https://registerspill.thorstenball.com/p/two-types-of-software-engineers",
    "hn_url": "http://news.ycombinator.com/item?id=35503784",
    "content": "Two types of software engineers - by Thorsten BallSubscribeSign inShare this postTwo types of software engineersregisterspill.thorstenball.comCopy linkTwitterFacebookEmailTwo types of software engineersOne assumes it's easy because it's a non-technical problem, the other assumes that's why it's hardThorsten Ball12 hr ago187Share this postTwo types of software engineersregisterspill.thorstenball.comCopy linkTwitterFacebookEmailHere's something I've been kicking around in my head for a few weeks, a tiny theory I have of how people think about software engineering.According to my theory, there are two types of software engineers:Type 1, when presented with a problem, thinks: \"easy, people can just do X.\"Type 2, when presented with the same problem, thinks: \"very hard, because it requires people to do X.\"Type 1 assumes something's easy if it's not a technical problem, because \"we can just ask people to do X.\" Type 2 thinks it's hard because it is not technical.Example:Type 1: \"easy, we can just ask people not to deploy at this time\"Type 2: \"wait, but what do we do _when_ people deploy at this time?\"Another example:Type 1: \"easy, we just document this new process and ask people to follow it\"Type 2: \"how do we ensure people even read this?\"Another one:Type 1: \"easy, we just build a system that these 4 parties will use and that ensures that no one cheats on the other one\"Type 2: \"this is really hard because we need to get 4 parties to use the same system\"I'm not entirely sure yet on where exactly to draw the line between type 1 and 2 or how to define them precisely. I told you: tiny theory.Painting in really broad strokes, though, I'd say that type 1 doesn't take people into account and type 2 knows that at the heart of all of their engineering work (and problems) are people.Type 1 believes in capital E Engineering, where there are cold, hard truths; there's math & physics; it's applied science. It's what you see in The Martian.Type 2 would probably ask: \"yeah, but what if the guy in The Martian didn't have to build this stuff for himself but for others?\"Now, as you might have noticed, I'm not-so-subtly hinting at the fact that the type 2 engineer knows a bit more but maybe you also wonder whether you can’t smell a hint of cynicism in there and think that it's me admitting defeat — we can't build nice things because it all becomes a mess as soon as people are involved.Here's the kicker though: it's the opposite! It's not cynicism, type 2 engineering is embracing the fact that we build with and for people and taking on an even bigger challenge of doing work despite the chaos this produces.Because, see, when it gets messy, that's where it gets real; that’s where the actual work begins, when you go from drawing board to actually shipping something of value and with impact to someone.It's embracing the fact that people are not machines and no matter how often they say they're rational thinkers, you still know that even the strongest choose-the-best-tool-for-the-job advocates will sometimes choose a tool because, well, the GIF in the README was cooler. It's knowing that no one will read your documentation if you don't make it entertaining and easy to read. It's leveraging the fact that people will install security updates to get new emojis. It's anticipating that, no, not everybody will follow the best practice because everybody has a Thursday afternoon that feels like it should be Friday evening.Let me add one more on top: I'd argue that it's precisely because of how messy it can get do the things we build become beautiful.Until next week!Thanks for reading Register Spill! Subscribe if you want to get these emails every week.Subscribe7Share this postTwo types of software engineersregisterspill.thorstenball.comCopy linkTwitterFacebookEmail7 CommentsHasen JudiWrites Hasen Judi 9 hr agoThe first type is very common.They are the reason everything is complex and fragile.\"Easy, let the use edit this config file\"\"Just create a docker-compose file with this content\"\"Just put the package directory here and the templates directory there\"Death by a thousand cuts. Every cut is just a tiny \"just do that\" kinda statement.The result is that to get anything working you have to remember a 100 tiny annoying details with no feedback mechanism to tell you whether you got everything right or forgot something critical.This is why most programming jobs suck the soul right out of you.Expand full commentReplyRich Sparks15 min agoI like the quote, “If you want someone to do something, make it easy for them to do it.”That seems obvious, but it could press the first type of engineer to think about “them”. That is, who is going to do the thing, and what do they know? Maybe they’re not a programmer who understands the internal model of the system. Maybe they’re someone in a hurry, who is actually trying to do some other job, but needs to use the system to do one part of the job. Everybody should assume their customer isn’t going to read the manual. All the customers are used to the magic of google where you type something in and get a whole bunch of help in the blink of an eye.Expand full commentReply5 more comments…TopNewCommunityNo postsReady for more?Subscribe© 2023 Thorsten BallPrivacy ∙ Terms ∙ Collection notice Start WritingGet the appSubstack is the home for great writing    This site requires JavaScript to run correctly. Please turn on JavaScript or unblock scripts",
    "summary": "The article discusses two types of software engineers: Type 1, who assumes a problem is easy if it's not technical, and Type 2, who assumes it's hard because it involves people. Type 1 believes in capital E Engineering, whereas type 2 focuses on people and sees engineering problems as involving people. While Type 1 is more common, Type 2 engineers understand that engineering involves chaos and complexity and aim to build despite these challenges. The article includes some examples to illustrate the differences, but the author has not yet defined or drawn the line between the two types precisely.",
    "hn_title": "Two types of software engineers",
    "original_title": "Two types of software engineers",
    "score": 174,
    "hn_content": "A Hacker News post discusses the differences between two types of software engineers who approach their work with different mindsets. However, a Type 3 engineer is introduced: one that ignores the larger system and only focuses on writing software. The post highlights the problem of tech companies prioritizing growth and engagement over profitability and tangible improvements. Some commenters suggest that engineers must also understand and take responsibility for their product’s definition, but good product management can still add value. The metaphor of software as a form of literacy is questioned by a commenter, and another compares Type 3 engineers with the failed idea that everyone will drive a car, so everyone should be able to fix a car.Software engineers may be myopic and arrogant, thinking they can solve any human problem through machines, but sometimes AI can solve problems that were previously unsolvable. Managers who think they can offload difficult tasks to employees have missed the tide, as coders are the new managers. Human fallacies impact both managers and engineers, and non-functional requirements are difficult to reflect in code. Software is giving organizations a generational opportunity to rework themselves, and success can often depend on one's manager. Attempts to automate humans through more rules and policies can lead to failure as companies get bigger.An HN user asks how to offload to silicon periodically creating a new private key to sign future releases, but keep it far away from builds until it's actually used, while putting its public key on the builds. Other users suggest solutions like Vault. Some comments diverge into discussions of the type of software engineer one is and the complexity of software created. One user acknowledges the need to reduce the best possible outcome of their work in favor of the best likely outcome, while others debate the merits of new versus boring technology.Developers should build a system that can handle the load that is expected and some scaling; overcomplicating software is not helpful. Without explicit focus on what the end user needs, overly complicated, half-assed products will be created. Documentation, especially for configuration and operation of the software, is often missing and can cause delays. Type 2 engineering embraces building with and for people, but some use it as an excuse to not do something or draw out simple conversations. The optimal approach is somewhere between Type 1 and Type 2 engineering.The article discusses the dichotomy of relying on people to follow rules versus implementing automated solutions. An executive's comment highlights the importance of striking a balance in designing mandatory tools, and some comments suggest that there may be problems not worth fixing through automation. The debate focuses on evaluating the extent to which formalized processes can guarantee that humans will follow the desired path. In the end, successful software engineering involves diagnosing the dynamics of both technical and social systems, knowing when to establish guidelines instead of rigid rules, and aligning everyone on common goals.A discussion on Hacker News reveals two types of software engineers, Type 1 who prioritize technical challenges over user experience, and Type 2 who consider people at the heart of their work; there is debate on whether one type is better than the other, but many believe both are necessary depending on the context; some suggest that the two types reflect the balance between innovation and stability in a team; discussions also touch on the importance of balancing risks, knowing one's target audience, and continuously questioning assumptions.Software engineers can be grouped into those who think in dichotomies and those who don't, but this categorization is overgeneralizing. One HN user suggests dividing engineers into \"naive\" and \"experienced.\" Another user states that the hardest problem in software engineering is non-technical, such as convincing people about a technical strategy. Some users note the importance of understanding the needs and dynamics of the larger business when working on software systems. One user emphasizes the need to find the root cause of a problem before proposing solutions. However, the article acknowledges the difficulty of generalization and urges readers to take the post as \"food (snack?) for thought.\"",
    "hn_summary": "A discussion on two types of software engineers, including Type 3, and the importance of understanding product management. Debate on balancing innovation and stability, and the need for proper documentation. Dichotomy of relying on people versus implementing automated solutions in software engineering. Importance of aligning everyone on common goals and understanding larger business needs. Categorization of software engineers questioned, with emphasis on finding root cause of problems. Post serves as food for thought."
  },
  {
    "id": 35500197,
    "timestamp": 1681016592,
    "title": "Advanced Linux Programming (2001)",
    "url": "https://mentorembedded.github.io/advancedlinuxprogramming/",
    "hn_url": "http://news.ycombinator.com/item?id=35500197",
    "content": "Advanced Linux ProgrammingThis is the official home page for Advanced LinuxProgramming by CodeSourceryLLC, published by New Riders Publishing.OverviewIf you are a developer for the GNU/Linux system, this book will help you to:Develop GNU/Linux software that works the way users expect it to.Write more sophisticated programs with features such as multiprocessing, multi-threading, interprocess communication, and interaction with hardware devices.Improve your programs by making them run faster, more reliably, and more securely.Understand the peculiarities of a GNU/Linux system, including its limitations, special capabilities, and conventions.Advanced Linux Programming is published underthe Open Publication License, Version 1, no options exercised. (Due to an oversight in finalproduction, the copyright notice on the book is incorrect.)The full text may be downloaded from this site. Code samples in the bookare covered by the GNU GeneralPublic License and are also available.On This Web SiteAbout the BookDownloadsErrataResources for GNU/Linux ProgrammersTranslationsFrenchA partial translation into French is available at  http://www.advancedlinuxprogramming-fr.org/. Problems with this web site?  File an issue on github.",
    "summary": "'Advanced Linux Programming' by CodeSourceryLLC is a book that helps GNU/Linux developers create software with user-friendly features, advanced capabilities such as multi-threading, interprocess communication, and hardware device interaction, and overall program improvement. Additionally, this book teaches developers how to work within the GNU/Linux system environment, including its unique limitations, conventions, and capabilities. This book is available for download under the Open Publication License, Version 1, and comes with access to covered GNU General Public License code samples. Errata and translations of the book are available.",
    "hn_title": "Advanced Linux Programming (2001)",
    "original_title": "Advanced Linux Programming (2001)",
    "score": 173,
    "hn_content": "Advanced Linux Programming, a book first published in 2001, is a top discussion topic amongst Hacker News users despite being almost 20 years old. Readers are interested to know how relevant the content remains in 2021 and whether a new edition should be released. Some users suggest that outdated sections, including those discussing /proc, IDE and devices, should be updated in a new edition. Despite this, the book remains a relevant and useful resource for Linux API development. Users recommend brushing up on C before diving in, but still believe the content is accessible for those with basic knowledge.Aria2 is a download application that splits files to bypass server speed caps. The program allows users to resume downloads from where they left off, even when downloads temporarily pause. Advanced Linux Programming, despite the name, is not an advanced book but rather one for beginners. The book starts with a C \"Hello World\" chapter; while confusing, publishers often use \"advanced\" or \"beginner\" in the title for marketing purposes. Finally, a user points out that the book was published in 2001 when discussing \"Advanced Linux Programming.\"",
    "hn_summary": "Hacker News users discuss the relevance of 2001 book, \"Advanced Linux Programming\" in 2021. Some users suggest updating outdated sections. Despite being a beginner's book, it remains a useful resource for Linux API development. Aria2 download application serves as an alternative to server speed caps."
  },
  {
    "id": 35501845,
    "timestamp": 1681041011,
    "title": "A CERN for Open Source Large-Scale AI",
    "url": "https://www.openpetition.eu/petition/online/securing-our-digital-future-a-cern-for-open-source-large-scale-ai-research-and-its-safety",
    "hn_url": "http://news.ycombinator.com/item?id=35501845",
    "content": "LAION e.V. has launched a petition for the establishment of an international, publicly funded, open-source supercomputing research facility for AI, similar to CERN, which would house at least 100k accelerators operated by experts from the ML and supercomputing research community and overseen by democratically elected institutions. The initiative seeks to democratize AI research, promote AI safety and security research for the advancement of the greater good while fostering innovation and ensuring data security. The effort aims to secure our society's technological independence while protecting democratic principles from being undermined by a select few large corporations that operate with little transparency or public accountability.Petition platform, openPetition, aims to strengthen citizen participation and support petitions for change. The platform remains independent, allowing individuals to share their concerns and engage in dialogue with politics. An HN user noted that 19% of the supporters come from laion.ai, while 64% remain unknown. The platform offers guidelines and transparency on legal aspects, data privacy, and terms of use. Additionally, openPetition provides services and job opportunities, while the press and blog sites offer insight into the platform's activities. Citizens are encouraged to donate to support the petition, which has gained traction on Hacker News.",
    "summary": "LAION e.V. has launched a petition for an international, publicly funded, open-source supercomputing research facility for AI, similar to CERN, to democratize AI research and promote safety and security research. Platform openPetition aims to strengthen citizen participation and support petitions for change. The initiative aims to protect democratic principles from being undermined by a select few large corporations. An HN user noted that 19% of supporters come from laion.ai, while 64% remain unknown. Citizens are encouraged to donate to support the petition that has gained traction on Hacker News.",
    "hn_title": "A CERN for Open Source Large-Scale AI",
    "original_title": "A CERN for Open Source Large-Scale AI",
    "score": 140,
    "hn_content": "An openpetition.eu article highlights the need for an open source, large-scale AI initiative, stating that Europe is falling behind the competition in AI development, and calling for a CERN-like project to promote collaboration amongst researchers, academics and entrepreneurs from across the continent. Responding to a point about government regulation as a barrier, another user countered by pointing out that American firms have been successful due to their domestic market alone and proximity to 'hotbeds of VC money', and that AI researchers must collaborate, and perform big data processing which only large capital investments can provide. Another user opined that an open source project would be necessary for academia to retain AI researchers and promote work that aims to benefit society as a whole, instead of merely benefiting corporate stockholders.An idea is proposed to develop AI while avoiding unaccountable parties controlling this powerful force for the generation of society's wealth and benefits. CERN's success as a multinational institution makes it an attractive candidate to handle the start of an AI project as a new phenomenon, although a model will need to be evolved. Some comments view this initiative as unnecessary as the market will provide corresponding incentives. It is also noted that the CERN model may not apply to AI, and notable researchers from EU taking a different path to secure AI's future. Kickstarter is not recommended as a funding source due to their opposition to some AI projects. The prevailing thought is that the funding required is beyond what can be raised through crowdfunding channels. AI is an interdisciplinary industry with interconnected issues, including energy supply stability, the non-monopolistic semiconductor industry, and the transformation of existing businesses, governments, and societies in general.",
    "hn_summary": "An openpetition.eu article highlights Europe's need for a CERN-like open source initiative to promote collaboration amongst AI researchers, academics, and entrepreneurs. Collaboration is needed to perform big data processing with large capital investments. Open source projects are necessary to retain AI researchers and benefit society rather than corporate stockholders. CERN's success makes it an attractive model, though some suggest the market provides adequate incentives. The interdisciplinary nature of AI requires consideration of interconnected issues."
  },
  {
    "id": 35504053,
    "timestamp": 1681056739,
    "title": "Permafrost engine – An OpenGL RTS game engine written in C",
    "url": "https://github.com/eduard-permyakov/permafrost-engine",
    "hn_url": "http://news.ycombinator.com/item?id=35504053",
    "content": "## ![Logo](docs/images/logo.png) ##Permafrost Engine is an OpenGL 3.3 Real Time Strategy game engine written in C. It is made in the image of old classics, but incorporating some modern ideas.## Engine Showcase ##![everglory-banner](docs/images/everglory-banner.png)EVERGLORY is the flagship game developed using Permafrost Engine. Download the free (or donate what-you-want) demo on [itch.io](https://spb.itch.io/everglory) or on [Steam](https://store.steampowered.com/app/1309720/EVERGLORY/). With the demo you also get access to all the scripts and assets powering the gameplay to learn from and modify as you wish.![screenshot-01](docs/images/screenshot-01.png)![screenshot-02](docs/images/screenshot-02.png)![screenshot-03](docs/images/screenshot-03.png)![screenshot-04](docs/images/screenshot-04.png)![screenshot-05](docs/images/screenshot-05.png)![screenshot-06](docs/images/screenshot-06.png)## Engine Summary ##* OpenGL 3.3 programmable pipeline (more modern extensions used where available)* Custom ASCII model format with Blender export script* Skeletal animation with GPU skinning* Phong reflection model with materials* Directional light shadow mapping* Batched rendering with dynamic batches* Ringbuffer-based streaming of data to GPU* RTS camera, FPS camera* Rendering of tile-based map parsed from ASCII file* Water rendering (including reflection, refraction, soft edge effects)* Export/Import of game entites to/from ASCII files* Engine internals exposed to Python 2.7 for scripting* Event system* UI framework (Nuklear-based)* Efficient raycasting* Map/Scene editor* Pause/Resume system* Fast rendering of huge maps* Map navigation graph/grid generation* Implementation of 'boids' steering/flocking behaviours* Hierarchial flow field pathfinding* Handling of dynamic obstacles in pathfinding* Dynamic collision avoidance of multiple entities using Hybrid Reciprocal Velocity Obstacles and the ClearPath algorithm* Pathfinding of different kinds/sizes of units (using \"navigation layers\")* Efficient spatial indexing using a quadtree* Efficient real-time tracking of entity membership to dynamic spatial regions* Audio system supporting positional effects and multiple channels of global effects* RTS minimap* RTS-style unit selection* RTS unit combat system* RTS fog-of-war system* RTS base-building mechanics* RTS resource gathering (and transporting) mechanics* Ranged combat using an efficient projectile physics simulation* Support for different resolutions and aspect ratios* Configurable graphics settings* Serialization and deserialization of the entire Python interpreter state* Saving and restoring of any engine session, including all Python-defined state* Multithreaded: simulation and rendering in a 2-stage pipeline* Advanced debug visualizations and profiling instrumentatation* Fiber system for putting work in lightweight tasks that are scheduled in userspace* Fiber-backed Python tasks, allowing cooperative multitasking logic in Python* Cross-platform (Linux and Windows)* Windows launcher to automatically capture a minidump and stdout, stderr logs on application error## Dependencies ##* SDL2 2.0.10* GLEW 2.1.0* python 2.7.17* openal-soft 1.21.1* stb_image.h, stb_image_resize.h* khash.h* nuklear.hAll dependencies can be built from source and distributed along with the game binary if desired. Python is built with a subset of the default modules and packaged with a trimmed-down stdlib.## Building Permafrost Engine ### For Linux ####1. `git clone https://github.com/eduard-permyakov/permafrost-engine.git`2. `cd permafrost-engine`3. `make deps` (to build the shared library dependencies to `./lib`)4. `make pf`Now you can invoke `make run` to launch the demo or `make run_editor` to launch the map editor.Optionally, invoke `make launchers` to create the `./demo` and `./editor` binaries which don't require any arguments.### For Windows ####The source code can be built using the mingw-w64 cross-compilation toolchain (http://mingw-w64.org/doku.php) using largely the same steps as for Linux. Passing `PLAT=WINDOWS` to the make environment is the only required change.The compliation can either be done on a Linux host, or natively on Windows using MSYS2 (https://www.msys2.org/).1. `git clone https://github.com/eduard-permyakov/permafrost-engine.git`2. `cd permafrost-engine`3. `make deps PLAT=WINDOWS`4. `make pf PLAT=WINDOWS`5. `make launchers PLAT=WINDOWS`## License ##Permafrost Engine is licensed under the GPLv3, with a special linking exception.## Devlog ##Follow the development of Permafrost Engine and EVERGLORY on [YouTube](https://www.youtube.com/channel/UCNklkpsPnNpRhC9oVkpIpLA).[Indie RTS Devlog #1: Introducing Permafrost Engine](https://youtu.be/0dEttWferm8)[Indie RTS Devlog #2: Saving The Python Interpreter](https://youtu.be/ch-zjn05gxQ)[Indie RTS Devlog #3: Group Pathfinding](https://youtu.be/ALL7AQ1MRas)[EVERGLORY: Teaser Trailer #1](https://youtu.be/yTJ7wTJy7jc)[Indie RTS Devlog #4: Fog of War](https://youtu.be/2rXElWzAGrY)[Indie RTS Devlog #5: Performance Optimization](https://www.youtube.com/watch?v=HV_CLHkpXpY)[Indie RTS Devlog #6: Fibers, Async Jobs](https://www.youtube.com/watch?v=eCJg4ljHhD8)[Indie RTS Devlog #7: Main Menu UI, Loading Missions](https://www.youtube.com/watch?v=V9unCfZheJ4)[Indie RTS Devlog #8: Python Tasks + Making Pong!](https://www.youtube.com/watch?v=wl0jh-17uTA)[Indie RTS Devlog #9: Base Building](https://www.youtube.com/watch?v=U3lvwZfXss0)[Indie RTS Devlog #10: Demo Gameplay](https://www.youtube.com/watch?v=Nh8FBpvbKUc)[Indie RTS Devlog #11: Resource Gathering, Game Design](https://www.youtube.com/watch?v=e3jsymx97LE)[Indie RTS Devlog #12: Crafting Units](https://youtu.be/JqGh_XJstk8)[Indie RTS Devlog #13: Large Unit Pathfinding](https://youtu.be/UorUpScWLvo)[Indie RTS Devlog #14: Projectiles, Big Battles](https://youtu.be/IUolIJX6zpk)[EVERGLORY - Official Trailer (2021 Indie RTS)](https://youtu.be/xleJeiOHHh4)## Comments/Questions ##Comments or questions regarding the project or the source code? E-mail: edward.permyakov@gmail.com.Discuss EVERGLORY and its' development on [Discord](https://discord.gg/jSQ8M6C). If you have a _useful_ fix for a _non-trivial_ engine issue, feel free to make a PR. Be warned that I will scrutinize every patch to make sure it meets my personal quality standards for the engine code. It you wish to evelove the engine in some way and want the changes to be upstreamed, then do get in touch to discuss it.",
    "summary": "Permafrost Engine is an OpenGL 3.3 Real Time Strategy game engine written in C, made in the image of old classics but incorporating some modern ideas. EVERGLORY is the flagship game developed using Permafrost Engine, featuring the engine's capabilities with first-hand game experience. The engine summary includes a list of OpenGL and Python features, RTS mechanics, and cross-platform capabilities. The license for Permafrost Engine is GPLv3, with a special linking exception. Building instructions are provided for both Linux and Windows. A devlog and email for questions/comments regarding the project or source code are provided for interested users.",
    "hn_title": "Permafrost engine – An OpenGL RTS game engine written in C",
    "original_title": "Permafrost engine – An OpenGL RTS game engine written in C",
    "score": 139,
    "hn_content": "Open-source game engine Permafrost built on OpenGL and written in C has gained 139 points on Hacker News. Users offered critiques on the font clarity of Everglory, the game developed using Permafrost. One user asked how Permafrost compares to other popular RTS engines like 0 A.D. and Spring. Another commenter shared the importance of developers testing their games on smaller screens, specifically the upcoming handheld Steam Deck. Multiple users expressed hope for a revival of the RTS genre and game designers offered insights into making mobile RTS games work.Users are discussing various open-source RTS engines, including Spring RTS and its use in games like Beyond All Reasons. The use of Python 2 instead of newer counterparts like Lua is questioned due to its age, but reasons include easier embedding. A mention of another open-source implementation of the Frostbite engine is noted.",
    "hn_summary": "Open-source Permafrost engine gains attention on HN for a new open-source RTS game. Everglory game's font clarity criticized. Comparison requested with other RTS engines. Developers' testing on handheld screens is important. Hope for RTS genre's revival. Users discuss open-source RTS engines and languages used. Mention of another open-source Frostbite engine implementation."
  },
  {
    "id": 35504402,
    "timestamp": 1681059244,
    "title": "Closing a stale SSH connection",
    "url": "https://davidisaksson.dev/posts/closing-stale-ssh-connections/",
    "hn_url": "http://news.ycombinator.com/item?id=35504402",
    "content": "Closing a stale SSH connection | DIDEVDIDEVAbout MeSearchTagsHome Â» PostsClosing a stale SSH connectionApril 4, 2023 Â· 2 min Â· 347 words Â· David Isaksson | Found a typo?Suppose you’re connected to a remote host with SSH and after a while the SSHsession goes stale. The terminal is unresponsive and no keypress seem to takeeffect. There might be something with the network, the remote host isrestarting or maybe your machine has been in hibernation, there could bemultiple reasons for a stale session.The first solution that might come to mind is to just close the terminalemulator and create another one, but there is a better way.SSH escape sequences#Before I show the trick we take a quick detour and explore a kind of hiddenfeature that is implemented in many of the available SSH clients.Built in to the SSH client are multiple hidden commands that can be triggeredwith a so called escape sequence. These commands can be access by acombination of the tilde prefix (~) followed by the command.For example ~? print the help message containing all of the supported escapesequences:david@remote-host:~$ ~?Supported escape sequences: ~.  - terminate session ~B  - send a BREAK to the remote system ~R  - request rekey ~#  - list forwarded connections ~?  - this message ~~  - send the escape character by typing it twice(Note that escapes are only recognized immediately after newline.)Pay extra attention to the last line;(Note that escapes are only recognized immediately after newline.)This means that for the escape sequence to take effect a preceding newline isrequired.Also, a small note for people using a keyboard with a nordic layout; Totype the tilde character, press AltGr+^ <Space>. I know that this tripped meup when I first learned about escape sequences.The “terminate session” escape sequence#So, back to the initial problem.As the help message stated above we can close the session with ~.. Andremember, press enter a couple of times before initiating the sequence:david@remote-host:~$ ~.david@remote-host:~$ Shared connection to remote-host.davidisaksson.dev closed.david@local:~$ echo $?255From here we can try to initiate the connection again, or just reuse the terminal.Discuss on Hacker NewsSSHCLIÂ« PrevBackup files quick with Bash's brace expansionNext Â»Downloading Jenkins artifacts via the CLI© 2023 DIDEVPowered byHugo &    PaperMod",
    "summary": "The post discusses how to close a stale SSH session, stating that while the first solution might be to close the terminal emulator, there is a better way using built-in SSH escape sequences. The post explains how the tilde (~) prefix followed by a command can trigger multiple hidden commands in SSH clients, including the 'terminate session' command (~.). The post notes that attention should be given to the fact that a preceding newline is required, and offers a small note for people using a keyboard with a nordic layout to type the tilde character. The post ends with a discussion of what to do after using the 'terminate session' escape sequence.",
    "hn_title": "Closing a stale SSH connection",
    "original_title": "Closing a stale SSH connection",
    "score": 136,
    "hn_content": "A HN user gives a tip on how to avoid havoc on a remote server caused by a broken SSH connection. Another HN user points out the problem with using the tilde (~) key on Nordic layouts but provides a workaround. An HN user suggests configuring the EscapeChar in the ssh configuration to avoid using tilde (~). There is a discussion on the SSH manpage, jumping hosts feature, and dealing with stale SSH connections. A user expresses a wish for having a \"sticky\" SSH session that doesn't get lost due to sleep or network issues.HN users provide tips for efficient SSH connections. They suggest using autossh for auto-attach to a persistent tmux session, whereas Mosh allows changing port forwarding without reconnecting. Users clarify some technicalities around the encryption used in Mosh, which uses standard AES-128 in OCB3 mode. For completeness, some comments offer additional tips such as filtering out strange behavior in randomly generated passwords and using workarounds for login shell issues when using BusyBox. However, some commenters caution against using Alpine Linux due to potential unstable configurations.",
    "hn_summary": "An HN user gives an SSH tip. Another points out a layout issue but provides a workaround. Configuring EscapeChar is suggested. Discussion on SSH manpage, jumping hosts, and SSH connections. Sticky SSH session is wished for. Autossh recommended for auto-attach, and Mosh for changing port forwarding. Encryption details and additional tips provided. Caution against using Alpine Linux."
  },
  {
    "id": 35503928,
    "timestamp": 1681055844,
    "title": "Flatcar Container Linux",
    "url": "https://www.flatcar.org/",
    "hn_url": "http://news.ycombinator.com/item?id=35503928",
    "content": "Flatcar Container Linux | Flatcar Container LinuxSkip to content           Join our Office Hours, every second Tuesday of each month at 15:30 GMT.         BlogReleasesDocsFAQSecurityFlatcar Container LinuxA community Linux distribution designed for container workloads, with high security and low maintenanceMade possible by project sponsors includingSupported wherever you run your containersWhat is a Container Linux?The introduction of container-based infrastructure was a paradigm shift. A Container-optimized Linux distribution is the best foundation for cloud native infrastructure.A minimal OS image only includes the tools needed to run containers. No package manager, no configuration drift.Delivering the OS on an immutable filesystem eliminates a whole category of security vulnerabilities.Automated atomic updates mean you get the latest security updates and open source technologies.The Container Infrastructure OSFlatcar Container Linux is designed from the ground up for running container workloads. It fully embraces the container paradigm, including only what is required to run containers.Immutable infrastructureYour immutable infrastructure deserves an immutable Linux OS. With Flatcar Container Linux, you manage your infrastructure, not your configuration.Designed to scaleFlatcar Container Linux includes tools to manage large-scale, global infrastructure. You can manage update polices, versions and group instances with ease.Reduced complexityWith containers, dependencies are packaged and delivered in container images. This makes package managers unnecessary and simplifies the OS.Immutable infrastructureYour immutable infrastructure deserves an immutable Linux OS. With Flatcar Container Linux, you manage your infrastructure, not your configuration.Designed to scaleFlatcar Container Linux includes tools to manage large-scale, global infrastructure. You can manage update polices, versions and group instances with ease.Reduced complexityWith containers, dependencies are packaged and delivered in container images. This makes package managers unnecessary and simplifies the OS.Secure by DesignFlatcar Container Linux's built-in security features, minimal design and automated updates provide a strong foundation for your infrastructure's security strategy.Security patch automationRunning the latest security patches is crucial to removing potential vulnerabilities. Flatcar Container Linux’s automated updates does this for you.Immutable filesystemBy making the system partition read-only, Flatcar Container Linux eliminates a whole class of high-impact security vulnerabilities.Minimal attack surfaceFlatcar Container Linux includes only what is required to run containers. By minimizing the size and complexity of the OS, the attack surface is also reduced.Security patch automationRunning the latest security patches is crucial to removing potential vulnerabilities. Flatcar Container Linux’s automated updates does this for you.Immutable filesystemBy making the system partition read-only, Flatcar Container Linux eliminates a whole class of high-impact security vulnerabilities.Minimal attack surfaceFlatcar Container Linux includes only what is required to run containers. By minimizing the size and complexity of the OS, the attack surface is also reduced.Automated UpdatesWith Flatcar Container Linux, you'll always be running the most stable, secure and up-to-date Flatcar version by taking advantage of the automated, atomic update feature.Self-driving updatesFlatcar Container Linux uses the same reliable update mechanism as Google’s ChromeOS to provide safe, secure and automated system updates.Always up-to-dateWith Flatcar Container Linux’s automated updates, you’ll benefit from always running the most stable, secure and feature-rich version of the OS.Managed updatesThe Kinvolk Update Service allows for defining instance groups, assigning update channels and controlling the frequency, time of day and rate of updates.Self-driving updatesFlatcar Container Linux uses the same reliable update mechanism as Google’s ChromeOS to provide safe, secure and automated system updates.Always up-to-dateWith Flatcar Container Linux’s automated updates, you’ll benefit from always running the most stable, secure and feature-rich version of the OS.Managed updatesThe Kinvolk Update Service allows for defining instance groups, assigning update channels and controlling the frequency, time of day and rate of updates.Migrating from CoreOS Container LinuxDrop-in replacement for CoreOSFlatcar Container Linux is directly derived from CoreOS, enabling seamless in-place migration.Learn more Â»Migrating from CoreOS Container LinuxUpgrading to Flatcar Container Linux is the same as a CoreOS update.      CoreOS to Flatcar migration demo Latest Posts          Nov 7, 2022        About the handling of embargoed security issues          Sep 13, 2022        FrOSCon 2022 - Summary of an Open-Source week-end with some Flatcar team membersCopyright the Flatcar Project Contributors",
    "summary": "Flatcar Container Linux is a community Linux distribution that is designed for container workloads with high security and low maintenance. The OS image only includes the tools required to run containers with no package manager or configuration drift. The immutable filesystem and automated atomic updates provide a strong foundation for infrastructure security. Flatcar Container Linux's built-in security features and reduced attack surface simplify OS management. It includes tools to manage large-scale infrastructures and supports global initiatives. Automated, atomic updates ensure that you run the most stable, secure, and up-to-date Flatcar version. It is a drop-in replacement for CoreOS Container Linux.",
    "hn_title": "Flatcar Container Linux",
    "original_title": "Flatcar Container Linux",
    "score": 135,
    "hn_content": "The Flatcar Container Linux project, a direct fork from CoreOS Container Linux, is receiving updates and is still active after being acquired by Microsoft in 2021. An HN user explains that 'Flatcar' was historically used to refer to railcars used to mount shipping containers, while other users highlight similar open-source projects Fedora IoT and openSUSE MicroOS. Notably, the project also offers users the ability to continue using cloud-init yaml instead of the more complicated Ignition software. Despite some controversy, the immutable infrastructure approach is gaining popularity due to increased security, and Flatcar Container Linux provides a robust alternative for those seeking the benefits of immutability.The Tech Times reports on the technical issues experienced by Ignition, a decade after initial involvement, with dissatisfaction expressed from users over its functionality in contrast to CloudInit. Specific user comments express issues with the process of configuring Ignition files, issues with its build, and its limitations when downloading files. An alternative is suggested in Flatcar Linux by the same developers, with a friendly update being advocated by Microsoft.HN users discuss the possibility of adding containers to the immutable Flatcar distro after booting. Some users say it's possible, while others suggest using a UEFI firmware for better performance and reliability. One user provides a link for potentially helpful information.",
    "hn_summary": "Microsoft's Flatcar Container Linux update and continues after acquisition, providing an alternative to CloudInit. The immutable infrastructure approach gains popularity despite Ignition's technical issues. Flatcar Linux developers suggest a friendly update. HN users discuss adding containers and suggest a UEFI firmware for better performance."
  },
  {
    "id": 35500472,
    "timestamp": 1681021790,
    "title": "Microsoft / JARVIS: a system to connect LLMs with ML community",
    "url": "https://github.com/microsoft/JARVIS",
    "hn_url": "http://news.ycombinator.com/item?id=35500472",
    "content": "# JARVIS**This project is under construction and we will have all the code ready soon.**## Updates+ [2023.04.06] We added the Gradio demo and built the web API for `/tasks` and `/results` in `server` mode.  + The Gradio demo is now hosted on Hugging Face Space. (Build with `inference_mode=hibrid` and `local_deployment=standard`)  + The Web API `/tasks` and `/results` access intermediate results for `Stage #1`: task planning and `Stage #1-3`: model selection with execution results. See here.+ [2023.04.03] We added the CLI mode and provided parameters for configuring the scale of local endpoints.  + You can enjoy a lightweight experience with Jarvis without deploying the models locally. See here.  + Just run `python awesome_chat.py --config lite.yaml` to experience it.+ [2023.04.01] We updated a version of code for building.## OverviewLanguage serves as an interface for LLMs to connect numerous AI models for solving complicated AI tasks!See our paper: [HuggingGPT: Solving AI Tasks with ChatGPT and its Friends in HuggingFace](http://arxiv.org/abs/2303.17580), Yongliang Shen, Kaitao Song, Xu Tan, Dongsheng Li, Weiming Lu and Yueting Zhuang (the first two authors contribute equally)We introduce a collaborative system that consists of **an LLM as the controller** and **numerous expert models as collaborative executors** (from HuggingFace Hub). The workflow of our system consists of four stages:+ **Task Planning**: Using ChatGPT to analyze the requests of users to understand their intention, and disassemble them into possible solvable tasks.+ **Model Selection**: To solve the planned tasks, ChatGPT selects expert models hosted on Hugging Face based on their descriptions.+ **Task Execution**: Invokes and executes each selected model, and return the results to ChatGPT.+ **Response Generation**: Finally, using ChatGPT to integrate the prediction of all models, and generate responses.## System Requirements### Default (Recommended)For `config.yaml`:+ Ubuntu 16.04 LTS+ VRAM >= 24GB+ RAM > 12GB (minimal), 16GB (standard), 80GB (full)+ Disk > 284GB  + 42GB for `damo-vilab/text-to-video-ms-1.7b` + 126GB for `ControlNet` + 66GB for `stable-diffusion-v1-5` + 50GB for others ### Minimum (Lite)For `lite.yaml`:+ Ubuntu 16.04 LTS+ Nothing elseThe configuration `lite.yaml` does not require any expert models to be downloaded and deployed locally. However, it means that Jarvis is restricted to models running stably on HuggingFace Inference Endpoints.## Quick StartFirst replace `openai.key` and `huggingface.token` in `server/config.yaml` with **your personal OpenAI Key** and **your Hugging Face Token**. Then run the following commands:### For Server:```bash# setup envcd serverconda create -n jarvis python=3.8conda activate jarvisconda install pytorch torchvision torchaudio pytorch-cuda=11.7 -c pytorch -c nvidiapip install -r requirements.txt# download models. Make sure that `git-lfs` is installed.cd modelsbash download.sh # required when `inference_mode` is `local` or `hybrid`. # run servercd ..python models_server.py --config config.yaml # required when `inference_mode` is `local` or `hybrid`python awesome_chat.py --config config.yaml --mode server # for text-davinci-003```Now you can access Jarvis' services by the Web API. + `/hugginggpt` --method `POST`, access the full service.+ `/tasks` --method `POST`, access intermediate results for Stage #1.+ `/results` --method `POST`, access intermediate results for Stage #1-3.For example:```bash# requestcurl --location 'http://localhost:8004/tasks' \\--header 'Content-Type: application/json' \\--data '{  \"messages\": [    {      \"role\": \"user\",      \"content\": \"based on pose of /examples/d.jpg and content of /examples/e.jpg, please show me a new image\"    }  ]}'# response[{\"args\":{\"image\":\"/examples/d.jpg\"},\"dep\":[-1],\"id\":0,\"task\":\"openpose-control\"},{\"args\":{\"image\":\"/examples/e.jpg\"},\"dep\":[-1],\"id\":1,\"task\":\"image-to-text\"},{\"args\":{\"image\":\"-0\",\"text\":\"-1\"},\"dep\":[1,0],\"id\":2,\"task\":\"openpose-text-to-image\"}]```### For Web:We provide a user-friendly web page. After starting `awesome_chat.py` in a server mode, you can run the commands to communicate with Jarvis in your browser: - you need to install `nodejs` and `npm` first.- [ IMPORTANT ] if you are running the web client on another machine, you need set `http://{LAN_ip_of_the_server}:{port}/` to `web/src/api/hugginggpt.ts@Line=9`.- if you want to use the video generation feature, you need to compile `ffmpeg` manually with H.264.- you can switch to ChatGPT by `double click` on the setting icon!```bashcd webnpm installnpm run dev``````bash# Optional: Install ffmpeg# This command need be executed without errors.LD_LIBRARY_PATH=/usr/local/lib /usr/local/bin/ffmpeg -i input.mp4 -vcodec libx264 output.mp4```### For GradioThe Gradio demo is now hosted on Hugging Face Space. You can also run the following commands to start the demo locally:```bashpython models_server.py --config config.gradio.yamlpython run_gradio_demo.py --config config.gradio.yaml# or run the HF Space as a Docker image (Build with `inference_mode=hibrid` and `local_deployment=standard`)docker run -it -p 7860:7860 --platform=linux/amd64 registry.hf.space/microsoft-hugginggpt:latest python app.py```### For CLI:You can also run Jarvis more easily in CLI mode:```bashcd serverpython awesome_chat.py --config config.yaml --mode cli```Examples of CLI mode:```Welcome to Jarvis! A collaborative system that consists of an LLM as the controller and numerous expert models as collaborative executors. Jarvis can plan tasks, schedule Hugging Face models, generate friendly responses based on your requests, and help you with many things. Please enter your request (`exit` to exit).[ User ]: Given a collection of image A: /examples/a.jpg, B: /examples/b.jpg, C: /examples/c.jpg, please tell me how many zebras in these picture?[ Jarvis ]: Based on your request, I have used several models to process the images you provided. For the image A: /examples/a.jpg, I used the image-to-text model nlpconnect/vit-gpt2-image-captioning to generate the text \"a cat sitting on a window sill looking out\". Then I used the object-detection model facebook/detr-resnet-50 to generate the image with predicted box '/images/a3dc.jpg', which contains two objects with labels 'potted plant' and 'cat'. For the image B: /examples/b.jpg, I used the image-to-text model nlpconnect/vit-gpt2-image-captioning to generate the text \"two zebras standing in a field of dry grass\". Then I used the object-detection model facebook/detr-resnet-50 to generate the image with predicted box '/images/f5df.jpg', which contains three objects with labels 'zebra'. For the image C: /examples/c.jpg, I used the image-to-text model nlpconnect/vit-gpt2-image-captioning to generate the text \"a zebra standing in a field of tall grass\". Then I used the object-detection model facebook/detr-resnet-50 to generate the image with predicted box '/images/69c7.jpg', which contains one object with label 'zebra'. Finally, I used the canny-control model canny-control to generate the image '/images/7e18.png' based on the image /examples/f.jpg. Therefore, there are four zebras in these pictures. Is there anything else I can help you with?[ User ]: Please answer all the named entities in the sentence: Iron Man is a superhero appearing in American comic books published by Marvel Comics. The character was co-created by writer and editor Stan Lee, developed by scripter Larry Lieber, and designed by artists Don Heck and Jack Kirby.[ Jarvis ]: Sure, I understand your request. Based on the inference results of the models, I will answer your request step by step. Firstly, I used the token-classification model dslim/bert-base-NER to recognize the named entities in the sentence. The inference result is that the named entities are Iron Man, Stan Lee, Larry Lieber, Don Heck and Jack Kirby. Then, I used the question-answering model deepset/roberta-base-squad2 to answer your request. The inference result is that there is no output since the context cannot be empty. Therefore, I cannot make it. I hope this answer your request. Is there anything else I can help you with?[ User ]: Please generate a canny image based on /examples/f.jpg[ Jarvis ]: Sure. I have generated a canny image based on /examples/f.jpg. To do this, I first used the image-to-text model nlpconnect/vit-gpt2-image-captioning to generate the text description of the image, which is \"a herd of giraffes and zebras grazing in a field\". Then I used the canny-control model to generate the canny image of the original image, which is stored in the path \"/images/1ea2.png\". Finally, I used the canny-text-to-image model lllyasviel/sd-controlnet-canny to generate the canny image based on the text description and the canny image, which is stored in the path \"/images/ba66.png\". Do you need anything else?```## ConfigurationThe server-side configuration file is `server/config.yaml`, and some parameters are presented as follows:+ `model`: LLM, currently supports `text-davinci-003`. We are working on integrating more open-source LLMs.+ `inference_mode`: mode of inference endpoints + `local`: only use the local inference endpoints + `huggingface`: only use the Hugging Face Inference Endpoints **(free of local inference endpoints)** + `hybrid`: both of `local` and `huggingface`+ `local_deployment`: scale of locally deployed models, works under `local` or `hybrid` inference mode: + `minimal` (RAM>12GB, ControlNet only) + `standard` (RAM>16GB, ControlNet + Standard Pipelines) + `full` (RAM>42GB, All registered models)On a personal laptop, we recommend the configuration of `inference_mode: hybrid `and `local_deployment: minimal`. But the available models under this setting may be limited due to the instability of remote Hugging Face Inference Endpoints.## Screenshots## CitationIf you find this work useful in your method, you can cite the paper as below:  @article{shen2023hugginggpt,    title  = {HuggingGPT: Solving AI Tasks with ChatGPT and its Friends in HuggingFace},    author = {Shen, Yongliang and Song, Kaitao and Tan, Xu and Li, Dongsheng and Lu, Weiming and Zhuang, Yueting},    journal = {arXiv preprint arXiv:2303.17580},    year  = {2023}  }## Acknowledgement- [ChatGPT](https://platform.openai.com/)- [Hugging Face](https://huggingface.co/)- [ControlNet](https://github.com/lllyasviel/ControlNet)- [ChatGPT-vue](https://github.com/lianginx/chatgpt-vue)",
    "summary": "Microsoft and Hugging Face have unveiled the Labs project JARVIS, an AI assistant for connecting language and machine-learning models. JARVIS uses a large language model (LLM) to understand and analyse requests, then uses a selection of numerous expert models to execute the required task. It consists of four stages: task planning, model selection, task execution, and response generation. The user can enjoy a lightweight experience with JARVIS without deploying the models locally by activating its CLI mode or the web page, which shows a user-friendly interface that communicates with JARVIS.",
    "hn_title": "Microsoft / JARVIS: a system to connect LLMs with ML community",
    "original_title": "Microsoft / JARVIS: a system to connect LLMs with ML community",
    "score": 125,
    "hn_content": "Microsoft has created JARVIS, a new system designed to connect LLMs (language and learning models) with the machine learning community. The system aims to use rule-based approaches and machine learning as a foundation, allowing for autonomous operation and control. While designs for the system are already in place, some are speculating about whether autonomous AI agents operating on the internet can commit fraud or scams. Hacker News readers appear mainly excited about the project, with some jokingly questioning whether the system is related to the one mentioned by AI expert Andrej Karpathy.Microsoft has launched a new AI-powered natural language model called Jarvis, which can generate text as well as images. The model reportedly selects an appropriate number of models to use and generates content based on LLM's choice of models. It is named after Edwin Jarvis, the butler in Marvel's Iron Man franchise. Some users raised concerns over potential trademark issues with Marvel, and one user suggested that Jarvis could eavesdrop on conversations, leading to an exchange in which Jarvis quips, \"sometimes you can acknowledge, I am smarter than you\".",
    "hn_summary": "Microsoft launches JARVIS to connect LLMs with ML community using rule-based approaches and machine learning. Some speculate whether autonomous AI agents can commit fraud or scams, though readers are mainly excited. Jarvis generates text and images based on LLM's choice of models, but some raise concerns on trademark issues and eavesdropping."
  },
  {
    "id": 35505342,
    "timestamp": 1681066188,
    "title": "Spherical tokamak achieves crucial plasma temperatures",
    "url": "https://www.eetimes.com/spherical-tokamak-achieves-crucial-plasma-temperatures/",
    "hn_url": "http://news.ycombinator.com/item?id=35505342",
    "content": "Tokamak Energy's compact high-field spherical tokamak has achieved ion temperatures of over 100 million degrees Kelvin, a critical step in the development of fusion energy technology. The spherical tokamak's small size, plasma stability and enhanced confinement qualities make it an appealing choice for commercial fusion power production, and recent advancements in HTS magnet production have paved the way for smaller and less expensive fusion power plants. Steven McNamara, science director at Tokamak Energy, said the company believes on-grid power is viable within 10 years and that fusion energy will complement other renewables in the fight against climate change.Scientists at Tokamak Energy have reached a temperature of 100 million degrees Celsius, the hottest ever produced in a spherical tokamak, or any tokamak of comparable size. An upgrade to the company's ST40 copper-magnetised high-field spherical tokamak has given researchers a more precise measurement of plasma behaviour by using the technique of Thomson scattering, which measures temperature and density at multiple points. The breakthrough paves the way for development towards commercial fusion power plants, offering a solution that can be low cost and genuinely deployable in many countries. The technology has potential applications in grid and industrial sectors, including sustainable aviation and hydrogen fuel production.",
    "summary": "Tokamak Energy's spherical tokamak achieved ion temperatures of over 100 million degrees Kelvin - a critical step in developing fusion energy technology. The small size, plasma stability, and magnetic confinement properties of spherical tokamaks make them an appealing choice for commercial fusion power production. Steven McNamara, science director at Tokamak Energy, believes that the company can put fusion energy on-grid within 10 years, complementing other renewable energy sources. The breakthrough uses Thomson scattering to measure temperature and density at multiple points, paving the way for low-cost, deployable commercial fusion power plants. The technology also has potential applications in sustainable aviation and hydrogen fuel production.",
    "hn_title": "Spherical tokamak achieves crucial plasma temperatures",
    "original_title": "Spherical tokamak achieves crucial plasma temperatures",
    "score": 123,
    "hn_content": "A spherical tokamak has achieved crucial plasma temperatures. Some comments focus on the picture and its apparent structural issues. A user recommends a podcast about fusion energy. The article discusses how D-T fusion emits most of its energy as high-energy neutrons, and explains the need for a heat exchanger to capture that energy. A user debates the viability of commercial fusion, while another defends that new technologies are not necessarily commercially viable in their early stages. The spherical tokamak offers a solution to the high fixed costs of traditional tokamaks.Researchers have reportedly doubled the magnet strength in small-scale fusion tests with relatively low input energies. While fusion is theoretically promising, branding problems with fission could leave fusion with a comparative advantage if marketed as \"clean\". Waste from fusion is shorter-lived than that of fission reactors, and there is no danger of a runaway reaction as there is with fission. Spherical tokamaks are a state-of-the-art application tested recently: some users suggest that, while the design is compressed to the point of being spherical, the name \"spheromak\" is already taken. While some may point out that the milestone reached is not yet useful, researchers have made progress on doubling magnet strength in small-scale fusion tests.",
    "hn_summary": "A spherical tokamak achieves crucial plasma temperatures. Some users discuss structural issues, one recommends a fusion energy podcast. The article explains the need for a heat exchanger and reduced costs of the new design. Viability of commercial fusion is debated. Doubling magnet strength in small-scale tests advances progress. Waste and safety advantages of fusion over fission are noted. Spherical tokamaks are a state-of-the-art application. Milestone reached is not yet useful, but progress is made on magnet strength."
  },
  {
    "id": 35503260,
    "timestamp": 1681051936,
    "title": "The first game 'Easter eggs' were an act of corporate rebellion",
    "url": "https://thehustle.co/the-first-easter-eggs-were-an-act-of-corporate-rebellion/",
    "hn_url": "http://news.ycombinator.com/item?id=35503260",
    "content": "The first Easter eggs in video games have roots in a corporate rebellion from Atari's video game designers, who were denied credit for their work. The designers' dissatisfaction was expressed through hidden messages in the games, and the first Easter egg was found in the 1980 game \"Adventure\". It contained a secret room in purple that read \"Created by Warren Robinett,\" whose name was not recognized by Atari management. The designers' discontent led to the creation of Activision and Imagic. Atari's laid-back ethos was gone after it was sold to Warner Communications Inc., with CEO Ray Kassar coming in and undervaluing the designers.Atari designer Warren Robinett's creation of the first Easter egg in a video game is discussed by The Hustle, which provides context around the birth of this phenomena. The report refers to the tradition of designers including secret messages in arcade games in the 1970s and cites the motivation for this as a desire for recognition and individuality. Robinett's Easter egg has particularly elevated his status, selling 1 million copies of the game Adventure and being mentioned in Ernest Cline's book and subsequent Spielberg movie, Ready Player One. Robinett went on to develop a successful software business, The Learning Company, after the hostile takeover of his co-founded company.The Tech Times reports on various cookies used by companies for tracking online user behavior, including identifiers used by Hotjar, OptinMonster, and Microsoft Clarity. Other cookies are used to personalize ads for users, such as those by Facebook, TikTok, and Twitter, while LinkedIn cookies are used to identify devices and users. The article highlights that these cookies are being analyzed but have not been classified into a category yet.",
    "summary": "The first Easter eggs in video games were a result of designers being denied credit for their work, leading to hidden messages in games. The first Easter egg was found in Atari's 1980 game \"Adventure\", created by Warren Robinett. The tradition of hidden messages continued in the 1970s arcade games to seek recognition and individuality. Robinett's Easter egg elevated his status, and he went on to develop a successful software business. The Tech Times reports on various cookies used by companies for tracking users' online behavior and personalizing ads, but they have not been classified yet.",
    "hn_title": "The first game ‘Easter eggs’ were an act of corporate rebellion",
    "original_title": "The first game ‘Easter eggs’ were an act of corporate rebellion",
    "score": 116,
    "hn_content": "Corporate rebellion through hidden Easter eggs is featured in a recent Hacker News post. Comments include anecdotes of Easter eggs in video games, Electronic Arts' history, and current corporate policy that considers Easter egg placement a fireable offense in some cases. The readers’ interest may pique due to the post’s historic relevance to corporate culture and the evolution of the Easter egg's role. Current Easter eggs are viewed as a means to express corporate pride, not to stick it to the man, as they were intended initially.A former employee's easter egg in an Atari game raises questions about the fine line between creativity and insubordination. Many examples of \"recuperation\" - businesses turning acts of rebellion into marketable products - exist in popular culture. Left brain and right brain specialization is an oversimplification, clinging to hoary outdated ideas about mental processes. Code reviews make sneaking easter eggs into code more difficult. A request for backup software in a typed letter shows a desire for more proof of a computer's greatness. It is common for former tech companies to fall into irrelevance under the guidance of a newly appointed Harvard MBA. Warren Robinett is lauded for creating an excellent game in Adventure. A fan of Atari with the same name as a member of U2 is not actually the same person.There is no content provided to summarize.",
    "hn_summary": "A Hacker News post about corporate rebellion through Easter eggs features anecdotes and current corporate policies. Readers' interest may pique due to the historical relevance and evolution of the Easter egg's role. Current Easter eggs express corporate pride, not insubordination. Code reviews prevent Easter eggs. Former tech companies often fall under newly appointed MBAs. Warren Robinett is praised for Adventure game. U2's member and Atari fan have different names."
  },
  {
    "id": 35502874,
    "timestamp": 1681049359,
    "title": "Modular Errors in Rust",
    "url": "https://sabrinajewson.org/blog/errors",
    "hn_url": "http://news.ycombinator.com/item?id=35502874",
    "content": "Developers should place error types near their unit of fallibility to ensure modular error handling. The article uses a hypothetical Rust library that implements the parsing of Blocks.txt in the Unicode Character Database as an example of how to properly handle error types. The article outlines common problems such as unhelpful error messages, inextensibility, and difficulty matching errors, that arise when error handling is not done correctly. To improve error handling, developers can leverage the .source() method, construct better error types with \"On from\" and \"nearness\", and aim for verbosity in error messages.The article discusses problems with big-enum error handling and introduces the principle of error types being located near their unit of fallibility. The example library's error type is split into three distinct types to improve extensibility and modularity, with each type having precise error matching and good backtraces. The library's I/O errors are better explained through a more structured error type design, and the .source() method is used to create more readable error messages. There are issues with hardcoded public enum data and non-modularity in big-enum error handling, which can cause confusion and difficulty when maintaining the code.The article discusses the importance of thoughtful error handling techniques to ensure resilient, reliable, and user-friendly systems in Rust programming. The author provides an example of a structure to use for error handling, emphasizing the significance of good backtraces, extensibility, inspectability, stability, and modularity. The article also acknowledges that the structure requires extra code and complexities but encourages the reader to view it as an opportunity to treat errors more seriously. The article concludes by suggesting that good error handling is worth learning and that it ultimately results in better systems.",
    "summary": "The article discusses the importance of modular error handling and introduces the principle of error types being near their unit of fallibility, using a hypothetical Rust library as an example. Issues with unhelpful error messages, inextensibility, and difficulty matching errors are outlined, and solutions such as the .source() method and better error type construction are suggested. The example library's error type is split into three distinct types with good backtraces and precise error matching, and I/O errors are explained through a more structured error type design. The article emphasizes the significance of good backtraces, extensibility, inspectability, stability, and modularity in error handling, and suggests that good error handling is worth learning.",
    "hn_title": "Modular Errors in Rust",
    "original_title": "Modular Errors in Rust",
    "score": 116,
    "hn_content": "Rust's error messages are a significant reason for its popularity, but different use cases require different types of error messages. SNAFU, a Rust crate, encourages creating distinct error types and composing them to produce unique traces for each error. Providing detailed information as part of an error type enhances testing and allows callers to recover from specific errors. While detailed error reporting can be done without using distinct error types, separating errors by type can reduce error proliferation and make error handling easier for callers. However, developers must ensure they only expose as a public API the information that they are comfortable supporting.A discussion on error handling in Rust libraries suggests that logging and terminating may not be the best approach, due to its drastic nature. The primary use of error reporting is for debugging the library, but even library users may benefit from understanding the source of the error. It is a common failure to have documentation that only describes parts of a codebase without explaining its architecture and high-level information. Users suggest either having very granular errors or using opaque errors with good human-readable descriptions. Checked exceptions in Java are praised for their ability to communicate recoverable errors. The fatal flaw of Java is not having algebraic types.",
    "hn_summary": "Rust's error messages are popular but varied error types are needed. SNAFU allows for producing unique traces. Distinct errors reduce proliferation and make handling easier but beware of supporting public APIs. Logging and terminating should not be the primary approach for debugging libraries. Granular or opaque errors with descriptions are preferred. Checked exceptions in Java are praised. The fatal flaw of Java is not having algebraic types."
  },
  {
    "id": 35501780,
    "timestamp": 1681040364,
    "title": "68–95–99.7 Rule",
    "url": "https://en.wikipedia.org/wiki/68%E2%80%9395%E2%80%9399.7_rule",
    "hn_url": "http://news.ycombinator.com/item?id=35501780",
    "content": "The 68-95-99.7 rule, also known as the empirical rule, is a shorthand used to remember the percentage of values that lie within an interval in a normal distribution: 68%, 95%, and 99.7% of the values lie within one, two, and three standard deviations of the mean, respectively. The usefulness of this heuristic depends on the question under consideration, but it is often used to quickly obtain a rough probability estimate of something, assuming the population is normal. There are other uses for this heuristic in different fields. The table of numerical values at the end of the article shows the expected fraction of the population inside/outside the range for normally distributed data, based on the expected frequency of the range outside the estimated range.The 68-95-99.7 rule is a statistical approximation used to estimate the percentage of values within a certain number of standard deviations from the mean in a normal distribution. The rule states that approximately 68% of values fall within one standard deviation of the mean, 95% within two standard deviations, and 99.7% within three standard deviations. The rule is commonly used in quality control and process improvement. The formula is not limited to the normal distribution and can be applied to other distributions. The rule can be useful in interpreting data and identifying outliers in data analysis.",
    "summary": "The 68-95-99.7 rule is a statistical approximation estimating the percentage of values within a standard deviation from the mean in normal distribution. The rule states that roughly 68%, 95% and 99.7% fall within one, two, and three standard deviations respectively. This rule has multiple uses in different fields, such as quality control and data analysis. It is a quick way to obtain a rough probability estimate for a population assumed to be normal. The formula can be applied to different distributions, and it can help identify outliers in data analysis.",
    "hn_title": "68–95–99.7 Rule",
    "original_title": "68–95–99.7 Rule",
    "score": 116,
    "hn_content": "The article discusses the 68-95-99.7 rule and how it applies to data analysis. HN users discuss the rule's limitations, including how data can deviate from normal distributions and the risk management of financial institutions. Users mention Nassim Nicholas Taleb's work on the topic as well. Chebyshev's Inequality is also mentioned as an alternative method for analyzing data. The conversation also includes tangents on financial trading strategies and the history of the US options market, as well as some humor about memorizing numbers.Expert Hacker News users claim that IQs above 180 are largely unreliable on normed tests, with a maximum possible FSIQ of 160 on the popular WAIS-IV measure, which is calibrated for the 70-130 range. The error increases with higher scores, so the test is better suited to providing broad ranges than differentiating high achievers. Beyond 70-130, intellectual performance is suspect, and the scale is so arbitrary that a 180 IQ is only around one in 50 million people worldwide, according to responses by HN users.",
    "hn_summary": "HN comments discuss limitations of the 68-95-99.7 rule in analyzing data. Nassim Nicholas Taleb's work & Chebyshev's Inequality are mentioned. Tangents on financial trading & history of US options market. Expert users claim high IQ scores are unreliable & scale is arbitrary."
  },
  {
    "id": 35505591,
    "timestamp": 1681068127,
    "title": "UnicodePlots",
    "url": "https://github.com/JuliaPlots/UnicodePlots.jl",
    "hn_url": "http://news.ycombinator.com/item?id=35505591",
    "content": "The UnicodePlots library is a high-level plotting tool for use in Julia's REPL, featuring a range of functions including scatter plots, line plots, and heatmaps. The library includes support for physical quantities of Unitful.jl and intervals from IntervalSets.jl. The functions support various options for customizing plots such as the ability to adjust plot height and width and reverse/flip plot axes. The library also supports saving plots as PNG or TXT",
    "summary": "The UnicodePlots library is a high-level plotting tool for use in Julia's REPL that includes scatter plots, line plots, and heatmaps. It also supports physical quantities of Unitful.jl and intervals from IntervalSets.jl, allows customization of plot features such as plot height and width and reverse/flip plot axes, and supports saving plots as PNG or TXT.",
    "hn_title": "UnicodePlots",
    "original_title": "UnicodePlots",
    "score": 115,
    "hn_content": "UnicodePlots | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login UnicodePlots (github.com/juliaplots)115 points by dunefox 6 hours ago | hide | past | favorite | 24 comments   0x000xca0xfe 35 minutes ago        | next [–] Very nice, this can be used to build a cool motd :)Not about this project specifically, but there seems to be a general trend towards TUIs.As someone currently working on a native GTK+ app, the state of native deskop UIs is horrible. GTK+ with all the depreciations? Painful. Win32? Oh god. UWP? Please, no. UIKit or Swift? Desktop software is no longer important enough to support multiple platforms natively...I feel like we are headed towards a split between Electron for end user applications and TUI for portable tools. They even run on servers and modern terminals on any platform can \"render\" the UI! reply  nine_k 13 minutes ago        | parent | next [–] So, VT220 (with some extensions like Unicode) is again going to become the common ground of somehow rich interfaces?In fact, this is happening. My filesystem UI is Midnight Commander for a long time, but my k8s UI is k9s, and it's new, and works equally effortlessly on a Mac and on a Linux box. reply  crazygringo 5 hours ago        | prev | next [–] Wow. That's crazy.Genuine question: is this actually useful in real life, or just a cool \"because I could\" project?Not being a Julia programmer I'd assume that producing charts in a REPL would be done in a Jupyter notebook with real pixels, not Unicode.Is producing elaborate charts in a terminal something people actually need?Edit: some fantastic responses. Makes perfect sense. Thank you! reply  KenoFischer 5 hours ago        | parent | next [–] Yes, it's useful when you're ssh'd into some production system somewhere and just want to get a quick sense of some data in memory instead of going through the steps of installing a full graphics stack (which fortunately is pretty much a one-liner in Julia also, but can take a few mins). reply  Tarrosion 4 hours ago        | parent | prev | next [–] Yeah, I find it super useful when you want a maximally quick look at the shape of your data. Even if I'm local (ie not SSH'd onto a remote system where displaying graphics could be a hassle), using UnicodePlots can \"break my flow\" less than generating prettier plots in another window. reply  schneems 4 hours ago        | parent | prev | next [–] I added comparative histograms (normalized to the same axis) for derailed benchmarks so that when I send a perf PR they get the distribution data in an accessible format.You can copy and paste it right into the comments or description.That’s one use case. reply  IshKebab 4 hours ago        | root | parent | next [–] You can normally add images to PRs though? reply  schneems 54 minutes ago        | root | parent | next [–] Turning the same data into an image provides no additional info and requires extra steps. The key requirement here for my feature is copy and paste from the terminal. reply  dan-robertson 2 hours ago        | parent | prev | next [–] Best example I can think of is cases where you can’t really put an image, eg commit messages (especially if you don’t have something like pull requests where you can put images).Some terminal emulators have support for images, which fit most of the use cases here but not the one I described.I would hope that most people would generate charts with a notebook (jupyter, pluto, orgmode can all have actual images though when I briefly used pluto, I was going mad trying to (a) not get an svg which would suck for a lot of points and (b) get bigger plots in the notebook) or that at the repl you would get something like R and have an X window with the plot rendered to it (tip: dbcairo makes plots over X forwarding much better). reply  csdvrx 56 minutes ago        | root | parent | next [–] > Some terminal emulators have support for images, which fit most of the use cases here but not the one I described.That what sixel-tmux is for, when you're in a hurry and needs images with your current terminal emulator: https://github.com/csdvrx/sixel-tmux reply  dunefox 4 hours ago        | parent | prev | next [–] I used it for a cli script that reads a log file and creates a histogram of the IPs. Pretty good if you don't want to save an image every couple of minutes. It's just text. reply  nanobowers 1 hour ago        | prev | next [–] Rubyists may be interested in https://github.com/red-data-tools/unicode_plot.rbwhich is mostly a port of this package. reply  NelsonMinar 4 hours ago        | prev | next [–] Really neat! Every time I see this I'm reminded of what we lost from the 1990s, when xterm supported Tektronix 4014 emulation. Vector graphics right there via a tty interface! It wasn't terribly useful in practice but it could do some nice things with plotting. reply  joshu 3 hours ago        | parent | next [–] iterm2/wezterm/etc will display images.https://iterm2.com/documentation-images.htmlthere is also sixel. https://github.com/saitoha/libsixel reply  martinsmit 4 hours ago        | prev | next [–] Nice to see a non-trivial package with 100% code coverage, can't remember the last time I saw that. reply  rmeno12 5 hours ago        | prev | next [–] Is there such a tool for use with python? preferably matplotlib compatible. I often find myself needing to plot some data to get a quick idea of what it looks like, and my work is generally on a remote host. Having to open a new ssh session with X forwarding is not difficult but a more frictionless approach would be nice. reply  jrichardshaw 5 hours ago        | parent | next [–] If you happen to use `iTerm2`, then https://github.com/daleroberts/itermplot works very well. I've used it before and can recommend it pretty highly. reply  folkrav 4 hours ago        | root | parent | next [–] Is iTerm2 GPU accelerated? Wasn't aware it could do that kind of thing. I didn't use it in years, admittedly, haven't had a Mac for a while. reply  fwlr 1 hour ago        | root | parent | next [–] iTerm2 is GPU accelerated since 2018, yes. Other terminals on Mac that I know of (Kitty, Alacritty, Warp) are also GPU accelerated. reply  joouha 4 hours ago        | parent | prev | next [–] If you use euporie [1], you can draw plots in a Jupyter notebook in the terminal using matotlib and friends, and have them displayed using terminal graphics.[1] https://github.com/joouha/euporie reply  abhishekbasu 5 hours ago        | parent | prev | next [–] There are [1, 2], and AFAICT they rely on gnuplot [3].[1] https://github.com/nschloe/termplotlib[2] https://github.com/dkogan/gnuplotlib[3] http://www.gnuplot.info/ reply  dr_kiszonka 4 hours ago        | root | parent | next [–] The last time I used gnuplot was around 25 years ago. And it is still around! reply  csdvrx 55 minutes ago        | root | parent | next [–] A few years ago, you had to recompile it to add sixel support on debian, so I provided https://github.com/csdvrx/sixel-gnuplotNow it's included by default IIRC reply  ddrake18 2 hours ago        | prev [–] Could this be adapted to be a backend for graphviz?I use org mode for notes, and sometimes want to draw graphs or diagrams using graphviz. With something like this, you could integrate graphviz source blocks with org-babel and evaluate the blocks to get nice textual output in your org file. replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Julia-based UnicodePlots shows charts and histograms on the terminal for quick visualizations on remote servers. It responds to a need for quick data visualization in the terminal, without installing a full graphics stack. UnicodePlots is mostly copied in a Ruby port, and a Python version that's compatible with Matplotlib. There is currently a trend towards text user interfaces, creating a split between Electron for end user apps and TUI for portable tools. It has 100% code coverage, supports comparative histograms, and allows users to copy and paste data right into comments or descriptions. Though not an entirely new technology, UnicodePlots is a useful tool for those who need to quickly assess data."
  },
  {
    "id": 35501074,
    "timestamp": 1681031850,
    "title": "Digital collectibles on Instagram is winding down",
    "url": "https://help.instagram.com/1824155514623095",
    "hn_url": "http://news.ycombinator.com/item?id=35501074",
    "content": "Digital collectibles on Instagram is winding down | Help CenterDigital collectibles on Instagram is winding downWe have announced that we will wind down our support for digital collectibles. These changes will begin taking effect starting April 11, 2023. This will not affect the contents of your third-party digital wallet.This is how digital collectibles on Instagram will be affected:Digital collectible postsYou’ll no longer be able to create new digital collectible posts on Instagram.Any collectibles you’ve shared will remain as posts without any shimmer effect or blockchain information. You can continue to delete these posts at any time.Collectible posts that are only viewable in the digital collectible tab of your profile will be moved to your archive.Digital wallets and settingsWe’ll no longer maintain a connection or associate your account with your third-party digital wallets.You’ll no longer be able to view your digital collectibles in the associated tab or manage your third party digital wallet connection settings.Your information and blockchainYou’ll no longer be able to access or download your information related to collectibles. If you would like to download your information please submit a request before April 11, 2023.We’ll begin to delete digital collectible data in our systems including your wallet address. Data will be stored and deleted in accordance with our Privacy Policy and our Digital Collectibles Terms of Use.Learn how to submit a request to download your information.Learn how to see content that’s archived on Instagram. Was this information helpful?YesNoRelated ArticlesDigital collectibles on Facebook is winding downWho can use digital collectibles on Facebook? How do I share my digital collectibles on Facebook? Why can't I see all my digital collectibles on Facebook? Can I share my digital collectible posts from Facebook on other Meta apps?English (US) + Meta © 2023",
    "summary": "Starting April 11, 2023, Instagram will wind down its support for digital collectibles, affecting the creation of new digital collectible posts, the viewability of digital wallets, and the accessibility of blockchain information. The deletion of digital collectible data will be in accordance with Instagram's Privacy Policy and Digital Collectibles Terms of Use, but users can submit a request to download their information before the deadline. The contents of third-party digital wallets will not be affected.",
    "hn_title": "Digital collectibles on Instagram is winding down",
    "original_title": "Digital collectibles on Instagram is winding down",
    "score": 113,
    "hn_content": "Instagram's digital collectibles are losing steam, but this is not affecting the perception of those who believe in web3. Polygon NFTs are thought to be less valuable than others, but Reddit is managing to sell their avatars successfully. The NFT space is affected by two issues - ownership standards and classical business adoption of decentralized tech. A winter is welcomed to enable builders to sort things out, building much-needed infrastructure, and for traditional businesses to learn more. The use of the term 'Web3' may be premature, and true builders and grifters seem to be in separate camps.Comments on a Hacker News post discuss the limited applicability of NFTs to the real world and its marketing hype. Some express cynicism towards cryptocurrencies and the blockchain, while others point out the usefulness of offline ZK-proofs for real-world transactions. The success of Reddit features and collecting Pokemon cards is compared to the concept of scarcity and collecting digital games. Established profitable companies may not understand the potential of decentralized networks, leading to their misjudgment of NFT strategy. Collecting is not solely based on scarcity, as it can also include personal preference or interest in a subject.Instagram is winding down its NFT platform, which allowed users to create and sell crypto art. Some HN users criticize the move, while others question the concept of NFTs and their actual value. One user shares a personal story of a friend getting caught up in the NFT craze, highlighting concerns about the hype and investment risks involved. Another user notes that a successful TCG, like Magic the Gathering, still brings in significant revenue despite the emergence of NFTs. This post does not offer any new or exciting tech developments, but rather provides a snapshot of HN discussion on NFTs and their potential pitfalls.A discussion on HN revolves around the involvement of cults and corporations in certain industries, with examples like Scientology and MLMs. The conversation also touches on the risks of crypto and AI, including addictive and cult-like behavior. The comments reveal a concern for mental health and a lack of focus on innovation, with some accusing the NFT craze of being a mania rather than a groundbreaking development. Overall, the conversation delves into the pros and cons of new technologies and their potential impact on society.Users on Hacker News are discussing the usefulness of NFTs and ChatGPT, with some arguing for their value and others pointing out concerns such as energy usage. The article notes that the main point of the comments is not the central argument and advises against politically or religiously biased language. The author should focus on providing a concise summary that captures the most important points of the post, including any new or exciting developments. The post has garnered attention from tech-savvy readers, who are primarily interested in fresh insights and not dull facts. The author should be confident but not arrogant in their writing and avoid vague language. When discussing prior comments, the author should clearly state that they are relaying an HN user's opinion.Comments on Hacker News discuss the context of advanced technology in relation to communication and synchronization to Earth, with a focus on the origins and true purpose of cryptocurrencies, while a few users debate the value of NFTs and their impact on friendships and addiction. One user describes the potential useful cases of immediate identity and exchange of contract value for compute resources while another points out that physical objects cannot be secured by crypto transactions. It is mentioned that Twitter is a major company that still uses NFTs for profile pictures.",
    "hn_summary": "Instagram's digital collectibles are losing steam, but web3 believers aren't deterred. The NFT space needs to address ownership standards and business adoption. Reddit's avatars sell well, though polygon NFTs are perceived as less valuable. Winter is welcomed for builders to build infrastructure and for traditional businesses to learn about decentralized networks. The success of Pokemon cards and Reddit features is compared to the concept of scarcity. The phrase 'Web3' may be premature and grifters and builders are in different camps. There is skepticism and concerns about NFT hype, investment risks, and mental health. Cult involvement in industries, crypto, and AI risks are discussed. ChatGPT's usefulness is debated, and users focus on fresh insights without political or religious language. The context of advanced technology as it relates to communication and Earth synchronization is discussed, with varying opinions on NFT value and its impact on society."
  },
  {
    "id": 35502238,
    "timestamp": 1681044556,
    "title": "The Ruling That Threatens the Future of Libraries",
    "url": "https://www.theatlantic.com/ideas/archive/2023/04/internet-archive-libraries-federal-court-ruling/673615/",
    "hn_url": "http://news.ycombinator.com/item?id=35502238",
    "content": "The Ruling That Threatens the Future of Libraries - The AtlanticSkip to contentSite NavigationThe AtlanticPopularLatestNewslettersSectionsPoliticsIdeasFictionTechnologySciencePhotoBusinessCulturePlanetGlobalBooksPodcastsHealthEducationProjectsFeaturesFamilyEventsShadowlandProgressNewslettersExplore The Atlantic ArchivePlay The Atlantic crosswordThe Print EditionLatest IssuePast IssuesGive a GiftSearch The AtlanticQuick LinksDear TherapistCrossword PuzzleMagazine ArchiveYour SubscriptionPopularLatestNewslettersSign InSubscribeIdeasThe Ruling That Threatens the Future of LibrariesKnowledge is too precious to be abandoned to the whims of the profit motive.By Adam SerwerIllustration by Joanne Imperio / The AtlanticApril 9, 2023, 6 AM ETShareSaved StoriesSave If civilization ever falls to a zombie apocalypse or nuclear Armageddon, we will need to have preserved centuries of accumulated practical knowledge to rise again. And if humanity should go extinct, leaving nothing but our legacy, the alien explorers who discover the ruins of our society would struggle to interpret human history without some great store of information to guide them.Maybe these postapocalyptic scenarios are far-fetched, but even if society is never, say, drowned by the seas in some climate-driven disaster, leaving the remnants of humanity clinging to a few small bits of land, the massive collection of knowledge accumulated by the Internet Archive, comprising millions of books, is an invaluable resource.By collecting and digitizing such a huge collection of works and lending them out online, the Internet Archive is making an incredible social contribution. The way the nonprofit manages that archive, however, has earned the wrath of book publishers. A few months into the coronavirus pandemic, when many physical libraries were closed, the IA began partnering with libraries to give users access to the IA’s collection, and removed digital limits on its lending. Several book publishers sued in June 2020, alleging a violation of copyright; the IA discontinued the practice a short time later.Dan Cohen: Libraries need more freedom to distribute digital booksLast month, a federal court sided with the publishers; Judge John G. Koeltl wrote that the IA had simply “copied the Works in Suit wholesale for no transformative purpose and created ebooks that … competed directly with the licensed ebooks of the Works in Suit.” The ruling went beyond this to say that controlled digital lending, or CDL, violates copyright law.That’s significant, because for the past decade or so, many U.S. libraries have engaged in CDL, by which a limited number of digital copies, based on the number of physical copies a library possesses, are loaned out. Users lose access to these digital copies after a set period of time. The crux of the publishers’ complaint is that they want to charge libraries fees for ebooks, and they can’t do that if the Internet Archive is allowing those libraries to loan out its scanned copies for free. The ebook licenses that publishers sell to libraries, by contrast, have to be renewed after a fixed number of loans or a certain period of time, and they are highly profitable.“The Publishers reasonably expect to be compensated for the reproduction of their copyrighted works,” Koeltl wrote, “and IA stands to profit from its non-transformative exploitation of the Works in Suit.” Although the IA is a nonprofit, Koeltl wrote that the IA benefits directly because it uses “its Website to attract new members, solicit donations, and bolster its standing in the library community,” and because it is paid whenever someone uses the website’s “Buy from Better World Books” button to purchase from the IA-affiliated Better World Books store.The IA, in response, contends that it is doing nothing more than what libraries have traditionally done, loaning out copies of books it has bought. The only difference is that the copies are digital, rather than physical. But with CDL, the IA does not loan out more digital or physical copies than the IA has purchased. The Internet Archive also argues that there’s no evidence this lending has affected the publishers’ profits, which the judge concluded was irrelevant to the underlying legal matter. “Libraries have been around for thousands of years; they are older than copyright law itself,” the Electronic Frontier Foundation, which is representing the IA, wrote in its brief. “Never in the history of the United States have libraries needed to obtain special permission or to pay license fees to lend the books they already own.”If the ruling stands, the implications for libraries are disastrous. They will have to choose between purchasing licenses for ebooks from publishers for books they already carry every few years and expanding their collections. There should be a reasonable middle ground that is not publishers gouging libraries or giving away works for free en masse. If creating digital copies of books has “no transformative purpose,” it’s also true that ebook-licensing-fee renewals are little more than rent-seeking: The works themselves are unchanged, but the nature of digital delivery allows publishers to charge people in new ways.Knowledge is too precious to be abandoned entirely to the whims of the profit motive. The Internet Archive’s large collection of out-of-print books is safe; its handling of newer works is the subject of the lawsuit. But in between these two categories are those books to which publishers continue to hold rights but that are not profitable enough for them to digitize, and may be difficult to find in physical libraries. The recent bowdlerization of older works by authors such as Roald Dahl and Agatha Christie illustrates another dilemma: Unlike ebooks, which can be altered by the publisher anytime it chooses, scans of physical books preserve the original. That is a problem shared by any nonphysical media sold through a license: You don’t really own it, so providers can restrict access or change the material in any manner they wish.As an author, I want to be paid for my work. If publishers cannot profit off book sales, they cannot pay authors, and if they cannot pay authors, fewer books will be written. But as an author, I have also found the Internet Archive incredibly useful, particularly as a way to consult books that are not in the public domain and are difficult to find.Xochitl Gonzalez: The librarians are not okayLike any library, the IA lends books, and in doing so, it helps other authors write more of them. There are few individual, physical places in which you can find Red Scare–era studies on loyalty oaths, a collection of essays by Black writers on Louis Farrakhan written at the height of his popularity in the 90s, and lengthy 19th century justifications of American apartheid written by segregationists. Trying to access all these works in person might cost you several plane tickets. Although unlimited digital lending would unfairly prevent publishers and authors from profiting from their work, CDL seems like an appropriate compromise, one that resembles the way libraries already function.The Internet Archive provides an invaluable service in digitizing precious but less commercially viable books and lending them out, because insufficient demand means the publishers will simply not make them available, and finding and using them for research might require travel. Although publishers could plausibly argue that such lending interferes with their profits, in practice they will never try to make money off ebooks of these works.“These days, many patrons want and expect to have digital access to books. But publishers don’t choose to make their full catalogs available through ebook licensing, and they can manipulate availability as well to prioritize certain authors, subjects, etc.,” Corynne McSherry, an attorney for the Electronic Frontier Foundation, told me. “Without CDL, publishers will have unfair power over the future of books and libraries alike.”The IA is appealing the decision, but defeat could mean millions in damages as well as attorneys’ fees for the publishers. McSherry noted that “there are legal provisions that allow damages to be limited where a library has acted on the good-faith belief that it was engaged in a lawful fair use, which the Internet Archive did, and does.”Even if society never falls to the zombie hordes and the ruins of human civilization are never visited by alien archaeologists, the IA remains an irreplaceable resource for readers, scholars, and basically anyone who wants to learn. It is in such places that small sparks of inspiration have ignited eras of innovation and discovery. The fact that we can visit them without leaving our homes shouldn’t make a huge difference.",
    "summary": "A federal court ruling that controlled digital lending (CDL) violates copyright law could have disastrous implications for libraries, including having to choose between purchasing expensive ebook licenses from publishers or expanding their collections; the Internet Archive (IA), a nonprofit organisation that loans out digital copies of the millions of books it has collected and digitised, has been at the centre of a lawsuit by several book publishers who sued it in 2020 alleging copyright infringement; and it was this CDL loaning model the court ruled against last month, which could have \"unfair power over the future of books and libraries alike,\" according to attorney Corynne McSherry of the Electronic Frontier Foundation, which is representing the IA in its appeal over the ruling.",
    "hn_title": "The Ruling That Threatens the Future of Libraries",
    "original_title": "The Ruling That Threatens the Future of Libraries",
    "score": 112,
    "hn_content": "A recent article on The Atlantic about a court ruling that could harm the future of libraries has garnered attention on Hacker News. Some comments on the post suggest that the copyright laws that protect authors' interests are extended for too long, leading to large corporate publishers squatting on copyright for far too many decades. Others note that texts which are not protected by \"pre-emptive\" availability can disappear, leading to a loss of knowledge. Some even go so far as to suggest that copyright length should be cut significantly to prevent these harms.A recent ruling about controlled digital lending has sparked discussions on the topic of copyright law and public libraries. The judge concluded that lending CDL material was the legal matter and whether it affects the publisher's profits was not relevant. Some users suggest bringing a \"suit in equity\" petition against companies to provide proof of profit loss. Meanwhile, others argue that copyright law is unfair and inequitable and that the decision might increase the positive occurrence of changes being made. Some believe that copyright anarchy will reign in the presence of current decisions, while others state that libraries are public entertainment centers; the public should not be paying for them.Public libraries have been established to provide learning and piety, and were not initially designed to provide entertainment; however, libraries have adapted to their surroundings and have become places of public entertainment; libraries also need funding, which is given based on the services provided to their customers; libraries are important for communities, as they offer equal access to resources for all people, regardless of socioeconomic status; libraries have faced criticism for, at times, discarding works that may be the last remaining copies of certain niche, scholarly works.Libraries should focus on keeping books that are still relevant and in demand, using inter-library loans for niche or outdated material. Outdated books that aren't checked out should be weeded to make room for new books. The inter-library loan system is a cost-effective way to provide access to information. The act of discarding books is not new, but some people are not aware of it. Librarians do not get paid to destroy books, but may earn revenue from recycling them. Expert opinion guides the process of selecting books, but circulation stats are also important.Public libraries face the dilemma of discarding books to make space for new ones and donations. An HN user defends the process by pointing out the professional judgment required for decision-making. Guidelines recommend balancing circulation popularity, expert analysis of the book's value, and the library's mission. It is challenging to evaluate old books' relevance without ideological bias, but librarians can get help from local subject-area experts. Small and medium-sized public libraries are not research libraries and do not need to retain items for historical research. Public libraries are cultural assets and not just repositories for books. The article raises the question, \"How many authors would exist if there were never any libraries?\" The IA is pushing an idea for unlimited royalty-free digital distribution, which if normalized, could end writing as a profession, although AI-generated text may flood the market soon.Publishers are suing the Internet Archive (IA) for \"unlimited royalty-free digital distribution.\" IA insists that it wants digital first sale rights, linking digital copies to the number of physical copies owned. Sources believe controlled digital lending is illegal and also impose disadvantageous ebook lending terms on public libraries. The National Emergency Library (NEL) was perceived as the triggering factor for the lawsuit against IA after the former violated the digital lending control mechanism implemented by publishers. Controlled Digital Lending, however, could potentially endanger copyright laws' protection whilst furthering publishers' capitalisation on writers' earnings. Many authors reportedly earn minimum wages from their writings.An online discussion on a ruling regarding the Internet Archive's (IA) National Emergency Library (NEL) is more of a commentary than news. The discussion includes arguments about publishers acting as gatekeepers, and the inequitable nature of copyright law. Comments covered a range of topics, including paying workers, the impact of libraries, the thriving creative communities, and music and journalism industries undergoing a revolution. The IA lost the case when it admitted it had no controls in place with library partners and had a clear profit motive in linking to Better World Books. The discussions express concern about profit institutions pushing out artistic creativity.The post discusses a case related to digital lending, which has sparked ongoing debate. Some users argue that the information provided is not news and has been talked about extensively, while others claim that the submitted commentary offers new insights. The case involves the intersection of digital and physical ownership, with a profit motive involved. No new technology or releases are mentioned. However, the discussion provides a unique perspective on the issue at hand.",
    "hn_summary": "A court ruling on controlled digital lending and copyright laws has sparked debates, with suggestions to shorten copyright length to prevent loss of knowledge; some suggest publishers' profits should not be the issue in lending CDL material. Libraries have adapted to become public entertainment centers, and public access to resources is critical; librarians use expert opinion to balance circulation popularity, book value, and library's mission when discarding books. Publisher lawsuits against Internet Archive's unlimited royalty-free digital distribution compromise writers' earnings, and controlled digital lending could endanger copyright laws' protection. The intersection of digital and physical ownership remains a topic of debate; discussions offer unique perspectives on the issue at hand."
  },
  {
    "id": 35499996,
    "timestamp": 1681013690,
    "title": "Do Kwon converted illicit funds from LUNA to Bitcoin",
    "url": "https://cointelegraph.com/news/do-kwon-converted-stolen-funds-from-luna-to-bitcoin-s-korean-prosecutors",
    "hn_url": "http://news.ycombinator.com/item?id=35499996",
    "content": "Do Kwon converted illicit funds from LUNA to Bitcoin: S.Korean prosecutors X English Advertise Careers News Bitcoin Ethereum Altcoins Blockchain Business Policy & Regulations NFTs DeFi Adoption Markets Market News Price Indexes Market Analysis Heatmap Top 10 Cryptocurrencies Calculator Magazine Top 100 People Top 100 2022 Top 100 2021 Top 100 2020 Opinion Expert Take Interview Innovation Circle Communications Cryptopedia Explained How to Crypto Learn Glossary Research Video Podcasts Markets Pro  Prashant Jha  Apr 07, 2023 Do Kwon converted illicit funds from LUNA to Bitcoin: S.Korean prosecutors  South Korean prosecutors have contacted Binance to request a halt on withdrawals linked to Do Kwon.  15750 Total views 124 Total shares Listen to article 0:00 News Own this piece of history Collect this article as an NFTJoin us on social networksSouth Korean prosecutors have identified 414.5 billion won ($314.2 million) in illicit assets associated with Terraform Labs co-founder Do Kwon and his associates. Out of the identified illegal assets, prosecutors have linked about 91.4 billion won ($69 million) of the specified amount directly to Kwon.Although Kwon amassed millions, none of the assets tied to him are recoverable or under the jurisdiction of the South Korean authorities. This is mainly because the now-arrested former CEO reportedly converted most of the illicit funds into Bitcoin (BTC) using overseas crypto exchanges instead of investing in physical assets, per a report published by local media outlet KBS.Early investigation into the Terra collapse by the United States Securities and Exchange Commission revealed that Kwon siphoned nearly $100 million worth of Bitcoin from Terra post-collapse. In another report based on an SEC interview with former Terraform Labs, published in South Korean media, Kwon was accused of siphoning $80 million a month before the collapse of the Terra ecosystem.The South Korean authorities have requested Binance to halt any withdrawal request associated with Kwon. Binance confirmed to Cointelegraph that they are cooperating with the prosecutors and offering any assistance they need. “We provided Korean LE authorities with the requested assistance. Since we cannot comment on ongoing LE investigations, for any further comment please reach out to the prosecutors.“South Korean prosecutors are actively tracing properties associated with Terraform Labs executives to recover some illicit funds from the Terra debacle. On April 3, prosecutors seized homes and other assets to stop former Terra employees from selling things that might be tied to legal cases.In addition to the residences in Seoul owned by former CEO Shin Hyun-seong and others, the prosecutors also filed foreclosure actions against their foreign-registered vehicles, lands in Hwaseong and Gapyeong in Gyeonggi-do, and Taean in South Chungcheong Province.Related: Do Kwon faces fraud charges from US prosecutors hours after arrestTerra was a booming crypto ecosystem until its $40 billion collapse in May 2022. What was initially thought to be a market-triggered event turned out to be a clear case of fraud, with former CEO Kwon at the epicenter. According to on-chain data, In the 3 weeks leading up to the depeg of the TerraUSD (UST) stablecoin, one entity dumped over $450 million of UST on the open market. Four days after the last sale, UST started collapsing. The entity behind the massive dump was none other than Terraform Labs. TFL has been perpetrating the narrative that UST was \"attacked\". This is a false flag. In reality, TFL themselves weakened the Curve pool by irresponsibly dumping a massive amount of UST in a short timeframe. This reduced liquidity and severely weakened the peg.— FatMan (@FatManTerra) December 6, 2022Despite an arrest warrant from South Korean authorities and an Interpol red notice against his name, Kwon continued to evade arrest for nearly a year before getting caught on March 23 in Montenegro. #Bitcoin #South Korea #Binance #Terra #Regulation Add reaction Add reaction Related News An overview of fake product detection using blockchain technology Islam and crypto: How digital assets can comply with Islamic financial law CBDCs will lead to absolute government control Is Binance in hot water? CZ sued by the CFTC — Watch The Market Report US and South Korea requested extradition of Terra co-founder Do Kwon — Montenegro justice minister Terra co-founder Do Kwon’s jail time in Montenegro will be harsh: Report",
    "summary": "South Korean prosecutors have identified nearly $314.2 million worth of illicit assets linked to Terraform Labs' co-founder, Do Kwon, and his associates, of which Kwon alone is connected to about $69 million. Prosecutors have contacted Binance to halt any withdrawal request associated with Kwon. Kwon reportedly converted most of the illicit funds, which number around 414.5 billion won, into Bitcoin, and none of the assets related to him are recoverable or under the jurisdiction of South Korean authorities. Terra was a crypto ecosystem that collapsed in May 2022, in which former CEO Kwon was accused of siphoning off Bitcoin worth nearly $100 million post-collapse.",
    "hn_title": "Do Kwon converted illicit funds from LUNA to Bitcoin",
    "original_title": "Do Kwon converted illicit funds from LUNA to Bitcoin",
    "score": 105,
    "hn_content": "Former Terraform Labs CEO Do Kwon converted illicit funds from LUNA to Bitcoin, according to on-chain data. The entity behind the massive dump was Terraform Labs, and what was initially thought as a market-triggered event turned out to be a clear case of fraud with Kwon at the epicenter. Kwon's decision to use transparent blockchain transactions to convert the fraudulent funds brought to light the struggle of tracking fraud through standard banks around the world. Users on HN discuss the limitations of using privacy tools to cover tracks and the honesty of people in the crypto space.The article discusses whether intelligence evolved for competition or cooperation, with some arguing for the latter. The focus is on whether cooperation is a selective pressure that requires intelligence. The argument includes the need to survive in a changing climate and access resources, and does not rely solely on competition for pressure. Some comments add insights into the evolutionary drivers of competition, including intraspecific competition and predation. However, the trend overall is towards continuing the debate on the roles of competition and cooperation in the evolution of intelligence.",
    "hn_summary": "On-chain data shows Terraform Labs' Do Kwon's Bitcoin conversion of fraudulent LUNA funds. Exposes limitations of tracking fraud through traditional banks. HN users discuss privacy tools and honesty in the crypto space. Debate whether intelligence evolved for competition or cooperation, with some arguing for the latter. Competition and predation drive competition, but overall trend is to continue debating roles in intelligence evolution."
  },
  {
    "id": 35502151,
    "timestamp": 1681043777,
    "title": "Interview with Andrew Kelley (Zig Creator) (2021)",
    "url": "https://corecursive.com/067-zig-with-andrew-kelley/",
    "hn_url": "http://news.ycombinator.com/item?id=35502151",
    "content": "Andrew Kelley speaks on the challenges of balancing full-time employment with developing software on the side leading up to supporting oneself via open source work, how to deal with feedback, and the moral issues of commercial forking in the open source community, along with discussing his experiences with Zig - a programming language he developed for music studio projects which has since gained popularity. Kelley also delves in C programming, static linking, integer casting rules, and more.Andrew, the creator of the Zig programming language, was frustrated with certain aspects of C, including static linking and the abundance of unnecessary and preventable bugs. He also disliked the C pre-processor's complicated language and the toxic culture within the C community. Andrew's vision for Zig aimed to reduce the amount of information users needed to remember and create a less confrontational community. Zig has garnered interest and users over time, with projects such as the Pokemon rom randomizer being built on the language. Despite setbacks, Andrew dedicated time to developing Zig and now receives donations from Apple to the Zig Software Foundation.Andrew from the OKCupid code base stressed the importance of negotiating ownership of intellectual property (IP) in any spare time projects with employers. Andrew’s open source project, Zig, which he worked on outside of his full-time job, grew to a point where he calculated he could quit his job and focus on Zig using a Patreon account for financial support. Andrew described the difficulties of having a full-time job and an open-source project, however, he also found that his open-source project helped him design compiler errors.Software developer Andrew Kelley's non-profit programming language Zig, founded to support charitable initiatives including anti-human trafficking NGO Exodus Cry, operates on an \"intrinsic\" driver rather than profit, Gallagher Woolf reports in an interview for Hacker Noon with Andrew and Zig's lead developer Adam Siska. Contributors to the free, open-source software include Zig's creators and those who appreciate its \"horizontal\" approach to ensuring memory safety. While Zig shares LLVM dependencies with the memory-safe systems coding language Rust, Andrew says they can \"team up\" rather than compete.Zig aims to make pointers safer, allowing them to be optional rather than null, and taking into account alignment for more secure systems. The handling of undefined behavior is seen as a tool to catch bugs by Zig's creators, while allowing for optimization of code both with and without checks. The creation of a commercial fork of Zig was allowed under its MIT license, but the deceptive tactics used by the fork creators caused concern. Despite this, the fork's commercial status did not worry Zig's creator, who saw it as more of a curiosity.Zig's creator, Andrew Kelley, talks about the language's solution to the language barrier problem in technology, as well as his confidence in the project, despite initial claims that Zig was just a \"toy language\". Kelley envisions a world where operating system courses and textbooks focus on Zig as the programming language of choice, resulting in better performance, memory usage, and stability for applications. Kelley also gives advice for open source developers, encouraging self-funding projects and believing in the project's goals to gain support.Tech Times reports on various programming-focused video courses available on the web, varying from designing principles to incident response. The courses are led by acclaimed experts in the field, taking a net running time from 48 to 201 minutes. These courses can enable new insights into programming for the expert audience.",
    "summary": "Andrew Kelley discusses his experiences developing the Zig programming language, the challenges of balancing a full-time job with open-source work, the importance of negotiating ownership of intellectual property, and the moral issues surrounding commercial forking in the open-source community. Zig is a non-profit programming language aimed at improving memory safety and reducing information overload for users. Kelley envisions Zig as the language of choice for operating systems and textbooks, leading to better application performance, memory usage, and stability. Tech Times also reports on various programming-focused video courses available online.",
    "hn_title": "Interview with Andrew Kelley (Zig Creator) (2021)",
    "original_title": "Interview with Andrew Kelley (Zig Creator) (2021)",
    "score": 102,
    "hn_content": "Interview with Andrew Kelley (Zig Creator) (2021) | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Interview with Andrew Kelley (Zig Creator) (2021) (corecursive.com)102 points by tim_sw 13 hours ago | hide | past | favorite | 13 comments   motiejus 10 hours ago        | next [–] This interview and the one with Richard Hipp about sqlite[1] resulted me in downloading and listening to all past podcasts from corecursive. I found some other gems there too[2]. Adam, the host, really knows how to get the most out of his guest, in the best way.[1]: https://corecursive.com/066-sqlite-with-richard-hipp/[2]: https://jakstys.lt/2022/my-favorite-podcast/ reply  sintezcs 8 hours ago        | parent | next [–] This! I did the same, listened to all episodes, and SQLite is also one of my favs reply  adamgordonbell 11 hours ago        | prev | next [–] Host here. Andrew was a great guest and inspired me to start a patreon, and once I did he immediately sponsored me.He really believes in crowd funding projects and supporting them. reply  lionkor 4 hours ago        | parent | next [–] I loved that episode, and all other episodes I've listened to. Thank you so much for curating such a wonderful collection of interesting stories! reply  adamgordonbell 23 minutes ago        | root | parent | next [–] Thanks for listening! reply  evacchi 12 hours ago        | prev | next [–] Love CoRecursive. The latest episode with Douglas Crockford is also great reply  eatonphil 12 hours ago        | prev | next [–] Had to double check, this isn't a new interview I think. Think it's from 2021. reply  dom96 12 hours ago        | prev | next [–] Great interview. I think the most interesting part of this to me was how someone forked Zig and tried to sell it, that must have been stressful. reply  slimsag 7 hours ago        | prev | next [–] 19:00-21:00 hits home hard for meI used to have coworkers ask 'what programmers do you look up to?', and that question always felt icky to me because it kind of implied you can't make the same choices and become your own hero.Over time, I found people whose life choices and personal advice I deeply appreciate. Andrew is definitely one; partly because of overlapping software goals, but mainly because of just how human & approachable he is. Genuinely just a great guy who wants others to succeed and share in his successes in life. reply  gavinhoward 5 hours ago        | parent | next [–] Unfortunately, I have the opposite experience with Andrew. But I'm glad you had a positive one. reply  paines 10 hours ago        | prev | next [–] Interesting what he mentioned about IRC and the C channel on freenode being horrible. Never been there but in several others. I especially like to remember the #chicken scheme channel. Those was, maybe and hopefully still is, one of the friendliest, most helpful and nicest places in the world wide web. reply  amrb 11 hours ago        | prev | next [–] Loved hearing about the history SQLite! I do feel we should capture more of the tech story's, as its hard to learn from mistakes.. if you don't know the history. reply  henry_viii 11 hours ago        | prev [–] Previous discussion:https://news.ycombinator.com/item?id=28046256 replyApplications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Corecursive's interview with Zig Creator Andrew Kelley inspires listeners to download all past podcasts on the website, discussing crowd funding projects and personal advice in separate comments. One listener appreciates the friendly atmosphere of the #chicken scheme channel. Another highlights Andrew Kelley's transparency in a forked Zig incident, but a user responds negatively to their interaction with Kelley. Overall, listeners enjoy the interview's coverage of Zig and SQLite's tech history."
  },
  {
    "id": 35501718,
    "timestamp": 1681039765,
    "title": "Show HN: Supavisor – a Postgres connection pooler written in Elixir",
    "url": "https://github.com/supabase/supavisor",
    "hn_url": "http://news.ycombinator.com/item?id=35501718",
    "content": "![Supavisor](/docs/images/supavisor-banner.png)# Supavisor - Postgres connection pooler- [Overview](#overiew)- [Motivation](#motivation)- [Architecture](#architecture)- [Docs](#docs)- [Features](#features)- [Future work](#future-work)- [Acknowledgements](#acknowledgements)- [Benchmarks](#benchmarks)- [Inspiration](#inspiration)## OverviewSupavisor is a scalable, cloud-native Postgres connection pooler. A Supavisor cluster is capable of proxying millions of Postgres end-client connections into a stateful pool of native Postgres database connections.For database managers, Supavisor simplifies the task of managing Postgres clusters by providing easy configuration of highly available Postgres clusters ([todo](#future-work)).## MotivationWe have several goals with Supavisor:- **Zero-downtime scaling**: we want to scale Postgres server compute with zero-downtime. To do this, we need an external Pooler that can buffer and re-route requests while the resizing operation is in progress.- **Handling modern connection demands**: We need a Pooler that can absorb millions of connections. We often see developers connecting to Postgres from Serverless environments, and so we also need something that works with both TCP and HTTP protocols.- **Efficiency**: Our customers pay for database processing power, and our goal is to maximize their database capacity. While PgBouncer is resource-efficient, it still consumes some resources on the database instance. By moving connection pooling to a dedicated cluster adjacent to tenant databases, we can free up additional resources to better serve customer queries.## ArchitectureSupavisor was designed to work in a cloud computing environment as a highly available cluster of nodes. Tenant configuration is stored in a highly available Postgres database. Configuration is loaded from the Supavisor database when a tenant connection pool is initiated.Connection pools are dynamic. When a tenant client connects to the Supavisor cluster the tenant pool is started and all connections to the tenant database are established. The process ID of the new tenant pool is then distributed to all nodes of the cluster and stored in an in-memory key-value store. Subsequent tenant client connections live on the inbound node but connection data is proxied from the pool node to the client connection node as needed.Because the count of Postgres connections is constrained only one tenant connection pool should be alive in a Supavisor cluster. In the case of two simultaneous client connections starting a pool, as the pool process IDs are distributed across the cluster, eventually one of those pools is gracefully shutdown.The dynamic nature of tenant database connection pools enables high availability in the event of node outages. Pool processes are monitored by each node. If a node goes down that process ID is removed from the cluster. Tenant clients will then start a new pool automatically as they reconnect to the cluster.This design enables blue-green or rolling deployments as upgrades require. A single VPC / multiple availability zone topologies is possible and can provide for greater redundancy when load balancing queries across read replicas are supported ([todo](#future-work)).## Docs- [Installation and usage](https://github.com/supabase/supavisor/wiki/Installation-and-Usage)- [Metrics](https://github.com/supabase/supavisor/wiki/Metrics)## Features- Fast - Within 90% throughput as compared to `PgBouncer` running `pgbench` locally- Scalable - 1 million Postgres connections on a cluster - 250_000 idle connections on a single 16 core node with 64GB of ram- Multi-tenant - Connect to multiple different Postgres instances/clusters- Single-tenant - Easy drop-in replacement for `PgBouncer`- Pool mode support per tenant - Transaction- Cloud-native - Cluster-able - Resilient during cluster resizing - Supports rolling and blue/green deployment strategies - NOT run in a serverless environment - NOT dependant on Kubernetes- Observable - Easily understand throughput by tenant, tenant database or individual connection - Prometheus `/metrics` endpoint- Manageable - OpenAPI spec at `/api/openapi` - SwaggarUI at `/swaggerui`- Highly available - When deployed as a Supavisor cluster and a node dies connection pools should be quickly spun up or already available on other nodes when clients reconnect- Connection buffering - Brief connection buffering for transparent database restarts or failovers## Future Work- Load balancing - Queries can be load balanced across read-replicas - Load balancing is independant of Postgres high-availability management (see below)- Query caching - Query results are optionally cached in the pool cluster and returned before hitting the tenant database- Session pooling - Like `PgBouncer`- Multi-protocol Postgres query interface - Postgres binary - HTTPS - Websocket- Postgres high-availability management - Primary database election on primary failure - Health checks - Push button read-replica configuration- Config as code - Not noly for the supavisor cluster but tenant databases and tenant database clusters as well - Pulumi / terraform support## Benchmarks### Local Benchmarks- Running `pgbench` on `PgBouncer` (transaction mode/pool size 60)```PGPASSWORD=postgres pgbench -M extended --transactions 100 --jobs 10 --client 100 -h localhost -p 6452 -U postgres postgrespgbench (15.2, server 14.6 (Debian 14.6-1.pgdg110+1))starting vacuum...end.transaction type: scaling factor: 1query mode: extendednumber of clients: 100number of threads: 10maximum number of tries: 1number of transactions per client: 100number of transactions actually processed: 10000/10000number of failed transactions: 0 (0.000%)latency average = 510.310 msinitial connection time = 31.388 mstps = 195.959361 (without initial connection time)```- Running `pgbench` on `Supavisor` (pool size 60, no logs)```PGPASSWORD=postgres pgbench -M extended --transactions 100 --jobs 10 --client 100 -h localhost -p 7654 -U postgres.localhost postgrespgbench (15.2, server 14.6 (Debian 14.6-1.pgdg110+1))starting vacuum...end.transaction type: scaling factor: 1query mode: extendednumber of clients: 100number of threads: 10maximum number of tries: 1number of transactions per client: 100number of transactions actually processed: 10000/10000number of failed transactions: 0 (0.000%)latency average = 528.463 msinitial connection time = 178.591 mstps = 189.228103 (without initial connection time)```### Load Test![Supavisor load test virtual users chart](./docs/images/load-test-vus.png)![Supavisor load test qps chart](./docs/images/load-test-qps.png)- Supavisor two node cluster - 64vCPU / 246RAM - Ubuntu 22.04.2 aarch64- 1_003_200 concurrent client connection- 20_000+ QPS- 400 tenant Postgres connection- `select * from (values (1, 'one'), (2, 'two'), (3, 'three')) as t (num,letter);`- ~50% CPU utilization (pool owner node)- 7.8G RAM usage## Acknowledgements[José Valim](https://github.com/josevalim) and the [Dashbit](https://dashbit.co/) team were incredibly helpful in informing the design decisions for Supavisor.## Inspiration- [PgBouncer](https://www.pgbouncer.org/)- [stolon](https://github.com/sorintlab/stolon)- [pgcat](https://github.com/levkk/pgcat)- [odyssey](https://github.com/yandex/odyssey)- [crunchy-proxy](https://github.com/CrunchyData/crunchy-proxy)- [pgpool](https://www.pgpool.net/mediawiki/index.php/Main_Page)- [pgagroal](https://github.com/agroal/pgagroal)## Commercial Inspiration- [proxysql.com](https://proxysql.com/)- [Amazon RDS Proxy](https://aws.amazon.com/rds/proxy/)- [Google Cloud SQL Proxy](https://github.com/GoogleCloudPlatform/cloud-sql-proxy)",
    "summary": "Supavisor is a Postgres connection pooler that can proxy millions of Postgres end-client connections into a stateful pool of native Postgres database connections via a scalable, cloud-native architecture. This system simplifies Postgres cluster management for database managers by providing easy configuration of highly available Postgres clusters, while being resource-efficient, scalable, multi-tenant, and Cloud-native. There are already benchmarks and Load tests available, which show that it can handle a million Postgres connections on a cluster and it can absorb millions of connections, making it a great choice for developers connecting to Postgres from Serverless environments. Future work includes load balancing, session pooling, Postgres high-availability management, and APIs like Postgres binary, HTTPS, and much more. José Valim and the Dashbit team helped inform the Supavisor design decisions, and it is inspired by products like PgBouncer, Amazon RDS Proxy, Google Cloud SQL Proxy, and more.",
    "hn_title": "Show HN: Supavisor – a Postgres connection pooler written in Elixir",
    "original_title": "Show HN: Supavisor – a Postgres connection pooler written in Elixir",
    "score": 100,
    "hn_content": "Show HN: Supavisor – a Postgres connection pooler written in Elixir | Hacker NewsHacker Newsnew | past | comments | ask | show | jobs | submit login Show HN: Supavisor – a Postgres connection pooler written in Elixir (github.com/supabase)100 points by kiwicopple 14 hours ago | hide | past | favorite | 19 comments hey hn, supabase ceo herethis is a postgres connection pooler. it’s similar to pgbouncer, but built with Elixir and specifically designed for multi-tenancy.it’s still under development, but it’s at a stage where we can gather a feedback from the community and you can try it yourself. we aren’t using this in production yet, but aiming to deploy it for a subset of databases in the next 2 months.We have the following benchmarks (details in the readme): - Elixir Cluster maintaining 400 connections to a single Postgres database - 1_000_000 clients connecting to the Elixir cluster - Sending 20_000 transactions per second - Consuming 7.8G RAM and ~50% CPU on a 64vCPU machinesupavisor can be run as a cluster or a single node/binary. It’s handling 90%+ of the throughput of pgbouncer on a local machine (running pgbench)we will place this in front of all supabase databases. It will eventually be able to handle multiple types of connections: traditional TCP connections, and HTTP connections for developers who are connecting to Postgres in serverless environments using Prisma, Kysely, Drizzle, etcthe proxy will serve as a connection buffer while we scale databases: scaling up compute with zero-downtime, and for scale-to-zero - triggering a server restart when a connection is initiatedfinally, i want to shout out to Jose and the Dashbit/elixir team. They were extremely helpful with the design & architecture. they have been valuable partners, and elixir continues to be an amazing language for tools like this and our Realtime server.   phamilton 1 hour ago        | next [–] Feature request that would make me consider moving off of pgbouncer: make prepared statements work in transaction pooling mode.We've found that we can double our throughput by using prepared statements, but can't do so because we use pgbouncer in transaction pooling mode.Our newer systems (on Rust) bypass pgbouncer in favor of an in process pool so we get to take advantage of prepared statements there, but our legacy systems would benefit a lot from it. reply  losvedir 1 hour ago        | prev | next [–] Looking at the repo's mix file it seems to use poolboy for pooling. Given that dashbit and José helped out, was nimble_pool considered? reply  egorr 13 hours ago        | prev | next [–] Hi, i was running these million connections benchmarks, happy to answer if you have any questions regarding this:)In short, that was pretty easy to do, only things we had to tweak to make it work were some elixir and linux limits reply  abc3sts 12 hours ago        | prev | next [–] I've had a great time contributing to this project, using Elixir to create a multi-tenant connection pooler. It's still under development, but we're excited to gather feedback and improve it. Elixir has been an awesome language to work with — let us know what you think! reply  alexdanilowicz 10 hours ago        | parent | next [–] I’m not too familiar with Elixir. Why did you choose it and why do you say it’s awesome? reply  PKop 8 hours ago        | root | parent | next [–] Runs on the Erlang Virtual Machine, also known as the BEAM. Erlang was built for scalability and fault tolerance of telephone switches by Ericsson in the 80's.Give this a watch, \"The Soul of Erlang and Elixir\". Covers a lot of what's nice about the underlying platform.https://youtu.be/JvBT4XBdoUE reply  chasers 7 hours ago        | root | parent | prev | next [–] Binary pattern matching is great for working with protocols.Erlang process monitoring makes it very easy to handle client disconnects.And Elixir makes using Erlang a bit more approachable. reply  abc3erl 5 hours ago        | root | parent | prev | next [–] I completely agree with chasers's points. Moreover, Elixir's excellent concurrency support and its fault-tolerant nature make it well-suited for handling a high number of connections, ensuring our connection pooler's reliability. reply  krainboltgreene 1 hour ago        | prev | next [–] I am so glad this exists, great work. reply  chasers 13 hours ago        | prev | next [–] Contributor here. Happy to answer any questions.An interesting bit... the syn library helps us guarantee there is only one connection pool alive on the cluster at a time and gives us callbacks to resolve the conflict if two get spun up.https://github.com/ostinelli/syn reply  jhgg 3 hours ago        | prev | next [–] at work we run pgbouncer on 4 vCPU (GCP c2-standard-4) machines, at 60% load, and they do ~15k TPS at peak, however we only peak at ~45k connections per node.however, i think that you may have a lot left on the table in terms of optimizations that can be made. these numbers seem far under the performance of what i know beam to be capable. reply  chasers 3 hours ago        | parent | next [–] Nice! Yeah really our first go at it so I’m sure we have room to improve.PgBouncer was on the same instance I’m assuming? reply  jhgg 3 hours ago        | root | parent | next [–] nah we run a pool of common pgbouncers that route to the various postgres instances we run. they also run google's cloud sql proxy as well. it's actually haproxy -> pgbouncer -> cloud sql proxy -> postgres.everything but postgres runs on one machine. we use haproxy to load balance replica connections across different pgbouncer backends for replicas of the same db. reply  chasers 2 hours ago        | root | parent | next [–] Ha! Wait but why Google Cloud SQL proxy too?If you are interested in connecting over this it would be great to connect… chase@supabase.com.We want to do load balancing too. Makes so much sense to do load balancing in the proxy. reply  dijonmusters 13 hours ago        | prev | next [–] This is so cool! Have been needing something like this for a long time! The Supabase team smashed it on this one! reply  techn00 13 hours ago        | prev | next [–] What tool did you use for the diagram? reply  kiwicopple 13 hours ago        | parent | next [–] it's custom, built with figma.we have a library of assets that our design team use. I can ask if they can open source it if you would find it useful reply  techn00 10 hours ago        | root | parent | next [–] that would be awesome, thank you reply  mildmustard 9 hours ago        | root | parent | next [–] Supabase team member here.We made the figma file 2 days ago - so we’re still figuring out the wider diagram system.But we’re planning on publishing it in the figma community as it might be useful for others.I’ll update on here once we do. reply  14 hours ago        | prev [–]          [deleted]        Applications are open for YC Summer 2023Guidelines | FAQ | Lists | API | Security | Legal | Apply to YC | ContactSearch:",
    "hn_summary": "Supabase CEO introduces Supavisor, a Postgres connection pooler built with Elixir, highlighting its similarity to Pgbouncer and designed for multi-tenancy. Supavisor's benchmarks indicate it can handle high throughput while consuming 7.8G RAM and ~50% CPU on a 64vCPU machine. Supabase plans to have Supavisor in front of all its databases, scaling-up computing with zero downtime. HN users request the addition of prepared statements in transaction pooling mode and suggestion of using Nimble_pool rather than Poolboy, while praising Elixir's concurrency support and fault-tolerant nature. One HN user shares work experience with Pgbouncer on 4 vCPU machines and another talks about their pool of common Pgbouncers that route to various PostgreSQL instances using Google's Cloud SQL proxy."
  },
  {
    "id": 35501868,
    "timestamp": 1681041175,
    "title": "New allegations of plagiarism against Roy Lichtenstein",
    "url": "https://www.theguardian.com/artanddesign/2023/apr/09/new-allegations-of-plagiarism-against-roy-lichtenstein",
    "hn_url": "http://news.ycombinator.com/item?id=35501868",
    "content": "‘It’s called stealing’: new allegations of plagiarism against Roy Lichtenstein | Roy Lichtenstein | The GuardianSkip to main contentSkip to navigationPrint subscriptions Sign inSearch jobsSearchUS editionUS editionUK editionAustralia editionInternational editionThe Guardian - Back to homeThe GuardianNewsOpinionSportCultureLifestyleShowMoreShow MoreNewsView all NewsUS newsWorld newsEnvironmentSoccerUS politicsBusinessTechScienceNewslettersFight to voteOpinionView all OpinionThe Guardian viewColumnistsLettersOpinion videosCartoonsSportView all SportSoccerNFLTennisMLBMLSNBANHLF1CultureView all CultureFilmBooksMusicArt & designTV & radioStageClassicalGamesLifestyleView all LifestyleFashionFoodRecipesLove & sexHome & gardenHealth & fitnessFamilyTravelMoneySearch input google-search SearchSupport usPrint subscriptionsUS editionUK editionAustralia editionInternational editionEurope editionSearch jobsDigital ArchiveGuardian Puzzles appGuardian LicensingThe Guardian appVideoPodcastsPicturesInside the GuardianGuardian WeeklyCrosswordsWordiplyCorrectionsFacebookTwitterSearch jobsDigital ArchiveGuardian Puzzles appGuardian LicensingFilmBooksMusicArt & designTV & radioStageClassicalGames Roy Lichtenstein in 1994. Photograph: Ullstein Bild/Getty ImagesRoy Lichtenstein in 1994. Photograph: Ullstein Bild/Getty ImagesThe ObserverRoy Lichtenstein‘It’s called stealing’: new allegations of plagiarism against Roy LichtensteinPop art founder made millions, but the comic book artists he copied struggled financiallyDalya AlbergeSun 9 Apr 2023 04.00 EDTRoy Lichtenstein never shied away from the fact that his paintings were based on copies of comic strips. But some critics of one of the founders of American pop art have long argued that “copying” was too polite a term. Now, a new film alleges that hundreds of his pieces of work can be traced to other artists.“It’s called stealing,” said comic strip artist Hy Eisman, who has just turned 96 and only recently discovered that Lichtenstein had reproduced one of his images in the 1960s. “I worked like a dog on this stupid page and this guy has $20m to show for it. If it wasn’t so tragic, it would be [funny].”He vents his anger in a new documentary, titled WHAAM! BLAM! Roy Lichtenstein and the Art of Appropriation, which shows that the original comic artists had lived austere and even destitute lives. While Lichtenstein’s paintings sold for tens of millions of dollars, their originals had earned them just a few dollars.Eisman, who has worked for almost 75 years on a huge range of publications, most recently the Popeye comic strip, is among more than 30 comic artists “appropriated” by Lichtenstein and who believe that they were cheated of recognition.Recalling that his Private Secretary comic of 1963 was cribbed for Lichtenstein’s Girl in Window of the same year, he told the Observer: “I got paid very little for the page, something like $4. He was able to turn it into a painting and make millions. When I saw that he did that to other people, I thought it was a lousy thing to do. But until now I never thought I was involved.”James L Hussey, the documentary’s director, said: “Eisman was unaware that Lichtenstein had appropriated his work until I contacted him. He was very shocked.”Roy Lichtenstein’s Blam of 1962, right, which was copied from a panel in Russ Heath’s All-American Men of War #89. Photograph: Hussey-Cotton FilmsLichtenstein, who died in 1997, is widely regarded as one of the foremost artists of the 20th century. Along with Andy Warhol, he created the pop art movement by appropriating imagery from modern American culture. His work now changes hands for millions of dollars, with the most expensive, a painting called Masterpiece, reportedly selling for $165m.The documentary features comic book expert David Barsalou, who has traced about 300 Lichtenstein works to other artists: “I thought, maybe there’s only four, five or six paintings that he did close to the originals. But it was hard to describe my feelings as I started discovering more and more over the years that his images were like just direct copies.”They include Lichtenstein’s Blam of 1962, in which a pilot ejects from an exploding plane, just like Russ Heath’s All-American Men of War #89 of the same year.Heath was appreciated for the high quality of his work, but he struggled financially. He died in 2018, having ended his days relying on charity for his food.Michael Daley, a cartoonist, said: “Comic book artists are rightly aggrieved. Aside from outright plagiarisms, technically and artistically, they are generally far better draughtsmen than Lichtenstein, who couldn’t even correctly copy the properly drawn ellipse of a jet engine’s air intake. They were also superior in their artfully dynamic and expressive compositions, every one being a master of the graphic potency of a cropped image.”But Bradford R Collins, author of the book Pop Art and professor of art history at the University of South Carolina, defended Lichtenstein: “It’s not plagiarism. It’s appropriation. With plagiarism, you’re stealing somebody’s work and using it for the same purpose they did. If Lichtenstein made comic books out of it, that would be stealing. But appropriation means you’re taking something and reusing it for a very different purpose, taking something out of a comic book and making it into a painting.“I can understand why Eisman would feel angry. I would feel the same way. But artistically, it’s not plagiarism.”skip past newsletter promotionSign up to Art WeeklyFree weekly newsletterYour weekly art world round-up, sketching out all the biggest stories, scandals and exhibitionsPrivacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply.after newsletter promotionBefore his death, Heath had expressed frustration: “I couldn’t do anything because all the characters that I did draw for comic books were, at that time, owned by the comic book company. So, if they want to sue, they could sue and have a legitimate reason to sue. But they wouldn’t make enough to bother having a suit.”Roy Lichtenstein’s Girl in Window, 1963, left, and a panel by Hy Eisman in the Private Secretary comic of the same year. Photograph: Hussey-Cotton FilmsIn the documentary, a lawyer argues that Lichtenstein’s work would be considered transformative because in most instances he added new elements rather than making an exact copy.Lichtenstein himself said: “My work has been accused of looking like the things that I copy, and it certainly does look like the things I copy… But it is that quality, whatever art is, that transforms the work of art to be something different.”Hussey said: “When Lichtenstein did this in the 1960s, he was selling these paintings for thousands of dollars. That was an irritant to a lot of these comic artists. But the bitterness grew.“As the years went by and as they moved into retirement, not only were they struggling financially, but they were also watching these paintings rise dramatically in value.”TopicsRoy LichtensteinThe ObserverComics and graphic novelsPlagiarismPaintingArtReuse this contentMost viewedMost viewedFilmBooksMusicArt & designTV & radioStageClassicalGamesNewsOpinionSportCultureLifestyleOriginal reporting and incisive analysis, direct from the Guardian every morningSign up for our emailAbout usHelpComplaints & correctionsSecureDropWork for usPrivacy policyCookie policyTerms & conditionsContact usAll topicsAll writersDigital newspaper archiveFacebookYouTubeInstagramLinkedInTwitterNewslettersAdvertise with usGuardian LabsSearch jobsBack to top© 2023 Guardian News & Media Limited or its affiliated companies. All rights reserved. (modern)",
    "summary": "New allegations of plagiarism have been made against Roy Lichtenstein, with a new film claiming that hundreds of his works can be traced to other artists. The documentary alleges that over 30 comic artists were \"appropriated\" by the founder of the pop art movement, who made millions from selling his work, whilst the original artists who were copied lived austere and even destitute lives. While some defend Lichtenstein's work as \"appropriation\", critics call it stealing, with \"outright plagiarisms\" cited alongside \"technically and artistically\" superior works copied by Lichtenstein.",
    "hn_title": "New allegations of plagiarism against Roy Lichtenstein",
    "original_title": "New allegations of plagiarism against Roy Lichtenstein",
    "score": 99,
    "hn_content": "New allegations of plagiarism against artist Roy Lichtenstein have sparked a discussion on the appropriateness and creativity of his work in the art world. While some consider his work transformative, others find it to be blatant stealing with minimal changes to existing scenes and images. Some HN users wonder what would happen if Lichtenstein's work were copied and appropriated, and whether the Lichtenstein estate could argue against such actions when many of their own pieces utilized similar tactics. The accusations of plagiarism highlight the importance of ethics and originality in the artistic community.The article discusses how art is always a product of its context and how it's often difficult to appreciate radical art of the past because it changed art so dramatically that we now take it for granted. However, some commenters argue that the artists didn't do enough to advocate for \"low\" artists, especially considering the elitism they were rebelling against. Other commenters discuss the subjectivity of art and the importance of intent. There is also a debate about whether \"appropriating\" artists should credit the original source or not, and whether the transformative nature of the art justifies not crediting the original.Controversy surrounds Roy Lichtenstein following claims that he copied existing comic book artwork and claimed it as his own, without giving adequate credit to the original artists. While some argue that Lichtenstein transforming low-value art into high-prestige art is common in the art world, others question whether he crossed a line in terms of intellectual property. The case is similar to that of Shepard Fairey's Hope, which didn't meet the bar for being transformative, or Andy Warhol's effect on Prince's photo. The arguments extend to whether or not the artwork was fair use or a copyright violation.Roy Lichtenstein's artwork, which appropriates comic book panels, has been criticised for plagiarising the work of original comic book artists like Tony Abruzzo, who created the comic book panels used in Lichtenstein's Drowning Girl. Some have defended Lichtenstein's work, arguing that he transformed cultural detritus into something considered beautiful and relevant by the high-art community. In any case, copyright and intellectual property concerns come into play; along with issues surrounding the cultural value placed on comic book art vs fine art.HN users discuss the legitimacy of Roy Lichtenstein's art, which was created by redrawing and reimagining comic book panels. Some argue that it's not stealing since Lichtenstein found a new market and marketed the art in a new way, while others believe it is copyright infringement. The debate delves into the nature of art, creation, and value in the art world. Many argue that all art is derivative and that Lichtenstein's work is no different. However, others argue that it's not about copying but about the intention and creativity behind the work. Ultimately, opinions are divided, with some seeing Lichtenstein's work as transformative and others seeing it as unoriginal.The post discusses the issue of copyright in the comic industry and how artist Roy Lichtenstein's unique marketing strategy was pivotal to modern culture, despite criticisms of him \"stealing\" from other artists. Some commenters argue that copyright laws were not properly enforced or defended, while others note the blurred line between imitation and theft in the art world. The post also highlights the fact that the original comic book artists were often viewed as lowly-paid commodities, and the publishers had no interest in turning them into respected artists. The comments include a mix of opinions on the topic, with some arguing that certain actions can still be considered theft even if they are not legally enforceable.",
    "hn_summary": "New allegations of plagiarism against Roy Lichtenstein spark discussion on ethics, originality, and appropriateness in the art world. HN users debate whether Lichtenstein's work is transformative or blatant stealing with minimal changes. Copyright and IP concerns arise, as well as issues surrounding the cultural value placed on comic book art vs fine art. The debate includes opinions on the nature of art, creation, and value in the art world. The original comic book artists were often viewed as lowly-paid commodities according to the post."
  }
]
