[
  {
    "id": 39063242,
    "title": "ஒரு மர்மமான தொடுதிரையைக் கண்டறிதல்: ஆற்றல் கண்காணிப்பு அமைப்பு மற்றும் அதன் மறைக்கப்பட்ட செயல்பாட்டை வெளிப்படுத்துதல்",
    "originLink": "https://laplab.me/posts/whats-that-touchscreen-in-my-room/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39063242",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் அவர்களுடைய குடியிருப்பில் ஒரு தொடுதிரை சாதனத்தில் தடுமாறினார், அது ஒரு ஆற்றல் கண்காணிப்பு அமைப்பாக மாறியது.",
      "முன்பே நிறுவப்பட்ட பயன்பாடுகளைக் கொண்ட பழைய ஆண்ட்ராய்டு டேப்லெட்டை அவர்கள் கண்டுபிடித்தனர், அவற்றில் ஒன்று அவற்றின் மின் பயன்பாட்டைக் கண்காணிக்க அனுமதித்தது.",
      "நெட்வொர்க் ஸ்கேனிங் மூலம், அவர்கள் ஒரு முனை.js சேவையகம், ஒரு DNS சேவையகம் மற்றும் சாதனத்தில் மறைக்கப்பட்ட SSH சேவையகம் ஆகியவற்றைக் கண்டறிந்து, அதன் கோப்புகளை ஆராய்வதற்கான அணுகலைப் பெற்றனர்."
    ],
    "commentSummary": [
      "உரையாடல் ஆற்றல் நுகர்வு, கண்காணிப்பு சாதனங்கள், IoT பாதுகாப்பு மற்றும் மின் அமைப்புகள் தொடர்பான பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "பயன்பாட்டு நுகர்வு கண்காணிப்பு, தனியுரிமை மற்றும் தரவுக் கட்டுப்பாடு பற்றிய கவலைகள் மற்றும் IoT சாதனங்களுடன் ஏமாற்றங்கள் ஆகியவற்றுடன் பயனர்கள் தங்கள் அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள்.",
      "குறிப்பிடப்பட்ட குறிப்பிட்ட தொழில்நுட்பங்களில் Jazelle DBX மற்றும் Raspberry Pico மைக்ரோகண்ட்ரோலர்கள் அடங்கும்."
    ],
    "points": 706,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1705709876
  },
  {
    "id": 39059307,
    "title": "இங்கிலாந்து தபால் அலுவலக ஊழலில் தவறான தண்டனைகளை ஏற்படுத்திய பிழைகள் பற்றிய முன் அறிவை புஜிட்சு ஒப்புக்கொள்கிறார்",
    "originLink": "https://arstechnica.com/tech-policy/2024/01/fujitsu-bugs-that-sent-innocent-people-to-prison-were-known-from-the-start/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39059307",
    "commentBody": "",
    "originSummary": [
      "இங்கிலாந்து தபால் அலுவலகத்தால் பயன்படுத்தப்படும் அதன் ஹொரைசன் அமைப்பில் மென்பொருள் பிழைகள் ஆரம்பத்தில் இருந்தே இருந்தன என்பதை புஜிட்சு ஒப்புக் கொண்டுள்ளது, இதன் விளைவாக 900 க்கும் மேற்பட்ட அஞ்சல் ஊழியர்கள் மீது தவறான வழக்கு தொடரப்பட்டது.",
      "பிழைகள் வேண்டுமென்றே தவறாக குற்றம் சாட்டப்பட்ட தனிநபர்களின் வழக்கறிஞர்களிடமிருந்து மறைக்கப்பட்டன, மேலும் சாட்சி அறிக்கைகள் தபால் அலுவலகத்தால் அமைப்பு சரியாக செயல்படுகிறது என்ற தோற்றத்தை கொடுக்க மாற்றப்பட்டன.",
      "ஏறக்குறைய 93 தண்டனைகள் ரத்து செய்யப்பட்டுள்ளன, மேலும் இழப்பீட்டு தீர்வுகள் இன்னும் நிலுவையில் உள்ளன. இந்த ஊழல் தனியார் நிறுவனங்களை தனிநபர்கள் மீது வழக்குத் தொடர அனுமதிக்கும் அமைப்பில் மாற்றங்களைத் தூண்டக்கூடும். புஜிட்சு மன்னிப்பு கோரியுள்ளார் மற்றும் பாதிக்கப்பட்டவர்களுக்கு இழப்பீடு வழங்க உதவுவதாக உறுதியளித்துள்ளார், அதே நேரத்தில் இங்கிலாந்து அரசாங்கம் விரைவாக விடுவிக்கவும் பொய்யாக தண்டிக்கப்பட்டவர்களுக்கு இழப்பீடு வழங்கவும் ஒரு புதிய சட்டத்தை அறிமுகப்படுத்த திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "புஜிட்சு சம்பந்தப்பட்ட இங்கிலாந்து தபால் அலுவலக ஊழல் சாட்சி அறிக்கைகளை சேதப்படுத்துதல், நிறுவன கலாச்சாரம் மற்றும் மென்பொருள் பிரச்சினைகள் உள்ளிட்ட பல்வேறு தலைப்புகளில் விவாதங்களைத் தூண்டியுள்ளது.",
      "இந்த ஊழல் தவறான தண்டனைகள், தனிநபர்கள் மீதான தாக்கம் மற்றும் நியாயமான சட்ட அமைப்பின் தேவை பற்றிய கவலைகளை எழுப்பியுள்ளது.",
      "மென்பொருள் உருவாக்க செயல்முறைகளில் உள்ள குறைபாடுகள், அரசாங்க கொள்முதல் மற்றும் தனியார் வழக்குகளின் பங்கு ஆகியவற்றையும் விவாதங்கள் எடுத்துக்காட்டியுள்ளன."
    ],
    "points": 454,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1705689644
  },
  {
    "id": 39057502,
    "title": "தாய்லாந்தில் 15 மில்லியன் டன் லித்தியம் கண்டுபிடிக்கப்பட்டது, இது EV லட்சியங்களை வலுப்படுத்துகிறது",
    "originLink": "https://www.malaymail.com/news/money/2024/01/19/thailand-discovers-nearly-15-million-tonnes-of-lithium/113414",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39057502",
    "commentBody": "",
    "originSummary": [
      "தாய்லாந்து சுமார் 15 மில்லியன் டன் லித்தியம் வைப்புகளைக் கண்டுபிடித்துள்ளது, இது பொலிவியா மற்றும் அர்ஜென்டினாவுக்குப் பிறகு உலகளவில் மூன்றாவது பெரிய லித்தியம் வளமாக தன்னை நிலைநிறுத்தியுள்ளது.",
      "இந்த கண்டுபிடிப்பு மின்சார வாகன உற்பத்திக்கான பிராந்திய மையமாக மாறுவதற்கான தாய்லாந்தின் இலக்குக்கு ஒரு குறிப்பிடத்தக்க வளர்ச்சியாகும்.",
      "இருப்பினும், இந்த லித்தியம் வைப்புகளின் வணிக பயன்பாடு நிச்சயமற்றதாகவே உள்ளது, மேலும் அரசாங்கம் தற்போது அவற்றின் நம்பகத்தன்மையை மதிப்பீடு செய்து வருகிறது. மின்சார வாகன பேட்டரி உற்பத்தியில் தன்னிறைவை அடைவதற்கான வாய்ப்பாக தாய்லாந்து இதைப் பார்க்கிறது."
    ],
    "commentSummary": [
      "தாய்லாந்தில் லித்தியம் படிவுகள் கண்டுபிடிக்கப்பட்டது உலகளாவிய விநியோகம் மற்றும் அதன் சாத்தியமான தாக்கங்கள் பற்றிய விவாதத்தைத் தூண்டியுள்ளது.",
      "அறிவிக்கப்பட்ட லித்தியத்தின் அளவு மற்றும் அதன் பொருளாதார நம்பகத்தன்மை குறித்து சந்தேகம் உள்ளது, தேவையை பூர்த்தி செய்வதில் அதன் முக்கியத்துவம் குறித்து சந்தேகங்களை எழுப்புகிறது.",
      "லித்தியம் பிரித்தெடுப்பதன் சுற்றுச்சூழல் தாக்கம், லித்தியம் பேட்டரிகளின் மறுசுழற்சி மற்றும் ஆற்றல் சுதந்திரத்தின் முக்கியத்துவம் போன்ற தொடர்புடைய தலைப்புகளையும் உரையாடல் ஆராய்கிறது. புவிசார் அரசியல் பரிசீலனைகள் மற்றும் வள மோதல்களும் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 429,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1705682660
  },
  {
    "id": 39057862,
    "title": "சரியான நேரத்தில் திரும்பிச் செல்லுங்கள்: 1999-ஈர்க்கப்பட்ட வலைத்தளத்துடன் வலை ஏக்கத்தை அனுபவிக்கவும்",
    "originLink": "https://billsworld.neocities.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39057862",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் 1999 சகாப்தத்திலிருந்து வலைத்தளங்களின் வடிவமைப்பு மற்றும் அழகியலைப் பிரதிபலிக்கும் ஒரு வலைத்தளத்தை உருவாக்கியுள்ளார்.",
      "அவர்கள் தங்கள் வலைத்தளத்தைப் பார்வையிடவும், தங்கள் சொந்த தளங்களில் வலை பொத்தானைக் காண்பிப்பதன் மூலம் தங்கள் வலை வளையத்தின் ஒரு பகுதியாக மாறவும் மற்றவர்களை ஊக்குவிக்கிறார்கள்.",
      "இந்த வலைத்தளம் ஏக்கத்தைத் தூண்டுவதையும், ௧௯௯௦ களின் இணையத்தின் வடிவமைப்பு போக்குகளைக் கொண்டாடுவதையும் நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "விவாதம் இணையத்தின் ஆரம்ப நாட்களுக்கான ஏக்கத்தை மையமாகக் கொண்டுள்ளது, குறிப்பாக 1990 களின் பிற்பகுதியில் வலை வடிவமைப்பு மற்றும் செயல்பாடு.",
      "பங்கேற்பாளர்கள் HTML அடிப்படையிலான தளவமைப்புகள் மற்றும் ஒன்றோடொன்று இணைக்கப்பட்ட GIFகள் மற்றும் முற்போக்கான JPEGகள் போன்ற தொழில்நுட்பங்களின் எளிமையைப் பற்றி நினைவூட்டுகிறார்கள்.",
      "சிலர் ரெட்ரோ-பாணி வலைத்தளங்களின் போக்குடன் சோர்வை வெளிப்படுத்துகிறார்கள், மற்றவர்கள் நவீன இணையம் மிகவும் மேம்பட்ட தொழில்நுட்பங்களையும் அம்சங்களையும் வழங்குகிறது என்று வாதிடுகின்றனர்."
    ],
    "points": 389,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1705684094
  },
  {
    "id": 39056169,
    "title": "அற்புதமான கண்டுபிடிப்பு: கிராபெனின் அடிப்படையிலான சிப் எலக்ட்ரான் இயக்கத்தில் சிலிக்கானை விஞ்சுகிறது",
    "originLink": "https://spectrum.ieee.org/graphene-semiconductor",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39056169",
    "commentBody": "",
    "originSummary": [
      "ஜார்ஜியா டெக் ஆராய்ச்சியாளர்கள் சிலிக்கானுடன் ஒப்பிடும்போது சிறந்த எலக்ட்ரான் இயக்கம் கொண்ட கிராபெனிலிருந்து தயாரிக்கப்பட்ட உலகின் முதல் இயக்க சிப்பை உருவாக்கியுள்ளனர்.",
      "கிராபெனின் அடிப்படையிலான சில்லுகள் வேகம் மற்றும் மின் நுகர்வு ஆகியவற்றின் அடிப்படையில் சிலிக்கான் மாற்றுகளை விஞ்சும் திறனைக் கொண்டுள்ளன.",
      "இந்த முன்னேற்றம் எதிர்காலத்தில் மிகவும் திறமையான மற்றும் மேம்பட்ட மின்னணு சாதனங்களுக்கு வழிவகுக்கும்."
    ],
    "commentSummary": [
      "எஸ்.இ.சி எனப்படும் புதிய கிராபெனின் அடிப்படையிலான சிப் உருவாக்கப்பட்டுள்ளது, இது கிராபெனின் டிரான்சிஸ்டர்கள் எதிர்கொள்ளும் பேண்ட்கேப் சிக்கலை நிவர்த்தி செய்து டிஜிட்டல் எலக்ட்ரானிக்ஸுக்கு சாத்தியமாக்குகிறது.",
      "எஸ்.இ.சி ஐப் பயன்படுத்தும் டெராஹெர்ட்ஸ் அதிர்வெண்-இயக்க டிரான்சிஸ்டர்கள் தற்போதைய சிலிக்கான் அடிப்படையிலான டிரான்சிஸ்டர்களை விட பத்து மடங்கு வேகத்தை வழங்குகின்றன.",
      "கிராபெனின் அடிப்படையிலான சில்லுகளின் திறன் குறித்து ஒரு விவாதம் உள்ளது, சிலர் அவற்றின் செயல்திறனைத் தீர்மானிக்க கூடுதல் ஆராய்ச்சி மற்றும் வளர்ச்சியின் அவசியத்தை வலியுறுத்துகின்றனர். கிராபெனின் உற்பத்தி செயல்முறை, அதன் சாத்தியமான பயன்பாடுகள் மற்றும் வரம்புகள் ஆகியவை விவாதிக்கப்படுகின்றன."
    ],
    "points": 307,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1705675961
  },
  {
    "id": 39060339,
    "title": "சாதனை படைத்த ஒற்றை-கிளஸ்டர் செப்பை உருவாக்குதல்: 1 TiB/s செயல்திறனை அடைதல்",
    "originLink": "https://ceph.io/en/news/blog/2024/ceph-a-journey-to-1tibps/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39060339",
    "commentBody": "",
    "originSummary": [
      "HDD ஆதரவு Ceph கிளஸ்டரிலிருந்து மாறும் ஒரு நிறுவனத்திற்காக 10 petabyte NVMe வரிசைப்படுத்தலை உருவாக்கி சோதனை செய்த அனுபவத்தை ஆசிரியர் பகிர்ந்து கொள்கிறார்.",
      "புதிய உள்ளமைவில் வேகமான நினைவக செயல்திறன், அதிக CPU வளங்கள் மற்றும் அதிக நெட்வொர்க் செயல்திறன் கொண்ட சிறிய முனைகள் அடங்கும்.",
      "செயல்திறன் சோதனை சீரற்ற முடிவுகள் மற்றும் செயல்திறன் வீழ்ச்சிகளுடன் சிக்கல்களை வெளிப்படுத்தியது, கர்னல்-பக்க சிக்கல்கள் மற்றும் தவறான தொகுத்தல் கொடிகள் காரணமாக இருக்கலாம், ஆனால் செயலிழப்பைத் தீர்த்து கூடுதல் சோதனையை நடத்திய பிறகு ஈர்க்கக்கூடிய முடிவுகள் அடையப்பட்டன."
    ],
    "commentSummary": [
      "பயனர்கள் வெவ்வேறு வன்பொருள் அமைப்புகளில் மென்பொருள் வரையறுக்கப்பட்ட சேமிப்பக தீர்வான செப் ஐப் பயன்படுத்துவது குறித்த தங்கள் அனுபவங்களையும் கருத்துகளையும் விவாதிக்கின்றனர்.",
      "உரையாடலில் வீடு மற்றும் தொழில்முறை அமைப்புகள் உட்பட பல்வேறு சூழல்களில் செப்பின் செயல்திறன், சிக்கலான தன்மை மற்றும் பொருத்தம் பற்றிய விவாதங்கள் அடங்கும்.",
      "EOS, glusterfs மற்றும் ZFS போன்ற பிற சேமிப்பக தீர்வுகள், அத்துடன் நெட்வொர்க்கிங் உபகரணங்கள் மற்றும் திறன்களும் விவாதத்தில் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 306,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1705694575
  },
  {
    "id": 39054671,
    "title": "பழைய SNES கட்டுப்படுத்தியை Arduino உடன் USB கேம்பேடாக மாற்றுதல்",
    "originLink": "https://blog.chybby.com/posts/building-a-usb-snes-controller",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39054671",
    "commentBody": "",
    "originSummary": [
      "டோக்கியோவில் ஒரு விண்டேஜ் SNES கட்டுப்படுத்தியை வாங்கி, அதை தங்கள் கணினிக்கான USB கட்டுப்படுத்தியாக மாற்றிய அனுபவத்தை ஆசிரியர் விவரிக்கிறார்.",
      "SNES கட்டுப்படுத்தியின் வன்பொருள் கூறுகள் மற்றும் அது பொத்தானை அழுத்துவதை எவ்வாறு அனுப்புகிறது என்பதை அவை ஆராய்கின்றன.",
      "கட்டுப்படுத்தியை நிரல் செய்ய Arduino போர்டைப் பயன்படுத்துவதற்கான அவர்களின் செயல்முறையை ஆசிரியர் விவரிக்கிறார் மற்றும் SNES பொத்தான்களை HID கேம்பேட் பொத்தான்களுக்கு ரீமேப் செய்கிறார், இதில் குறியீடு துணுக்குகள் மற்றும் அமைவு வழிமுறைகளை வழங்குதல் உட்பட."
    ],
    "commentSummary": [
      "விவாதம் DIY USB SNES கட்டுப்படுத்திகளை உருவாக்குவது மற்றும் ரெட்ரோ கேமிங் கன்ட்ரோலர்களை USB ஆக மாற்றுவதில் கவனம் செலுத்துகிறது, பயனர்கள் தங்கள் அனுபவங்களையும் கட்டுப்படுத்திகள் மற்றும் அடாப்டர்களை உருவாக்குவதற்கான நுட்பங்களையும் பகிர்ந்து கொள்கிறார்கள்.",
      "பல்வேறு கேமிங் கன்ட்ரோலர்களின் நன்மை தீமைகள் தொழில்நுட்பத்தின் வரம்புகள் மற்றும் முன்னேற்றங்களுடன் விவாதிக்கப்படுகின்றன.",
      "பிசிக்களில் யூ.எஸ்.பி எச்.ஐ.டி கேம்பேட்களைப் பயன்படுத்துவதன் நன்மைகள் மற்றும் தீமைகள் ஆராயப்படுகின்றன, இதில் ரெட்ரோ கேமிங் அமைப்புகளுக்கான அடாப்டர்கள் மற்றும் கட்டுப்படுத்திகள் கிடைப்பது உட்பட."
    ],
    "points": 279,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1705667435
  },
  {
    "id": 39056733,
    "title": "இ-காமர்ஸ் மோசடியில் பொய் குற்றம் சாட்டப்பட்ட கனேடிய நபர், சட்ட சிக்கலில் சிக்கினார்",
    "originLink": "https://krebsonsecurity.com/2024/01/canadian-man-stuck-in-triangle-of-e-commerce-fraud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39056733",
    "commentBody": "",
    "originSummary": [
      "\"முக்கோண மோசடி\" என்று அழைக்கப்படும் ஒரு சிக்கலான இ-காமர்ஸ் மோசடியை திட்டமிட்டதாக பொய்யாக குற்றம் சாட்டப்பட்ட பின்னர் திமோதி பார்கர் தனது பெயரை அழிக்க முயல்கிறார்.",
      "முக்கோண மோசடி என்பது ஒரு நுகர்வோர் ஆன்லைனில் ஒரு பொருளை வாங்குவது, விற்பனையாளர் திருடப்பட்ட கட்டண அட்டை தரவைப் பயன்படுத்தி ஆன்லைன் சில்லறை விற்பனையாளரிடமிருந்து அதே பொருளை வாங்குவது மற்றும் பரிவர்த்தனையை மறுக்க எஞ்சியுள்ள ஒரே தரப்பு திருடப்பட்ட அட்டையின் உரிமையாளர்.",
      "அமேசானில் ஒரு விற்பனையாளரிடமிருந்து தனது சொந்த கட்டண அட்டையைப் பயன்படுத்தி தனது சமூகத்திற்கான பொருட்களை வாங்கியதாக பார்கர் கூறுகிறார், ஆனால் பின்னர் ஒரு ஒன்ராறியோ பெண்ணிடமிருந்து தனது வால்மார்ட் கணக்கை ஹேக் செய்ததாக குற்றச்சாட்டுகளைப் பெற்றார்.",
      "பார்க்கர் ராயல் கனடியன் மவுண்டட் போலீசாரால் கைது செய்யப்பட்டார், அவரது வேலையை இழந்தார், இப்போது அவரது வேலை வாய்ப்புகளை பாதிக்கும் ஒரு குற்றவியல் பதிவைக் கொண்டுள்ளார்.",
      "தானும் ஒன்ராறியோ பெண்ணும் முக்கோண மோசடிக்கு ஆளாகியுள்ளதாக பார்க்கர் நம்புகிறார், யாரோ ஒருவர் தனது கணக்கை ஹேக் செய்து, பார்க்கரின் பெயர் மற்றும் முகவரியை பெறுநராக சேர்த்துள்ளார்.",
      "ஆதாரங்களை வழங்கிய போதிலும், பார்க்கரின் குற்றச்சாட்டுகள் நிறுத்தி வைக்கப்பட்டன, இதனால் அவரது பெயரை அழிக்க முடியவில்லை."
    ],
    "commentSummary": [
      "மோசடி, சட்ட அமலாக்கம், இனவாதம் மற்றும் சட்ட உரிமைகள் போன்ற கனடாவில் பல்வேறு தலைப்புகளை சுருக்கம் ஆராய்கிறது.",
      "ஆர்.சி.எம்.பி.யின் தவறான நடத்தை மற்றும் தவறான குற்றச்சாட்டுகள் சம்பந்தப்பட்ட குறிப்பிட்ட வழக்குகளை இது எடுத்துக்காட்டுகிறது.",
      "சீர்திருத்தத்தின் தேவை மற்றும் பின்னணி காசோலைகள், குற்றவியல் பதிவுகள், குடியேற்ற கொள்கைகள், ஈ-காமர்ஸ் மோசடி, கிரெடிட் கார்டு பாதுகாப்பு மற்றும் மோசடிகளைத் தடுப்பதில் அமேசான் போன்ற நிறுவனங்களின் பொறுப்பு தொடர்பான சவால்களையும் சுருக்கம் உரையாற்றுகிறது."
    ],
    "points": 267,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1705678648
  },
  {
    "id": 39056902,
    "title": "சோர்ஸ்ஹூட்டின் 170 மணி நேர செயலிழப்பு: கற்றுக்கொண்ட பாடங்கள் மற்றும் எதிர்கால திட்டங்கள்",
    "originLink": "https://sourcehut.org/blog/2024-01-19-outage-post-mortem/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39056902",
    "commentBody": "",
    "originSummary": [
      "SourceHut, ஒரு தரவு மையம், DDoS தாக்குதல் மற்றும் அவசர இடம்பெயர்வு விளைவாக நீடித்த 170 மணிநேர செயலிழப்பை சந்தித்தது.",
      "சில சேவைகள் மீட்டெடுக்கப்பட்டாலும், முழுமையாக மீட்கப்படுவதில் சிரமங்களும் தாமதங்களும் ஏற்பட்டுள்ளன.",
      "உள்கட்டமைப்பை வலுப்படுத்துதல் மற்றும் பணிநீக்கத்தை மேம்படுத்துதல் போன்ற எதிர்கால சம்பவங்களைத் தடுக்க சோர்ஸ்ஹட் நடவடிக்கை எடுத்து வருகிறது, மேலும் வேலையில்லா நேரத்தைக் குறைப்பதற்கும் இதே போன்ற நிகழ்வுகளுக்கு பின்னடைவை அதிகரிப்பதற்கும் தீர்வுகளை தீவிரமாக ஆராய்ந்து வருகிறது."
    ],
    "commentSummary": [
      "நெட்வொர்க் செயலிழப்புகள், சேவை வழங்குநர்களுடனான அனுபவங்கள் மற்றும் மெர்குரியல் சேவையை பராமரிப்பதில் உள்ள சிக்கல்கள் உள்ளிட்ட மென்பொருள் மேம்பாட்டு தளமான சோர்ஸ்ஹட் தொடர்பான பல்வேறு தலைப்புகளைச் சுற்றி விவாதம் சுழல்கிறது.",
      "Sourcehut மீதான DDoS தாக்குதலுக்குப் பின்னால் உள்ள உந்துதல்கள் பற்றிய ஊகங்கள் உள்ளன, அத்துடன் உள்ளடக்கக் கட்டுப்பாடுகள் மற்றும் ஒத்துழைப்பு மாதிரிகள் பற்றிய விவாதங்களும் உள்ளன.",
      "கட்டுரை SMTP அங்கீகாரம், git-அனுப்பு-மின்னஞ்சல் ஓட்டத்தைப் பயன்படுத்துவதன் நன்மைகள், திறந்த மூல திட்டங்களை பராமரிப்பதில் உள்ள சவால்கள் மற்றும் மீட்பு நேரம் மற்றும் உள்கட்டமைப்பு அமைப்பில் கிளவுட் கருவியின் தாக்கம் போன்ற தலைப்புகளையும் தொடுகிறது."
    ],
    "points": 262,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1705679740
  },
  {
    "id": 39061587,
    "title": "பயர்பாக்ஸ் முக்கிய தளங்களில் தொழில்நுட்ப சவால்களை எதிர்கொள்கிறது",
    "originLink": "https://mozilla.github.io/platform-tilt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39061587",
    "commentBody": "",
    "originSummary": [
      "பாதுகாப்பு வரம்புகள், நிலைத்தன்மை மற்றும் செயல்திறன் சிக்கல்கள் மற்றும் முதல்-தரப்பு உலாவிகளுடன் ஒப்பிடும்போது செயல்பாட்டு குறைபாடுகள் போன்ற முக்கிய மென்பொருள் தளங்களில் பயர்பாக்ஸ் எதிர்கொள்ளும் தொழில்நுட்ப சிக்கல்களை சுருக்கம் எடுத்துக்காட்டுகிறது.",
      "இந்த சிக்கல்களை நிவர்த்தி செய்ய முன்மொழியப்பட்ட மாற்றங்கள் குறிப்பிடப்பட்டுள்ளன, மேலும் விவாதம் மற்றும் விவரங்களுக்கு ஒரு தளம்-சாய்வு சிக்கல் டிராக்கரைக் குறிப்பிடுகிறது.",
      "சுருக்கம் விற்பனையாளர்களான ஆப்பிள், கூகிள் மற்றும் மைக்ரோசாப்ட் ஆகியவற்றின் அடிப்படையில் குறிப்பிட்ட சிக்கல்களை வகைப்படுத்துகிறது."
    ],
    "commentSummary": [
      "பயனரின் விருப்பமான உலாவிக்கு பதிலாக பயன்பாடுகள் தங்கள் சொந்த வலை உலாவிகளைத் தொடங்கும் பிரச்சினையைச் சுற்றி விவாதம் சுழல்கிறது, இது வலை செயல்பாட்டை உளவு பார்ப்பது மற்றும் உலாவல் வரலாற்றைப் பராமரிப்பது பற்றிய கவலைகளைத் தூண்டுகிறது.",
      "இந்த கவலைகளை நிவர்த்தி செய்வதற்கும் அவற்றின் உலாவல் அனுபவத்தின் மீது பயனர் கட்டுப்பாட்டை வழங்குவதற்கும் பயன்பாடுகளை \"வலை உலாவிகள்\" அல்லது \"வலை உலாவிகள் அல்ல\" என்று வகைப்படுத்த பரிந்துரைகள் செய்யப்படுகின்றன.",
      "எந்த களங்களுடன் தொடர்பு கொள்ளலாம் என்பதைத் தீர்மானிப்பதில் டெவலப்பர்கள் சவால்களை எதிர்கொள்கின்றனர், இது ஒரு சிறிய அனுமதிப்பட்டியலைப் பயன்படுத்த வழிவகுக்கிறது, அதே நேரத்தில் iOS சாதனங்களில் மூன்றாம் தரப்பு உலாவி என்ஜின்கள் மீதான கட்டுப்பாடுகள், குறிப்பாக சஃபாரியின் ஏகபோகம், கவலைகளை எழுப்புகின்றன. விவாதம் உலாவி ஏகபோகங்கள், செயல்திறன் ஒப்பீடுகள், தனியுரிமை சிக்கல்கள் மற்றும் வலை உலாவிகளில் பாதுகாப்பு பாதிப்புகள் ஆகியவற்றையும் தொடுகிறது."
    ],
    "points": 250,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1705700488
  },
  {
    "id": 39061800,
    "title": "நள்ளிரவு பனிப்புயலின் தேசிய அரசு தாக்குதலுக்கு மைக்ரோசாப்ட் பதிலடி",
    "originLink": "https://msrc.microsoft.com/blog/2024/01/microsoft-actions-following-attack-by-nation-state-actor-midnight-blizzard/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39061800",
    "commentBody": "",
    "originSummary": [
      "மைக்ரோசாப்ட் ஜனவரி 12, 2024 அன்று மிட்நைட் பனிப்புயல் என்ற குழுவின் தேசிய-அரசு தாக்குதலைக் கண்டறிந்தது.",
      "மூத்த தலைமை உட்பட குறைந்த எண்ணிக்கையிலான கார்ப்பரேட் மின்னஞ்சல் கணக்குகளை அணுக ஒரு சோதனை கணக்கை சமரசம் செய்வதை இந்த தாக்குதல் உள்ளடக்கியது.",
      "மைக்ரோசாப்டின் உடனடி பதில் செயல்முறை தாக்குதலைத் தணித்தது மற்றும் அச்சுறுத்தல் நடிகர் வாடிக்கையாளர் சூழல்கள், உற்பத்தி அமைப்புகள், மூலக் குறியீடு அல்லது AI அமைப்புகளை அணுகுவதைத் தடுத்தது. மைக்ரோசாப்ட் மேலும் பாதுகாப்பு நடவடிக்கைகளை எடுத்து வருகிறது மற்றும் விசாரணை தொடர்வதால் புதுப்பிப்புகளை வழங்கும்."
    ],
    "commentSummary": [
      "மைக்ரோசாப்ட் தேசிய அரசு நடிகர் மிட்நைட் பனிப்புயல் ஒரு சிறிய எண்ணிக்கையிலான கார்ப்பரேட் மின்னஞ்சல் கணக்குகளை சமரசம் செய்ததன் பாதுகாப்பு மீறலை உறுதிப்படுத்துகிறது.",
      "வாடிக்கையாளர் தரவு மற்றும் உற்பத்தி அமைப்புகள் அணுகப்படவில்லை, ஆனால் தீவிரத்தன்மை மற்றும் தரவு பாதுகாப்பு தாக்கங்கள் பற்றிய கவலைகள் உள்ளன.",
      "மீறல் மற்றும் பதிலை அனுமதித்ததற்காக மைக்ரோசாப்ட் மீதான விமர்சனம், பாதுகாப்பு நடவடிக்கைகள் பற்றிய விவாதம், பயனர்களுக்கு ஏற்படக்கூடிய விளைவுகள் மற்றும் இணைய பாதுகாப்பை மேம்படுத்துவதற்கான பரிந்துரைகள். இந்த தாக்குதலை ரஷ்ய அரசாங்கமே காரணம் என்று கூறுவது விவாதிக்கப்படுகிறது, ஊகங்கள் ஊகங்கள் ஊகிக்கப்படுகின்றன. உரையாடலில் மாற்று ஹோஸ்டிங் விருப்பங்கள், வெவ்வேறு அமைப்புகளின் பாதிப்பு மற்றும் அச்சுறுத்தல் நடிகர்களுக்கான வீடியோ கேம் போன்ற பெயர்களைப் பயன்படுத்துதல் ஆகியவை அடங்கும்."
    ],
    "points": 221,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1705701411
  },
  {
    "id": 39056403,
    "title": "ஜப்பானின் ஸ்லிம் விண்கலம் வெற்றிகரமாக நிலவில் தரையிறங்கியது, துல்லியமாக தரையிறங்கும் தொழில்நுட்பத்தை எடுத்துக்காட்டுகிறது [வீடியோ]",
    "originLink": "https://www.youtube.com/watch?v=2-yBlZplnKQ",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39056403",
    "commentBody": "",
    "originSummary": [
      "சீனாவின் சந்திர பணி SLIM என்ற விண்கலத்தைப் பயன்படுத்துகிறது, இது ஈர்ப்பு சக்திகளைப் பயன்படுத்துகிறது மற்றும் சோலார் பேனல்கள் மற்றும் ரோவர்களைக் கொண்டுள்ளது.",
      "இந்த பணி பாறை அமைப்புகளை ஆய்வு செய்வதையும், சந்திரனின் மேற்பரப்பில் உள்ள ஒலிவின் கனிமத்தை பகுப்பாய்வு செய்வதையும் நோக்கமாகக் கொண்டுள்ளது.",
      "சில சூரிய மின்கல சிக்கல்கள் இருந்தபோதிலும், விண்கலம் வெற்றிகரமாக தரையிறங்கி தகவல்தொடர்புகளை நிறுவியுள்ளது, இது துல்லியமான தரையிறங்கும் தொழில்நுட்பத்தின் முக்கியத்துவத்தையும் சந்திர ஆய்வில் உலகளாவிய ஒத்துழைப்பையும் காட்டுகிறது."
    ],
    "commentSummary": [
      "ஜப்பான் தனது முதல் மென்மையான சந்திர தரையிறக்கத்தை SLIM விண்கலத்துடன் அடைந்துள்ளது, ஆனால் சூரிய மின்கலம் மற்றும் பேட்டரி சக்தியில் சிக்கல்களை எதிர்கொள்கிறது.",
      "பேட்டரி செயலிழக்கும் முன் குழு தரவுகளை சேகரித்து வருகிறது, இது சரியான சோலார் பேனல் செயல்பாடு இல்லாமல் பணியின் வெற்றி குறித்த கவலைகளை எழுப்புகிறது.",
      "கோள ரோவர் LEV2, பொம்மைகள் மற்றும் ரோபோக்களை உருவாக்குவதில் டோமியின் ஈடுபாடு மற்றும் பள்ளங்களின் பெயர்கள் மற்றும் கலாச்சாரத்தில் நிலவில் தரையிறங்குவதன் தாக்கம் குறித்த விவாதங்கள் உள்ளன. விண்வெளித் திட்டத்தின் சில அம்சங்களை தனியார் நிறுவனங்களுக்கு ஜாக்ஸா துணை ஒப்பந்தம் செய்திருக்கலாம் என்று ஊகங்கள் தெரிவிக்கின்றன."
    ],
    "points": 217,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1705676819
  },
  {
    "id": 39055506,
    "title": "பிரஞ்சு சீஸ் தொழில் நுண்ணுயிர் பன்முகத்தன்மை இல்லாததால் அச்சுறுத்தலை எதிர்கொள்கிறது",
    "originLink": "https://news.cnrs.fr/articles/french-cheese-under-threat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39055506",
    "commentBody": "",
    "originSummary": [
      "உற்பத்தி முறைகளின் சீரான தன்மை காரணமாக பிரெஞ்சு நீல சீஸ் தொழில் ஆபத்தில் உள்ளது, இது நொதித்தலுக்குப் பயன்படுத்தப்படும் பூஞ்சையில் மரபணு பன்முகத்தன்மை இல்லாததற்கு வழிவகுக்கிறது.",
      "பிரெஞ்சு ஆல்ப்ஸில் உற்பத்தி செய்யப்படும் டெர்மினான் நீல சீஸ், பெனிசிலியம் ரோக்ஃபோர்டியின் தனித்துவமான மக்கள்தொகையைக் கொண்டுள்ளது, இது மரபணுக் குளத்தை பன்முகப்படுத்தவும் தொழில்துறையைக் காப்பாற்றவும் உதவும்.",
      "கேமெம்பர்ட் பாலாடைக்கட்டி தொழில் ஏற்கனவே அழிவை எதிர்கொள்கிறது, ஏனெனில் இது பெனிசிலியம் கேமெம்பர்டியின் ஒற்றை விகாரத்தை மட்டுமே நம்பியுள்ளது, இது இனப்பெருக்கம் செய்யும் திறனை இழந்துவிட்டது, இது வெவ்வேறு விகாரங்களுடன் பாலியல் இனப்பெருக்கம் மூலம் மரபணு பன்முகத்தன்மைக்கான அவசர தேவையை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "இந்த தொகுப்பில் உள்ளடக்கப்பட்ட தலைப்புகளில் பிரஞ்சு சீஸ், ஆப்பிள் பன்முகத்தன்மை, அசிங்கமான உற்பத்தி இயக்கம் மற்றும் நீல சீஸ் ஒவ்வாமை ஆகியவை அடங்கும்.",
      "பிரஞ்சு பாலாடைக்கட்டியில் நுண்ணுயிர் பன்முகத்தன்மை இல்லாதது, அமெரிக்காவில் கலப்படம் செய்யப்படாத பால் மற்றும் சீஸ் பற்றிய விதிமுறைகள், சீஸ் உற்பத்தியில் பயன்படுத்தப்படும் பாக்டீரியாக்களில் மரபணு மாற்றங்கள், சில உணவுப் பொருட்களின் கிடைக்கும் தன்மை மற்றும் விலை, உணவு கழிவுகளின் பிரச்சினை மற்றும் \"அசிங்கமான\" தயாரிப்புகளின் கருத்து மற்றும் மரபணு பன்முகத்தன்மை இல்லாததால் நீல பாலாடைக்கட்டிகளின் சாத்தியமான வீழ்ச்சி போன்ற கவலைகளை விவாதங்கள் எடுத்துக்காட்டுகின்றன.",
      "இந்த தொகுப்பு தரம், ஒழுங்குமுறைகள், நிலைத்தன்மை மற்றும் நுகர்வோர் விருப்பத்தேர்வுகள் உள்ளிட்ட உணவுத் துறையின் பல்வேறு அம்சங்களைப் பற்றிய மதிப்புமிக்க நுண்ணறிவுகளை வழங்குகிறது."
    ],
    "points": 213,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1705672865
  },
  {
    "id": 39057219,
    "title": "பொறியியலின் தத்துவத்தை ஊக்குவிக்கும் புத்தகங்கள் மற்றும் திட்டங்கள்",
    "originLink": "https://news.ycombinator.com/item?id=39057219",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39057219",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் ஒரு மென்பொருள் பொறியாளர், கணினிகள் மீது ஆர்வம் மற்றும் புதிய கருத்துக்களைக் கற்றுக்கொள்ள விரும்புகிறார்.",
      "மற்றவர்களை ஊக்குவித்த மற்றும் தனிப்பட்ட பொறியியல் தத்துவத்தை உருவாக்கிய புத்தகங்கள் மற்றும் திட்டங்களைக் கண்டுபிடிப்பதில் அவர்கள் ஆர்வமாக உள்ளனர்.",
      "அவர்கள் குறிப்பாக மென்பொருள் பொறியியல் மட்டுமல்ல, பரந்த பொறியியல் துறையிலும் பரிந்துரைகளைத் தேடுகிறார்கள்."
    ],
    "commentSummary": [
      "இது பொறியியலின் தத்துவம், மென்பொருள் வடிவமைப்பு, கணினி அறிவியல், குறியீட்டு முறை மற்றும் மோட்டார் சைக்கிள் பராமரிப்பு உள்ளிட்ட பல்வேறு தலைப்புகளில் புத்தகங்களுக்கான விவாதங்கள் மற்றும் பரிந்துரைகளின் தொகுப்பாகும்.",
      "பயனர்கள் பொறியியலின் சமூக தாக்கங்களை ஆராயும் புத்தகங்களை பரிந்துரைக்கின்றனர், தொழில்நுட்ப கலாச்சாரத்தை விமர்சிக்கிறார்கள் மற்றும் தொழில்நுட்பத்தின் தத்துவத்தை விவாதிக்கிறார்கள்.",
      "அமைப்புகளின் சிந்தனை, தகவல் நெறிமுறைகள், பொறியியலில் தரம் மற்றும் பொறியியல் மற்றும் அறிவியலில் படைப்பாற்றல் போன்ற தலைப்புகளையும் பரிந்துரைகள் உள்ளடக்குகின்றன."
    ],
    "points": 212,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1705681384
  }
]
