[
  {
    "id": 41315138,
    "title": "मैं ग्राहकों के एआई द्वारा उत्पन्न कोड को ठीक करते-करते थक गया हूँ",
    "originLink": "https://medium.com/@thetateman/im-tired-of-fixing-customers-ai-generated-code-94816bde4ceb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41315138",
    "commentBody": "",
    "originSummary": [
      "लेखक, टेट स्मिथ, ने रस्ट में क्रिप्टोक्यूरेंसी ट्रेडिंग और डेटा संग्रहण उपकरण बनाए और एपीआई एंडपॉइंट्स सेटअप करके भुगतान करने वाले ग्राहक प्राप्त किए।",
      "हालांकि एक अच्छी तरह से प्रलेखित API होने के बावजूद, कई नए उपयोगकर्ता, जो अक्सर ChatGPT जैसे AI टूल का उपयोग करते हैं, बुनियादी कार्यों के साथ संघर्ष करते हैं और AI भ्रमों के कारण त्रुटिपूर्ण कोड उत्पन्न करते हैं।",
      "सहायता अनुरोधों में वृद्धि, विशेष रूप से उन उपयोगकर्ताओं से जो असीमित मुफ्त सहायता की उम्मीद करते हैं, ने निराशा को जन्म दिया है, जिससे अनुभवहीन कोडर्स के लिए एआई प्रोग्रामिंग टूल्स के नकारात्मक पक्ष को उजागर किया है।"
    ],
    "commentSummary": [
      "कई ग्राहक कोड जनरेट करने के लिए ChatGPT जैसे एआई टूल्स पर अधिक निर्भर हो रहे हैं, जिससे अक्सर गलत आउटपुट और समर्थन स्टाफ के लिए अतिरिक्त काम होता है।",
      "गैर-तकनीकी 'विचार लोगों' का तकनीकी पहलुओं को समझे बिना तकनीकी व्यवसाय शुरू करना समस्या को और बढ़ा देता है।",
      "संभावित समाधान में बेहतर दस्तावेज़ीकरण, उन्नत सॉफ़्टवेयर विकास किट (SDKs), या समर्थन सेवाओं के लिए शुल्क लागू करना शामिल है।"
    ],
    "points": 444,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1724282181
  },
  {
    "id": 41313740,
    "title": "अमेरिकी अस्पताल ने परिवार को बताया कि उनकी बेटी ने चेक-आउट कर लिया है, जबकि वास्तव में उसकी मृत्यु हो चुकी थी",
    "originLink": "https://www.theguardian.com/us-news/article/2024/aug/21/sacramento-hospital-patient-death-checked-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41313740",
    "commentBody": "",
    "originSummary": [
      "जेसी मैरी पीटरसन के परिवार को पता चला कि वह कैलिफोर्निया के एक अस्पताल से छुट्टी मिलने के एक साल बाद मर गई थी, और उसका शव एक भंडारण सुविधा में भेज दिया गया था।",
      "परिवार ने लापरवाही और भावनात्मक संकट के लिए मर्सी सैन जुआन मेडिकल सेंटर के खिलाफ मुकदमा दायर किया है, जिसमें $5 मिलियन से अधिक के हर्जाने की मांग की गई है।",
      "डिग्निटी हेल्थ, अस्पताल के संचालक, ने सहानुभूति व्यक्त की लेकिन चल रहे मुकदमे पर टिप्पणी करने से इनकार कर दिया।"
    ],
    "commentSummary": [
      "एक अमेरिकी अस्पताल ने गलती से एक परिवार को सूचित किया कि उनकी बेटी ने चेक आउट कर लिया है, जबकि वास्तव में उसकी मृत्यु हो चुकी थी।",
      "अस्पताल ने बाद में उसके शव को एक बाहरी शवगृह में भेज दिया, जिससे विघटन के कारण शव परीक्षण असंभव हो गया।",
      "परिवार अस्पताल पर $5 मिलियन का मुकदमा कर रहा है, जो स्वास्थ्य सेवा प्रणाली में गंभीर लापरवाही और संभावित कदाचार को उजागर करता है।"
    ],
    "points": 370,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1724270868
  },
  {
    "id": 41316999,
    "title": "वाल्व द्वारा लिनक्स के लिए स्टीम प्ले प्रोटॉन की घोषणा के 6 साल पूरे होने का जश्न",
    "originLink": "https://www.gamingonlinux.com/2024/08/celebrating-6-years-since-valve-announced-steam-play-proton-for-linux/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316999",
    "commentBody": "",
    "originSummary": [
      "आज वाल्व के स्टीम प्ले प्रोटॉन की 6वीं वर्षगांठ है, जो लिनक्स गेमिंग के लिए एक महत्वपूर्ण विकास है, विशेष रूप से स्टीम डेक और डेस्कटॉप लिनक्स के लिए।",
      "प्रोटॉन ने 22,002 गेम्स को लिनक्स पर चलाने में सक्षम बनाया है, जिसमें 5,297 स्टीम डेक वेरिफाइड और 10,646 प्लेएबल हैं, जिससे लिनक्स उपयोगकर्ताओं के लिए गेमिंग परिदृश्य को काफी हद तक विस्तारित किया गया है।",
      "अपनी सफलता के बावजूद, प्रोटॉन की प्रमुख चुनौती एंटी-चीट समर्थन में सुधार करना है ताकि गेमिंग अनुभव को और बेहतर बनाया जा सके।"
    ],
    "commentSummary": [
      "वॉल्व का स्टीम प्ले प्रोटॉन लिनक्स के लिए अपनी 6वीं वर्षगांठ मना रहा है, जो विंडोज गेम्स को लिनक्स पर बिना किसी रुकावट के चलाने में सक्षम बनाने में एक महत्वपूर्ण मील का पत्थर है।",
      "उपयोगकर्ताओं का कहना है कि उनके स्टीम लाइब्रेरी के प्रमुख गेम्स लिनक्स पर बिना किसी समस्या के चलते हैं, जिसका श्रेय प्रोटॉन को जाता है, जो वाइन, DXVK और अन्य उपकरणों को एकीकृत करके संगतता सुनिश्चित करता है।",
      "कुछ एंटी-चीट सिस्टम और गैर-स्टीम खेलों के साथ चुनौतियों के बावजूद, समुदाय और तृतीय-पक्ष उपकरण जैसे लुट्रिस और हीरोइक लिनक्स पर गेमिंग अनुभव को बेहतर बनाने में प्रगति कर रहे हैं।"
    ],
    "points": 305,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1724303111
  },
  {
    "id": 41318222,
    "title": "SBAT क्या है और अचानक से हर कोई इसकी परवाह क्यों कर रहा है",
    "originLink": "https://mjg59.dreamwidth.org/70348.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318222",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "माइक्रोसॉफ्ट का SBAT अपडेट, जो TPM और अन्य तरीकों का उपयोग करके बूट सुरक्षा को बढ़ाने के लिए बनाया गया है, ने अनजाने में कुछ लिनक्स ड्यूल-बूट सिस्टम्स को बूट होने से रोक दिया है।",
      "उपयोगकर्ता इस समस्या का समाधान खोजने के लिए कस्टम सुरक्षित बूट कुंजियों, एकीकृत कर्नेल छवियों, और systemd-cryptenroll जैसी विधियों का अन्वेषण कर रहे हैं।",
      "यह स्थिति सुरक्षित बूट तंत्रों की जटिलताओं और संभावित खतरों को उजागर करती है, विशेष रूप से जब इसे माइक्रोसॉफ्ट जैसी एकल इकाई द्वारा नियंत्रित किया जाता है।"
    ],
    "points": 268,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1724317870
  },
  {
    "id": 41318408,
    "title": "न कोई 'हैलो', न कोई 'त्वरित कॉल', और न कोई बैठक बिना एजेंडा के",
    "originLink": "https://switowski.com/blog/no-hello-no-quick-call-no-agendaless-meetings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318408",
    "commentBody": "",
    "originSummary": [
      "बातचीत की शुरुआत 'हाय' या 'हैलो' से करने के बजाय बिना देरी के समस्या को स्पष्ट करना समय की बचत करता है; अपनी समस्या को सभी संबंधित विवरणों के साथ सीधे बताएं।",
      "एक 'त्वरित कॉल' के लिए पूछना विघटनकारी हो सकता है; लिखित संदेश अक्सर पर्याप्त होते हैं और भविष्य के संदर्भ के लिए एक रिकॉर्ड प्रदान करते हैं।",
      "एजेंडा के बिना बैठकें अप्रभावी होती हैं; एक स्पष्ट एजेंडा प्रदान करने से प्रतिभागियों को तैयारी करने में मदद मिलती है और यह सुनिश्चित होता है कि बैठक का एक उद्देश्य हो।"
    ],
    "commentSummary": [
      "यह पाठ दूरस्थ कार्य के लाभ और हानियों की जांच करता है, विशेष रूप से संचार प्रथाओं पर प्रभाव को उजागर करता है, जैसे कि सहज 'वाटर कूलर' बातचीत का नुकसान।",
      "यह त्वरित कॉल्स बनाम निर्धारित बैठकों की प्रभावशीलता पर बहस करता है, जिसमें कुछ लोग समय बचाने के लिए विस्तृत प्रारंभिक संदेशों को प्राथमिकता देते हैं, जबकि अन्य मानते हैं कि त्वरित कॉल्स रचनात्मकता और तेज समस्या-समाधान को बढ़ावा देते हैं।",
      "दूरस्थ कार्य वातावरण में उत्पादकता को सामाजिक संपर्कों के साथ संतुलित करने और स्पष्ट संचार दिशानिर्देश स्थापित करने के महत्व को भी उजागर किया गया है।"
    ],
    "points": 212,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1724319992
  },
  {
    "id": 41316598,
    "title": "अपनी खुद की घड़ी डिजाइन करना (2020)",
    "originLink": "https://willem.com/blog/2020-11-30_designing-my-own-watch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316598",
    "commentBody": "",
    "originSummary": [
      "लेखक को स्विस कंपनी ओक्स उंड जूनियर से एक कस्टम-मेड कलाई घड़ी मिली, जिससे उन्हें अपनी बड़ी ब्रांड की घड़ियों को कुछ अनोखा पाने के लिए बेचने की प्रेरणा मिली।",
      "घड़ी को विशेष विशेषताओं के साथ डिज़ाइन किया गया था: टाइटेनियम सामग्री, 36MM व्यास, जलरोधक, चमकदार सुइयाँ, स्वचालित गति, और न्यूनतम भागों के साथ एक वार्षिक कैलेंडर जटिलता।",
      "डिजाइन प्रक्रिया में कंपनी के साथ निरंतर संचार शामिल था, और COVID-19 प्रतिबंधों के बावजूद, घड़ी को लेखक के बेटे के साथ डिलीवर और अनबॉक्स किया गया, जो एक कस्टम टाइमपीस बनाने के व्यक्तिगत और संतोषजनक अनुभव को उजागर करता है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने एक कस्टम मूवमेंट का उपयोग करके एक कासियो बॉडी के साथ एक कस्टम घड़ी डिजाइन करने के अपने अनुभव को साझा किया, जिसमें एक क्लासिक डिजाइन को व्यक्तिगत बनाने का रोमांच बताया।",
      "चर्चा में कस्टम और लक्जरी घड़ियों पर विभिन्न दृष्टिकोण शामिल हैं, जिसमें कुछ उपयोगकर्ता DIY दृष्टिकोण को प्राथमिकता देते हैं और अन्य प्रतिष्ठित कंपनियों से विशेष डिजाइन का आदेश देते हैं।",
      "इस पोस्ट ने घड़ी निर्माण में तकनीकी अनुकूलन और व्यक्तिगत अभिव्यक्ति के मिश्रण के कारण रुचि जगाई, जो शौकीनों और अद्वितीय, व्यक्तिगत घड़ियों में रुचि रखने वालों दोनों को आकर्षित करती है।"
    ],
    "points": 202,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724298101
  },
  {
    "id": 41313290,
    "title": "टेक्सास ग्रिड पर रिकॉर्ड तोड़ने वाले दिन का विश्लेषण",
    "originLink": "https://blog.gridstatus.io/a-record-setting-day-in-ercot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41313290",
    "commentBody": "",
    "originSummary": [
      "20 अगस्त, 2024 को, ERCOT (टेक्सास का इलेक्ट्रिक रिलायबिलिटी काउंसिल) ने मांग, सौर उत्पादन, शुद्ध लोड, और बैटरी डिस्चार्ज में रिकॉर्ड उच्च स्तर का अनुभव किया, जिसमें कीमतें सीमा के करीब पहुंच गईं, जो बाजार के विकास को दर्शाती हैं।",
      "सौर उत्पादन ने पीक लोड के दौरान कीमतों को नियंत्रित किया, लेकिन सूर्यास्त के बाद सौर उत्पादन में कमी आने पर उच्च लागत वाले संसाधनों का उपयोग किया गया, जिससे कीमतें चरम स्तर पर पहुंच गईं।",
      "बैटरी डिस्चार्ज ने एक नया रिकॉर्ड बनाया, और भौतिक प्रतिक्रियाशील क्षमता (PRC) में गिरावट के बावजूद, ERCOT ने संरक्षण कॉल जारी नहीं किया, जिससे ग्रिड संसाधनों में विश्वास प्रदर्शित हुआ।"
    ],
    "commentSummary": [
      "टेक्सास ने अपने ग्रिड पर 85 गीगावाट का रिकॉर्ड पीक लोड अनुभव किया, जिसमें केवल 130 मेगावाट की अतिरिक्त क्षमता थी, जो ऊर्जा प्रणाली पर तनाव को दर्शाता है।",
      "चर्चाओं में 'रश ऑवर' ऊर्जा कार्यक्रमों के वित्तीय प्रभाव, स्मार्ट उपकरणों के साथ चुनौतियाँ, और टेक्सास की ऊर्जा नीतियों और नवीकरणीय ऊर्जा का प्रभाव शामिल था।",
      "उपयोगकर्ताओं ने राष्ट्रीय ग्रिड से जुड़ने के संभावित लाभों पर भी बहस की और पवन, सौर, और बैटरी भंडारण की तेजी से तैनाती के साथ-साथ ऊर्जा मांग पर क्रिप्टो माइनिंग के प्रभाव को भी नोट किया।"
    ],
    "points": 200,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1724267928
  },
  {
    "id": 41316342,
    "title": "लिंकर्स कैसे काम करते हैं पर गहन अध्ययन (2008)",
    "originLink": "https://lwn.net/Articles/276782/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316342",
    "commentBody": "",
    "originSummary": [
      "इयान लांस टेलर के लिंकर्स पर 20-भाग के निबंध को एक उपयोगकर्ता द्वारा एक सामग्री तालिका (ToC) में संकलित किया गया है, जो श्रृंखला का एक संरचित अवलोकन प्रदान करता है।",
      "निबंध में विभिन्न विषयों को शामिल किया गया है, जिनमें डायनामिक लिंकिंग, साझा पुस्तकालय, ELF (Executable and Linkable Format) प्रतीक, और लिंक समय अनुकूलन शामिल हैं, जो इसे लिंकर्स को समझने के लिए एक मूल्यवान संसाधन बनाता है।",
      "पूरी श्रृंखला को एक ई-बुक में बदलने के लिए एक कैलिबर रेसिपी उपलब्ध है, जो इच्छुक व्यक्तियों के लिए आसान पहुंच और पढ़ने की सुविधा प्रदान करती है।"
    ],
    "commentSummary": [
      "चर्चा का केंद्र लिंकर्स के प्रदर्शन और विकास पर है, विशेष रूप से LLD (जो LLVM का हिस्सा है) और Mold पर, जिसमें Mold अपने पूर्ववर्तियों से बेहतर प्रदर्शन कर रहा है।",
      "एप्पल ने मोल्ड के समान एक नया लिंकर्स जारी किया है, जिससे तकनीकी उत्साही लोगों के बीच नई रुचि और चर्चाएं शुरू हो गई हैं।",
      "वार्तालाप में लिंकर्स पर संसाधनों और लेखों का उल्लेख शामिल है, जो आधुनिक मेमोरी की प्रचुरता के बावजूद उनकी महत्ता को उजागर करते हैं और साझा लाइब्रेरियों को संभावित सुरक्षा जोखिमों के रूप में संबोधित करते हैं।"
    ],
    "points": 195,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724294838
  },
  {
    "id": 41317280,
    "title": "शोक और आगे बढ़ना: करियर छोड़ने के लिए अनुष्ठान (2014)",
    "originLink": "https://franceshocutt.com/2014/09/10/on-mourning-and-moving-on-rituals-for-leaving-a-career/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41317280",
    "commentBody": "",
    "originSummary": [
      "फ्रांसेस होकट ने जैविक रसायन विज्ञान में एक आशाजनक करियर छोड़ दिया, एक निर्णय जिसने करियर योजनाओं, आत्मविश्वास और वैज्ञानिक के रूप में पहचान को खोने का कारण बना।",
      "इस परिवर्तन से निपटने के लिए, फ्रांसेस ने अपने करियर के लिए एक जागरण का आयोजन किया, जिसमें दोस्तों को भोजन, पेय और कहानियाँ साझा करने के लिए आमंत्रित किया, जिससे इस बदलाव को संभालने में मदद मिली।",
      "जागरण ने हानि का शोक मनाने और सकारात्मक पहलुओं का जश्न मनाने के लिए एक सामुदायिक अनुष्ठान के रूप में कार्य किया, जिससे फ्रांसेस और उनके दोस्तों के लिए एक सहायक वातावरण प्रदान किया।"
    ],
    "commentSummary": [
      "यह पोस्ट एक करियर छोड़ने के भावनात्मक और मनोवैज्ञानिक प्रभावों, विशेष रूप से अकादमिक क्षेत्र में, और ऐसे संक्रमणों से निपटने के लिए लोग जिन अनुष्ठानों का उपयोग करते हैं, पर चर्चा करती है।",
      "यह उन व्यक्तियों के व्यक्तिगत किस्सों को उजागर करता है जिन्होंने करियर में बदलाव का अनुभव किया है, और इन परिवर्तनों को चिह्नित करने में समारोहों और सामाजिक संबंधों के महत्व पर जोर देता है।",
      "यह पोस्ट इस बात की खोज के लिए उल्लेखनीय है कि लोग अपने करियर के साथ कितनी गहराई से पहचान बना सकते हैं और महत्वपूर्ण जीवन परिवर्तनों का सामना करते समय, विशेष रूप से महामारी के दौरान, उन्हें किन चुनौतियों का सामना करना पड़ता है।"
    ],
    "points": 173,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1724306630
  },
  {
    "id": 41318133,
    "title": "एक Ghidra एक्सटेंशन जो प्रोग्राम के हिस्सों को ऑब्जेक्ट फाइलों के रूप में निर्यात करने के लिए है",
    "originLink": "https://github.com/boricj/ghidra-delinker-extension",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318133",
    "commentBody": "",
    "originSummary": [
      "एक नया Ghidra एक्सटेंशन मशीन कोड को अनरिलोकेट कर सकता है और एक सूची चयन से एक कार्यशील ऑब्जेक्ट फ़ाइल बना सकता है, जो x86 और MIPS आर्किटेक्चर के लिए COFF और ELF प्रारूपों का समर्थन करता है।",
      "यह सफलतापूर्वक लिनक्स, विंडोज, और प्लेस्टेशन निष्पादन योग्य फाइलों पर उपयोग किया गया है, जिसमें 2009 की एक व्यावसायिक वीडियो गेम निष्पादन योग्य फाइल भी शामिल है, जिसमें इसकी C रनटाइम लाइब्रेरी नहीं थी।",
      "यह विस्तार, जो प्रारंभ में एक वीडियो गेम डीकंपाइलिंग परियोजना का हिस्सा था, 2.5 वर्षों से विकास में है और अब मोडिंग, सॉफ्टवेयर पोर्ट्स, और लाइब्रेरी बनाने जैसे उपयोग मामलों के लिए लोकप्रियता प्राप्त कर रहा है।"
    ],
    "commentSummary": [
      "एक नया Ghidra एक्सटेंशन प्रोग्राम के हिस्सों को ऑब्जेक्ट फाइलों के रूप में निर्यात करने की अनुमति देता है, जो x86 और MIPS आर्किटेक्चर के लिए COFF और ELF फॉर्मेट का समर्थन करता है।",
      "इस विस्तार का व्यावहारिक उपयोग मोडिंग, सॉफ्टवेयर पोर्ट्स, और पुस्तकालयों के निर्माण में होता है, और इसे लिनक्स, विंडोज, और प्लेस्टेशन निष्पादन योग्य फाइलों पर सफलतापूर्वक उपयोग किया गया है।",
      "यह परियोजना, जो 2.5 वर्षों से विकास में है, उपयोगकर्ताओं के बीच लोकप्रियता प्राप्त कर रही है, जिसमें एमएस सीओएफएफ समर्थन जोड़ने और जटिल निष्पादन योग्य फाइलों को अलग करने जैसे उल्लेखनीय योगदान शामिल हैं।"
    ],
    "points": 164,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1724316884
  },
  {
    "id": 41315359,
    "title": "SIMD का महत्व: ग्राफ रंगाई",
    "originLink": "https://box2d.org/posts/2024/08/simd-matters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41315359",
    "commentBody": "",
    "originSummary": [
      "SIMD (सिंगल इंस्ट्रक्शन, मल्टीपल डेटा) को अक्सर गेम डेवलपमेंट में CPU प्रदर्शन को बढ़ाने की कुंजी के रूप में देखा जाता है, लेकिन व्यावहारिक लाभ प्राप्त करना चुनौतीपूर्ण हो सकता है।",
      "Box2D संस्करण 3.0 में, संपर्क बाधाओं को हल करने के लिए ग्राफ रंगाई का उपयोग करके SIMD का अन्वेषण किया गया, जिससे कई बाधाओं को एक साथ हल किया जा सकता है, जिससे प्रदर्शन में महत्वपूर्ण सुधार हुआ।",
      "बेंचमार्क परिणाम संकेत देते हैं कि SIMD कार्यान्वयन, जैसे कि SSE2 और AVX2, स्केलर गणनाओं की तुलना में महत्वपूर्ण गति लाभ प्रदान करते हैं, जिसमें Apple का M2 असाधारण प्रदर्शन दिखा रहा है।"
    ],
    "commentSummary": [
      "पोस्ट में ग्राफ रंगाई में SIMD (सिंगल इंस्ट्रक्शन, मल्टीपल डेटा) के उपयोग पर चर्चा की गई है, जो बिना रेस कंडीशंस के एक साथ कई संपर्क बाधाओं को हल करने में इसकी दक्षता को उजागर करता है।",
      "वार्तालाप में SIMD के उपयोग की चुनौतियों और लाभों पर अंतर्दृष्टि शामिल है, जैसे कि SIMD निर्देशों के लिए डेटा तैयार करने की जटिलता और इससे मिलने वाले प्रदर्शन सुधार।",
      "चर्चा में SIMD और GPU कंप्यूट शेडर्स के बीच तुलना का भी उल्लेख किया गया है, यह बताते हुए कि जबकि GPU शक्तिशाली होते हैं, कुछ कार्यों के लिए SIMD अधिक कुशल हो सकता है क्योंकि इसमें डेटा ट्रांसफर और कर्नेल लॉन्च ओवरहेड्स कम होते हैं।"
    ],
    "points": 164,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1724284542
  },
  {
    "id": 41314031,
    "title": "यूक्लिड का प्रमाण कि √2 अपरिमेय है",
    "originLink": "https://www.mathsisfun.com/numbers/euclid-square-root-2-irrational.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41314031",
    "commentBody": "",
    "originSummary": [
      "यूक्लिड का प्रमाण कि √2 अपरिमेय है, एक विधि का उपयोग करता है जिसे विरोधाभास द्वारा प्रमाण कहा जाता है, जिसमें यह मान लिया जाता है कि √2 परिमेय है और यह दिखाया जाता है कि इससे एक तार्किक असंगति उत्पन्न होती है।",
      "यह प्रमाण दर्शाता है कि यदि √2 परिमेय होता, तो इसे दो पूर्णांकों के अनुपात के रूप में व्यक्त किया जा सकता था, जिसे अनंत तक सरल किया जा सकता है, जो परिमेय संख्याओं की प्रकृति के विपरीत है।",
      "यह विधि, जिसे अनंत अवरोहण के नाम से जाना जाता है, विरोधाभास द्वारा प्रमाण की एक विशिष्ट रूप है, जो यह दर्शाती है कि √2 तर्कसंगत नहीं हो सकता और अवश्य ही अतर्कसंगत होना चाहिए।"
    ],
    "commentSummary": [
      "यूक्लिड का प्रमाण कि √2 अपरिमेय है, एक शास्त्रीय गणितीय तर्क है जो यह दर्शाता है कि 2 का वर्गमूल दो पूर्णांकों के भिन्न के रूप में व्यक्त नहीं किया जा सकता।",
      "चर्चा में बीजगणितीय पूर्णांकों की अवधारणा पर प्रकाश डाला गया है, जो ऐसे जटिल संख्याएँ होती हैं जो पूर्णांक गुणांक वाले मोनिक बहुपदों की मूल हो सकती हैं, और उनका संबंध परिमेय संख्याओं और सामान्य पूर्णांकों से होता है।",
      "इस प्रमाण का महत्व संख्या सिद्धांत में इसकी मौलिक भूमिका और अन्य गैर-पूर्ण वर्गमूल और उच्चतर मूलों में सामान्यीकृत करने की इसकी क्षमता में निहित है, जो गणितीय तर्क की गहराई और सुंदरता को प्रदर्शित करता है।"
    ],
    "points": 159,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1724272790
  },
  {
    "id": 41314039,
    "title": "क्या निम्न-स्तरीय अनुकूलन महत्वपूर्ण हैं? सीएमओवी के साथ तेज़ क्विकसॉर्ट (2020)",
    "originLink": "http://cantrip.org/sortfast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41314039",
    "commentBody": "",
    "originSummary": [
      "अध्ययन यह जांचता है कि क्या पारंपरिक सॉर्टिंग अनुकूलन अभी भी प्रासंगिक हैं, यह देखते हुए कि आधुनिक CPU आर्किटेक्चर में शाखा भविष्यवक्ता और सट्टा निष्पादन जैसी उन्नत विशेषताएं हैं।",
      "100 मिलियन पूर्णांकों पर `std::sort` का बेंचमार्किंग करने पर प्रति तत्व 73 नैनोसेकंड का समय लगा, जिसमें एक स्थिर कारक k लगभग 3 नैनोसेकंड था, और पाया गया कि रेडिक्स सॉर्ट धीमा था, जो सुधार की सीमित गुंजाइश को दर्शाता है।",
      "अनुसंधान यह दर्शाता है कि निम्न-स्तरीय अनुकूलन, जैसे `swap_if` फ़ंक्शन का उपयोग करके डेटा-निर्भर शाखाओं को समाप्त करना, प्रदर्शन को महत्वपूर्ण रूप से बढ़ा सकता है, विशेष रूप से तब जब Clang जैसे कंपाइलर इन ऑपरेशनों को `cmov` निर्देशों का उपयोग करके अनुकूलित करते हैं।"
    ],
    "commentSummary": [
      "चर्चा क्विकसॉर्ट एल्गोरिदम को अनुकूलित करने में CMOV (शर्तीय चाल) निर्देश के उपयोग के इर्द-गिर्द घूमती है, जिसमें इसके ऐतिहासिक संदर्भ और प्रदर्शन प्रभावों को उजागर किया गया है।",
      "CMOV को 1995 में Intel द्वारा Pentium Pro के साथ पेश किया गया था, न कि AMD द्वारा 2000 के आसपास, और वर्षों में विलंबता और प्रदर्शन के मामले में यह काफी विकसित हुआ है।",
      "लेख इस बात पर जोर देता है कि जबकि CMOV अप्रत्याशित शाखाओं में प्रदर्शन को सुधार सकता है, वास्तविक दुनिया का डेटा अक्सर बेंचमार्क में उपयोग किए गए रैंडम डेटा से भिन्न होता है, जिससे व्यावहारिक प्रदर्शन लाभ कम स्पष्ट हो जाते हैं।"
    ],
    "points": 158,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1724272923
  },
  {
    "id": 41321063,
    "title": "निरंतर पुनर्निर्माण: AWS में ब्लॉक स्टोरेज का संक्षिप्त इतिहास",
    "originLink": "https://www.allthingsdistributed.com/2024/08/continuous-reinvention-a-brief-history-of-block-storage-at-aws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41321063",
    "commentBody": "",
    "originSummary": [
      "मार्क ओल्सन ने AWS के इलास्टिक ब्लॉक स्टोर (EBS) को एक बुनियादी ब्लॉक स्टोरेज सेवा से बदलकर एक ऐसा सिस्टम बनाने में महत्वपूर्ण भूमिका निभाई है जो प्रतिदिन 140 ट्रिलियन से अधिक ऑपरेशनों को संभालता है।",
      "ईबीएस के विकास में प्रमुख रणनीतियों में व्यापक उपकरण, क्रमिक सुधार, संगठनात्मक डिजाइन, हार्डवेयर नवाचार, और नेटवर्क अनुकूलन शामिल हैं।",
      "महत्वपूर्ण मील के पत्थरों में 2012 में SSDs में संक्रमण, Nitro ऑफलोड कार्ड का विकास, और io2 Block Express वॉल्यूम्स के साथ उप-मिलीसेकंड IO संचालन प्राप्त करना शामिल है।"
    ],
    "commentSummary": [
      "एडब्ल्यूएस में ब्लॉक स्टोरेज का इतिहास इलास्टिक ब्लॉक स्टोर (ईबीएस) के विकास और चुनौतियों को दर्शाता है, जिसमें रेडिट जैसे शुरुआती उपयोगकर्ताओं को असंगत प्रदर्शन का सामना करना पड़ा।",
      "एडब्ल्यूएस ने ईबीएस में महत्वपूर्ण सुधार किए हैं, जैसे कि 2013 में एसएसडी को एकीकृत करना, और प्रदर्शन अनुकूलन के लिए विलंबता को समझने और दृश्यात्मक बनाने के महत्व पर जोर दिया है।",
      "लेख में क्लाउड सेवाओं में वस्तु हार्डवेयर से विशेषीकृत समाधानों की ओर बदलाव पर प्रकाश डाला गया है और नवाचार को बढ़ावा देने के लिए स्थापित समाधानों पर पुनर्विचार के मूल्य पर उद्योग विशेषज्ञों की अंतर्दृष्टि शामिल है।"
    ],
    "points": 151,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1724338754
  },
  {
    "id": 41317988,
    "title": "यशायाह – ओपन-सोर्स और सेल्फ-होस्टेड ऐप जो डॉकर से संबंधित सभी चीजों का प्रबंधन करता है",
    "originLink": "https://github.com/will-moss/isaiah",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41317988",
    "commentBody": "",
    "originSummary": [
      "इसायाह एक स्व-होस्टेबल वेब-आधारित क्लोन है जो लेज़ीडॉकर का है, जिसे दूरस्थ सर्वरों पर Docker संसाधनों को प्रबंधित करने के लिए डिज़ाइन किया गया है। यह बल्क अपडेट्स, लाइव लॉग्स, शेल एक्सेस, और Docker हब इंटीग्रेशन जैसी सुविधाएँ प्रदान करता है।",
      "यह बहु-नोड और बहु-होस्ट परिनियोजन, अंतर्निहित प्रमाणीकरण, थीमिंग, और उत्तरदायी डिज़ाइन का समर्थन करता है, जिससे यह विभिन्न परिनियोजन परिदृश्यों के लिए बहुमुखी बनता है।",
      "परिनियोजन विकल्पों में डॉकर, डॉकर कंपोज़, या एक स्टैंडअलोन एप्लिकेशन के रूप में उपयोग करना शामिल है, जिसमें विस्तृत कॉन्फ़िगरेशन और सुरक्षा सिफारिशें प्रदान की गई हैं।"
    ],
    "commentSummary": [
      "इसायाह एक ओपन-सोर्स, स्व-होस्टेड ऐप है जो डॉकर को प्रबंधित करने के लिए बनाया गया है। इसे विलमॉस द्वारा बनाया गया है और इसका उद्देश्य लेज़ीडॉकर CLI को एक वेब ऐप के रूप में पुनः निर्मित करना है।",
      "उपयोगकर्ता Isaiah की तुलना Portainer और Yacht जैसे विकल्पों से करते हैं, यह ध्यान में रखते हुए कि Portainer बहुत भारी या उपयोग में कठिन हो सकता है।",
      "चर्चा में उपयोगकर्ता की प्राथमिकताओं को Docker प्रबंधन उपकरणों के लिए उजागर किया गया है, जिसमें ग्राफिकल इंटरफेस और कमांड-लाइन इंटरफेस (CLI) के लाभों पर जोर दिया गया है।"
    ],
    "points": 128,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1724315135
  }
]
