[
  {
    "id": 41315138,
    "title": "لقد سئمت من إصلاح الأكواد التي يولدها الذكاء الاصطناعي للعملاء",
    "originLink": "https://medium.com/@thetateman/im-tired-of-fixing-customers-ai-generated-code-94816bde4ceb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41315138",
    "commentBody": "",
    "originSummary": [
      "قام المؤلف، تيت سميث، ببناء أدوات لتداول العملات المشفرة وجمع البيانات باستخدام لغة Rust وحصل على عملاء يدفعون عن طريق إعداد نقاط نهاية API.",
      "على الرغم من وجود واجهة برمجة تطبيقات موثقة جيدًا، إلا أن العديد من المستخدمين الجدد، الذين يستخدمون غالبًا أدوات الذكاء الاصطناعي مثل ChatGPT، واجهوا صعوبة في المهام الأساسية وأنتجوا شفرات مليئة بالأخطاء بسبب هلوسات الذكاء الاصطناعي.",
      "أدى تزايد طلبات الدعم، خاصة من المستخدمين الذين يتوقعون الحصول على مساعدة مجانية غير محدودة، إلى الإحباط، مما يبرز الجانب السلبي لأدوات البرمجة بالذكاء الاصطناعي للمبرمجين غير المتمرسين."
    ],
    "commentSummary": [
      "يعتمد العديد من العملاء بشكل متزايد على أدوات الذكاء الاصطناعي مثل ChatGPT لتوليد الأكواد، مما يؤدي غالبًا إلى نتائج غير صحيحة وزيادة العمل على موظفي الدعم.",
      "إن صعود الأشخاص غير التقنيين الذين يبدؤون أعمالًا تقنية دون فهم الجوانب التقنية يزيد من تفاقم المشكلة.",
      "تشمل الحلول المحتملة تحسين التوثيق، تحسين مجموعات تطوير البرمجيات (SDKs)، أو فرض رسوم على خدمات الدعم."
    ],
    "points": 444,
    "commentCount": 292,
    "retryCount": 0,
    "time": 1724282181
  },
  {
    "id": 41313740,
    "title": "أخبر مستشفى أمريكي عائلة أن ابنتهم قد غادرت المستشفى في حين أنها كانت قد توفيت بالفعل",
    "originLink": "https://www.theguardian.com/us-news/article/2024/aug/21/sacramento-hospital-patient-death-checked-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41313740",
    "commentBody": "",
    "originSummary": [
      "اكتشفت عائلة جيسي ماري بيترسون أنها توفيت بعد عام من إبلاغهم بأنها خرجت من مستشفى في كاليفورنيا، حيث تم إرسال جثتها إلى منشأة تخزين.",
      "رفعت العائلة دعوى قضائية ضد مركز ميرسي سان خوان الطبي بتهمة الإهمال والضيق العاطفي، مطالبة بتعويضات تزيد عن 5 ملايين دولار.",
      "أعربت شركة ديجنيتي هيلث، المشغلة للمستشفى، عن تعازيها لكنها رفضت التعليق على الدعوى القضائية الجارية."
    ],
    "commentSummary": [
      "أبلغ مستشفى أمريكي عائلة بالخطأ أن ابنتهم قد غادرت المستشفى في حين أنها كانت قد توفيت بالفعل.",
      "أرسل المستشفى جثتها بعد ذلك إلى مشرحة خارجية، مما جعل تشريح الجثة مستحيلاً بسبب التحلل.",
      "ترفع العائلة دعوى قضائية ضد المستشفى بمبلغ 5 ملايين دولار، مشيرة إلى إهمال جسيم واحتمال سوء الممارسة في نظام الرعاية الصحية."
    ],
    "points": 370,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1724270868
  },
  {
    "id": 41316999,
    "title": "الاحتفال بمرور 6 سنوات على إعلان شركة Valve عن Steam Play Proton لنظام Linux",
    "originLink": "https://www.gamingonlinux.com/2024/08/celebrating-6-years-since-valve-announced-steam-play-proton-for-linux/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316999",
    "commentBody": "",
    "originSummary": [
      "يصادف اليوم الذكرى السادسة لإطلاق Valve's Steam Play Proton، وهو تطور محوري لألعاب لينكس، خاصة لجهاز Steam Deck ولينكس المكتبي.",
      "مكنت Proton من تشغيل 22,002 لعبة على نظام Linux، مع 5,297 لعبة تم التحقق منها على Steam Deck و10,646 لعبة قابلة للعب، مما وسع بشكل كبير من مشهد الألعاب لمستخدمي Linux.",
      "على الرغم من نجاحه، تظل التحدي الرئيسي لـ Proton هو تحسين دعم مكافحة الغش لتعزيز تجربة الألعاب بشكل أكبر."
    ],
    "commentSummary": [
      "يحتفل Proton من Steam Play الخاص بـ Valve لنظام Linux بالذكرى السنوية السادسة له، مما يمثل إنجازًا مهمًا في تمكين تشغيل ألعاب Windows على نظام Linux بسلاسة.",
      "يُبلغ المستخدمون أن الألعاب الرائدة في مكتبات Steam الخاصة بهم تعمل بسلاسة على نظام Linux، بفضل Proton الذي يدمج Wine وDXVK وأدوات أخرى لضمان التوافق.",
      "على الرغم من بعض التحديات مع أنظمة مكافحة الغش والألعاب غير المتوفرة على Steam، فإن المجتمع والأدوات الخارجية مثل Lutris وHeroic يحققون تقدمًا في تحسين تجربة الألعاب على نظام Linux."
    ],
    "points": 305,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1724303111
  },
  {
    "id": 41318222,
    "title": "ما هو SBAT ولماذا يهتم الجميع فجأة",
    "originLink": "https://mjg59.dreamwidth.org/70348.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318222",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تحديث SBAT من مايكروسوفت، الذي يهدف إلى تعزيز أمان الإقلاع باستخدام TPM وطرق أخرى، قد منع عن غير قصد بعض أنظمة التشغيل المزدوجة مع لينكس من الإقلاع.",
      "يستكشف المستخدمون حلولًا مثل مفاتيح الإقلاع الآمن المخصصة، وصور النواة الموحدة، وsystemd-cryptenroll لمعالجة المشكلة.",
      "تؤكد هذه الحالة على تعقيدات ومخاطر آليات الإقلاع الآمن، خاصة عندما تكون تحت سيطرة كيان واحد مثل مايكروسوفت."
    ],
    "points": 268,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1724317870
  },
  {
    "id": 41318408,
    "title": "لا \"مرحبًا\"، لا \"اتصال سريع\"، ولا اجتماعات بدون جدول أعمال",
    "originLink": "https://switowski.com/blog/no-hello-no-quick-call-no-agendaless-meetings/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318408",
    "commentBody": "",
    "originSummary": [
      "بدء المحادثات بعبارة \"مرحبًا\" أو \"أهلاً\" دون شرح المشكلة فورًا يهدر الوقت؛ اذكر مشكلتك مباشرة مع جميع التفاصيل ذات الصلة.",
      "طلب إجراء مكالمة سريعة يمكن أن يكون مزعجًا؛ الرسائل المكتوبة غالبًا ما تكون كافية وتوفر سجلًا للرجوع إليه في المستقبل.",
      "الاجتماعات بدون جدول أعمال غير فعالة؛ توفير جدول أعمال واضح يسمح للمشاركين بالتحضير ويضمن أن يكون للاجتماع هدف."
    ],
    "commentSummary": [
      "يتناول النص إيجابيات وسلبيات العمل عن بُعد، مع التركيز على تأثيره على ممارسات التواصل، مثل فقدان التفاعلات العفوية التي تحدث عادةً بجانب مبرد المياه.",
      "يناقش فعالية المكالمات السريعة مقابل الاجتماعات المجدولة، حيث يفضل البعض الرسائل الأولية المفصلة لتوفير الوقت، بينما يعتقد آخرون أن المكالمات السريعة تعزز الإبداع وحل المشكلات بشكل أسرع.",
      "تُبرز أهمية تحقيق التوازن بين الإنتاجية والتفاعلات الاجتماعية ووضع إرشادات واضحة للتواصل في بيئات العمل عن بُعد."
    ],
    "points": 212,
    "commentCount": 233,
    "retryCount": 0,
    "time": 1724319992
  },
  {
    "id": 41316598,
    "title": "تصميم ساعتي الخاصة (2020)",
    "originLink": "https://willem.com/blog/2020-11-30_designing-my-own-watch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316598",
    "commentBody": "",
    "originSummary": [
      "تلقى المؤلف ساعة يد مصنوعة حسب الطلب من شركة سويسرية تدعى ochs und junior، مما دفعه لبيع ساعات العلامات التجارية الكبيرة من أجل شيء فريد.",
      "تم تصميم الساعة بميزات محددة: مادة التيتانيوم، قطر 36 ملم، مقاومة للماء، عقارب مضيئة، حركة أوتوماتيكية، وتعقيد تقويم سنوي بأجزاء قليلة.",
      "تضمن عملية التصميم تواصلًا مستمرًا مع الشركة، وعلى الرغم من قيود COVID-19، تم تسليم الساعة وفتحها مع ابن المؤلف، مما يبرز التجربة الشخصية والمُرضية في إنشاء قطعة زمنية مخصصة."
    ],
    "commentSummary": [
      "شارك أحد المستخدمين تجربته في تصميم ساعة مخصصة باستخدام هيكل كاسيو وحركة مخصصة، مشيرًا إلى الإثارة التي شعر بها عند تخصيص تصميم كلاسيكي.",
      "تشمل المناقشة وجهات نظر مختلفة حول الساعات المخصصة والفاخرة، حيث يفضل بعض المستخدمين النهج اليدوي (DIY) بينما يقوم آخرون بتكليف تصميمات مخصصة من شركات معروفة.",
      "أثار المنشور اهتمامًا بسبب المزج بين التخصيص التقني والتعبير الشخصي في صناعة الساعات، مما جذب الهواة وأولئك المهتمين بقطع الوقت الفريدة والمخصصة."
    ],
    "points": 202,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724298101
  },
  {
    "id": 41313290,
    "title": "تحليل يوم قياسي على شبكة تكساس",
    "originLink": "https://blog.gridstatus.io/a-record-setting-day-in-ercot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41313290",
    "commentBody": "",
    "originSummary": [
      "في 20 أغسطس 2024، شهد مجلس موثوقية الكهرباء في تكساس (ERCOT) ارتفاعات قياسية في الطلب وتوليد الطاقة الشمسية والحمولة الصافية وتفريغ البطاريات، مع اقتراب الأسعار من الحد الأقصى، مما يشير إلى تطور السوق.",
      "تحكمت توليد الطاقة الشمسية في الأسعار خلال ذروة الحمل، ولكن مع انخفاض الطاقة الشمسية بعد غروب الشمس، تم استخدام موارد ذات تكلفة أعلى، مما دفع الأسعار إلى مستويات الذروة.",
      "وصل تفريغ البطارية إلى رقم قياسي جديد، وعلى الرغم من انخفاض السعة الاستجابية الفيزيائية (PRC)، لم تصدر ERCOT نداءً للحفاظ على الطاقة، مما يظهر الثقة في موارد الشبكة."
    ],
    "commentSummary": [
      "شهدت تكساس حملاً قياسياً بلغ 85 جيجاوات على شبكتها، مع وجود 130 ميجاوات فقط من السعة الاحتياطية، مما يبرز الضغط على نظام الطاقة.",
      "شملت المناقشات التأثير المالي لبرامج الطاقة في \"ساعة الذروة\"، والتحديات المتعلقة بالأجهزة الذكية، وتأثير سياسات الطاقة في تكساس ومصادر الطاقة المتجددة.",
      "ناقش المستخدمون أيضًا الفوائد المحتملة للاتصال بالشبكة الوطنية وأشاروا إلى الانتشار السريع لطاقة الرياح والطاقة الشمسية وتخزين البطاريات، وكذلك تأثير تعدين العملات الرقمية على الطلب على الطاقة."
    ],
    "points": 200,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1724267928
  },
  {
    "id": 41316342,
    "title": "نظرة معمقة في كيفية عمل الرابطات (2008)",
    "originLink": "https://lwn.net/Articles/276782/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41316342",
    "commentBody": "",
    "originSummary": [
      "تم تجميع مقالة إيان لانس تايلور المكونة من 20 جزءًا حول الرابطات في جدول محتويات (ToC) بواسطة مستخدم، مما يوفر نظرة عامة منظمة على السلسلة.",
      "تغطي المقالة مواضيع متنوعة بما في ذلك الربط الديناميكي، المكتبات المشتركة، رموز ELF (تنسيق الملفات القابلة للتنفيذ والربط)، وتحسين وقت الربط، مما يجعلها مصدرًا قيمًا لفهم الرابطات.",
      "تتوفر وصفة في برنامج Calibre لتحويل السلسلة بأكملها إلى كتاب إلكتروني، مما يسهل الوصول والقراءة للأفراد المهتمين."
    ],
    "commentSummary": [
      "تتركز المناقشة حول أداء وتطور الرابطات، تحديدًا LLD (جزء من LLVM) وMold، حيث يتفوق Mold على أسلافه.",
      "أصدرت شركة آبل رابطًا جديدًا يمكن مقارنته بـ Mold، مما أثار اهتمامًا متجددًا ونقاشات بين عشاق التكنولوجيا.",
      "تتضمن المحادثة إشارات إلى الموارد والمقالات حول الرابطات، مسلطة الضوء على أهميتها رغم وفرة الذاكرة الحديثة ومعالجة المخاوف بشأن المكتبات المشتركة كاحتمالات لمخاطر أمنية."
    ],
    "points": 195,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724294838
  },
  {
    "id": 41317280,
    "title": "الحداد والمضي قدمًا: طقوس ترك مهنة (2014)",
    "originLink": "https://franceshocutt.com/2014/09/10/on-mourning-and-moving-on-rituals-for-leaving-a-career/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41317280",
    "commentBody": "",
    "originSummary": [
      "فرانسيس هوكوت تركت مسيرة مهنية واعدة في الكيمياء العضوية، وهو قرار أدى إلى فقدان خططها المهنية وثقتها وهويتها كعالمة.",
      "لمواجهة هذا الانتقال، نظمت فرانسيس حفل تأبين لمسيرتها المهنية، ودعت الأصدقاء لمشاركة الطعام والمشروبات والقصص، مما ساعد في التكيف مع التغيير.",
      "كانت السهرة بمثابة طقس جماعي للحزن على الفقدان والاحتفاء بالجوانب الإيجابية، مما وفر بيئة داعمة لكل من فرانسيس وأصدقائهم."
    ],
    "commentSummary": [
      "تتناول المقالة التأثير العاطفي والنفسي لترك مهنة، خاصة في المجال الأكاديمي، والطقوس التي يستخدمها الناس للتكيف مع مثل هذه التحولات.",
      "يسلط الضوء على الحكايات الشخصية للأفراد الذين مروا بتغييرات في مسيرتهم المهنية، مشددًا على أهمية الاحتفالات والروابط الاجتماعية في تمييز هذه التحولات.",
      "تُعتبر المقالة ملحوظة لاستكشافها مدى تعمق الناس في التعرف على هوياتهم من خلال وظائفهم والتحديات التي يواجهونها عند إجراء تغييرات كبيرة في حياتهم، خاصة خلال فترة الجائحة."
    ],
    "points": 173,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1724306630
  },
  {
    "id": 41318133,
    "title": "امتداد Ghidra لتصدير أجزاء من البرنامج كملفات كائنات",
    "originLink": "https://github.com/boricj/ghidra-delinker-extension",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41318133",
    "commentBody": "",
    "originSummary": [
      "يمكن لإضافة جديدة في Ghidra إعادة توطين كود الآلة وإنشاء ملف كائن يعمل من اختيار قائمة، وتدعم تنسيقات COFF وELF لهندسات x86 وMIPS.",
      "تم استخدامه بنجاح على ملفات التنفيذ في أنظمة لينكس وويندوز وبلاي ستيشن، بما في ذلك ملف تنفيذ لعبة فيديو تجارية من عام 2009 بدون مكتبة وقت التشغيل الخاصة بلغة C.",
      "الامتداد، الذي كان في البداية جزءًا من مشروع تفكيك لعبة فيديو، كان قيد التطوير لمدة 2.5 سنوات ويكتسب الآن زخمًا لاستخدامات مثل التعديل، ونقل البرمجيات، وإنشاء المكتبات."
    ],
    "commentSummary": [
      "إضافة جديدة لبرنامج Ghidra تتيح تصدير أجزاء من البرنامج كملفات كائن، وتدعم صيغ COFF وELF للمعماريات x86 وMIPS.",
      "للتوسعة تطبيقات عملية في التعديل، ونقل البرمجيات، وإنشاء المكتبات، وقد تم استخدامها بنجاح على أنظمة تشغيل لينكس وويندوز وملفات التشغيل الخاصة بجهاز بلايستيشن.",
      "المشروع، الذي كان قيد التطوير لمدة 2.5 سنوات، يكتسب زخمًا بين المستخدمين، مع مساهمات بارزة مثل إضافة دعم MS COFF وفصل الملفات التنفيذية المعقدة."
    ],
    "points": 164,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1724316884
  },
  {
    "id": 41315359,
    "title": "أهمية SIMD: تلوين الرسوم البيانية",
    "originLink": "https://box2d.org/posts/2024/08/simd-matters/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41315359",
    "commentBody": "",
    "originSummary": [
      "تُعتبر تقنية SIMD (تعليمات مفردة، بيانات متعددة) غالبًا مفتاحًا لتعزيز أداء وحدة المعالجة المركزية في تطوير الألعاب، ولكن يمكن أن يكون تحقيق المكاسب العملية أمرًا صعبًا.",
      "في الإصدار 3.0 من Box2D، تم استكشاف SIMD لحل قيود الاتصال باستخدام تلوين الرسوم البيانية، مما يسمح بحل قيود متعددة في وقت واحد، مما يؤدي إلى تحسينات كبيرة في الأداء.",
      "تشير نتائج الاختبارات إلى أن تنفيذات SIMD، مثل SSE2 وAVX2، توفر زيادات كبيرة في السرعة مقارنة بالحسابات العددية، مع إظهار شريحة M2 من أبل أداءً استثنائيًا."
    ],
    "commentSummary": [
      "تتناول المقالة استخدام SIMD (تعليمات واحدة، بيانات متعددة) في تلوين الرسوم البيانية، مسلطة الضوء على كفاءته في حل قيود الاتصال المتعددة في وقت واحد دون حدوث حالات سباق.",
      "تتضمن المحادثة رؤى حول التحديات والفوائد لاستخدام SIMD، مثل تعقيد تحضير البيانات لتعليمات SIMD والتحسينات في الأداء التي يمكن أن تقدمها.",
      "تتناول المناقشة أيضًا المقارنة بين SIMD وGPU compute shaders، مشيرة إلى أنه على الرغم من أن وحدات معالجة الرسومات قوية، إلا أن SIMD يمكن أن تكون أكثر كفاءة لبعض المهام بسبب انخفاض تكاليف نقل البيانات وإطلاق النواة."
    ],
    "points": 164,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1724284542
  },
  {
    "id": 41314031,
    "title": "برهان إقليدس على أن الجذر التربيعي لـ 2 عدد غير نسبي",
    "originLink": "https://www.mathsisfun.com/numbers/euclid-square-root-2-irrational.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41314031",
    "commentBody": "",
    "originSummary": [
      "يستخدم برهان إقليدس على أن الجذر التربيعي لـ 2 غير نسبي طريقة تُسمى البرهان بالتناقض، حيث يفترض أن الجذر التربيعي لـ 2 نسبي ويُظهر أن هذا يؤدي إلى تناقض منطقي.",
      "تُظهر البرهان أنه إذا كانت √2 عددًا نسبيًا، فيمكن التعبير عنه كنسبة بين عددين صحيحين، والتي يمكن تبسيطها إلى ما لا نهاية، مما يتناقض مع طبيعة الأعداد النسبية.",
      "تُعرف هذه الطريقة باسم النزول اللانهائي، وهي شكل محدد من البرهان بالتناقض، وتُبرز أن الجذر التربيعي لـ 2 لا يمكن أن يكون عددًا نسبيًا ويجب أن يكون عددًا غير نسبي."
    ],
    "commentSummary": [
      "برهان إقليدس على أن الجذر التربيعي لـ 2 غير نسبي هو حجة رياضية كلاسيكية تُظهر أن الجذر التربيعي لـ 2 لا يمكن التعبير عنه ككسر بين عددين صحيحين.",
      "تسلط المناقشة الضوء على مفهوم الأعداد الجبرية الصحيحة، وهي أعداد مركبة يمكن أن تكون جذورًا لمعادلات متعددة الحدود ذات معاملات صحيحة، وعلاقتها بالأعداد النسبية والأعداد الصحيحة المعتادة.",
      "تكمن أهمية البرهان في دوره الأساسي في نظرية الأعداد وقدرته على التعميم إلى جذور غير مربعة وغير كاملة وجذور أعلى، مما يبرز عمق وأناقة التفكير الرياضي."
    ],
    "points": 159,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1724272790
  },
  {
    "id": 41314039,
    "title": "هل تهم التحسينات ذات المستوى المنخفض؟ فرز سريع أسرع باستخدام cmov (2020)",
    "originLink": "http://cantrip.org/sortfast.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41314039",
    "commentBody": "",
    "originSummary": [
      "تبحث الدراسة فيما إذا كانت تحسينات الفرز التقليدية لا تزال ذات صلة في ظل بنى المعالجات المركزية الحديثة، التي تتميز بميزات متقدمة مثل التنبؤ بالفروع والتنفيذ التخميني.",
      "أظهرت مقارنة `std::sort` على 100 مليون عدد صحيح 73 نانوثانية لكل عنصر، مع عامل ثابت k حوالي 3 نانوثانية، ووجدت أن الفرز الشعاعي كان أبطأ، مما يشير إلى وجود مجال محدود للتحسين.",
      "تُبرز الأبحاث أن التحسينات على المستوى المنخفض، مثل إزالة الفروع المعتمدة على البيانات باستخدام دالة `swap_if`، يمكن أن تعزز الأداء بشكل كبير، خاصة عندما تقوم المترجمات مثل Clang بتحسين هذه العمليات باستخدام تعليمات `cmov`."
    ],
    "commentSummary": [
      "تدور المناقشة حول استخدام تعليمات CMOV (النقل الشرطي) في تحسين خوارزميات الفرز السريع، مع تسليط الضوء على سياقها التاريخي وآثارها على الأداء.",
      "تم تقديم CMOV بواسطة إنتل في عام 1995 مع معالج بنتيوم برو، وليس بواسطة AMD حوالي عام 2000، وقد تطورت بشكل كبير من حيث زمن الانتقال والأداء على مر السنين.",
      "تؤكد المقالة أنه على الرغم من أن CMOV يمكن أن يحسن الأداء في الفروع غير المتوقعة، إلا أن البيانات الواقعية غالبًا ما تختلف عن البيانات العشوائية المستخدمة في الاختبارات، مما يجعل تحقيق مكاسب الأداء العملية أقل وضوحًا."
    ],
    "points": 158,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1724272923
  },
  {
    "id": 41321063,
    "title": "إعادة الابتكار المستمرة: لمحة تاريخية عن تخزين الكتل في AWS",
    "originLink": "https://www.allthingsdistributed.com/2024/08/continuous-reinvention-a-brief-history-of-block-storage-at-aws.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41321063",
    "commentBody": "",
    "originSummary": [
      "لعب مارك أولسون دورًا رئيسيًا في تحويل خدمة التخزين الكتلي المرن (EBS) من أمازون ويب سيرفيسز (AWS) من خدمة تخزين كتلي أساسية إلى نظام يتعامل مع أكثر من 140 تريليون عملية يوميًا.",
      "تشمل الاستراتيجيات الرئيسية في تطور EBS الأدوات الشاملة، التحسينات التدريجية، تصميم المنظمة، الابتكارات في الأجهزة، وتحسين الشبكة.",
      "تشمل الإنجازات الهامة الانتقال إلى محركات الأقراص الصلبة SSDs في عام 2012، وتطوير بطاقة Nitro offload، وتحقيق عمليات الإدخال والإخراج دون الملي ثانية مع وحدات io2 Block Express."
    ],
    "commentSummary": [
      "تُظهر تاريخ تخزين الكتل في AWS تطور وتحديات خدمة التخزين المرن (EBS)، حيث واجه المستخدمون الأوائل مثل Reddit أداءً غير متسق.",
      "أجرت AWS تحسينات كبيرة على EBS، مثل دمج SSDs في عام 2013، وتؤكد على أهمية فهم وتصور زمن الاستجابة لتحسين الأداء.",
      "تسلط المقالة الضوء على التحول من الأجهزة السلعية إلى الحلول المتخصصة في خدمات السحابة، وتتضمن رؤى من خبراء الصناعة حول قيمة إعادة التفكير في الحلول الراسخة لدفع الابتكار."
    ],
    "points": 151,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1724338754
  },
  {
    "id": 41317988,
    "title": "إشعياء - تطبيق مفتوح المصدر ومستضاف ذاتيًا لإدارة كل شيء يتعلق بـ Docker",
    "originLink": "https://github.com/will-moss/isaiah",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41317988",
    "commentBody": "",
    "originSummary": [
      "إشعياء هو نسخة مستضافة ذاتيًا على الويب من lazydocker، مصممة لإدارة موارد Docker على الخوادم البعيدة، وتقدم ميزات مثل التحديثات الجماعية، السجلات الحية، الوصول إلى الصدفة، وتكامل Docker Hub.",
      "يدعم عمليات النشر متعددة العقد والمضيفين، ويوفر التوثيق المدمج، والتصميم القابل للتخصيص، والتصميم المتجاوب، مما يجعله متعدد الاستخدامات لمختلف سيناريوهات النشر.",
      "تشمل خيارات النشر استخدام Docker أو Docker Compose أو كتطبيق مستقل، مع توفير توصيات مفصلة للتكوين والأمان."
    ],
    "commentSummary": [
      "إشعياء هو تطبيق مفتوح المصدر ومُستضاف ذاتيًا لإدارة Docker، تم إنشاؤه بواسطة willmoss، ويهدف إلى إعادة إنشاء واجهة سطر الأوامر lazydocker كتطبيق ويب.",
      "يقارن المستخدمون بين Isaiah وبدائل مثل Portainer وYacht، مشيرين إلى أن Portainer يمكن أن يكون ثقيلًا جدًا أو صعب الاستخدام.",
      "تسلط المناقشة الضوء على تفضيلات المستخدمين لأدوات إدارة Docker، مع التأكيد على فوائد الواجهات الرسومية مقابل واجهات سطر الأوامر (CLI)."
    ],
    "points": 128,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1724315135
  }
]
