[
  {
    "title": "China's Economy Struggles Amid Weaknesses and Uncertainties",
    "originLink": "https://www.forbes.com/sites/miltonezrati/2023/11/17/chinas-economy-continues-to-look-sick/",
    "originBody": "FORBESLEADERSHIPLEADERSHIP STRATEGY China’s Economy Continues To Look Sick Milton Ezrati Senior Contributor I write on finance and economics. Nov 17, 2023,08:05am EST TOPSHOT - US President Joe Biden greets Chinese President Xi Jinping before a meeting during the ... [+] AFP VIA GETTY IMAGES When Chinese President Xi Jinping met Joe Biden recently in San Francisco, he played from a weak hand. China’s economy is falling far short of both common perceptions and Xi’s ambitions. His presidency has reached far beyond his predecessors to assert Chinese power on a global stage aggressively – economically, diplomatically, and militarily. He has managed some successes, but in the process, he has also managed to turn what was considerable western and Japanese good will into distrust and hostility. And now he finds himself presiding over the worst Chinese economic performance in decades. It must be humiliating. Except for a brief surge early in the year, China’s economy has disappointed on almost every front. October’s data paints the picture in vivid colors. According to Beijing’s National Bureau of Statistics, the Purchasing Managers Index for manufacturing activity fell to a level of 49.5 last month, down from 50.2 in September and well below the high of 52.6 last February. This latest data point is especially noteworthy, since an index level point below 50.0 indicates an outright contraction. A similar gauge for non-manufacturing – covering a composite of activity in services and construction – fell to 50.6 in October from 51.7 in September. That reading still indicates expansion but barely so. Within the report on manufacturers other figures show a decline in new orders from both domestic and foreign buyers. The former certainly results from economic weakness in both Europe and the United States, both brought on no doubt by anti-inflationary policies especially interest rate increases pursued by both the European Central Bank (ECB) and the Federal Reserve (Fed). Also, the drop in foreign orders to Chinese producers surely must reflect the growing distrust of Chinese sources shown by western governments as well as business communities in both places. And indeed, export figures from Beijing’s General Administration of Customs shows the weakness. The figure for September, the most recent number available, was up some 5 percent above August levels, but September was still some 10 percent below the level of last January, and given the more recent purchasing manager’s report, will likely show a decline when the October figures become available. Orders declines from domestic buyers surely echo the export weakness. China is after all, and despite endless Beijing rhetoric about the economy becoming more domestically oriented, very much an export-driven economy. Domestic activity largely depends on how much the foreigners are buying. More than this effect, declining domestic orders also result from a widespread hesitation among private Chinese firms to expand capacity, a legacy of both the uncertainties brought on by years of Beijing’s zero-Covid policies and Xi’s outright hostility toward private business. Beneath all this bad economic news lies the ongoing impediment to growth presented by the failure of major property developers, Evergrande and Country Garden prominent among them. At the very least, the losses in finance imposed by the inability of this giant economic sector to meet its obligations has limited how much in the way of new ventures the financial system can support. But there is more. The uncertainties surrounding these losses have kept down home buying by Chinese households. To be sure, new home sales, after a multi-year slide have of late picked up above the August lows, but at the equivalent of $55.6 billion in October, according to the China Real Estate Information Corp., they remain some 30 percent below year ago levels and still farther below peak levels from before the pandemic. Meanwhile, declines in property values have so impaired household wealth that Chinese consumers are highly reluctant to spend. MORE FOR YOU America’s Navy Shipyards Not Ready For New Super-Sized SSN(X) Subs Shakur Stevenson Vs Edwin De Los Santos Results Scorecards Reaction Thursday, November 16. Russia’s War On Ukraine: News And Information From Ukraine Beijing, after waiting much too long, has at last taken steps to promote economic growth. So far, the efforts look to be too little, too late. The People’s Bank of China (PBOC) has cut interest rates to encourage more borrowing and more spending by both individuals and businesses, but so far, these monetary moves have been timid to say the least – only fractions of a percentage point. It is hard to see how they can make much difference against powerful forces discouraging consumer spending and business investment. The government has also launched programs to spend more on infrastructure, China’s default means of stimulating the economy. The latest effort just recently announced authorizes borrowing of 1.0 trillion yuan, the equivalent of about $137 billion, to finance more projects, especially in flood ravaged provinces. Given the tepid efforts so far, it is reasonable to question whether this is enough in an economy of the equivalent of about $18 trillion. A decade ago, when Xi first won the presidency, China’s economy seemed on track to overtake that of the United States in both size and strength. China was widely expected to become a if not the dominant playing on the world stage. Xi made it clear that such was his ambition for his country. Since, China has made some progress on these fronts, but the engine supporting the entire effort – the economy – is faltering. The future now looks less Chinese than it once did and certainly seems poised to fall short of Xi’s ambitions. Follow me on Twitter. Milton Ezrati I am an economics and investment strategy consultant and serve as chief economist for the NY-based communications firm, Vested. I am a contributing editor for The National ... Read More Editorial Standards Print Reprints & Permissions",
    "originSummary": [
      "China's economy is facing significant weaknesses and is not meeting President Xi Jinping's goals.",
      "The manufacturing and non-manufacturing sectors have been particularly disappointing, with a decrease in new orders from both domestic and foreign buyers.",
      "The economic weakness is partly due to global economic conditions, including troubles in Europe and the United States, as well as a lack of trust in Chinese sources."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "UK retail sales slide in October, raising concerns for economy",
    "originLink": "https://www.reuters.com/world/uk/uk-retail-sales-slide-again-october-new-blow-economy-2023-11-17/",
    "originBody": "European Markets UK retail sales slide again in October in new blow for economy By Andy Bruce November 17, 202312:59 PM UTCUpdated an hour ago Summary Companies UK retail sales dip 0.3% in October Economists had forecast a 0.3% rise Data underlines doubtful UK economic outlook Retail sales volumes now back at 2018 levels LONDON, Nov 17 (Reuters) - British retail sales volumes fell unexpectedly in October as consumer finances remain stretched, official data showed on Friday, in a new warning sign for the economy. Retail sales volumes dropped 0.3% month-on-month, following a revised 1.1% decline in September that was worse than first estimated, the Office for National Statistics (ONS) said. Economists polled by Reuters had forecast that sales volumes would rise by 0.3% on the month in October. Advertisement · Scroll to continue Overall the figures fitted with the darkening outlook for Britain's economy, with economic growth stagnant and strong price pressures fading only slowly. Investors think these factors will force the Bank of England to lower interest rates next year. \"Retailers suggested that cost of living, reduced footfall and the wet weather in the second half of the month contributed to the fall,\" the ONS said. Excluding petrol, sales volumes fell 0.1% fall on the month. The figures also showed a downward revision for sales during the third quarter. Advertisement · Scroll to continue [1/4]People shop on Oxford Street in London, Britain April 10, 2023. REUTERS/Anna Gordon/File Photo Acquire Licensing Rights \"We remain of the view that a winter recession looks likely, as higher interest rates gradually feed through and take their toll on household and business finances,\" said Sandra Horsfield, economist from Investec bank. \"That said, we also continue to expect the downturn to be mild as a moderation in inflation should help support real purchasing power.\" Given the fine margin by which Britain avoided an economic contraction during the third quarter, Friday's figures showed a risk that GDP could yet be revised lower to a negative reading. Advertisement · Scroll to continue Compared with last year, retail sales were 2.7% lower - a worse outcome than any of the economists polled by Reuters had forecast. Retail sales volumes fell to their lowest level since early 2021 and are now no higher than they were five years ago. Still, retailers hope the crucial Christmas trading period will yield better times. Despite recent downbeat economic data and consumer surveys, major retailers including Tesco (TSCO.L), Sainsbury's (SBRY.L), Next (NXT.L), Primark (ABF.L) and Marks & Spencer (MKS.L) have sounded confident about their prospects in the run-up to Christmas. Additonal reporting by James Davey Editing by William James, Mark Potter and Elaine Hardcastle Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Read Next World category At APEC, Biden touts workers' rights, stable Chinese relations U.S. President Joe Biden said he would keep working to advance a Pacific trade pact, even as his vision for a regional deal to counter China's influence stumbled over his bid to strengthen workers' rights. U.S. Markets category Morning Bid: Treasury yields dive as oil craters, economy softens A look at the day ahead in U.S. and global markets from Mike Dolan Business category Volvo Cars shares drop to record low as Geely trims stake Shares of Swedish automaker Volvo Cars fell as much as 14% to a record low on Friday after its majority shareholder, China's Geely , sold a small part of its stake at a deep discount to the previous day's closing price. ANALYSISCheap yuan catapults China to second-biggest trade funding currency Global companies are making a beeline for China's debt markets, issuing record amounts of yuan-denominated bonds and borrowing heavily from mainland banks, capitalising on rock-bottom yuan interest rates as funding costs elsewhere jump. U.S. Markets category US equity funds draw heavy inflows on expectations for Fed pause U.S. investors were big buyers of equity funds in the seven days through Nov. 15, spurred by expectations that the Federal Reserve may pause its interest rate hikes in light of recent subdued U.S. inflation data. World category Tankers newly sanctioned by US supplied Russian oil to India Three oil tankers, newly sanctioned by Washington, regularly shipped Sokol crude from Russia's Far East to Indian Oil Corp , the country's top refiner, in recent months, according to shiptracking data from LSEG, Kpler and trade sources.",
    "originSummary": [
      "UK retail sales volumes decreased by 0.3% in October, contrary to economists' forecast of a 0.3% increase.",
      "This decline, combined with other negative economic indicators, suggests an uncertain future for the UK economy.",
      "Retail sales volumes are currently at their lowest level since early 2021 and have not improved in the past five years. However, major retailers remain optimistic about the upcoming Christmas trading period."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "US Labor Force Growth in Jeopardy: Aging Population and Foreign Workers Limit Potential",
    "originLink": "https://www.wsj.com/articles/pro-take-u-s-workers-entered-economy-in-droves-in-2023-but-dynamics-could-be-changing-a43854b8",
    "originBody": "By Bob Fernandez Nov. 17, 2023 5:30 am ET|WSJ PRO Share Resize Listen (2 min) For the U.S. labor market to grow in 2024, more people in prime working ages between 25 and 54 may need to enter the workforce, says Nick Bunker, director of North American economic research at Indeed. PHOTO: ROBERT F. BUKATY/ASSOCIATED PRESS American workers may not be totally back at the office, but they’re back at work. Will they keep coming back? Job-search company Indeed is warning the gravitational pull of aging U.S. demographics and the availability of foreign-born workers are potential hindrances to the growth of the U.S. labor force. Copyright ©2023 Dow Jones & Company, Inc. All Rights Reserved. 87990cbe856818d5eddac44c7b1cdeb8 Stay on top of inflation and monetary policy. News and commentary to help you monitor and analyze shifts in the world economy and the policies of central banks. SIGN IN SUBSCRIBE",
    "originSummary": [
      "Indeed has cautioned that the aging population and the availability of foreign-born workers might impede the growth of the US labor force.",
      "To ensure growth in the labor market by 2024, more individuals between the ages of 25 and 54 will need to join the workforce."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "China’s Slow and Complicated Efforts to Revitalize Urban Villages for Economic Stimulus",
    "originLink": "https://www.nytimes.com/2023/11/17/business/china-urban-villages-rebuilding.html",
    "originBody": "ADVERTISEMENT SKIP ADVERTISEMENT China Wants to Bulldoze Old Neighborhoods to Revive the Economy The halting revitalization of one “urban village” in Shenzhen shows the challenges of fixing a national property crisis after years of overborrowing. Share full article A street scene in a neighborhood where China Evergrande, a real estate developer, reached deals with building owners to demolish their buildings and put up new housing. Credit... Keith Bradsher/The New York Times By Daisuke Wakabayashi, Claire Fu and Keith Bradsher Daisuke Wakabayashi and Claire Fu reported from Seoul, and Keith Bradsher from Shenzhen, China. Nov. 17, 2023, 5:03 a.m. ET In Shenzhen, a metropolis born of China’s economic prosperity, Paibang Village is a reminder of the city’s modest past and the challenges ahead for reviving the country’s property sector. Paibang is what China calls an urban village, a labyrinth of low-slung apartment buildings and mom-and-pop storefronts connected by a maze of alleyways and narrow roads. There are hundreds of them in Shenzhen, a municipality of 18 million people next to Hong Kong, and thousands of such villages across China. Now with China mired in an unyielding property crisis, policymakers want to revamp aging urban neighborhoods like Paibang to kick-start construction and spur local economies. But as the halting rehabilitation of Paibang shows, it will not be a quick or easy fix. Seven years ago, Paibang was chosen for an “urban renewal” by city officials, and in 2019 China Evergrande, one of the country’s biggest real estate firms, took control of the project. The company paid building owners for the right to demolish apartments and start clearing land for modern high-rises. Before the work could begin, Evergrande collapsed. Evergrande then handed the project to Shenzhen Metro, a state-owned firm and top shareholder in China Vanke, another giant homebuilder. Now Vanke is facing its own cash concerns. Last week, Shenzhen Metro — and, by extension, the Shenzhen government — sought to calm investors by pledging to backstop Vanke. All the while, construction in Paibang has been at a standstill. On a recent weekday, a glass-enclosed modern building that serves as the project headquarters, and still displays Evergrande signs, was largely empty. Image A newer, more prosperous neighborhood across the street from where Evergrande, a Chinese real estate developer, reached deals with building owners to demolish their buildings and put up new housing. Credit... Keith Bradsher/The New York Times China’s biggest homebuilders are in financial turmoil, suffering a sales slowdown and restrictions on borrowing after years of excess. Last month, the average price of new homes fell by the most in more than eight years. The real estate slump is weighing on the economy. Local governments, reliant on land lease revenue, are feeling the squeeze. The government has tried cutting interest rates and loosening home-buying requirements but has not moved the needle. More drastic measures may weigh on local budgets when debt is already a problem. Financial regulators are discussing ways to support developers, but they are wary of inducing real estate firms to revert to the risky behavior that prompted the crisis. And that’s why Chinese leaders are looking at urban villages, community-owned enclaves within larger cities. All urban land in China is owned by the state. As part of the country’s urbanization drive, the government expanded cities by absorbing bordering farmland held by villagers. But villages were allowed to maintain collective ownership of the areas where their residents lived, creating pockets of land where the state’s reach had limits. As Chinese cities modernized into expanses of high-rises and gridded streets, the urban villages grew into chaotic, densely populated neighborhoods little touched by the gentrification surrounding them. Starting around 2009, as urban expansion started to run out of land, many local governments recognized the untapped potential of urban villages, and redeveloped neighborhoods. But it was mostly a local initiative until this year. The Politburo, the Chinese Communist Party’s executive policymaking body, said in April that it would “actively and steadily advance the transformation of urban villages” in the country’s 21 largest cities. In July, China’s cabinet, the State Council, called the policy an “important measure” to “expand domestic demand,” according to Xinhua, the state news agency. “It really shows that the Chinese leaders are feeling this anxiety to find new channels of urban growth,” said Zhang Yue, an associate professor of political science at the University of Illinois at Chicago. In the last major real estate downturn, around 2015, Beijing spent hundreds of billions of dollars to pay residents cash to trade in dilapidated shacks in smaller cities and towns. Image A seafood market in a neighborhood where a redevelopment project has stalled as Evergrande, like many Chinese real estate developers, has run into severe financial difficulties. Credit... Keith Bradsher/The New York Times Redeveloping urban villages is more complicated and could be just as costly. In an October report, Nomura Securities said that the process was “challenging and expensive,” and that the pace would be slow. The Chinese brokerage CITIC Securities estimated that China might invest nearly $140 billion annually for a full decade, according to an August report. Paibang, in Shenzhen’s northwestern region, is like many other urban villages. Rows of concrete apartment blocks stand so close to each other that they are colloquially known as “handshake buildings” to describe the proximity of the neighbors. The apartments are run-down: no elevators, bars on windows and squat toilets. A lively shopping district is on street level — fruit and vegetable stands, secondhand shops and simple eateries. In nearby industrial parks, there are printing shops, warehouses and factories. In Paibang and three neighboring villages, the vast majority of the 59,000 residents are migrants from elsewhere in China who have moved to Shenzhen for jobs. These neighborhoods are often called the “starting point of a dream.” The Chinese singer Chen Chusheng lived in an urban village in Shenzhen and performed in bars at night before he became famous. In a ballad he wrote about the experience, he sings: “People there were very close, and the distance between the buildings was just a crack.” Shenzhen was named China’s first special economic zone in 1979, turning a fishing village of 300,000 people into the center of China’s experimentation with capitalism. Shenzhen became the birthplace of many of its most successful companies, including Huawei, BYD and Tencent. Image Many old buildings were razed in the 1990s in Shenzhen after the city became one of China’s first experiments in capitalism after Mao’s death. Credit... Forrest Anderson/Getty Images But as Shenzhen grew, migrant workers, still essential to the local labor force, were priced out of the city’s newly developed neighborhoods. In many villages, the land is held by a collective, and the buildings are owned by longtime villagers, many of whom moved out of the neighborhood a long time ago. Gao Jia has run a secondhand furniture and electronics shop in Paibang for eight years. Last year, his landlords asked him to vacate after they agreed to hand over the building housing his store to Evergrande. He was delighted to win a reprieve after Evergrande’s problems brought the redevelopment project to a halt and prevented his landlords from completing the building’s sale. “Renovating old towns does us no good at all,” Mr. Gao said. “We won’t be able to afford the rent, and we won’t be able to do business anymore.” Duan Biqiong, a stationery shop owner, said, “If there are no migrant workers, this place is nothing but an empty town.” In addition to pricing out some residents, urban village renewals are time-consuming. Local governments must negotiate agreements from cooperatives that own land as well as individual building owners before knocking down structures. Officials in Guangzhou, China’s third-biggest city, with 127 urban village renovations underway this year, said the average completion time for a project had stretched from 5.5 years to more than seven years, according to local media. The longer a rehabilitation takes, the more it costs. Jackle Zhuang, 44, owns a five-story apartment building in Paibang. When he first moved in with his family as a teenager, the neighborhood was barely developed. The nearest bus stop was a 30-minute walk away. Today, Paibang has its own subway stop. But Mr. Zhuang doesn’t live in the neighborhood anymore. He moved with his wife and child this year to Chengdu, a city in northwestern China more than 1,000 miles away. In Paibang, he said, there were no parks nearby, and it wasn’t safe for children because the buildings were so close to the road. “There is probably nothing else good, apart from the cheap rent,” Mr. Zhuang said. “It’s not an ideal living environment.” While he is ready to move on, he is not sure if the deal he signed with Evergrande in 2020 to sell his building is still valid or whether he will need to negotiate again with the new developer. He is hoping to trade in his current apartments for units in a new building. For now, all he can do is wait and see. Li You contributed research. Daisuke Wakabayashi is an Asia business correspondent for The Times, based in Seoul. More about Daisuke Wakabayashi Claire Fu covers news in mainland China for The New York Times in Seoul. More about Claire Fu Keith Bradsher is the Beijing bureau chief for The Times. He previously served as bureau chief in Shanghai, Hong Kong and Detroit and as a Washington correspondent. He has lived and reported in mainland China through the pandemic. More about Keith Bradsher Share full article ADVERTISEMENT SKIP ADVERTISEMENT",
    "originSummary": [
      "China is experiencing a property crisis and aims to boost the economy by revitalizing old urban neighborhoods.",
      "The revitalization process is slow and complicated, as seen in the case of Paibang Village in Shenzhen.",
      "China's major homebuilders are facing financial difficulties, which adds to the property slump."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "Increasing Signs of Global Economy Fragmentation: Lagarde Urges Massive Investment for Europe's Challenges",
    "originLink": "https://www.cnbc.com/2023/11/17/lagarde-increasing-signs-that-the-global-economy-is-fragmenting.html",
    "originBody": "SKIP NAVIGATION MARKETS BUSINESS INVESTING TECH POLITICS CNBC TV INVESTING CLUB PRO MAKE IT SELECT USA INTL WATCH LIVE Search quotes, news & videos WATCHLIST SIGN IN EUROPE ECONOMY ECB's Lagarde: Increasing signs that the global economy is fragmenting into competing blocs PUBLISHED FRI, NOV 17 20233:39 AM ESTUPDATED 1 MIN AGO Matt Clinch KEY POINTS Focusing on Europe, European Central Bank President Christine Lagarde said that a continuous decline in the working age population looks set to start as early as 2025, alongside climate disasters which are increasing every year. Her answer to these shocks was that massive investment would be needed in a short space of time, requiring what she called \"a generational effort.\" European Central Bank President Christine Lagarde looks on as she attends the European Parliament's Committee on Economic and Monetary Affairs, at the European Parliament, in Brussels, Belgium September 25, 2023. Yves HermanReuters European Central Bank President Christine Lagarde on Friday said Europe is now at a critical juncture, with deglobalization, demographics and decarbonization looming on the horizon. \"There are increasing signs that the global economy is fragmenting into competing blocs,\" she said at the European Banking Congress, according to a transcript. Focusing on Europe, she said that a continuous decline in the population of working age looks set to start as early as 2025, alongside climate disasters that are increasing every year. Her answer to these shocks was that massive investment would be needed in a short space of time, requiring what she called a \"generational effort.\" \"As new trade barriers appear, we will need to reassess supply chains and invest in new ones that are safer, more efficient and closer to home,\" Lagarde said at the keynote speech. \"As our societies age, we will need to deploy new technologies so that we can produce greater output with fewer workers. Digitalization will help. And as our climate warms, we will need to advance the green transition without any further delays.\" WATCH NOW VIDEO57:40 ECB policy rates should stay tight to see disinflation through, IMF's Berger says She said estimates show the bloc's planned green transition will require an additional investment of 620 billion euros ($672 billion) every year until the end of the decade, with another 125 billion euros per year for a digital transition. \"Governments have the highest debt levels since the Second World War, and European recovery funding will end in 2026. Banks will have a central role to play, but we cannot expect them to take on so much risk on their balance sheets,\" she added, highlighting the proposed capital markets union (CMU). Talks are still ongoing over a possible CMU for Europe. The aim is to create a single market for capital, making it closer to what's available in the U.S. The EU says that the official target is to get \"money – investments and savings – flowing across the EU so that it can benefit consumers, investors and companies, regardless of where they are located.\" Subscribe to CNBC PRO Licensing & Reprints CNBC Councils Select Personal Finance CNBC on Peacock Join the CNBC Panel Supply Chain Values Select Shopping Closed Captioning Digital Products News Releases Internships Corrections About CNBC Ad Choices Site Map Podcasts Careers Help Contact News Tips Got a confidential news tip? We want to hear from you. GET IN TOUCH Advertise With Us PLEASE CONTACT US CNBC Newsletters Sign up for free newsletters and get more CNBC delivered to your inbox SIGN UP NOW Get this delivered to your inbox, and more info about our products and services. Privacy Policy| CA NoticeTerms of Service © 2023 CNBC LLC. All Rights Reserved. A Division of NBCUniversal Data is a real-time snapshot *Data is delayed at least 15 minutes. Global Business and Financial News, Stock Quotes, and Market Data and Analysis. Market Data Terms of Use and Disclaimers Data also provided by",
    "originSummary": [
      "European Central Bank President Christine Lagarde warns of the global economy becoming divided into competing blocs.",
      "Lagarde emphasizes the need for significant investment in Europe to address challenges like shrinking working-age populations and climate disasters.",
      "She calls for reevaluating supply chains, embracing new technologies, and advancing green transitions. Additionally, Lagarde estimates that an extra investment of 620 billion euros ($672 billion) annually is required for the bloc's green transition until the end of the decade.",
      "Lagarde advocates for the establishment of a capital markets union in Europe to facilitate the movement of money and investments."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "Governor Newsom Highlights California's Low-Carbon Economy at APEC",
    "originLink": "https://www.gov.ca.gov/2023/11/16/at-apec-governor-newsom-highlights-californias-low-carbon-green-growth-economy/",
    "originBody": "At APEC, Governor Newsom Highlights California’s Low-Carbon, Green Growth Economy Published: Nov 16, 2023 SAN FRANCISCO – This week, Governor Gavin Newsom and First Partner Jennifer Siebel Newsom met with world leaders at the Asia-Pacific Economic Cooperation (APEC) summit in San Francisco to promote economic development and trade, as well as advance climate action and strengthen ties between California and the broader Asia-Pacific region. Leaders from APEC’s 21 member economies have descended on San Francisco this week for a pivotal summit focused on trade and economic development. At a welcome reception hosted by San Francisco Mayor London Breed, the Governor joined President Biden in welcoming world leaders to California. Watch his remarks here. “California is America’s gateway to the Asia-Pacific – we’re a state of dreamers and doers, entrepreneurs and innovators. We don’t tolerate our diversity, we celebrate our diversity – that’s our strength: it’s central to who we are as Californians. We’re proud to welcome the 21 APEC member economies so we can work to achieve a better, more prosperous future for all — that’s the California Way.” Governor Gavin Newsom During the week, Governor Newsom met with leaders from Australia, Canada, Singapore, the United Kingdom and Vietnam: Australia: Governor Newsom and First Partner Siebel Newsom met with Australian Prime Minister Anthony Albanese and The Honorable Dr. Kevin Rudd AC, Australia’s Ambassador to the United States. The Governor and the Australian delegation adopted a work plan for the Memorandum of Understanding (MOU) signed by California and Australia earlier this year and discussed priorities for year one of the partnership and ways to keep the momentum going on climate action and collaboration. Canada: The Governor and First Partner caught up with Canadian Prime Minister Justin Trudeau to talk about progress made on the climate partnership California and Canada launched last year. Specifically, the Governor and Prime Minister discussed implementation of the 2022 climate Memorandum of Cooperation (MOC), which has focused on several priority areas: ZEVs, methane, carbon capture, wildfire and forest resilience, and green shipping and aviation. They also discussed California and Canada’s strong economic and trade relationship. Singapore: Governor Newsom and the California delegation participated in a bilateral meeting with Singapore Prime Minister Lee Hsien Loong. The meeting centered on advancing bilateral relations, including on trade, economic development, and climate cooperation. United Kingdom: Governor Newsom and First Partner Siebel Newsom met with UK’s Secretary of State for Business and Trade Kemi Badenoch. The two discussed climate cooperation, the UK-California trade relationship and economic cooperation, and artificial intelligence. Vietnam: The Governor participated in a bilateral meeting with the Vietnamese President Vo Van Thuong. The California and Vietnam delegations worked to advance bilateral relations and strengthen cultural ties. On Wednesday, the Governor addressed the APEC CEO Summit – one of the most influential gatherings of business and government leaders from the Asia-Pacific region. At a fireside chat entitled, “Leading with Vision: How APEC Government, Local and Business Leaders Can Drive the Change We Need,” the Governor shared how California has turned the challenges of the climate crisis into opportunities that have helped grow our economy and create good paying jobs. Also this week at APEC, the Newsom Administration, foreign dignitaries and leaders of major seaports advanced the state’s commitment to zero-emission port and shipping activities and developing additional partnerships along vital trade corridors that power the global economy.",
    "originSummary": [
      "Governor Gavin Newsom and First Partner Jennifer Siebel Newsom attended the APEC summit in San Francisco to promote economic development, trade, and climate action in California.",
      "They met with leaders from Australia, Canada, Singapore, the United Kingdom, and Vietnam to discuss collaboration on climate action and strengthen bilateral relations.",
      "Governor Newsom addressed the APEC CEO Summit, highlighting California's low-carbon, green growth economy, while the Newsom Administration and port leaders emphasized California's commitment to zero-emission port and shipping activities."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "Consumers' Spending Strengthens the Economy",
    "originLink": "https://www.barrons.com/articles/what-recession-consumers-still-have-plenty-to-spend-4223572c",
    "originBody": "ECONOMICS What Recession? Consumers Still Have Plenty to Spend. By Megan Leonhardt Updated Nov 17, 2023, 4:49 am EST / Original Nov 17, 2023, 2:50 am EST Share Resize Reprints After two years of sustained spending, rising interest rates, and punishing inflation, American consumers are still on a roll. Consumer outlays account for about 70% of the U.S. economy, and the Covid-era spending spree has kept gross domestic product on a path of surprisingly strong growth. Real GDP grew nearly 5% in the third quarter, according to early estimates, the best showing since the fourth quarter of 2021. Continue reading this article with a Barron’s subscription. View Options",
    "originSummary": [
      "American consumers are maintaining a strong spending rate, despite increasing interest rates and inflation.",
      "Consumer spending constitutes 70% of the U.S. economy.",
      "The Covid-era spending frenzy has contributed to robust GDP growth, with real GDP increasing by almost 5% in the third quarter."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  },
  {
    "title": "Brazil's Economy Shrinks in Q3, Defying Growth Expectations",
    "originLink": "https://finance.yahoo.com/news/1-brazils-economy-enters-negative-121844171.html",
    "originBody": "Reuters UPDATE 2-Brazil's economy enters negative territory in Q3, shows central bank data Read full article 1 Reuters Fri, November 17, 2023 at 6:18 AM CST·2 min read (Adds economist comment in paragraphs 8-9) BRASILIA, Nov 17 (Reuters) - The Brazilian economy ended the third quarter in negative territory, central bank data showed on Friday, reversing a performance that had been surprisingly positive due to a booming farming sector. The IBC-Br index, a key predictor of gross domestic product (GDP), posted a seasonally adjusted 0.64% decline in the third quarter. This followed a 0.06% decrease in September compared to August, contrary to the 0.2% monthly expansion anticipated by economists polled by Reuters. On a non-seasonally adjusted basis, the IBC-Br grew by 0.32% over September 2022 and expanded by 2.50% in the 12 months. Finance Minister Fernando Haddad had already been drawing attention to a \"very poor\" third quarter, attributing it to high borrowing costs and declining commodity prices compared to the same period last year, factors impacting corporate performance and, consequently, tax revenue. The Finance Ministry last estimated a 3.2% gross domestic product (GDP) growth for this year after a robust first-half performance, a figure expected to be revised next week. Meanwhile, private economists surveyed weekly by the central bank project a 2.89% increase in GDP for this year. The September IBC-Br index was in line with a negative performance of the service sector, which accounts for roughly 70% of the country's activity, said Nova Futura economist Nicolas Borsoi. \"There is now a downward bias to our forecast of a 0.2% GDP drop in the third quarter,\" he said. \"My perception is that the fourth quarter will be even worse. For now we're sticking to our 3% growth forecast for the year, but 2.8% seems likely as well.\" Latin America's largest economy has previously thrived on the strength of the agribusiness and extractive industries this year. It was also supported by measures implemented by President Luiz Inacio Lula da Silva's government to enhance household disposable income and consequently stimulate domestic demand. (Reporting by Marcela Ayres; Editing by Steven Grattan) TRENDING 1. Embraer celebrates as Brazil joins WTO civil aircraft agreement 2. UPDATE 1-Lilly to build $2.5 bln diabetes drug plant in Germany 3. Factbox-Special funds: how Germany gets round the debt brake 4. EXPLAINER-What you need to know about Argentina's presidential election run-off 5. Agri chemicals maker FMC looking to sell non-core assets",
    "originSummary": [
      "Brazil's economy contracted in the third quarter, with the IBC-Br index reporting a 0.64% decline, contrary to expectations of growth.",
      "Factors such as high borrowing costs and falling commodity prices are cited as reasons for the poor performance.",
      "The Finance Ministry's previous estimate of 3.2% GDP growth for the year may be revised next week, while economists surveyed by the central bank project a 2.89% increase in GDP for the year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700228689299
  }
]
