[
  {
    "title": "아마존과 메타, 플랫폼에서 공정한 경쟁을 위해 노력한다고 영국 CMA는 말합니다.",
    "originLink": "https://www.reuters.com/technology/uk-regulator-accepts-commitments-amazon-meta-over-retail-platforms-2023-11-03/",
    "originBody": "",
    "originSummary": [
      "영국의 경쟁 및 시장 당국(CMA)은 아마존과 메타(이전의 Facebook)로부터 리테일 플랫폼에서 공정한 경쟁을 촉진하겠다는 확약을 받았습니다.",
      "아마존은 타사 셀러의 경쟁력을 강화할 수 있는 경쟁사의 마켓플레이스 데이터를 부당한 이득을 위해 사용하는 행위를 자제하기로 약속했습니다.",
      "메타는 광고주에게 이러한 목적으로 데이터를 사용하는 것을 '옵트아웃'할 수 있는 옵션을 부여함으로써, Facebook 마켓플레이스에 부당하게 이익을 줄 수 있는 방식으로 광고주의 데이터를 활용하는 것을 중단하는 데 동의합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The UK's Competition & Markets Authority (CMA) has secured pledges from Amazon and Meta, formerly known as Facebook, to encourage fair competition on their retail platforms.",
      "Amazon has committed to abstaining from using competitors' marketplace data to gain an unfair advantage, which aids in maintaining the competitiveness of third-party sellers.",
      "Similarly, Meta has consented to stop \"exploiting\" advertiser data, giving competitors advertising on its platforms an \"opt-out\" option for their data utilization to upgrade the Facebook Marketplace."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "임팩트 투자에 대한 관심이 높아지는 가운데 소셜 임팩트를 가진 젊은 기술 기업들이 자금 조달을 늘리고 있습니다.",
    "originLink": "https://www.forbes.com/sites/alexyork/2023/11/03/why-impact-driven-tech-companies-are-receiving-more-funding/",
    "originBody": "",
    "originSummary": [
      "밀레니얼 세대와 Z세대 펀드 매니저와 LP의 관심 증가로 인해 임팩트를 주도하는 젊은 기술 기업의 자금 조달이 매년 50% 이상 급증하고 있습니다.",
      "안전 파견 센터를 위한 기술 제공업체인 Prepared와 정신 건강 치료를 위한 디지털 플랫폼인 Real과 같은 회사는 이러한 트렌드를 통해 상당한 이점을 얻었습니다.",
      "코로나19에 대응하여 5,300만 달러를 모금한 Real의 혁신으로 강조된 디지털 플랫폼으로의 전환은 기술 기업이 제공하는 높은 확장성에 대한 투자자들의 선호와 일치합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Impact-driven technology companies, particularly those owned by under-30 individuals, are benefiting from a surge in funding as Millennial and Gen Z fund managers invest more into businesses that have a positive social or environmental impact.",
      "Investments in these types of companies have grown by over 50% on an annual basis, with companies such as Prepared and Real experiencing considerable success due to this trend.",
      "The rise in interest for high scalability businesses by investors, as noted by Professor Angela Lee, aligns with an overall increase in support for impact investing in the tech industry."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "아마존, 구글, 마이크로소프트가 AI 스타트업에 투자하여 매출 증대를 도모합니다: 상호 투자 전략",
    "originLink": "https://www.wsj.com/tech/ai/ai-deals-microsoft-google-amazon-7f624054",
    "originBody": "",
    "originSummary": [
      "Amazon, Google, Microsoft와 같은 거대 기술 기업들은 인공지능 스타트업에 막대한 투자를 하고 있으며, 동시에 이러한 스타트업에 클라우드 플랫폼 사용에 대한 막대한 비용을 청구하고 있습니다.",
      "이러한 추세에 따라 이러한 기술 대기업들은 AI 스타트업의 주요 투자자이자 수혜자로 자리매김하고 있으며, AI 붐으로 인한 대부분의 재정적 이익이 이들에게 돌아가고 있습니다.",
      "이러한 스타트업의 성공과 실패에 관계없이, 거대 기술 기업들은 계속해서 상당한 수익을 창출하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Amazon, Google, and Microsoft are investing heavily in AI startups while simultaneously leveraging their cloud platforms to monetize these investments.",
      "This dynamic makes these tech giants both the primary investors and beneficiaries of these startups, with the bulk of financial rewards from the AI industry flowing back to them.",
      "Regardless of startup success or failure, these tech behemoths continue to generate significant revenue, exemplifying their dominating influence in the tech industry."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "거대 기술 기업, 기존 콘텐츠에 대한 AI 학습을 공정 사용으로 주장하며 저작권법 위반 주장",
    "originLink": "https://completemusicupdate.com/setlist-podcast-tech-companies-say-fair-use-trumps-copyright-in-ai/",
    "originBody": "",
    "originSummary": [
      "기술 기업들은 미국 저작권청의 AI 검토에 제출한 자료에 따르면, 기존 콘텐츠에 대한 AI 학습은 공정 사용에 해당하므로 미국 저작권법을 위반하지 않는다고 주장하고 있습니다.",
      "이 입장은 저작권 소유자의 허가 없이도 기존 콘텐츠를 사용하여 생성형 AI 모델을 학습시킬 수 있다는 것을 시사합니다.",
      "별도의 논의에서 그래미 어워드는 기독교 음악에 욕설이 없다는 자신들의 주장과 모순되는 노골적인 표현을 이유로 기독교 부문에서 크리스천 드랙퀸의 앨범을 인정하지 않았습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Large tech corporations are suggesting that AI training on pre-existing content comes under 'fair use' in US copyright laws, as presented to the US Copyright Office's AI review.",
      "Carnegie Mellon University's (CMU) Andy Malt and Chris Cooke discussed these claims. They highlighted the tech companies' insistence that generative AI models can be trained using existing content without requiring copyright holder's consent.",
      "In an unrelated note, the Grammy Awards rejected Flamy Grant's debut album from the Christian category due to explicit language, thereby asserting that Christian music should not contain any explicit language."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "텍스트를 사용할 수 없습니다: 요청된 기사는 기술 회사의 원격 근무 기회 대신 코드 관련 콘텐츠를 제공합니다.",
    "originLink": "https://www.fastcompany.com/90975607/remote-friendly-jobs-figma-1password-grafana-articulate-reddit-twilio",
    "originBody": "",
    "originSummary": [],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "부동산 탈탄소화를 위한 지속 가능성 기술 투자가 향후 예산을 주도할 것으로 전망됩니다.",
    "originLink": "https://www.us.jll.com/en/trends-and-insights/workplace/can-the-sustainability-tech-boom-help-shrink-real-estates-carbon-footprint",
    "originBody": "",
    "originSummary": [
      "기업들은 임박한 탄소 감축 목표에 맞춰 배출량을 모니터링하고 제어하기 위한 기술을 점점 더 많이 활용하고 있습니다. 이러한 지속 가능성 기술은 향후 3년 동안 기술 예산의 증가를 주도할 것으로 예상됩니다.",
      "이러한 기술의 구현 과제에는 스마트 빌딩 시스템 전반에 걸쳐 명확한 로드맵과 표준화된 데이터의 부재가 포함됩니다. 투자 가치를 극대화하기 위해 기업은 명확한 목표를 설정하고, 운영 및 목표에 맞는 제품을 선택하며, 효과적인 사용을 위한 적절한 팀 교육을 보장해야 합니다.",
      "AI(인공 지능)는 부동산 부문의 상당한 탄소 발자국을 줄이는 데 매우 중요한 역할을 할 것으로 예상됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Businesses are incorporating technologies for monitoring emissions and sustainability planning due to approaching carbon reduction deadlines, as revealed by a survey conducted by JLL.",
      "The survey also indicates sustainability technologies are predicted to form the largest portion of increased tech budgets for occupiers and investors for the next three years.",
      "Successful implementation of these technologies can be achieved by clear goal-setting, choosing suitable products, proper team training, and overcoming challenges such as lack of standardized data and concrete roadmaps."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "엘론 머스크의 스타트업 xAI, 거대 기술 기업과의 경쟁 속에서 AI 기술 공개 예정",
    "originLink": "https://news.yahoo.com/musk-says-ai-company-debut-152310660.html",
    "originBody": "",
    "originSummary": [
      "엘론 머스크의 새로운 스타트업인 xAI는 인공지능(AI) 기술을 일부 그룹에 공개할 계획입니다. 이 회사의 목표는 \"우주의 진정한 본질을 이해하는 것\"입니다.",
      "현재 xAI의 기술에 대한 구체적인 세부 사항은 공개되지 않았지만, xAI의 목표는 OpenAI, Google, Amazon과 같은 주요 기술 대기업의 AI 이니셔티브와 경쟁하는 것입니다.",
      "xAI의 팀은 딥마인드, OpenAI, 구글 리서치, 마이크로소프트 리서치, 테슬라 등 저명한 기관의 베테랑들로 구성되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Elon Musk's startup, xAI, plans to premier its artificial intelligence (AI) technology to a select group, aiming to \"understand the true nature of the universe.\"",
      "The new company, constructed to contend with major tech corporations' AI initiatives, will likely be compared with leading AI contributors such as OpenAI, Google, and Amazon.",
      "xAI boasts a team composed of veterans from well-known tech and AI companies like DeepMind, OpenAI, Google Research, Microsoft Research, and Tesla."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "캐나다의 새로운 디지털 서비스세가 글로벌 기술 대기업과 시장 관계에 미치는 영향",
    "originLink": "https://www.taxpolicycenter.org/taxvox/o-canada-what-might-its-digital-services-tax-mean-us",
    "originBody": "",
    "originSummary": [
      "캐나다는 1월 1일부터 구글, 아마존, 페이스북, 우버, 에어비앤비 등 미국 기술 기업에 영향을 미치는 3%의 디지털 서비스세(DST)를 시행할 계획입니다.",
      "법인세 수입 확대를 목적으로 하는 DST는 총 매출 7억 5,000만 유로 이상, 디지털 서비스 매출 2,000만 캐나다 달러 이상의 기업에 적용되며, 이로 인해 소비자 비용이 증가할 수 있습니다.",
      "OECD가 2025년까지 DST를 유예하고 있지만, 캐나다의 이니셔티브는 미국과의 관계를 긴장시키고 국제 조세 조약에 도전하여 미국의 보복 조치를 초래할 수 있으며 무역 전쟁을 촉발할 수 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Canada intends to introduce a 3% Digital Services Tax (DST) from January 1st, targeting large US companies such as Google, Amazon, Facebook, Uber, and Airbnb, which might increase consumer costs.",
      "The DST is designed to boost corporate tax revenue and will be imposed on corporations with overall revenue of at least €750 million and digital services proceeds over CA$20 million.",
      "This move contradicts an agreement by several countries to an OECD moratorium on DSTs until 2025, drawing potential strain in relations with the US and jeopardizing the global tax treaty, with the US threatening retaliation."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "사용자 인식 및 데이터 보호 조치를 통해 거대 기술 기업의 힘에 대응하기",
    "originLink": "https://www.privateinternetaccess.com/blog/big-tech-responsibility-society/",
    "originBody": "",
    "originSummary": [
      "이 기사는 알파벳, 애플, 마이크로소프트, 아마존과 같은 거대 기술 기업이 개인 데이터에 대한 무제한적인 접근과 정보에 대한 영향력으로 인해 상당한 통제권을 가지고 있다는 점을 강조합니다.",
      "수많은 소송과 규제에도 불구하고 이들의 공격적이고 반경쟁적인 행위는 계속해서 사회적 파장을 일으키고 있습니다.",
      "이 글은 데이터 및 개인정보 보호에 대한 개인의 책임을 강화할 것을 촉구하며 데이터 수집에 대한 자가 교육, 개인정보 보호에 중점을 둔 서비스 이용, 권한 남용 기업의 제품 사용 자제, 편의 기능에 대한 의존도 제한 등을 제안하고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The article highlights the considerable power that tech giants such as Alphabet, Apple, Microsoft, and Amazon have due to their unrestricted access to private data and control over information.",
      "Despite numerous lawsuits and regulations, these companies' potentially harmful and anti-competitive behaviours persist, leading to societal effects.",
      "The article advocates for more individual responsibility in shielding personal data and privacy, including self-education about data collection, use of privacy-centric services, decreased usage of products from companies misusing power, and less dependency on convenience features."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  },
  {
    "title": "인도, 기술 수입에 대한 디지털 감시 시스템을 도입하여 투명성을 높이고 국내 제조업을 활성화합니다.",
    "originLink": "https://readwrite.com/india-debuts-digital-surveillance-for-tech-imports/",
    "originBody": "",
    "originSummary": [
      "인도는 2023년 11월부터 애플, 델, 레노버 등 주요 기술 기업을 포함한 110개 기업이 새로운 디지털 감시 시스템에 따라 노트북, 태블릿, PC를 수입할 수 있도록 허용했습니다.",
      "이 제도는 투명성을 높이고 밀수를 금지하며 국내 제조업을 육성하기 위해 기업이 수입 물품의 수량과 가격을 지정된 웹사이트에 공개하도록 의무화하는 제도입니다.",
      "이 정책은 이전의 수입 제한 정책에서 벗어나 기술 산업 진흥과 현지 제조업체 지원 사이의 균형을 유지하려는 시도를 의미합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "As of November 2023, India has permitted 110 corporations, including technology giants such as Apple, Dell, and Lenovo, to import laptops, tablets, and personal computers through a new digital surveillance system.",
      "The system mandates businesses to disclose the volume and value of imported commodities on a specified website, aiming to enhance transparency, curtail smuggling, and stimulate local production.",
      "This policy represents a change from prior import constraints and aims to strike a balance between fostering the tech industry and bolstering domestic manufacturing."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699046603768
  }
]
