[
  {
    "id": 42136259,
    "title": "ذا أونيون تشتري إنفوارز",
    "originLink": "https://www.nytimes.com/2024/11/14/business/media/alex-jones-infowars-the-onion.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42136259",
    "commentBody": "",
    "originSummary": [
      "استحوذت صحيفة The Onion، المعروفة بمحتواها الساخر، على موقع Infowars، وهو موقع نظريات المؤامرة، من خلال مزاد إفلاس.",
      "يدعم عائلات ضحايا ساندي هوك عملية الاستحواذ، حيث كانوا قد فازوا سابقًا بدعوى تشهير ضد مؤسس إنفووورز، أليكس جونز.",
      "تخطط The Onion لإعادة إطلاق موقع Infowars كموقع ساخر للسخرية من ناشري المعلومات المضللة وزيادة الوعي حول عنف الأسلحة، بدعم من منظمة Everytown for Gun Safety."
    ],
    "commentSummary": [
      "اشترت The Onion موقع Infowars لتحويله إلى موقع ساخر، بدعم من عائلات ساندي هوك الذين وافقوا على تقليل مطالباتهم بالتعويض لتسهيل عملية الاستحواذ.",
      "تنوي صحيفة The Onion السخرية من منظري المؤامرة ومروجي المعلومات المضللة، وستتوقف عن بيع المكملات المشكوك فيها التي تقدمها Infowars.",
      "يُنظر إلى هذا الاستحواذ على أنه جهد لخدمة عامة للحد من قدرة أليكس جونز على إلحاق المزيد من الضرر."
    ],
    "points": 950,
    "commentCount": 533,
    "retryCount": 0,
    "time": 1731593405
  },
  {
    "id": 42135520,
    "title": "MomBoard: شاشة حبر إلكتروني لوالد يعاني من فقدان الذاكرة",
    "originLink": "https://jan.miksovsky.com/posts/2024/11-12-momboard",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42135520",
    "commentBody": "",
    "originSummary": [
      "قام شخص بتركيب شاشة حبر إلكتروني باستخدام جهاز BOOX Note Air2 لمساعدة والدته التي تعاني من فقدان الذاكرة في إدارة القلق بشأن أماكن تواجد أطفالها. تعرض الشاشة رسائل من أفراد العائلة، مما يوفر حلاً غير مزعج وسهل القراءة لا يتطلب تفاعلًا أو مهارات جديدة من المستخدم. يتضمن النظام موقعًا إلكترونيًا بسيطًا لتحديث الرسائل وقد أثبت فعاليته في تحسين جودة حياة الأم بشكل كبير."
    ],
    "commentSummary": [
      "تم تطوير شاشة حبر إلكتروني لمساعدة أحد الوالدين المصابين بفقدان الذاكرة من خلال عرض رسائل من أطفالهم، مما يعزز جودة حياتهم بتذكيرات مستمرة بالحب.",
      "أثارت القصة محادثات حول تقاطع الذاكرة والتكنولوجيا، والإمكانيات المحتملة لاستخدام أجهزة مماثلة لمساعدة الأفراد الذين يواجهون تحديات في الذاكرة.",
      "ألهم المشروع مناقشات حول تصميم التكنولوجيا لدعم كبار السن والأشخاص الذين يعانون من مشاكل في الذاكرة، مسلطًا الضوء على الفوائد النفسية والعملية."
    ],
    "points": 790,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1731586840
  },
  {
    "id": 42133700,
    "title": "اتبعت الدليل الرسمي لـ AWS Amplify وتم تحميلي مبلغ 1,100 دولار",
    "originLink": "https://elliott-king.github.io/2024/10/amplify-overcharge/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42133700",
    "commentBody": "",
    "originSummary": [
      "اتباع الدليل الرسمي لـ AWS Amplify لتكامل OpenSearch يمكن أن يؤدي إلى تكاليف غير متوقعة، كما حدث مع مستخدم تلقى فاتورة بقيمة 1,100 دولار.",
      "قامت دعم AWS بتعديل الفاتورة وأوصت بإعداد تنبيهات الميزانية، مشيرة إلى أهمية مراقبة خدمات AWS والتسعير.",
      "يمكن أن تكون تعقيدات الدليل والإعدادات الافتراضية مضللة، خاصة لأولئك الجدد في استخدام AWS، مما يبرز الحاجة إلى فهم التكنولوجيا واستخدام أدوات ميزانية AWS لمنع النفقات غير المتوقعة."
    ],
    "commentSummary": [
      "تكبد مستخدم رسومًا غير متوقعة بقيمة 1,100 دولار بعد اتباع دليل AWS Amplify، مما يبرز مشكلة عدم وجود حدود صارمة للإنفاق في AWS.",
      "يعبر المستخدمون عن إحباطهم من تعقيد فواتير AWS وغياب التنبيهات الفورية، مما يعقد إدارة التكاليف بشكل فعال.",
      "هناك دعوة لأمازون ويب سيرفيسز (AWS) لتنفيذ ضوابط إنفاق أوضح، خاصة للمستخدمين الجدد، على الرغم من عمليات الاسترداد العرضية لمثل هذه الحوادث."
    ],
    "points": 423,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1731566896
  },
  {
    "id": 42130881,
    "title": "فرانسوا شولي يغادر جوجل",
    "originLink": "https://developers.googleblog.com/en/farewell-and-thank-you-for-the-continued-partnership-francois-chollet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42130881",
    "commentBody": "",
    "originSummary": [
      "فرانسوا شولي، مبتكر كيراس، يغادر جوجل لاستكشاف فرص جديدة، بينما يواصل دعم كيراس بالتعاون مع جوجل والمجتمع مفتوح المصدر.",
      "تُعتبر كيراس أداة تطوير ذكاء اصطناعي هامة يستخدمها أكثر من مليوني مستخدم، وتُستخدم على نطاق واسع عالميًا، بما في ذلك في تطبيقات جوجل.",
      "تظل جوجل ملتزمة بتطوير الذكاء الاصطناعي وKeras، حيث قامت مؤخرًا بإطلاق Keras Hub لتحسين الوصول إلى أدوات الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "فرانسوا شولي، مبتكر كيراس، يغادر جوجل لبدء مشروع جديد مع صديق، وليس بسبب تجنيده من قبل شركة أخرى.",
      "يُستخدم كيراس، وهو إطار عمل شائع للتعلم العميق، من قبل حوالي 2 مليون مطور وتم دمجه في تينسورفلو في عام 2019، وهو قرار لم يتخذه شولت ويعتقد أنه ربما كان من الأفضل أن يبقى كإطار عمل مستقل.",
      "يعتزم شوليه مواصلة عمله على مشاريع مثل ARC (مجموعة التجريد والاستدلال) وتأليف أوراق بحثية أساسية في مجال الذكاء الاصطناعي."
    ],
    "points": 343,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1731536932
  },
  {
    "id": 42136469,
    "title": "لماذا من الصعب جدًا العثور على وظيفة الآن؟ أدخل وظائف الأشباح",
    "originLink": "https://arxiv.org/abs/2410.21771",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42136469",
    "commentBody": "",
    "originSummary": [
      "تبحث دراسة هانتر نغ في \"التوظيف الوهمي\"، حيث ينشر أصحاب العمل إعلانات وظائف دون نية شغلها، باستخدام بيانات من Glassdoor وتحليل LLM-BERT. تكشف الدراسة أن ما يصل إلى 21% من إعلانات الوظائف قد تكون وظائف وهمية، خاصة في الصناعات المتخصصة والشركات الكبيرة، مما يساهم في مشكلات سوق العمل مثل انفصال منحنى بيفريدج. تقترح الدراسة أن على صانعي السياسات معالجة التوظيف الوهمي لأنه يؤدي إلى إرهاق العمل ويشوه إشارات السوق."
    ],
    "commentSummary": [
      "يجب أن تعطي عملية التوظيف الأولوية للكفاءة والمؤهلات على الجنسية، لمعالجة المفاهيم الخاطئة حول توفر المرشحين الأمريكيين المؤهلين.",
      "يواجه العديد من الأفراد المؤهلين تحديات في البحث عن عمل بسبب قضايا مثل الوظائف الوهمية وعمليات التوظيف المعقدة.",
      "تحتاج الشركات إلى الحفاظ على ممارسات توظيف عادلة وشفافة، بينما يجب على الباحثين عن عمل التركيز على بناء الشبكات وتعزيز المهارات للبقاء في المنافسة."
    ],
    "points": 334,
    "commentCount": 432,
    "retryCount": 0,
    "time": 1731594934
  },
  {
    "id": 42129064,
    "title": "دليل الطالب للكتابة باستخدام ChatGPT",
    "originLink": "https://openai.com/chatgpt/use-cases/student-writing-guide/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42129064",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يستكشف الدليل استخدام الذكاء الاصطناعي، مثل ChatGPT، في الكتابة والبرمجة، مسلطًا الضوء على التوازن بين زيادة الكفاءة وخطر ضمور المهارات.",
      "يؤكد على أن الذكاء الاصطناعي يجب أن يكون أداة تعليمية للطلاب، وليس عكازًا، حيث أن الانخراط في \"النضال المنتج\" ضروري للفهم العميق.",
      "تمتد المناقشة إلى الدور المتطور للذكاء الاصطناعي في التعليم، مع التأكيد على أهمية التفكير النقدي والقدرة على التكيف استجابة لتأثير الذكاء الاصطناعي على المهارات."
    ],
    "points": 298,
    "commentCount": 300,
    "retryCount": 0,
    "time": 1731525986
  },
  {
    "id": 42132014,
    "title": "استهداف جمهورية الصين الشعبية للبنية التحتية للاتصالات التجارية",
    "originLink": "https://www.fbi.gov/news/press-releases/joint-statement-from-fbi-and-cisa-on-the-peoples-republic-of-china-targeting-of-commercial-telecommunications-infrastructure",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42132014",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تركز المناقشة على استهداف الصين للبنية التحتية للاتصالات التجارية، مع رؤى مستمدة من مجموعة بيانات من معهد السياسة الاستراتيجية الأسترالي تسلط الضوء على أولويات البحث في الصين.",
      "تُثار مخاوف بشأن احتمال تأخر الغرب في مجال الأمن السيبراني، مع التركيز على الموارد القديمة، ومواهب الأمن السيبراني في الصين، وآثار السيطرة الحكومية.",
      "يناقش المستخدمون قانونية وأخلاقيات المراقبة، مشيرين إلى حوادث تاريخية، وأدوار الجهات الحكومية، والديناميات الجيوسياسية بين الولايات المتحدة والصين، بما في ذلك التجسس والعلاقات الدولية."
    ],
    "points": 271,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1731545987
  },
  {
    "id": 42130079,
    "title": "أمازون تجعل من الصعب على الموظفين ذوي الإعاقة العمل من المنزل",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-13/amazon-makes-it-harder-for-disabled-employees-to-work-from-home",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42130079",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تواجه أمازون انتقادات لجعلها من الصعب على الموظفين ذوي الإعاقة العمل من المنزل، على الرغم من عدم وجود بيانات تبرر فوائد العودة إلى المكتب.",
      "يشير النقاد إلى أن سياسة العودة إلى المكتب قد تهدف إلى فرض السيطرة وتقليل عدد الموظفين دون تكبد تكاليف التعويضات، مما يثير مخاوف بشأن رفاهية الموظفين.",
      "تؤكد الحالة على النقاش المستمر حول العمل عن بُعد، مع وجود آراء متباينة حول قيمة المرونة مقابل التعاون في المكتب."
    ],
    "points": 268,
    "commentCount": 312,
    "retryCount": 0,
    "time": 1731532611
  },
  {
    "id": 42133864,
    "title": "دروس من أول خروج لي",
    "originLink": "https://mtlynch.io/lessons-from-my-first-exit/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42133864",
    "commentBody": "",
    "originSummary": [
      "قدمت عملية بيع شركة TinyPilot، وهي شركة أجهزة تمويلها ذاتيًا، رؤى حول التوثيق الفعال، وأهمية وجود وسيط موثوق، والحاجة إلى الاعتراف بالتأثير المحدود بعد البيع.",
      "الدروس المستفادة تشمل تقديم حوافز للمشترين نقدًا، وإشراك محامٍ في وقت مبكر، وإدارة الإعلانات الخاصة بالفريق والنكسات بشكل أكثر استراتيجية.",
      "كانت العناصر المفاجئة هي عملية العناية الواجبة المكثفة بالعمل، والدور الاختياري ولكن المفيد للوسيط، والحوافز للمشترين للحفاظ على علاقات جيدة مع البائعين بعد البيع."
    ],
    "commentSummary": [
      "يشارك المؤلف رؤى من تجربته في بيع عمله، TinyPilot، مشددًا على أهمية فهم المسؤولية في مبيعات الأصول والتحديات التي تواجه العثور على مشترٍ.",
      "تم استخدام وسيط لتسهيل عملية البيع، على الرغم من الرسوم المرتفعة، بسبب صعوبة العثور على مشترٍ مناسب بشكل مستقل.",
      "تشمل التأملات الموازنة بين إدارة عمل تجاري والعمل في شركة تقنية كبيرة، مع تسليط الضوء على الفروقات في الدخل والمخاطر ونمط الحياة، بالإضافة إلى رؤى حول بدء وإدارة مشروع صغير في الولايات المتحدة."
    ],
    "points": 263,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1731569529
  },
  {
    "id": 42130281,
    "title": "مجلس مدينة نيويورك يصوت لإنهاء رسوم الوسطاء التي تضغط على المستأجرين",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-13/nyc-on-brink-of-ending-killer-broker-fees-that-squeeze-renters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42130281",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "صوت مجلس مدينة نيويورك على إلغاء رسوم الوسطاء للمستأجرين، بهدف تعزيز المنافسة السعرية والشفافية في سوق الإيجار.",
      "في السابق، كان يتعين على المستأجرين دفع رسوم الوسطاء، على الرغم من أن الوسطاء يعملون لصالح الملاك، مما أدى إلى نقص في الضغط على الأسعار.",
      "من المتوقع أن يؤدي القرار إلى تحويل تكلفة خدمات السمسار إلى الملاك، مما قد يقلل من تكاليف الإيجار الإجمالية ويزيد من شفافية التسعير للمستأجرين."
    ],
    "points": 244,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1731533897
  },
  {
    "id": 42130194,
    "title": "مداهمة مكتب التحقيقات الفيدرالي لمنزل الرئيس التنفيذي لشركة بوليماركت شين كوبلان",
    "originLink": "https://www.axios.com/2024/11/13/polymarket-fbi-shayne-coplan",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42130194",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "داهم مكتب التحقيقات الفيدرالي منزل الرئيس التنفيذي لشركة بوليماركت، شين كوبلان، مما أدى إلى مناقشات حول الدوافع السياسية المحتملة مقابل قضايا الامتثال القانوني.",
      "تخضع بوليماركت للتدقيق بسبب عملها بدون ترخيص في الولايات المتحدة، حيث يقترح البعض أن المداهمة جزء من جهود أوسع لتنظيم العملات المشفرة وأسواق التنبؤ.",
      "توقيت المداهمة، الذي حدث بعد الانتخابات، أثار تكهنات حول تداعياتها على الإدارة القادمة والتوازن بين الابتكار والتنظيم."
    ],
    "points": 236,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1731533341
  },
  {
    "id": 42129924,
    "title": "لماذا لم يعد الجارديان ينشر على X",
    "originLink": "https://www.theguardian.com/media/2024/nov/13/why-the-guardian-is-no-longer-posting-on-x",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42129924",
    "commentBody": "",
    "originSummary": [
      "قررت صحيفة الغارديان التوقف عن النشر على حساباتها التحريرية الرسمية على منصة X (المعروفة سابقًا باسم تويتر) بسبب القلق من البيئة السامة للمنصة وتأثير مالكها، إيلون ماسك، على المناقشات السياسية.",
      "على الرغم من هذا القرار، لا يزال بإمكان المستخدمين على منصة X مشاركة المقالات من صحيفة The Guardian، ويمكن للصحفيين الاستمرار في استخدام المنصة لجمع الأخبار.",
      "تهدف صحيفة الغارديان إلى إعطاء الأولوية لموقعها الإلكتروني في توزيع الصحافة، مع التركيز على دعم القراء المباشر بدلاً من الاعتماد على خوارزميات وسائل التواصل الاجتماعي."
    ],
    "commentSummary": [
      "توقفت صحيفة الغارديان عن النشر على منصة X، المعروفة سابقًا باسم تويتر، بسبب مخاوف تتعلق بمحتوى مثل نظريات المؤامرة اليمينية المتطرفة والعنصرية.",
      "هذا القرار هو جزء من اتجاه أكبر حيث تعيد وسائل الإعلام تقييم وجودها على وسائل التواصل الاجتماعي بسبب التحيزات والمعلومات المضللة المتصورة.",
      "على الرغم من إيقاف المنشورات، ستظل صحيفة الغارديان تسمح بمشاركة المقالات على منصة X وتستخدم المنصة لجمع الأخبار، مما يبرز النقاشات حول دور وسائل التواصل الاجتماعي في الصحافة ونزاهة التحرير."
    ],
    "points": 234,
    "commentCount": 304,
    "retryCount": 0,
    "time": 1731531489
  },
  {
    "id": 42134315,
    "title": "مقابلة مع جويرن",
    "originLink": "https://www.dwarkeshpatel.com/p/gwern-branwen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42134315",
    "commentBody": "",
    "originSummary": [
      "جوين برانوين، باحث يستخدم اسمًا مستعارًا، كان من أوائل المتنبئين بتوسع نماذج اللغة الكبيرة (LLMs) في الذكاء الاصطناعي (AI). في مقابلة، يناقش جوين رحلته وأهمية عدم الكشف عن الهوية وعملية كتابته، مشددًا على تأثير الكتابة على مستقبل الذكاء الاصطناعي. يشارك رؤى حول إمكانيات الذكاء الاصطناعي، ودور التوسع، وتأثير أدوية GLP على الصحة، بينما يعكس على نمط حياته المدعوم من باتريون والمدخرات، والتزامه بأبحاث الذكاء الاصطناعي."
    ],
    "commentSummary": [
      "تستكشف المقابلة مع جويرن دور الكتابة في مستقبل الذكاء الاصطناعي، معبرة عن الشكوك حول قدرة الذكاء الاصطناعي على استبدال الإبداع البشري ومشددة على الحاجة إلى التحقق من المحتوى الذي ينتجه البشر.",
      "يتحدث جويرن عن العيش بتقشف، مدعومًا من باتريون وبيتكوين، ويقدر السعي الفكري أكثر من الثروة المادية، مما يقدم منظورًا فريدًا عن الحياة الشخصية والمهنية.",
      "تناقش المحادثة تأثير الذكاء الاصطناعي على المجتمع، وتجادل حول ما إذا كان الذكاء الاصطناعي سيسيطر أو سيتعايش مع الإبداع البشري، وتسلط الضوء على تأثير جويرن وآخرين في مجتمع الذكاء الاصطناعي على هذه المناقشات."
    ],
    "points": 226,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1731574592
  },
  {
    "id": 42138115,
    "title": "كشفت O2 عن ديزي، الجدة الذكية التي تهدر وقت المحتالين",
    "originLink": "https://news.virginmediao2.co.uk/o2-unveils-daisy-the-ai-granny-wasting-scammers-time/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42138115",
    "commentBody": "",
    "originSummary": [
      "أطلقت O2 أداة ذكاء اصطناعي تُدعى \"ديزي\"، مصممة لإشراك المحتالين في محادثات واقعية، كجزء من حملتها \"تجنب المحتالين\" لحماية العملاء من الاحتيال.",
      "تستخدم ديزي تقنية الذكاء الاصطناعي المتقدمة لشغل وقت المحتالين، مما يمنعهم من استهداف ضحايا حقيقيين، وتتعاون مع نجمة برنامج \"لوف آيلاند\" السابقة إيمي هارت لزيادة الوعي بالاحتيال.",
      "تحث O2 العملاء على الإبلاغ عن الاتصالات المشبوهة إلى الرقم 7726 مجانًا وتدعو إلى تدخل حكومي لمعالجة مشكلة الاحتيال المتزايدة في المملكة المتحدة."
    ],
    "commentSummary": [
      "أطلقت O2 نظام ذكاء اصطناعي يسمى \"ديزي\" يهدف إلى إشغال المحتالين في محادثة لإضاعة وقتهم، مما أثار جدلاً حول فعاليته والآثار الأخلاقية المترتبة عليه.",
      "يجادل النقاد بأن ديزي، رغم كونها مبتكرة، قد تصرف الانتباه عن استراتيجيات أكثر فعالية لمنع البريد العشوائي وقد تتسبب في تكاليف إضافية.",
      "هناك قلق من أن المحتالين قد يواجهون ذلك بتطوير ذكاء اصطناعي خاص بهم، مما قد يؤدي إلى تفاعل أنظمة الذكاء الاصطناعي مع بعضها البعض، مما يثير تساؤلات حول مستقبل الذكاء الاصطناعي في منع البريد العشوائي والاحتيال."
    ],
    "points": 198,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1731603129
  },
  {
    "id": 42132720,
    "title": "جو-سيفويب",
    "originLink": "https://github.com/google/go-safeweb",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42132720",
    "commentBody": "",
    "originSummary": [
      "يعد go-safeweb مكتبة مصممة لخوادم HTTP الآمنة بشكل افتراضي في لغة البرمجة Go، وتهدف إلى القضاء على الثغرات الأمنية مثل البرمجة عبر المواقع (XSS) وتزوير الطلبات عبر المواقع (XSRF).",
      "يؤكد المشروع على آليات الأمان المطبقة بشكل افتراضي، وسهولة تتبع الاستخدام غير الآمن، والقدرة على التكيف مع متطلبات الأمان المتطورة، مع الحفاظ على توافق عالٍ مع مكتبة Go القياسية.",
      "تركز المكتبة بشكل حصري على الأمان، حيث تعالج قضايا مثل XSS، XSRF، مشاركة الموارد عبر الأصل (CORS)، سياسة أمان المحتوى (CSP)، وأمان النقل، دون السعي لتحقيق التوافق الكامل مع جميع الأطر أو الميزات غير الأمنية."
    ],
    "commentSummary": [
      "Go-Safeweb هو مشروع من جوجل على GitHub يهدف إلى توفير واجهات برمجة تطبيقات آمنة لخوادم HTTP بلغة Go، مما يثير النقاشات حول معالجة HTTPS/TLS.",
      "يناقش المستخدمون مزايا إدارة TLS داخل التطبيقات مقابل استخدام البروكسيات العكسية، مع مراعاة المرونة وسهولة التكوين وتقليل التعقيد.",
      "المشروع مدعوم بشكل غير رسمي من قبل جوجل، مما يثير مخاوف بشأن صيانته واستدامته على المدى الطويل."
    ],
    "points": 177,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1731553473
  }
]
