[
  {
    "id": 38262315,
    "title": "Blender 4.0: تحديثات مثيرة وتغييرات التوافق",
    "originLink": "https://wiki.blender.org/wiki/Reference/Release_Notes/4.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262315",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Blender 4.0 في 14 نوفمبر 2023 ، مع تحديثات وتحسينات كبيرة في مجالات مختلفة مثل الرسوم المتحركة والتزوير والنمذجة والمزيد.",
      "يتضمن الإصدار تغييرات على تنسيق الشبكة ومتطلبات التوافق الجديدة لبطاقات الرسومات.",
      "يجلب التحديث أيضا تحسينات في مجالات مثل العقد الهندسية والتظليل والتركيب والدورات وواجهة المستخدم وغيرها."
    ],
    "commentSummary": [
      "تعمق المستخدمون في مواضيع مختلفة حول Blender ، مثل ملاحظات الإصدار ، وفرص العمل في الرسوم المتحركة ، واستخدام الجبر الخطي والبرمجة في العرض والرسوم المتحركة للشخصيات.",
      "كما تمت مناقشة نجاح Blender كمشروع مفتوح المصدر وتطوير واجهة المستخدم الخاصة به.",
      "قارن المستخدمون Blender ببرنامج Adobe واستكشفوا إمكانية وجود ميزة مشاركة موارد مضمنة."
    ],
    "points": 660,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1699963890
  },
  {
    "id": 38261415,
    "title": "البرلمان الأوروبي يتخذ خطوات لحماية الأطفال من الاعتداء الجنسي عبر الإنترنت",
    "originLink": "https://www.europarl.europa.eu/news/en/press-room/20231110IPR10118/child-sexual-abuse-online-effective-measures-no-mass-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261415",
    "commentBody": "",
    "originSummary": [
      "وافقت لجنة الحريات المدنية على تدابير جديدة لحماية الأطفال من الاعتداء الجنسي على الأطفال عبر الإنترنت.",
      "وسيطلب من مقدمي خدمات الإنترنت تقييم مخاطر إساءة استخدام خدماتهم واتخاذ خطوات لمنع الاعتداء الجنسي على الأطفال.",
      "وإذا فشلت تدابير الوقاية، يمكن استخدام أوامر الكشف التي تصدق عليها المحكمة لتحديد موقع المواد غير القانونية، وسيتم إنشاء مركز الاتحاد الأوروبي لحماية الطفل لإنفاذ القواعد."
    ],
    "commentSummary": [
      "أزالت لجنة الحريات المدنية في البرلمان الأوروبي متطلبات التحكم في الدردشة والتشفير المحمي في لائحة التحكم في الدردشة المقترحة ، لكن المفاوضات لوضع اللمسات الأخيرة عليها لا تزال معلقة.",
      "وقد أثيرت مخاوف بشأن احتمال إساءة استخدام الرسائل الممسوحة ضوئيا بحثا عن مواد الاعتداء الجنسي على الأطفال.",
      "ينظر إلى رفض الباب الخلفي في تشفير ومسح الرسائل الخاصة من قبل برلمان الاتحاد الأوروبي على أنه انتصار للمدافعين عن الخصوصية ، لكن شركات التكنولوجيا قد تضغط من أجل الإعفاءات."
    ],
    "points": 553,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1699957055
  },
  {
    "id": 38264641,
    "title": "نموذج GraphCast الذكاء الاصطناعي من Google يحدث ثورة في التنبؤ بالطقس ، ويتفوق على الطرق التقليدية",
    "originLink": "https://deepmind.google/discover/blog/graphcast-ai-model-for-faster-and-more-accurate-global-weather-forecasting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264641",
    "commentBody": "",
    "originSummary": [
      "طورت Google نموذجا الذكاء الاصطناعي يسمى GraphCast يمكنه إجراء تنبؤات جوية متوسطة المدى أكثر دقة وأسرع مقارنة بالطرق التقليدية.",
      "يتنبأ النموذج بالظروف الجوية حتى 10 أيام مقدما ، مما يسمح بالتحذيرات المبكرة من الظواهر الجوية المتطرفة مثل الأعاصير والفيضانات.",
      "يتم تدريب GraphCast على بيانات الطقس التاريخية باستخدام التعلم الآلي والشبكات العصبية للرسم البياني ، متفوقا على نظام محاكاة الطقس القياسي الذهبي في الصناعة من حيث الدقة وتوفير تنبؤات أفضل للطقس في المستقبل.",
      "كان رمز النموذج مفتوح المصدر ، مما يسمح للعلماء والمتنبئين في جميع أنحاء العالم بالاستفادة منه وربما إنقاذ الأرواح ودعم اتخاذ القرارات الحاسمة في مختلف الصناعات والمجتمعات."
    ],
    "commentSummary": [
      "طورت Google DeepMind نموذجا جديدا للتنبؤ بالطقس الذكاء الاصطناعي يسمى GraphCast ، والذي يجمع بين البيانات من نماذج الطقس العددية المتعددة باستخدام التعلم الآلي لتحسين الدقة.",
      "تدور المناقشات حول قيود واجهات برمجة التطبيقات الحالية ، وتوافر بيانات الطقس التاريخية ، وتكامل البيانات حول الأحداث المتطرفة.",
      "هناك فوائد وتحديات محتملة لاستخدام التعلم الآلي في التنبؤ بالطقس ، فضلا عن المنافسة في الصناعة. يمكن أن يكون لهذه التكنولوجيا آثار على مختلف الصناعات التي تعتمد على تنبؤات الطقس الدقيقة."
    ],
    "points": 527,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1699976543
  },
  {
    "id": 38266773,
    "title": "يمكن أن يتسبب الخطأ في بعض المعالجات في حدوث خلل في حالة الخلل ، ويشكل مخاطر أمنية لموفري الخدمات السحابية",
    "originLink": "https://lock.cmpxchg8b.com/reptar.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266773",
    "commentBody": "",
    "originSummary": [
      "اكتشفت فرق بحث متعددة في Google خطأ في معالجات معينة يمكن أن يتسبب في دخولها في حالة خلل ، مما يؤدي إلى سلوك غير متوقع وتوقف النظام.",
      "يتضمن الخطأ استخدام بادئات ريكس الزائدة عن الحاجة وميزة حركة التكرار القصير السريع (FSRM).",
      "أصدرت Intel رمزا صغيرا محدثا وحلا بديلا لمعالجة هذه الثغرة الأمنية ، والتي لها آثار أمنية خطيرة على موفري الخدمات السحابية."
    ],
    "commentSummary": [
      "\"Reptar\" هي ثغرة أمنية في وحدة المعالجة المركزية تؤدي إلى استثناءات فحص الجهاز وتوقف المعالج ، والتي اكتشفتها Google وفرق البحث الأخرى.",
      "يناقش المقال تأثير \"Reptar\" على وحدات المعالجة المركزية AMD ويسلط الضوء على التحديات التي تواجهها في تصميم وحدة المعالجة المركزية.",
      "تم ذكر ثغرة أمنية أخرى تؤثر على معالجات Intel ، مما قد يتسبب في تعطل النظام. تستكشف المقالة أيضا استخدام الأساليب الرسمية في تصميم وحدة المعالجة المركزية والاضطرابات المحتملة من مشاركة موارد الحوسبة. كما تم ذكر تعقيد وحدات المعالجة المركزية الحديثة والتأثير المحتمل الذكاء الاصطناعي على تصميم وحدة المعالجة المركزية."
    ],
    "points": 468,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1699984183
  },
  {
    "id": 38262124,
    "title": "جوجل تقاضي الأفراد لاستخدامهم إشعارات إزالة قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية الاحتيالية لسحق المنافسة",
    "originLink": "https://torrentfreak.com/google-sues-men-who-weaponized-dmca-notices-to-crush-competition-231114/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262124",
    "commentBody": "",
    "originSummary": [
      "بدأت Google إجراء قانونيا ضد شخصين من فيتنام متهمين بإرسال إشعارات إزالة مزيفة لقانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية باستخدام 65 حسابا على Google.",
      "يزعم أن المدعى عليهم أساءوا استخدام نظام الإشعار والإزالة ، متظاهرين بأنهم كيانات حسنة السمعة لإزالة المحتوى المشروع والإضرار بأعمال Google.",
      "وتعتزم غوغل تقديم المتهمين إلى العدالة وتسعى للحصول على تعويض عن الأضرار والرسوم القانونية."
    ],
    "commentSummary": [
      "اتخذت Google إجراءات قانونية ضد شخصين أرسلا إشعارات كاذبة بموجب قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية في محاولة لخنق المنافسة.",
      "تلفت هذه الدعوى الانتباه إلى العيوب في نظام قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية وتؤكد على أهمية الإصلاحات لمنع إساءة الاستخدام في المستقبل.",
      "استخدم الأفراد المستهدفون بدعوى Google إشعارات مزيفة لقانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية لقمع المنافسة ، مما يكشف عن جانب مقلق من النظام الحالي."
    ],
    "points": 371,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1699962517
  },
  {
    "id": 38267588,
    "title": "المركبات ذات النهايات الأمامية الأعلى والأكثر عمودية تزيد من المخاطر على المشاة: دراسة",
    "originLink": "https://www.iihs.org/news/detail/vehicles-with-higher-more-vertical-front-ends-pose-greater-risk-to-pedestrians",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38267588",
    "commentBody": "",
    "originSummary": [
      "تم العثور على المركبات ذات النهايات الأمامية الأطول والأكثر عمودية لتشكل خطرا أكبر على المشاة ، وفقا لبحث أجراه IIHS.",
      "المركبات التي يزيد ارتفاعها عن 40 بوصة أكثر عرضة بنسبة 45٪ للتسبب في وفيات في حوادث المشاة مقارنة بتلك التي يبلغ ارتفاع غطاء المحرك 30 بوصة أو أقل وملف تعريف مائل.",
      "المركبات التي يتراوح ارتفاعها بين 30 و 40 بوصة والواجهة الأمامية الحادة تزيد أيضا من المخاطر التي يتعرض لها المشاة. تؤكد الدراسة على أهمية تصميم المركبات ذات النهايات الأمامية السفلية والشبكات الزاوية للتخفيف من الخطر على المشاة."
    ],
    "commentSummary": [
      "تشمل المناقشة مجالات متعددة مثل سلامة المركبات واللوائح وتفضيلات المستهلك والتخطيط الحضري.",
      "تشمل الموضوعات الرئيسية تأثير تصميم السيارة على سلامة المشاة ، والدعوة إلى لوائح وعقوبات أكثر صرامة للحوادث ، والعلاقة بين اللوائح وحجم السيارة / كفاءة استهلاك الوقود ، وارتفاع شعبية سيارات الدفع الرباعي والشاحنات ، ومزايا وعيوب وسائل النقل المختلفة.",
      "تعرض المحادثة مجموعة متنوعة من وجهات النظر ، وتسلط الضوء على تعقيد القيادة والنقل."
    ],
    "points": 304,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1699987370
  },
  {
    "id": 38263294,
    "title": "الكثير من الأضرار في غريندافيك: الزلازل والتشوه تؤثر على المباني والبنية التحتية",
    "originLink": "https://icelandmonitor.mbl.is/news/news/2023/11/13/a_lot_of_damage_in_grindavik/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263294",
    "commentBody": "",
    "originSummary": [
      "عانت بلدة جريندافيك في أيسلندا من أضرار من الزلازل والتشوه الذي يتحرك نحو اقتحام الصهارة تحت الأرض.",
      "ظهر صدع كبير في المدينة ، مما ألحق أضرارا بالمباني والبنية التحتية مثل أنبوب الماء الساخن والمركز الرياضي.",
      "ومنح السكان وقتا محدودا لجمع أمتعتهم وفرق الإنقاذ على أهبة الاستعداد رغم عدم تدمير أي مبان بالكامل. وتراقب السلطات الوضع عن كثب."
    ],
    "commentSummary": [
      "تواجه بلدة جريندافيك في أيسلندا نشاطا زلزاليا متزايدا وتشوها في الأرض ، مما يؤدي إلى احتمال حدوث ثوران بركاني.",
      "تم إخلاء المدينة ، وأثيرت مخاوف بشأن التأثير على سكان أيسلندا والمطار الدولي الوحيد في البلاد.",
      "تشمل مصادر المعلومات الموثوقة الموصى بها قناة YouTube الخاصة بأستاذ الجيولوجيا وموقع مكتب الأرصاد الجوية الأيسلندي."
    ],
    "points": 302,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1699970081
  },
  {
    "id": 38264937,
    "title": ".NET 8: أحدث إصدار LTS مع تحسينات في الأداء والإنتاجية",
    "originLink": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-8/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264937",
    "commentBody": "",
    "originSummary": [
      "تم الإعلان عن .NET 8 كأحدث إصدار للدعم طويل الأجل (LTS) من النظام الأساسي للتطوير.",
      "إنه يجلب تحسينات في الأداء والاستقرار والأمان ، بالإضافة إلى تحسينات النظام الأساسي والأدوات.",
      "يتيح .NET 8 تطوير تطبيقات ذكية وسحابية أصلية وخدمات عالية الحركة يمكنها التوسع حسب الطلب."
    ],
    "commentSummary": [
      "تتمحور المناقشات حول جوانب مختلفة من نظام .NET البيئي ، بما في ذلك التجارب الإيجابية ومجالات النمو وتطوير التطبيقات عبر الأنظمة الأساسية.",
      "يقترح المشاركون أطر عمل بديلة مثل Xamarin و Livecode لتطوير واجهة المستخدم عبر الأنظمة الأساسية ومناقشة التحديات في هذا المجال.",
      "يعبر بعض المشاركين عن تفضيلهم ل Go نظرا لبساطته وقدراته عبر الأنظمة الأساسية ، لكنهم يلاحظون قيودا في تطوير واجهة المستخدم الرسومية والتشغيل المتداخل C ++."
    ],
    "points": 296,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1699977631
  },
  {
    "id": 38263435,
    "title": "تقارير Backblaze انخفاض في معدلات فشل محرك الأقراص في Q3 2023",
    "originLink": "https://www.backblaze.com/blog/backblaze-drive-stats-for-q3-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263435",
    "commentBody": "",
    "originSummary": [
      "راقبت Backblaze أكثر من 263,992 محرك أقراص ثابتة (HDD) ومحركات أقراص الحالة الصلبة (SSD) في مراكز البيانات الخاصة بها في الربع الثالث من عام 2023.",
      "انخفض معدل الفشل الفصلي لجميع محركات الأقراص من 2.2٪ إلى 1.47٪ مقارنة بالربع السابق.",
      "تقاعد Backblaze 4,585 محرك أقراص قديم سعة 4 تيرابايت وسيراقب عن كثب عددا صغيرا من محركات الأقراص التي تجاوزت درجة حرارتها القصوى لمقارنة معدلات فشلها بمحركات الأقراص التي تعمل ضمن مواصفات الشركة المصنعة. ظل معدل الفشل الإجمالي مدى الحياة لجميع محركات الأقراص ثابتا عند حوالي 1.4٪."
    ],
    "commentSummary": [
      "تناقش المقالة تأثير درجة الحرارة على عمر محركات الأقراص الثابتة وتقترح مقارنة محركات الأقراص ذات درجات الحرارة الثابتة بتلك ذات التقلبات.",
      "يتم التأكيد على أهمية التخلص من البيانات وأمن التشفير ، مع ملاحظة الحاجة إلى تدمير محركات الأقراص الثابتة فعليا.",
      "تغطي تعليقات المستخدمين موضوعات مثل موثوقية محرك الأقراص وبرامج النسخ الاحتياطي وتجارب المستخدم ، مع مشاركة التجارب الإيجابية جنبا إلى جنب مع المخاوف المتعلقة بأخطاء البرامج الثابتة وموثوقية بعض حلول النسخ الاحتياطي."
    ],
    "points": 263,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1699970839
  },
  {
    "id": 38272132,
    "title": "الولايات المتحدة تدخل صناعة الوقود النووي بإنتاج ناجح لوقود اليورانيوم",
    "originLink": "https://spectrum.ieee.org/nuclear-power-plant-2666199640",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38272132",
    "commentBody": "",
    "originSummary": [
      "حققت شركة Centrus Energy إنجازا مهما من خلال إنتاج الدفعة الأولى من وقود اليورانيوم بنجاح.",
      "ويدل هذا الإنجاز على عودة الولايات المتحدة إلى صناعة الوقود النووي.",
      "ويكتسي هذا التطور أهمية خاصة بالنسبة للمفاعلات المتقدمة، مما يسلط الضوء على أهمية هذا الإنجاز."
    ],
    "commentSummary": [
      "يدور النقاش حول جوانب متعددة من الطاقة النووية ، مثل عودة الولايات المتحدة إلى سوق الوقود النووي ومخاوف السلامة.",
      "ويشمل أيضا مقارنة التكلفة بين الطاقة النووية والفحم، فضلا عن إمكانية إعادة معالجة الوقود المستهلك.",
      "تتعمق المحادثة في تحديات الطاقة النووية وقيودها ومزاياها وعيوبها ، بما في ذلك دمجها مع البطاريات في شبكة الطاقة واعتماد الصين لمصادر الطاقة المتجددة."
    ],
    "points": 260,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1700010735
  },
  {
    "id": 38266340,
    "title": "يتسبب تحديث برنامج Rivian في عدم استجابة نظام المعلومات والترفيه ، وإصلاح بعيد المنال",
    "originLink": "https://electrek.co/2023/11/14/rivian-software-update-bricks-infotainment-system-fix-not-obvious/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266340",
    "commentBody": "",
    "originSummary": [
      "تسبب تحديث البرنامج من Rivian في تعطل نظام المعلومات والترفيه ، مما جعله غير مستجيب.",
      "حل لإصلاح المشكلة غير متوفر حاليا أو يمكن الوصول إليه بسهولة.",
      "يواجه المستخدمون حاليا صعوبات في أنظمة المعلومات والترفيه Rivian الخاصة بهم بسبب تحديث البرنامج هذا."
    ],
    "commentSummary": [
      "تركز المناقشة على تحديثات البرامج في صناعة السيارات ، مع تسليط الضوء على مخاطر وتحديات نشر التحديثات على عدد كبير من الأجهزة.",
      "تشمل الموضوعات التي يتم تناولها أهمية الاختبار والطرح التدريجي ، بالإضافة إلى التأكد من أن تحديثات البرامج لا تسبب مشكلات حرجة.",
      "تدور المناقشات حول تعقيدات أنظمة المعلومات والترفيه ، واستخدام تحديثات OTA ، والمخاطر المحتملة لتحديث البرامج أثناء القيادة. هناك أيضا انتقادات موجهة نحو Rivian بسبب خطأ تحديث البرنامج الأخير."
    ],
    "points": 244,
    "commentCount": 340,
    "retryCount": 0,
    "time": 1699982570
  },
  {
    "id": 38261539,
    "title": "تقليل الاعتماد على crates.io: نهج بديل لتغليف الصدأ",
    "originLink": "https://thomask.sdf.org/blog/2023/11/14/rust-without-crates-io.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261539",
    "commentBody": "",
    "originSummary": [
      "يثير المؤلف مخاوف بشأن الاعتماد فقط على crates.io كمستودع لكود Rust ويقترح طريقة توزيع بديلة مشابهة لتوزيعات Linux مثل دبيان.",
      "يثني المؤلف على فريق تغليف Rust في دبيان لتنظيمه مجموعة من مكتبات Rust ، مما يقلل من مخاطر التبعية المرتبطة بالاعتماد فقط على crates.io.",
      "يزيد هذا النهج البديل من ثقة المؤلف في استخدام Rust في المستقبل."
    ],
    "commentSummary": [
      "تستكشف المقالة تحديات استخدام مكتبات الجهات الخارجية وإدارة التبعيات بلغات مثل C و C ++ ، بما في ذلك صعوبات إعداد الإنشاء ومشكلات الصيانة ومشكلات توافق الإصدار.",
      "crates.io ، يتم تسليط الضوء على نظام تغليف Rust كحل لهذه التحديات ، مما يوفر تحكما أفضل في التبعيات ويضمن التوافق.",
      "يتم التأكيد على الحاجة إلى تحسين التدابير الأمنية ، مثل الحماية من هجمات سلسلة التوريد ، إلى جانب أهمية إدارة التبعيات بشكل آمن واستخدام أدوات المسح ومستودعات المكتبة المنسقة."
    ],
    "points": 225,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1699958048
  },
  {
    "id": 38261982,
    "title": "تطوير لغة برمجة: التحديات والنصائح والرؤى",
    "originLink": "https://yorickpeterse.com/articles/a-decade-of-developing-a-programming-language/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261982",
    "commentBody": "",
    "originSummary": [
      "يناقش المؤلف تجربتهم والتحديات التي يواجهونها في تطوير لغة برمجة Inko ، بما في ذلك قرار التحول إلى الكتابة الثابتة والصعوبات في الاستضافة الذاتية وإنشاء التعليمات البرمجية.",
      "يعد بناء لغة ونظام بيئي قويين أمرا ضروريا ، مع وجود تحديات في الأداء ودعم النظام الأساسي وبناء الجملة واكتساب المستخدم.",
      "يوصى بالتركيز على الدلالات واستخدام بناء الجملة الحالي عند النماذج الأولية ، مع التوجيه من موارد ومجتمعات محددة.",
      "تتطلب تنمية قاعدة المستخدمين والمكتبات وقتا واستثمارا ، مع إعطاء الأولوية للوظائف على الأداء في البداية.",
      "يستغرق تطوير لغة مستخدمة وناجحة على نطاق واسع ما لا يقل عن 10-15 عاما من التطوير."
    ],
    "commentSummary": [
      "يعد فهم المستخدمين المستهدفين والمشاكل أمرا بالغ الأهمية عند تطوير لغة برمجة.",
      "قد يكون تنفيذ التحقق من النوع أمرا صعبا ، ويوصى بالبدء بلغات أبسط.",
      "هناك جدل بين الكتابة التدريجية والكتابة الثابتة ، حيث يدافع البعض عن فوائد الكتابة التدريجية في التقاط الأخطاء والتوثيق ، بينما يفضل البعض الآخر الكتابة الثابتة.",
      "يجب أن يعتمد الاختيار بين الكتابة الثابتة والديناميكية على التفضيل الفردي والإنتاجية.",
      "كما تتم مناقشة دمج الكتابة الديناميكية في اللغات المكتوبة بشكل ثابت.",
      "تؤكد المناقشة على الأساليب المختلفة لتصميم اللغة والتحقق من النوع ، والتحديات التي تشكلها ، وإيجابيات وسلبيات أنظمة الكتابة المختلفة."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1699961500
  },
  {
    "id": 38262775,
    "title": "تم إصدار Lapce Editor 0.3.0 مع ميزات جديدة وإصلاحات للأخطاء",
    "originLink": "https://github.com/lapce/lapce/releases/tag/v0.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262775",
    "commentBody": "",
    "originSummary": [
      "أحدث إصدار من شوكة الإشعارات العامة lapce على GitHub هو الإصدار 0.3.0 ، والذي يقدم العديد من الميزات والتغييرات الجديدة.",
      "يتضمن هذا الإصدار إعادة كتابة باستخدام Floem UI ، وإعادة تنفيذ عدسة كاملة ، وخيار استخدام Lapce على Linux.",
      "بالإضافة إلى ذلك ، فإنه ينفذ وظيفة vim-motion متعددة الخطوط لعمليات السحب والحذف والبحث والاستبدال ، ويتضمن إصلاحات للأخطاء.",
      "تلقى الإصدار ردود فعل إيجابية من 114 فردا."
    ],
    "commentSummary": [
      "محرر Lapce هو محرر كود مفتوح المصدر تتم مقارنته بالمحررين المشهورين مثل VSCode و Sublime Text.",
      "تم الإشادة به لسرعته ووظائفه ولكن بعض المستخدمين لديهم مخاوف بشأن الميزات المفقودة.",
      "إحدى الميزات البارزة المحتملة هي دعم المكون الإضافي / قابلية التوسعة ، لكن المشروع لا يزال في مرحلة التطوير المبكرة ولديه مجال للتحسين."
    ],
    "points": 208,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1699966855
  }
]
