[
  {
    "id": 38262315,
    "title": "Blender 4.0: Pembaruan Menarik dan Perubahan Kompatibilitas",
    "originLink": "https://wiki.blender.org/wiki/Reference/Release_Notes/4.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262315",
    "commentBody": "",
    "originSummary": [
      "Blender 4.0 dirilis pada tanggal 14 November 2023, dengan pembaruan dan peningkatan yang signifikan di berbagai bidang seperti animasi, rigging, pemodelan, dan banyak lagi.",
      "Rilis ini mencakup perubahan pada format mesh dan persyaratan kompatibilitas baru untuk kartu grafis.",
      "Pembaruan ini juga menghadirkan penyempurnaan di berbagai bidang, seperti node geometri, bayangan, tekstur, siklus, dan antarmuka pengguna, di antaranya."
    ],
    "commentSummary": [
      "Para pengguna mempelajari berbagai topik seputar Blender, seperti catatan rilisnya, prospek pekerjaan di bidang animasi, dan penggunaan aljabar linier dan pemrograman dalam rendering dan animasi karakter.",
      "Keberhasilan Blender sebagai proyek sumber terbuka dan pengembangan antarmuka penggunanya juga dibahas.",
      "Para pengguna membandingkan Blender dengan perangkat lunak Adobe dan mengeksplorasi potensi fitur berbagi sumber daya bawaan."
    ],
    "points": 660,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1699963890
  },
  {
    "id": 38261415,
    "title": "Parlemen Uni Eropa Mengambil Langkah untuk Melindungi Anak-anak dari Pelecehan Seksual Online",
    "originLink": "https://www.europarl.europa.eu/news/en/press-room/20231110IPR10118/child-sexual-abuse-online-effective-measures-no-mass-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261415",
    "commentBody": "",
    "originSummary": [
      "Komite Kebebasan Sipil telah menyetujui langkah-langkah baru untuk melindungi anak-anak dari pelecehan seksual terhadap anak secara online.",
      "Penyedia layanan internet akan diminta untuk menilai risiko layanan mereka disalahgunakan dan mengambil langkah-langkah untuk mencegah pelecehan seksual terhadap anak.",
      "Jika tindakan pencegahan gagal, perintah deteksi yang disahkan pengadilan dapat digunakan untuk menemukan materi ilegal, dan Pusat Perlindungan Anak Uni Eropa akan dibentuk untuk menegakkan aturan."
    ],
    "commentSummary": [
      "Komite Kebebasan Sipil Parlemen Uni Eropa telah menghapus persyaratan kontrol obrolan dan enkripsi yang dilindungi dalam peraturan Kontrol Obrolan yang diusulkan, tetapi negosiasi untuk finalisasi masih menunggu.",
      "Kekhawatiran tentang potensi penyalahgunaan pemindaian pesan untuk materi pelecehan seksual anak telah dikemukakan.",
      "Penolakan pintu belakang dalam enkripsi dan pemindaian pesan pribadi oleh Parlemen Uni Eropa dipandang sebagai kemenangan bagi pendukung privasi, tetapi perusahaan teknologi dapat melobi untuk mendapatkan pengecualian."
    ],
    "points": 553,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1699957055
  },
  {
    "id": 38264641,
    "title": "Model AI GraphCast Google Merevolusi Prakiraan Cuaca, Mengungguli Metode Tradisional",
    "originLink": "https://deepmind.google/discover/blog/graphcast-ai-model-for-faster-and-more-accurate-global-weather-forecasting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264641",
    "commentBody": "",
    "originSummary": [
      "Google telah mengembangkan model AI yang disebut GraphCast yang dapat membuat prakiraan cuaca jarak menengah yang lebih akurat dan lebih cepat dibandingkan dengan metode tradisional.",
      "Model ini memprediksi kondisi cuaca hingga 10 hari sebelumnya, sehingga memungkinkan peringatan lebih awal tentang peristiwa cuaca ekstrem seperti angin topan dan banjir.",
      "GraphCast dilatih dengan data cuaca historis menggunakan pembelajaran mesin dan jaringan syaraf tiruan, mengungguli sistem simulasi cuaca standar industri dalam hal akurasi dan memberikan prediksi yang lebih baik untuk cuaca di masa depan.",
      "Kode model ini bersifat terbuka, sehingga para ilmuwan dan prakirawan di seluruh dunia dapat memanfaatkannya dan berpotensi menyelamatkan nyawa serta mendukung pengambilan keputusan penting di berbagai industri dan masyarakat."
    ],
    "commentSummary": [
      "Google DeepMind telah mengembangkan model prakiraan cuaca AI baru yang disebut GraphCast, yang menggabungkan data dari berbagai model cuaca numerik menggunakan pembelajaran mesin untuk meningkatkan akurasi.",
      "Diskusi berkisar pada keterbatasan API yang ada, ketersediaan data cuaca historis, dan integrasi data tentang kejadian ekstrem.",
      "Terdapat potensi manfaat dan tantangan dalam menggunakan pembelajaran mesin dalam prediksi cuaca, serta persaingan dalam industri ini. Teknologi ini dapat berimplikasi pada berbagai industri yang mengandalkan prakiraan cuaca yang akurat."
    ],
    "points": 527,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1699976543
  },
  {
    "id": 38266773,
    "title": "Bug pada Prosesor Tertentu Dapat Menyebabkan Glitch State, Menimbulkan Risiko Keamanan bagi Penyedia Cloud",
    "originLink": "https://lock.cmpxchg8b.com/reptar.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266773",
    "commentBody": "",
    "originSummary": [
      "Beberapa tim peneliti di Google telah menemukan bug pada prosesor tertentu yang dapat menyebabkan prosesor tersebut memasuki kondisi glitch, yang mengakibatkan perilaku yang tidak dapat diprediksi dan sistem berhenti.",
      "Bug ini melibatkan penggunaan awalan rex yang berlebihan dan fitur fast short repeat move (FSRM).",
      "Intel telah merilis kode mikro yang diperbarui dan solusi untuk mengatasi kerentanan ini, yang memiliki implikasi keamanan yang serius bagi penyedia cloud."
    ],
    "commentSummary": [
      "\"Reptar\" adalah kerentanan CPU yang memicu pengecualian pemeriksaan mesin dan penghentian prosesor, yang telah ditemukan oleh Google dan tim peneliti lainnya.",
      "Artikel ini membahas dampak \"Reptar\" pada CPU AMD dan menyoroti tantangan yang dihadapi dalam desain CPU.",
      "Kerentanan lain yang mempengaruhi prosesor Intel disebutkan, yang berpotensi menyebabkan kerusakan sistem. Artikel ini juga mengeksplorasi penggunaan metode formal dalam desain CPU dan potensi gangguan dari berbagi sumber daya komputasi. Kompleksitas CPU modern dan potensi pengaruh AI pada desain CPU juga disebutkan."
    ],
    "points": 468,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1699984183
  },
  {
    "id": 38262124,
    "title": "Google menggugat individu yang menggunakan pemberitahuan penghapusan DMCA yang curang untuk menghancurkan persaingan",
    "originLink": "https://torrentfreak.com/google-sues-men-who-weaponized-dmca-notices-to-crush-competition-231114/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262124",
    "commentBody": "",
    "originSummary": [
      "Google telah memulai proses hukum terhadap dua orang dari Vietnam yang dituduh mengirimkan pemberitahuan penghapusan DMCA palsu dengan menggunakan 65 akun Google.",
      "Para terdakwa diduga menyalahgunakan sistem notice-and-takedown, dengan menyamar sebagai entitas yang memiliki reputasi baik untuk menghapus konten yang sah dan merugikan bisnis Google.",
      "Google berniat untuk membawa para terdakwa ke pengadilan dan mencari kompensasi atas kerusakan dan biaya hukum."
    ],
    "commentSummary": [
      "Google telah mengambil tindakan hukum terhadap dua orang yang mengirimkan pemberitahuan DMCA palsu dalam upaya untuk menghambat persaingan.",
      "Gugatan ini memberikan perhatian pada kelemahan sistem DMCA dan menekankan pentingnya reformasi untuk mencegah penyalahgunaan di masa depan.",
      "Individu-individu yang menjadi target gugatan Google menggunakan pemberitahuan DMCA palsu untuk menekan persaingan, yang menunjukkan aspek yang memprihatinkan dari sistem yang ada saat ini."
    ],
    "points": 371,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1699962517
  },
  {
    "id": 38267588,
    "title": "Kendaraan dengan Bagian Depan yang Lebih Tinggi dan Vertikal Meningkatkan Risiko bagi Pejalan Kaki: Studi",
    "originLink": "https://www.iihs.org/news/detail/vehicles-with-higher-more-vertical-front-ends-pose-greater-risk-to-pedestrians",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38267588",
    "commentBody": "",
    "originSummary": [
      "Kendaraan dengan ujung depan yang lebih tinggi dan lebih vertikal terbukti menimbulkan risiko yang lebih tinggi bagi pejalan kaki, menurut penelitian IIHS.",
      "Kendaraan dengan tinggi kap mesin di atas 40 inci memiliki kemungkinan 45% lebih besar untuk menyebabkan kematian pada kecelakaan pejalan kaki dibandingkan dengan kendaraan yang memiliki tinggi kap mesin 30 inci atau kurang dan profil yang lebih landai.",
      "Kendaraan dengan tinggi kap mesin antara 30 dan 40 inci dan ujung depan yang tumpul juga meningkatkan risiko bagi pejalan kaki. Studi ini menekankan pentingnya merancang kendaraan dengan ujung depan yang lebih rendah dan kisi-kisi yang bersudut untuk mengurangi bahaya bagi pejalan kaki."
    ],
    "commentSummary": [
      "Diskusi ini mencakup berbagai bidang seperti keselamatan kendaraan, peraturan, preferensi konsumen, dan perencanaan kota.",
      "Topik-topik utama meliputi pengaruh desain kendaraan terhadap keselamatan pejalan kaki, seruan untuk peraturan yang lebih ketat dan hukuman untuk kecelakaan, korelasi antara peraturan dan ukuran mobil/efisiensi bahan bakar, meningkatnya popularitas SUV dan truk, serta keuntungan dan kerugian dari moda transportasi yang berbeda.",
      "Percakapan ini menampilkan beragam perspektif, menyoroti kompleksitas mengemudi dan transportasi."
    ],
    "points": 304,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1699987370
  },
  {
    "id": 38263294,
    "title": "Banyak Kerusakan di Grindavík: Gempa Bumi dan Deformasi Berdampak pada Bangunan dan Infrastruktur",
    "originLink": "https://icelandmonitor.mbl.is/news/news/2023/11/13/a_lot_of_damage_in_grindavik/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263294",
    "commentBody": "",
    "originSummary": [
      "Kota Grindavík di Islandia telah mengalami kerusakan akibat gempa bumi dan deformasi yang bergerak menuju intrusi magma bawah tanah.",
      "Sebuah retakan besar telah muncul di kota, merusak bangunan dan infrastruktur seperti pipa air panas dan pusat olahraga.",
      "Warga diberi waktu terbatas untuk mengumpulkan barang-barang mereka dan tim penyelamat masih bersiaga, meskipun tidak ada bangunan yang benar-benar hancur. Pihak berwenang memantau situasi dengan cermat."
    ],
    "commentSummary": [
      "Kota Grindavík di Islandia menghadapi peningkatan aktivitas seismik dan deformasi tanah, yang mengarah ke kemungkinan letusan gunung berapi.",
      "Kota ini telah dievakuasi, dan muncul kekhawatiran akan dampaknya terhadap populasi Islandia dan satu-satunya bandara internasional di negara tersebut.",
      "Sumber informasi terpercaya yang direkomendasikan antara lain saluran YouTube profesor geologi dan situs web Kantor Meteorologi Islandia."
    ],
    "points": 302,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1699970081
  },
  {
    "id": 38264937,
    "title": ".NET 8: Versi LTS Terbaru dengan Peningkatan Kinerja dan Produktivitas",
    "originLink": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-8/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264937",
    "commentBody": "",
    "originSummary": [
      "NET 8 telah diumumkan sebagai versi Long-Term Support (LTS) terbaru dari platform pengembangan.",
      "Ini membawa peningkatan kinerja, stabilitas, dan keamanan, serta peningkatan platform dan perkakas.",
      "NET 8 memungkinkan pengembangan aplikasi cerdas, aplikasi asli cloud dan layanan lalu lintas tinggi yang dapat ditingkatkan sesuai permintaan."
    ],
    "commentSummary": [
      "Diskusi berpusat pada berbagai aspek ekosistem .NET, termasuk pengalaman positif, area pertumbuhan, dan pengembangan aplikasi lintas platform.",
      "Para peserta menyarankan kerangka kerja alternatif seperti Xamarin dan Livecode untuk pengembangan UI lintas platform dan mendiskusikan tantangan di bidang ini.",
      "Beberapa peserta mengungkapkan preferensi untuk Go karena kesederhanaan dan kemampuan lintas platformnya, tetapi mencatat keterbatasan dalam pengembangan GUI dan interop C++."
    ],
    "points": 296,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1699977631
  },
  {
    "id": 38263435,
    "title": "Backblaze Melaporkan Penurunan Tingkat Kegagalan Drive pada Q3 2023",
    "originLink": "https://www.backblaze.com/blog/backblaze-drive-stats-for-q3-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263435",
    "commentBody": "",
    "originSummary": [
      "Backblaze memantau lebih dari 263.992 hard disk drive (HDD) dan solid state drive (SSD) di pusat data mereka pada Q3 2023.",
      "Tingkat kegagalan kuartalan untuk semua drive menurun dari 2,2% menjadi 1,47% dibandingkan kuartal sebelumnya.",
      "Backblaze memensiunkan 4.585 drive 4TB yang sudah tua dan akan memonitor sejumlah kecil drive yang melebihi suhu maksimum untuk membandingkan tingkat kegagalannya dengan drive yang beroperasi sesuai spesifikasi pabrikan. Tingkat kegagalan seumur hidup secara keseluruhan untuk semua drive tetap konsisten di sekitar 1,4%."
    ],
    "commentSummary": [
      "Artikel ini membahas dampak suhu pada masa pakai hard drive dan menyarankan untuk membandingkan drive dengan suhu yang stabil dengan drive yang mengalami fluktuasi.",
      "Pentingnya pembuangan data dan keamanan enkripsi ditekankan, dengan memperhatikan kebutuhan untuk menghancurkan hard drive secara fisik.",
      "Komentar dari pengguna mencakup topik-topik seperti keandalan drive, perangkat lunak pencadangan, dan pengalaman pengguna, dengan pengalaman positif yang dibagikan di samping kekhawatiran tentang kesalahan firmware dan kepercayaan terhadap solusi pencadangan tertentu."
    ],
    "points": 263,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1699970839
  },
  {
    "id": 38272132,
    "title": "AS Kembali Memasuki Industri Bahan Bakar Nuklir dengan Keberhasilan Produksi Bahan Bakar Uranium",
    "originLink": "https://spectrum.ieee.org/nuclear-power-plant-2666199640",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38272132",
    "commentBody": "",
    "originSummary": [
      "Centrus Energy telah mencapai tonggak sejarah yang signifikan dengan berhasil memproduksi bahan bakar uranium tahap awal.",
      "Pencapaian ini menandakan kembalinya Amerika Serikat ke industri bahan bakar nuklir.",
      "Pengembangan ini sangat signifikan untuk reaktor tingkat lanjut, menyoroti pentingnya pencapaian ini."
    ],
    "commentSummary": [
      "Diskusi ini berkisar pada berbagai aspek energi nuklir, seperti masuknya kembali AS ke pasar bahan bakar nuklir dan masalah keamanan.",
      "Hal ini juga mencakup perbandingan biaya antara energi nuklir dan batu bara, serta kemungkinan pemrosesan ulang bahan bakar bekas.",
      "Percakapan ini membahas tantangan, keterbatasan, keuntungan, dan kerugian energi nuklir, termasuk integrasinya dengan baterai di jaringan listrik dan adopsi energi terbarukan di Tiongkok."
    ],
    "points": 260,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1700010735
  },
  {
    "id": 38266340,
    "title": "Pembaruan perangkat lunak Rivian menyebabkan sistem infotainment tidak responsif, perbaikannya sulit dipahami",
    "originLink": "https://electrek.co/2023/11/14/rivian-software-update-bricks-infotainment-system-fix-not-obvious/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266340",
    "commentBody": "",
    "originSummary": [
      "Pembaruan perangkat lunak dari Rivian telah menyebabkan sistem infotainment tidak berfungsi, membuatnya tidak responsif.",
      "Solusi untuk memperbaiki masalah ini saat ini tidak tersedia atau tidak mudah diakses.",
      "Para pengguna saat ini mengalami kesulitan dengan sistem infotainment Rivian mereka karena pembaruan perangkat lunak ini."
    ],
    "commentSummary": [
      "Diskusi ini berfokus pada pembaruan perangkat lunak dalam industri otomotif, menyoroti risiko dan tantangan dalam menerapkan pembaruan ke sejumlah besar perangkat.",
      "Topik yang dibahas meliputi pentingnya pengujian dan peluncuran bertahap, serta memastikan bahwa pembaruan perangkat lunak tidak menyebabkan masalah kritis.",
      "Perdebatan berkisar pada kerumitan sistem infotainment, penggunaan pembaruan OTA, dan potensi bahaya memperbarui perangkat lunak saat mengemudi. Ada juga kritik yang ditujukan kepada Rivian atas kesalahan pembaruan perangkat lunak baru-baru ini."
    ],
    "points": 244,
    "commentCount": 340,
    "retryCount": 0,
    "time": 1699982570
  },
  {
    "id": 38261539,
    "title": "Mengurangi Ketergantungan pada crates.io: Pendekatan Alternatif untuk Pengemasan Karat",
    "originLink": "https://thomask.sdf.org/blog/2023/11/14/rust-without-crates-io.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261539",
    "commentBody": "",
    "originSummary": [
      "Penulis menyuarakan kekhawatirannya untuk hanya mengandalkan crates.io sebagai tempat penyimpanan kode Rust dan mengusulkan sebuah metode distribusi alternatif yang mirip dengan distribusi Linux seperti Debian.",
      "Penulis memuji tim pengemasan Rust Debian yang telah mengurasi koleksi pustaka Rust, yang mengurangi risiko ketergantungan karena hanya mengandalkan crates.io.",
      "Pendekatan alternatif ini meningkatkan kepercayaan diri penulis untuk menggunakan Rust di masa mendatang."
    ],
    "commentSummary": [
      "Artikel ini membahas tantangan dalam menggunakan pustaka pihak ketiga dan mengelola ketergantungan dalam bahasa seperti C dan C++, termasuk kesulitan dalam membangun, masalah pemeliharaan, dan masalah kompatibilitas versi.",
      "Sistem pengemasan Rust, crates.io, disorot sebagai solusi untuk tantangan-tantangan ini, menawarkan kontrol yang lebih baik atas ketergantungan dan memastikan kompatibilitas.",
      "Perlunya langkah-langkah keamanan yang lebih baik, seperti perlindungan terhadap serangan rantai pasokan, ditekankan, bersama dengan pentingnya mengelola ketergantungan dengan aman dan memanfaatkan alat pemindaian dan repositori perpustakaan yang telah dikurasi."
    ],
    "points": 225,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1699958048
  },
  {
    "id": 38261982,
    "title": "Mengembangkan Bahasa Pemrograman: Tantangan, Kiat, dan Wawasan",
    "originLink": "https://yorickpeterse.com/articles/a-decade-of-developing-a-programming-language/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261982",
    "commentBody": "",
    "originSummary": [
      "Penulis membahas pengalaman dan tantangan mereka dalam mengembangkan bahasa pemrograman Inko, termasuk keputusan untuk beralih ke pengetikan statis dan kesulitan dalam melakukan hosting sendiri dan pembuatan kode.",
      "Membangun bahasa dan ekosistem yang solid sangatlah penting, dengan tantangan dalam hal performa, dukungan platform, sintaksis, dan akuisisi pengguna.",
      "Disarankan untuk fokus pada semantik dan menggunakan sintaksis yang ada saat membuat prototipe, dengan panduan dari sumber daya dan komunitas tertentu.",
      "Mengembangkan basis pengguna dan perpustakaan membutuhkan waktu dan investasi, memprioritaskan fungsionalitas di atas kinerja pada awalnya.",
      "Mengembangkan bahasa yang digunakan secara luas dan sukses membutuhkan waktu setidaknya 10-15 tahun."
    ],
    "commentSummary": [
      "Memahami target pengguna dan masalah sangat penting ketika mengembangkan bahasa pemrograman.",
      "Menerapkan pemeriksaan tipe bisa jadi menantang, dan disarankan untuk memulai dengan bahasa yang lebih sederhana.",
      "Terdapat perdebatan antara pengetikan bertahap dan pengetikan statis, dengan beberapa orang menganjurkan pengetikan bertahap untuk menangkap bug dan manfaat dokumentasi, sementara yang lain lebih memilih pengetikan statis.",
      "Pilihan antara pengetikan statis dan dinamis harus didasarkan pada preferensi dan produktivitas individu.",
      "Mengintegrasikan pengetikan dinamis ke dalam bahasa yang diketik secara statis juga dibahas.",
      "Diskusi ini menekankan pada berbagai pendekatan untuk desain bahasa dan pemeriksaan ketikan, tantangan yang ditimbulkannya, dan pro dan kontra dari sistem pengetikan yang berbeda."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1699961500
  },
  {
    "id": 38262775,
    "title": "Lapce Editor 0.3.0 Dirilis dengan Fitur Baru dan Perbaikan Bug",
    "originLink": "https://github.com/lapce/lapce/releases/tag/v0.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262775",
    "commentBody": "",
    "originSummary": [
      "Rilis terbaru dari lapce Public Notifications Fork di GitHub adalah versi 0.3.0, yang memperkenalkan beberapa fitur dan perubahan baru.",
      "Rilis ini menyertakan penulisan ulang dengan Floem UI, implementasi ulang lensa yang sudah selesai, dan opsi untuk menggunakan Lapce di Linux.",
      "Selain itu, ini mengimplementasikan fungsionalitas vim-motion multi-line untuk operasi tarik, hapus, cari, dan ganti, serta menyertakan perbaikan bug.",
      "Rilis ini telah menerima umpan balik positif dari 114 orang."
    ],
    "commentSummary": [
      "Lapce Editor adalah editor kode sumber terbuka yang dibandingkan dengan editor populer seperti VSCode dan Sublime Text.",
      "Kamera ini dipuji karena kecepatan dan fungsionalitasnya, tetapi sebagian pengguna memiliki kekhawatiran tentang fitur yang hilang.",
      "Salah satu fitur potensial yang menonjol adalah dukungan plugin/ekstensibilitasnya, tetapi proyek ini masih dalam pengembangan awal dan masih ada ruang untuk perbaikan."
    ],
    "points": 208,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1699966855
  }
]
