[
  {
    "id": 38262315,
    "title": "Blender 4.0: Heyecan Verici Güncellemeler ve Uyumluluk Değişiklikleri",
    "originLink": "https://wiki.blender.org/wiki/Reference/Release_Notes/4.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262315",
    "commentBody": "",
    "originSummary": [
      "Blender 4.0, animasyon, donanım, modelleme ve daha fazlası gibi çeşitli alanlarda önemli güncellemeler ve iyileştirmelerle 14 Kasım 2023'te piyasaya sürüldü.",
      "Sürüm, mesh formatında değişiklikler ve grafik kartları için yeni uyumluluk gereksinimleri içeriyor.",
      "Güncelleme ayrıca geometri düğümleri, gölgelendirme, dokulandırma, döngüler ve kullanıcı arayüzü gibi alanlarda da iyileştirmeler getiriyor."
    ],
    "commentSummary": [
      "Kullanıcılar, Blender'ın sürüm notları, animasyonda iş olanakları, render ve karakter animasyonunda lineer cebir ve programlamanın kullanımı gibi farklı konulara eğildi.",
      "Blender'ın açık kaynaklı bir proje olarak başarısı ve kullanıcı arayüzü gelişimi de tartışıldı.",
      "Kullanıcılar Blender'ı Adobe yazılımı ile karşılaştırdı ve yerleşik bir kaynak paylaşımı özelliğinin potansiyelini araştırdı."
    ],
    "points": 660,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1699963890
  },
  {
    "id": 38261415,
    "title": "AB Parlamentosu Çocukları Çevrimiçi Cinsel İstismardan Korumak İçin Adım Atıyor",
    "originLink": "https://www.europarl.europa.eu/news/en/press-room/20231110IPR10118/child-sexual-abuse-online-effective-measures-no-mass-surveillance",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261415",
    "commentBody": "",
    "originSummary": [
      "Sivil Özgürlükler Komitesi, çocukları çevrimiçi çocuk cinsel istismarından korumaya yönelik yeni tedbirleri onayladı.",
      "İnternet sağlayıcılarının, hizmetlerinin kötüye kullanılması riskini değerlendirmeleri ve çocukların cinsel istismarını önlemek için gerekli adımları atmaları gerekecektir.",
      "Önleme tedbirlerinin başarısız olması halinde, yasadışı materyallerin yerini tespit etmek için mahkeme onaylı tespit kararları kullanılabilecek ve kuralları uygulamak üzere bir AB Çocuk Koruma Merkezi kurulacaktır."
    ],
    "commentSummary": [
      "AB Parlamentosu Sivil Özgürlükler Komitesi, önerilen Sohbet Kontrolü yönetmeliğindeki sohbet kontrolü gerekliliklerini ve korumalı şifrelemeyi kaldırdı, ancak sonuçlandırma için müzakereler hala devam ediyor.",
      "Çocuk cinsel istismarı materyalleri için tarama mesajlarının potansiyel kötüye kullanımına ilişkin endişeler dile getirilmiştir.",
      "Şifrelemede arka kapıların ve özel mesajların taranmasının AB Parlamentosu tarafından reddedilmesi gizlilik savunucuları için bir zafer olarak görülüyor, ancak teknoloji şirketleri muafiyetler için lobi yapabilir."
    ],
    "points": 553,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1699957055
  },
  {
    "id": 38264641,
    "title": "Google'ın GraphCast Yapay Zeka Modeli Hava Tahmininde Devrim Yaratıyor, Geleneksel Yöntemlerden Daha İyi Performans Gösteriyor",
    "originLink": "https://deepmind.google/discover/blog/graphcast-ai-model-for-faster-and-more-accurate-global-weather-forecasting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264641",
    "commentBody": "",
    "originSummary": [
      "Google, geleneksel yöntemlere kıyasla daha doğru ve daha hızlı orta menzilli hava tahminleri yapabilen GraphCast adlı bir yapay zeka modeli geliştirdi.",
      "Model, hava koşullarını 10 gün öncesine kadar tahmin ederek kasırga ve sel gibi aşırı hava olaylarına karşı daha erken uyarıda bulunulmasını sağlıyor.",
      "GraphCast, makine öğrenimi ve grafik sinir ağları kullanılarak geçmiş hava durumu verileri üzerinde eğitilir, doğruluk açısından sektörün altın standart hava durumu simülasyon sisteminden daha iyi performans gösterir ve gelecekteki hava durumu için daha iyi tahminler sağlar.",
      "Modelin kodu açık kaynaklı olup, dünya çapındaki bilim insanlarının ve tahmincilerin bundan yararlanmasına ve potansiyel olarak hayat kurtarmasına ve çeşitli endüstrilerde ve toplumlarda kritik karar alma süreçlerini desteklemesine olanak tanımaktadır."
    ],
    "commentSummary": [
      "Google DeepMind, doğruluğu artırmak için makine öğrenimini kullanarak birden fazla sayısal hava durumu modelinden gelen verileri birleştiren GraphCast adlı yeni bir yapay zeka hava durumu tahmin modeli geliştirdi.",
      "Tartışmalar, mevcut API'lerin sınırlamaları, geçmiş hava durumu verilerinin kullanılabilirliği ve aşırı olaylara ilişkin verilerin entegrasyonu etrafında dönmektedir.",
      "Hava durumu tahmininde makine öğrenimini kullanmanın potansiyel faydaları ve zorluklarının yanı sıra sektörde rekabet de söz konusudur. Bu teknolojinin, doğru hava tahminlerine dayanan çeşitli endüstriler için etkileri olabilir."
    ],
    "points": 527,
    "commentCount": 166,
    "retryCount": 0,
    "time": 1699976543
  },
  {
    "id": 38266773,
    "title": "Bazı İşlemcilerdeki Hata Arıza Durumuna Neden Olabilir, Bulut Sağlayıcıları İçin Güvenlik Riski Oluşturur",
    "originLink": "https://lock.cmpxchg8b.com/reptar.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266773",
    "commentBody": "",
    "originSummary": [
      "Google'daki birden fazla araştırma ekibi, belirli işlemcilerde, öngörülemeyen davranışlara ve sistemin durmasına neden olabilecek bir hata keşfetti.",
      "Hata, gereksiz rex öneklerinin kullanımı ve hızlı kısa tekrar hareketi (FSRM) özelliği ile ilgilidir.",
      "Intel, bulut sağlayıcıları için ciddi güvenlik etkileri olan bu güvenlik açığını gidermek için güncellenmiş bir mikro kod ve geçici bir çözüm yayınladı."
    ],
    "commentSummary": [
      "\"Reptar\", Google ve diğer araştırma ekipleri tarafından keşfedilen makine kontrolü istisnalarını ve işlemci durmalarını tetikleyen bir CPU güvenlik açığıdır.",
      "Makale, \"Reptar \"ın AMD CPU'ları üzerindeki etkisini tartışıyor ve CPU tasarımında karşılaşılan zorlukları vurguluyor.",
      "Intel işlemcileri etkileyen ve potansiyel olarak sistem çökmelerine neden olan bir başka güvenlik açığından bahsedilmektedir. Makalede ayrıca CPU tasarımında resmi yöntemlerin kullanımı ve bilgi işlem kaynaklarının paylaşımından kaynaklanan potansiyel aksaklıklar da inceleniyor. Modern CPU'ların karmaşıklığından ve yapay zekanın CPU tasarımı üzerindeki potansiyel etkisinden de bahsedilmektedir."
    ],
    "points": 468,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1699984183
  },
  {
    "id": 38262124,
    "title": "Google, rekabeti engellemek için sahte DMCA yayından kaldırma bildirimleri kullanan kişilere dava açtı",
    "originLink": "https://torrentfreak.com/google-sues-men-who-weaponized-dmca-notices-to-crush-competition-231114/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262124",
    "commentBody": "",
    "originSummary": [
      "Google, 65 Google hesabını kullanarak sahte DMCA yayından kaldırma bildirimleri göndermekle suçlanan Vietnamlı iki kişi hakkında yasal işlem başlattı.",
      "Sanıkların, meşru içeriği kaldırmak ve Google'ın işine zarar vermek için saygın kuruluşlar gibi davranarak bildirim ve yayından kaldırma sistemini kötüye kullandıkları iddia ediliyor.",
      "Google, davalıları adalete teslim etmeyi amaçlamakta ve zararlar ile yasal ücretler için tazminat talep etmektedir."
    ],
    "commentSummary": [
      "Google, rekabeti engellemek amacıyla sahte DMCA bildirimleri gönderen iki kişi hakkında yasal işlem başlattı.",
      "Bu dava DMCA sistemindeki kusurlara dikkat çekmekte ve gelecekteki suistimalleri önlemek için reformların önemini vurgulamaktadır.",
      "Google'ın açtığı davanın hedefindeki kişiler, rekabeti bastırmak için sahte DMCA bildirimleri kullanarak mevcut sistemin endişe verici bir yönünü ortaya koydular."
    ],
    "points": 371,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1699962517
  },
  {
    "id": 38267588,
    "title": "Daha Yüksek, Daha Dikey Ön Uca Sahip Araçlar Yayalar İçin Riski Artırıyor: Çalışma",
    "originLink": "https://www.iihs.org/news/detail/vehicles-with-higher-more-vertical-front-ends-pose-greater-risk-to-pedestrians",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38267588",
    "commentBody": "",
    "originSummary": [
      "IIHS tarafından yapılan araştırmaya göre, daha uzun ve daha dikey ön uçlara sahip araçların yayalar için daha yüksek risk oluşturduğu tespit edilmiştir.",
      "Kaput yüksekliği 40 inç'in üzerinde olan araçların, 30 inç veya daha az kaput yüksekliğine ve eğimli bir profile sahip olanlara kıyasla yaya çarpışmalarında ölümlere neden olma olasılığı yaklaşık %45 daha fazladır.",
      "Kaput yüksekliği 30 ila 40 inç arasında olan ve ön kısmı küt olan araçlar da yayalar için riski artırmaktadır. Çalışma, yayalara yönelik tehlikeyi azaltmak için daha alçak ön uçlu ve açılı ızgaralara sahip araçların tasarlanmasının önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Tartışma, araç güvenliği, yönetmelikler, tüketici tercihleri ve şehir planlaması gibi birçok alanı kapsamaktadır.",
      "Temel konular arasında araç tasarımının yaya güvenliği üzerindeki etkisi, kazalar için daha sıkı düzenlemeler ve cezalar çağrısı, düzenlemeler ile araç boyutu/yakıt verimliliği arasındaki ilişki, SUV ve kamyonların popülerliğinin artması ve farklı ulaşım modlarının avantaj ve dezavantajları yer almaktadır.",
      "Söyleşi, sürüş ve ulaşımın karmaşıklığını vurgulayan çok çeşitli bakış açılarını sergiliyor."
    ],
    "points": 304,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1699987370
  },
  {
    "id": 38263294,
    "title": "Grindavík'te Çok Fazla Hasar Var: Depremler ve Deformasyon Binaları ve Altyapıyı Etkiliyor",
    "originLink": "https://icelandmonitor.mbl.is/news/news/2023/11/13/a_lot_of_damage_in_grindavik/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263294",
    "commentBody": "",
    "originSummary": [
      "İzlanda'daki Grindavík kasabası depremlerden ve yeraltındaki magma sızıntısına doğru ilerleyen bir deformasyondan zarar gördü.",
      "Kasabada sıcak su borusu ve spor merkezi gibi binalara ve altyapıya zarar veren büyük bir çatlak ortaya çıkmıştır.",
      "Hiçbir bina tamamen yıkılmamış olmasına rağmen, bölge sakinlerine eşyalarını toplamaları için sınırlı bir süre verildi ve kurtarma ekipleri hazır bekletiliyor. Yetkililer durumu yakından takip ediyor."
    ],
    "commentSummary": [
      "İzlanda'daki Grindavík kasabası, volkanik bir patlama olasılığına yol açan artan sismik aktivite ve arazi deformasyonu ile karşı karşıya.",
      "Kasaba boşaltıldı ve İzlanda'nın nüfusu ve ülkenin tek uluslararası havaalanı üzerindeki etkisi konusunda endişeler dile getirildi.",
      "Önerilen güvenilir bilgi kaynakları arasında bir jeoloji profesörünün YouTube kanalı ve İzlanda Meteoroloji Ofisi web sitesi bulunmaktadır."
    ],
    "points": 302,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1699970081
  },
  {
    "id": 38264937,
    "title": ".NET 8: Performans ve Üretkenlik Geliştirmeleri İçeren En Son LTS Sürümü",
    "originLink": "https://devblogs.microsoft.com/dotnet/announcing-dotnet-8/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38264937",
    "commentBody": "",
    "originSummary": [
      "NET 8, geliştirme platformunun en son Uzun Vadeli Destek (LTS) sürümü olarak duyuruldu.",
      "Performans, kararlılık ve güvenlik iyileştirmelerinin yanı sıra platform ve araç geliştirmeleri de getiriyor.",
      "NET 8, talep üzerine ölçeklenebilen akıllı, bulut tabanlı uygulamaların ve yüksek trafikli hizmetlerin geliştirilmesini sağlar."
    ],
    "commentSummary": [
      "Tartışmalar, olumlu deneyimler, büyüme alanları ve platformlar arası uygulamaların geliştirilmesi de dahil olmak üzere .NET ekosisteminin farklı yönlerine odaklanmaktadır.",
      "Katılımcılar, platformlar arası kullanıcı arayüzü geliştirme için Xamarin ve Livecode gibi alternatif çerçeveler önermekte ve bu alandaki zorlukları tartışmaktadır.",
      "Bazı katılımcılar, basitliği ve platformlar arası yetenekleri nedeniyle Go'yu tercih ettiklerini ifade etmekte, ancak GUI geliştirme ve C++ etkileşimindeki sınırlamalara dikkat çekmektedir."
    ],
    "points": 296,
    "commentCount": 321,
    "retryCount": 0,
    "time": 1699977631
  },
  {
    "id": 38263435,
    "title": "Backblaze 2023'ün 3. Çeyreğinde Sürücü Arıza Oranlarında Düşüş Bildirdi",
    "originLink": "https://www.backblaze.com/blog/backblaze-drive-stats-for-q3-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38263435",
    "commentBody": "",
    "originSummary": [
      "Backblaze, 2023'ün 3. çeyreğinde veri merkezlerinde 263.992'den fazla sabit disk sürücüsü (HDD) ve katı hal sürücüsü (SSD) izledi.",
      "Tüm sürücüler için üç aylık arıza oranı bir önceki çeyreğe kıyasla %2,2'den %1,47'ye düşmüştür.",
      "Backblaze, eskiyen 4.585 adet 4 TB sürücüyü emekliye ayırdı ve arıza oranlarını üretici spesifikasyonları dahilinde çalışan sürücülerle karşılaştırmak için maksimum sıcaklıklarını aşan az sayıda sürücüyü yakından izleyecek. Tüm sürücüler için genel ömür boyu arıza oranı %1,4 civarında sabit kalmıştır."
    ],
    "commentSummary": [
      "Makale, sıcaklığın sabit disklerin ömrü üzerindeki etkisini tartışmakta ve sabit sıcaklıklara sahip disklerle dalgalanmalar gösteren disklerin karşılaştırılmasını önermektedir.",
      "Sabit disklerin fiziksel olarak imha edilmesi gerektiğine dikkat çekilerek veri imhasının önemi ve şifrelemenin güvenliği vurgulanmaktadır.",
      "Kullanıcılardan gelen yorumlar sürücü güvenilirliği, yedekleme yazılımı ve kullanıcı deneyimleri gibi konuları kapsıyor; olumlu deneyimlerin yanı sıra ürün yazılımı hataları ve belirli yedekleme çözümlerinin güvenilirliği ile ilgili endişeler de paylaşılıyor."
    ],
    "points": 263,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1699970839
  },
  {
    "id": 38272132,
    "title": "ABD Başarılı Uranyum Yakıt Üretimiyle Nükleer Yakıt Endüstrisine Yeniden Giriyor",
    "originLink": "https://spectrum.ieee.org/nuclear-power-plant-2666199640",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38272132",
    "commentBody": "",
    "originSummary": [
      "Centrus Energy, ilk parti uranyum yakıtını başarıyla üreterek önemli bir kilometre taşına ulaştı.",
      "Bu başarı, Amerika Birleşik Devletleri'nin nükleer yakıt endüstrisine geri dönüşünü ifade etmektedir.",
      "Bu gelişme özellikle gelişmiş reaktörler için büyük önem taşıyor ve bu başarının önemini vurguluyor."
    ],
    "commentSummary": [
      "Tartışma, ABD'nin nükleer yakıt piyasasına yeniden girmesi ve güvenlik endişeleri gibi nükleer enerjinin çeşitli yönleri etrafında dönmektedir.",
      "Ayrıca nükleer enerji ve kömür arasındaki maliyet karşılaştırmasının yanı sıra kullanılmış yakıtın yeniden işlenmesi olasılığını da içermektedir.",
      "Konuşmada nükleer enerjinin zorlukları, sınırlamaları, avantajları ve dezavantajları, elektrik şebekesine bataryalarla entegrasyonu ve Çin'in yenilenebilir enerji kaynaklarını benimsemesi de dahil olmak üzere ele alınıyor."
    ],
    "points": 260,
    "commentCount": 249,
    "retryCount": 0,
    "time": 1700010735
  },
  {
    "id": 38266340,
    "title": "Rivian yazılım güncellemesi yanıt vermeyen bilgi-eğlence sistemine neden oluyor, düzeltilmesi zor",
    "originLink": "https://electrek.co/2023/11/14/rivian-software-update-bricks-infotainment-system-fix-not-obvious/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38266340",
    "commentBody": "",
    "originSummary": [
      "Rivian tarafından yapılan bir yazılım güncellemesi, bilgi-eğlence sisteminin arızalanmasına ve yanıt vermemesine neden oldu.",
      "Sorunu çözecek bir çözüm şu anda mevcut değildir veya kolayca erişilebilir değildir.",
      "Kullanıcılar şu anda bu yazılım güncellemesi nedeniyle Rivian bilgi-eğlence sistemleriyle ilgili sorunlar yaşamaktadır."
    ],
    "commentSummary": [
      "Tartışma, otomotiv sektöründeki yazılım güncellemelerine odaklanıyor ve güncellemeleri çok sayıda cihaza dağıtmanın risklerini ve zorluklarını vurguluyor.",
      "Ele alınan konular arasında testlerin ve aşamalı dağıtımların önemi ile yazılım güncellemelerinin kritik sorunlara yol açmamasının sağlanması yer alıyor.",
      "Tartışmalar bilgi-eğlence sistemlerinin karmaşıklığı, OTA güncellemelerinin kullanımı ve sürüş sırasında yazılım güncellemenin potansiyel tehlikeleri etrafında dönüyor. Yakın zamanda yapılan bir yazılım güncelleme hatası nedeniyle Rivian'a yönelik eleştiriler de var."
    ],
    "points": 244,
    "commentCount": 340,
    "retryCount": 0,
    "time": 1699982570
  },
  {
    "id": 38261539,
    "title": "crates.io'ya Olan Güvenin Azaltılması: Pas Paketlemeye Alternatif Bir Yaklaşım",
    "originLink": "https://thomask.sdf.org/blog/2023/11/14/rust-without-crates-io.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261539",
    "commentBody": "",
    "originSummary": [
      "Yazar, Rust kodu için bir depo olarak yalnızca crates.io'ya güvenme konusundaki endişelerini dile getiriyor ve Debian gibi Linux dağıtımlarına benzer alternatif bir dağıtım yöntemi öneriyor.",
      "Yazar, Debian'ın Rust paketleme ekibini, yalnızca crates.io'ya güvenmekle ilişkili bağımlılık risklerini azaltan bir Rust kütüphaneleri koleksiyonu oluşturdukları için takdir ediyor.",
      "Bu alternatif yaklaşım, yazarın gelecekte Rust kullanma konusundaki güvenini artırmaktadır."
    ],
    "commentSummary": [
      "Makale, C ve C++ gibi dillerde üçüncü taraf kütüphaneleri kullanmanın ve bağımlılıkları yönetmenin, derleme kurulum zorlukları, bakım sorunları ve sürüm uyumluluğu sorunları gibi zorluklarını inceliyor.",
      "Rust'ın paketleme sistemi crates.io, bağımlılıklar üzerinde daha iyi kontrol ve uyumluluk sağlayarak bu zorluklara bir çözüm olarak vurgulanıyor.",
      "Tedarik zinciri saldırılarına karşı koruma gibi gelişmiş güvenlik önlemlerine duyulan ihtiyacın yanı sıra bağımlılıkları güvenli bir şekilde yönetmenin ve tarama araçları ile seçilmiş kütüphane havuzlarını kullanmanın önemi vurgulanmaktadır."
    ],
    "points": 225,
    "commentCount": 217,
    "retryCount": 0,
    "time": 1699958048
  },
  {
    "id": 38261982,
    "title": "Bir Programlama Dili Geliştirmek: Zorluklar, İpuçları ve İçgörüler",
    "originLink": "https://yorickpeterse.com/articles/a-decade-of-developing-a-programming-language/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38261982",
    "commentBody": "",
    "originSummary": [
      "Yazar, Inko programlama dilini geliştirirken yaşadıkları deneyim ve zorlukları, statik yazıma geçme kararı ve kendi kendini barındırma ve kod üretmedeki zorluklar da dahil olmak üzere tartışıyor.",
      "Performans, platform desteği, sözdizimi ve kullanıcı edinimi konularında zorluklarla birlikte sağlam bir dil ve ekosistem oluşturmak çok önemlidir.",
      "Belirli kaynaklar ve toplulukların rehberliğinde, prototip oluştururken anlambilime odaklanılması ve mevcut sözdiziminin kullanılması önerilir.",
      "Kullanıcı tabanını ve kütüphaneleri büyütmek zaman ve yatırım gerektirir, başlangıçta performans yerine işlevselliğe öncelik verilir.",
      "Yaygın olarak kullanılan ve başarılı bir dil geliştirmek en az 10-15 yıl sürer."
    ],
    "commentSummary": [
      "Bir programlama dili geliştirirken hedef kullanıcıları ve sorunları anlamak çok önemlidir.",
      "Tip denetimini uygulamak zor olabilir ve daha basit dillerle başlanması önerilir.",
      "Kademeli tipleme ve statik tipleme arasında bir tartışma vardır; bazıları kademeli tiplemenin hata yakalama ve dokümantasyon avantajlarını savunurken, diğerleri statik tiplemeyi tercih etmektedir.",
      "Statik ve dinamik yazım arasındaki seçim, bireysel tercih ve verimliliğe dayanmalıdır.",
      "Dinamik tiplemenin statik olarak tiplenmiş dillere entegre edilmesi de tartışılmaktadır.",
      "Tartışma, dil tasarımı ve tip kontrolüne yönelik çeşitli yaklaşımları, bunların ortaya çıkardığı zorlukları ve farklı tipleme sistemlerinin artılarını ve eksilerini vurgulamaktadır."
    ],
    "points": 222,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1699961500
  },
  {
    "id": 38262775,
    "title": "Lapce Editor 0.3.0 Yeni Özellikler ve Hata Düzeltmeleri ile Yayınlandı",
    "originLink": "https://github.com/lapce/lapce/releases/tag/v0.3.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38262775",
    "commentBody": "",
    "originSummary": [
      "GitHub'daki lapce Public Notifications Fork'un en son sürümü, birkaç yeni özellik ve değişiklik getiren 0.3.0 sürümüdür.",
      "Bu sürüm Floem kullanıcı arayüzü ile yeniden yazma, tamamlama lensi yeniden uygulaması ve Linux'ta Lapce kullanma seçeneğini içerir.",
      "Ayrıca, çekme, silme, arama ve değiştirme işlemleri için çok satırlı vim-motion işlevselliği uygular ve hata düzeltmeleri içerir.",
      "Yayın 114 kişiden olumlu geri bildirim almıştır."
    ],
    "commentSummary": [
      "Lapce Editor, VSCode ve Sublime Text gibi popüler editörlerle karşılaştırılan açık kaynaklı bir kod editörüdür.",
      "Hızı ve işlevselliği ile övgü topluyor ancak bazı kullanıcılar eksik özellikler konusunda endişeli.",
      "Öne çıkan potansiyel özelliklerden biri eklenti/genişletilebilirlik desteğidir, ancak proje henüz erken geliştirme aşamasındadır ve geliştirilmeye açıktır."
    ],
    "points": 208,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1699966855
  }
]
