[
  {
    "id": 41543386,
    "title": "OpenSCAD: O Modelador CAD 3D Sólido para Programadores",
    "originLink": "https://openscad.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543386",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenSCAD é um modelador CAD 3D sólido preferido por programadores devido à sua simplicidade e modelagem baseada em texto, mas possui limitações em recursos como chanfros, filetes e exportação de arquivos STEP.",
      "Alternativas como CadQuery, Build123D, Replicad, PythonSCAD, Fornjot, ImplicitCAD e BRL-CAD são recomendadas para projetos mais complexos e para aqueles que preferem uma sintaxe diferente ou recursos adicionais.",
      "Apesar de suas limitações, a comunidade do OpenSCAD e bibliotecas como NopSCADlib e BOSL2 são altamente valorizadas, fornecendo recursos significativos para os usuários."
    ],
    "points": 415,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1726351334
  },
  {
    "id": 41544969,
    "title": "Wordllama – Coisas que você pode fazer com as incorporações de tokens de um LLM",
    "originLink": "https://github.com/dleemiller/WordLlama",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544969",
    "commentBody": "",
    "originSummary": [
      "A nova biblioteca utilitária leve foi lançada para preparar entradas, localizar informações e criar avaliadores, focando no uso da CPU e sendo rápida e fácil de instalar.",
      "A biblioteca utiliza embeddings de tokens médios agrupados de grandes modelos de linguagem (LLMs) e inclui ferramentas para classificação, filtragem, agrupamento, deduplicação e similaridade, com algumas implementações em cython para eficiência.",
      "Ele suporta Linux e Mac, mas não Windows, e oferece modelos binarizados usando distância de Hamming para cálculos de similaridade mais rápidos com uso reduzido de memória."
    ],
    "commentSummary": [
      "Wordllama é uma utilidade leve para trabalhar com Modelos de Linguagem de Grande Escala (LLMs), oferecendo ferramentas para tarefas como preparação de entrada e avaliação, sem exigir runtimes de aprendizado profundo.",
      "A biblioteca inclui um pequeno modelo (4MB) usando embeddings de tokens agrupados pela média, treinado com perda de classificação de múltiplos negativos e aprendizado de representação matryoshka, e suporta várias utilidades como classificação, filtragem, agrupamento e deduplicação.",
      "Atualmente, ele suporta Linux e Mac, com planos para builds no Windows, e apresenta modelos binarizados usando distância de Hamming para cálculos eficientes de similaridade."
    ],
    "points": 297,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1726370714
  },
  {
    "id": 41544364,
    "title": "Lazarus Group lavou $200 milhões de 25 hacks de criptomoedas para fiat",
    "originLink": "https://zachxbt.mirror.xyz/B0-UJtxN41cJhpPtKv0v2LZ8u-0PwZ4ecMPEdX4l8vE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544364",
    "commentBody": "",
    "originSummary": [
      "Lazarus Group, ligado à Coreia do Norte, lavou $200 milhões provenientes de mais de 25 hacks de criptomoedas entre 2020 e 2023, utilizando mercados P2P e serviços de mixagem como Tornado Cash e ChipMixer.",
      "Principais hacks incluem CoinBerry, Unibright, CoinMetro, Nexus Mutual, EasyFi, Bondly, MGNR, PolyPlay, bZx, Steadefi e CoinShift, com fundos roubados frequentemente convertidos em moeda fiduciária ao longo do tempo.",
      "Investigações levaram à inclusão de $374K USDT na lista negra pela Tether e ao congelamento de $3,4M por emissores de stablecoins, com esforços contínuos para rastrear e congelar fundos roubados adicionais."
    ],
    "commentSummary": [
      "As Lazarus Group lavou $200 milhões de 25 hacks de criptomoedas para moeda fiduciária, destacando vulnerabilidades significativas na segurança das criptomoedas.",
      "Tanto o Departamento de Justiça dos EUA (DoJ) descobriu US$ 650 milhões lavados de vendas de fentanil nos EUA para grupos criminosos chineses, enfatizando a escala global da lavagem de dinheiro.",
      "Apesar das regulamentações rigorosas, as leis contra a lavagem de dinheiro frequentemente falham, com criminosos usando frentes legítimas e pessoas inocentes sendo pegas no fogo cruzado, especialmente em países como a Austrália, que carecem de proteções robustas."
    ],
    "points": 250,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1726362565
  },
  {
    "id": 41545335,
    "title": "Removedor de Besteiras",
    "originLink": "https://www.bullshitremover.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545335",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Removedor de Besteiras é uma ferramenta que traduz textos complexos ou cheios de jargões para um inglês simples, muitas vezes sarcástico, usando Claude, um modelo de IA da Anthropic.",
      "Ferramenta recebeu elogios por sua eficácia e humor, com usuários testando-a em declarações corporativas, prosa acadêmica e discursos políticos.",
      "Usuários sugeriram recursos adicionais, como uma extensão de navegador ou entrada de áudio para tradução em tempo real."
    ],
    "points": 244,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1726376699
  },
  {
    "id": 41545670,
    "title": "Google Oficialmente Eliminou os Links de Cache",
    "originLink": "https://gizmodo.com/google-has-officially-killed-cache-links-1851220408",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545670",
    "commentBody": "",
    "originSummary": [
      "Google removeu oficialmente os links de cache, um recurso introduzido há 25 anos para acessar versões salvas de páginas da web.",
      "A remoção foi confirmada por Danny Sullivan, do Google Search Liaison, que citou a melhoria na estabilidade da web como motivo.",
      "Embora os usuários ainda possam visualizar páginas em cache digitando \"cache:\" antes do URL, esse recurso também será descontinuado, com uma possível colaboração futura com a Wayback Machine do Internet Archive como alternativa."
    ],
    "commentSummary": [],
    "points": 207,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1726382208
  },
  {
    "id": 41543805,
    "title": "Por que o Scrum está te estressando",
    "originLink": "https://rethinkingsoftware.substack.com/p/why-scrum-is-stressing-you-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543805",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "A postagem discute o estresse causado pelo Scrum, um popular framework Ágil, e critica sua implementação em muitas organizações.",
      "Os principais pontos de discórdia incluem o foco excessivo em reuniões e cerimônias, que alguns argumentam que servem principalmente para manter os gerentes informados em vez de ajudar os desenvolvedores.",
      "As discussões destacam um equívoco comum de que Agile e Scrum são sinônimos, com muitos afirmando que os verdadeiros princípios Agile se concentram em capacitar os desenvolvedores sem a sobrecarga introduzida pelo Scrum."
    ],
    "points": 189,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1726355485
  },
  {
    "id": 41545495,
    "title": "Modo fundador que se dane. Trabalhe no 'modo dane-se'",
    "originLink": "https://old.reddit.com/r/SaaS/comments/1fgv248/fuck_founder_mode_work_in_fuck_off_mode/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545495",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "A postagem argumenta que aspirantes a empreendedores devem se concentrar em melhorar ideias existentes em vez de se obcecarem com a inovação, sugerindo que esforço e execução são mais críticos do que originalidade.",
      "Destaca que até mesmo pequenas mudanças podem ser impactantes e que copiar produtos bem-sucedidos pode ser uma estratégia viável para empreendedores que estão começando, os quais devem inovar posteriormente com base no feedback.",
      "As discussões incluem várias opiniões sobre o equilíbrio entre inovação e praticidade, com alguns enfatizando a importância do timing de mercado, da conexão com o cliente e dos possíveis perigos de se dar ênfase excessiva a novas ideias."
    ],
    "points": 175,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1726379317
  },
  {
    "id": 41548474,
    "title": "Linux 6.11 Lançado",
    "originLink": "https://lwn.net/Articles/990307/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41548474",
    "commentBody": "",
    "originSummary": [
      "Foi oficialmente lançado o kernel 6.11, anunciado por Linus Torvalds de Viena.",
      "Atualizações importantes incluem novas operações io_uring, patches de bloqueio de bottom-half aninhados, suporte a driver de bloco em Rust e operações de escrita atômica na camada de bloco.",
      "Recursos adicionais incluem um alocador de laje de balde dedicado e uma implementação vDSO de getrandom()."
    ],
    "commentSummary": [
      "Linux 6.11 foi lançado, após a problemática versão 6.10 que teve múltiplos problemas, especialmente com GPUs AMD e o modo de suspensão.",
      "Os principais novos recursos no Linux 6.11 incluem suporte para escrever drivers de bloco em Rust e operações de escrita atômica na camada de bloco.",
      "Os lançamentos continuam a ser supervisionados por Linus Torvalds, que permanece ativamente envolvido no processo de desenvolvimento."
    ],
    "points": 160,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1726418027
  },
  {
    "id": 41544059,
    "title": "Doze condenados por roubos violentos em invasões domiciliares para roubar criptomoeda",
    "originLink": "https://www.justice.gov/opa/pr/twelve-defendants-sentenced-violent-home-invasion-robberies-steal-cryptocurrency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544059",
    "commentBody": "",
    "originSummary": [
      "Twelve réus, incluindo Remy Ra St Felix e Jarod Gabriel Seemungal, foram condenados por invasões domiciliares violentas visando criptomoedas, roubando mais de $3,5 milhões.",
      "St Felix recebeu uma sentença de 47 anos de prisão, enquanto Seemungal foi condenado a 20 anos e ordenado a pagar mais de $4 milhões em restituição; outras sentenças variaram de 5 a 25 anos.",
      "A investigação do caso foi conduzida pelo FBI e processada pela Equipe Nacional de Aplicação de Criptomoedas (NCET) e pelo Escritório do Procurador dos EUA para o Distrito Médio da Carolina do Norte."
    ],
    "commentSummary": [
      "Doze indivíduos foram sentenciados por invasões violentas a residências com o objetivo de roubar criptomoedas, destacando os riscos físicos associados aos ativos digitais.",
      "A principal criminosa tinha um histórico de delitos violentos, incluindo uma acusação anterior de tentativa de homicídio, o que ressalta a gravidade e o perigo desses crimes.",
      "Os incidentes envolveram violência extrema e ameaças, como ameaçar mutilar e estuprar as vítimas, para coagi-las a entregar suas posses em criptomoedas."
    ],
    "points": 121,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1726358601
  },
  {
    "id": 41543139,
    "title": "Esquecer é um ato ético",
    "originLink": "https://emilygorcenski.com/post/to-forget-is-an-ethical-act/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543139",
    "commentBody": "",
    "originSummary": [
      "Emily F. Gorcenski curou e deletou uma parte significativa de seus 40.000 tweets ao longo da vida, inspirada pela noção ética de esquecer e controlar seu legado digital.",
      "Esse processo envolveu codificar um script para acelerar as exclusões, preservar manualmente tweets de valor histórico e lidar com o desgaste emocional e físico de revisitar interações passadas.",
      "Gorcenski mudou do Twitter para plataformas como o Bluesky, que oferece um ambiente mais promissor com APIs abertas e melhores ferramentas de moderação, além de se aposentar do ativismo para se concentrar no crescimento pessoal e na saúde."
    ],
    "commentSummary": [
      "Pessoas na faixa dos 20 e 30 anos debatem como outros conseguem se envolver em dramas online apesar das vidas ocupadas, sugerindo que isso pode ser escapismo, vício ou ativismo social.",
      "A discussão inclui equilibrar o tempo de trabalho e pessoal, o impacto das redes sociais e as implicações éticas de esquecer ações passadas online.",
      "Opiniões divergem sobre se passar tempo excessivo online é prejudicial, com comparações ao vício em TV, enquanto outros argumentam que a realização é subjetiva."
    ],
    "points": 109,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1726349361
  },
  {
    "id": 41544386,
    "title": "CSCI 181G PO: Programação de Motores de Jogos",
    "originLink": "https://cs.pomona.edu/classes/cs181g/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544386",
    "commentBody": "",
    "originSummary": [
      "CSCI 181G PO: O curso de Programação de Motores de Jogos cobre tópicos como programação em Rust, interatividade em jogos e vários motores de jogos como Unity, Godot e Bevy.",
      "Os principais entregáveis incluem um Jogo de Simulação com prazo para 4 de fevereiro e um Dia de Demonstração de Projetos de Jogos em 30 de abril, com vários tópicos e tarefas programados semanalmente.",
      "Os recursos incluem notas detalhadas sobre pipelines gráficos, configuração do Rust, programação 3D e livros opcionais sobre IA de jogos, geração procedural de conteúdo e física de jogos."
    ],
    "commentSummary": [
      "CSCI 181G PO: Programação de Motores de Jogos é um curso da Pomona College que abrange uma ampla gama de tópicos no desenvolvimento de motores de jogos, incluindo renderização, gerenciamento de ativos, física, interface do usuário, script e mais.",
      "Este curso oferece uma visão geral e uma orientação completa sobre motores de jogos, com projetos como a modificação de um programa WebGPU existente.",
      "Discussões destacam o uso de Rust e Unity, observando uma mudança do tradicional C++ no ensino de desenvolvimento de motores de jogos, e a abordagem teórica do curso se os alunos já estiverem familiarizados com Rust."
    ],
    "points": 104,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1726362872
  },
  {
    "id": 41545100,
    "title": "Potente, Open-Source, CAD Programático",
    "originLink": "https://www.implicitcad.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545100",
    "commentBody": "",
    "originSummary": [
      "ImplicitCAD é uma poderosa ferramenta CAD programática de código aberto, projetada para design 3D complexo e criação de objetos parametrizados.",
      "Ele suporta linguagens específicas de domínio (DSLs) e testes unitários, tornando-o ideal para automatizar tarefas repetitivas de design e facilitar a colaboração.",
      "Os usuários podem começar a usar o ImplicitCAD diretamente em seu navegador web sem instalações demoradas, tornando-o acessível e fácil de experimentar."
    ],
    "commentSummary": [
      "ImplicitCAD, uma ferramenta CAD programática de código aberto, recebeu atenção renovada apesar de ter sido abandonada anos atrás e nunca concluída.",
      "Os autores não acreditam mais que o ImplicitCAD era a abordagem correta, citando problemas com sua variante de f-rep (representação de função).",
      "Comentários da comunidade sugerem alternativas como Blender para design e OpenSCAD para CAD, com alguns recomendando build123d em vez de OpenSCAD e ImplicitCAD."
    ],
    "points": 93,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1726372930
  },
  {
    "id": 41545633,
    "title": "Livros Essenciais para Startups?",
    "originLink": "https://news.ycombinator.com/item?id=41545633",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545633",
    "commentBody": "",
    "originSummary": [
      "A 'The Mom Test' enfatiza a importância de validar ideias de negócios conversando com clientes em potencial antes de investir tempo e recursos.",
      "Autor compartilha uma experiência pessoal de não validar uma ideia na casa dos 20 anos, destacando o valor do feedback dos clientes.",
      "A postagem busca recomendações de outros livros ou recursos essenciais que forneçam importantes lições de negócios."
    ],
    "commentSummary": [
      "The Mom Test\" é altamente recomendado para startups validarem ideias com clientes potenciais antes de investir, focando em casos de uso e frustrações dos clientes.",
      "Outras leituras essenciais incluem \"A Startup Enxuta\" de Eric Ries, \"Quatro Passos para a Epifania\" de Steve Blank e \"Running Lean\" de Ash Maurya, todos enfatizando a compreensão do cliente e a inovação contínua.",
      "Livros como 'Trabalho Focado' de Cal Newport, 'O Lado Difícil das Situações Difíceis' de Ben Horowitz e 'De Zero a Um' de Peter Thiel oferecem insights valiosos sobre produtividade, superação de desafios e construção de negócios únicos."
    ],
    "points": 91,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1726381540
  },
  {
    "id": 41543642,
    "title": "Eu fiz um jogo de desenho e simulação de circuitos digitais",
    "originLink": "https://github.com/lets-all-be-stupid-forever/circuit-artist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543642",
    "commentBody": "",
    "originSummary": [
      "Inspirado por jogos como Turing Complete e Logic World, uma nova ferramenta permite aos usuários construir circuitos digitais usando pixel art, combinando aseprite e lógica com fios.",
      "A ferramenta possui um algoritmo de simulação dirigido por eventos com atraso unitário, script em Lua para comunicação com sistemas externos e um modo sandbox com vários quebra-cabeças.",
      "Desenvolvido em C com raylib e scripts Lua/luajit, o jogo está disponível no Steam e GitHub, com uma demonstração web no itch.io."
    ],
    "commentSummary": [
      "A new digital circuit drawing and simulation game inspired by Turing Complete, Virtual Circuit Board, and Logic World has been released.",
      "Os usuários podem construir circuitos usando um fluxo de trabalho de arte em pixel, interagir com fios durante a simulação e acessar um modo sandbox e vários níveis de desafio.",
      "Desenvolvido em C com raylib e lua/luajit, o jogo está disponível no Steam e GitHub sob GPLv3, com uma demonstração web no itch.io."
    ],
    "points": 90,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1726353831
  },
  {
    "id": 41547405,
    "title": "Camera de segurança de código aberto em Raspberry Pi",
    "originLink": "https://github.com/TzuHuanTai/RaspberryPi_WebRTC",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41547405",
    "commentBody": "",
    "originSummary": [
      "Transforme seu Raspberry Pi em uma câmera de segurança doméstica de baixa latência usando o codificador de hardware v4l2 DMA e WebRTC, suportando vários usuários para transmissão ao vivo sem um servidor de mídia.",
      "Nota: Raspberry Pi 5 e outros SBCs (Computadores de Placa Única) não suportam codificação de hardware v4l2; use o modo de codificação por software em vez disso.",
      "Instruções detalhadas de configuração incluem o download de binários, a instalação de bibliotecas essenciais, a configuração de hardware e a execução da aplicação, com opções para rodar como um serviço Linux para operação contínua."
    ],
    "commentSummary": [
      "Um projeto de câmera de segurança de código aberto usando Raspberry Pi está sendo discutido, com vários usuários compartilhando suas experiências e preferências para projetos semelhantes.",
      "Alguns usuários preferem opções comerciais para melhores acabamentos, enquanto outros visam controle total local usando tecnologias como Tor e WebRTC para conexões seguras e privadas.",
      "Discussões também abrangem aspectos técnicos como suporte de codificação de hardware no Raspberry Pi 5, otimização de desempenho para tarefas de IA e o uso de C++ para detecção de pessoas em tempo real."
    ],
    "points": 89,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1726407157
  }
]
