[
  {
    "id": 41543386,
    "title": "OpenSCAD: Ohjelmoijan kiinteä 3D CAD -mallinnin",
    "originLink": "https://openscad.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543386",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "OpenSCAD on kiinteä 3D CAD-mallinnusohjelma, jota ohjelmoijat suosivat sen yksinkertaisuuden ja tekstipohjaisen mallinnuksen vuoksi, mutta siinä on rajoituksia ominaisuuksissa, kuten viisteissä, pyöristyksissä ja STEP-tiedostojen viennissä.",
      "Vaihtoehtoja, kuten CadQuery, Build123D, Replicad, PythonSCAD, Fornjot, ImplicitCAD ja BRL-CAD, suositellaan monimutkaisempiin projekteihin ja niille, jotka suosivat erilaista syntaksia tai lisäominaisuuksia.",
      "Huolimatta rajoituksistaan, OpenSCADin yhteisö ja kirjastot kuten NopSCADlib ja BOSL2 ovat erittäin arvostettuja, tarjoten merkittäviä resursseja käyttäjille."
    ],
    "points": 415,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1726351334
  },
  {
    "id": 41544969,
    "title": "Sana-llama – Asioita, joita voit tehdä LLM:n token-upotuksilla",
    "originLink": "https://github.com/dleemiller/WordLlama",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544969",
    "commentBody": "",
    "originSummary": [
      "Uusi kevyt apukirjasto on julkaistu syötteiden valmisteluun, tiedon paikantamiseen ja arvioijien luomiseen, keskittyen CPU:n käyttöön ja ollen nopea ja helppo asentaa.",
      "Kirjasto käyttää suurten kielimallien (LLM) keskimääräisiä yhdistettyjä token-upotuksia ja sisältää työkaluja järjestämiseen, suodattamiseen, klusterointiin, deduplikointiin ja samankaltaisuuteen, joista osa on toteutettu cythonilla tehokkuuden parantamiseksi.",
      "Se tukee Linuxia ja Macia, mutta ei Windowsia, ja tarjoaa binarisoituja malleja, jotka käyttävät hamming-etäisyyttä nopeampiin samankaltaisuuslaskelmiin pienemmällä muistin käytöllä."
    ],
    "commentSummary": [
      "Wordllama on kevyt apuväline suurten kielimallien (LLM) kanssa työskentelyyn, tarjoten työkaluja tehtäviin kuten syötteen valmistelu ja arviointi, ilman syväoppimisen ajonaikaisia ympäristöjä.",
      "Kirjasto sisältää pienen mallin (4MB), joka käyttää keskimäärin yhdistettyjä token-upotuksia, koulutettuna useilla negatiivisilla ranking-tappioilla ja matryoshka-representaatio-oppimisella, ja tukee erilaisia apuohjelmia, kuten ranking, suodatus, klusterointi ja deduplikointi.",
      "Tällä hetkellä se tukee Linuxia ja Macia, ja suunnitelmissa on Windows-versiot. Se sisältää binarisoituja malleja, jotka käyttävät hamming-etäisyyttä tehokkaisiin samankaltaisuuslaskelmiin."
    ],
    "points": 297,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1726370714
  },
  {
    "id": 41544364,
    "title": "Lazarus-ryhmä pesi 200 miljoonaa dollaria 25 kryptovarkaudesta fiat-valuutaksi",
    "originLink": "https://zachxbt.mirror.xyz/B0-UJtxN41cJhpPtKv0v2LZ8u-0PwZ4ecMPEdX4l8vE",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544364",
    "commentBody": "",
    "originSummary": [
      "Lazarus-ryhmä, joka on yhdistetty Pohjois-Koreaan, pesi 200 miljoonaa dollaria yli 25 kryptovaluuttahakkeroinnista vuosien 2020 ja 2023 välillä, käyttäen P2P-markkinapaikkoja ja sekoituspalveluja kuten Tornado Cash ja ChipMixer.",
      "Keskeisiä hakkereita ovat CoinBerry, Unibright, CoinMetro, Nexus Mutual, EasyFi, Bondly, MGNR, PolyPlay, bZx, Steadefi ja CoinShift, ja varastetut varat muunnetaan usein ajan myötä fiat-valuutaksi.",
      "Tutkimukset johtivat siihen, että Tether mustallelistasi 374 000 USDT:tä ja stablecoin-tekijät jäädyttivät 3,4 miljoonaa dollaria, ja varastettujen varojen jäljittämistä ja jäädyttämistä jatketaan."
    ],
    "commentSummary": [
      "Lazarus-ryhmä pesi 200 miljoonaa dollaria 25 kryptovaluuttahakkeroinnista fiat-valuutaksi, mikä korostaa merkittäviä haavoittuvuuksia kryptoturvallisuudessa.",
      "Yhdysvaltain oikeusministeriö (DoJ) löysi 650 miljoonaa dollaria, jotka oli pesty Yhdysvaltojen fentanyylimyynnistä kiinalaisille rikollisryhmille, korostaen rahanpesun maailmanlaajuista mittakaavaa.",
      "Huolimatta tiukoista säännöksistä, rahanpesulait epäonnistuvat usein, kun rikolliset käyttävät laillisia peiteyrityksiä ja viattomat ihmiset joutuvat tulilinjalle, erityisesti maissa kuten Australia, joissa ei ole vahvoja suojatoimia."
    ],
    "points": 250,
    "commentCount": 171,
    "retryCount": 0,
    "time": 1726362565
  },
  {
    "id": 41545335,
    "title": "Potaskapoistin",
    "originLink": "https://www.bullshitremover.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545335",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Bullshit Remover on työkalu, joka kääntää monimutkaisen tai ammattikieltä sisältävän tekstin selkeäksi, usein sarkastiseksi englanniksi käyttämällä Clauden, Anthropicin kehittämän tekoälymallin, apua.",
      "Työkalu on saanut kiitosta tehokkuudestaan ja huumoristaan, kun käyttäjät ovat testanneet sitä yrityslausunnoilla, akateemisella proosalla ja poliittisilla puheilla.",
      "Jotkut käyttäjät ovat ehdottaneet lisäominaisuuksia, kuten selainlaajennusta tai äänisyötettä reaaliaikaista käännöstä varten."
    ],
    "points": 244,
    "commentCount": 130,
    "retryCount": 0,
    "time": 1726376699
  },
  {
    "id": 41545670,
    "title": "Google on virallisesti poistanut välimuistilinkit",
    "originLink": "https://gizmodo.com/google-has-officially-killed-cache-links-1851220408",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545670",
    "commentBody": "",
    "originSummary": [
      "Google on virallisesti poistanut välimuistilinkit, ominaisuuden, joka otettiin käyttöön 25 vuotta sitten verkkosivujen tallennettujen versioiden käyttämiseksi.",
      "Poistamisen vahvisti Googlen Search Liaison Danny Sullivan, joka mainitsi parantuneen verkkovakauden syyksi.",
      "Vaikka käyttäjät voivat edelleen tarkastella välimuistissa olevia sivuja kirjoittamalla \"cache:\" ennen URL-osoitetta, tämä ominaisuus poistetaan käytöstä, ja mahdollisena vaihtoehtona harkitaan tulevaisuudessa yhteistyötä Internet Archiven Wayback Machinen kanssa."
    ],
    "commentSummary": [],
    "points": 207,
    "commentCount": 98,
    "retryCount": 0,
    "time": 1726382208
  },
  {
    "id": 41543805,
    "title": "Miksi Scrum aiheuttaa sinulle stressiä",
    "originLink": "https://rethinkingsoftware.substack.com/p/why-scrum-is-stressing-you-out",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543805",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kirjoitus käsittelee Scrum-menetelmän, suositun ketterän viitekehyksen, aiheuttamaa stressiä ja arvostelee sen toteutusta monissa organisaatioissa.",
      "Keskeisiä kiistakysymyksiä ovat liiallinen keskittyminen kokouksiin ja seremonioihin, joiden väitetään ensisijaisesti palvelevan johtajien tiedonsaantia sen sijaan, että ne auttaisivat kehittäjiä.",
      "Keskustelu tuo esiin yleisen väärinkäsityksen, että Agile ja Scrum ovat synonyymejä, ja monet väittävät, että todelliset Agile-periaatteet keskittyvät kehittäjien voimaannuttamiseen ilman Scrumin tuomaa ylimääräistä hallintoa."
    ],
    "points": 189,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1726355485
  },
  {
    "id": 41545495,
    "title": "Haistakaa paska -moodi. Työskentele \"Haistakaa vittu -moodissa\"",
    "originLink": "https://old.reddit.com/r/SaaS/comments/1fgv248/fuck_founder_mode_work_in_fuck_off_mode/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545495",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Kirjoituksessa väitetään, että aloittelevien yrittäjien tulisi keskittyä parantamaan olemassa olevia ideoita sen sijaan, että he pakkomielteisesti tavoittelisivat innovaatioita, ja ehdotetaan, että ponnistelu ja toteutus ovat tärkeämpiä kuin omaperäisyys.",
      "Se korostaa, että jopa pienillä muutoksilla voi olla suuri vaikutus ja että menestyvien tuotteiden kopioiminen voi olla varteenotettava strategia omarahoitteisille yrittäjille, joiden tulisi innovoida myöhemmin palautteen perusteella.",
      "Keskustelussa käsitellään erilaisia mielipiteitä innovaation ja käytännöllisyyden tasapainosta, ja jotkut korostavat markkinoille tulon ajoituksen, asiakasyhteyden ja uusien ideoiden liiallisen korostamisen mahdollisten sudenkuoppien merkitystä."
    ],
    "points": 175,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1726379317
  },
  {
    "id": 41548474,
    "title": "Linux 6.11 julkaistu",
    "originLink": "https://lwn.net/Articles/990307/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41548474",
    "commentBody": "",
    "originSummary": [
      "6.11-ydin on virallisesti julkaistu, Linus Torvalds ilmoitti Wienistä.",
      "Keskeisiä päivityksiä ovat uudet io_uring-operaatiot, sisäkkäiset bottom-half-lukituspaikkaukset, Rust-lohkoajurin tuki ja atomiset kirjoitusoperaatiot lohkokerroksessa.",
      "Lisäominaisuuksia ovat omistettu bucket slab -muistiallokointijärjestelmä ja vDSO-toteutus getrandom()-funktiolle."
    ],
    "commentSummary": [
      "Linux 6.11 on julkaistu, seuraten ongelmallista 6.10-versiota, jossa oli useita ongelmia, erityisesti AMD GPU:iden ja lepotilan kanssa.",
      "Linux 6.11:n keskeisiä uusia ominaisuuksia ovat tuki lohkoajureiden kirjoittamiselle Rust-kielellä ja atomiset kirjoitusoperaatiot lohkokerroksessa.",
      "Julkaisua valvoo edelleen Linus Torvalds, joka on yhä aktiivisesti mukana kehitysprosessissa."
    ],
    "points": 160,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1726418027
  },
  {
    "id": 41544059,
    "title": "Kaksitoista tuomittu väkivaltaisista kotimurroista kryptovaluutan varastamiseksi",
    "originLink": "https://www.justice.gov/opa/pr/twelve-defendants-sentenced-violent-home-invasion-robberies-steal-cryptocurrency",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544059",
    "commentBody": "",
    "originSummary": [
      "Kaksitoista syytettyä, mukaan lukien Remy Ra St Felix ja Jarod Gabriel Seemungal, tuomittiin väkivaltaisista kotimurroista, jotka kohdistuivat kryptovaluuttaan, varastaen yli 3,5 miljoonaa dollaria.",
      "St Felix sai 47 vuoden vankeustuomion, kun taas Seemungal tuomittiin 20 vuodeksi ja määrättiin maksamaan yli 4 miljoonaa dollaria korvauksia; muut tuomiot vaihtelivat 5:stä 25 vuoteen.",
      "Tapausta tutki FBI ja syytti Kansallinen kryptovaluuttojen valvontaryhmä (NCET) sekä Yhdysvaltain syyttäjänvirasto Pohjois-Keski-Carolinan alueella."
    ],
    "commentSummary": [
      "Kaksitoista henkilöä on tuomittu väkivaltaisista kotimurroista, joiden tavoitteena oli varastaa kryptovaluuttaa, mikä korostaa digitaalisiin omaisuuseriin liittyviä fyysisiä riskejä.",
      "Johtavalla rikollisella oli väkivaltaisten rikosten historia, mukaan lukien aiempi syyte murhan yrityksestä, mikä korostaa näiden rikosten vakavuutta ja vaarallisuutta.",
      "Tapauksiin liittyi äärimmäistä väkivaltaa ja uhkauksia, kuten uhrien silpomisen ja raiskaamisen uhkailua, jotta heidät saataisiin luopumaan kryptovaluuttavarannoistaan."
    ],
    "points": 121,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1726358601
  },
  {
    "id": 41543139,
    "title": "Unohtaminen on eettinen teko",
    "originLink": "https://emilygorcenski.com/post/to-forget-is-an-ethical-act/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543139",
    "commentBody": "",
    "originSummary": [
      "Emily F. Gorcenski on kuratoinut ja poistanut merkittävän osan 40 000 elinaikaisesta twiitistään, inspiroituneena eettisestä ajatuksesta unohtamisesta ja digitaalisen perintönsä hallinnasta.",
      "Prosessi sisälsi skriptin koodaamisen poistojen nopeuttamiseksi, historiallisesti arvokkaiden twiittien manuaalisen säilyttämisen sekä menneiden vuorovaikutusten uudelleen läpikäymisen aiheuttaman henkisen ja fyysisen rasituksen käsittelemisen.",
      "Gorcenski on siirtynyt Twitteristä alustoille kuten Bluesky, joka tarjoaa lupaavamman ympäristön avoimilla API-rajapinnoilla ja paremmilla moderointityökaluilla, samalla kun hän on vetäytynyt aktivismista keskittyäkseen henkilökohtaiseen kasvuun ja terveyteen."
    ],
    "commentSummary": [
      "Ihmiset myöhäisissä 20- ja 30-ikävuosissaan pohtivat, kuinka toiset onnistuvat osallistumaan verkkodraamaan kiireisestä elämästä huolimatta, ja ehdottavat, että se saattaa olla eskapismia, riippuvuutta tai sosiaalista aktivismia.",
      "Keskustelu sisältää työn ja henkilökohtaisen ajan tasapainottamisen, sosiaalisen median vaikutuksen ja menneiden verkko-toimintojen unohtamisen eettiset seuraukset.",
      "Mielipiteet vaihtelevat siitä, onko liiallinen ajanvietto verkossa haitallista, verraten sitä TV-riippuvuuteen, kun taas toiset väittävät, että täyttymyksen kokemus on subjektiivinen."
    ],
    "points": 109,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1726349361
  },
  {
    "id": 41544386,
    "title": "CSCI 181G PO: Pelimoottoriohjelmointi",
    "originLink": "https://cs.pomona.edu/classes/cs181g/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41544386",
    "commentBody": "",
    "originSummary": [
      "CSCI 181G PO: Pelimoottoriohjelmoinnin kurssi kattaa aiheita kuten Rust-ohjelmointi, pelien vuorovaikutteisuus ja erilaiset pelimoottorit, kuten Unity, Godot ja Bevy.",
      "Keskeisiin toimituksiin kuuluvat simulaatiopeli, joka on määrä palauttaa 4. helmikuuta, ja peliprojektien esittelypäivä 30. huhtikuuta, ja viikoittain on aikataulutettu useita aiheita ja tehtäviä.",
      "Resursseihin kuuluu pitkämuotoisia muistiinpanoja grafiikkaputkista, Rust-asennuksesta, 3D-ohjelmoinnista sekä valinnaisia kirjoja pelien tekoälystä, proseduraalisesta sisällön generoinnista ja pelifysiikasta."
    ],
    "commentSummary": [
      "CSCI 181G PO: Pelimoottoriohjelmointi on Pomona Collegen kurssi, joka kattaa laajan valikoiman pelimoottorin kehityksen aiheita, mukaan lukien renderöinti, resurssien hallinta, fysiikka, käyttöliittymä, skriptaus ja paljon muuta.",
      "Kurssi tarjoaa yleiskatsauksen ja kattavan perehdytyksen pelimoottoreihin, sisältäen projekteja, kuten olemassa olevan WebGPU-ohjelman muokkaaminen.",
      "Keskusteluissa korostetaan Rustin ja Unityn käyttöä, huomioiden siirtymisen perinteisestä C++:sta pelimoottorin kehittämisen opetuksessa, ja kurssin teoreettista lähestymistapaa, jos opiskelijat ovat jo perehtyneet Rustiin."
    ],
    "points": 104,
    "commentCount": 16,
    "retryCount": 0,
    "time": 1726362872
  },
  {
    "id": 41545100,
    "title": "Tehokas, avoimen lähdekoodin, ohjelmallinen CAD",
    "originLink": "https://www.implicitcad.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545100",
    "commentBody": "",
    "originSummary": [
      "ImplicitCAD on tehokas, avoimen lähdekoodin ohjelmallinen CAD-työkalu, joka on suunniteltu monimutkaiseen 3D-suunnitteluun ja parametrisoitujen objektien luomiseen.",
      "Se tukee alakohtaisia kieliä (DSL) ja yksikkötestausta, mikä tekee siitä ihanteellisen toistuvien suunnittelutehtävien automatisointiin ja yhteistyön helpottamiseen.",
      "Käyttäjät voivat aloittaa ImplicitCAD:n käytön suoraan verkkoselaimessaan ilman pitkiä asennuksia, mikä tekee siitä helposti saatavilla olevan ja kokeiltavan."
    ],
    "commentSummary": [
      "ImplicitCAD, avoimen lähdekoodin ohjelmallinen CAD-työkalu, sai uutta huomiota, vaikka se hylättiin vuosia sitten eikä sitä koskaan saatu valmiiksi.",
      "Kirjoittaja ei enää usko, että ImplicitCAD oli oikea lähestymistapa, viitaten sen f-rep (funktioesitys) -variantin ongelmiin.",
      "Yhteisön kommentit ehdottavat vaihtoehtoja, kuten Blender suunnitteluun ja OpenSCAD CAD-ohjelmistoksi, ja jotkut suosittelevat build123d:tä sekä OpenSCAD:n että ImplicitCAD:n sijaan."
    ],
    "points": 93,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1726372930
  },
  {
    "id": 41545633,
    "title": "Pakolliset kirjat startup-yrityksille?",
    "originLink": "https://news.ycombinator.com/item?id=41545633",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41545633",
    "commentBody": "",
    "originSummary": [
      "Kirja \"The Mom Test\" korostaa liiketoimintaideoiden validoinnin tärkeyttä keskustelemalla potentiaalisten asiakkaiden kanssa ennen ajan ja resurssien investoimista.",
      "Kirjoittaja jakaa henkilökohtaisen kokemuksen siitä, ettei hän 20-vuotiaana validoinut ideaa, korostaen asiakaspalautteen arvoa.",
      "Kirjoitus pyytää suosituksia muista tärkeistä kirjoista tai resursseista, jotka tarjoavat tärkeitä liiketoimintaoppeja."
    ],
    "commentSummary": [
      "Kirja \"The Mom Test\" on erittäin suositeltava startup-yrityksille ideoiden validointiin potentiaalisten asiakkaiden kanssa ennen investointia, keskittyen asiakkaiden käyttötapauksiin ja turhautumisiin.",
      "Muita tärkeitä luettavia ovat Eric Riesin \"The Lean Startup\", Steve Blankin \"Four Steps to the Epiphany\" ja Ash Mauryan \"Running Lean\", jotka kaikki korostavat asiakasymmärrystä ja jatkuvaa innovointia.",
      "Kirjat kuten Cal Newportin \"Deep Work\", Ben Horowitzin \"The Hard Thing About Hard Things\" ja Peter Thielin \"Zero to One\" tarjoavat arvokkaita näkemyksiä tuottavuudesta, haasteiden voittamisesta ja ainutlaatuisten yritysten rakentamisesta."
    ],
    "points": 91,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1726381540
  },
  {
    "id": 41543642,
    "title": "Tein digitaalisen piirikaavion piirtämis- ja simulaatiopelin",
    "originLink": "https://github.com/lets-all-be-stupid-forever/circuit-artist",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41543642",
    "commentBody": "",
    "originSummary": [
      "Inspiroituneena peleistä kuten Turing Complete ja Logic World, uusi työkalu mahdollistaa käyttäjien rakentaa digitaalisia piirejä pikselitaiteen avulla, yhdistäen aseprite- ja johdotetun logiikan.",
      "Työkalu sisältää yksikköviiveeseen perustuvan tapahtumapohjaisen simulointialgoritmin, Lua-skriptauksen ulkoisten järjestelmien viestintään sekä hiekkalaatikkotilan, jossa on erilaisia pulmia.",
      "Kehitetty C-kielellä käyttäen raylibia ja Lua/luajit-skriptausta, peli on saatavilla Steamissa ja GitHubissa, ja siitä on verkkodemo itch.io:ssa."
    ],
    "commentSummary": [
      "Uusi digitaalisten piirien piirtämis- ja simulaatiopeli, joka on saanut inspiraationsa Turing Complete-, Virtual Circuit Board- ja Logic World -peleistä, on julkaistu.",
      "Kayttäjät voivat rakentaa piirejä pikselitaidetyönkulun avulla, olla vuorovaikutuksessa johtojen kanssa simuloinnin aikana sekä käyttää hiekkalaatikkotilaa ja erilaisia haasteita sisältäviä tasoja.",
      "Kehitetty C:llä käyttäen raylibia ja lua/luajitia, peli on saatavilla Steamissa ja GitHubissa GPLv3-lisenssillä, ja siitä on verkkodemo itch.io:ssa."
    ],
    "points": 90,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1726353831
  },
  {
    "id": 41547405,
    "title": "Avoimen lähdekoodin valvontakamera Raspberry Pi:llä",
    "originLink": "https://github.com/TzuHuanTai/RaspberryPi_WebRTC",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41547405",
    "commentBody": "",
    "originSummary": [
      "Muunna Raspberry Pi -laitteesi vähäviiveiseksi kotivalvontakameraksi käyttämällä v4l2 DMA -laitteistokooderia ja WebRTC:tä, tukien useita käyttäjiä suoratoistoon ilman mediaserveriä.",
      "Huomautus: Raspberry Pi 5 ja muut yksittäiskorttitietokoneet (SBC) eivät tue v4l2-laitteistokoodausta; käytä sen sijaan ohjelmistokoodaustilaa.",
      "Yksityiskohtaiset asennusohjeet sisältävät binääritiedostojen lataamisen, olennaisten kirjastojen asentamisen, laitteiston konfiguroinnin ja sovelluksen suorittamisen, sekä vaihtoehdon suorittaa se Linux-palveluna jatkuvaa toimintaa varten."
    ],
    "commentSummary": [
      "Avoimen lähdekoodin turvakameraprojektia, joka käyttää Raspberry Pi:tä, käsitellään, ja useat käyttäjät jakavat kokemuksiaan ja mieltymyksiään vastaavista projekteista.",
      "Jotkut käyttäjät suosivat kaupallisia vaihtoehtoja paremman viimeistelyn vuoksi, kun taas toiset pyrkivät täyteen paikalliseen hallintaan käyttämällä teknologioita, kuten Tor ja WebRTC, turvallisiin ja yksityisiin yhteyksiin.",
      "Keskustelut kattavat myös teknisiä näkökohtia, kuten laitteistokoodauksen tuen Raspberry Pi 5:ssä, suorituskyvyn optimoinnin tekoälytehtäviin ja C++-kielen käytön reaaliaikaiseen henkilöiden tunnistamiseen."
    ],
    "points": 89,
    "commentCount": 14,
    "retryCount": 0,
    "time": 1726407157
  }
]
