[
  {
    "title": "京东、拼多多、苏宁易购等电商品牌为何放弃自主举办双11晚会？",
    "originLink": "https://www.nbd.com.cn/articles/2023-11-14/3112702.html",
    "originBody": "每经网首页丨 宏观丨 金融丨 公司丨 视频丨 券商丨 IPO丨 基金丨 汽车丨 房产丨 新文化丨 未来商业丨 文创通丨 城市丨 每经商学院 要闻 每经网首页 > 要闻 > 正文 京东、拼多多、苏宁易购……为什么都不再独立举办双11晚会？ 每日经济新闻 2023-11-14 17:56:41 ◎2023《天猫双11惊喜夜》再度回归，而传统电商平台京东、拼多多、苏宁易购等纷纷选择放弃独立举办双11晚会，反而抖音声势庞大的推出了《熠熠生辉闪耀之夜》，快手则拉上了东方卫视、京东打造了《超省钱大会》。 ◎“办晚会无非是激发用户的购物欲，但电商的用户天花板已经基本触顶，不是电商用户的人基本上很难成为电商用户了，大家再抢新用户意义不大。”艾媒咨询CEO兼首席分析师张毅在接受每日经济新闻记者采访时表示，他进一步指出，随着电商市场的日益成熟，各大平台需要寻找新的增长点。 每经记者 毕媛媛 每经编辑 杨夏 经过一年多的期待，2023《天猫双11惊喜夜》(以下简称“天猫双11晚会”)再度回归。 然而，与往年不同的是，2023年天猫再度携手首届老朋友湖南卫视，浙江卫视和优酷的缺席，使得此次双11晚会的阵容发生了新的变化。 本届双11晚会名为“天猫双11惊喜夜”。 图片来源：天猫官方微博 变化不仅如此。传统电商平台京东、拼多多、苏宁易购等纷纷选择放弃独立举办双11晚会，反而抖音声势庞大的推出了《熠熠生辉闪耀之夜》，快手则拉上了东方卫视、京东打造了《超省钱大会》。京东直播间还不断用低价对标李佳琦，但据大众网统计，双11预售首日，李佳琦直播间的直播GMV(成交金额)达95亿元，相比2022年的215亿元，下降了一半多。 与之前“买买买”的剁手氛围相比，大家的消费变得更加理性和谨慎。许多消费者表示自己尽可能减少消费，95后在双11甚至将目光瞄向了老人鞋。 “办晚会无非是激发用户的购物欲，但电商的用户天花板已经基本触顶，不是电商用户的人基本上很难成为电商用户了，大家再抢新用户意义不大。”艾媒咨询CEO兼首席分析师张毅在接受每日经济新闻记者采访时表示，他进一步指出，随着电商市场的日益成熟，各大平台需要寻找新的增长点。 芒果TV与优酷竞争加剧 在今年的双11购物狂欢节中，天猫再次携手湖南卫视和芒果TV。这场晚会的嘉宾阵容堪称豪华，包括了许多芒果台的主力干将，如何炅、汪涵、谢娜等知名主持人，以及《哥哥》《姐姐》等热门选秀节目中的热门选手。 天猫双11晚会节目单(部分)。 图片来源：天猫双11惊喜夜官方微博 回顾历史，我们可以发现天猫双11晚会的演变过程。2015年，第一届双11晚会由湖南卫视独立制作播出；从第二届开始，该晚会改由浙江卫视制作。然而自2018年起，除了在浙江卫视的直播外，双11晚会的节目内容规划和制作也交由优酷负责，优酷成为唯一的长视频平台参与直播。可惜的是，受各种因素的影响，天猫在2022年宣布取消了双11晚会。 时隔三年，湖南卫视和芒果TV取代了浙江卫视和优酷，再次与天猫携手打造了双11晚会。 “芒果TV这几年的整体经营数据、影响力和吸引力都表现出色。它与优酷在会员规模和活跃情况上不相上下。”张毅对每日经济新闻记者分析道。亲兄弟明算账，阿里系决定大胆重启并启用芒果TV，这一决策不仅对优酷形成了“鞭策”，而且也是公司寻求效益最大化的重要举措。 今年3月，阿里集团进行了“1+6+N”架构变革。在此变革中，阿里大文娱集团(优酷是该集团的一部分)，实行了CEO负责制，并且需要自负盈亏。在此背景下，今年淘宝的88VIP服务首次将芒果TV会员纳入了其体系。在此之前，88VIP体系只包含优酷这一长视频平台。随着芒果TV的加入，88VIP会员现在可以在优酷和芒果TV之间自由选择。 88VIP首次开通芒果TV会员和优酷VIP会员二选一。 图片来源：淘宝截图 “芒果TV和优酷的地位还是不一样的。”张毅对每日经济新闻记者分析说，“优酷是全资子公司，而芒果TV只是参与合作。但对于淘(宝)天(猫)来说，它更看重的是创新和效益的最大化。” 短视频平台崛起，传统的双11晚会趋近消失 还有多少消费者，会根据双11晚会买买买？ 天猫双11晚会这些年被称为“电商春晚”，第一年的总导演请来了冯小刚。据当年参加晚会的上海家化(600315.SH，股价23.34元，市值157.83亿元)发布的数据显示，借力双11狂欢夜和代言人的演出，公司旗下10家天猫官方旗舰店页面访问流量在短短4小时内极速增长，最高峰值时总访客量超过800万。 随着京东、苏宁、拼多多等平台加入，晚会的卡司之争愈发激烈，泰勒斯威夫特、贝克汉姆、科比、维密超模、周杰伦、章子怡等大咖纷纷亮相过双11的晚会。双11晚会在电商界和娱乐界都占据了举足轻重的地位。晚会从最初的几个小时的狂欢夜，到如今长达数小时的盛大晚会，它不仅为消费者带来了购物的乐趣，成为了全球电商大事件的见证。 张毅认为，过去几年电商平台纷纷举办双11晚会，是为了争夺流量和吸引新用户。然而，随着电商用户数量的逐渐接近天花板，竞争已经变得异常激烈。 每日经济新闻记者发现，传统电商平台如京东、拼多多、苏宁等今年不再举办双11晚会，而新兴电商平台抖音则举办了《2023熠熠生辉闪耀之夜》，快手也联手东方卫视、京东打造了《超省钱大会》。 即便众星云集，双11晚会的星光也黯淡了些许。酷云数娱数据显示，11月10日，《综艺喜乐汇》以0.6405%的收视率占据第一，《天猫双11惊喜夜》以0.5063%的收视率排在第二，《2023熠熠生辉闪耀之夜》的收视率为0.1294%，排在当日综艺收视榜第七名。 图片来源：酷云数娱数据截图 张毅认为，传统电商平台不再举办双11晚会的原因可能在于，电商用户的数量已经基本达到上限，再花费大量精力和资源去吸引新用户的意义不大。“办晚会无非是激发用户的购物欲，现在完全可以通过信息推送、优惠广告来达到，办晚会的投入产出比不高了。” 短视频平台的崛起也对传统电商平台构成了挑战。用户越来越习惯于通过短视频平台获取信息、娱乐和购物等需求。因此，抖音等短视频平台不断加码电商业务，与传统电商平台展开竞争。“所以传统电商没有必要花费大量的精力去筹备一台晚会了，不如花更大的精力做补贴和营销推广等，让优惠来得更直接。”张毅表示。 封面图片来源：天猫官方微博 本文经「原本」原创认证，作者每日经济新闻 访问yuanben.io查询 【51T18Q8Z】获取授权信息转载授权 如需转载请与《每日经济新闻》报社联系。 未经《每日经济新闻》报社授权，严禁转载或镜像，违者必究。 版权合作及网站合作电话：021-60900099转688 读者热线：4008890008 特别提醒：如果我们使用了您的图片，请作者与本站联系索取稿酬。如您不希望作品出现在本站，可联系我们要求撤下您的作品。 双11 电商 芒果TV 优酷 上一篇文章 德国反垄断机构将调查可口可乐欧洲太平洋合作伙伴公司 返回每经网首页 下一篇文章 西子洁能：接受华福证券等机构调研 相关文章 苏宁易采云启动“青云计划”，未来三年拟培育超30家销售破亿供应商 社区团购3年巨幅失速 京东为何放不下？ 粤海饲料：目前暂未有供销社合作订单 一周未来商业｜腾讯首次公布视频号广告收入，超三成民营物流企业经营下滑，网红炸鸡Popeyes重出江湖 热文精选 “互联网赋能企业可持续发展”主题咖荟在乌镇举行 被《自然》撤稿的迪亚斯发声：室温超导论文将另投其他杂志 搭建新技术新产品首发、首秀、首展平台 成都市信息领域新产品发布会将在科创生态岛举行 成都位列2023中国夜经济第一梯队 “美食+电商”点燃“锦官不夜城” 当新电商遇见“成都食力”，如何赋能消费全业态“破圈”融合？ 点击排行 1 男子吐槽领导遭索赔 2 雀巢“喊冤”被网易举报 3 交个朋友前副总裁离世 4 被举报七宗罪后，交个朋友前副总裁被确认已离世 5 网易举报雀巢制冰机 6 问界回应东莞试驾事故 7 哈马斯：准备释放70人换5天停火！以色列：授权防长可将外国人定为“恐怖分子”！联合国及多国设施遭以军袭击… 8 720亿！94岁的她首次成为中国女首富！ 9 多家银行下调存款利率 10 方红承自述被构陷入狱 欢迎关注每日经济新闻APP 0 0 相关信息 关于我们 版权声明 联系我们 广告投放 友情链接 关注我们 订阅中心 加入我们 招聘专页 Copyright © 2023 每日经济新闻报社版权所有，未经许可不得转载使用，违者必究。 广告热线 北京: 010-57613265， 上海: 021-61283008， 广州: 020-84201861， 深圳: 0755-83520159， 成都: 028-86511519 028-86512112 互联网新闻信息服务许可证：51120190017 网站备案号：蜀ICP备19004508号-3 川公网安备 51019002002026号 违法和不良信息举报电话： 400 889 0008",
    "originSummary": [
      "2023年，包括京东、拼多多和苏宁易购在内的传统电商品牌选择不在自己的\"双11\"活动中举办晚会，因为他们的用户基数已经达到了顶峰，他们正在寻找新的增长机会。",
      "天猫的双11活动选择与湖南卫视和芒果TV合作，而短视频平台如抖音和快手则举办了自己的活动，这突显了这些平台在电子商务行业中的影响力日益增强。"
    ],
    "commentBody": "",
    "commentSummary": [
      "由于冠状病毒大流行期间购物习惯的改变，网络杂货配送服务FreshDirect报告了有史以来最多的新客户。",
      "然而，这种客户数量的激增也导致了订单的延迟和网站的崩溃。",
      "尽管如此，CEO还警告说，一旦解除居家令，这种增长可能无法持续。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "景林资产大举加仓美股，拥有拼多多、Meta、微软、谷歌等顶级股份",
    "originLink": "http://sc.stock.cnfol.com/gushiyaowen/20231114/30486169.shtml",
    "originBody": "登录客服 使用财视扫码登陆 下次自动登录 登录 忘记密码？立即注册 其它账号登录：新浪QQ微信 手机网 退出 在线咨询 |客服帮助 手机网 欢迎您， 首页 财经 股票 基金 黄金 外汇 期货 港股 理财 原创 汽车 视频 路演 博客 财经号 广告合作 首页>>市场>>股市要闻>> 正文 入驻财经号 写付费文章 精华推荐 财经号 不能尽快突破，就要提... 张良点金：隔夜原油76... 李鸿彬：黄金临近1932... 李鸿彬：11.14黄金成... 博客 热门话题 直播 退潮还未结束 新题材开启否？多方的动作还有待加力 热点前瞻：数据要素+智能光伏+光通信+量子通信 周二早间市场信息收盘放利好 港股拉升 A股能补涨吗 梁祝：横盘整理等待长阳起飞华为概念股强势领涨 股心：缩量强化震荡，退潮是否结束 大盘双针蓄势后会向上突破吗小洗盘接近尾声！ 11月13日市场最强热点复盘彬哥：反弹仍有空间 MORE图说财经 大举加仓！景林最新买这些 2023-11-14 16:17:13 来源:证券之星原创 分享到 关注中金在线： 扫描二维码 关注√ 中金在线微信 在线咨询： 扫描或点击关注中金在线客服 　　 千亿私募景林的美股市场持仓来了！ 根据美国证券交易委员会披露，景林资产的海外子公司于近日递交了截至2023年三季度末的美股持仓数据。根据信息：截止Q3景林美股合计持仓市值达到25.4亿美元，较二季度末的20.69亿美元，市值增加近5亿美元。 具体来看，三季度末景林海外子公司(景林香港)美股前十大重仓股分别是拼多多、Meta、微软、网易、中通快递、SharkNinja、新东方、谷歌、富途控股。前十大持仓总市值达22.15亿美元，占其美股持仓总市值86.87%。同时，景林持续前八的个股单只持仓市值都超过了1亿美元，重视程度可见一斑。 十大持仓情况如下： (来源：中国基金报) 此前，我们在“千亿私募再发声！看好三类机会”中分享过景林的投资逻辑：景林认为当下投资的关键，国内投资于确定性，海外投资于变革性。今天的文章，我们就来看一看景林最新的持仓，有哪些值得一提的变化。 1.继续加仓拼多多 一直以来，拼多多就是景林资产的“心头好”。 景林对于拼多多的草根调研能力是极强的，在业内对于拼多多的理解不可谓不深刻，此前的几波在拼多多上的操作都获利颇丰。 自2022年二季度起，景林资产就连续加仓拼多多，持有权重亦从22Q2的5.53%持续增值23Q3的19.84%。而在这一过程中，拼多多在海外的扩张高举高打，势如劈竹，股价虽整体波动较大，但仍震荡向上，期间涨幅也是达到了50%以上。 本周，拼多多高级副总裁王坚在2023世界互联网大会上表示，“拼多多在2022年9月推出的多多跨境业务，以新技术赋能出海业务。一年多来，多多跨境已经推动优质制造产品进入了北美、澳洲、欧洲、亚洲的40多个国家。”看来便宜的好东西也深受海外消费者的喜爱。 此前景林高云程在路演中也曾表达过对于拼多多的观点，认为“在收入增长预期不够强烈的情况下，我们看到消费变得更理智、更分层。这也使得我们在上市公司投资上做出了显著的选择，更平价的平台和产品吸引了更多的消费者。” 2.持续看好AI领域 今年以来，美国科技股指数再次创出历史新高，各路资金都在追逐美股科技AI等方向，同样景林资产也不例外。 从十大持仓来看，众所周知的美股科技巨头META、谷歌、微软均位列景林前十大持仓。且META和微软，均遭到了不同程度的加仓，而谷歌为新进十大公司。 关于人工智能领域，景林蒋彤也曾表达过自身的观点，认为“未来，作为生产力工具，AI的应用面非常广泛而且需求旺盛，有望带来产业链由高算力投入到高收入回报的良性循环。在布局平台类资产以及算力产业链之后，公司会更聚焦于应用端的投资机会。” 高云程此前也提到过，“AI等科技技术的发展，提高生产力和生产效率，让绝大部分人类都受益。这件事是不分国界的，任何一个技术再封锁，最后也会走向全世界，只是或早或晚。” 不过似乎考虑到估值，景林反倒是减持了一定股数的英伟达，从而退出十大。 3.新进智能小家电 值得注意的是，在景林三季度的美股十大持仓中，新进了一个新面孔——Shark Ninja。景林在三季度直接买了Shark Ninja293.55万股，持仓市值达到1.36亿美元，直接“空降”重仓股第六位。 据了解，Shark Ninja是一家国际化的智能小家电公司。由JS环球生活分拆上市，今年8月正式登陆纽交所。 JS环球生活旗下有九阳、Shark、Ninja三大国际品牌，其中九阳深耕中国市场，专注中高端厨房小家电；而Shark和Ninja则发力美国市场，其中Shark为地面清洁类小家电品牌，Ninja为厨房烹饪电器类品牌。 可见景林或也开始围绕着智能家电领域做积极布局。 热门搜索 郑州抓获涉传销人员130余人 江西挖出巨型阴沉木 76集团军在高原进行演习 大熊猫国家公园正式获批 NHK自揭731细菌战暴行 全国建2442公里红色旅游公路 为您推荐 诚聘英才|关于我们|广告服务|合作伙伴|法律声明|征稿启事|友链申请 本站所有文章、数据仅供参考，使用前务请仔细阅读法律声明，风险自负 违法和不良信息举报电话：0591-63307968、0591-63307969 举报邮箱：kefu@cnfol.net 《中华人民共和国增值电信业务经营许可证》编号：闽 B2-20050010 号　　《电子公告服务许可证》编号：闽通信互联网 [2008]1 号 《网络文化经营许可证》编号：闽网文[2017]6399130号　　证券资讯提供：福建天信投资咨询顾问有限公司 [证书：ZX0151] 信息网络传播视听节目许可证1310422号 　　广播电视节目制作经营许可证 编号：(闽)字第091号 Copyright © 2003-2023 中金在线. All Right Reserved. 福州网络警察报警平台违法和不良信息举报中心 闽公网安备 35010002000101号",
    "originSummary": [
      "京林资产在美国股市的持仓量增加，重仓股票包括拼多多，Meta，微软和谷歌等。",
      "该公司的投资组合多样化，涵盖人工智能和智能家居设备等多个领域。",
      "这篇文章主要讨论了股市趋势和投资策略。"
    ],
    "commentBody": "",
    "commentSummary": [
      "文章讨论了增强和虚拟现实技术如何在各种行业中走向主流，改变了企业完成任务和与他人互动的方式。",
      "这些技术正在用于培训目的，提供了一个安全的学习环境。 也提到了在招聘过程中使用虚拟现实技术。",
      "新技术的应用是由于需要在数字化时代保持竞争力而驱动的。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "拼多多概念股11月13日涨2.19%，梦网科技领涨，主力资金净流入超9亿元",
    "originLink": "https://www.sohu.com/a/736141585_115377",
    "originBody": "证券之星消息，11月13日拼多多概念股板块较上一交易日上涨2.19%，梦网科技领涨。当日上证指数报收于3046.53，上涨0.25%。深证成指报收于9988.83，上涨0.1%。拼多多概念股板块个股涨跌见下表： 从资金流向上来看，当日拼多多概念股板块主力资金净流入9050.45万元，游资资金净流出9497.51万元，散户资金净流入447.05万元。拼多多概念股板块个股资金流向见下表： 北向资金方面，当日拼多多概念股板块北向资金持股市值为4.99亿元，增持0.3亿元。其中增持最多的是梦网科技，增持了0.27亿元。减持持最多的是天音控股，减持了196.74万元。拼多多概念股板块北向资金持股变动明细见下表： 以上内容由证券之星根据公开信息整理，由算法生成，与本站立场无关。证券之星力求但不保证该信息(包括但不限于文字、视频、音频、数据及图表)全部或者部分内容的的准确性、完整性、有效性、及时性等，如存在问题请联系我们。本文为数据整理，不对您构成任何投资建议，投资有风险，请谨慎决策。 〖 证星概念日报 〗 本文不构成投资建议，股市有风险，投资需谨慎。返回搜狐，查看更多 责任编辑：",
    "originSummary": [
      "11月13日，拼多多概念股板块较上个交易日上涨2.19%，其中蒙旺科技领涨。上证指数收盘报3046.53点，上涨0.25%。",
      "在拼多多概念股板块，当日主力资金净流入为90.5045百万元，零售资金净流入为447万元。",
      "北向持股的拼多多概念股板块价值为4.99亿元，增加了3000万元。其中，最大增幅是蒙旺科技，增加了2700万元，而最大减幅是天音控股，减少了196.74万元。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "苹果要求多家头部应用删除“摇一摇”跳转广告功能，拼多多、抖音等尚未回应",
    "originLink": "https://www.nbd.com.cn/articles/2023-11-14/3112302.html",
    "originBody": "每经网首页丨 宏观丨 金融丨 公司丨 视频丨 券商丨 IPO丨 基金丨 汽车丨 房产丨 新文化丨 未来商业丨 文创通丨 城市丨 每经商学院 要闻 每经网首页 > 要闻 > 正文 苹果要叫停“摇一摇”跳转广告功能? 拼多多、抖音等头部APP回应！“摇一摇”开屏广告成牛皮癣，该如何治理？ 每日经济新闻 2023-11-14 13:34:19 每经编辑 黄胜 据第一财经，有消息称，苹果公司已通知国内多家头部APP，要求它们移除陀螺仪权限，摇一摇跳转广告被禁止。头部APP企业未来将发布取消摇一摇跳转广告功能的新版本。针对该消息，记者分别询问了淘天、京东、拼多多、抖音、快手等多家头部APP公司，未有厂商明确表示收到苹果通知，苹果也未给出回复。 图片来源：每日经济新闻 资料图 已有相关治理措施出台 打开APP“摇一摇”就可获知周边信息、参与交流互动、实现场景服务。近年来，APP “摇一摇”功能为用户带来了丰富的使用体验，增强了使用的便捷性和娱乐性。与此同时，部分APP“摇一摇”功能过于灵敏，走路稍有颠簸、乘车轻微晃动就会发生页面跳转，引发用户大量投诉，反映反感强烈，严重降低了用户使用体验。 2022年12月2日，中国信通院在微信公众号发布文章称，针对各类App开屏中的“摇一摇”行为，已联合华为、OPPO、vivo、小米、阿里巴巴等企业，对“摇一摇”类广告进行限制和规范化，具体要求触发加速度不小于15m/s²、转动角度要大于35°、操作时间不少于3s。 2023年2月28日，工信部印发《工业和信息化部关于进一步提升移动互联网应用服务能力的通知》，围绕提升用户服务感知、提升行业管理能力，共提出26条措施。其中针对“摇一摇”广告问题提出，开发者不得频繁弹窗干扰用户正常使用，不得以摇一摇或者全屏热力图等容易误触发的方式诱导用户操作，并且开屏和弹窗信息窗口必须提供有效的关闭按钮，保证用户可以便捷关闭。 图片来源：视觉中国-VCG41N878897598 “摇一摇”开屏广告成牛皮癣，该如何治理？ 据央广网，北京数字经济与数字治理法治研究会副秘书长黄尹旭表示，强制跳转剥夺了用户的自主选择权。 黄尹旭说：“他(广告商)把‘摇一摇’的敏感度提得特别高，打开手机拿在手里轻微晃动一下，就会跳转到另外一个网站。这性质上就属于一种误导性的，或者是诱导性的跳转，用户本来是想使用A的APP，通过这种误导性的跳转，转到了B的APP，就剥夺了用户的自主选择权，一定程度上也浪费了用户的时间，也破坏了用户的上网体验。” 黄尹旭进一步表示，“摇一摇”广告离不开手机陀螺仪和运动传感器数据的调用，这些数据也应该属于个人信息范畴。 北京也迪律师事务所律师吴振华表示，平台不按标准来办，个人走诉讼程序成本又高，其实还有其他路径规范和治理这种“摇一摇”广告。 吴振华说：“首先工信部之前发过相关的文件，要求他们进行整改，相关部门有一些整改措施，但是(落实)不彻底，也就是说(广告商)没有完全按照标准去做整改，如果相关行政管理部门去罚款也没有问题。还有一种情况，如果说像这种典型的侵犯消费者权益，消费者保护协会这种公益性的社团组织，其实也可以提起公益诉讼。” 黄尹旭也给出自己的建议，平台一方应充分了解用户意愿后再进行权限获取的操作，用户一方也应提高自我维权意识。 黄尹旭说：“手机系统的运营商，他们在设置权限的时候应该更加谨慎，像陀螺仪和这些传感器储能，之前的权限不太严，手机系统运行上，提供者应该采取一些措施，把权限更加严格化，必须是经用户同意才能授权给相关的APP。另外一方面用户也可以去提高自我维权意识，通过工信部或者网信办的投诉渠道，及时维权，检察机关也应该发挥司法能动性，加强公益诉讼，禁止这种包括网络牛皮癣或者其他损害用户权益的方式，为用户进行公益渠道的维权。” 每日经济新闻综合第一财经、央广网、公开信息 封面图片来源：每日经济新闻 资料图 本文经「原本」原创认证，作者每日经济新闻 访问yuanben.io查询 【179MXUHK】获取授权信息转载授权 如需转载请与《每日经济新闻》报社联系。 未经《每日经济新闻》报社授权，严禁转载或镜像，违者必究。 版权合作及网站合作电话：021-60900099转688 读者热线：4008890008 特别提醒：如果我们使用了您的图片，请作者与本站联系索取稿酬。如您不希望作品出现在本站，可联系我们要求撤下您的作品。 广告 手机 拼多多 上一篇文章 港股体育用品股持续走低 特步国际跌超15% 返回每经网首页 下一篇文章 艾迪药业与菲森药业签署战略合作协议 相关文章 新出行一周热点丨7月网约车订单环比上升7.6% 既要警惕“缅北电诈”，还要提防“间谍网勾” 国安部：提防间谍网勾 “摇一摇”，摇到衣着暴露美女，竟是间谍！ 热文精选 “互联网赋能企业可持续发展”主题咖荟在乌镇举行 被《自然》撤稿的迪亚斯发声：室温超导论文将另投其他杂志 搭建新技术新产品首发、首秀、首展平台 成都市信息领域新产品发布会将在科创生态岛举行 成都位列2023中国夜经济第一梯队 “美食+电商”点燃“锦官不夜城” 当新电商遇见“成都食力”，如何赋能消费全业态“破圈”融合？ 点击排行 1 男子吐槽领导遭索赔 2 雀巢“喊冤”被网易举报 3 交个朋友前副总裁离世 4 被举报七宗罪后，交个朋友前副总裁被确认已离世 5 网易举报雀巢制冰机 6 问界回应东莞试驾事故 7 哈马斯：准备释放70人换5天停火！以色列：授权防长可将外国人定为“恐怖分子”！联合国及多国设施遭以军袭击… 8 720亿！94岁的她首次成为中国女首富！ 9 多家银行下调存款利率 10 方红承自述被构陷入狱 欢迎关注每日经济新闻APP 0 0 相关信息 关于我们 版权声明 联系我们 广告投放 友情链接 关注我们 订阅中心 加入我们 招聘专页 Copyright © 2023 每日经济新闻报社版权所有，未经许可不得转载使用，违者必究。 广告热线 北京: 010-57613265， 上海: 021-61283008， 广州: 020-84201861， 深圳: 0755-83520159， 成都: 028-86511519 028-86512112 互联网新闻信息服务许可证：51120190017 网站备案号：蜀ICP备19004508号-3 川公网安备 51019002002026号 违法和不良信息举报电话： 400 889 0008",
    "originSummary": [
      "苹果公司 reportedly notified several top Chinese apps to remove their 'Shake-to-Skip' feature which redirects to advertisements.",
      "主要应用公司如淘天，京东，拼多多，抖音，快手等被要求停止这一显著功能，然而，这些公司都没有确认收到请求。",
      "用户称该功能为骚扰，因为跳过到广告的功能非常敏感，轻微震动常会触发页面重定向。去年，中国当局推出了措施，旨在限制和规范'Shake-to-Skip'功能，包括在启动前需要电话有较大程度的移动。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "发改委计划建立六个平台推动民营经济增长，特木和SHEIN用户接近亚马逊美国用户的90%，小鹏汽车G9和P7成为畅销车型",
    "originLink": "https://cn.wsj.com/articles/%E4%B8%AD%E6%A6%82%E8%82%A1%E7%AE%80%E6%8A%A5-%E5%8F%91%E6%94%B9%E5%A7%94-%E6%89%93%E9%80%A0%E5%85%AD%E4%B8%AA%E5%B9%B3%E5%8F%B0%E6%9C%8D%E5%8A%A1%E6%B0%91%E8%90%A5%E7%BB%8F%E6%B5%8E%E5%8F%91%E5%B1%95-21723d63",
    "originBody": "金融市场 中概股简报：发改委：打造六个平台服务民营经济发展 中国电商海外迅速增长，Temu和SHEIN美国用户数之和接近亚马逊90%；小鹏G9和小鹏P7车系双双荣登热销榜；理想MEGA将于11月17日开启预订。 2023年11月14日08:25 CST 更新 滴滴第三季度经调整EBITA亏损3亿元 拟未来24个月进行最... 成为《华尔街日报》会员， 畅读全文 马上注册 已经是会员? 登录 热门视频 婚后我们为什么做爱？ [中文] 揭秘拉斯维加斯巨球“炸裂视觉效果”背后的技术 意大利计划如何建造世界最长悬索桥？ 从领导人秀英语看中国人英语水平的提高 [中文] AI操控的“女武神”无人机可能成为美军下一利器",
    "originSummary": [
      "中国的国家发展和改革委员会计划建立六个平台以促进私营经济的增长。",
      "中国的电商公司特木和SHEIN正在快速增长，其在美国的用户数接近亚马逊的90%。",
      "小鹏汽车的两款车型G9和P7成为了热销车型，理想汽车MEGA将于11月17日开始接受预定。滴滴报告了第三季度调整后EBITA亏损3亿元，并计划在接下来的24个月内进行一轮筹款活动。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "五大金融市场事件: 美国消费者价格指数受关注！家得宝将公布财报",
    "originLink": "https://cn.investing.com/news/stock-market-news/article-2255708",
    "originBody": "今日财经市场5件大事：美国CPI万众瞩目！家得宝将公布财报",
    "originSummary": ["今日金融市场五大重要事件：美国CPI值引人关注！", "家得宝将公布其财务报告。"],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "“双11”购物数据揭示湖南消费趋势：国产品牌和当地市场分享繁荣时刻",
    "originLink": "https://hunan.voc.com.cn/article/202311/202311132215158148.html",
    "originBody": "华声在线 湖南在线新闻 专题 评论 投诉 论坛图片 视频 文旅消费 文体 经济 房产公益 长沙网 华声在线 > 湖南在线 > 今日关注 > 正文 新闻 侃财邦|“双11”成绩单公布，湖南人最爱买什么？ 2023-11-13 22:15:15 [来源:侃财邦公众号] [作者:郑旋] [编辑:洪晓懿] 字体:【大 中 小】 没有战鼓齐鸣，也不见战报频传，“双11”进入第15个年头，似乎略显冷清。但从各平台公布的数据来看，“剁手党”热情仍在，消费趋势也在悄然改变。大家“双11”都喜欢买什么？湖南在这个“双11”又有哪些独特的消费趋势? (大促开始后，参与拼多多“双11”的商家创下新高。文万周 摄) 国货崛起，“多巴胺经济”成为消费新趋势 11月12日零点，第15个“双11”正式落下帷幕，虽然各平台没有公布最终的成交数据，但也纷纷交出了“成绩单”。 淘宝天猫表示，用户规模和商家规模显著增长，规模优势进一步扩大，带动订单量和成交总额全面增长。全周期累计访问用户数超8亿，创下历史峰值。 京东方面称，截至11月11日23时59分，成交额、订单量、用户数齐创新高。目前累计超过60个品牌销售破10亿元，近20000个品牌成交额同比增长超3倍，新商家成交单量环比增长超5倍。 抖音电商发布的战报显示，定金预售商品的整体支付GMV是去年“双11”同期的1.6倍。 拼多多相关数据显示，本次参与大促的品牌数量、商品数量均创下新高，超40个细分类目实现翻倍增长，百亿补贴订单量同比增长107%。 从各平台公布的情况来看，今年“双11”表现总体向好，一系列消费亮点反映出消费市场发展的新趋势。 ( 国货消费火爆。文万周 摄) 国货迎来全面“爆发”。天猫平台上，85个国货品牌开卖即破亿元，超7万个国货品牌首日成交翻倍。京东数据显示，“双11”开启当日，小米、荣耀、华为、OPPO、vivo等国货品牌手机成交额1秒破亿元。 在美妆、运动、服饰等多个品类，国货品牌都“支棱起来”了。拼多多大促开始后，珀莱雅品牌大盘增长超180%，旗舰店同比增长超过300%；薇诺娜旗下新品牌薇诺娜宝贝增速超1000%。李宁、特步、361°、安踏、鸿星尔克等成为最受欢迎的TOP 5品牌，361度在11日当天的销量同比增长115%。 国货品牌迎来“高光时刻”，年轻人逐渐成为消费主力军。侃财君注意到，今年“双11”还有一个现象，随着越来越多的年轻的消费者加入，他们开始注重情绪价值的商品，为快乐买单。 “多巴胺经济”因此火热。业内人士告诉侃财君，相比传统消费观念，年轻人更愿意以“悦己”为目标，把个性和爱好装进购物车，“就像原来经常提到的‘多巴胺消费’，如电竞、骑行、滑雪、潮玩等，都在引导消费趋势。” 数据显示，天猫开售首小时，电竞键盘轴销量大涨600％，公路自行车成交量暴涨300％，自行车码表及配件销量增幅达230％，骑行、滑雪、户外鞋服销量同比增长300％。 (11月11日，长沙黄花综保区跨境电商仓库忙碌不停。通讯员 摄) 湖南成交额增速全国第十，最爱为“家”花钱 看了全网“双11”一系列热销“爆款”之后，侃财君不禁好奇，湖南人“买买买”的能力如何？最爱买的东西又是什么？ 来自京东的消费数据显示，湖南省成交额增速全国排名第十，年轻用户占57%。其中，长沙是购买力最强城市，邵阳成为购买力同比增幅最高的城市。 (京东平台的湖南消费数据。来源：京东) 从品类来看，黄金戒指、行李箱、门、烘焙套餐、智能家居为成交额增速TOP5品类，平板电视、笔记本电脑、手机、洗衣机、电热水器成为湖南人均消费金额排名前五的品类，开关插座、线缆、低温奶、家用五金、沐浴露为人均购物件数排名前五的品类。 在湖南，不同年龄段的消费者表现出不同的消费偏好。 主打“爱玩”的“00后”偏爱电子设备，偏好购买游戏本、键盘、鼠标垫、平板电脑、有线耳机的用户数占比分别为61%、60%、55%、54%、53%。 主打“带娃”的“80后”更加关注跟孩子相关的产品，偏好购买课外读物、儿童文学、儿童跑步鞋、书包、智能儿童手表的用户数占比分别为55%、50%、46%、45%、45%。 银发族则主要聚焦服装和园艺，偏好购买中老年女装、蔬菜种子(种苗)和园艺辅材，用户数占比分别为21%、15%和13%。 此外，进入11月以来，湖南人更爱为“家”花钱。冰洗套装、家用洗地机、擦地/擦窗机器人、扫地机器人成交额增速均超过70%。同时，家装门、安全扶手、家具五金、厨卫拉篮、仪表仪器为热销商品，成交额同比增幅125%、118%、110%、75%、60%。 由此看来，咱们湖南人消费还是主打务实、理性！ (一审：蒋俊 二审：王亚奇 三审：禹振华) 微信扫一扫：分享 微信里点“发现”，扫一下 我来说两句 丨 打印 【专题】新春走基层 【专题】奋斗百年路 启航新征程 【专题】韶山连井冈 湘赣今更红 一起为湖南发展描绘新蓝图 湖南省政府请你提“金点子”啦 今日热点 乘客突发疾病 长沙地铁4号线6号线接力护送 11.13 长沙住宅成交量环比增加超四成 政策“组合拳”落地促使交易量明显提升 11.13 梅溪湖“超级中轴”全线开工 全长约3.3公里，将打造成长沙城区新的商业主动脉 11.13 益阳多家商户遇陌生人采购 视频通话打开收款码后损失千余元 11.13 男子独占补偿款获刑 法院：拒不执行判决罪，判刑6个月 11.13 精彩回顾 发生多起事故，长沙严查电单车“上桥入隧” 策游湖南|赛程过半 花YOUNG团队有话说 发展通讯员850余名！湖南日报社时隔多年再次召开通联工作会议 最低22元/公斤，湖南猪肉零售价连续7周下跌 北京双人游5天4晚只要498元？ 低价旅游卡暗藏“陷阱” 株洲：责任上肩 确保全年大气污染防治工作圆满收官 从著作、文物、遗物三个视角理解毛泽东：《毛泽东文谭》等新书在长沙首发 为什么要阅读？这场书会分享了最美的答案 毛伟明出席第七次湖南省妇女儿童工作会议：用心用情做好 真心真情付出 焦点图 初冬林地五彩斑斓 关于华声广告服务舆情服务网站建设商务合作法律声明联系我们 0731-84326220(外联) 0731-84329951(新闻) 0731-84329948(合作及广告) ICP备案号：湘ICP备10011883号 版权所有：湖南日报社 未经授权禁止复制或建立镜像",
    "originSummary": [
      "文章报道了最近的\"双十一\"购物活动，揭示了湖南地区的购物趋势和热销产品。",
      "文章表明，国内产品消费趋势增长，越来越多的年轻消费者侧重于购买带给他们快乐与愉悦的商品，这被称为\"多巴胺经济\"。",
      "在购物活动中，中国国内品牌有了\"辉煌的一刻\"，湖南省长沙市的购买力最强，与家庭改善相关的产品销售显著增加，报告总结，湖南的消费行为务实和理性。"
    ],
    "commentBody": "",
    "commentSummary": [
      "Facebook已经为所有应用程序发布了面向移动应用开发者的预发布工具，名为Monetization Analytics。",
      "Monetization Analytics计划允许开发者度量应用程序中广告的表现，包括用户指标，比如在应用上消耗的时间，广告的曝光率以及看过广告后的消费者购买行为。",
      "这是一个新的工具，将对开发者的广告策略产生重大影响。"
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "双11过后，中国电商市场趋势变化：团购和预售策略变得日益流行",
    "originLink": "https://tele.ofweek.com/2023-11/ART-8320506-8420-30616449.html",
    "originBody": "手机版| OFweek首页半导体照明太阳能光伏电子工程激光光通讯工控显示 智能电网云计算环保风电物联网3D打印智能家居人工智能新能源汽车氢能 智慧城市仪器仪表VR智能硬件传感器智能汽车锂电新材料储能机器人 智能制造| 智慧海洋| 可穿戴设备| 医疗科技| 安防| 通信| 电力| 照明| 电源| 光学| 数字生活| PCB 侵权投诉 APP下载 登录| 注册资讯订阅 首页 资讯 新品 技术 市场 报告 财经 视点 访谈 专题 文库 视频 百科 会展 求职 招聘 培训 商城 在线研讨会 会议 直播 维科号 运营 设备 监管 无线(3G-LTE-WiMax-WLAN) 光通讯 测试 芯片 电源 线缆 交换 数据 软件 宽带 IT 终端 (手机-平板电脑-机顶盒-路由器-交换机) 三网融合 物联网 企业网 云计算 视讯 互联网 电子商务 服务运维 增值 全部 资讯 文库 找工作 更多>> 热门搜索： 仅用1/4数据量还原真人语音100%细节 火山语音上新超自然对话语音合成技术 FTTR打造全屋千兆Wi-Fi覆盖 创远信科上半年逆势实现稳健发展 联发科完成5G NTN卫星手机连线 收藏 订阅 纠错 新浪微博 腾讯QQ QQ空间 微信 加入自媒体 当前位置： OFweek 通信网 > 软件 > 正文 双11过后，电商市场该如何进化？ 2023-11-14 13:53 丫丫港股圈 关注 与过往10年里每年双11让利促销的盛况相比，当下的双11早已变味：各种价格明降暗涨、层层预付诱导消费、抓人眼球的直播各种货不对板，想要计算最低优惠价难度不亚于高等数学。 对于很多公司来说，双11已经成为了它们自我救赎，实现财报数字提升的最后的救命符，但在资本市场，显然，大家并不相信一个节日能带来什么逆袭，所谓的活动，只不过是竞争优势和劣势的放大器，大家早已用脚投票，阿里股价依然徘徊在7年低位，而京东屡创新低。 或许我们应该从双11中各家公司的表现，来看看它们的未来，在令消费者疲惫的双11过后，到底电商行业应该如何走下去。 一、越菜越多戏 目前双11的京东和淘宝最活跃。 打开手机，会发现双11时间里，手机推送基本都是这两家电商包场了，打开一些二线互联网的app，如知乎、虎扑等等，甚至会强制跳转到淘宝和京东，这真是令人惊讶，用户打开别的app，就说明不是为了购物，这种跳转可真让人火冒三丈。 而京东还在各大互联网平台打广告，把真便宜真低价作为这个双11的标语，然而，京东价格到底低不低，消费者自己还不会对比？这次双11是真便宜，那意味着以前都是假便宜咯？ 价格优势是否存在还是通过价格对比来看吧。 如以消费大类中的家清用品的纸巾为例，京东把这个定位为最低价引流大单品之一，选取销量最大品牌的核心产品对比。 打完7.5折，对比拼多多仍非常尴尬。 跟社区团购，即美团优选对比，依然不是最便宜，美团优选的价格没有因双11有什么变动，任何时候买都是差不多，而京东的双11低价，基本上只是一天而已。京东快递比拼多多快，但社区团购的到货用时可以压缩至12个小时以内，京东唯一的优势，就是送货上门？ 京东确实有一些商品达到了最便宜，但往往需要叠一堆券，而全场满减券只有一张，另外，要一次买非常多的量，如果要小批量买，价格完全比不过拼多多，就连社区团购都快不过。非常尴尬。 淘宝的表现也差不多，按照同量换算，比京东略便宜，但也同样要大量买才有优惠，小批量购买依然远差于拼多多和美团优选。 当然，不要忘了抖音，这个价格很难评，当然，直播电商从来没有标榜过低价，它们赚的也不是复购率高的最低价的稳定收入的钱，抖音还是让那些营销主导的产品去玩吧。 虽然各家公司都有自己的所谓低价优势产品，由于产品参数的不同，对比变得有点困难，但对比一些难得的标准大产品，还是能发现，价格的差异依然很明显。 如果我们一直叠buff，例如用多少券，大批量买，淘宝或者京东似乎可以达到一个最低价，但老实说，这样看下来赢的恐怕还是拼多多和社区团购(美团和拼多多)，像淘宝和京东，还有抖音，双11声势都不小，说半天了价格也不便宜，还是用计算器，又要设闹钟，实际上达到了为他人作嫁衣的效果。 二、真低价来自什么？ 企业觉得双11是助推它们成功的一大历史节点，却没想明白为什么双11是双11。 双11是企业的展示台，好产品低价格在双11得到展示，从此获得用户信任，差的产品和价格，则进一步在对比中落败。 10年前的双11，正是电商行业渗透推进的时候，大部分没接触过电商的还停留在线下超市购物的消费者上来后，发现了真正的低价和超市买不到的东西，于是开始了习惯转移，没有双11也有双12，双13，关键是，真正的低价才会推动习惯转移。 过往的拼多多也没太靠双11,618等节日消费节发力，基本都是跟着淘宝京东走，但每次双11过完，这两家平台的用户继续加速迁移，如无意外，这次双11完了，京东和阿里的用户会进一步流失。 真低价到底来自于什么？ 假设每家电商平台的take rate相同，卖来自同一个品牌的同一样商品，不更改原材料和不干涉企业经营，怎么样让售卖的成本价更低？ 第一点是物流方式的变化，目前的电商成本里，物流是一个显著的可以降低的成本，正如大家看到的，鸡贼的拼多多，物流也很套路，不是非得送上门的东西，往驿站快递点一放就完事，以前是默认上门，现在是默认菜鸟，摸清楚这个套路后，淘宝也学到了。好了，现在京东也学到了。 一个快递的成本定价里面，跨城的每公里成本很低，而同城快递的每公里成本很大，去掉这个最后一公里，是成功压榨成本的关键。 今天经常听到的，线下零售理论上应该更便宜，因为线下取货模式省掉了最后一公里成本，只是传统超市死在了房租和采购模式上了。 第二点是以产定销和团购，一个商品，大量采购商家自然能给出更低的价格，这是经典的规模化模型。 另一个方面，产品若能提前定好销量，厂家按需生产，则将实现0库存，这样同样能够造就更低的成本。 而直播电商里面，排除那些虚假宣传的东西，开播时间和售卖时间的集中化，使得头部主播某种意义上，确实实现了以产定销，只不过，直播带货在物流链的终段仍无法实现团购。 说一个事实，从几年前起，双11就变成了预售模式当道，如果预售价格跟以前一样，这本质就是一种诈骗。 预售模式下就是以产定销，完全可以降低成本，但若平台没有将降低的成本完全给消费者，那么将产生更多的利润。所以电商平台想尽办法，鼓吹低价，最终利用双11赚到了更多的利润。 第三点也是拼多多最擅长做的，尽管不插手企业的经营，但让品牌间相互内卷，把流量分配给质量和价格指标最优的卖家，但是卖家也得陪拼多多玩免费退货的游戏，以外部机制，强制企业控制成本，所以拼多多上的品牌，往往不全，也甚至逼出来了第四类方法，山寨(偷工减料)。 回到当下，电商行业两大巨头不行了，是它们仍然选择了最聪明的赚钱方法，靠低价获得了规模后，不保持低价，非得用涨价这种聪明的方法释放业绩。 所以这次双11后，倘若标榜低价的电商巨头们再次靠这个释放了良好的季度业绩，那只能说明，诈骗再次成功了。 三、谁在造就最低价？ 再来看看美国的零售行业，历史就已经说明过这种问题，costco是过去20年最成功的零售企业，亚马逊是崛起了，但仍然没有影响到costco太多，原因是价格永远便宜不过costco。 Costco跟亚马逊电商，核心物流模式都一样，都是全球采购，货物到港后，然后送到每个城市的物流中心，只是亚马逊要接下来继续进行货物的最后几公里分发，而costco的物流戛然而止，这个物流中心就是它的门店，你们大家开车来拿吧。 而另一方面，costco也明白这还不够，直接让产品的量变得很大，消费者一定要大量采购才行，这进一步压低了价格，而好处是，不但可以卖给家庭消费者，街边的零售店也可以来进货，这正是costco wholesale的核心。 目前整个电商行业，让消费者自取所节省的费用，实际上已经成为了利润的一个释放点。 那线下零售的主角，超市为何又不行了呢？ 首先在15年前，电商初步取代超市，电商改革了传统超市落后的供应链，国内任何产品的生产都具有地域优势，某些地区的产品，如水果，加成物流后，仍然比很多地方的就近产地有更好的质量和价格，而且电商撮合交易无需仓储，只要不断优化快递成本即可，当然，超市在品类上有劣势，但也能活，但此时，超市行业的整体市值，也开始被电商超过。 10年前，房地产行业走向超景气，租金成本进一步不可控，叠加快递行业的内卷，这导致了超市行业进一步的萎缩。基本上没有超市能平衡好租金成本、管理好库存、也无法预测好销量，降低存货、选品丰富度上更是不及电商，结果自然不言而喻。今天国内已经没有大的超市公司了，而电商公司，万亿市值的有两家。 疫情以来，超市加速死亡，而社区团购，正是这最后的杀手。 社区团购本来是买菜为主的，慢慢的就变成了家用快消品零售、乃至杂货零售，超市还是电商？还是，它们间的融合体？ 也许我们可以这样理解它，是一个最后一公里模型变化的超市，用了街边的各类小店作为分发，一方面，其拥有电商无法染指的生鲜市场，这很好地补充了它所无法涉及的家纺、服装鞋服、电子产品及众多小型耐用商品的市场，所以有同等大小的规模效应。而利用互联网，其实现了一定程度的以产定销和团购。 或许我们从以上的几个对比中可以注意到，美团优选在价格上只输拼多多零售，速度却快得多(当然，拼多多有多多买菜，但速度仍不如美团快)。 在送货速度和价格上更是达成对某些平台的双杀。只要某些平台不送货上门，让用户去自提快递，三杀。 目前社区团购企业基本都是亏损的，看上去可能只是烧钱造低价，但假设价格不完全是补贴的结果，而是可以持续的，只是规模效应未至，那就很惊人了。 正如沃尔玛说过的一个道理，在零售行业，亏损补贴是不存在的，也是不可持续的，哪家对手敢补贴到我的成本价以下，就去他那里进货，直到他补贴亏完为止，如果那样他还能赚到钱，那沃尔玛也活该破产倒闭。所以，不设限量和规定日子的低价，是非常值得研究的。 倘若社区团购能适当降低SKU以继续节约物流成本、适当让渡时间以进一步降低成本，最后到了可以满足街边零售店批发采购的水平，或许有史以来最便宜的品牌商品物价，我们可以看得到了。不要忘了，最后一公里的线下化、以产定销、团购，社区团购似乎都能满足？ 四、结语 关于今年的双11，被市场不看好的淘宝和京东，打一个翻身仗，还是很悬，整个电商市场，还是向着那些更会控制成本的公司倾斜，利用广告轰炸和预售，到底是证明自己低价，挽回消费者的心，还是继续骗呢？ 在此节点，整个电商行业，在如此的经济格局里面，想要增长是不易的，传统超市已经基本把市场吐得差不多了，也意味着渗透率增量不多了。市场只会留下真正会控制成本和另辟蹊径的公司。但可以观察到的是，基于线下物流成本优势的模式演变，正在成为电商行业新的进化的方向。 原文标题 : 双11过后，电商市场该如何进化？ 相关阅读 双11直播电商京东淘宝社区团购 从双11，全面透视淘宝的增长逻辑 2023-11-13 双11十五年，电商激战新红利周期 2023-11-11 从遥望科技三季报：看直播电商的“呐喊与彷徨” 2023-11-03 霸王条款惹品牌争议，京东双11站在商家对立面？ 2023-10-25 电商之战再起，淘宝、京东降门槛，反击抖音、快手、小红书 2023-08-25 分享 新浪微博 腾讯QQ QQ空间 微信 本地收藏 打印 推荐给朋友 声明： 本文由入驻维科号的作者撰写，观点仅代表作者本人，不代表OFweek立场。如有侵权或其他问题，请联系举报。 发表评论 共0条评论，0人参与 登录注册 登录注册 登录 登录即可访问所有OFweek服务 用户名/邮箱/手机： 密码： 忘记密码？ 用其他账号登录： QQ微信新浪微博 请登录后评论 请输入评论/评论长度6~500个字 您提交的评论过于频繁，请输入验证码继续 验证码： 刷新 最新评论 热门评论 暂无评论 暂无评论 图片新闻 美国打压华为的目的已部分实现 5G赋能行业，向“智”造加速 QQ、微博、陌陌：社交难逃社交命 115万5G基站，通信设备厂商各分了多少 Redmi K30S至尊纪念版评测 微星侠客GF75评测满血i7火力全开 千元机内最快闪充：真我X7测评 中兴Axon 20评测 降低屏下摄像门槛 最新发布 华为鸿蒙，谁是成长最快企业？ 中文在线5天涨幅近翻倍，短剧是门好生意吗？ OTA分野：携程收权，飞猪开放 vivo X100系列预约已开启！ 双11成了手机厂商的“牛夫人”？ 最新活动更多 11月21日 预约直播 【在线研讨会】COMSOL多物理场仿真优化MEMS器件设计 11月29日 立刻参加 OFweek2023中国优.智算力年度评选 即日-11.30 免费报名 《2023云计算与通信5G类优秀产品&解决方案合集》 12月19日 立即预约 【在线研讨会】AI服务器中被动器件的应用介绍 8月27-29日 立刻报名 2024年云计算展览会 精彩回顾 立即查看 龙雕激光 80000W超高功率激光切割机全球首台落地交付 编辑推荐 语音和短信，会不会消 中国芯新进展，国际手机采用中国芯 上半年稳健增长，中兴走向复兴 国盾量子科创板过会，将融资3.04亿 一周热点 月点击榜 1 苹果VS华为：双十一手机市场热闹非凡 2 华为多了一个寄生IPO 3 OPPO Find X7王炸功能曝光！ 4 iOS 18研发被迫暂停！ 5 vivo X100系列预约已开启！ 6 苹果确认iPhone侧载开放时间！ 7 今年双十一，国产手机不卷「战报」卷「新机」 8 被低估的传奇游戏 9 OPPO官宣下一代Find旗舰支持卫星通信 10 再见了4G！多家手机厂商取消5G开关设置！ 1 小米14发布时间正式确定！ 2 富士康突然实行双休+8小时工作制 3 iPhone 15系列销量统计出炉，下降明显？ 4 富士康反击？百万员工薪酬腰斩？ 5 雷军官宣小米14真机，全球首发澎湃OS！ 6 雷军公布小米澎湃OS核心内容！ 7 华为Mate 60 Pro真实销量曝光！ 8 vivo自研操作系统正式发布！ 9 双11首日iPhone 15销量遥遥领先？ 10 小米14被曝玩游戏发热太快，雷军亲自回应了！ 企业服务 广告服务 猎头服务 薪酬报告 通信 猎头职位 更多 高级软件工程师 广东省/深圳市 自动化高级工程师 广东省/深圳市 光器件研发工程师 福建省/福州市 销售总监(光器件) 北京市/海淀区 激光器高级销售经理 上海市/虹口区 光器件物理工程师 北京市/海淀区 激光研发工程师 北京市/昌平区 技术专家 广东省/江门市 封装工程师 北京市/海淀区 结构工程师 广东省/深圳市 文章纠错 x *文字标题： *纠错内容： 联系邮箱： *验 证 码： 关于我们 - About OFweek - 征 稿 - 广告咨询 - 帮助信息 - 联系我们 - 会员服务 - 网站导航 - 手机OFweek网 我们的网站： 半导体照明网太阳能光伏网电子工程网物联网工控网机器人网智能制造网| 智慧海洋网| 激光网显示网光通讯网云计算网3D打印网 人工智能网智能硬件网| 医疗科技网锂电网新材料网可穿戴设备网VR网新能源汽车网氢能网智慧城市网智能家居网传感器网环保网仪器仪表网 安防网储能网智能电网| 风电网智能汽车网| 通信网| 电力网| 照明网电源网光学网数字生活| PCB| 人才网外贸网培训网| 工采网| 科技成果交易中心 咨询热线：4009962228 客服传真：+86-755-83279008 粤ICP备06087881号 Copyright © 2006-2023, All Rights Reserved. 版权所有－OFweek维科网(高科技行业门户)网站所有图片、文字未经许可不得拷贝、复制。 深圳网络警 察报警平台 公共信息安 全网络监察 不良信息 举报中心 粤公网安备 44030502002758号",
    "originSummary": [
      "文章强调了中国电子商务市场的变化趋势，传统的促销活动如价格战正在失去其效力。",
      "随着消费者对广告折扣越来越警惕，新的电子商务策略如团购和预售正在受到欢迎。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  },
  {
    "title": "先鋒領航與螞蟻集團合資公司裁撤VR音樂團隊，騰訊獨家分銷Meta新VR頭盔",
    "originLink": "https://cn.wsj.com/articles/%E4%B8%AD%E6%A6%82%E8%82%A1%E7%B0%A1%E5%A0%B1-%E5%85%88%E9%8B%92%E9%A0%98%E8%88%AA%E9%80%80%E8%82%A1%E8%88%87%E8%9E%9E%E8%9F%BB%E9%9B%86%E5%9C%98%E5%90%88%E8%B3%87%E5%85%AC%E5%8F%B8-abaed356",
    "originBody": "金融市場 中概股簡報：先鋒領航退股與螞蟻集團合資公司 PICO裁撤遊戲工作室團隊，日活前三VR音游全員被裁；景林資產最新美股持倉曝光：不斷加碼拼多多，看好消費、AI。 2023年11月13日11:30 CST 更新 據報騰訊成Meta新VR頭戴裝置中國獨家銷售商 Meta於... 成为《华尔街日报》会员， 畅读全文 马上注册 已经是会员? 登录 熱門視頻 婚后我们为什么做爱？ [中文] 揭秘拉斯维加斯巨球“炸裂视觉效果”背后的技术 意大利计划如何建造世界最长悬索桥？ 从领导人秀英语看中国人英语水平的提高 [中文] AI操控的“女武神”无人机可能成为美军下一利器",
    "originSummary": [
      "先驱导航与蚂蚁集团的合资公司PICO被报道已经裁掉了其全部VR音乐游戏团队。",
      "靖林资产透露其最新的美国股票持有情况，反复增加了对拼多多的持股，表明对消费者需求和AI的信心。",
      "腾讯现在是Meta在中国新VR头盔的独家发行商。"
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699967262625
  }
]
