[
  {
    "id": 42177767,
    "title": "DOJ, Google ஐ Chrome ஐ விற்க அழுத்தம் தரும்",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177767",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "நீதித்துறை துறை (DOJ) கூகுளின் சந்தை ஆதிக்கம் மற்றும் அதன் பிற கூகுள் சேவைகளுடன் ஒருங்கிணைப்பு ஆகியவற்றைப் பற்றிய கவலைகளால், அதன் தரவுச் சேகரிப்பு மற்றும் விளம்பர திறன்களை மேம்படுத்துவதால், கூகிள் குரோம் பிரிவினை செய்யுமாறு வலியுறுத்துகிறது.",
      "விமர்சகர்கள் கூகிளின் குரோம் மீது உள்ள கட்டுப்பாடு, அதன் விளம்பர வணிகத்திற்கு நன்மை பயக்கும் அம்சங்களை முன்னுரிமை அளிக்கவும், போட்டி உலாவிகளில் சேவை தரத்தை சீர்குலைக்கவும் அனுமதிக்கிறது என்று குற்றம் சாட்டுகின்றனர்.",
      "தமிழில் எழுத வேண்டும். DOJ இன் நடவடிக்கை போட்டியை ஊக்குவிக்க நோக்கமாக உள்ளது, ஆனால் Chrome ஐ Google இல் இருந்து பிரிப்பது உண்மையில் நுகர்வோருக்கு பயனளிக்குமா அல்லது தரவினை அணுகுவதில் மற்ற நிறுவனங்களுக்கு மாற்றுமா என்பது குறித்து விவாதம் உள்ளது."
    ],
    "points": 982,
    "commentCount": 1105,
    "retryCount": 0,
    "time": 1731968647
  },
  {
    "id": 42178761,
    "title": "லாமா 3.1 405B இப்போது செரிப்ராஸ் இன்ஃபரன்ஸில் 969 டோக்கன்கள்/விநாடிக்கு இயங்குகிறது",
    "originLink": "https://cerebras.ai/blog/llama-405b-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42178761",
    "commentBody": "",
    "originSummary": [
      "Frontier AI இன் Llama 3.1 405B மாடல் Cerebras இல் புதிய வேக சாதனையை ஏற்படுத்தியுள்ளது, இது வினாடிக்கு 969 டோக்கன்களை அடைந்து, கிடைக்கக்கூடிய மிக வேகமான முன்நிலை மாடலாக உள்ளது.",
      "மாதிரி 128K சூழல் நீளத்தை ஆதரிக்கிறது மற்றும் 240மி.வினிடத்தில் குறுகிய நேரத்திற்குள் முதல் டோக்கன் தாமதத்தை வழங்குகிறது, இது பயனர் அனுபவத்தை குறிப்பிடத்தக்க வகையில் மேம்படுத்துகிறது.",
      "Cerebras, Llama 3.1 ஐ வாடிக்கையாளர் சோதனைகளுக்கு கிடைக்கச் செய்துள்ளது, பொதுவாக கிடைக்கும் தேதி 2025 முதல் காலாண்டில் எதிர்பார்க்கப்படுகிறது, மேலும் விலை ஒரு மில்லியன் உள்ளீட்டு டோக்கன்களுக்கு $6 மற்றும் ஒரு மில்லியன் வெளியீட்டு டோக்கன்களுக்கு $12 என நிர்ணயிக்கப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "லாமா 3.1 405B செரிப்ராஸ் இன்ஃபரன்ஸில் ஒரு வினாடிக்கு 969 டோக்கன்களை செயலாக்கும் வேகத்தை அடைகிறது, இது வழக்கமான செயல்பாடுகளை மிஞ்சுகிறது.",
      "செரிப்ராஸ் சுமார் 1 மில்லியன் கோர்களைக் கொண்ட CPUகளுடன் தனித்துவமான கட்டமைப்பை பயன்படுத்துகிறது, இது பாரம்பரிய GPU அமைப்புகளிலிருந்து மாறுபடுகிறது.",
      "உயர்ந்த செலவினம் மற்றும் சக்தி நுகர்வு ஆகியவற்றைத் தாண்டி, செரிப்ராஸ் அமைப்பின் விவாதம் எதிர்காலத்தில் மலிவான விலை மற்றும் AI பயன்பாடுகளுக்கு முக்கியமான விளைவுகளை கொண்டிருக்கலாம் என்பதைக் குறிக்கிறது."
    ],
    "points": 415,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1731975304
  },
  {
    "id": 42177619,
    "title": "சயின்டிபிக் அமெரிக்காவின் விலகும் ஆசிரியர் மற்றும் அறிவியலின் அரசியல்மயமாக்கல்",
    "originLink": "https://reason.com/2024/11/18/how-scientific-americans-departing-editor-helped-degrade-science/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177619",
    "commentBody": "",
    "originSummary": [
      "லாரா ஹெல்முத், முந்தைய சயன்டிபிக் அமெரிக்கன் ஆசிரியர், சர்ச்சையான சமூக ஊடக பதிவுகள் மற்றும் அவரது ஆசிரியர் திசைமாற்றம் குறித்த விமர்சனங்களை தொடர்ந்து ராஜினாமா செய்தார்.",
      "அவளது பதவிக்காலத்தில், அந்த மாத இதழ் ஒரு அரசியல் நோக்கத்தை ஊக்குவிப்பதாக குற்றச்சாட்டுகளை எதிர்கொண்டது, இது அதன் அறிவியல் நம்பகத்தன்மையை பாதித்ததாக விமர்சகர்கள் வாதிடுகின்றனர், குறிப்பாக இளையோர் பாலின மருத்துவம் போன்ற நுணுக்கமான தலைப்புகளில்.",
      "இந்த நிலைமை, அறிவியல் அதிகாரத்தின் மீது நம்பிக்கையின் பரந்த நெருக்கடியை உருவாக்கியுள்ளது, இதனால் Scientific American தனது கண்ணியத்தை மீண்டும் பெற அறிவியலுக்கு முக்கியத்துவம் அளிக்க வேண்டும் என்ற கோரிக்கைகள் எழுந்துள்ளன."
    ],
    "commentSummary": [
      "\"சயின்டிபிக் அமெரிக்கன்\" இதழின் ஆசிரியர், சுசான் கிரீன்ஹால்ஜின் புத்தகத்தில் கொக்கோ-கோலாவின் அறிவியலைப் பயன்படுத்தி குண்டான்மை பிரச்சினைகளிலிருந்து கவனத்தை திருப்புவதற்கான விவாதத்தில், அறிவியலை அரசியலாக்கியதாக குற்றம்சாட்டப்பட்டுள்ளார்.",
      "விவாதம் \"அறிவியலை நம்புங்கள்\" என்ற சொற்றொடரின் மீது கவலைகளை எழுப்புகிறது, இது அறிவியலை சந்தேகத்திற்கு பதிலாக நம்பிக்கையுடன் இணைக்கக்கூடும் என்று பரிந்துரைக்கிறது, மேலும் அறிவியல் அறிக்கையிடலில் அரசியலின் தாக்கத்தை வெளிப்படுத்துகிறது.",
      "இந்த விவாதம், அறிவியல் நேர்மையை பாதுகாப்பதற்கும் அரசியல் செல்வாக்குகளை நிர்வகிப்பதற்கும் இடையிலான பதட்டத்தை வலியுறுத்துகிறது, இரு அரசியல் தரப்புகளும் தங்கள் நோக்கங்களை முன்னேற்ற அறிவியலைப் பயன்படுத்துகின்றன என்ற குற்றச்சாட்டுகளுடன்."
    ],
    "points": 324,
    "commentCount": 578,
    "retryCount": 0,
    "time": 1731967494
  },
  {
    "id": 42182519,
    "title": "ஓபன் ஸ்ட்ரீட்மாப் இன் புதிய வெக்டர் டைல்ஸ்",
    "originLink": "https://tech.marksblogg.com/osm-mvt-vector-tiles.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42182519",
    "commentBody": "",
    "originSummary": [
      "OpenStreetMap (OSM) Mapbox Vector Tiles (MVT) வடிவத்தில் வெக்டார் டைல்களை அறிமுகப்படுத்தியுள்ளது, இது பயனர்களுக்கு வரைபட பாணிகளை தனிப்பயனாக்கவும், லேபிள் மொழிகளை மாற்றவும், வரைபடத்தின் தெளிவையும் நெகிழ்வையும் மேம்படுத்தவும் அனுமதிக்கிறது.",
      "இந்த புதுப்பிப்பு முந்தைய நிலையான ராஸ்டர் டைல்களின் பயன்பாட்டிலிருந்து மாற்றத்தை குறிக்கிறது, இது கூர்மையான படங்களை மற்றும் மேலும் மாறுபடும் தரவுகளின் தொடர்புகளை அனுமதிக்கிறது.",
      "TEXT: இந்த பதிவில் பைத்தான் சூழலை அமைப்பது மற்றும் தரவுப் பகுப்பாய்விற்காக DuckDB ஐ பயன்படுத்துவது பற்றிய வழிகாட்டுதல்கள் அடங்கும், மேலும் QGIS மற்றும் Leafmap போன்ற கருவிகள் மூலம் காட்சிப்படுத்தல் சாத்தியமாகும். TEXT:"
    ],
    "commentSummary": [
      "OpenStreetMap புதிய வெக்டர் டைல்களை அறிமுகப்படுத்தியுள்ளது, இது மென்மையான ஜூமிங் மற்றும் எளிதான பாணி திருத்தத்தை வழங்குகிறது, ஆனால் புள்ளிகள் மற்றும் தெரு பெயர்கள் போன்ற ராஸ்டர் டைல்களின் விவரங்களை கொண்டிருக்கவில்லை.",
      "திறந்த மூல சமூகத்தில் வெக்டர் வரைபட திறன்கள் முன்னேற்றம் அடைந்துள்ளன, எனினும் அரபு உரையுடன் கூடிய காட்சிப்படுத்தல் சிக்கல்கள் போன்ற சவால்கள் தொடர்கின்றன.",
      "வெக்டர் டைல்கள் ஹோஸ்டிங் செலவுகளை குறைக்கக்கூடும், ஆனால் அதிக வாடிக்கையாளர் பக்கம் வளங்களை தேவைப்படும்; அவை தற்போது தொழில்நுட்ப முன்னோட்டத்தில் உள்ளன மற்றும் தொடர்ந்து மேம்பாடுகள் எதிர்பார்க்கப்படுகின்றன."
    ],
    "points": 263,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732017782
  },
  {
    "id": 42181345,
    "title": "நியாயமான நாணயங்கள் துவங்கிய பக்கத்தில் தரையில் விழுவதற்கு அதிக வாய்ப்பு உள்ளது: 350,757 முறை திருப்பியதில் இருந்து ஆதாரம்",
    "originLink": "https://www.researchgate.net/publication/374700857_Fair_coins_tend_to_land_on_the_same_side_they_started_Evidence_from_350757_flips",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42181345",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். ஒரு ஆய்வு 350,757 நாணய சுழற்சிகளை உள்ளடக்கியது, இது நாணயங்கள் துவங்கிய பக்கத்தில் இறங்குவதற்கான வாய்ப்பு அதிகம் எனக் கூறுகிறது, ஆனால் மாதிரியின் அளவு 48 பரிசோதகர்களுக்கு மட்டுமே வரையறுக்கப்பட்டது.",
      "விமர்சகர்கள், குறைந்த புரட்டல் உயரம் மற்றும் சுழற்சிகளை உள்ளடக்கிய ஆய்வின் முறைமையை சுட்டிக்காட்டி, முடிவுகளை சாய்த்திருக்கலாம், மேலும் சோதனையாளர் பாகுபாடுகள் முடிவுகளை பாதிக்கக்கூடும் என்று கூறுகின்றனர்.",
      "ஆய்வு நாணய சுழற்சிகளில் மனித குறைபாடுகளின் பங்கைக் குறிப்பிடுகிறது, ஆனால் அதன் முடிவுகள் சோதிக்கப்பட்ட குறிப்பிட்ட நிலைமைகளுக்கு அப்பால் பொருந்தக்கூடியதாக இருக்காது."
    ],
    "points": 224,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732007030
  },
  {
    "id": 42177462,
    "title": "ஹைப்பர்ஃபைன்: கட்டளை வரி அளவீட்டு கருவி",
    "originLink": "https://github.com/sharkdp/hyperfine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177462",
    "commentBody": "",
    "originSummary": [
      "Hyperfine என்பது பன்முகமான கட்டளை வரி தரவுத்தொகுப்பு கருவியாகும், இது புள்ளிவிவர பகுப்பாய்வு, 任意 ஷெல் கட்டளைகள் மற்றும் நேரடி முன்னேற்ற கருத்துக்களை வழங்குகிறது.- இது வெப்பமூட்டும் இயக்கங்கள், கேஷ்-அழிக்கும் கட்டளைகள், வெளிப்புற கண்டறிதல் போன்ற அம்சங்களை வழங்குகிறது மற்றும் முடிவுகளை CSV, JSON மற்றும் Markdown வடிவங்களில் ஏற்றுமதி செய்ய ஆதரிக்கிறது.- இந்த கருவி பல இயக்க முறைமுறைகள் மற்றும் தொகுப்பு மேலாளர்களுடன் இணக்கமாக உள்ளது மற்றும் MIT மற்றும் Apache License 2.0 ஆகியவற்றின் கீழ் இரட்டை உரிமம் பெற்றுள்ளது, இது டெவலப்பர்களுக்கு அணுகக்கூடிய மற்றும் நெகிழ்வானதாக இருக்கிறது."
    ],
    "commentSummary": [
      "Hyperfine என்பது fd, bat, மற்றும் hexyl போன்ற பிற Rust அடிப்படையிலான உபகரணங்களை உருவாக்கியவரால் உருவாக்கப்பட்ட கட்டளை வரி தரவுத்தொகுப்பு கருவியாகும், இது அதன் பயனர் நட்பு இடைமுகத்திற்காக அறியப்படுகிறது.",
      "தமிழில் எழுத வேண்டும்: பயன்படுத்த எளிமையாக இருப்பதற்காக பாராட்டப்பட்டாலும், சில பயனர்கள் மிகக் குறுகிய அளவீடுகளுக்கான துல்லியத்தில் குறைபாடுகளை குறிப்பிட்டுள்ளனர், குறிப்பிட்ட தேவைகளுக்கு 'perf' மற்றும் 'multitime' போன்ற மாற்றுகளை பரிந்துரைக்கின்றனர்.",
      "Hyperfine ஓப்பன்-சோர்ஸ் ஆகும், அதன் தொடர்ந்த மேம்பாடு மற்றும் முன்னேற்றத்திற்கு பயனர்கள் பங்களிக்க அழைக்கப்படுகிறார்கள்."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731966456
  },
  {
    "id": 42179774,
    "title": "எலிகள் ஓட்ட கற்றுக்கொண்டன",
    "originLink": "https://theconversation.com/im-a-neuroscientist-who-taught-rats-to-drive-their-joy-suggests-how-anticipating-fun-can-enrich-human-life-239029",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179774",
    "commentBody": "",
    "originSummary": [
      "தமிழில் எழுத வேண்டும். ஒரு நரம்பியல் விஞ்ஞானி எலிகளை சிறிய கார்கள் ஓட்டுவதற்கு பயிற்சி அளித்தார், மகிழ்ச்சியின் எதிர்பார்ப்பு உந்துதல் மற்றும் மகிழ்ச்சியை அதிகரிக்க முடியும் என்பதை, அதனால் நடத்தை மற்றும் மூளை செயல்பாட்டை பாதிக்க முடியும் என்பதை நிரூபித்தார்.",
      "ஆய்வு, நேர்மறையான எதிர்பார்ப்பு, மனப்பாங்குகளை நெகடிவாக இருந்து நேர்மறையாக மாற்ற முடியும் என்பதை கண்டறிந்தது, மேலும் வளமான சூழல்கள் மற்றும் வெகுமதிகளுக்கான காத்திருப்பு காலங்களின் பங்கையும் வெளிப்படுத்தியது.",
      "எலியின் நடத்தை குறித்த பார்வைகள், உதாரணமாக வால் நிலை, உணர்ச்சி வெளிப்பாடுகளைப் பற்றிய புரிதல்களை வழங்கின, மூளை உருவாகும் போது நேர்மறை அனுபவங்களின் முக்கியத்துவத்தை வலியுறுத்தின."
    ],
    "commentSummary": [
      "எலிகள் ஓட்டுவதற்கு பயிற்சி பெறப்பட்டுள்ளன, இது விலங்குகளின் நுண்ணறிவு மற்றும் நடத்தை பற்றிய விவாதங்களை வெளிப்படுத்துகிறது, ஒரு குரங்கு பார்வையால் ஒரு கால்ஃப் கார்ட்டை ஓட்ட கற்றுக்கொண்டது போன்றது.",
      "விலங்குகள், குறிப்பாக நாய்கள் மற்றும் ஆமைகள் போன்றவை, ஒரே மாதிரியான பணிகளைச் செய்யும் திறன், இயற்கையான இயக்கத்தின் நோக்கத்தை வெளிப்படுத்துகிறது மற்றும் விலங்கு அறிவு பற்றிய கேள்விகளை எழுப்புகிறது.",
      "இந்த தலைப்பு, குறிப்பாக வால் அசைவுகளின் மூலம், விலங்குகள் உணர்வுகளை எவ்வாறு தொடர்பு கொள்கின்றன மற்றும் விலங்குகள் மேலும் சிக்கலான பணிகளை மேற்கொள்ளும் சாத்தியங்கள் குறித்து ஆர்வத்தை உருவாக்கியுள்ளது."
    ],
    "points": 205,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1731985939
  },
  {
    "id": 42179467,
    "title": "மாஸ்லோ 4: பெரிய வடிவ CNC ரவுட்டிங் எளிதாக்கப்பட்டது",
    "originLink": "https://www.maslowcnc.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179467",
    "commentBody": "",
    "originSummary": [
      "Maslow 4 என்பது ஒரு பெரிய வடிவ CNC (கணினி எண் கட்டுப்பாடு) ரவுட்டர் ஆகும், இது பயனர்களுக்கு டிஜிட்டல் வடிவமைப்புகளை உடல் உருவாக்கங்களாக மாற்ற எளிதாக்குகிறது.",
      "மாஸ்லோ சமூகத்தில் பல்வேறு திட்டங்களை பகிர்வதில் செயலில் உள்ளது, அதில் மரச்சாமான்கள், கலை, படகுகள் மற்றும் பலகைகள் அடங்கும், இது தளத்தின் பல்துறை திறனை வெளிப்படுத்துகிறது மற்றும் படைப்பாற்றலை ஊக்குவிக்கிறது.",
      "பயனர்கள் வெற்றிகரமாக நிற்கும் மேசைகள், பொறிப்புகள் மற்றும் இன்றியமையாத சிறிய வீடு போன்ற பல்வேறு பொருட்களை உருவாக்கியுள்ளனர், இது புதுமையான திட்டங்களுக்கு CNC தொழில்நுட்பத்தின் திறனை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "Maslow 4 என்பது ஒரு பெரிய வடிவ CNC (கணினி எண் கட்டுப்பாடு) ரவுட்டர் ஆகும், இது வெற்றிகரமான கிக்ஸ்டார்டர் பிரச்சாரத்தின் மூலம் குறிப்பிடத்தக்க கவனத்தை பெற்றது, $16,000 இலக்கை மிக அதிகமாக மிஞ்சிய $249,000 நிதியை திரட்டியது.",
      "ரூட்டர் திறந்த மூலமாக உள்ளது, GPLv3 (பொது பொதுமக்கள் உரிமம் பதிப்பு 3) கீழ் மென்பொருளும், CC-BY-SA 4 (கிரியேட்டிவ் காமன்ஸ் அடைப்பு-பகிர்வு 4.0) கீழ் CAD (கணினி உதவியுடன் வடிவமைப்பு) கோப்புகளும் உள்ளன, இது சமூக இயக்கம் மற்றும் தனிப்பயனாக்கத்திற்கான அனுமதியை வழங்குகிறது.",
      "இது பெரிய மர தாள்களை வெட்டுவதில் அதன் மலிவு மற்றும் பல்துறை பயன்பாட்டிற்காக குறிப்பிடப்படுகிறது, ஆனால் சில பயனர்கள் அமைப்பை சவாலாகக் காண்கிறார்கள்; கிட்டின் விலை $525, ரவுட்டர் மற்றும் கட்டமைப்பை தவிர்த்து."
    ],
    "points": 198,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1731982167
  }
]
