[
  {
    "id": 42177767,
    "title": "DOJ akan mendorong Google untuk menjual Chrome",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177767",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Departemen Kehakiman (DOJ) mendesak Google untuk melepaskan Chrome karena kekhawatiran tentang dominasinya di pasar dan integrasinya dengan layanan Google lainnya, yang meningkatkan kemampuan pengumpulan data dan periklanannya.",
      "Kritikus mengklaim bahwa kontrol Google atas Chrome memungkinkannya untuk memprioritaskan fitur yang menguntungkan bisnis periklanannya dan berpotensi menurunkan kualitas layanan pada peramban pesaing.",
      "Tindakan DOJ dimaksudkan untuk mendorong persaingan, tetapi ada perdebatan mengenai apakah memisahkan Chrome dari Google benar-benar akan menguntungkan konsumen atau hanya mengalihkan akses data ke perusahaan lain."
    ],
    "points": 982,
    "commentCount": 1105,
    "retryCount": 0,
    "time": 1731968647
  },
  {
    "id": 42178761,
    "title": "Llama 3.1 405B sekarang berjalan pada kecepatan 969 token/detik di Cerebras Inference",
    "originLink": "https://cerebras.ai/blog/llama-405b-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42178761",
    "commentBody": "",
    "originSummary": [
      "Model Llama 3.1 405B dari Frontier AI pada Cerebras telah mencetak rekor kecepatan baru, mencapai 969 token per detik, menjadikannya model frontier tercepat yang tersedia.",
      "Model ini mendukung panjang konteks 128K dan menawarkan latensi waktu-ke-token-pertama terpendek pada 240ms, yang secara signifikan meningkatkan pengalaman pengguna.",
      "Cerebras telah membuat Llama 3.1 tersedia untuk uji coba pelanggan, dengan ketersediaan umum diharapkan pada Q1 2025, dan harga ditetapkan pada $6 per juta token input dan $12 per juta token output."
    ],
    "commentSummary": [
      "Llama 3.1 405B mencapai kecepatan pemrosesan 969 token per detik pada Cerebras Inference, melampaui implementasi tipikal.",
      "Cerebras menggunakan arsitektur yang khas dengan CPU yang mengandung sekitar 1 juta inti, berbeda dari pengaturan GPU tradisional.",
      "Meskipun biaya tinggi dan konsumsi daya dari sistem Cerebras, diskusi menunjukkan potensi keterjangkauan di masa depan dan implikasi signifikan untuk aplikasi AI."
    ],
    "points": 415,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1731975304
  },
  {
    "id": 42177619,
    "title": "Editor yang meninggalkan Scientific American dan politisasi ilmu pengetahuan",
    "originLink": "https://reason.com/2024/11/18/how-scientific-americans-departing-editor-helped-degrade-science/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177619",
    "commentBody": "",
    "originSummary": [
      "Laura Helmuth, mantan editor Scientific American, mengundurkan diri setelah postingan media sosial yang kontroversial dan kritik terkait arah editorialnya.",
      "Selama masa jabatannya, majalah tersebut menghadapi tuduhan mempromosikan agenda politik, yang menurut para kritikus mengorbankan kredibilitas ilmiahnya, terutama pada topik sensitif seperti pengobatan gender remaja.",
      "Situasi ini telah berkontribusi pada krisis kepercayaan yang lebih luas terhadap otoritas ilmiah, dengan seruan agar Scientific American memprioritaskan ilmu pengetahuan di atas politik untuk memulihkan reputasinya."
    ],
    "commentSummary": [
      "Editor Scientific American telah dikritik karena diduga mempolitisasi sains, seperti yang dibahas dalam buku Susan Greenhalgh tentang penggunaan sains oleh Coca-Cola untuk mengalihkan perhatian dari masalah obesitas.",
      "Perdebatan tersebut menimbulkan kekhawatiran tentang frasa 'percaya pada sains,' yang menyarankan bahwa hal itu mungkin menyelaraskan sains dengan keyakinan daripada skeptisisme, dan menyoroti pengaruh politik terhadap pelaporan ilmiah.",
      "Teks tersebut menyoroti ketegangan antara menjaga integritas ilmiah dan mengelola pengaruh politik, dengan klaim bahwa kedua sisi politik memanfaatkan ilmu pengetahuan untuk memajukan agenda mereka."
    ],
    "points": 324,
    "commentCount": 578,
    "retryCount": 0,
    "time": 1731967494
  },
  {
    "id": 42182519,
    "title": "Ubin Vektor Baru OpenStreetMap",
    "originLink": "https://tech.marksblogg.com/osm-mvt-vector-tiles.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42182519",
    "commentBody": "",
    "originSummary": [
      "OpenStreetMap (OSM) telah meluncurkan ubin vektor dalam format Mapbox Vector Tiles (MVT), memungkinkan pengguna untuk menyesuaikan gaya peta dan mengganti bahasa label, meningkatkan kejelasan dan fleksibilitas peta.",
      "Pembaharuan ini menandai pergeseran dari penggunaan ubin raster statis sebelumnya, memungkinkan gambar yang lebih tajam dan interaksi data yang lebih dinamis.",
      "Tulisan tersebut mencakup panduan tentang cara mengatur lingkungan Python dan memanfaatkan DuckDB untuk analisis data, dengan visualisasi yang dapat dilakukan melalui alat seperti QGIS dan Leafmap."
    ],
    "commentSummary": [
      "OpenStreetMap telah memperkenalkan ubin vektor baru, yang menyediakan zooming yang halus dan pengeditan gaya yang mudah tetapi kurang detail dibandingkan ubin raster, seperti Titik Menarik (POI) dan nama jalan.",
      "Tetapi komunitas sumber terbuka telah memajukan kemampuan peta vektor, tantangan seperti masalah rendering dengan teks Arab masih ada.",
      "Ubin vektor berpotensi menurunkan biaya hosting tetapi memerlukan lebih banyak sumber daya di sisi klien; saat ini mereka dalam pratinjau teknis dengan perbaikan yang diharapkan terus berlanjut."
    ],
    "points": 263,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732017782
  },
  {
    "id": 42181345,
    "title": "Uang koin yang adil cenderung mendarat pada sisi yang mereka mulai: Bukti dari 350.757 lemparan",
    "originLink": "https://www.researchgate.net/publication/374700857_Fair_coins_tend_to_land_on_the_same_side_they_started_Evidence_from_350757_flips",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42181345",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Studi yang melibatkan 350.757 lemparan koin menunjukkan bahwa koin lebih mungkin mendarat pada sisi yang mereka mulai, tetapi ukuran sampel dibatasi hanya untuk 48 penguji.",
      "Kritikus menunjukkan bahwa metodologi studi tersebut, termasuk tinggi putaran yang rendah dan rotasi, mungkin telah mempengaruhi hasilnya, dan potensi bias penguji dapat mempengaruhi temuan tersebut.",
      "Teks tersebut menekankan peran ketidaksempurnaan manusia dalam lemparan koin, tetapi kesimpulannya mungkin tidak dapat diterapkan di luar kondisi spesifik yang diuji."
    ],
    "points": 224,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732007030
  },
  {
    "id": 42177462,
    "title": "Hyperfine: Alat benchmarking baris perintah",
    "originLink": "https://github.com/sharkdp/hyperfine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177462",
    "commentBody": "",
    "originSummary": [
      "Hyperfine adalah alat benchmarking command-line yang serbaguna yang mendukung analisis statistik, perintah shell sewenang-wenang, dan memberikan umpan balik kemajuan secara real-time. Alat ini menawarkan fitur seperti pemanasan awal, perintah pembersihan cache, deteksi outlier, dan mendukung ekspor hasil dalam format CSV, JSON, dan Markdown. Alat ini kompatibel dengan berbagai sistem operasi dan manajer paket, serta memiliki lisensi ganda di bawah MIT dan Apache License 2.0, menjadikannya dapat diakses dan fleksibel bagi pengembang."
    ],
    "commentSummary": [
      "Hyperfine adalah alat benchmarking berbasis command-line yang dikembangkan oleh pencipta utilitas lain berbasis Rust seperti fd, bat, dan hexyl, yang dikenal dengan antarmuka yang ramah pengguna.",
      "Meski dipuji karena kemudahan penggunaannya, beberapa pengguna mencatat keterbatasan dalam presisi untuk tolok ukur yang sangat singkat, menyarankan alternatif seperti 'perf' dan 'multitime' untuk kebutuhan spesifik.",
      "Hyperfine bersifat open-source, mengundang pengguna untuk berkontribusi pada pengembangan dan peningkatannya yang berkelanjutan."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731966456
  },
  {
    "id": 42179774,
    "title": "Ratusan belajar mengemudi",
    "originLink": "https://theconversation.com/im-a-neuroscientist-who-taught-rats-to-drive-their-joy-suggests-how-anticipating-fun-can-enrich-human-life-239029",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179774",
    "commentBody": "",
    "originSummary": [
      "Seorang ahli saraf melatih tikus untuk mengemudikan mobil kecil, menunjukkan bahwa antisipasi kesenangan dapat meningkatkan motivasi dan kegembiraan, mempengaruhi perilaku dan fungsi otak.",
      "Tinjauan tersebut menemukan bahwa antisipasi positif dapat mengubah gaya kognitif dari pesimistis menjadi optimistis, menyoroti peran lingkungan yang diperkaya dan periode menunggu untuk mendapatkan imbalan.",
      "Pengamatan terhadap perilaku tikus, seperti postur ekor, memberikan wawasan tentang ekspresi emosional, menekankan pentingnya pengalaman positif dalam membentuk otak."
    ],
    "commentSummary": [
      "Para tikus telah dilatih untuk mengemudi, menyoroti diskusi tentang kecerdasan dan perilaku hewan, mirip dengan seekor orangutan yang belajar mengemudikan kereta golf melalui pengamatan.",
      "Tingkah laku berbagai hewan, seperti anjing dan kura-kura, untuk melakukan tugas serupa menunjukkan kecenderungan alami untuk bergerak dan menimbulkan pertanyaan tentang kognisi hewan.",
      "Topik ini telah menarik minat tentang bagaimana hewan berkomunikasi emosi, terutama melalui gerakan ekor, dan potensi bagi hewan untuk melakukan tugas yang lebih kompleks."
    ],
    "points": 205,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1731985939
  },
  {
    "id": 42179467,
    "title": "Maslow 4: Pemotongan CNC format besar yang mudah diakses",
    "originLink": "https://www.maslowcnc.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179467",
    "commentBody": "",
    "originSummary": [
      "Maslow 4 adalah mesin router CNC (Computer Numerical Control) berformat besar yang memudahkan pengguna untuk mengubah desain digital menjadi kreasi fisik.",
      "Komunitas Maslow aktif dalam berbagi berbagai proyek, termasuk furnitur, seni, perahu, dan tanda, yang menunjukkan fleksibilitas platform dan mendorong kreativitas.",
      "Pengguna telah berhasil menciptakan berbagai item seperti meja berdiri, ukiran, dan bahkan rumah mungil, yang menyoroti potensi teknologi CNC untuk proyek-proyek inovatif."
    ],
    "commentSummary": [
      "Maslow 4 adalah mesin router CNC (Computer Numerical Control) berformat besar yang mendapatkan perhatian signifikan melalui kampanye Kickstarter yang sukses, mengumpulkan $249.000, jauh melampaui target $16.000.",
      "Trouter ini bersifat open-source, dengan perangkat lunak di bawah GPLv3 (General Public License versi 3) dan file CAD (Computer-Aided Design) di bawah CC-BY-SA 4 (Creative Commons Attribution-ShareAlike 4.0), memungkinkan pengembangan dan kustomisasi yang didorong oleh komunitas.",
      "Itu dikenal karena keterjangkauan dan keserbagunaannya dalam memotong lembaran kayu besar, meskipun beberapa pengguna merasa pengaturannya menantang; kit ini dihargai $525, tidak termasuk router dan bingkai."
    ],
    "points": 198,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1731982167
  }
]
