[
  {
    "id": 42177767,
    "title": "ستضغط وزارة العدل على جوجل لبيع متصفح كروم",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177767",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تدعو وزارة العدل (DOJ) شركة جوجل إلى بيع متصفح كروم بسبب المخاوف المتعلقة بسيطرته على السوق واندماجه مع خدمات جوجل الأخرى، مما يعزز قدراته في جمع البيانات والإعلانات.",
      "يدعي النقاد أن سيطرة جوجل على متصفح كروم تتيح لها إعطاء الأولوية للميزات التي تفيد أعمالها الإعلانية وقد تؤدي إلى تدهور جودة الخدمة على المتصفحات المنافسة.",
      "تهدف خطوة وزارة العدل إلى تعزيز المنافسة، لكن هناك جدلاً حول ما إذا كان فصل كروم عن جوجل سيعود بالفائدة الحقيقية على المستهلكين أو سيؤدي ببساطة إلى تحويل الوصول إلى البيانات إلى شركات أخرى."
    ],
    "points": 982,
    "commentCount": 1105,
    "retryCount": 0,
    "time": 1731968647
  },
  {
    "id": 42178761,
    "title": "اللاما 3.1 405B يعمل الآن بسرعة 969 رمزًا في الثانية على منصة سيريبراس للاستدلال",
    "originLink": "https://cerebras.ai/blog/llama-405b-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42178761",
    "commentBody": "",
    "originSummary": [
      "نموذج Llama 3.1 405B من Frontier AI على Cerebras قد حقق رقمًا قياسيًا جديدًا في السرعة، حيث وصل إلى 969 رمزًا في الثانية، مما يجعله أسرع نموذج متقدم متاح.",
      "يدعم النموذج طول سياق يصل إلى 128 ألف ويقدم أقصر زمن استجابة لأول رمز عند 240 مللي ثانية، مما يعزز تجربة المستخدم بشكل كبير.",
      "أتاحت شركة Cerebras نموذج Llama 3.1 لتجارب العملاء، مع توقع توفره العام في الربع الأول من عام 2025، وتم تحديد السعر عند 6 دولارات لكل مليون رمز إدخال و12 دولارًا لكل مليون رمز إخراج."
    ],
    "commentSummary": [
      "يحقق Llama 3.1 405B سرعة معالجة تبلغ 969 رمزًا في الثانية على منصة Cerebras Inference، متفوقًا على التطبيقات النموذجية.",
      "تستخدم شركة Cerebras بنية مميزة تحتوي على وحدات معالجة مركزية (CPUs) تضم حوالي مليون نواة، مما يختلف عن التكوينات التقليدية لوحدات معالجة الرسوميات (GPUs).",
      "على الرغم من التكلفة العالية واستهلاك الطاقة لنظام Cerebras، تشير المناقشة إلى إمكانية أن يصبح أكثر تكلفة في المستقبل وأن يكون له تأثيرات كبيرة على تطبيقات الذكاء الاصطناعي."
    ],
    "points": 415,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1731975304
  },
  {
    "id": 42177619,
    "title": "رئيس تحرير مجلة ساينتفك أمريكان المغادر وتسييس العلم",
    "originLink": "https://reason.com/2024/11/18/how-scientific-americans-departing-editor-helped-degrade-science/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177619",
    "commentBody": "",
    "originSummary": [
      "استقالت لورا هيلموت، المحررة السابقة لمجلة ساينتفك أمريكان، بعد منشورات مثيرة للجدل على وسائل التواصل الاجتماعي وانتقادات تتعلق بتوجهها التحريري.",
      "خلال فترة عملها، واجهت المجلة اتهامات بالترويج لأجندة سياسية، وهو ما يجادل النقاد بأنه أضر بمصداقيتها العلمية، خاصة في المواضيع الحساسة مثل طب جنس الشباب.",
      "لقد ساهمت الوضعية في أزمة أوسع نطاقًا من الثقة في السلطة العلمية، مع دعوات لمجلة ساينتفك أمريكان لإعطاء الأولوية للعلم على السياسة لاستعادة سمعتها."
    ],
    "commentSummary": [
      "تعرضت محررة مجلة ساينتفك أمريكان للانتقاد بسبب اتهامات بتسييس العلم، كما نوقش في كتاب سوزان جرينهالغ حول استخدام شركة كوكاكولا للعلم لتحويل الانتباه عن قضايا السمنة.",
      "يثير النقاش مخاوف حول عبارة \"ثق بالعلم\"، مشيرًا إلى أنها قد تربط العلم بالإيمان بدلاً من الشك، ويسلط الضوء على تأثير السياسة على التقارير العلمية.",
      "تؤكد المناقشة على التوتر بين الحفاظ على النزاهة العلمية وإدارة التأثيرات السياسية، مع وجود ادعاءات بأن كلا الجانبين السياسيين يستغلان العلم لتعزيز أجنداتهما."
    ],
    "points": 324,
    "commentCount": 578,
    "retryCount": 0,
    "time": 1731967494
  },
  {
    "id": 42182519,
    "title": "بلاطات المتجهات الجديدة في OpenStreetMap",
    "originLink": "https://tech.marksblogg.com/osm-mvt-vector-tiles.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42182519",
    "commentBody": "",
    "originSummary": [
      "أطلقت OpenStreetMap (OSM) بلاطات متجهة بتنسيق Mapbox Vector Tiles (MVT)، مما يتيح للمستخدمين تخصيص أنماط الخرائط وتغيير لغات التسميات، مما يعزز وضوح ومرونة الخرائط.",
      "يمثل هذا التحديث تحولًا عن الاستخدام السابق للبلاطات النقطية الثابتة، مما يتيح صورًا أكثر وضوحًا وتفاعلًا أكثر ديناميكية مع البيانات.",
      "يتضمن المنشور إرشادات حول إعداد بيئة بايثون واستخدام DuckDB لتحليل البيانات، مع إمكانية التصور باستخدام أدوات مثل QGIS وLeafmap."
    ],
    "commentSummary": [
      "قدمت OpenStreetMap بلاطات متجهة جديدة، والتي توفر تكبيرًا سلسًا وتحريرًا سهلاً للأنماط، لكنها تفتقر إلى التفاصيل الموجودة في البلاطات النقطية، مثل نقاط الاهتمام (POIs) وأسماء الشوارع.",
      "لقد تقدمت قدرات الخرائط المتجهة في مجتمع المصادر المفتوحة، ومع ذلك، لا تزال التحديات مثل مشكلات العرض مع النصوص العربية قائمة.",
      "يمكن أن تقلل البلاطات المتجهة من تكاليف الاستضافة ولكنها تتطلب المزيد من الموارد على جانب العميل؛ وهي حاليًا في معاينة تقنية مع توقع تحسينات مستمرة."
    ],
    "points": 263,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732017782
  },
  {
    "id": 42181345,
    "title": "تميل العملات العادلة إلى الهبوط على الجانب الذي بدأت عليه: دليل من 350,757 رمية",
    "originLink": "https://www.researchgate.net/publication/374700857_Fair_coins_tend_to_land_on_the_same_side_they_started_Evidence_from_350757_flips",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42181345",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تشير دراسة شملت 350,757 عملية قلب للعملات إلى أن العملات من المرجح أن تسقط على الجانب الذي بدأت عليه، ولكن كان حجم العينة محدودًا بـ 48 مختبرًا.",
      "يشير النقاد إلى أن منهجية الدراسة، بما في ذلك الارتفاع المنخفض للانقلاب والدورات، قد تكون قد أثرت على النتائج، وأن التحيزات المحتملة لدى المختبرين قد تؤثر على النتائج.",
      "تؤكد الدراسة على دور العيوب البشرية في تقليب العملات، لكن استنتاجاتها قد لا تكون قابلة للتطبيق خارج الظروف المحددة التي تم اختبارها."
    ],
    "points": 224,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732007030
  },
  {
    "id": 42177462,
    "title": "Hyperfine: أداة قياس الأداء عبر سطر الأوامر",
    "originLink": "https://github.com/sharkdp/hyperfine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177462",
    "commentBody": "",
    "originSummary": [
      "Hyperfine هو أداة قياس أداء متعددة الاستخدامات تعمل من خلال سطر الأوامر وتدعم التحليل الإحصائي والأوامر الشل العشوائية، وتوفر تغذية راجعة للتقدم في الوقت الحقيقي. - تقدم ميزات مثل تشغيلات الإحماء، أوامر تنظيف الذاكرة المؤقتة، اكتشاف القيم الشاذة، وتدعم تصدير النتائج بصيغ CSV وJSON وMarkdown. - الأداة متوافقة مع أنظمة تشغيل ومديري حزم متعددة، وهي مرخصة بشكل مزدوج تحت رخصة MIT وApache License 2.0، مما يجعلها متاحة ومرنة للمطورين."
    ],
    "commentSummary": [
      "Hyperfine هو أداة قياس أداء تعمل من خلال سطر الأوامر، تم تطويرها من قبل مبتكر أدوات أخرى تعتمد على لغة Rust مثل fd وbat وhexyl، والمعروفة بواجهتها سهلة الاستخدام.",
      "في حين تم الإشادة بسهولة الاستخدام، لاحظ بعض المستخدمين وجود قيود في الدقة عند استخدامه في اختبارات قصيرة جدًا، مما يشير إلى بدائل مثل 'perf' و 'multitime' لتلبية احتياجات محددة.",
      "Hyperfine مفتوح المصدر، مما يدعو المستخدمين للمساهمة في تطويره وتحسينه المستمر."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731966456
  },
  {
    "id": 42179774,
    "title": "تعلمت الفئران القيادة",
    "originLink": "https://theconversation.com/im-a-neuroscientist-who-taught-rats-to-drive-their-joy-suggests-how-anticipating-fun-can-enrich-human-life-239029",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179774",
    "commentBody": "",
    "originSummary": [
      "قام عالم أعصاب بتدريب الفئران على قيادة سيارات صغيرة، مما أظهر أن توقع المتعة يمكن أن يعزز الدافع والفرح، مما يؤثر على السلوك ووظيفة الدماغ.",
      "وجدت الدراسة أن التوقع الإيجابي يمكن أن يغير الأنماط المعرفية من التشاؤم إلى التفاؤل، مما يبرز دور البيئات الغنية وفترات الانتظار للحصول على المكافآت.",
      "قدمت ملاحظات سلوك الفئران، مثل وضعية الذيل، رؤى حول التعبيرات العاطفية، مما يؤكد على أهمية التجارب الإيجابية في تشكيل الدماغ."
    ],
    "commentSummary": [
      "تم تدريب الفئران على القيادة، مما يبرز النقاشات حول ذكاء الحيوانات وسلوكها، وذلك مشابه لقرد الأورانجوتان الذي تعلم قيادة عربة الجولف من خلال الملاحظة.",
      "تشير قدرة الحيوانات المختلفة، مثل الكلاب والسلاحف، على أداء مهام مشابهة إلى ميل طبيعي للحركة وتثير تساؤلات حول الإدراك الحيواني.",
      "لقد أثار الموضوع اهتمامًا حول كيفية تواصل الحيوانات لمشاعرها، لا سيما من خلال حركات الذيل، وإمكانية قيام الحيوانات بمهام أكثر تعقيدًا."
    ],
    "points": 205,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1731985939
  },
  {
    "id": 42179467,
    "title": "ماسلو 4: جعل التوجيه باستخدام CNC ذو التنسيق الكبير متاحًا",
    "originLink": "https://www.maslowcnc.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179467",
    "commentBody": "",
    "originSummary": [
      "مازلو 4 هو جهاز توجيه CNC (التحكم العددي بواسطة الحاسوب) ذو تنسيق كبير يسهل على المستخدمين تحويل التصاميم الرقمية إلى إبداعات مادية.",
      "مجتمع ماسلو نشط في مشاركة مشاريع متنوعة، بما في ذلك الأثاث والفن والقوارب واللافتات، مما يعرض تنوع المنصة ويشجع على الإبداع.",
      "لقد نجح المستخدمون في إنشاء عناصر متنوعة مثل المكاتب القابلة للوقوف والنقوش وحتى منزل صغير، مما يبرز إمكانيات تكنولوجيا CNC للمشاريع المبتكرة."
    ],
    "commentSummary": [
      "مازلو 4 هو جهاز توجيه CNC (التحكم العددي بواسطة الحاسوب) ذو تنسيق كبير، الذي حظي باهتمام كبير من خلال حملة ناجحة على منصة كيك ستارتر، حيث جمع 249,000 دولار، متجاوزًا بكثير هدفه البالغ 16,000 دولار.",
      "الموجه مفتوح المصدر، مع برمجيات تحت رخصة GPLv3 (الرخصة العامة العامة الإصدار 3) وملفات CAD (التصميم بمساعدة الحاسوب) تحت CC-BY-SA 4 (رخصة المشاع الإبداعي النسبة-المشاركة بالمثل 4.0)، مما يسمح بتطوير وتخصيص مدفوع من قبل المجتمع.",
      "يُلاحظ لتميزه في القدرة على تحمل التكاليف وتعدد الاستخدامات في قطع الألواح الخشبية الكبيرة، على الرغم من أن بعض المستخدمين يجدون إعداد الجهاز تحديًا؛ يبلغ سعر المجموعة 525 دولارًا، باستثناء جهاز التوجيه والإطار."
    ],
    "points": 198,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1731982167
  }
]
