[
  {
    "id": 42177767,
    "title": "Yhdysvaltain oikeusministeriö aikoo painostaa Googlea myymään Chromen.",
    "originLink": "https://www.bloomberg.com/news/articles/2024-11-18/doj-will-push-google-to-sell-off-chrome-to-break-search-monopoly",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177767",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yhdysvaltain oikeusministeriö (DOJ) kehottaa Googlea luopumaan Chromesta huolestuneena sen markkinaherruudesta ja integraatiosta muiden Googlen palveluiden kanssa, mikä parantaa sen tiedonkeruu- ja mainoskykyjä.",
      "Arvostelijat väittävät, että Googlen hallinta Chromen yli mahdollistaa sen priorisoida ominaisuuksia, jotka hyödyttävät sen mainosliiketoimintaa ja voivat mahdollisesti heikentää palvelun laatua kilpailevilla selaimilla.",
      "DOJ:n toimenpide on tarkoitettu edistämään kilpailua, mutta on kiistanalaista, hyödyttäisikö Chromen erottaminen Googlesta todella kuluttajia vai siirtäisikö se vain datan saatavuuden muille yrityksille."
    ],
    "points": 982,
    "commentCount": 1105,
    "retryCount": 0,
    "time": 1731968647
  },
  {
    "id": 42178761,
    "title": "Llama 3.1 405B toimii nyt nopeudella 969 tokenia/s Cerebras Inference -alustalla",
    "originLink": "https://cerebras.ai/blog/llama-405b-inference",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42178761",
    "commentBody": "",
    "originSummary": [
      "Frontier AI:n Llama 3.1 405B -malli Cerebras-alustalla on asettanut uuden nopeusennätyksen saavuttaen 969 tokenia sekunnissa, tehden siitä nopeimman saatavilla olevan frontier-mallin.",
      "Malli tukee 128K kontekstipituutta ja tarjoaa lyhimmän ajan ensimmäiseen tokeniin, 240 ms, mikä parantaa käyttäjäkokemusta merkittävästi.",
      "Cerebras on tehnyt Llama 3.1:n saataville asiakaskokeiluihin, ja yleinen saatavuus odotetaan vuoden 2025 ensimmäisellä neljänneksellä. Hinnoittelu on asetettu 6 dollariin miljoonaa syötetokenia kohden ja 12 dollariin miljoonaa tulostetokenia kohden."
    ],
    "commentSummary": [
      "Llama 3.1 405B saavuttaa käsittelynopeuden 969 tokenia sekunnissa Cerebras Inference -järjestelmällä, ylittäen tyypilliset toteutukset.",
      "Cerebras käyttää erottuvaa arkkitehtuuria, jossa suorittimissa on noin miljoona ydintä, mikä poikkeaa perinteisistä GPU-kokoonpanoista.",
      "Huolimatta Cerebrasin järjestelmän korkeista kustannuksista ja energiankulutuksesta, keskustelu viittaa mahdolliseen tulevaan edullisuuteen ja merkittäviin vaikutuksiin tekoälysovelluksille."
    ],
    "points": 415,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1731975304
  },
  {
    "id": 42177619,
    "title": "Tiedelehden Scientific Americanin eroava päätoimittaja ja tieteen politisoituminen",
    "originLink": "https://reason.com/2024/11/18/how-scientific-americans-departing-editor-helped-degrade-science/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177619",
    "commentBody": "",
    "originSummary": [
      "Laura Helmuth, entinen Scientific American -lehden päätoimittaja, erosi kiistanalaisten sosiaalisen median julkaisujen ja hänen toimituksellista suuntaansa koskevan kritiikin jälkeen.",
      "Toimikaudellaan lehti kohtasi syytöksiä poliittisen agendan edistämisestä, mikä kriitikoiden mukaan vaaransi sen tieteellisen uskottavuuden, erityisesti herkissä aiheissa, kuten nuorten sukupuolilääketieteessä.",
      "Tilanne on myötävaikuttanut laajempaan luottamuskriisiin tieteellistä auktoriteettia kohtaan, ja on esitetty vaatimuksia, että Scientific Americanin tulisi asettaa tiede politiikan edelle palauttaakseen maineensa."
    ],
    "commentSummary": [
      "Scientific Americanin päätoimittajaa on kritisoitu väitetystä tieteen politisoimisesta, kuten Susan Greenhalghin kirjassa käsitellään Coca-Colan tapaa käyttää tiedettä huomion siirtämiseksi pois lihavuusongelmista.",
      "Keskustelu herättää huolta ilmaisusta \"luota tieteeseen\", mikä viittaa siihen, että se saattaa yhdistää tieteen uskoon pikemminkin kuin skeptisyyteen, ja korostaa politiikan vaikutusta tieteelliseen raportointiin.",
      "Keskustelu korostaa jännitettä tieteellisen rehellisyyden säilyttämisen ja poliittisten vaikutteiden hallinnan välillä, ja väittää, että molemmat poliittiset osapuolet hyödyntävät tiedettä edistääkseen omia tavoitteitaan."
    ],
    "points": 324,
    "commentCount": 578,
    "retryCount": 0,
    "time": 1731967494
  },
  {
    "id": 42182519,
    "title": "OpenStreetMapin uudet vektorilaatat",
    "originLink": "https://tech.marksblogg.com/osm-mvt-vector-tiles.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42182519",
    "commentBody": "",
    "originSummary": [
      "OpenStreetMap (OSM) on julkaissut vektoritiilet Mapbox Vector Tiles (MVT) -muodossa, mikä mahdollistaa käyttäjille karttatyylien mukauttamisen ja nimikylttien kielten vaihtamisen, parantaen kartan selkeyttä ja joustavuutta.",
      "Tämä päivitys merkitsee siirtymistä aiemmasta staattisten rasterilaattojen käytöstä, mahdollistaen terävämmän kuvanlaadun ja dynaamisemman datavuorovaikutuksen.",
      "Viesti sisältää ohjeita Python-ympäristön asettamiseen ja DuckDB:n hyödyntämiseen data-analyysissä, ja visualisointi on mahdollista työkalujen kuten QGIS ja Leafmap avulla."
    ],
    "commentSummary": [
      "OpenStreetMap on esitellyt uudet vektorilaatat, jotka mahdollistavat sujuvan zoomauksen ja helpon tyylin muokkauksen, mutta niistä puuttuu rasterilaattojen yksityiskohtaisuus, kuten kiinnostavat kohteet (POI) ja kadunnimet.",
      "Avointen lähdekoodien yhteisö on edistänyt vektorikarttojen ominaisuuksia, mutta haasteita, kuten arabialaisen tekstin renderöintiongelmat, on edelleen olemassa.",
      "Vektorilaatat voivat mahdollisesti alentaa isännöintikustannuksia, mutta vaativat enemmän asiakaspuolen resursseja; ne ovat tällä hetkellä teknisessä esikatselussa, ja niihin odotetaan jatkuvia parannuksia."
    ],
    "points": 263,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1732017782
  },
  {
    "id": 42181345,
    "title": "Reilut kolikot tapaavat päätyä sille puolelle, jolta ne aloittivat: Todiste 350 757 heitosta",
    "originLink": "https://www.researchgate.net/publication/374700857_Fair_coins_tend_to_land_on_the_same_side_they_started_Evidence_from_350757_flips",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42181345",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Eräässä tutkimuksessa, jossa tehtiin 350 757 kolikonheittoa, ehdotetaan, että kolikot todennäköisemmin päätyvät sille puolelle, jolta ne aloittivat, mutta otoskoko rajoittui 48 testaajaan.",
      "Kriitikot huomauttavat, että tutkimuksen metodologia, mukaan lukien matala kääntö- ja kiertokorkeus, saattaa olla vääristänyt tuloksia, ja mahdolliset testaajien ennakkoluulot voivat vaikuttaa havaintoihin.",
      "Tutkimus korostaa ihmisten epätäydellisyyksien roolia kolikonheitossa, mutta sen johtopäätöksiä ei välttämättä voida soveltaa testattujen erityisten olosuhteiden ulkopuolella."
    ],
    "points": 224,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1732007030
  },
  {
    "id": 42177462,
    "title": "Hyperfine: Komentorivipohjainen suorituskyvyn mittaustyökalu",
    "originLink": "https://github.com/sharkdp/hyperfine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42177462",
    "commentBody": "",
    "originSummary": [
      "Hyperfine on monipuolinen komentorivipohjainen suorituskyvyn mittaustyökalu, joka tukee tilastollista analyysiä, mielivaltaisia shell-komentoja ja tarjoaa reaaliaikaista etenemispalautetta. Se tarjoaa ominaisuuksia, kuten lämmittelyajot, välimuistin tyhjennyskomennot, poikkeamien tunnistuksen ja tukee tulosten vientiä CSV-, JSON- ja Markdown-muodoissa. Työkalu on yhteensopiva useiden käyttöjärjestelmien ja pakettienhallintajärjestelmien kanssa, ja se on kaksoislisensoitu MIT- ja Apache License 2.0 -lisenssien alla, mikä tekee siitä kehittäjille helposti saatavilla olevan ja joustavan."
    ],
    "commentSummary": [
      "Hyperfine on komentorivipohjainen suorituskyvyn mittaustyökalu, jonka on kehittänyt muiden Rust-pohjaisten työkalujen, kuten fd, bat ja hexyl, luoja, ja se tunnetaan käyttäjäystävällisestä käyttöliittymästään.",
      "Vaikka sitä on kiitetty helppokäyttöisyydestä, jotkut käyttäjät ovat huomanneet rajoituksia tarkkuudessa erittäin lyhyissä vertailuissa, ja he ehdottavat vaihtoehtoja, kuten 'perf' ja 'multitime', erityistarpeisiin.",
      "Hyperfine on avoimen lähdekoodin projekti, joka kutsuu käyttäjiä osallistumaan sen jatkuvaan kehitykseen ja parantamiseen."
    ],
    "points": 206,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1731966456
  },
  {
    "id": 42179774,
    "title": "Rotat oppivat ajamaan",
    "originLink": "https://theconversation.com/im-a-neuroscientist-who-taught-rats-to-drive-their-joy-suggests-how-anticipating-fun-can-enrich-human-life-239029",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179774",
    "commentBody": "",
    "originSummary": [
      "Neurotieteilijä koulutti rottia ajamaan pieniä autoja, osoittaen, että hauskanpidon odotus voi lisätä motivaatiota ja iloa, vaikuttaen käyttäytymiseen ja aivotoimintaan.",
      "Tutkimus havaitsi, että positiivinen odotus voi muuttaa kognitiivisia tyylejä pessimistisestä optimistiseksi, korostaen rikastettujen ympäristöjen ja palkkioiden odotusjaksojen merkitystä.",
      "Rotan käyttäytymisen, kuten hännän asennon, havainnot antoivat oivalluksia tunteiden ilmaisusta, korostaen positiivisten kokemusten merkitystä aivojen muovautumisessa."
    ],
    "commentSummary": [
      "Rotat on koulutettu ajamaan, mikä korostaa keskusteluja eläinten älykkyydestä ja käyttäytymisestä, samoin kuin oranki, joka oppi ajamaan golfkärryä havainnoimalla.",
      "Erilaisten eläinten, kuten koirien ja kilpikonnien, kyky suorittaa samanlaisia tehtäviä viittaa luonnolliseen taipumukseen liikkua ja herättää kysymyksiä eläinten kognitiosta.",
      "Teema on herättänyt kiinnostusta siihen, miten eläimet viestivät tunteitaan, erityisesti hännän liikkeiden kautta, ja mahdollisuuteen, että eläimet voisivat suorittaa monimutkaisempia tehtäviä."
    ],
    "points": 205,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1731985939
  },
  {
    "id": 42179467,
    "title": "Maslow 4: Suurkokoinen CNC-reititys helposti saatavilla",
    "originLink": "https://www.maslowcnc.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42179467",
    "commentBody": "",
    "originSummary": [
      "Maslow 4 on suurikokoinen CNC (tietokoneohjattu) jyrsin, joka helpottaa käyttäjiä muuttamaan digitaaliset suunnitelmat fyysisiksi luomuksiksi.",
      "Maslow-yhteisö on aktiivinen jakamaan monenlaisia projekteja, kuten huonekaluja, taidetta, veneitä ja kylttejä, mikä osoittaa alustan monipuolisuuden ja kannustaa luovuuteen.",
      "Käyttäjät ovat onnistuneesti luoneet erilaisia esineitä, kuten seisomapöytiä, kaiverruksia ja jopa pienen talon, mikä korostaa CNC-teknologian potentiaalia innovatiivisissa projekteissa."
    ],
    "commentSummary": [
      "Maslow 4 on suurikokoinen CNC (tietokoneohjattu) jyrsin, joka sai merkittävää huomiota menestyksekkään Kickstarter-kampanjan kautta, keräten 249 000 dollaria, mikä ylitti reilusti sen 16 000 dollarin tavoitteen.",
      "Reititin on avoimen lähdekoodin, ja sen ohjelmisto on lisensoitu GPLv3 (General Public License version 3) -lisenssillä ja CAD (Computer-Aided Design) -tiedostot CC-BY-SA 4 (Creative Commons Attribution-ShareAlike 4.0) -lisenssillä, mikä mahdollistaa yhteisölähtöisen kehityksen ja mukauttamisen.",
      "Se tunnetaan edullisuudestaan ja monipuolisuudestaan suurten puulevyjen leikkaamisessa, vaikka jotkut käyttäjät pitävät asennusta haastavana; paketin hinta on 525 dollaria, ilman jyrsintä ja kehystä."
    ],
    "points": 198,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1731982167
  }
]
