[
  {
    "id": 41157974,
    "title": "תחילת הוספיס",
    "originLink": "https://jakeseliger.com/2024/08/04/starting-hospice-the-end/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״ג'ייק סליגר, כותב באתר Hacker News, שיתף פרידה מרגשת כשהוא נכנס לטיפול הוספיס, והביע תודה על תמיכת הקהילה.״",
      "״מוקף באשתו ובאחיו, ג'ייק הרהר על הבלתי נמנע שבסופים, מצטט את גנדלף מ\"שר הטבעות\".״",
      "״משתמשים רבים הגיבו בהודעות של סימפתיה, הערצה ותודה, שיתפו סיפורים אישיים והביעו כיצד הכתבים של ג'ייק השפיעו על חייהם.״"
    ],
    "points": 639,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1722828953
  },
  {
    "id": 41159063,
    "title": "להפסיק להרוג משחקים",
    "originLink": "https://eci.ec.europa.eu/045/public/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159063",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״משתמשים אירופיים מעודדים לחתום על עצומה רשמית של האיחוד האירופי שמטרתה למנוע את הפסקת המשחקים, אשר נחשבת ליעילה יותר מעצומות ב-Change.org.״",
      "מבקרים טוענים כי ייתכן שהעצומה לא תוביל לשינויים מעשיים בשל היקפה הרחב והיעדר אמצעי הגנה ספציפיים לצרכנים, כגון שמירה על משחקים במצב \"ניתן לשחק\" ואכיפת הסכמי EULA/ToS.",
      "יש ויכוח מתמשך האם רגולציה או פתרונות שוק הם הטובים יותר למתן מידע ברור יותר על רכישות משחקים וזכויות הצרכן."
    ],
    "points": 432,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1722845211
  },
  {
    "id": 41156872,
    "title": "״ספר אלקטרוני חינמי על תכנות WebGPU״",
    "originLink": "https://shi-yan.github.io/webgpuunleashed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156872",
    "commentBody": "",
    "originSummary": [
      "המחבר השיק ספר אלקטרוני המתמקד בתכנות גרפיקה/WebGPU, משאב משמעותי עבור המתעניינים בתחום זה.",
      "״הפרויקט כולל כלים נוספים כגון מגרש משחקים לקוד ומחולל אתרים סטטיים, המשפרים את חוויית הלמידה.״",
      "״למרות אתגרים כמו שחיקה והתחושה שהספר אינו שלם, החליט המחבר לפרסם אותו כדי להימנע מנטישת הפרויקט.״"
    ],
    "commentSummary": [
      "״ספר אלקטרוני על תכנות גרפיקה/WebGPU יצא לאור, והוא כולל כלים כמו מגרש משחקים לקוד ומחולל אתרים סטטי.״",
      "WebGPU, בעודו מבטיח לשיפורים עתידיים ויישומים מגוונים, מתמודד כיום עם בעיות ביצועים בהשוואה ל-WebGL.",
      "משאבים כמו webgpufundamentals.org ו-learn-wgpu עבור Rust מומלצים להתגברות על אתגרים עם תיעוד והגדרת WebGPU."
    ],
    "points": 381,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722812182
  },
  {
    "id": 41159180,
    "title": "איך פוסטגרס מאחסן נתונים על הדיסק – זהו סיפור מרתק",
    "originLink": "https://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159180",
    "commentBody": "",
    "originSummary": [
      "פוסט זה שואף לפשט את מנועי מסדי הנתונים, תוך התמקדות ספציפית ב-PostgreSQL, מסד נתונים פופולרי בקרב מפתחים.",
      "״זה מסביר כיצד PostgreSQL מאחסן נתונים על הדיסק, תוך פירוט המבנה והמטרה של ספריות וקבצים שונים בתוך ספריית הנתונים.״",
      "״מושגים מרכזיים כגון בקרת מקביליות מרובת גרסאות (MVCC), אחסון ערימה, והשימוש בהרחבת pageinspect לבדיקת אחסון נתונים נדונים כדי לעזור להבין ולייעל את ביצועי מסד הנתונים.״"
    ],
    "commentSummary": [
      "הפוסט מתעמק באיך PostgreSQL מאחסן נתונים על הדיסק, ומספק הסבר מפורט על המנגנונים הפנימיים, כולל אחסון עמודים ו-TOAST (טכניקת אחסון מאפיינים גדולים מדי).",
      "״זה מדגיש את החשיבות של הבנת רישום מקדים לכתיבה (WAL) ופענוח לוגי ב-PostgreSQL, שהם קריטיים לשחזור נתונים ושכפול.״",
      "״הדיון כולל השוואות עם מערכות מסדי נתונים אחרות כמו InnoDB של MySQL ומזכיר פורמטי אחסון חלופיים כמו Apache Arrow ו-Parquet, הרלוונטיים לניתוח נתונים ואופטימיזציית אחסון.״"
    ],
    "points": 333,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1722846505
  },
  {
    "id": 41157494,
    "title": "״איך אני מתכנת בשנת 2024״",
    "originLink": "http://akkartik.name/post/programming-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157494",
    "commentBody": "",
    "originSummary": [
      "המחבר משקף על התפתחות שיטות התכנות שלו משנת 2015 עד 2024, ומדגיש מעבר מהסתמכות כבדה על בדיקות ובקרת גרסאות לגישה מינימליסטית יותר.",
      "בשנת 2024, המחבר מחק את כל הבדיקות ושיפץ את עורך הטקסט שלו ללא בקרת גרסאות, מה שהוביל לתוכנית טובה יותר ואתגר את האמונות הקודמות שלו לגבי פיתוח תוכנה.",
      "״המחבר כעת תומך בבניית תוכנה עם מעט תלותים וללא עדכונים אוטומטיים, תוך שימוש בכלים כמו טיפוסים, הפשטות, בדיקות וגרסאות במידה מועטה כדי להימנע מחובות טכנולוגיים ומורכבות.״"
    ],
    "commentSummary": [
      "בשנת 2024, מתכנת שיתף את חוויותיו מהפסקת השימוש בבדיקות ובבקרת גרסאות, וטען שזה שיפר את התוכנית שלו.",
      "לטענתם, בדיקות חושפות באגים אך אינן מבטיחות את היעדרם, ושליטה בגרסאות יכולה להשאיר אחד מחובר לעבר, אם כי גישה זו עשויה שלא להתאים לצוותים גדולים או לפרויקטים מורכבים.",
      "דיון זה מדגיש את האיזון בין פרקטיקות מסורתיות לפרודוקטיביות אישית, כאשר הדעות חלוקות לגבי הצורך בבדיקות ובבקרת גרסאות."
    ],
    "points": 299,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1722821319
  },
  {
    "id": 41157595,
    "title": "לבנות מכונות לגו כדי להרוס מגדלי לגו גבוהים",
    "originLink": "https://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157595",
    "commentBody": "",
    "originSummary": [
      "״הווידאו החדש של Brick Technology מציג מכונות לגו עוצמתיות שנועדו להפיל מגדלי לגו גבוהים, תוך הדגשת מדע, הנדסה ותהליך איטרטיבי של ניסוי וטעייה.״",
      "״הווידאו מדגיש את היישום של עקרונות אלה בכל מאמץ יצירתי, מה שהופך מושגים הנדסיים מורכבים לנגישים ומרתקים.״",
      "מעבר מהיר מרעיון לביצוע בסרטון עשוי לעורר בצופים השראה להתנסות בעצמם בערכות לגו טכני ומיינדסטורמס."
    ],
    "commentSummary": [
      "״הפוסט עוסק בבניית מכונות לגו שנועדו להרוס מגדלי לגו גבוהים, ומדגיש את היצירתיות והכישורים ההנדסיים המעורבים בכך.״",
      "זה מזכיר ערוצי יוטיוב ויוצרים שונים, כמו אקיוקי ויושיהיטו איסוגאווה, הידועים במתקני הלגו המורכבים שלהם ובתרומתם לקהילת הלגו.",
      "הדיון נוגע גם בהשפעה הסביבתית של צעצועי פלסטיק, כאשר חלק מהמשתמשים מציעים חלופות כמו צעצועי בנייה מעץ, למרות עלותם הגבוהה יותר."
    ],
    "points": 232,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1722823340
  },
  {
    "id": 41156793,
    "title": "Age הוא כלי הצפנת קבצים פשוט, מודרני ובטוח, פורמט וספריית Go",
    "originLink": "https://github.com/FiloSottile/age",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156793",
    "commentBody": "",
    "originSummary": [
      "״Age הוא כלי הצפנת קבצים מודרני ובטוח וספריית Go, הכולל מפתחות קטנים ומפורשים, ללא אפשרויות תצורה, ויכולת חיבור בסגנון UNIX.״",
      "״הוא תומך בשיטות התקנה שונות במערכות הפעלה מרובות, כולל Homebrew, MacPorts ומנהלי חבילות להפצות לינוקס ול-Windows.״",
      "״Age תומך בטוקני PIV חומרתיים כמו YubiKeys, קבצים מוגני סיסמה, מפתחות SSH, ואפילו הצפנה למשתמש GitHub, מה שהופך אותו לרב-שימושי לצרכי הצפנה שונים.״"
    ],
    "commentSummary": [
      "״Age הוא כלי הצפנת קבצים מודרני ובטוח וספריית Go, שזוכה לשבחים על פשטותו ויכולת ההרכבה שלו.״",
      "משתמשים משווים את Age לכלים מבוססים כמו GPG/PGP ו-jq, ודנים בפוטנציאל שלו כתקן יוניקס.",
      "בעוד ש-Age מוערך בשל קלות השימוש שלו ושיטות ההצפנה המודרניות, ישנם משתמשים שמציינים כי הוא חסר תכונות כמו חתימה, ואלטרנטיבות כמו Kryptor מוזכרות עבור תכונות אבטחה נוספות."
    ],
    "points": 228,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1722811359
  },
  {
    "id": 41162311,
    "title": "יצירות האמנות האבודות של אנדי וורהול שנעשו על מחשב אמיגה נמצאו",
    "originLink": "https://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41162311",
    "commentBody": "",
    "originSummary": [
      "״האמנות הדיגיטלית האבודה של אנדי וורהול שנוצרה על ה-Amiga 1000 בשנת 1985 צצה מחדש לאחר 39 שנים וכעת מוצעת למכירה.״",
      "״התגלית כוללת דיוקן מפורסם של דבי הארי ומדגישה את הניסויים של וורהול בטכניקות דיגיטליות, למרות הקשיים שלו בשימוש במחשב.״",
      "״ההופעה המחודשת הזו מדגישה את יכולות הגרפיקה המתקדמות של ה-Amiga 1000 ומסמנת רגע משמעותי בצומת של אמנות וטכנולוגיה.״"
    ],
    "commentSummary": [
      "יצירות האמנות הדיגיטליות האבודות של אנדי וורהול שנוצרו על מחשב אמיגה נמצאו, כולל דיסקט חתום עם שמונה תמונות.",
      "התגלית מדגישה את אריכות הימים של תקליטונים כאמצעי אחסון, כאשר חלקם מחזיקים מעמד כמעט 40 שנה.",
      "הממצא משמעותי בשל השפעתו של וורהול על האמנות והתרבות המודרנית, מה שהופך אותו לאירוע בולט הן לחובבי האמנות והן לחובבי הטכנולוגיה."
    ],
    "points": 215,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1722872010
  },
  {
    "id": 41159680,
    "title": "בטא של Apple Intelligence סימנה דוא\"ל פישינג כ\"עדיפות\"",
    "originLink": "https://social.panic.com/@cabel/112905175504595751",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159680",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "בטא של Apple Intelligence סימנה בטעות דוא\"ל פישינג כ\"עדיפות\", מה שהעלה חששות לגבי האמינות של בינה מלאכותית בסינון דוא\"ל.",
      "התקרית מדגישה את הפגיעות של מערכות בינה מלאכותית לטעויות, שעלולות להגדיל את הסיכון שמשתמשים יפלו קורבן להונאות פישינג.",
      "״הדיון מדגיש את הצורך בספקנות וערנות כאשר מסתמכים על בינה מלאכותית למשימות קריטיות, שכן הבינה המלאכותית אינה חסינה מטעויות ויכולה לבצע טעויות משמעותיות.״"
    ],
    "points": 202,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1722852724
  },
  {
    "id": 41156104,
    "title": "נקודת המבט של Puget Systems על בעיות חוסר היציבות של מעבדי אינטל",
    "originLink": "https://www.pugetsystems.com/blog/2024/08/02/puget-systems-perspective-on-intel-cpu-instability-issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156104",
    "commentBody": "",
    "originSummary": [
      "מעבדי אינטל Core מהדור ה-13 וה-14 למחשבים שולחניים חווים בעיות יציבות, ככל הנראה עקב התדרדרות פיזית, כאשר חלק מהדיווחים מצביעים על שיעורי כשל גבוהים עד 50%.",
      "Intel מתכננת לשחרר תיקון מיקרוקוד עד אמצע אוגוסט כדי למנוע התדרדרות נוספת, אם כי הוא לא יתקן נזק קיים.",
      "פוג'ט סיסטמס חוותה פחות בעיות בזכות הגישה השמרנית שלה לניהול צריכת חשמל ומתכננת לאמת את העדכון של אינטל, להאריך את האחריות ולשדרג לקוחות מושפעים אם יהיה צורך."
    ],
    "commentSummary": [
      "פוג'ט סיסטמס מדווחת על שיעור כשל של 2-4% במעבדי אינטל, שאותו חלק מהמשתמשים רואים כגבוה, כאשר הכשלים קשורים לעיתים קרובות להמהרה או לדגמים ספציפיים כמו ה-AMD Ryzen 5950x.",
      "בעיות המעבד האחרונות של אינטל מיוחסות לשגיאות בייצור, והגדרות לוח אם אגרסיביות עלולות להחמיר את הבעיה.",
      "נתונים מצביעים על שיעורי כשל גבוהים יותר של מעבדים במרכזי נתונים ובמהלך חודשי הקיץ, מה שמדגיש את המורכבות באבחון כשלים ואת ההשפעה של אוברקלוקינג וגורמים סביבתיים."
    ],
    "points": 171,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1722803270
  },
  {
    "id": 41157192,
    "title": "חשיפת קטעים של אוריפידס היא 'עניין די גדול'",
    "originLink": "https://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157192",
    "commentBody": "",
    "originSummary": [
      "מלומדי הקלאסיקה של אוניברסיטת קולורדו בולדר גילו קטעים חדשים ומשמעותיים משתי טרגדיות אבודות של המחזאי היווני אוריפידס.",
      "״הקטעים, מהמחזות פולידוס ואינו, זוהו לאחר חודשים של מחקר על ידי יבונה טרנקה-אמריין וג'ון גיברט.״",
      "תגלית זו, הנחשבת למשמעותית ביותר ביותר מחמישים שנה, תוצג בסימפוזיון המזרקה התשיעי בקמפוס CU Boulder."
    ],
    "commentSummary": [
      "מלומדים גילו קטעים חדשים מיצירותיו של המחזאי היווני הקדום אוריפידס, שזהו גילוי משמעותי בתחום הקלאסיקה.",
      "יתרה מזאת, החלק העליון של פסל ענק של פרעה רעמסס השני התגלה בהרמופוליס מגנה, מה שהוסיף להתרגשות בחוגים הארכיאולוגיים.",
      "התגלית עוררה דיונים והתלהבות בקרב חוקרים וחובבים, והדגישה את העניין המתמשך והחשיבות של טקסטים ופריטים עתיקים."
    ],
    "points": 168,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722816693
  },
  {
    "id": 41156474,
    "title": "יכולת הסידור מחדש הלא כל כך אינסופית של Cortex A73",
    "originLink": "https://chipsandcheese.com/2024/08/04/cortex-a73s-not-so-infinite-reordering-capacity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156474",
    "commentBody": "",
    "originSummary": [
      "Cortex A73 מתמודד עם בעיות כוח ותרמיות בליבות ה-64 ביט המוקדמות של Arm, תוך התמקדות ביעילות ובשוק מעבדי הסמארטפונים.",
      "״מנגנון פרישה ייחודי מחוץ לסדר מאפשר למעבד לחשב תוצאות מבלי להמתין לאישור ביצוע ההוראות, תוך שמירה על האשליה של ביצוע בסדר.״",
      "״ה-A73 יכול להתמודד עם 50 עומסים בטיסה אך רק עם 11 חנויות בטיסה לאחר ענף לא פתור, מה שמראה נסיגה מה-A72, אך הוא משיג ביצועים תחרותיים בהספק נמוך יותר על ידי איזון בין IPC (הוראות למחזור) ומהירות שעון.״"
    ],
    "commentSummary": [
      "״הדיון סובב סביב יכולת הסידור מחדש של Cortex A73 ומושגים שונים בארכיטקטורת מעבדים, כולל הקצאת רישומים וביצוע מחוץ לסדר (OoO).״",
      "״נקודות מפתח כוללות את הרעיון של שילוב יחידות לוגיקה אריתמטית (ALUs) עם רשומות כדי להפחית את הצורך ביציאות קריאה/כתיבה, ואת האתגרים של שינוי שמות רשומות והעברת אופרנדים במעבדים מודרניים.״",
      "השיחה נוגעת גם בארכיטקטורות חלופיות כמו ארכיטקטורת Mill ועיבוד בזיכרון, ומדגישה חידושים ודיונים מתמשכים בעיצוב מעבדים."
    ],
    "points": 167,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722807000
  },
  {
    "id": 41156568,
    "title": "זירו חרטות: משתמש כבד של פיירפוקס שמר על 7,500 כרטיסיות פתוחות במשך שנתיים",
    "originLink": "https://www.techspot.com/news/102871-zero-regrets-firefox-power-user-kept-7500-tabs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156568",
    "commentBody": "",
    "originSummary": [
      "״מהנדסת תוכנה בשם הייזל הצליחה לשמור על כמעט 7,500 כרטיסיות פתוחות בפיירפוקס במשך שנתיים, מה שמדגים את יכולתו של הדפדפן להתמודד עם שימוש נרחב בכרטיסיות.״",
      "״למרות בעיות ראשוניות, הייזל שחזרה את הכרטיסיות שלה באמצעות מטמון הפרופיל של פיירפוקס, כאשר קובץ המושב היה רק בסביבות 70MB, מה שמעיד על השפעה מינימלית על הזיכרון.״",
      "Mozilla אישרה כי פתיחת כמות רבה של כרטיסיות צורכת \"כמעט ולא זיכרון\" והכריזה על כלים לניהול כרטיסיות שצפויים להגיע מאוחר יותר ב-2024, לשיפור חוויית המשתמש."
    ],
    "commentSummary": [
      "״משתמש פיירפוקס שמר על 7,500 כרטיסיות פתוחות במשך שנתיים, תוך שימוש בהן כצורת היסטוריה וסימניות, מה שמדגיש נוהג נפוץ בקרב משתמשים.״",
      "״דפדפנים הסתגלו על ידי פריקת כרטיסיות לא פעילות לניהול שימוש בזיכרון, ותוספים כמו \"Tab Session Manager\" ו-\"OneTab\" מסייעים בניהול מספר רב של כרטיסיות.״",
      "״ישנה הצעה למזג כרטיסיות, היסטוריה, סימניות וקבוצות כרטיסיות לתכונה אחת כדי לייעל את חוויית המשתמש ולשפר את היעילות.״"
    ],
    "points": 143,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1722808318
  },
  {
    "id": 41157605,
    "title": "מניות יפן צונחות עד 7% כאשר מניות אסיה ממשיכות במכירה",
    "originLink": "https://www.cnbc.com/2024/08/05/asia-markets.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157605",
    "commentBody": "",
    "originSummary": [
      "מדד הניקיי של יפן חווה את היום הגרוע ביותר מאז התרסקות יום שני השחור ב-1987, כשהוא צנח ב-12.4% ומחק את כל הרווחים של השנה.",
      "״הין זינק לרמתו הגבוהה ביותר מול הדולר מאז ינואר, בעוד שמדד טופיקס ירד ב-12.23%, ובתי מסחר גדולים כמו מיצובישי ומיצוי ספגו הפסדים משמעותיים.״",
      "גם מדדי קוספי וקוסדאק של דרום קוריאה חוו ירידות חדות, וירדו ב-8.77% ו-11.3% בהתאמה, מה שהפעיל מנגנוני עצירת מסחר; המשקיעים עוקבים מקרוב אחר נתוני הסחר הקרובים מסין וטאיוואן, והחלטות הבנקים המרכזיים מאוסטרליה והודו."
    ],
    "commentSummary": [
      "מדדי המניות ביפן ירדו בעד 7% כחלק ממכירה רחבה יותר בשווקים האסייתיים, בהשפעת העלאת הריבית האחרונה של 0.25% על ידי הבנק של יפן.",
      "העלאת הריבית הובילה לין חזק יותר, מה שפגע ביצואנים היפנים ותרם לאי יציבות בשוק.",
      "המצב עורר ויכוחים על שינוי פוטנציאלי במדיניות הכלכלית של יפן, תוך התמקדות רבה יותר ברווחת הציבור ולא ברווחי התאגידים."
    ],
    "points": 127,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1722823461
  },
  {
    "id": 41159372,
    "title": "מדד ניקיי של יפן רשם את הירידה היומית הגדולה ביותר מאז 1987 לאחר נתונים חלשים מארה\"ב",
    "originLink": "https://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159372",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "מדד הניקיי של יפן חווה את הירידה היומית הגדולה ביותר מאז 1987, בעקבות נתונים כלכליים חלשים מארצות הברית והעלאת ריבית על ידי הבנק של יפן.",
      "״המכירה ההמונית במניות הובילה לעלייה ביין, מה שהשפיע על מסחר ההשקעות וגרם לחששות בקרב המשקיעים לגבי תנודתיות השוק ואי היציבות הכלכלית.״",
      "בעוד שחלק מהמשקיעים רואים בכך הזדמנות קנייה, אחרים מודאגים מההשלכות הרחבות יותר על השווקים הגלובליים."
    ],
    "points": 102,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1722848748
  }
]
