[
  {
    "id": 41157974,
    "title": "ஹாஸ்பிஸ் தொடங்குதல்",
    "originLink": "https://jakeseliger.com/2024/08/04/starting-hospice-the-end/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Jake Seliger, Hacker News இல் எழுத்தாளர், தன்னுடைய ஹாஸ்பிஸ் பராமரிப்பில் நுழையும்போது, சமூகத்தின் ஆதரவுக்கு நன்றி தெரிவித்து, ஒரு மனமார்ந்த விடைபெறலை பகிர்ந்துள்ளார்.",
      "அவரது மனைவியும் சகோதரரும் சுற்றி நிற்க, ஜேக் முடிவுகளின் தவிர்க்க முடியாத தன்மையைப் பற்றி சிந்தித்தார், 'லார்ட் ஆஃப் த ரிங்ஸ்' படத்தில் இருந்து காந்தால்ஃப் கூறியதை மேற்கோள் காட்டினார்.",
      "பல பயனர்கள் அனுதாபம், பாராட்டு மற்றும் நன்றி தெரிவிக்கும் செய்திகளுடன் பதிலளித்தனர், தனிப்பட்ட கதைகளை பகிர்ந்து கொண்டு ஜேக் எழுத்துக்கள் தங்கள் வாழ்க்கையை எவ்வாறு பாதித்துள்ளன என்பதை வெளிப்படுத்தினர்."
    ],
    "points": 639,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1722828953
  },
  {
    "id": 41159063,
    "title": "விளையாட்டுகளை கொல்லாதீர்கள்",
    "originLink": "https://eci.ec.europa.eu/045/public/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159063",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஐரோப்பிய பயனர்கள் Change.org மனுக்களை விட அதிக பயனுள்ளதாகக் கருதப்படும், விளையாட்டுகளை நிறுத்துவதைத் தடுக்க நோக்கமாகக் கொண்ட அதிகாரப்பூர்வ EU மனுவில் கையொப்பமிட ஊக்கப்படுத்தப்படுகிறார்கள்.",
      "விமர்சகர்கள், மனுவின் பரந்த அளவினாலும், குறிப்பிட்ட நுகர்வோர் பாதுகாப்பு நடவடிக்கைகள் இல்லாமையாலும், இது நடைமுறை மாற்றங்களுக்கு வழிவகுக்காது என்று வாதிடுகின்றனர், உதாரணமாக, விளையாட்டுகளை 'விளையாடக்கூடிய நிலை'யில் பராமரிப்பது மற்றும் EULA/ToS ஒப்பந்தங்களின் அமலாக்கத்தின்மை போன்றவை.",
      "விளையாட்டு கொள்முதல்களும் நுகர்வோர் உரிமைகளும் குறித்த தெளிவான தகவல்களை வழங்குவதில் ஒழுங்குமுறை அல்லது சந்தை தீர்வுகள் எது சிறந்தது என்பதில் தொடர்ந்த விவாதம் உள்ளது."
    ],
    "points": 432,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1722845211
  },
  {
    "id": 41156872,
    "title": "வெப்ஜிபியூ நிரலாக்கம் பற்றிய இலவச மின்புத்தகம்",
    "originLink": "https://shi-yan.github.io/webgpuunleashed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156872",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் கிராபிக்ஸ்/வெப் ஜிபியூ நிரலாக்கத்தை மையமாகக் கொண்டு ஒரு மின்புத்தகத்தை வெளியிட்டுள்ளார், இந்த துறையில் ஆர்வமுள்ளவர்களுக்கு ஒரு முக்கியமான வளமாகும்.",
      "திட்டத்தில் கற்றல் அனுபவத்தை மேம்படுத்தும் குறியீட்டு விளையாட்டு மைதானம் மற்றும் நிலையான தள உருவாக்கி போன்ற கூடுதல் கருவிகள் அடங்கும்.",
      "சோர்வு மற்றும் புத்தகம் முழுமையற்றதாக உணரப்படுவது போன்ற சவால்கள் இருந்தபோதிலும், திட்டத்தை கைவிடாமல் இருக்க அதை வெளியிட முடிவு செய்தார் ஆசிரியர்."
    ],
    "commentSummary": [
      "ஒரு கிராபிக்ஸ்/வெப் ஜிபியூ நிரலாக்கம் பற்றிய மின்புத்தகம் வெளியிடப்பட்டுள்ளது, இதில் குறியீட்டு விளையாட்டு மைதானம் மற்றும் நிலையான தள உருவாக்கி போன்ற கருவிகள் இடம்பெற்றுள்ளன.",
      "WebGPU, எதிர்கால மேம்பாடுகள் மற்றும் பல்வகை பயன்பாடுகளுக்கு வாக்குறுதி அளிக்கின்றபோதிலும், தற்போதைய நிலைமையில் WebGL-ஐ ஒப்பிடுகையில் செயல்திறன் சிக்கல்களை எதிர்கொள்கிறது.",
      "வலைப்பக்கங்கள் மற்றும் அமைப்புகளுடன் தொடர்புடைய சவால்களை சமாளிக்க webgpufundamentals.org மற்றும் Rust க்கான learn-wgpu போன்ற வளங்கள் பரிந்துரைக்கப்படுகின்றன."
    ],
    "points": 381,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722812182
  },
  {
    "id": 41159180,
    "title": "போஸ்ட்கிரெஸ் டிஸ்கில் தரவுகளை எவ்வாறு சேமிக்கிறது – இது ஒரு பக்கத்தை திருப்பும்",
    "originLink": "https://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159180",
    "commentBody": "",
    "originSummary": [
      "இந்த பதிவின் நோக்கம் தரவுத்தொகுப்பு இயந்திரங்களை தெளிவுபடுத்துவது, குறிப்பாக டெவலப்பர்களிடையே பிரபலமான PostgreSQL மீது கவனம் செலுத்துவது.",
      "இது PostgreSQL தரவுகளை வட்டு (disk) மீது எவ்வாறு சேமிக்கிறது என்பதை விளக்குகிறது, தரவுக் கோப்பகத்தின் உள்ளே உள்ள பல்வேறு கோப்பகங்கள் மற்றும் கோப்புகளின் அமைப்பு மற்றும் நோக்கத்தை விவரிக்கிறது.",
      "முக்கிய கருத்துக்கள், பல பதிப்பு ஒருங்கிணைப்பு கட்டுப்பாடு (MVCC), குவியல் சேமிப்பு, மற்றும் தரவுத்தொகுப்பை ஆய்வு செய்ய பக்க ஆய்வு நீட்டிப்பின் பயன்பாடு ஆகியவை விவாதிக்கப்படுகின்றன, இது தரவுத்தொகுப்பு செயல்திறனை புரிந்து கொள்ளவும், மேம்படுத்தவும் உதவுகிறது."
    ],
    "commentSummary": [
      "இந்த பதிவில் PostgreSQL எவ்வாறு தரவுகளை வட்டு (disk) மீது சேமிக்கிறது என்பதை ஆராய்கிறது, பக்க சேமிப்பு மற்றும் TOAST (The Oversized-Attribute Storage Technique) உட்பட உள்ளகக் கருவிகளை விரிவாக விளக்குகிறது.",
      "இது PostgreSQL இன் Write-Ahead Logging (WAL) மற்றும் logical decoding ஐப் புரிந்து கொள்வதின் முக்கியத்துவத்தை வலியுறுத்துகிறது, அவை தரவுகளை மீட்டெடுப்பதற்கும் நகலெடுப்பதற்கும் முக்கியமானவை.",
      "இந்த விவாதத்தில் MySQL இன் InnoDB போன்ற பிற தரவுத்தொகுப்பு அமைப்புகளுடன் ஒப்பீடுகள் அடங்கும் மற்றும் Apache Arrow மற்றும் Parquet போன்ற மாற்று சேமிப்பு வடிவங்களை குறிப்பிடுகிறது, இவை தரவுப் பகுப்பாய்வு மற்றும் சேமிப்பு மேம்பாட்டிற்கு தொடர்புடையவை."
    ],
    "points": 333,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1722846505
  },
  {
    "id": 41157494,
    "title": "நான் 2024 இல் எப்படி நிரலாக்குகிறேன்",
    "originLink": "http://akkartik.name/post/programming-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157494",
    "commentBody": "",
    "originSummary": [
      "2015 முதல் 2024 வரை தங்களின் மாறிவரும் நிரலாக்க நடைமுறைகளைப் பற்றி எழுத்தாளர் சிந்திக்கிறார், பரிசோதனைகள் மற்றும் பதிப்பு கட்டுப்பாட்டின் மீது அதிகமாக நம்பியிருந்த நிலைமையிலிருந்து குறைந்தபட்ச அணுகுமுறைக்கு மாறியிருப்பதை குறிப்பிடுகிறார்.",
      "2024 ஆம் ஆண்டில், எழுத்தாளர் அனைத்து சோதனைகளையும் நீக்கி, பதிப்பு கட்டுப்பாடின்றி தங்கள் உரைத் தொகுப்பியை மறுசீரமைத்தார், இதனால் ஒரு சிறந்த நிரலாக்கம் உருவாகி, மென்பொருள் மேம்பாட்டைப் பற்றிய தங்கள் முந்தைய நம்பிக்கைகளை சவாலுக்கு உட்படுத்தியது.",
      "இப்போது எழுத்தாளர், தொழில்நுட்ப கடன் மற்றும் சிக்கல்களை தவிர்க்க, குறைந்த சார்புகளுடன் மற்றும் தானியங்கி புதுப்பிப்புகள் இல்லாமல் மென்பொருளை உருவாக்க, வகைகள், சுருக்கங்கள், சோதனைகள் மற்றும் பதிப்புகளை குறைவாக பயன்படுத்தும் கருவிகளைப் பயன்படுத்துவதற்காக வலியுறுத்துகிறார்."
    ],
    "commentSummary": [
      "2024 ஆம் ஆண்டில், ஒரு நிரலாளர் தங்கள் சோதனைகள் மற்றும் பதிப்பு கட்டுப்பாட்டை கைவிட்ட அனுபவத்தை பகிர்ந்து கொண்டார், இது அவர்களின் நிரலை மேம்படுத்தியது என்று கூறினார்.",
      "அவர்கள் சோதனைகள் பிழைகளை வெளிப்படுத்துகின்றன ஆனால் அவற்றின் இல்லாமையை உறுதிப்படுத்தவில்லை, மேலும் பதிப்பு கட்டுப்பாடு ஒருவரை கடந்தகாலத்துடன் இணைக்க வைத்திருக்கலாம், ஆனால் இந்த அணுகுமுறை பெரிய குழுக்கள் அல்லது சிக்கலான திட்டங்களுக்கு பொருந்தாது என்று வாதிட்டனர்.",
      "இந்த விவாதம் பாரம்பரிய நடைமுறைகள் மற்றும் தனிப்பட்ட உற்பத்தித்திறன் ஆகியவற்றின் சமநிலையை வலியுறுத்துகிறது, சோதனைகள் மற்றும் பதிப்பு கட்டுப்பாட்டின் அவசியம் குறித்து கருத்துக்கள் பிளவுபட்டுள்ளன."
    ],
    "points": 299,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1722821319
  },
  {
    "id": 41157595,
    "title": "உயரமான லெகோ கோபுரங்களை அழிக்க லெகோ இயந்திரங்களை கட்டுதல்",
    "originLink": "https://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157595",
    "commentBody": "",
    "originSummary": [
      "Brick Technology இன் புதிய வீடியோவில் உயரமான Lego கோபுரங்களை இடிக்க வல்ல Lego இயந்திரங்களை வடிவமைத்துள்ளதை காணலாம், இது அறிவியல், பொறியியல் மற்றும் முயற்சி மற்றும் தவறுகளின் மீள்பார்வை செயல்முறையை முக்கியமாகக் காட்டுகிறது.",
      "வீடியோவில் இந்தக் கொள்கைகளை எந்தவொரு படைப்பாற்றல் முயற்சிக்கும் பயன்படுத்துவது பற்றி விளக்கப்படுகிறது, சிக்கலான பொறியியல் கருத்துக்களை எளிதாகவும் ஈர்க்கக்கூடியவையாகவும் மாற்றுகிறது.",
      "வீடியோவில் கருத்திலிருந்து செயலாக்கம் வரை வேகமாக முன்னேறுவது பார்வையாளர்களை லெகோ டெக்னிக் மற்றும் மைண்ட்ஸ்டார்ம்ஸ் கிட்களைத் தாங்களே பரிசோதிக்க ஊக்குவிக்கலாம்."
    ],
    "commentSummary": [
      "இந்த பதிவு உயரமான லெகோ கோபுரங்களை அழிக்க வடிவமைக்கப்பட்ட லெகோ இயந்திரங்களை உருவாக்குவது பற்றி பேசுகிறது, இதில் உள்ள படைப்பாற்றல் மற்றும் பொறியியல் திறன்களை முக்கியமாகக் குறிப்பிடுகிறது.",
      "இது பல்வேறு யூடியூப் சேனல்கள் மற்றும் படைப்பாளிகளை குறிப்பிடுகிறது, உதாரணமாக அகியுகி மற்றும் யோஷிஹிடோ இசோகாவா, அவர்கள் தங்களின் சிக்கலான லெகோ கருவிகள் மற்றும் லெகோ சமூகத்திற்கு அளித்த பங்களிப்புகளுக்காக அறியப்படுகிறார்கள்.",
      "சர்ச்சை பிளாஸ்டிக் பொம்மைகளின் சுற்றுச்சூழல் பாதிப்பையும் குறிப்பிடுகிறது, சில பயனர்கள் மர கட்டுமான பொம்மைகள் போன்ற மாற்றுகளை பரிந்துரைக்கின்றனர், அவை அதிக விலையுள்ளவை என்றாலும்."
    ],
    "points": 232,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1722823340
  },
  {
    "id": 41156793,
    "title": "வயது என்பது ஒரு எளிய, நவீன மற்றும் பாதுகாப்பான கோப்பு குறியாக்க கருவி, வடிவம் மற்றும் கோ லைப்ரரி ஆகும்",
    "originLink": "https://github.com/FiloSottile/age",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156793",
    "commentBody": "",
    "originSummary": [
      "வயது என்பது ஒரு நவீன, பாதுகாப்பான கோப்பு குறியாக்க கருவி மற்றும் Go நூலகம் ஆகும், இது சிறிய வெளிப்படையான விசைகள், எந்த கட்டமைப்பு விருப்பங்களும் இல்லாமல், மற்றும் UNIX-பாணி இணக்கத்தன்மையை கொண்டுள்ளது.",
      "இது பல்வேறு நிறுவல் முறைகளை பல்வேறு இயக்க முறைமைகளில் ஆதரிக்கிறது, இதில் Homebrew, MacPorts, மற்றும் லினக்ஸ் விநியோகங்கள் மற்றும் விண்டோஸிற்கான தொகுப்பு மேலாளர்கள் அடங்கும்.",
      "வயது YubiKeys போன்ற ஹார்ட்வேர் PIV டோக்கன்கள், கடவுச்சொல் பாதுகாக்கப்பட்ட கோப்புகள், SSH விசைகள், மற்றும் GitHub பயனருக்கு குறியாக்கம் செய்வது போன்றவற்றை ஆதரிக்கிறது, இது பல்வேறு குறியாக்க தேவைகளுக்கு பல்துறை பயன்பாட்டை உருவாக்குகிறது."
    ],
    "commentSummary": [
      "வயது என்பது ஒரு நவீன, பாதுகாப்பான கோப்பு குறியாக்க கருவி மற்றும் Go நூலகம் ஆகும், இது அதன் எளிமை மற்றும் சேர்க்கக்கூடிய தன்மைக்காக பாராட்டப்படுகிறது.",
      "பயனர்கள் Age ஐ நிறுவப்பட்ட கருவிகள் போன்ற GPG/PGP மற்றும் jq உடன் ஒப்பிடுகின்றனர், இதன் யுனிக்ஸ் தரமாகும் சாத்தியத்தைப் பற்றி விவாதிக்கின்றனர்.",
      "Age அதன் எளிமையான பயன்பாடு மற்றும் நவீன குறியாக்க நடைமுறைகளுக்காக பாராட்டப்படுகிறது, சில பயனர்கள் கையொப்பம் போடுதல் போன்ற அம்சங்கள் இல்லாததை குறிப்பிடுகின்றனர், மேலும் கூடுதல் பாதுகாப்பு அம்சங்களுக்காக Kryptor போன்ற மாற்றுகள் குறிப்பிடப்படுகின்றன."
    ],
    "points": 228,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1722811359
  },
  {
    "id": 41162311,
    "title": "ஆண்டி வார்ஹோலின் காணாமல் போன அமிகா கலை கண்டுபிடிக்கப்பட்டது",
    "originLink": "https://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41162311",
    "commentBody": "",
    "originSummary": [
      "Andy Warhol இன் 1985 ஆம் ஆண்டில் Amiga 1000 இல் உருவாக்கப்பட்ட இழந்த டிஜிட்டல் கலை 39 ஆண்டுகளுக்குப் பிறகு மீண்டும் வெளிப்பட்டுள்ளது மற்றும் இப்போது விற்பனைக்கு உள்ளது.",
      "கண்டுபிடிப்பு டெபி ஹாரியின் பிரபலமான ஓவியத்தை உள்ளடக்கியது மற்றும் கம்ப்யூட்டர் பயன்பாட்டில் அவரது போராட்டங்களையும் பொருட்படுத்தாமல், வார்ஹோலின் டிஜிட்டல் நுட்பங்களுடன் செய்த பரிசோதனைகளை வெளிப்படுத்துகிறது.",
      "இந்த மறுபிறப்பு Amiga 1000 இன் மேம்பட்ட கிராபிக்ஸ் திறன்களை வலியுறுத்துகிறது மற்றும் கலை மற்றும் தொழில்நுட்பத்தின் சந்திப்பில் ஒரு முக்கிய தருணத்தை குறிக்கிறது."
    ],
    "commentSummary": [
      "ஆண்டி வார்ஹோலின் அமிகா கணினியில் உருவாக்கப்பட்ட இழந்த டிஜிட்டல் கலைகள் கண்டுபிடிக்கப்பட்டுள்ளன, இதில் எட்டு படங்களுடன் கையொப்பமிட்ட ஃப்ளாப்பி டிஸ்க் அடங்கும்.",
      "இந்த கண்டுபிடிப்பு, சிலவற்றின் ஆயுட்காலம் 40 ஆண்டுகளுக்கு அருகில் இருக்கும் நிலையில், சேமிப்பு ஊடகமாக பிளாப்பி டிஸ்க்குகளின் நீடித்த தன்மையை வெளிப்படுத்துகிறது.",
      "Warhol இன் நவீன கலை மற்றும் கலாச்சாரத்தின் மீது உள்ள தாக்கம் காரணமாக இந்த கண்டுபிடிப்பு முக்கியமானது, இது கலை மற்றும் தொழில்நுட்ப ஆர்வலர்களுக்கு குறிப்பிடத்தக்க நிகழ்வாகும்."
    ],
    "points": 215,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1722872010
  },
  {
    "id": 41159680,
    "title": "ஆப்பிள் இன்டெலிஜென்ஸ் பீட்டா ஒரு பிஷிங் மின்னஞ்சலை \"முக்கியம்\" எனக் குறித்தது",
    "originLink": "https://social.panic.com/@cabel/112905175504595751",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159680",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Apple Intelligence பீட்டா தவறுதலாக ஒரு பிஷிங் மின்னஞ்சலை 'முக்கியம்' எனக் குறித்தது, மின்னஞ்சல் வடிகட்டலில் AI இன் நம்பகத்தன்மை குறித்து கவலைகளை எழுப்பியது.",
      "இந்த சம்பவம் ஏஐ அமைப்புகள் பிழைகளுக்கு எவ்வளவு பாதிக்கப்படக்கூடியவை என்பதை வெளிப்படுத்துகிறது, இது பயனர்கள் பிஷிங் மோசடிகளுக்கு ஆளாகும் அபாயத்தை அதிகரிக்கக்கூடும்.",
      "சர்ச்சை, முக்கிய பணிகளுக்காக AI மீது நம்பிக்கை வைக்கும் போது சந்தேகம் மற்றும் விழிப்புணர்வு தேவை என்பதை வலியுறுத்துகிறது, ஏனெனில் AI தவறாதது அல்ல மற்றும் முக்கியமான தவறுகளை செய்யக்கூடும்."
    ],
    "points": 202,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1722852724
  },
  {
    "id": 41156104,
    "title": "ப்யூஜெட் சிஸ்டம்ஸ்' பார்வையில் இன்டெல் சிபியூ நிலைத்தன்மை பிரச்சினைகள்",
    "originLink": "https://www.pugetsystems.com/blog/2024/08/02/puget-systems-perspective-on-intel-cpu-instability-issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156104",
    "commentBody": "",
    "originSummary": [
      "Intel Core 13th மற்றும் 14th Gen டெஸ்க்டாப் செயலிகள் நிலைத்தன்மை பிரச்சினைகளை எதிர்கொண்டு வருகின்றன, இது உடல் சேதமடைதலால் இருக்கக்கூடும், சில தோல்வி விகிதங்கள் 50% வரை அதிகமாக உள்ளதாக தெரிவிக்கப்பட்டுள்ளது.",
      "Intel, தற்போதுள்ள சேதத்தை திருப்பி விடாது என்றாலும், மேலும் சேதத்தைத் தடுக்க ஆகஸ்ட் மாத நடுப்பகுதிக்குள் மைக்ரோ கோடு திருத்தத்தை வெளியிட திட்டமிட்டுள்ளது.",
      "Puget Systems தங்கள் பாதுகாப்பான மின்சார மேலாண்மை அணுகுமுறையால் குறைவான பிரச்சினைகளை சந்தித்துள்ளது மற்றும் Intel இன் புதுப்பிப்பை சரிபார்க்க, உத்தரவாதங்களை நீட்டிக்க, மற்றும் தேவையானால் பாதிக்கப்பட்ட வாடிக்கையாளர்களை மேம்படுத்த திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "Puget Systems Intel CPU களில் 2-4% தோல்வி விகிதத்தைப் புகாரளிக்கின்றது, சில பயனர்கள் இதை அதிகமாகக் கருதுகின்றனர், தோல்விகள் பெரும்பாலும் ஓவர்க்ளாக்கிங் அல்லது AMD Ryzen 5950x போன்ற குறிப்பிட்ட மாதிரிகளுடன் தொடர்புடையவை.",
      "Intel இன் சமீபத்திய CPU பிரச்சினைகள் உற்பத்தி பிழைகளால் ஏற்படுகின்றன, மேலும் ஆக்கிரமிப்பு மடர்போர்டு அமைப்புகள் பிரச்சினையை மேலும் மோசமாக்கலாம்.",
      "தரவு மையங்களில் மற்றும் கோடை மாதங்களில் CPU தோல்வி விகிதங்கள் அதிகமாக இருப்பதை தரவுகள் காட்டுகின்றன, இது தோல்விகளை கண்டறிதல் சிக்கல்களை மற்றும் ஓவர்க்ளாக்கிங் மற்றும் சுற்றுச்சூழல் காரணிகள் ஆகியவற்றின் தாக்கத்தை வலியுறுத்துகிறது."
    ],
    "points": 171,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1722803270
  },
  {
    "id": 41157192,
    "title": "கண்டுபிடிக்கப்பட்ட யூரிபிட்ஸ் துணுக்குகள் 'ஒரு பெரிய விஷயமாகும்'",
    "originLink": "https://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157192",
    "commentBody": "",
    "originSummary": [
      "CU பவுல்டர் க்ளாசிக்ஸ் அறிஞர்கள் கிரேக்க நாடக ஆசிரியர் யூரிபிடீஸ் எழுதிய இரண்டு இழந்த துயர நாடகங்களின் முக்கியமான புதிய துண்டுகளை கண்டுபிடித்துள்ளனர்.",
      "பொலிடஸ் மற்றும் இனோ நாடகங்களிலிருந்து உள்ள துண்டுகள், ய்வோனா ட்ர்ன்கா-அம்ரெய்ன் மற்றும் ஜான் கிபர்ட் ஆகியோரால் மாதங்கள் நீண்ட ஆய்வுக்குப் பிறகு அடையாளம் காணப்பட்டன.",
      "இந்த கண்டுபிடிப்பு, ஐம்பது ஆண்டுகளில் மிக முக்கியமானதாகக் கருதப்படுகிறது, CU பவுல்டர் வளாகத்தில் நடைபெறும் ஒன்பதாவது ஃபவுண்டன்_symposium இல் வழங்கப்படும்."
    ],
    "commentSummary": [
      "ஆய்வாளர்கள் பண்டைய கிரேக்க நாடக ஆசிரியர் யூரிபிடீஸின் படைப்புகளின் புதிய துண்டுகளை கண்டுபிடித்துள்ளனர், இது க்ளாசிக்ஸ் துறையில் முக்கியமான கண்டுபிடிப்பாகும்.",
      "மேலும், பெரும் ஆராய்ச்சி வட்டாரங்களில் பரபரப்பை ஏற்படுத்தியபடி, பெரும் பிரமாண்டமான புறா ராமேசஸ் II இன் மேல் பாதி சிலை ஹெர்மோபொலிஸ் மக்னாவில் கண்டுபிடிக்கப்பட்டது.",
      "இந்த கண்டுபிடிப்பு அறிஞர்கள் மற்றும் ஆர்வலர்களிடையே விவாதங்களையும் உற்சாகத்தையும் ஏற்படுத்தியுள்ளது, பழமையான உரைகள் மற்றும் பொருட்களின் தொடர்ந்த ஆர்வத்தையும் முக்கியத்தையும் வெளிப்படுத்துகிறது."
    ],
    "points": 168,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722816693
  },
  {
    "id": 41156474,
    "title": "கோர்டெக்ஸ் A73 இன் அளவில்லாத மறுவரிசை திறன்",
    "originLink": "https://chipsandcheese.com/2024/08/04/cortex-a73s-not-so-infinite-reordering-capacity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156474",
    "commentBody": "",
    "originSummary": [
      "கோர்டெக்ஸ் A73 ஆம்ரின் ஆரம்ப 64-பிட் கோர்களில் மின்சார மற்றும் வெப்ப சிக்கல்களை தீர்க்கிறது, திறன் மற்றும் ஸ்மார்ட்போன் சிபியூ சந்தையை மையமாகக் கொண்டு.",
      "ஒரு தனித்துவமான வரிசைமற்ற ஓய்வு முறைமை CPU-க்கு கட்டளைகள் நிறைவேற்றல் உறுதிப்படுத்தலைக் காத்திருக்காமல் முடிவுகளை கணக்கிட அனுமதிக்கிறது, வரிசைப்படி நிறைவேற்றல் தோற்றத்தை பாதுகாக்கிறது.",
      "அ A73 50 விமானத்தில் உள்ள சுமைகளை கையாள முடியும், ஆனால் தீர்க்கப்படாத கிளையின் பின்னர் 11 விமானத்தில் உள்ள கடைகளை மட்டுமே கையாள முடியும், இது A72 இல் இருந்து ஒரு பின்னடைவை காட்டுகிறது, ஆனால் இது IPC (சுழற்சிக்கு உத்தரவு) மற்றும் கடிகார வேகத்தை சமநிலைப்படுத்துவதன் மூலம் குறைந்த சக்தியில் போட்டித்திறன் கொண்ட செயல்திறனை அடைகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் Cortex A73 இன் மறுவரிசைப்படுத்தும் திறன் மற்றும் பதிவேடு ஒதுக்கீடு மற்றும் வரிசைமற்ற (OoO) செயலாக்கம் உள்ளிட்ட பல CPU கட்டமைப்பு கருத்துக்களைச் சுற்றி நடக்கிறது.",
      "முக்கிய அம்சங்களில் Arithmetic Logic Units (ALUs) ஐ பதிவுகளுடன் ஒருங்கிணைப்பது மூலம் படிக்க/எழுதும் போர்ட் தேவைகளை குறைப்பது மற்றும் நவீன மைய செயலி (CPU) களில் பதிவுகளை மறுபெயரிடுதல் மற்றும் செயல்பாட்டாளர்களை முன்னோக்கி அனுப்புதல் ஆகிய சவால்கள் அடங்கும்.",
      "உரையாடல் மில் கட்டமைப்பு மற்றும் நினைவகத்தில் செயலாக்கம் போன்ற மாற்று கட்டமைப்புகளைப் பற்றியும், CPU வடிவமைப்பில் நடைபெறும் புதிய கண்டுபிடிப்புகள் மற்றும் விவாதங்களைப் பற்றியும் குறிப்பிடுகிறது."
    ],
    "points": 167,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722807000
  },
  {
    "id": 41156568,
    "title": "பூஜ்யமான வருத்தங்கள்: ஃபயர்பாக்ஸ் சக்திவாய்ந்த பயனர் இரண்டு ஆண்டுகளாக 7,500 தாவல்கள் திறந்தவாறு வைத்திருந்தார்",
    "originLink": "https://www.techspot.com/news/102871-zero-regrets-firefox-power-user-kept-7500-tabs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156568",
    "commentBody": "",
    "originSummary": [
      "ஒரு மென்பொருள் பொறியாளர் ஹேசல், இரண்டு ஆண்டுகளாக Firefox இல் சுமார் 7,500 தாவல்கள் திறந்துவைத்துக் கொண்டிருந்தார், இது பரந்த அளவிலான தாவல் பயன்பாட்டை கையாளும் உலாவியின் திறனை வெளிப்படுத்துகிறது.",
      "தொடக்கம்: ஆரம்ப சிக்கல்களை மீறி, ஹேசல் தனது டேப்களை ஃபயர்பாக்ஸ் ப்ரொஃபைல் கேஷ் பயன்படுத்தி மீட்டெடுத்தார், செஷன் கோப்பு சுமார் 70MB மட்டுமே இருந்ததால், குறைந்த நினைவக தாக்கத்தை குறிக்கிறது. முடிவு.",
      "மொசில்லா பல தாவல்கள் திறந்திருந்தால் \"வास्तவத்தில் நினைவகம் எதுவும் பயன்படுத்தாது\" என்று உறுதிப்படுத்தியது மற்றும் 2024 இல் பின்னர் எதிர்பார்க்கப்படும் தாவல் மேலாண்மை கருவிகளை அறிவித்தது, இது பயனர் அனுபவத்தை மேம்படுத்தும்."
    ],
    "commentSummary": [
      "ஒரு ஃபயர்பாக்ஸ் பயனர் இரண்டு ஆண்டுகளாக 7,500 திறந்த தாவல்கள் வைத்திருந்தார், அவற்றை வரலாறு மற்றும் புத்தகக்குறிகள் வடிவமாக பயன்படுத்தி, பயனர்களிடையே ஒரு பொதுவான நடைமுறையை வெளிப்படுத்தினார்.",
      "உலாவிகள் நினைவக பயன்பாட்டை நிர்வகிக்க செயலற்ற தாவல்களை இறக்கி விட்டு மாற்றம் அடைந்துள்ளன, மேலும் \"Tab Session Manager\" மற்றும் \"OneTab\" போன்ற நீட்டிப்புகள் பெரும் எண்ணிக்கையிலான தாவல்களை நிர்வகிக்க உதவுகின்றன.",
      "பயனர் அனுபவத்தை எளிமையாக்கவும் திறனைக் கூட்டவும், தாவல்கள், வரலாறு, புத்தகக்குறிகள் மற்றும் தாவல் குழுக்களை ஒரே அம்சமாக இணைக்க ஒரு பரிந்துரை உள்ளது."
    ],
    "points": 143,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1722808318
  },
  {
    "id": 41157605,
    "title": "ஜப்பான் பங்குகள் 7% வரை சரிந்தன, ஏசியா பங்குகள் விற்பனையை நீட்டிக்கின்றன",
    "originLink": "https://www.cnbc.com/2024/08/05/asia-markets.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157605",
    "commentBody": "",
    "originSummary": [
      "Japan's Nikkei index had its worst day since the 1987 Black Monday crash, plummeting 12.4% and wiping out all gains for the year.",
      "யென் ஜனவரியிலிருந்து டாலருக்கு எதிராக தனது உயர்ந்த நிலையை எட்டியது, இதேவேளை டோபிக்ஸ் குறியீட்டு 12.23% வீழ்ச்சி கண்டது, மேலும் மிட்சுபிஷி மற்றும் மிட்சுயி போன்ற முக்கிய வர்த்தக நிறுவனங்கள் முக்கியமான இழப்புகளை சந்தித்தன.",
      "தென் கொரியாவின் கோஸ்பி மற்றும் கோஸ்டாக் ஆகியவை 8.77% மற்றும் 11.3% வீழ்ச்சியடைந்தன, இது சுற்று முறைகளைத் தூண்டியது; முதலீட்டாளர்கள் சீனா மற்றும் தைவானிலிருந்து வரவிருக்கும் வர்த்தக தரவுகள் மற்றும் ஆஸ்திரேலியா மற்றும் இந்தியாவின் மத்திய வங்கி முடிவுகளை நெருக்கமாகக் கவனித்து வருகின்றனர்."
    ],
    "commentSummary": [
      "ஜப்பான் பங்குகள் 7% வரை சரிந்தன, இது ஆசிய சந்தைகளில் பரந்த அளவிலான விற்பனைக்கு ஒரு பகுதியாகும், ஜப்பான் வங்கியின் சமீபத்திய 0.25% வட்டி விகித உயர்வால் பாதிக்கப்பட்டது.",
      "வட்டி உயர்வு யெனை வலுப்படுத்தியுள்ளது, இது ஜப்பானிய ஏற்றுமதியாளர்களை பாதிக்கிறது மற்றும் சந்தை நிலைத்தன்மையின்மைக்கு காரணமாக உள்ளது.",
      "இந்த நிலைமை ஜப்பானின் பொருளாதார கொள்கைகளில் ஒரு възмож shift பற்றி விவாதங்களை தூண்டியுள்ளது, இது நிறுவன லாபங்களை விட பொதுமக்களின் நலனில் அதிக கவனம் செலுத்துகிறது."
    ],
    "points": 127,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1722823461
  },
  {
    "id": 41159372,
    "title": "ஜப்பானின் நிக்கெய் 1987 இல் இருந்து மிகப்பெரிய ஒரே நாளில் வீழ்ச்சியை பதிவு செய்தது, அமெரிக்காவின் பலவீனமான தரவுகளுக்குப் பிறகு",
    "originLink": "https://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159372",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Japan's Nikkei experienced its largest single-day drop since 1987, driven by weak U.S. economic data and a rate hike by the Bank of Japan.\" \"ஜப்பானின் நிக்கெய் 1987 முதல் அதன் மிகப்பெரிய ஒரே நாளில் வீழ்ச்சியை சந்தித்தது, இது அமெரிக்காவின் பலவீனமான பொருளாதார தரவுகள் மற்றும் ஜப்பான் வங்கியின் வட்டி விகித உயர்வால் ஏற்பட்டது.",
      "பங்குகளில் விற்பனை அதிகரித்ததால் யென் மதிப்பு உயர்ந்தது, இது கேரி வர்த்தகத்தை பாதித்தது மற்றும் சந்தை மாறுபாடு மற்றும் பொருளாதார நிலைத்தன்மை குறித்த முதலீட்டாளர்களின் கவலைகளை ஏற்படுத்தியது.",
      "சில முதலீட்டாளர்கள் இதை ஒரு வாங்கும் வாய்ப்பாகக் காண்கிறார்கள், மற்றவர்கள் உலக சந்தைகளுக்கான பரந்த விளைவுகளைப் பற்றி கவலைப்படுகிறார்கள்."
    ],
    "points": 102,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1722848748
  }
]
