[
  {
    "id": 41157974,
    "title": "Hospis Başlangıcı",
    "originLink": "https://jakeseliger.com/2024/08/04/starting-hospice-the-end/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157974",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Jake Seliger, Hacker News'te bir yazar, hospis bakımına girerken topluluğun desteği için minnettarlığını ifade eden duygusal bir veda paylaştı.",
      "Eşi ve kardeşi tarafından çevrelenmiş olan Jake, 'Yüzüklerin Efendisi'nden Gandalf'ı alıntı yaparak sonların kaçınılmazlığı üzerine düşündü.",
      "Birçok kullanıcı, Jake'in yazılarının hayatlarını nasıl etkilediğini paylaşarak, sempati, hayranlık ve teşekkür mesajlarıyla yanıt verdi."
    ],
    "points": 639,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1722828953
  },
  {
    "id": 41159063,
    "title": "Durdur Oyunları Öldürmeyi",
    "originLink": "https://eci.ec.europa.eu/045/public/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159063",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Avrupalı kullanıcılar, oyunların durdurulmasını önlemeyi amaçlayan resmi bir AB dilekçesini imzalamaya teşvik edilmektedir, bu Change.org dilekçelerinden daha etkili olarak kabul edilmektedir.",
      "Eleştirmenler, dilekçenin geniş kapsamı ve oyunları \"oynanabilir durumda\" tutmak ve EULA/ToS anlaşmalarının uygulanabilirliği gibi belirli tüketici koruma önlemlerinin eksikliği nedeniyle pratik değişikliklere yol açmayabileceğini savunuyorlar.",
      "Devam eden bir tartışma, oyun satın alımları ve tüketici hakları hakkında daha net bilgi sağlamak için düzenlemelerin mi yoksa piyasa çözümlerinin mi daha iyi olduğuna dair."
    ],
    "points": 432,
    "commentCount": 194,
    "retryCount": 0,
    "time": 1722845211
  },
  {
    "id": 41156872,
    "title": "WebGPU Programlama hakkında ücretsiz e-kitap",
    "originLink": "https://shi-yan.github.io/webgpuunleashed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156872",
    "commentBody": "",
    "originSummary": [
      "Yazar, bu alana ilgi duyanlar için önemli bir kaynak olan Grafikler/WebGPU programlamasına odaklanan bir e-kitap yayınladı.",
      "Proje, öğrenme deneyimini geliştiren bir kod oyun alanı ve statik site oluşturucu gibi ek araçlar içermektedir.",
      "Yazar, tükenmişlik ve kitabın eksik hissettirmesi gibi zorluklara rağmen projeyi terk etmemek için kitabı yayımlamaya karar verdi."
    ],
    "commentSummary": [
      "E-kitap, Grafik/WebGPU programlama üzerine yayınlandı ve kod oyun alanı ile statik site oluşturucu gibi araçlar içeriyor.",
      "WebGPU, gelecekteki iyileştirmeler ve çeşitli uygulamalar için umut verici olsa da, şu anda WebGL ile karşılaştırıldığında performans sorunlarıyla karşı karşıya.",
      "WebGPU belgeleri ve kurulumu ile ilgili zorlukların üstesinden gelmek için webgpufundamentals.org ve Rust için learn-wgpu gibi kaynaklar önerilmektedir."
    ],
    "points": 381,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1722812182
  },
  {
    "id": 41159180,
    "title": "Postgres verileri diskte nasıl depolar – bu tam bir sayfa çevirici",
    "originLink": "https://drew.silcock.dev/blog/how-postgres-stores-data-on-disk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159180",
    "commentBody": "",
    "originSummary": [
      "Bu gönderi, özellikle geliştiriciler arasında popüler olan PostgreSQL'e odaklanarak veritabanı motorlarını anlaşılır hale getirmeyi amaçlıyor.",
      "PostgreSQL'in verileri disk üzerinde nasıl depoladığını, veri dizini içindeki çeşitli dizinlerin ve dosyaların yapısını ve amacını ayrıntılı olarak açıklar.",
      "Veritabanı performansını anlamak ve optimize etmek için Çoklu Sürüm Eşzamanlılık Kontrolü (MVCC), yığın depolama ve veri depolamayı incelemek için pageinspect uzantısının kullanımı gibi anahtar kavramlar tartışılmaktadır."
    ],
    "commentSummary": [
      "Yazı, PostgreSQL'in verileri disk üzerinde nasıl depoladığını inceliyor ve sayfa depolama ve TOAST (Aşırı Büyük Öznitelik Depolama Tekniği) dahil olmak üzere iç mekanizmaların ayrıntılı bir açıklamasını sunuyor.",
      "Bu, veri kurtarma ve çoğaltma için kritik olan PostgreSQL'in Write-Ahead Logging (WAL) ve mantıksal kod çözümünü anlamanın önemini vurgular.",
      "Bu tartışma, MySQL'in InnoDB gibi diğer veritabanı sistemleriyle karşılaştırmaları içerir ve veri analitiği ve depolama optimizasyonu için önemli olan Apache Arrow ve Parquet gibi alternatif depolama formatlarından bahseder."
    ],
    "points": 333,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1722846505
  },
  {
    "id": 41157494,
    "title": "2024'te Nasıl Program Yapıyorum",
    "originLink": "http://akkartik.name/post/programming-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157494",
    "commentBody": "",
    "originSummary": [
      "Yazar, 2015'ten 2024'e kadar değişen programlama uygulamalarını değerlendirerek, testler ve sürüm kontrolüne olan yoğun bağımlılıktan daha minimalist bir yaklaşıma geçişi vurguluyor.",
      "2024 yılında, yazar tüm testleri sildi ve sürüm kontrolü olmadan metin düzenleyicisini yeniden düzenledi, bu da daha iyi bir programla sonuçlandı ve yazılım geliştirme konusundaki önceki inançlarını sorgulamalarına neden oldu.",
      "Yazar şimdi, teknoloji borcu ve karmaşıklıktan kaçınmak için az bağımlılıkla ve otomatik güncellemeler olmadan yazılım oluşturmayı savunuyor; türler, soyutlamalar, testler ve sürümler gibi araçları ölçülü kullanmayı öneriyor."
    ],
    "commentSummary": [
      "2024 yılında, bir programcı testleri ve sürüm kontrolünü bırakma deneyimini paylaştı ve bunun programlarını geliştirdiğini iddia etti.",
      "Tartıştılar ki testler hataları ortaya çıkarır ama yokluklarını garanti etmez ve sürüm kontrolü birini geçmişe bağlı tutabilir, ancak bu yaklaşım daha büyük ekipler veya karmaşık projeler için uygun olmayabilir.",
      "Bu tartışma, geleneksel uygulamalar ile kişisel verimlilik arasındaki dengeyi vurguluyor ve testlerin ve sürüm kontrolünün gerekliliği konusunda görüşler ayrılmış durumda."
    ],
    "points": 299,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1722821319
  },
  {
    "id": 41157595,
    "title": "Yüksek Lego Kulelerini Yıkmak İçin Lego Makineleri İnşa Etmek",
    "originLink": "https://kottke.org/24/07/building-lego-machines-to-destroy-tall-lego-towers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157595",
    "commentBody": "",
    "originSummary": [
      "Brick Technology'nin yeni videosu, yüksek Lego kulelerini devirmek için tasarlanmış güçlü Lego makinelerini sergiliyor ve bilim, mühendislik ile deneme yanılma sürecinin önemini vurguluyor.",
      "Video, bu ilkelerin herhangi bir yaratıcı çabaya uygulanmasını vurgulayarak karmaşık mühendislik kavramlarını erişilebilir ve ilgi çekici hale getiriyor.",
      "Videodaki kavramdan uygulamaya hızlı geçiş, izleyicileri Lego Technic ve Mindstorms kitleriyle kendileri denemeye teşvik edebilir."
    ],
    "commentSummary": [
      "Yazı, uzun Lego kulelerini yıkmak için tasarlanmış Lego makineleri inşa etmeyi tartışıyor ve bu süreçte yer alan yaratıcılık ve mühendislik becerilerini vurguluyor.",
      "Bu, karmaşık Lego düzenekleri ve Lego topluluğuna katkılarıyla tanınan Akiyuki ve Yoshihito Isogawa gibi çeşitli YouTube kanallarını ve yaratıcılarını belirtmektedir.",
      "Bu tartışma, plastik oyuncakların çevresel etkisine de değiniyor ve bazı kullanıcılar, daha yüksek maliyetlerine rağmen ahşap inşaat oyuncakları gibi alternatifler öneriyor."
    ],
    "points": 232,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1722823340
  },
  {
    "id": 41156793,
    "title": "Age, basit, modern ve güvenli bir dosya şifreleme aracı, formatı ve Go kütüphanesidir.",
    "originLink": "https://github.com/FiloSottile/age",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156793",
    "commentBody": "",
    "originSummary": [
      "Age, küçük açık anahtarlar, yapılandırma seçenekleri olmayan ve UNIX tarzı bileşenlik sunan modern, güvenli bir dosya şifreleme aracı ve Go kütüphanesidir.",
      "Çeşitli işletim sistemlerinde Homebrew, MacPorts ve Linux dağıtımları ile Windows için paket yöneticileri dahil olmak üzere çeşitli kurulum yöntemlerini destekler.",
      "Age, YubiKey gibi donanım PIV tokenlarını, parola korumalı dosyaları, SSH anahtarlarını ve hatta bir GitHub kullanıcısına şifrelemeyi destekleyerek farklı şifreleme ihtiyaçları için çok yönlü hale getirir."
    ],
    "commentSummary": [
      "Age, modern, güvenli bir dosya şifreleme aracı ve Go kütüphanesidir, sadeliği ve bileşenleriyle övülmektedir.",
      "Kullanıcılar, Age'i GPG/PGP ve jq gibi yerleşik araçlarla karşılaştırarak, Unix standardı olma potansiyelini tartışıyor.",
      "Age, kullanım kolaylığı ve modern kriptografik uygulamaları nedeniyle takdir edilirken, bazı kullanıcılar imzalama gibi özelliklerin eksik olduğunu belirtmektedir ve ek güvenlik özellikleri için Kryptor gibi alternatifler önerilmektedir."
    ],
    "points": 228,
    "commentCount": 92,
    "retryCount": 0,
    "time": 1722811359
  },
  {
    "id": 41162311,
    "title": "And Warhol'un kayıp Amiga sanatı bulundu",
    "originLink": "https://dfarq.homeip.net/andy-warhols-lost-amiga-art-found/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41162311",
    "commentBody": "",
    "originSummary": [
      "And Warhol’un 1985 yılında Amiga 1000 üzerinde oluşturduğu kayıp dijital sanatı 39 yıl sonra yeniden ortaya çıktı ve şimdi satışta.",
      "Keşif, Debbie Harry'nin ünlü bir portresini içeriyor ve Warhol'un bilgisayar kullanımıyla ilgili zorluklarına rağmen dijital tekniklerle yaptığı denemeleri vurguluyor.",
      "Bu yeniden ortaya çıkış, Amiga 1000'in gelişmiş grafik yeteneklerini vurguluyor ve sanat ile teknolojinin kesişiminde önemli bir anı işaret ediyor."
    ],
    "commentSummary": [
      "And Warhol'un Amiga bilgisayarda oluşturduğu kayıp dijital sanatı bulundu, sekiz görüntü içeren imzalı bir disket de dahil.",
      "Keşif, bazıları neredeyse 40 yıl dayanan disketlerin bir depolama ortamı olarak uzun ömürlülüğünü vurguluyor.",
      "Bu buluş, Warhol'un modern sanat ve kültür üzerindeki etkisi nedeniyle önemli olup, hem sanat hem de teknoloji meraklıları için kayda değer bir olay haline gelmektedir."
    ],
    "points": 215,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1722872010
  },
  {
    "id": 41159680,
    "title": "Apple Intelligence beta, bir kimlik avı e-postasını \"Öncelikli\" olarak işaretledi.",
    "originLink": "https://social.panic.com/@cabel/112905175504595751",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159680",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Apple Intelligence beta, bir kimlik avı e-postasını yanlışlıkla \"Öncelikli\" olarak işaretleyerek, e-posta filtrelemede yapay zekanın güvenilirliği konusunda endişelere yol açtı.",
      "Bu olay, yapay zeka sistemlerinin hatalara karşı savunmasızlığını vurguluyor ve bu da kullanıcıların oltalama dolandırıcılıklarına kanma riskini potansiyel olarak artırabilir.",
      "Bu tartışma, kritik görevlerde yapay zekaya güvenilirken şüphecilik ve dikkatli olma gerekliliğini vurguluyor, çünkü yapay zeka hatasız değildir ve önemli hatalar yapabilir."
    ],
    "points": 202,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1722852724
  },
  {
    "id": 41156104,
    "title": "Puget Systems'in Intel CPU Kararsızlık Sorunlarına Bakışı",
    "originLink": "https://www.pugetsystems.com/blog/2024/08/02/puget-systems-perspective-on-intel-cpu-instability-issues/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156104",
    "commentBody": "",
    "originSummary": [
      "Intel Core 13. ve 14. Nesil masaüstü işlemciler, fiziksel bozulma nedeniyle olabilecek kararsızlık sorunları yaşıyor ve bazı arıza oranları %50 kadar yüksek bildirilmiştir.",
      "Intel, mevcut hasarı geri çevirmese de, daha fazla bozulmayı önlemek için Ağustos ortasına kadar bir mikro kod yaması yayınlamayı planlıyor.",
      "Puget Systems, muhafazakar güç yönetimi yaklaşımı nedeniyle daha az sorun yaşamış olup, Intel'in güncellemesini doğrulamayı, garantileri uzatmayı ve gerekirse etkilenen müşterileri yükseltmeyi planlamaktadır."
    ],
    "commentSummary": [
      "Puget Systems, Intel CPU'larında %2-4 arası bir arıza oranı bildirmektedir, bu oran bazı kullanıcılar tarafından yüksek olarak değerlendirilmektedir ve arızalar genellikle overclocking veya AMD Ryzen 5950x gibi belirli modellerle ilişkilendirilmektedir.",
      "Intel'in son CPU sorunları üretim hatalarına bağlanıyor ve agresif anakart ayarları sorunu daha da kötüleştirebilir.",
      "Veriler, veri merkezlerinde ve yaz aylarında daha yüksek CPU arıza oranlarını göstermekte olup, arızaların teşhis edilmesinin karmaşıklığını ve overclocking ile çevresel faktörlerin etkisini vurgulamaktadır."
    ],
    "points": 171,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1722803270
  },
  {
    "id": 41157192,
    "title": "Ortaya çıkarılan Euripides parçaları 'büyük bir mesele'",
    "originLink": "https://www.colorado.edu/asmagazine/2024/08/01/uncovered-euripides-fragments-are-kind-big-deal",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157192",
    "commentBody": "",
    "originSummary": [
      "CU Boulder Klasik Edebiyat araştırmacıları, Yunan oyun yazarı Euripides'in kayıp iki trajedisinin önemli yeni parçalarını keşfettiler.",
      "Polyidus ve Ino oyunlarından parçalar, Yvona Trnka-Amrhein ve John Gibert tarafından aylar süren çalışmalar sonucunda tespit edildi.",
      "Bu keşif, elli yıldan fazla bir süredir en önemli olarak kabul edilen, CU Boulder kampüsünde düzenlenecek Dokuzuncu Fountain Sempozyumu'nda sunulacak."
    ],
    "commentSummary": [
      "Bilginler, antik Yunan oyun yazarı Euripides'in eserlerinden yeni parçalar ortaya çıkardılar, bu da Klasikler alanında önemli bir keşiftir.",
      "Ek olarak, Hermopolis Magna'da Firavun II. Ramses'in devasa heykelinin üst yarısı keşfedildi, bu da arkeoloji çevrelerinde heyecan yarattı.",
      "Keşif, bilim insanları ve meraklılar arasında tartışmalara ve heyecana yol açtı, antik metinler ve eserlerin süregelen ilgi ve önemini vurguladı."
    ],
    "points": 168,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1722816693
  },
  {
    "id": 41156474,
    "title": "Cortex A73'ün Sonsuz Olmayan Yeniden Sıralama Kapasitesi",
    "originLink": "https://chipsandcheese.com/2024/08/04/cortex-a73s-not-so-infinite-reordering-capacity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156474",
    "commentBody": "",
    "originSummary": [
      "Cortex A73, Arm'ın erken 64-bit çekirdeklerindeki güç ve termal sorunları ele alarak verimliliğe ve akıllı telefon CPU pazarına odaklanmaktadır.",
      "Özgün bir sırasız emeklilik mekanizması, CPU'nun talimat yürütme onayını beklemeden sonuçları hesaplamasına olanak tanır ve sıralı yürütme yanılsamasını korur.",
      "A73, çözülmemiş bir dallanmadan sonra 50 uçuş yükünü ancak sadece 11 uçuş deposunu işleyebilir, bu da A72'den bir gerileme gösterir, ancak IPC (Döngü Başına Talimat) ve saat hızını dengeleyerek daha düşük güçte rekabetçi performans elde eder."
    ],
    "commentSummary": [
      "Bu tartışma, Cortex A73'ün yeniden sıralama kapasitesi ve kayıt tahsisi ile sırasız (OoO) yürütme gibi çeşitli CPU mimarisi kavramları etrafında dönmektedir.",
      "Temel noktalar arasında, okuma/yazma portu ihtiyaçlarını azaltmak için Aritmetik Mantık Birimleri (ALU'lar) ile kayıtların entegre edilmesi fikri ve modern CPU'larda kayıt yeniden adlandırma ve işlenen iletme zorlukları yer almaktadır.",
      "Konuşma ayrıca Mill mimarisi ve Bellekte İşleme gibi alternatif mimarilere de değinerek CPU tasarımındaki devam eden yenilikleri ve tartışmaları vurguluyor."
    ],
    "points": 167,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1722807000
  },
  {
    "id": 41156568,
    "title": "Hiç pişmanlık yok: Firefox güç kullanıcısı iki yıl boyunca 7.500 sekme açık tuttu",
    "originLink": "https://www.techspot.com/news/102871-zero-regrets-firefox-power-user-kept-7500-tabs.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41156568",
    "commentBody": "",
    "originSummary": [
      "Hazel adında bir yazılım mühendisi, Firefox'ta iki yıl boyunca neredeyse 7.500 sekmeyi açık tutmayı başardı ve bu, tarayıcının geniş sekme kullanımını kaldırma yeteneğini gösterdi.",
      "Hazel, başlangıçtaki sorunlara rağmen, Firefox'un profil önbelleğini kullanarak sekmelerini geri yükledi ve oturum dosyasının yalnızca yaklaşık 70MB olması, minimal bellek etkisi olduğunu gösteriyordu.",
      "Mozilla, birçok sekmenin açık olmasının \"pratikte hiç bellek tüketmediğini\" doğruladı ve 2024'ün ilerleyen dönemlerinde beklenen sekme yönetim araçlarını duyurarak kullanıcı deneyimini geliştireceğini açıkladı."
    ],
    "commentSummary": [
      "Bir Firefox kullanıcısı, iki yıl boyunca 7.500 açık sekmeyi koruyarak bunları bir tür geçmiş ve yer imleri olarak kullandı, bu da kullanıcılar arasında yaygın bir uygulamayı vurguluyor.",
      "Tarayıcılar, bellek kullanımını yönetmek için aktif olmayan sekmeleri boşaltarak uyum sağladı ve \"Tab Session Manager\" ve \"OneTab\" gibi uzantılar, çok sayıda sekmeyi yönetmeye yardımcı oluyor.",
      "Tabloları, geçmişi, yer imlerini ve sekme gruplarını tek bir özellikte birleştirerek kullanıcı deneyimini kolaylaştırma ve verimliliği artırma önerisi var."
    ],
    "points": 143,
    "commentCount": 154,
    "retryCount": 0,
    "time": 1722808318
  },
  {
    "id": 41157605,
    "title": "Japonya hisseleri, Asya hisselerinin satış dalgasını genişletmesiyle %7'ye kadar düştü",
    "originLink": "https://www.cnbc.com/2024/08/05/asia-markets.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41157605",
    "commentBody": "",
    "originSummary": [
      "Nikkei Japon endeksi, 1987 Kara Pazartesi çöküşünden bu yana en kötü gününü yaşadı, %12,4 düşerek yılın tüm kazançlarını sildi.",
      "Yen, Ocak ayından bu yana dolar karşısındaki en yüksek seviyesine yükselirken, Topix endeksi %12,23 düştü ve Mitsubishi ile Mitsui gibi büyük ticaret evleri önemli kayıplarla karşılaştı.",
      "Güney Kore'nin Kospi ve Kosdaq endeksleri de keskin düşüşler yaşadı, sırasıyla %8,77 ve %11,3 oranında düşerek devre kesicileri tetikledi; yatırımcılar, Çin ve Tayvan'dan gelecek ticaret verilerini ve Avustralya ile Hindistan merkez bankalarının kararlarını yakından izliyor."
    ],
    "commentSummary": [
      "Japonya hisseleri, Japonya Merkez Bankası'nın son 0,25% faiz artışının etkisiyle Asya piyasalarındaki daha geniş çaplı satış dalgasının bir parçası olarak %7'ye kadar düştü.",
      "Faiz artışı, Japon ihracatçılarını olumsuz etkileyen ve piyasa istikrarsızlığına katkıda bulunan daha güçlü bir yen'e yol açtı.",
      "Durum, Japonya'nın ekonomik politikalarında, kurumsal kârlardan ziyade kamu refahına odaklanarak potansiyel bir değişim hakkında tartışmalara yol açtı."
    ],
    "points": 127,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1722823461
  },
  {
    "id": 41159372,
    "title": "Nikkei, Zayıf ABD Verilerinin Ardından 1987'den Bu Yana En Büyük Tek Günlük Düşüşünü Yaşadı",
    "originLink": "https://www.wsj.com/finance/stocks/japan-stocks-fall-sharply-after-weak-u-s-jobs-data-yen-strengthening-3903689f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41159372",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Japonya'nın Nikkei endeksi, zayıf ABD ekonomik verileri ve Japonya Merkez Bankası'nın faiz artırımı nedeniyle 1987'den bu yana en büyük tek günlük düşüşünü yaşadı.",
      "Stoklardaki satış dalgası, yenin yükselmesine yol açarak taşıma ticaretini etkiledi ve piyasa oynaklığı ile ekonomik istikrarsızlık konusunda yatırımcı endişelerine neden oldu.",
      "Bazı yatırımcılar bunu bir alım fırsatı olarak görürken, diğerleri küresel piyasalar için daha geniş kapsamlı etkiler konusunda endişeli."
    ],
    "points": 102,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1722848748
  }
]
