[
  {
    "id": 40580549,
    "title": "Por qué las claves sintéticas son superiores a las naturales en el diseño de bases de datos",
    "originLink": "https://blog.ploeh.dk/2024/06/03/youll-regret-using-natural-keys/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40580549",
    "commentBody": "",
    "originSummary": [
      "Mark Seemann defiende en su blog el uso de claves sintéticas frente a las naturales en el diseño de bases de datos, alegando la fiabilidad y la integridad de los datos.",
      "Utiliza una anécdota personal sobre un error en el número de chasis de un coche para destacar los problemas que plantean las claves naturales, como los errores de introducción de datos y la garantía de unicidad.",
      "Los comentarios de los lectores aportan perspectivas adicionales, como el papel de las claves naturales en el modelado lógico de datos y los retos que plantean las bibliotecas ORM (Object-Relational Mapping)."
    ],
    "commentSummary": [
      "En el debate se critican las claves naturales en las bases de datos y se recomiendan identificadores únicos y legibles por humanos generados por funciones JavaScript/TypeScript con un componente temporal para reducir la fragmentación.",
      "Aconseja utilizar claves primarias autoincrementadas de 64 bits para las operaciones internas con el fin de aumentar el rendimiento y minimizar la sobrecarga de los índices, mientras que los identificadores de cadenas aleatorias mejoran la seguridad de los datos públicos.",
      "La conversación subraya las ventajas y desventajas de las claves naturales y sintéticas, favoreciendo las claves sustitutas por su estabilidad, referencias coherentes y mayor integridad de los datos."
    ],
    "points": 628,
    "commentCount": 471,
    "retryCount": 0,
    "time": 1717550709
  },
  {
    "id": 40578705,
    "title": "Guía animada de las series de Fourier: De los círculos a los epiciclos",
    "originLink": "https://www.andreinc.net/2024/04/24/from-the-circle-to-epicycles",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578705",
    "commentBody": "",
    "originSummary": [
      "El artículo \"Del círculo a los epiciclos (Parte 1)\" introduce las series de Fourier, explicando conceptos fundamentales como las funciones trigonométricas, la identidad de Euler y las sinusoides mediante animaciones para una mejor comprensión.",
      "Abarca el círculo unitario, el significado de π y las propiedades de las sinusoides y los epiciclos, hasta llegar a la introducción de las series de Fourier y sus aplicaciones en la aproximación de formas de onda complejas.",
      "El artículo también analiza la descomposición en series de Fourier de varias formas de onda, como las ondas cuadradas, triangulares y en diente de sierra inverso, e introduce una herramienta de visualización llamada \"Maquinaria de series de Fourier\" para ilustrar estos conceptos."
    ],
    "commentSummary": [
      "El debate contrasta las herramientas de aprendizaje visual, como las animaciones, con las explicaciones algebraicas y basadas en matrices para comprender las series y transformaciones de Fourier.",
      "Los usuarios destacan recursos como los vídeos de YouTube de 3Blue1Brown y herramientas como Manim y p5.js, haciendo hincapié en la importancia de contar con ecuaciones y pruebas matemáticas sólidas para las aplicaciones prácticas.",
      "Existe un debate sobre el uso de grados frente a radianes, con preferencia por los radianes en contextos teóricos, lo que subraya las limitaciones de la educación tradicional y el valor de los contenidos alternativos en línea."
    ],
    "points": 541,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1717533592
  },
  {
    "id": 40578460,
    "title": "Un periodista comparte los divertidos y extraños mensajes de texto de los ladrones de iPhone",
    "originLink": "https://gothamist.com/news/things-the-guys-who-stole-my-phone-have-texted-me-to-try-to-get-me-to-unlock-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578460",
    "commentBody": "",
    "originSummary": [
      "Veronica de Souza, periodista, sufrió el robo de su iPhone y posteriormente recibió mensajes de texto fraudulentos de los ladrones intentando desbloquear el teléfono.",
      "Los mensajes de estafa incluían falsas alertas de Apple Pay y amenazas de subastar su información personal en el mercado negro.",
      "De Souza compartió su experiencia para poner de relieve el carácter extraño y a menudo cómico de estas estafas, a pesar de su grave intención."
    ],
    "commentSummary": [
      "Un usuario de Gothamist recibió mensajes de texto de ladrones que intentaban desbloquear su teléfono robado, lo que dio lugar a un debate sobre el uso de mensajes sobre la masacre de la plaza de Tiananmen para activar la censura china como medida disuasoria.",
      "La conversación suscitó preocupación por los riesgos para las familias de los receptores en China, el papel social de WeChat y las políticas de seguridad y reparación de dispositivos de Apple, incluida la integración de piezas con la placa base para disuadir de los robos.",
      "A pesar de las medidas antirrobo de Apple, los robos de iPhone siguen siendo frecuentes, y los teléfonos robados suelen desmontarse para obtener piezas, lo que suscita debates sobre la posibilidad de reparación, el impacto medioambiental y la eficacia de funciones de seguridad como \"Buscar mi iPhone\". También se habló de la indiferencia de las fuerzas del orden y de la necesidad de mejorar las medidas legales y la educación de los usuarios."
    ],
    "points": 434,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1717531823
  },
  {
    "id": 40584135,
    "title": "Israel utilizó cuentas falsas para influir en los legisladores estadounidenses sobre la guerra de Gaza",
    "originLink": "https://www.haaretz.com/israel-news/security-aviation/2024-06-05/ty-article-magazine/.premium/israel-secretly-targeted-american-lawmakers-with-gaza-war-influence-campaign/0000018f-e7c8-d11f-a5cf-e7cb62af0000",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584135",
    "commentBody": "",
    "originSummary": [
      "El Ministerio de Asuntos de la Diáspora de Israel llevó a cabo una campaña encubierta de influencia dirigida a legisladores negros y jóvenes progresistas de Estados Unidos y Canadá para influir en la opinión pública sobre la guerra de Gaza.",
      "La campaña, llevada a cabo por una empresa política, utilizaba cuentas y sitios web falsos para difundir contenidos proisraelíes e islamófobos.",
      "Haaretz informó inicialmente de esta operación en marzo."
    ],
    "commentSummary": [
      "El debate se centra en el presunto uso por parte de Israel de cuentas falsas en las redes sociales para influir en los legisladores estadounidenses, lo que suscita preocupación por la transparencia, las cuestiones éticas y las posibles reacciones negativas.",
      "La detención por OpenAI de campañas encubiertas de influencia con ChatGPT suscita debates sobre el papel de la IA en el engaño y la guerra en Internet, destacando el contexto histórico de la propaganda y la evolución del espionaje a través de las redes sociales.",
      "La conversación critica la manipulación de los medios de comunicación, especialmente en el conflicto palestino-israelí, y la influencia de grupos de presión como el AIPAC, al tiempo que aborda implicaciones más amplias para la libertad de expresión y el discurso político."
    ],
    "points": 359,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1717591284
  },
  {
    "id": 40585842,
    "title": "El primer controlador Vulkan 1.3 para la M1 de Apple alcanza un 98,3% de conformidad",
    "originLink": "https://rosenzweig.io/blog/vk13-on-the-m1-in-1-month.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585842",
    "commentBody": "",
    "originSummary": [
      "El controlador \"Honeykrisp\" es la primera implementación conforme con Vulkan 1.3 para el hardware M1 de Apple, desarrollada sin exenciones de portabilidad y basada en el controlador NVK de Faith Ekstrand para GPU NVIDIA.",
      "El proyecto alcanzó hitos significativos, como un índice de aprobación del 99,6% para Vulkan 1.1 y del 98,3% para Vulkan 1.3, y renderizadores Vulkan integrados para SuperTuxKart y Zink.",
      "Los objetivos futuros incluyen la compatibilidad con Direct3D a través de DXVK y vkd3d-proton para juegos de Windows en Asahi Linux, mientras que actualmente se ofrecen controladores OpenGL 4.6 conformes para juegos de Linux."
    ],
    "commentSummary": [
      "Alyssa Rosenzweig ha desarrollado un controlador Vulkan 1.3 para el chip M1 de Apple en apenas un mes, lo que ha provocado debates en Hacker News sobre los juegos en arquitectura ARM y macOS.",
      "El debate critica la preferencia de Apple por Metal frente a Vulkan, que limita la disponibilidad de juegos nativos en macOS en comparación con Windows y Linux, y pone de relieve las complejidades de soportar múltiples API gráficas.",
      "Los usuarios expresan su frustración con el Game Porting Toolkit de Apple y los altos requisitos de almacenamiento para las actualizaciones de juegos, haciendo hincapié en la necesidad de un mejor soporte de juegos y una mayor compatibilidad API para atraer juegos AAA a macOS."
    ],
    "points": 284,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1717600261
  },
  {
    "id": 40585212,
    "title": "CoPilot+ de Microsoft y los problemas de privacidad provocan la reacción de los usuarios y el escrutinio normativo",
    "originLink": "https://www.antipope.org/charlie/blog-static/2024/06/is-microsoft-trying-to-commit-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585212",
    "commentBody": "",
    "originSummary": [
      "Charles Stross critica la presentación por parte de Microsoft de CoPilot+, un complemento para Windows basado en la IA, comparándolo con el impopular Clippy pero con una IA más avanzada y defectuosa.",
      "Stross plantea problemas de privacidad en relación con la nueva función \"Recall\" de Microsoft en Windows 11, que almacena la actividad del usuario en una base de datos no cifrada, lo que plantea riesgos para los datos sensibles y desata la polémica y el escrutinio normativo.",
      "El blog analiza implicaciones más amplias para la privacidad, la seguridad y la presión de la industria tecnológica para actualizar el hardware y el sistema operativo, con algunos usuarios considerando alternativas como Linux."
    ],
    "commentSummary": [
      "La nueva función \"Recall\" de Microsoft, que utiliza OCR (reconocimiento óptico de caracteres) en el dispositivo y una base de datos SQLite en la que se pueden hacer búsquedas, ha suscitado debates sobre si se puede considerar IA y ha suscitado preocupaciones sobre la privacidad y la seguridad.",
      "En el debate se critica la estrategia general de Microsoft, incluida su concentración en servicios en la nube como Azure, la decreciente relevancia de Windows y la gestión de la privacidad y la seguridad de los datos por parte de la empresa.",
      "Entre los temas más generales figuran la ineficacia de las grandes burocracias, la importancia de la privacidad y las consideraciones éticas de la IA y el tratamiento de datos, haciendo hincapié en la necesidad de que los usuarios conozcan los puntos fuertes y débiles de la IA."
    ],
    "points": 268,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1717597726
  },
  {
    "id": 40585728,
    "title": "Boeing Starliner lanza con éxito la primera misión tripulada a la ISS",
    "originLink": "https://www.bbc.co.uk/news/live/world-us-canada-69094213",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585728",
    "commentBody": "",
    "originSummary": [
      "El Boeing Starliner lanzó con éxito su primera misión tripulada, llevando a los astronautas de la NASA Butch Wilmore y Suni Williams a la Estación Espacial Internacional (ISS).",
      "Está previsto que la nave se acople a la ISS el 6 de junio a las 12:15 ET, lo que supondrá un hito importante tras años de retos de ingeniería.",
      "Los astronautas Wilmore y Williams permanecerán en la ISS alrededor de una semana, expresando su gratitud y entusiasmo por la misión."
    ],
    "commentSummary": [
      "El Starliner de Boeing lanzó con éxito su primera misión tripulada, marcando un hito importante en la exploración espacial estadounidense.",
      "El debate incluye el papel de la competencia en el acceso al espacio, la importancia de los Sistemas de Escape de Lanzamiento (LES) para la seguridad y el impacto de la financiación privada en la tecnología espacial.",
      "La conversación contrasta el Starliner de Boeing con el Crew Dragon de SpaceX, señalando los retrasos y mayores costes de Boeing, al tiempo que elogia el enfoque iterativo y tolerante a fallos de SpaceX para acelerar la innovación."
    ],
    "points": 261,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1717599843
  },
  {
    "id": 40585039,
    "title": "Un estudio revela que los licenciados en Derecho no superan tareas sencillas de sentido común",
    "originLink": "https://arxiv.org/abs/2406.02061",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585039",
    "commentBody": "",
    "originSummary": [
      "El artículo \"Alicia en el país de las maravillas: Simple Tasks Showing Complete Reasoning Breakdown in State-Of-the-Art Large Language Models\" de Marianna Nezhurina et al. revela fallos de razonamiento significativos en los grandes modelos lingüísticos (LLM) avanzados.",
      "A pesar de sus elevadas prestaciones, estos modelos fracasan en tareas sencillas de sentido común y suelen dar explicaciones demasiado seguras y disparatadas de las respuestas incorrectas.",
      "Las intervenciones estándar, como el refuerzo de los estímulos y la reevaluación en varios pasos, no solucionan estos problemas, lo que hace necesario establecer nuevos puntos de referencia para detectar mejor los déficits de razonamiento en los LLM."
    ],
    "commentSummary": [
      "El artículo critica los actuales modelos lingüísticos (LLM) por simular un razonamiento sin monólogos internos genuinos ni procesos de pensamiento iterativos, carentes de la profundidad experiencial del razonamiento humano.",
      "Sugiere mejoras mediante la integración con la programación lógica y los métodos computacionales estructurados, destacando las limitaciones de los LLM para resolver ecuaciones matemáticas y rompecabezas lógicos.",
      "En el debate se subraya la necesidad de contar con puntos de referencia sólidos y pruebas exhaustivas para evaluar mejor las capacidades de razonamiento de la IA y gestionar las expectativas del público, señalando la importancia del contexto en las indicaciones y los retos que plantea la resolución de acertijos lógicos y problemas de árbol genealógico."
    ],
    "points": 231,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1717596819
  },
  {
    "id": 40578060,
    "title": "Entropía: Herramienta CLI para detectar posibles secretos en bases de código",
    "originLink": "https://github.com/EwenQuim/entropy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578060",
    "commentBody": "",
    "originSummary": [
      "Entropy es una herramienta de interfaz de línea de comandos (CLI) que escanea bases de código en busca de líneas de alta entropía, que a menudo indican la presencia de secretos.",
      "Puede instalarse mediante Go, Docker y pronto mediante Homebrew, lo que ofrece flexibilidad en la configuración.",
      "El desarrollador también tiene otros proyectos notables: Fuego, un framework Go para generar documentación OpenAPI, y Renpy-Graphviz, una herramienta para visualizar las pantallas y etiquetas del motor de juego Renpy."
    ],
    "commentSummary": [
      "El debate de Hacker News se centra en la entropía para detectar secretos en bases de código y en la seguridad de las contraseñas, explorando métodos como algoritmos de compresión, modelos lingüísticos y diccionarios precalculados.",
      "Se mencionan herramientas como trufflehog, detect-secrets y semgrep secrets, con alternativas como PyWhat y Nosey Parker, destacando el debate sobre la eficacia y las limitaciones de las mediciones de entropía.",
      "La conversación hace hincapié en la importancia de la seguridad por capas, la rotación automatizada de credenciales y la gestión de la entropía del software, al tiempo que aborda los riesgos de seguridad derivados del uso de herramientas aleatorias y la necesidad de contar con fuentes fiables."
    ],
    "points": 218,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1717529147
  },
  {
    "id": 40584606,
    "title": "La WWDC 2024 de Apple hará hincapié en la IA y presentará iOS 18 y visionOS 2",
    "originLink": "https://9to5mac.com/2024/06/04/bartender-acquired-unknown-developer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584606",
    "commentBody": "",
    "originSummary": [
      "La WWDC 2024 de Apple destacará los avances en Inteligencia Artificial (IA), mostrando las últimas innovaciones en este campo.",
      "En el evento se presentará iOS 18, la próxima iteración del sistema operativo móvil de Apple.",
      "Además, se presentará visionOS 2, una actualización del sistema operativo de realidad aumentada (RA) de Apple."
    ],
    "commentSummary": [
      "La adquisición de la aplicación para Mac \"Bartender\" por parte de un desarrollador desconocido ha suscitado la preocupación de los usuarios sobre su futuro, su seguridad y los nuevos permisos necesarios.",
      "Los usuarios alabaron BetterTouchTool (BTT) como alternativa para gestionar los iconos de la barra de menús y comentaron la falta de funciones integradas en macOS, especialmente con el nuevo diseño del MacBook con muesca.",
      "En la conversación se destacaron las ventajas del software de código abierto como Dozer y se sugirieron alternativas a Bartender, como Ice e iBar, subrayando la importancia de la transparencia y la seguridad en el desarrollo de software."
    ],
    "points": 215,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1717594685
  },
  {
    "id": 40581545,
    "title": "GitHub acelera el desarrollo de aplicaciones iOS con Apple Silicon Runners",
    "originLink": "https://github.blog/2024-06-03-arm64-on-github-actions-powering-faster-more-efficient-build-systems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40581545",
    "commentBody": "",
    "originSummary": [
      "GitHub ha mejorado la velocidad de creación, prueba y despliegue de su aplicación para iOS utilizando macOS y Apple Silicon Runners para GitHub Actions.",
      "Esta mejora ha reducido notablemente el tiempo de prueba de su aplicación para iOS."
    ],
    "commentSummary": [
      "GitHub Actions ha añadido compatibilidad con Arm64, pero no está disponible en los planes gratuitos, lo que pone de relieve una alternativa rentable pero más lenta a las CPU x64.",
      "Los usuarios están comparando el uso que hace GitHub de proveedores externos para la creación de imágenes, con debates sobre los procesadores Graviton de Azure y AWS, y explorando alternativas como WarpBuild para crear imágenes de forma más rápida y barata.",
      "Las soluciones CI/CD autoalojadas que utilizan mini PC se caracterizan por un importante ahorro de costes a pesar de requerir mantenimiento, con debates continuos sobre las compensaciones entre coste, rendimiento y gestión en la infraestructura CI/CD."
    ],
    "points": 206,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1717563729
  },
  {
    "id": 40579660,
    "title": "La aplicación macOS Bartender se vende sin hacer ruido, lo que suscita la preocupación de los usuarios por la transparencia",
    "originLink": "https://www.macrumors.com/2024/06/04/bartender-mac-app-new-owner/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40579660",
    "commentBody": "",
    "originSummary": [
      "La popular aplicación para Mac Bartender se vendió hace dos meses sin notificación previa a los clientes, lo que suscita dudas sobre su transparencia.",
      "MacUpdater señaló posibles problemas de seguridad debido a la falta de comunicación, lo que llevó a los nuevos propietarios a confirmar la adquisición en Reddit.",
      "Los usuarios están preocupados por las intenciones de los nuevos propietarios y por la transparencia general, ya que inicialmente no se facilitaron detalles sobre la venta y el cambio de certificado."
    ],
    "commentSummary": [
      "Los usuarios de macrumors.com están preocupados por la auto-actualización de la aplicación de macOS Bartender bajo un nuevo propietario no identificado, lo que les lleva a considerar alternativas como HiddenBar, Dozer y Ice, a pesar de sus problemas de funcionalidad.",
      "El debate pone de relieve las frustraciones que genera el hecho de que macOS requiera herramientas de terceros para una mejor gestión del escritorio y los riesgos potenciales asociados a las actualizaciones de software y los cambios de propiedad.",
      "La preocupación por el posible malware en las futuras actualizaciones de Bartender hace que se recomiende desactivar las actualizaciones automáticas o utilizar herramientas de bloqueo de red, y los usuarios expresan su deseo de disponer de funciones nativas de macOS para gestionar los iconos de la barra de menús y los ajustes personalizables."
    ],
    "points": 204,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1717540496
  },
  {
    "id": 40578414,
    "title": "Debian 13 adopta tmpfs basado en RAM para /tmp, suscitando el debate de la comunidad",
    "originLink": "https://lwn.net/SubscriberLink/975565/bcce68a68d82d63a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578414",
    "commentBody": "",
    "originSummary": [
      "Debian 13 (\"Trixie\") utilizará un tmpfs basado en RAM para el directorio /tmp e implementará la limpieza automática de archivos temporales en /tmp y /var/tmp, similar a las prácticas de Arch Linux y Fedora.",
      "Este cambio ha suscitado un debate sobre su impacto en la gestión de la memoria, el rendimiento del sistema y el manejo de datos de trabajos de larga duración, especialmente en sistemas antiguos con RAM limitada.",
      "Los usuarios pueden personalizar o anular estos ajustes durante la instalación, y el debate pone de relieve la importancia del espacio de intercambio, la seguridad y una sólida gestión de errores."
    ],
    "commentSummary": [
      "La discusión en LWN.net examina los riesgos e ineficiencias de usar `/tmp` respaldado por RAM en Debian, especialmente durante reinicios inesperados, y sugiere `/var/tmp` respaldado por disco como alternativa para el almacenamiento persistente.",
      "Destaca las ventajas de systemd-tmpfiles para la gestión de archivos temporales y las complejidades de la distribución de los sistemas de archivos, incluidos los debates sobre la fusión de `/var/tmp` y `/var/cache`.",
      "La conversación también aborda herramientas de contenedorización como Snapcraft y Flatpak, el impacto de tmpfs en el rendimiento del sistema, el desgaste de los SSD y la gestión de la memoria, con opiniones encontradas sobre la eficacia de swap y zswap."
    ],
    "points": 193,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1717531524
  },
  {
    "id": 40584901,
    "title": "Un estudio revela que los proyectos de software ágiles tienen una tasa de fracaso un 268% mayor que los no ágiles",
    "originLink": "https://www.theregister.com/2024/06/05/agile_failure_rates/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584901",
    "commentBody": "",
    "originSummary": [
      "Según un estudio de la consultora Engprax, los proyectos de software ágiles tienen un 268% más de probabilidades de fracasar que los no ágiles.",
      "La investigación, en la que participaron 600 ingenieros de software del Reino Unido y Estados Unidos, puso de relieve que los proyectos con requisitos claros y documentados antes del desarrollo tienen un 97% más de probabilidades de éxito.",
      "El estudio sugiere que una sólida ingeniería de requisitos y la seguridad psicológica para la resolución de problemas son cruciales para el éxito del proyecto, y aboga por un enfoque equilibrado entre las metodologías ágiles y las tradicionales, como la cascada."
    ],
    "commentSummary": [
      "Un estudio que afirma que los proyectos de software ágiles tienen una tasa de fracaso un 268% mayor es criticado por su parcialidad, la falta de transparencia de los datos y las definiciones erróneas.",
      "Los críticos sostienen que Agile suele caracterizarse y aplicarse erróneamente, lo que provoca problemas como la deuda técnica, el agotamiento de los expertos y el fracaso de los proyectos, y subrayan la importancia de una implantación, flexibilidad y adaptación adecuadas.",
      "En el debate se contrastan las metodologías Agile y Waterfall, destacando la idoneidad de Agile para entornos dinámicos y el desarrollo iterativo, mientras que Waterfall es mejor para proyectos con requisitos fijos, lo que pone de relieve la necesidad de equilibrar los principios Agile con la ingeniería de requisitos prácticos y el diseño."
    ],
    "points": 174,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1717596111
  }
]
