[
  {
    "id": 40580549,
    "title": "Hvorfor syntetiske nøgler er bedre end naturlige nøgler i databasedesign",
    "originLink": "https://blog.ploeh.dk/2024/06/03/youll-regret-using-natural-keys/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40580549",
    "commentBody": "",
    "originSummary": [
      "Mark Seemanns blogindlæg argumenterer for at bruge syntetiske nøgler frem for naturlige nøgler i databasedesign med henvisning til pålidelighed og dataintegritet.",
      "Han bruger en personlig anekdote om en fejl i en bils stelnummer til at fremhæve problemer med naturlige nøgler, såsom fejl i dataregistrering og sikring af entydighed.",
      "Læserkommentarer giver yderligere perspektiver og diskuterer rollen af naturlige nøgler i logisk datamodellering og udfordringer med ORM-biblioteker (Object-Relational Mapping)."
    ],
    "commentSummary": [
      "Diskussionen kritiserer naturlige nøgler i databaser og anbefaler unikke, menneskeligt læsbare ID'er genereret af JavaScript/TypeScript-funktioner med en tidskomponent for at reducere fragmentering.",
      "Det anbefales at bruge 64-bit auto-incrementerede primærnøgler til interne operationer for at øge ydeevnen og minimere indeksopblomstring, mens tilfældige streng-ID'er øger sikkerheden for offentlige data.",
      "Samtalen understreger kompromiserne mellem naturlige og syntetiske nøgler og foretrækker surrogatnøgler på grund af deres stabilitet, konsekvente referencer og forbedrede dataintegritet."
    ],
    "points": 628,
    "commentCount": 471,
    "retryCount": 0,
    "time": 1717550709
  },
  {
    "id": 40578705,
    "title": "Animeret guide til Fourier-serier: Fra cirkler til epicykler",
    "originLink": "https://www.andreinc.net/2024/04/24/from-the-circle-to-epicycles",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578705",
    "commentBody": "",
    "originSummary": [
      "Artiklen \"From the Circle to Epicycles (Part 1)\" introducerer Fourier-serien og forklarer grundlæggende begreber som trigonometriske funktioner, Eulers identitet og sinuskurver ved hjælp af animationer for bedre forståelse.",
      "Den dækker enhedscirklen, betydningen af π og egenskaberne ved sinusoider og epicykler, hvilket fører til introduktionen af Fourier-serier og deres anvendelse til at tilnærme komplekse bølgeformer.",
      "Artiklen diskuterer også Fourier-seriens dekomponering af forskellige bølgeformer, herunder firkantede, trekantede og omvendte savtandsbølger, og introducerer et visualiseringsværktøj kaldet \"Fourier Series Machinery\" til at illustrere disse begreber."
    ],
    "commentSummary": [
      "Diskussionen kontrasterer visuelle læringsværktøjer, såsom animationer, med algebraiske og matrixbaserede forklaringer til forståelse af Fourier-serier og transformationer.",
      "Brugerne fremhæver ressourcer som 3Blue1Browns YouTube-videoer og værktøjer som Manim og p5.js og understreger vigtigheden af solide matematiske ligninger og beviser for praktiske anvendelser.",
      "Der er en debat om brugen af grader versus radianer, hvor radianer foretrækkes i teoretiske sammenhænge, hvilket understreger begrænsningerne i traditionel undervisning og værdien af alternativt onlineindhold."
    ],
    "points": 541,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1717533592
  },
  {
    "id": 40578460,
    "title": "Journalist deler humoristiske og bizarre sms'er fra iPhone-tyve",
    "originLink": "https://gothamist.com/news/things-the-guys-who-stole-my-phone-have-texted-me-to-try-to-get-me-to-unlock-it",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578460",
    "commentBody": "",
    "originSummary": [
      "Journalisten Veronica de Souza fik stjålet sin iPhone og modtog efterfølgende fup-sms'er fra tyvene, der forsøgte at låse telefonen op.",
      "Svindelbeskederne indeholdt falske Apple Pay-advarsler og trusler om at bortauktionere hendes personlige oplysninger på det sorte marked.",
      "De Souza delte sin oplevelse for at fremhæve den bizarre og ofte komiske karakter af disse svindelnumre, på trods af deres alvorlige hensigt."
    ],
    "commentSummary": [
      "En Gothamist-bruger modtog sms'er fra tyve, der forsøgte at låse deres stjålne telefon op, hvilket førte til en diskussion om at bruge beskeder om massakren på Den Himmelske Freds Plads til at udløse kinesisk censur som et afskrækkende middel.",
      "Samtalen gav anledning til bekymring over risikoen for modtagernes familier i Kina, WeChats samfundsmæssige rolle og Apples sikkerheds- og reparationspolitik for enheder, herunder integrationen af dele med bundkortet for at forhindre tyveri.",
      "På trods af Apples tyverisikring er iPhone-tyveri stadig udbredt, og de stjålne telefoner bliver ofte fjernet for at få fat i dele, hvilket udløste debatter om reparationsmuligheder, miljøpåvirkning og effektiviteten af sikkerhedsfunktioner som \"Find min iPhone\". Retshåndhævelsens ligegyldighed og behovet for bedre juridiske foranstaltninger og brugeruddannelse blev også diskuteret."
    ],
    "points": 434,
    "commentCount": 266,
    "retryCount": 0,
    "time": 1717531823
  },
  {
    "id": 40584135,
    "title": "Israel brugte falske konti til at påvirke amerikanske lovgivere om Gaza-krigen",
    "originLink": "https://www.haaretz.com/israel-news/security-aviation/2024-06-05/ty-article-magazine/.premium/israel-secretly-targeted-american-lawmakers-with-gaza-war-influence-campaign/0000018f-e7c8-d11f-a5cf-e7cb62af0000",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584135",
    "commentBody": "",
    "originSummary": [
      "Israels ministerium for diasporaanliggender gennemførte en skjult påvirkningskampagne rettet mod sorte lovgivere og unge progressive i USA og Canada for at påvirke den offentlige mening om Gaza-krigen.",
      "Kampagnen, som blev udført af et politisk firma, brugte falske konti og hjemmesider til at sprede pro-israelsk og islamofobisk indhold.",
      "Denne operation blev oprindeligt rapporteret af Haaretz i marts."
    ],
    "commentSummary": [
      "Diskussionen fokuserer på Israels påståede brug af falske konti på sociale medier til at påvirke amerikanske lovgivere, hvilket giver anledning til bekymring om gennemsigtighed, etiske spørgsmål og potentielle modreaktioner.",
      "OpenAI's stop for skjulte påvirkningskampagner med ChatGPT sætter gang i debatten om AI's rolle i bedrag og internetkrig, og fremhæver den historiske kontekst for propaganda og udviklingen af spionage gennem sociale medier.",
      "Samtalen kritiserer mediemanipulation, især i Israel-Palæstina-konflikten, og indflydelsen fra lobbygrupper som AIPAC, samtidig med at den tager fat på bredere konsekvenser for ytringsfrihed og politisk diskurs."
    ],
    "points": 359,
    "commentCount": 229,
    "retryCount": 0,
    "time": 1717591284
  },
  {
    "id": 40585842,
    "title": "Første Vulkan 1.3-driver til Apples M1 opnår 98,3 % overensstemmelse",
    "originLink": "https://rosenzweig.io/blog/vk13-on-the-m1-in-1-month.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585842",
    "commentBody": "",
    "originSummary": [
      "\"Honeykrisp\"-driveren er den første Vulkan 1.3-konforme implementering til Apples M1-hardware, udviklet uden portabilitetsdispensationer og baseret på Faith Ekstrands NVK-driver til NVIDIA GPU'er.",
      "Projektet nåede betydelige milepæle, herunder en beståelsesprocent på 99,6 % for Vulkan 1.1 og 98,3 % for Vulkan 1.3, og integrerede Vulkan-renderere til SuperTuxKart og Zink.",
      "Fremtidige mål omfatter understøttelse af Direct3D gennem DXVK og vkd3d-proton til Windows-spil på Asahi Linux, mens der i øjeblikket tilbydes kompatible OpenGL 4.6-drivere til Linux-spil."
    ],
    "commentSummary": [
      "Alyssa Rosenzweig udviklede en Vulkan 1.3-driver til Apples M1-chip på bare en måned og satte gang i diskussioner på Hacker News om gaming på ARM-arkitektur og macOS.",
      "Debatten kritiserer Apples præference for Metal frem for Vulkan, hvilket begrænser tilgængeligheden af native spil på macOS i forhold til Windows og Linux, og fremhæver kompleksiteten i at understøtte flere grafik-API'er.",
      "Brugerne udtrykker frustration over Apples Game Porting Toolkit og de høje krav til lagerplads for spilopdateringer og understreger behovet for bedre spilunderstøttelse og bredere API-kompatibilitet for at tiltrække AAA-spil til macOS."
    ],
    "points": 284,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1717600261
  },
  {
    "id": 40585212,
    "title": "Microsofts CoPilot+ og bekymringer om privatlivets fred udløser brugerreaktioner og lovgivningsmæssig kontrol",
    "originLink": "https://www.antipope.org/charlie/blog-static/2024/06/is-microsoft-trying-to-commit-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585212",
    "commentBody": "",
    "originSummary": [
      "Charles Stross kritiserer Microsofts introduktion af CoPilot+, en AI-baseret add-on til Windows, og sammenligner den med den upopulære Clippy, men med mere avanceret, fejlbehæftet AI.",
      "Stross rejser bekymringer om Microsofts nye \"Recall\"-funktion i Windows 11, som gemmer brugeraktivitet i en ukrypteret database, hvilket udgør en risiko for følsomme data og udløser kontroverser og lovgivningsmæssig kontrol.",
      "Bloggen diskuterer bredere konsekvenser for privatlivets fred, sikkerhed og teknologibranchens pres for hardware- og OS-opgraderinger, hvor nogle brugere overvejer alternativer som Linux."
    ],
    "commentSummary": [
      "Microsofts nye \"Recall\"-funktion, som bruger OCR (Optical Character Recognition) på enheden og en søgbar SQLite-database, har udløst debatter om, hvorvidt den kan betegnes som AI, og givet anledning til bekymringer om privatlivets fred og sikkerhed.",
      "Diskussionen kritiserer Microsofts bredere strategi, herunder dens fokus på cloud-tjenester som Azure, den faldende relevans af Windows og virksomhedens håndtering af databeskyttelse og -sikkerhed.",
      "Bredere temaer omfatter ineffektiviteten i store bureaukratier, vigtigheden af privatlivets fred og de etiske overvejelser om AI og datahåndtering, hvilket understreger behovet for brugernes bevidsthed om AI's styrker og svagheder."
    ],
    "points": 268,
    "commentCount": 250,
    "retryCount": 0,
    "time": 1717597726
  },
  {
    "id": 40585728,
    "title": "Boeing Starliner opsendte med succes den første bemandede mission til ISS",
    "originLink": "https://www.bbc.co.uk/news/live/world-us-canada-69094213",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585728",
    "commentBody": "",
    "originSummary": [
      "Boeing Starliner opsendte med succes sin første bemandede mission med NASA-astronauterne Butch Wilmore og Suni Williams til Den Internationale Rumstation (ISS).",
      "Rumfartøjet skal efter planen dokke ved ISS den 6. juni kl. 12.15 ET, hvilket markerer en vigtig milepæl efter mange års tekniske udfordringer.",
      "Astronauterne Wilmore og Williams vil blive på ISS i omkring en uge og udtrykke taknemmelighed og begejstring for missionen."
    ],
    "commentSummary": [
      "Boeings Starliner opsendte med succes sin første bemandede mission og markerede dermed en vigtig milepæl i USA's udforskning af rummet.",
      "Diskussionen omfatter konkurrencens rolle i adgangen til rummet, vigtigheden af Launch Escape Systems (LES) for sikkerheden og indvirkningen af privat finansiering på rumteknologi.",
      "Samtalen sætter Boeings Starliner i kontrast til SpaceX's Crew Dragon og bemærker Boeings forsinkelser og højere omkostninger, mens den roser SpaceX's iterative, fejltolerante tilgang til at fremskynde innovation."
    ],
    "points": 261,
    "commentCount": 239,
    "retryCount": 0,
    "time": 1717599843
  },
  {
    "id": 40585039,
    "title": "State-of-the-Art LLM'er fejler simple common-sense-opgaver, viser undersøgelse",
    "originLink": "https://arxiv.org/abs/2406.02061",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40585039",
    "commentBody": "",
    "originSummary": [
      "Artiklen \"Alice i Eventyrland: Simple Tasks Showing Complete Reasoning Breakdown in State-Of-the-Art Large Language Models\" af Marianna Nezhurina et al. afslører betydelige ræsonnementssvigt i avancerede store sprogmodeller (LLM'er).",
      "På trods af høje præstationskrav fejler disse modeller på simple common-sense-opgaver og giver ofte overmodige og meningsløse forklaringer på forkerte svar.",
      "Standardinterventioner som forbedret opmuntring og reevaluering i flere trin løser ikke disse problemer, hvilket giver anledning til en opfordring til nye benchmarks for bedre at kunne opdage ræsonnementsproblemer hos LLM'er."
    ],
    "commentSummary": [
      "Artiklen kritiserer de nuværende sprogmodeller (LLM'er) for at simulere ræsonnementer uden ægte interne monologer eller iterative tankeprocesser og for at mangle den erfaringsmæssige dybde i menneskelig ræsonnement.",
      "Den foreslår forbedringer gennem integration med logisk programmering og strukturerede beregningsmetoder og fremhæver LLM'ernes begrænsninger i forhold til at løse matematiske ligninger og logiske gåder.",
      "Diskussionen understreger behovet for robuste benchmarks og omfattende test for bedre at kunne vurdere AI's ræsonnementsevner og styre offentlighedens forventninger, idet man noterer sig betydningen af kontekst i prompts og udfordringerne med at løse logiske gåder og stamtræsproblemer."
    ],
    "points": 231,
    "commentCount": 252,
    "retryCount": 0,
    "time": 1717596819
  },
  {
    "id": 40578060,
    "title": "Entropi: CLI-værktøj til at opdage potentielle hemmeligheder i kodebaser",
    "originLink": "https://github.com/EwenQuim/entropy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578060",
    "commentBody": "",
    "originSummary": [
      "Entropy er et Command Line Interface (CLI)-værktøj, der scanner kodebaser for linjer med høj entropi, som ofte indikerer tilstedeværelsen af hemmeligheder.",
      "Den kan installeres ved hjælp af Go, Docker og snart via Homebrew, hvilket giver fleksibilitet i opsætningen.",
      "Udvikleren har også andre bemærkelsesværdige projekter: Fuego, en Go-ramme til generering af OpenAPI-dokumentation, og Renpy-Graphviz, et værktøj til visualisering af Ren's Py-spilmotorskærme og -etiketter."
    ],
    "commentSummary": [
      "Diskussionen på Hacker News fokuserer på entropi i forbindelse med afsløring af hemmeligheder i kodebaser og passwordsikkerhed og udforsker metoder som komprimeringsalgoritmer, sprogmodeller og forudberegnede ordbøger.",
      "Værktøjer som trufflehog, detect-secrets og semgrep secrets nævnes, og alternativer som PyWhat og Nosey Parker fremhæver debatten om effektiviteten og begrænsningerne ved entropimålinger.",
      "Samtalen understreger vigtigheden af lagdelt sikkerhed, automatiseret rotation af legitimationsoplysninger og håndtering af softwareentropi, samtidig med at sikkerhedsrisikoen ved at bruge tilfældige værktøjer og behovet for pålidelige kilder behandles."
    ],
    "points": 218,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1717529147
  },
  {
    "id": 40584606,
    "title": "Apples WWDC 2024 vil fremhæve AI, afsløre iOS 18 og visionOS 2",
    "originLink": "https://9to5mac.com/2024/06/04/bartender-acquired-unknown-developer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584606",
    "commentBody": "",
    "originSummary": [
      "Apples WWDC 2024 vil sætte fokus på fremskridt inden for kunstig intelligens (AI) og fremvise de seneste innovationer på området.",
      "Arrangementet vil indeholde udgivelsen af iOS 18, den næste udgave af Apples mobile styresystem.",
      "Derudover vil visionOS 2, en opdatering af Apples AR-operativsystem (augmented reality), blive introduceret."
    ],
    "commentSummary": [
      "En ukendt udviklers overtagelse af Mac-appen \"Bartender\" har ført til brugernes bekymringer om dens fremtid, sikkerhed og nye tilladelser, der kræves.",
      "Brugerne roste BetterTouchTool (BTT) som et alternativ til håndtering af menulinjeikoner og diskuterede manglen på indbyggede macOS-funktioner, især med det nye MacBook notch-design.",
      "Samtalen understregede fordelene ved open source-software som Dozer og foreslog alternativer til Bartender, såsom Ice og iBar, og fremhævede vigtigheden af gennemsigtighed og sikkerhed i softwareudvikling."
    ],
    "points": 215,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1717594685
  },
  {
    "id": 40581545,
    "title": "GitHub accelererer iOS-appudvikling med Apple Silicon Runners",
    "originLink": "https://github.blog/2024-06-03-arm64-on-github-actions-powering-faster-more-efficient-build-systems/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40581545",
    "commentBody": "",
    "originSummary": [
      "GitHub har gjort det hurtigere at bygge, teste og udrulle deres iOS-app ved at bruge macOS og Apple Silicon runners til GitHub Actions.",
      "Denne forbedring har reduceret testtiden for deres iOS-app betydeligt."
    ],
    "commentSummary": [
      "GitHub Actions har tilføjet Arm64-understøttelse, men den er ikke tilgængelig på gratis planer, hvilket fremhæver et omkostningseffektivt, men langsommere alternativ til x64-CPU'er.",
      "Brugerne sammenligner GitHubs brug af tredjepartsleverandører til billedopbygning med diskussioner om Azure og AWS Graviton-processorer og udforsker alternativer som WarpBuild til hurtigere og billigere opbygning.",
      "Selvhostede CI/CD-løsninger, der bruger mini-pc'er, er kendt for betydelige omkostningsbesparelser, selvom de kræver vedligeholdelse, og der er løbende diskussioner om afvejningen mellem omkostninger, ydeevne og administration i CI/CD-infrastrukturen."
    ],
    "points": 206,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1717563729
  },
  {
    "id": 40579660,
    "title": "macOS Bartender-app sælges i stilhed, hvilket vækker brugernes bekymring over gennemsigtighed",
    "originLink": "https://www.macrumors.com/2024/06/04/bartender-mac-app-new-owner/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40579660",
    "commentBody": "",
    "originSummary": [
      "Den populære Mac-app Bartender blev solgt for to måneder siden uden forudgående underretning til kunderne, hvilket gav anledning til bekymring for gennemsigtigheden.",
      "MacUpdater gjorde opmærksom på potentielle sikkerhedsproblemer på grund af den manglende kommunikation, hvilket fik de nye ejere til at bekræfte overtagelsen på Reddit.",
      "Brugerne er bekymrede for de nye ejeres intentioner og den generelle gennemsigtighed, da der i første omgang ikke blev givet detaljer om salget og ændringen af certifikatet."
    ],
    "commentSummary": [
      "Brugere på macrumors.com er bekymrede over, at macOS-appen Bartender opdateres automatisk under en ny, uidentificeret ejer, hvilket får dem til at overveje alternativer som HiddenBar, Dozer og Ice på trods af deres funktionalitetsproblemer.",
      "Diskussionen fremhæver frustrationer over, at macOS kræver tredjepartsværktøjer til bedre skrivebordsstyring og de potentielle risici, der er forbundet med softwareopdateringer og ejerskifte.",
      "Bekymringer om potentiel malware i Bartenders fremtidige opdateringer fører til anbefalinger om at deaktivere automatiske opdateringer eller bruge netværksblokerende værktøjer, og brugere udtrykker ønske om oprindelige macOS-funktioner til at styre menulinjeikoner og indstillinger, der kan tilpasses."
    ],
    "points": 204,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1717540496
  },
  {
    "id": 40578414,
    "title": "Debian 13 indfører RAM-baserede tmpfs til /tmp, hvilket skaber debat i fællesskabet",
    "originLink": "https://lwn.net/SubscriberLink/975565/bcce68a68d82d63a/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40578414",
    "commentBody": "",
    "originSummary": [
      "Debian 13 (\"Trixie\") vil bruge en RAM-baseret tmpfs til /tmp-biblioteket og implementere automatisk oprydning af midlertidige filer i /tmp og /var/tmp, i lighed med praksis i Arch Linux og Fedora.",
      "Denne ændring har skabt debat om dens indvirkning på hukommelsesstyring, systemets ydeevne og håndteringen af langvarige jobdata, især på ældre systemer med begrænset RAM.",
      "Brugerne kan tilpasse eller tilsidesætte disse indstillinger under installationen, og diskussionen fremhæver vigtigheden af swap-plads, sikkerhed og robust fejlhåndtering."
    ],
    "commentSummary": [
      "Diskussionen på LWN.net undersøger risikoen og ineffektiviteten ved at bruge RAM-backed `/tmp` i Debian, især under uventede genstarter, og foreslår disk-backed `/var/tmp` som et alternativ til vedvarende lagring.",
      "Den fremhæver fordelene ved systemd-tmpfiles til håndtering af midlertidige filer og kompleksiteten i filsystemets layout, herunder diskussioner om sammenlægning af `/var/tmp` og `/var/cache`.",
      "Samtalen omfatter også containeriseringsværktøjer som Snapcraft og Flatpak, tmpfs' indvirkning på systemets ydeevne, SSD-slid og hukommelsesstyring med blandede meninger om effektiviteten af swap og zswap."
    ],
    "points": 193,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1717531524
  },
  {
    "id": 40584901,
    "title": "Undersøgelse afslører, at agile softwareprojekter har 268% højere fejlrate end ikke-agile",
    "originLink": "https://www.theregister.com/2024/06/05/agile_failure_rates/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40584901",
    "commentBody": "",
    "originSummary": [
      "En undersøgelse foretaget af konsulentfirmaet Engprax viste, at der er 268% større sandsynlighed for, at agile softwareprojekter mislykkes sammenlignet med ikke agile projekter.",
      "Undersøgelsen, der omfattede 600 softwareingeniører fra Storbritannien og USA, understregede, at projekter med klare, dokumenterede krav før udviklingen har 97% større sandsynlighed for at lykkes.",
      "Undersøgelsen viser, at robust kravspecifikation og psykologisk sikkerhed i forbindelse med problemløsning er afgørende for projektsucces, og den taler for en afbalanceret tilgang mellem agile og traditionelle metoder som vandfald."
    ],
    "commentSummary": [
      "En undersøgelse, der hævder, at agile softwareprojekter har en 268% højere fejlrate, kritiseres for bias, manglende datatransparens og fejlbehæftede definitioner.",
      "Kritikere hævder, at Agile ofte bliver misforstået og anvendt forkert, hvilket fører til problemer som teknisk gæld, udbrændthed blandt eksperter og projektfejl, og de understreger vigtigheden af korrekt implementering, fleksibilitet og tilpasning.",
      "Debatten sætter Agile og Waterfall-metoder op mod hinanden og fremhæver Agiles egnethed til dynamiske miljøer og iterativ udvikling, mens Waterfall er bedre til projekter med faste krav, hvilket understreger behovet for at afbalancere Agile-principper med praktisk kravspecificering og design."
    ],
    "points": 174,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1717596111
  }
]
