[
  {
    "title": "Tech CEOs Join Forces at APEC Summit, Amidst US-China Tensions",
    "originLink": "https://www.theinformation.com/articles/tech-kisses-the-ring",
    "originBody": "The Briefing google asia policy Tech Kisses the Ring By Jessica E. Lessin jessica@theinformation.c­om Profile and archive → Follow Jessica on TwitterNov. 16, 2023 5:12 PM PST Photo: Chinese President Xi Jinping (left) and US President Joe Biden in Woodside, Calif., on Wednesday. Photo AFP via Getty Lately, when San Francisco makes national headlines, it’s about crime, homelessness or questions about whether tech companies will ever return to downtown. So this week, it was nice to see San Francisco in the news for a different reason, as U.S. President Joe Biden and Chinese President Xi Jinping of China came to town for the Asia-Pacific Economic Cooperation Summit, a summit of world leaders to promote trade. I have never seen so many tech CEOs come to town to wine, dine and opine. It is not surprising, per se. Government officials wield tremendous power—so much of it that founders could be spotted wearing suits. (I can’t reveal who because such state fashion secrets are technically off the record.) But this week’s events paint some of this tension—between the U.S. tech industry and China and between Washington, D.C., and the tech industry—in a different light. Because when push came to shove, the tech leaders showed up and wooed.",
    "originSummary": [
      "US President Joe Biden and Chinese President Xi Jinping attended the Asia-Pacific Economic Cooperation Summit in San Francisco.",
      "Numerous tech CEOs were present at the event, showcasing the importance of the tech industry in global politics and economics.",
      "The article underscores the tension between the tech industry and the governments of China and the United States."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "Senate Bill Seeks USF Contributions from Broadband and Tech Companies",
    "originLink": "https://broadbandbreakfast.com/2023/11/new-senate-bill-would-tap-broadband-and-tech-companies-for-usf-funds/",
    "originBody": "Broadband's Impact New Senate Bill Would Tap Broadband and Tech Companies for USF Funds The fund spends $8 billion annually to subsidize networks. households and community centers. Published 16 seconds ago on November 17, 2023 By Jake Neenan Screenshot of Sen. Markwayen Mullin, R-O.K., at a Senate hearing on October 26. WASHINGTON, November 17, 2023 – Three senators proposed a bill on Thursday that would tap broadband providers and tech companies to contribute to a major internet subsidy. The Universal Service Fund is a roughly $8 billion annual broadband subsidy for low-income households, schools, libraries, and healthcare providers. It’s funded by fees on voice service providers, leading to talks of reform as voice revenues decline and broadband adoption increases. The Federal Communications Commission administers the fund, but has left it to Congress to change the USF’s contribution base, citing doubts about the agency’s legal authority to make that change on its own. A Senate working group, which does not include the senators who proposed the new legislation, has been evaluating potential reforms to the fund since May. Commenters to that working group largely supported fees on broadband providers as a more sustainable long-term solution for the fund. A more contentious point has been whether or not to call on some tech companies to contribute as well. The argument is that tech companies which operate largely online, like Google and Amazon, should pay into the USF because they benefit so directly from more people being able to access broadband. Tech companies have opposed the proposition, saying broadband companies are a more stable source of funding. FCC Commissioner Brendam Carr and broadband companies publicly support the idea. So does the bill proposed on Thursday. It would direct the FCC to expand the USF contribution base to both broadband and online tech companies, known as “edge providers.” Those edge providers would be limited to companies responsible for more than 3% of the country’s internet traffic and with more than $5 billion in annual revenue. Multiple broadband industry groups came out in support of the legislation, including USTelecom, which represents major providers like AT&T and Lumen, and two rural broadband coalitions. Conservative groups are also challenging the USF in court. The right-wing nonprofit Consumers’ Research and other organizations currently have four pending suits alleging the fund is unconstitutional. They argue Congress gave the FCC unfettered authority to collect a tax by establishing the fund in 1996, and that the FCC abused that authority by delegating USF management to a nonprofit under the commission’s control. The Fifth Circuit Court of Appeals reheard one such case with a full panel of judges on September 19 and has yet to issue a ruling. The Sixth Circuit struck down a petition from the group in May, while the Eleventh and D.C. circuits also have yet to issue rulings. Senators Markwayne Mullin, R-O.K., Mark Kelly, D-A.Z., and Mike Crapo, R-I.D., proposed the bill. Kelly, along with Senate working group leader Ben Luján, D-N.M., reintroduced another bill in March that would also direct the FCC to research the feasibility of tapping big tech for funds. Related Topics:Ben LujanfeaturedMark KellyMarkwayne MullinMike CrapoUniversal Service Fund Don't Miss Connect20 Summit: Partnerships are Key for Digital Equity Efforts Jake Neenan Reporter Jake Neenan, who covers broadband infrastructure and broadband funding, is a recent graduate of the Columbia Journalism School. Previously, he reported on state prison conditions in New York and Massachusetts. He is also a devoted cat parent. Continue Reading You may like FCC Approves Strong Digital Discrimination Rules Coalition Wants Funds for Rip and Replace, Advertising Universal Service, Washington State Broadband Tribal Providers Say They Rely on ACP to Connect Communities FCC Votes on E-Rate, 6 GHZ and Emergency Alerts at October Meeting Some Question Whether to Link Affordable Connectivity With Universal Service Conservative Group Files Another Legal Challenge to Universal Service Fund Click to comment Leave a Reply Broadband's Impact Connect20 Summit: Partnerships are Key for Digital Equity Efforts State broadband offices should look to local organizations for digital equity efforts, panelists said. Published 6 hours ago on November 17, 2023 By Jake Neenan WASHINGTON, November 17, 2023 – Partnerships between local organizations and state governments will be essential for successful digital adoption programs, experts said on Tuesday. “We need the rock stars in our state or in our region to tell us what they’ve been working on and how they feel that they could participate if they were given a grant for something, or if they had the opportunity to build their program,” said Thomas Tyler, deputy director of the Louisiana broadband office. His state received more than $1.3 billion for broadband expansion from the Broadband Equity, Access and Deployment program, which he said would likely be enough to connect the state’s un- and underserved populations. The state is looking to put their leftover funds toward digital equity work, efforts to ensure people can use and afford their newly accessible broadband. He spoke at the Connect20 Summit, an event aimed at facilitating conversations between digital navigators and policymakers as BEAD and digital equity funds get closer to flowing. Organizations doing digital equity work will be able to apply for non-deployment grants under the program, or grants not used for building new infrastructure. Bruce Clark, executive director at the Queen’s University of Charlotte’s Center for Digital Equity, said his organization is already working on efforts with North Carolina’s state government and private sector partners. He said the center is working with the state’s Department of Adult and Aging Services to create a “digital health navigator” program in the state, a program for digital navigators to help people across North Carolina use broadband to access healthcare. “We’re hoping to deploy that in the next 12 months,” he said. To stay involved with the Digital Navigator movement, sign up at the Connect20 Summit. Continue Reading Broadband's Impact Connect20 Summit: Building Trust with Communities is Key to Adoption Digital navigators spoke about their work at the Connect20 Summit in Washington. Published 8 hours ago on November 17, 2023 By Jake Neenan WASHINGTON, November 17, 2023 – Building legitimacy with underserved communities is a key part of the job for digital navigators, those working to help people adopt broadband services. It’s also one of the hardest, a group of those navigators said on Tuesday. “This is the hardest work. The heaviest lift,” said Candace Browdy, director of Connect lake County, an organization that works to get discounted internet to low-income households in Illinois. “You’re representing a government benefit and you’re working with people who don’t have that built in trust of the government – for reasons that are legitimate.” She spoke on a panel at the Connect20 Summit, an event aimed at facilitating conversations between digital navigators and policymakers as digital equity funds from the Infrastructure Act begin to flow. Finding a shared connection with people is key to breaking down some of that hesitation, said Kendall Lee-Daugherty, a digital navigator for the Cherokee Nation in Oklahoma. For him, that’s having grown up in the same area and community as the people he serves. “Having someone who you know has grown up in your town, who knows the region and the companies there, who knows how customer service works… it’s more beneficial in the long run,” he said. “People in my community still call me up. They’re starting to treat the relationship more as a friendship.” Walter Prescher, a digital navigator at a Texas nonprofit, said his status as a veteran helps him build trust in the state’s smaller, rural communities. “Veterans are often trusted members of the community, and when they vouch for you, people will begin to buy in,” he said. A sister program to the Biden administration’s $42.5 billion broadband expansion program, the Digital Equity Act makes $2.75 billion available for digital equity efforts, like hiring digital navigators to foster broadband adoption where people have access. About $60 million of that has been freed up for states to draft digital equity plans, with the remaining $2.69 billion set to become available in 2024. To stay involved with the Digital Navigator movement, sign up at the Connect20 Summit. Continue Reading Broadband's Impact Broadband Offices Tout State Initiative to Train Prisoners for Broadband Workforce The industry has been working to train students and others to take on jobs in broadband-related fields. Published 1 day ago on November 16, 2023 By Ryan Barba Photo of Diana Goovaerts of Fierce Telecom, Chad Crank of Grain Management, MJ Barton of Oklahoma, Thomas Tyler of Louisiana, Judson Cary of Colorado WASHINGTON, November 16, 2023 – Panelists at the U.S. Broadband Summit Wednesday touted state programs that train prisoners to fill broadband worker shortages. Broadband representatives from Louisiana and Oklahoma commended the actions their states have taken in working with state prisons to integrate incarcerated individuals. “We’ve got skill centers in our prisons,” said MJ Barton, tribal and programs outreach manager at the Oklahoma Broadband Office. “We want to take that program, use the career text, vote text, and have that go into those prison systems, speed drug court programs, re-merge programs – anything that will help list some of the apps up and give them an opportunity.” Barton noted that Oklahoma tribes have employed incarcerated individuals to work in areas of the state that are facing workforce shortages for broadband expansion. Thomas Tyler Jr., deputy director of the Louisiana Office of Broadband Development and Connectivity, recalled attending a graduation ceremony for prisoners who completed a broadband program with a North Louisiana community college. He emphasized the impact that event had on him and the significance it played in the lives of those men. “It was a really, really touching ceremony to attend because they had eight guys who, you know, all different walks of life, whatever reason they were in prison, they were there to learn how to basically value their lives,” Tyler said. “You know, for some of these guys, that’s probably the first time they’ve graduated from anything.” Despite these positive outcomes, the inclusion of incarcerated individuals in broadband has led to discomfort amongst potential hirees, according to Chad Crank, managing director of Grain Management, which had to find a different contractor that would hire people from an incarcerated background. “If you’re going to come and speak to these guys and you don’t have any inclination of ever offering them a job, we don’t want you to come speak to them – there’s no reason to,” Crank recalled telling the contractor. Although imperfect, the collaboration of prison systems with broadband expansion has led to an upsurge of employment, growth in communities, and the celebration of individuals who have overcome barriers for a second chance at life. “The skills they learn are transferable and they can start to grow and mature in a company,” Tyler said. “[This] really shows that we have in our state those type of thought leaders who are pushing that type of issue forward and then changing lives and improving outcomes in that way.” As detailed in the Infrastructure, Investment and Jobs Act, states can allocate a portion of their Broadband Equity, Access and Deployment program funds toward workforce development. While many states are currently working on their initial proposals for funding allocation, multiple industry experts have advised state authorities to allocate resources to build up essential human capital and engage young individuals in preparation for the future workforce. Continue Reading Signup for Broadband Breakfast News Broadband Breakfast Research Partner BroadbandNow: Internet Provider Search and research on the digital divide Latest Popular Videos Broadband's Impact16 seconds ago New Senate Bill Would Tap Broadband and Tech Companies for USF Funds Funding3 hours ago NTIA Confirms Licensed-by-Rule May Apply for BEAD Funding Broadband's Impact6 hours ago Connect20 Summit: Partnerships are Key for Digital Equity Efforts Broadband's Impact8 hours ago Connect20 Summit: Building Trust with Communities is Key to Adoption Fiber9 hours ago The High Cost of Fiber is Leading States to Explore Other Technologies Broadband Roundup1 day ago Concern About Digital Discrimination Rules, Governors Call for ACP Funding, Newark Benefits from ACP Broadband's Impact1 day ago Broadband Offices Tout State Initiative to Train Prisoners for Broadband Workforce Expert Opinion2 days ago Ryan Johnston: What Happens to BEAD Without the Affordable Connectivity Program? FCC2 days ago Sen. Schumer, Democrats, FCC Chairwoman Tout Anti-Discrimination Rules Innovation2 days ago Industry Observers See MNO Opportunities in Leasing Network Space to MVNOs Broadband Roundup2 days ago FCC Cybersecurity Pilot Program, YouTube AI Regulations, Infrastructure Act Anniversary FCC2 days ago FCC Approves Strong Digital Discrimination Rules Trending #broadbandlive3 weeks ago Broadband Breakfast on Wednesday, November 8, 2023 – Preview of the Digital Infrastructure Investment Summit Net Neutrality4 weeks ago FCC Moves to Reinstate Net Neutrality, Keeps Rules Open for Comment #broadbandlive3 weeks ago Broadband Breakfast on November 15, 2023 – Social Media for Kids in Utah Broadband Roundup4 weeks ago FCC Emergency Connectivity Funds, Lumen’s Wi-Fi 7 Device, Dems and Broadcast Television Broadband Mapping & Data2 weeks ago NTIA OKs Virginia’s Broadband Plan, Commonwealth Launches BEAD Challenge Process Broadband's Impact3 weeks ago Biden Administration Asks Congress for $6 Billion to Continue ACP Broadband Roundup3 weeks ago Industry Support for ACP Funding Push, Semiconductor Hubs, NY Plows Money into Emergency Communications Expert Opinion3 weeks ago Bill Long: How Middle Mile Investments Close the Digital Divide",
    "originSummary": [
      "A new Senate bill aims to broaden the Universal Service Fund by including contributions from broadband and tech companies.",
      "FCC Commissioner Brendan Carr and the broadband industry support the legislation, but conservative groups question the fund's constitutionality.",
      "Various initiatives are being undertaken to promote digital equity, including a digital health navigator program in North Carolina and training prisoners for careers in broadband. The Infrastructure, Investment and Jobs Act gives states the authority to allocate funds for workforce development, and the Biden Administration seeks $6 billion for the ACP broadband initiative. Middle mile investments are seen as a way to address the digital divide."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "3 Oversold Tech Stocks Poised for Rebound and High Potential",
    "originLink": "https://investorplace.com/2023/11/3-millionaire-maker-tech-stocks-that-can-turn-1-into-1000/",
    "originBody": "SPECIAL REPORT 5 Artificial Intelligence Stocks to Buy Before They Skyrocket 3 Millionaire-Maker Tech Stocks That Can Turn $1 Into $1,000 These oversold tech stocks are primed for a rebound 14h ago · November 17, 2023 By Omor Ibne Ehsan Advertisement Tech stocks have been battered, but select oversold plays now offer huge upside potential after massive sell-offs. Usio (USIO): This fast-growing, undervalued fintech play offers an array of solutions and is projected to reach profitability soon. Ebix (EBIX): This diversified financial services company has plunged, but its valuation now seems extremely attractive. ZeroFox (ZFOX): This beaten-down cybersecurity stock is primed to rebound once sector sentiment shifts. Source: Peshkova / Shutterstock Once the post-COVID boom faded, many high-flying tech stocks plummeted, potentially creating opportunities for growth investors looking to position their portfolios for substantial gains. In my view, select beaten-down tech companies appear primed for massive upside if bought before the impending recovery. Of course, timing the bottom involves substantial risk, given the ongoing market turbulence. However, I don’t foresee an imminent recession, given the strength of the labor market and strong macro data coming in. Thus, accumulating shares of oversold tech stocks looks like an enticing proposition. Naturally, stomaching volatility is necessary to invest in these cyclic tech plays. The potential rewards provide elevated risk, best-suited for those with a high risk tolerance. While broader markets will heavily influence their recoveries, I believe the steep sell-offs in many tech stocks position them for enormous upside once sentiment improves. Concentrating bets heightens risk further, but also positions investors for maximum gains if the selected stocks return to favor. Interest rates are basically at their peak, and the pink sheets broadly appear oversold to me. Now may be the time to scoop up some potential multi-bagger tech stocks before the upswing. Of course, an iron gut is mandatory to endure rollercoaster price swings for any stock with an outsized upside. With that said, let’s look at the following three. Usio (USIO) Source: shutterstock.com/ZinetroN While Usio (NASDAQ:USIO) has traded in a relatively flat range over the past year, I believe this fintech stock merits a closer look as its adoption accelerates. In my view, USIO offers appealing tech capabilities across various fintech domains, making it well-positioned as the space gains traction. Despite its small size, Usio boasts an impressive suite of fintech solutions spanning prepaid cards, ACH payments, merchant services, and more. Usio is projected to reach profitability next year and grow revenue 20% in 2023. Looking ahead to 2024 earnings, its forward price-earnings ratio sits at just 17-times, with a price-to-sales ratio of only 0.5-times for 2023. In my opinion, this seems like a bargain, given USIO’s growth trajectory. Naturally, I expect the post-pandemic cooldown in fintech to shift back to growth as the sector normalizes. Once clarity returns, USIO stock could surge higher, in my view. The stock has languished amidst the recent economic turmoil, but its diverse fintech offerings strategically position it for the next upturn. In summary, though Usio hasn’t made huge waves recently, its blend of financial technology capabilities and reasonable valuation make it an intriguing investment. If the company delivers on 2023’s projected profitability and revenue growth, I believe its stock should follow suit. The average Wall Street analyst sees 336% upside in one year. Ebix (EBIX) Source: PopTika / Shutterstock While more volatile than other picks here, Ebix (NASDAQ:EBIX) presents a potential upside after its massive decline. This diversified financial services company provides solutions spanning insurance, remittance, lending, and wealth management. Despite recent instability, I feel EBIX stock is nearing a strong support level where it could reverse higher. The company has disappointed lately with top-line declines and guidance cuts. Consequently, EBIX has plunged more than 95% from its peak. However, shares seem extremely oversold at this point, in my opinion, having breached decade-lows. Though risks undoubtedly persist, analysts forecast Ebix’s profits to quintuple next year. Based on 2024 estimates, its forward price-earnings ratio stands at just 3.4-times, with a price-to-sales of only 0.3-times. To me, this signals the negativity is overdone. If Ebix’s various financial services businesses stabilize as management predicts, its beaten-down stock should respond favorably. The path remains murky, but patient investors could be rewarded by buying EBIX stock around $5 per share, in my view. While volatility won’t vanish overnight, I believe much of the potential pessimism is already priced in from these levels. The average Wall Street analyst sees 333% upside in one year. ZeroFox (ZFOX) Source: Song_about_summer / Shutterstock In the battered cybersecurity space, ZeroFox (NASDAQ:ZFOX) appears poised for a turnaround after substantial underperformance. Though profits remain elusive, its 26% projected sales growth for 2023 and narrowing losses signal positive momentum, in my opinion. ZFOX stock has plunged roughly 93% from its initial public offering, reaching all-time lows. Its debt load of over $190 million also remains a concern, especially amid rising rates. However, I feel ZeroFox has weathered the worst of its challenges. Cash burn is slowing as management focuses on efficiency and leveraging operating scale. Bulls point to ZeroFox reaching cash flow breakeven by mid-2025 as cybersecurity demand rebounds. Considering its capabilities in external threat intelligence and protection, the company could quickly regain favor if sector sentiment improves. In essence, I believe ZeroFox has been excessively punished during the tech selloff. Its promising growth and progress regarding profitability merit attention before sentiment shifts. Wall Street seems to share the same view, as the average analyst sees 267% upside in one year. Penny Stocks On Penny Stocks and Low-Volume Stocks: With only the rarest exceptions, InvestorPlace does not publish commentary about companies that have a market cap of less than $100 million or trade less than 100,000 shares each day. That’s because these “penny stocks” are frequently the playground for scam artists and market manipulators. If we ever do publish commentary on a low-volume stock that may be affected by our commentary, we demand that InvestorPlace.com’s writers disclose this fact and warn readers of the risks. Read More: Penny Stocks — How to Profit Without Getting Scammed On the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines. Omor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn. Cybersecurity, Financial, Fintech, Software, Technology Penny Stocks, Undervalued Stocks Article printed from InvestorPlace Media, https://investorplace.com/2023/11/3-millionaire-maker-tech-stocks-that-can-turn-1-into-1000/. ©2023 InvestorPlace Media, LLC",
    "originSummary": [
      "The article identifies three oversold tech stocks with potential for a rebound and significant upside: Usio (USIO), Ebix (EBIX), and ZeroFox (ZFOX).",
      "These stocks are from different sectors: Usio is a fintech company, Ebix is a diversified financial services company, and ZeroFox is a cybersecurity stock.",
      "The article acknowledges the high risk associated with investing in these volatile tech plays but highlights their potential for significant growth when market sentiment improves."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "SEC Cybersecurity Rule: Public Companies Must Disclose Incidents in 4 Days",
    "originLink": "http://securitytoday.com/articles/2023/11/17/what-the-new-sec-cybersecurity-rules-mean-for-tech-companies.aspx?admgarea=ht.accesscontrol&m=1",
    "originBody": "News ▾ Cybersecurity Access Control Airport Artificial Intelligence Banking Campus & Life Safety Casino Corporate Dealers & Integrators Government Hospital Incident Response Infrastructure Municipal Networking Residential Retail Venues & Events Magazine ▾ Current Issue Digital Edition Manage Subscription Newsletters Subscribe Writers Guidelines Webinars Awards ▾ CyberSecured Awards Govies Secure Campus Awards Security Today NPOY Spaces4Learning New Product Awards White papers Products ▾ Latest Products 4K Cameras Access Control Biometrics Cameras CCTV Fire and Life Safety Guards IP Video Monitoring Surveillance More ▾ SecurPod Events Calendar Free Product Info Security Today Industry Directory Campus Security Industry Directory GovSec Industry Directory Career Network Contact Advertise Subscribe Cybersecurity SECURPOD 2023 CyberSecured Awards Access Control Campus Security Dealers & Integrators What the New SEC Cybersecurity Rules Mean for Tech Companies By JJ Tang Nov 17, 2023 On July 26, the US Securities & Exchange Commission (SEC) released a new rule aimed to increase consistency of how and when material cybersecurity information is disclosed to investors and the public. The rule became effective Sept 5, 2023. With this new rule, publicly traded companies may be required to disclose cybersecurity incidents within as little as four business days. The rule also sets out new requirements for annual reporting to the SEC on cybersecurity preparedness, including: Companies will be asked to describe their processes, if any, for assessing, identifying, and managing material risks from cybersecurity threats, as well as the material effects or reasonably likely material effects of risks from cybersecurity threats and previous cybersecurity incidents. Companies will also need to describe the board of directors’ oversight of risks from cybersecurity threats and management’s role and expertise in assessing and managing material risks from cybersecurity threats. While these rules apply directly to public companies in the United States, we can expect to see a trickle-down effect in the level of preparedness and urgency that is expected from companies responding to cybersecurity incidents. Lisa Hartman is Associate General Counsel (Privacy) at SurveyMonkey, and has seven years of experience in public and private high-growth tech companies and international law firms. She has deep experience in GDPR, CCPA, PIPEDA and other privacy regulations. The first thing Lisa suggests for companies who want to better understand how evolving cybersecurity requirements impact them: plan ahead. “The best-case scenario is being able to create and document a basic plan for what you’ll do in a breach before you ever have one. The National Institute of Standards and Technology (NIST) provides a quick start guide for their cybersecurity framework that’s great for companies getting started in this area. There’s really no need to reinvent the wheel. If you at least have a plan on paper, then you have a starting point for your first incident.” The NIST guide breaks the lifecycle of a security incident into five stages: Identify, Protect, Detect, Respond and Recover. It also provides an overview of activities that should take place within each stage. Once you’ve defined what needs to take place when a security incident is discovered, you should consider who within your organization will be performing what actions. This can also help you understand any gaps you may have that could require third-party service providers. As Lisa puts it, “You should not handle something like this on your own. If you’re in this situation, there are a lot of moving pieces. Hopefully you have somebody who knows your product extremely well to help understand the specific impact of the incident, somebody that can keep track of all the organizational tasks, somebody to own communications, etc.” You can also use incident management software for this, as SurveyMonkey and many other large companies do. « previous 1 2 next » English Boarding School Upgrades Security With Paxton Technology 11/17/2023 What the New SEC Cybersecurity Rules Mean for Tech Companies 11/17/2023 i-PRO Announces New AI On-site Learning Camera Line that Adds AI to Non-AI Cameras 11/16/2023 ProdataKey Launches Version 2.0 of Its PDK.io Software 11/16/2023 Genetec Shares Guidance for Retailers to Help Protect Against ORC This Holiday Season 11/16/2023 Konica Minolta Commemorates 150 Years in Business 11/14/2023 Intellicene Partners with Oosto to Enhance Security Software 11/13/2023 ISC East, Security Industry Association Announce SIA Women in Security Forum Keynote Speaker Series 11/09/2023 Featured Five Cybersecurity Trends Predictions for 2024 According to Cybersixgill, threat research experts, AI’s evolution will continually improve both organizations’ cyber defense efforts and cybercriminal activities. At the same time, increasingly complex regulatory requirements, continued consolidation of cybersecurity tools, a widening attack surface, and heightened global geopolitical issues will all play a significant role in driving the direction of cybersecurity. Read Now Cybersecurity AI on the Edge Discussions about the merits (or misgivings) around AI (artificial intelligence) are everywhere. In fact, you’d be hard-pressed to find an article or product literature without mention of it in our industry. If you’re not using AI by now in some capacity, congratulations may be in order since most people are using it in some form daily even without realizing it. Read Now Artificial Intelligence NSA Report Focuses on How to Protect Against Evolving Phishing Attacks The National Security Agency (NSA) and U.S. partners have released a new report describing the latest techniques in phishing attacks and the defenses organizations can deploy against them. Read Now Cybersecurity NFL's Houston Texans Roll Out Weapon Detection Security Technology Evolv Technology, provider of AI-based weapons detection security screening, has added the Houston Texans to its growing roster of professional sports team customers. Beginning with the Texans’ first preseason game which took place in August, Evolv Express is now screening fans who attend Texans home games. Read Now Facility Security Most Popular Most Popular Articles Most Emailed Articles Video Analytics as a Security Solution Five Cybersecurity Trends Predictions for 2024 English Boarding School Upgrades Security With Paxton Technology What the New SEC Cybersecurity Rules Mean for Tech Companies Key and Asset Management: Bridging the Gap Between Security and Facilities Featured Cybersecurity Survey: Only 2% of Organizations Feel Confident with Current Cybersecurity Strategies Cyber Threat Readiness Report Reveals Misalignment Between Execs, Security Analysts NSC, CISA Highlight Top Cyber Misconfigurations Study: Three in Four People at Risk of Being Hacked Due to Poor Password Practices ✖ Most Popular Articles Most Emailed Articles Video Analytics as a Security Solution Five Cybersecurity Trends Predictions for 2024 English Boarding School Upgrades Security With Paxton Technology What the New SEC Cybersecurity Rules Mean for Tech Companies Key and Asset Management: Bridging the Gap Between Security and Facilities Webinars Vector Flow The Power of Intelligent Badging: From Picture Capture to Lifecycle Management LocklyPRO Unlocking Success: The Significance of Vertical Integration in Door Access Control Hanwha Vision (formerly Hanwha Techwin),Salient Systems,Vicon Industries,Arcules Securing Tomorrow: Insights into the Ever-Changing World of Security Whitepapers HID Global The Power of Employee Badge in Apple Wallet HID Global Open More with HID Mobile Access HID Global Mobile Access on Campus: A Guide to Increasing Safety & Convenience in Higher Ed New Products Luma x20 Snap One has announced its popular Luma x20 family of surveillance products now offers even greater security and privacy for home and business owners across the globe by giving them full control over integrators’ system access to view live and recorded video. According to Snap One Product Manager Derek Webb, the new “customer handoff” feature provides enhanced user control after initial installation, allowing the owners to have total privacy while also making it easy to reinstate integrator access when maintenance or assistance is required. This new feature is now available to all Luma x20 users globally. “The Luma x20 family of surveillance solutions provides excellent image and audio capture, and with the new customer handoff feature, it now offers absolute privacy for camera feeds and recordings,” Webb said. “With notifications and integrator access controlled through the powerful OvrC remote system management platform, it’s easy for integrators to give their clients full control of their footage and then to get temporary access from the client for any troubleshooting needs.” 3 Camden CV-7600 High Security Card Readers Camden Door Controls has relaunched its CV-7600 card readers in response to growing market demand for a more secure alternative to standard proximity credentials that can be easily cloned. CV-7600 readers support MIFARE DESFire EV1 & EV2 encryption technology credentials, making them virtually clone-proof and highly secure. 3 ComNet CNGE6FX2TX4PoE The ComNet cost-efficient CNGE6FX2TX4PoE is a six-port switch that offers four Gbps TX ports that support the IEEE802.3at standard and provide up to 30 watts of PoE to PDs. It also has a dedicated FX/TX combination port as well as a single FX SFP to act as an additional port or an uplink port, giving the user additional options in managing network traffic. The CNGE6FX2TX4PoE is designed for use in unconditioned environments and typically used in perimeter surveillance. 3 Campus Security Today Campus Technology Environmental Protection Occupational Health & Safety Security Today Spaces4Learning Steam Universe THE Journal © 2023 1105 Media Inc, Infrastructure Solutions Group. See our Privacy Policy, Cookie Policy and Terms of Use. CA: Do Not Sell My Personal Info",
    "originSummary": [
      "The US Securities & Exchange Commission (SEC) has issued a new rule mandating that publicly traded companies disclose cybersecurity incidents within four business days.",
      "This rule also introduces new requirements for annual reporting on cybersecurity readiness to the SEC.",
      "While these rules specifically concern US public companies, they are expected to influence the level of preparedness and response urgency for all companies. The National Institute of Standards and Technology (NIST) offers a guide for companies to create a cybersecurity incident plan, which may involve experts and incident management software."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "OpenAI Removes CEO Sam Altman Due to Lack of Candor",
    "originLink": "https://www.nytimes.com/2023/11/17/technology/openai-sam-altman-ousted.html",
    "originBody": "A.I. and Chatbots Meet the New ChatGPT Meta’s A.I. Characters ChatGPT’s Image Generator Google’s Bard Extensions ADVERTISEMENT SKIP ADVERTISEMENT OpenAI’s Board Pushes Out Sam Altman, Its High-Profile C.E.O. Mira Murati, who previously served as chief technology officer, has been named interim chief executive. Share full article 270 OpenAI said its board had concluded that Sam Altman “was not consistently candid in his communications with the board.” Credit... Jim Wilson/The New York Times By Cade Metz Reporting from San Francisco Published Nov. 17, 2023 Updated Nov. 18, 2023, 12:12 a.m. ET Sam Altman, the high-profile chief executive of OpenAI, who became the face of the tech industry’s artificial intelligence boom, was pushed out of the company by its board of directors, OpenAI said in a blog post on Friday afternoon. The move set off a reshuffling at OpenAI, a groundbreaking A.I. company and the maker of the popular chatbot ChatGPT. Mira Murati, previously OpenAI’s chief technology officer, was named interim chief executive officer, the company said. Hours later, Greg Brockman, the company’s president, said he was quitting. “Mr. Altman’s departure follows a deliberative review process by the board, which concluded that he was not consistently candid in his communications with the board, hindering its ability to exercise its responsibilities,” the company said. “The board no longer has confidence in his ability to continue leading OpenAI.” Leaving OpenAI is a stunning fall for Mr. Altman, 38, who over the last year had become one of the tech industry’s most prominent executives as well as one of its most fascinating characters. Last fall, OpenAI launched an industrywide A.I. frenzy when it released ChatGPT. It was not immediately clear what had led to the board’s decision beyond what its statement said. Mr. Altman could not be immediately reached for comment. In a post to X, formerly Twitter, he wrote: “i loved my time at openai. it was transformative for me personally, and hopefully the world a little bit. most of all i loved working with such talented people. will have more to say about what’s next later.” In a post to X Friday evening, Mr. Brockman said that he and Mr. Altman had no warning of the board’s decision. “Sam and I are shocked and saddened by what the board did today,” he wrote. “We too are still trying to figure out exactly what happened.” Mr. Altman was asked to join a video meeting with the board at noon on Friday and was immediately fired, according to Mr. Brockman. Mr. Brockman said that even though he was the chairman of the board, he was not part of this board meeting. He said that the board informed him of Mr. Altman’s ouster minutes later. Around the same time, the board published a blog post. A longtime tech entrepreneur, Mr. Altman helped found OpenAI with the financial backing of Elon Musk in 2015. He steered the small San Francisco company into rare territory — a technology leader funded by billions of dollars from Microsoft and envied by Silicon Valley giants like Google and Meta, Facebook’s parent company. Mr. Altman also became a spokesman for the tech industry’s shift toward A.I., testifying before Congress and charming lawmakers and regulators around the world. Many in the industry believe A.I. is the biggest technology shift in generations, and no one has done more to generate mainstream enthusiasm for it than Mr. Altman. On Thursday evening, Mr. Altman appeared at an event in Oakland, Calif., where he discussed the future of art and artists now that artificial intelligence can generate images, videos, sounds and other forms of art on its own. Giving no indication that he was leaving OpenAI, he repeatedly said he and the company would continue to work alongside artists and help to ensure their future would be bright. Earlier in the day, he appeared at the Asia-Pacific Economic Cooperation CEO Summit in San Francisco with Laurene Powell Jobs, who is the founder and president of the Emerson Collective, and executives from Meta and Google. Image Mira Murati, OpenAI’s interim chief executive, with, from left, Mr. Altman, Greg Brockman and Ilya Sutskever, who were among the company’s founders. Credit... Jim Wilson/The New York Times Mr. Brockman, who helped found OpenAI alongside Mr. Altman, said in a post on X that he was quitting. The company said earlier in the day that he would step down as chairman of the board but remain as president, reporting to the chief executive. Reached by phone, Mr. Brockman declined to comment. From OpenAI’s earliest days, he had been instrumental in shaping both its mission and its day-to-day operations. When OpenAI released ChatGPT last November, the chatbot attracted hundreds of millions of users, wowing people with the way it answered questions, wrote poetry and discussed almost any topic tossed its way. After the chatbot’s success, the wider tech industry embraced what is called generative artificial intelligence — technologies that can generate text, images and other media on their own. The result of more than a decade of research inside companies like OpenAI and Google, these technologies are poised to remake everything from email programs to internet search engines to digital tutors. OpenAI is in talks to close a new funding round that would value the company at more than $80 billion — nearly triple its valuation less than a year ago — and it is unclear what Mr. Altman’s departure will mean for those talks. But his removal is a blow to Microsoft, which has invested $13 billion in OpenAI and has what amounts to a 49 percent stake in the company. Satya Nadella, Microsoft’s chief executive, introduced an expansive plan this year to use the technology developed at OpenAI in nearly all of Microsoft’s products, from the Bing search engine to its widely used business software. Mr. Altman joined him at a press event to announce the plans. Microsoft said on Friday afternoon that it planned to continue to work closely with OpenAI. Mr. Nadella said in a statement that the company’s long-term agreement with OpenAI provided Microsoft “full access to everything we need to deliver on our innovation agenda and an exciting product road map.” He added that the company remained committed “to our partnership, and to Mira and the team.” Microsoft’s stock price fell more than 1 percent in the last 30 minutes of trading, after Mr. Altman’s departure was announced. In a message to OpenAI employees viewed by The New York Times, Ms. Murati said that she had talked with Mr. Nadella and Microsoft’s chief technology officer, Kevin Scott, on Friday and that they remained supportive of OpenAI. “We are now at a crucial juncture where our tools are being widely adopted, developers are actively building on our platforms and policymakers are deliberating on the best ways to regulate these systems,” she wrote. “It’s more important than ever that we stay focused, driven and true to our core values.” OpenAI’s four-member board of directors is a mix of respected A.I. researchers, tech executives and A.I. policy experts, including Ilya Sutskever, the company’s chief scientist and co-founder, and Adam D’Angelo, chief executive of the question-and-answer site Quora. The board members could not be immediately reached for comment. Current and former OpenAI employees were shocked by the news. As recently as Friday morning, they were discussing Mr. Altman as if he had a long future with the company. Researchers, entrepreneurs and investors outside the company were equally surprised, with many scrambling to determine why the OpenAI board had made its decision. Jack Altman, one of Mr. Altman’s younger brothers and the chief executive of the business software start-up Lattice, defended his sibling on X. “More important than being one of the most brilliant and impactful people our industry has ever had,” he wrote, “Sam is one of the most generous and caring people I know. I’ve never met someone who has supported and lifted up more people around them than him. Couldn’t be a prouder brother.” Cade Metz is a technology reporter and the author of “Genius Makers: The Mavericks Who Brought A.I. to Google, Facebook, and The World.” He covers artificial intelligence, driverless cars, robotics, virtual reality and other emerging areas. More about Cade Metz A version of this article appears in print on , Section B, Page 1 of the New York edition with the headline: Altman Out At OpenAI, Board Says In Blog Post. Order ReprintsToday’s PaperSubscribe 270 Share full article 270 Explore Our Coverage of Artificial Intelligence Latest News Research from Vectara, a new start-up founded by former Google employees, estimates that chatbots invent information at least 3% of the time — and as high as 27%. Experts call this chatbot behavior “hallucination.” Rishi Sunak, the prime minister of Britain, hosted dozens of government leaders, tech executives and other experts as part of the A.I. Safety Summit he organized to discuss the dangers of the technology. President Biden signed a far-reaching executive order on A.I. that imposes new rules on companies and directs federal agencies to begin putting guardrails around the technology. The Age of A.I. Humane, a company started by two former Apple employees, says its A.I. pin can liberate the world from its smartphone addiction. Can it live up to the hype? Very soon, A.I. “agents” may be able to send emails and schedule meetings, book restaurant reservations and handle other complex tasks for us. That could have huge implications. The F.D.A. has approved many new medical products that use A.I., but doctors remain skeptical of these tools. A nonprofit led by a respected computer scientist is trying to democratize A.I. by building a freely available alternative to those offered by the likes of Google and OpenAI. OpenAI now lets outside businesses and independent developers tweak what its chatbot does. A new paper says that can lead to trouble. Advances in A.I. are offering new ways for bad actors to misappropriate online content of children. That is posing new risks for parents posting about their children on social media. ADVERTISEMENT SKIP ADVERTISEMENT",
    "originSummary": [
      "Sam Altman, the CEO of OpenAI, has been ousted by the company's board of directors due to a lack of consistent candor in his communications.",
      "Mira Murati, the former chief technology officer, has been appointed as the interim CEO of OpenAI.",
      "Altman's departure has caused a reshuffling within OpenAI, including the resignation of Greg Brockman, the company's president, and has surprised employees and external observers who are seeking to understand the motives behind the decision."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "One NC program offers grants to emerging tech companies in North Carolina",
    "originLink": "https://bizfayetteville.com/technology/2023/11/17/applications-open-for-new-round-of-one-nc-grants-emerging-tech-companies-throughout-the-state-encouraged-to-apply/2436",
    "originBody": "Home News Achievers & Accolades Business Education Real Estate Restaurants Residential Real Estate Commercial Real Estate Health Care Banking & Finance Technology Hospitality Government Military Business More News Current Issues Volume 3 Issue 11: Nov 3, 2023 Volume 3 Issue 10: Oct 20, 2023 Volume 3 Issue 9: Oct 6, 2023 Business Ranking Survey Submit Login Subscribe Technology Applications open for new round of One NC grants, emerging tech companies throughout the state encouraged to apply By Staff Report, posted 16 hours ago Tweet Image courtesy of NCDOC Applications are now being accepted for a new round of grantmaking from the One North Carolina Small Business Program, a major source of capital for North Carolina’s emerging technology companies. “The One North Carolina Small Business Program provides critical support to some of our state’s most promising new companies,” said North Carolina Secretary of Commerce Machelle Baker Sanders in a press release. “Recent enhancements to the program open the door for even more tech entrepreneurs to grow their companies in North Carolina.” The One NC Small Business Program works in conjunction with two federal technology grants, the Small Business Innovation Research (SBIR) and Small Business Technology Transfer (STTR) programs. Following recent changes, the state program can support North Carolina companies as they prepare and submit initial proposals to the federal government, as well as provide grants to match previously awarded federal grants. The One North Carolina Small Business Program’s Incentive Funds and Matching Funds initiatives are administered by the North Carolina Department of Commerce on behalf of the North Carolina Board of Science, Technology & Innovation (BSTI). Grant awards help small businesses across the state develop and commercialize innovative new technologies, in the process growing jobs and investment in their communities. The Incentive Funds initiative provides reimbursement to qualified North Carolina businesses for a portion of the costs incurred in preparing and submitting Phase I SBIR or STTR proposals to federal agencies. In the 2023-24 fiscal year, a pool of $400,000 is available for these preparation grants. The Matching Funds portion of the program, which has been offered for many years, awards matching funds to North Carolina businesses who have already received a federal Phase I SBIR or STTR award. In the current fiscal year, a pool of more than $2.4 million is available to support this class of grants. “The One North Carolina Small Business Program has a long, established history of advancing innovation in the state,” said Janet Cowell, Chair of the Board, in a press release. “The Board is activating both the Incentive and Matching grants to help fund new technologies, create jobs, and enhance economic development across a variety of industry sectors, including life sciences, military and defense, chemicals, agriculture, computers, communications, pharmaceuticals, energy, materials and others.” The One North Carolina Small Business Program supports early-stage companies at a critical point, shortening the time between their startup and the point where they become large, sustainable companies. Since 2006, the Program has helped more than 400 companies in 38 counties, resulting in over twelve hundred North Carolina jobs, hundreds of high-tech products and the generation of more than $8 billion in follow-on capital investments. Applications to the One North Carolina Small Business Program can be accepted until June 30, 2024, or until funds have been exhausted for the program’s 2023-24 fiscal year funding cycle. The Office of Science, Technology, & Innovation, a division of the North Carolina Department of Commerce, administers the One North Carolina Small Business Program on behalf of the Board. Details on how to apply for either the Incentive or Matching grant solicitations, as well as additional program information and application instructions, are posted at: https://www.commerce.nc.gov/grants-incentives/technology-funds/one-north-carolina-small-business-program. Join The Discussion Similar Stories USDA Rural Development invests $24.9 million in Star Communications IT job postings down once again for month of September FTCC President Dr. Mark Sorrells named Tech Difference Maker of the Year by NC TECH Nearly $6.2 million fiber-optic buildout to connect nearly 1,300 homes and small businesses in Robeson County to gigabit broadband Student run radio station BRONCOiRADIO.COM launches a new app INSIGHTS SPONSORS' CONTENT Understanding the Business Valuation Process Alex Keith - Certified General Real Estate Appraiser and Property Manager, Tom Keith & Associates, Inc. Help Employees Spot Spear Phishing with These Training and Testing Tips Jaron Cayton - President, TeamLogicIT NC Community Alternatives Program Helps Disabled and Elderly Adults Improve Quality of Life Tim Brooks - President, Healthkeeperz, Inc. Trending News Cape Fear Valley Health opens new hospice care facility Faith Hatton - Nov 9, 2023 FTCC holds ribbon-cutting and demonstrations at new Swift Water Rescue Training Facility Stephanie Meador - Nov 13, 2023 A perfect partnership: Cape Fear Valley Health and Methodist University have combined forces to bring the first ever Medical School to Fayetteville, NC Faith Hatton - Oct 26, 2023 Fayetteville State University to host artificial intelligence and cybersecurity hackathon Staff Report - Feb 3, 2023 Bahama Breeze Island Grill coming to Fayetteville; now under construction at Cross Creek Mall Faith Hatton - Jul 7, 2023 In The Current Issue Bigger and better: A Dickens Holiday returns to Downtown Fayetteville with expanded footprint and new additions While A Dickens Holiday welcomes guests as they are, event-goers are absolutely encouraged to dress up - PHOTO PROVIDED BY THE DOWNTOWN ALLIANCE OF FAYETTEVILLEThe City of Fayetteville is home to many festivals and community events throughout all sea Help for home buyers: Fayetteville-based real estate agent Kai 'Hollywood\" Murphy breaks down what financing options are available for homebuyers in NC When we think of the “American Dream” something along the lines of a car and a house with a white picket fence and a family will most likely come to mind. Growing up in America we’ve been conditioned to believe this American dream is achievable to an Questions & Answers: Cumberland County Manager reflects on past year of progress Grier worked with the City of Roanoke from 2021- 2022 before moving to Cumberland County. Prior to that, he served as Deputy County Manager in Guilford County, NC, from 2015 until 2021 and as Assistant County Manager and Chief Finance Officer for Ora Enhanced Media Management Inc. dba. Greater Fayetteville Business Journal 4424 Bragg Boulevard, Suite 101 Fayetteville, NC About Us Contact Us Tweet us at @bizfayetteville Terms of Use Privacy Policy Subscribe Advertise Business Ranking Survey 3 free articles remaining. Subscribe for unlimited access Subscribe",
    "originSummary": [
      "The One North Carolina Small Business Program is accepting applications for grants to support emerging technology companies in the state.",
      "The program offers reimbursement for proposal costs and matching funds for businesses that have received federal grants.",
      "The program focuses on early-stage companies and has already assisted more than 400 companies in job creation and investment generation."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "Major brands suspend ads on Musk's X over antisemitic content",
    "originLink": "https://www.washingtonpost.com/technology/2023/11/17/elon-musk-x-companies-pulling-ads-anti-semitism/",
    "originBody": "Share Comment Add to your saved stories Save A growing list of companies has suspended advertising from Elon Musk’s social media platform X, formerly known as Twitter, amid the ongoing fallout over antisemitic content. A report released Thursday identified several large companies — including tech firms, health-care organizations and sports teams — whose ads appeared next to pro-Nazi posts. The report by the left-leaning nonprofit Media Matters for America said the ads had appeared next to tweets that included memes portraying Nazism as a spiritual awakening and Adolf Hitler quotes. Tech is not your friend. We are. Sign up for The Tech Friend newsletter. A day earlier, Musk had tweeted agreement with an antisemitic conspiracy theory. In response to an X user who had blamed the rise in online antisemitism on Jews, alleging they promoted “hatred against whites,” the billionaire wrote, “You have said the actual truth.” Advertisement Story continues below advertisement That set off a wave of criticism from advertisers, civil rights leaders and the Biden administration. The corporate defections soon followed: IBM Return to menu IBM pulled its advertising from X on Nov. 16 after the Media Matters report identified it as one of several blue-chip companies whose ads had appeared next to tweets promoting antisemitism. “IBM has zero tolerance for hate speech and discrimination and we have immediately suspended all advertising on X while we investigate this entirely unacceptable situation,” the company said in a statement. The information technology company, with a market capitalization near $140 billion, had been a “significant buyer,” according to Angelo Carusone, president of Media Matters. IBM pulls ads from X as Musk amplifies antisemitism Apple Return to menu The maker of iPhones and MacBooks decided to pause all advertising on X on Friday after Musk endorsed an antisemitic post on platform, according to Axios, citing unnamed sources, and the New York Times. Advertisement Story continues below advertisement Apple was reportedly the platform’s largest advertiser, spending nearly $50 million in the first quarter of 2022. Share this article Share Lionsgate Return to menu A spokesperson for the entertainment and film distribution company told The Washington Post it suspended advertisements on X on Friday afternoon, saying the decision came after “Elon’s tweet.” Lionsgate is behind the hit film series Twilight, the Hunger Games, John Wick and others. Disney, Lionsgate pull ads on X over antisemitic posts Disney Return to menu The entertainment giant suspended advertising on the social media platform Friday, a company spokesperson said. The entertainment giant behind a range of film, television and theme park properties has a market cap of roughly $173 billion. Paramount Return to menu The media, streaming and entertainment company is suspending all advertising on the platform, a spokesperson said in an email to The Post on Friday. Advertisement Story continues below advertisement Paramount Global’s portfolio includes Paramount Pictures, CBS and Comedy Central, among other properties. Comcast Return to menu The global media and tech company is pausing ads on X, company spokesperson Jennifer Khoury said in an email on Friday. Philadelphia-based Comcast, with a market cap near $171 billon, provides a range of broadband, wireless and other services. It also operates several television and streaming platforms and theme parks. Share Comments",
    "originSummary": [
      "Multiple companies have halted their advertising on Elon Musk's social media platform X (formerly Twitter) due to the presence of antisemitic content.",
      "A report by Media Matters for America uncovered ads from major companies appearing alongside pro-Nazi posts on the platform, including tweets glorifying Nazism and quotes from Adolf Hitler.",
      "The situation intensified when Musk tweeted his agreement with an antisemitic conspiracy theory, receiving criticism from advertisers, civil rights leaders, and the Biden administration, resulting in IBM, Apple, Lionsgate, Disney, Paramount, and Comcast all suspending their advertising on X."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "OpenAI CEO Sam Altman ousted, impacting fundraising and talent acquisition",
    "originLink": "https://www.reuters.com/technology/ousting-ceo-sam-altman-chatgpt-loses-its-best-fundraiser-2023-11-18/",
    "originBody": "Boards, Policy & Regulation Boards In ousting CEO Sam Altman, ChatGPT loses its best fundraiser By Greg Bensinger November 18, 20231:29 AM UTCUpdated 11 hours ago OpenAI CEO Sam Altman testifies before a Senate Judiciary Privacy, Technology & the Law Subcommittee hearing titled 'Oversight of A.I.: Rules for Artificial Intelligence' on Capitol Hill in Washington, U.S., May 16, 2023. REUTERS/Elizabeth Frantz/File Photo Acquire Licensing Rights Companies Openai LLC Follow Microsoft Corp Follow Nov 17 (Reuters) - Artificial intelligence may be well-known for generating human-like images out of whole cloth, but if the software has a public face it is Sam Altman’s. The co-founder of OpenAI, which caused a sensation just a year ago with the introduction of ChatGPT, Altman has presented himself as the benevolent wizard behind the curtain of a technology that many say could upend entire industries and even mankind itself. Advertisement · Scroll to continue But on Friday it was the earnest Altman who was upended after OpenAI’s board, in a surprise move, stripped him of his CEO title and directorship. He is out. Directors of the company, now worth about $80 billion, cited a failure to be \"consistently candid in his communications.\" Further details of what finally led to the ouster of Altman were not immediately clear Friday. The company reassured staff that it would be fine without him, but the Silicon Valley superstar, who once ran the best known startup incubator YCombinator, or YC, leaves the company with a big hole to fill in its fundraising efforts: maintaining the software costs some very real money. It also takes talented engineers, who flocked to Altman. Advertisement · Scroll to continue Altman, 38, was plucky to the end of his run at OpenAI. He was seen mingling with attendees briefly at an AI conference in San Francisco on Wednesday, and the next day spoke on a panel with a top Meta executive at the ongoing APEC summit in San Francisco, while the board deliberated on his future. In a post on AI-rival Elon Musk’s X, he said Friday of OpenAI: “I loved working with such talented people. Will have more to say about what’s next later.” Advertisement · Scroll to continue Altman is credited with almost singlehandedly convincing Microsoft CEO Satya Nadella to commit $10 billion to the company and leading the company's tender offer transactions this year that fueled a nearly three-fold valuation bump from $29 billion to over $80 billion. His aura also helped attract AI engineering talent in what may be the most competitive market seen in tech circles in years. He successfully recruited from Google, Microsoft and other established tech giants with surer pay packages, promising to let them in on the ground floor of a world-altering technology. That tech has since fueled concerns of doomsday scenarios where the software takes over the world, steals intellectual property with impunity and makes secondary education a hotbed of cheating or simply unnecessary; but Altman at an event on Thursday said \"heavy regulation\" wasn't needed for some time. \"At some point when the model can do like the equivalent output of a whole company, and then a whole country and then the whole world,\" such rules would be helpful, he said. Altman grew up in St. Louis, Missouri and attended Stanford for one year, marking a tradition of sorts among tech titans of dropping out before getting their degrees. In addition to his efforts with OpenAI he started a cryptocurrency firm this year that scans people's irises for verification. Altman’s moonshot ethos likely played well among ambitious engineers tired of toiling away for blue chip tech firms. \"As long as you are right, being misunderstood by most people is a strength not a weakness,” wrote Altman in a blog post three years ago. “You and a small group of rebels get the space to solve an important problem that might otherwise not get solved.\" Reporting by Greg Bensinger; editing by Diane Craft Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Greg Bensinger Thomson Reuters Greg Bensinger joined Reuters as a technology correspondent in 2022 focusing on the world's largest technology companies. He was previously a member of The New York Times editorial board and a technology beat reporter for The Washington Post and The Wall Street Journal. He also worked for Bloomberg News writing about the auto and telecommunications industries. He studied English literature at The University of Virginia and graduate journalism at Columbia University. Greg lives in San Francisco with his wife and two children. Read Next Business category Sri Lanka seeks investors for nuclear power plants Sri Lanka will call for expressions of interest (EOI) in setting up nuclear power plants, its energy minister said on Friday, as it seeks cheap electricity to support its economic recovery. Technology category ChatGPT maker OpenAI ousts CEO Sam Altman The board of the company behind ChatGPT on Friday fired OpenAI CEO Sam Altman - to many, the human face of generative AI - sending shock waves across the tech industry. Greg Brockman, OpenAI president and co-founder, quit the company, he announced on messaging platform X. Boards, Policy & Regulation category China vows to support property sector, tackle local debt China's central bank and financial regulators pledged on Friday to ensure financing support for the property sector and to work together to resolve local government debt risks. Business category Samsung boss denies wrongdoing as South Korea prosecutors seek jail term over 2015 merger Samsung Electronics chairman Jay Y. Lee denied wrongdoing on Friday after South Korean prosecutors called for him to be jailed for five years on charges of accounting fraud and stock price manipulation involving an $8 billion merger of Samsung affiliates in 2015. World category US lawmakers pressure FDIC chief over misconduct allegations Lawmakers on Friday renewed public calls for an investigation into the allegations of sexual harassment and other workplace misconduct at the U.S. Federal Deposit Insurance Corporation.",
    "originSummary": [
      "Sam Altman, CEO of OpenAI and co-founder of ChatGPT, has been ousted by the company's board.",
      "Altman's removal was due to a failure to be consistently candid in his communications.",
      "Altman's departure leaves a significant gap in OpenAI's fundraising and talent acquisition efforts."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  },
  {
    "title": "Will Fear of Criminals Lead to Celebration of Police Tactics?",
    "originLink": "https://www.techdirt.com/2023/11/17/surveillance-tech-companies-are-writing-press-releases-for-cops-worse-news-agencies-are-publishing-them/",
    "originBody": "Koby (profile) says: November 17, 2023 at 11:39 am Just Like The Movies I remember seeing a Batman film years ago. Although I it was a good movie, I also thought it was a little unrealistic that some vigilante would be so celebrated. Nowadays, I see the potential appeal. With crime and carjackings proliferating across major cities, folks are celebrating when crooks get caught. It’s like a real-life Batman episode. If the current big-city crime wave continues, ordinary people will fear the crooks so much more than police encroachment into privacy. There’s a risk that someday, a Stingray will prompt applause. Just as a vigilante superhero movie brings excitement, the media will hop on the bandwagon. You think it will damage the credibility of media outlets, but I’m not so sure that will continue to be the case. Collapse replies (4) Reply View in chronology Make this comment the first word Make this comment the last word",
    "originSummary": [
      "The author reflects on the unrealistic portrayal of vigilantes being celebrated in Batman films.",
      "Due to the increase in crime, people are now celebrating when criminals are caught.",
      "The author predicts that if the crime wave persists, there may be a shift where people fear criminals more than police intrusions into privacy. They also wonder if media outlets will start celebrating police tactics like the use of Stingrays, potentially impacting their credibility."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700312735345
  }
]
