[
  {
    "id": 41325889,
    "title": "Les API de Claude prennent désormais en charge les requêtes CORS, permettant aux applications côté client",
    "originLink": "https://simonwillison.net/2024/Aug/23/anthropic-dangerous-direct-browser-access/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325889",
    "commentBody": "",
    "originSummary": [
      "« Anthropic a activé la prise en charge de CORS (Cross-Origin Resource Sharing) pour leurs API JSON, permettant des appels directs aux LLMs (Large Language Models) de Claude depuis le navigateur d'un utilisateur. »",
      "« Cette fonctionnalité est activée en ajoutant l'en-tête de requête HTTP `anthropic-dangerous-direct-browser-access: true`, facilitant les appels basés sur le navigateur sans proxy. »",
      "« Cette mise à jour est particulièrement utile pour les outils ou applications internes où les utilisateurs fournissent leurs propres clés API, comme l'illustre l'application Haiku qui génère des haïkus à partir de photos en utilisant l'API d'Anthropic. »"
    ],
    "commentSummary": [
      "Les API de Claude prennent désormais en charge les requêtes CORS (Cross-Origin Resource Sharing), permettant aux applications côté client d'interagir directement avec elles.",
      "Les utilisateurs peuvent apporter leurs propres clés, ce qui réduit la maintenance et les coûts, facilitant ainsi la distribution d'applications sans publicité par les développeurs sans entretien constant.",
      "Bien que certains utilisateurs préfèrent OAuth pour une sécurité renforcée, l'approche « apportez vos propres clés » reste populaire pour sa simplicité et son rapport coût-efficacité, bien qu'elle nécessite de faire confiance au site utilisé."
    ],
    "points": 300,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1724382333
  },
  {
    "id": 41326604,
    "title": "« Nous devons libérer le fichier d'adresses postales »",
    "originLink": "https://takes.jamesomalley.co.uk/p/secret-paf-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326604",
    "commentBody": "",
    "originSummary": [
      "« Le rapport confidentiel souligne la nécessité de libérer le fichier d'adresses postales (PAF) du contrôle privé pour favoriser l'innovation et la croissance économique. »",
      "« Depuis la privatisation de Royal Mail en 2013, l'accès au PAF est devenu coûteux, freinant le développement. »",
      "Une tentative du gouvernement en 2016 de recréer le PAF sans les données de Royal Mail a abouti à un ensemble de données défectueux, prouvant que cela était impraticable et coûteux ; ainsi, le rapport recommande que le gouvernement récupère et publie le PAF en tant que données ouvertes."
    ],
    "commentSummary": [
      "« Le fichier d'adresses par code postal (PAF) au Royaume-Uni est contrôlé par Royal Mail et est coûteux à accéder, ce qui entraîne des problèmes de précision des adresses et de complétude des données. »",
      "Le gouvernement français a créé la « BAN » (Base Adresse Nationale), une base de données d'adresses postales gratuite et ouverte avec des coordonnées GPS, des interfaces de mise à jour et des API, servant de modèle pour le Royaume-Uni.",
      "Les défenseurs soutiennent que rendre le PAF librement disponible au Royaume-Uni, à l'instar du BAN en France, améliorerait la précision et l'accessibilité des adresses."
    ],
    "points": 269,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1724394989
  },
  {
    "id": 41328784,
    "title": "Un étudiant de 17 ans dévoile la liste noire 'secrète' des sites pirates en Allemagne",
    "originLink": "https://torrentfreak.com/17-year-old-student-exposes-germanys-secret-pirate-site-blocklist-240822/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328784",
    "commentBody": "",
    "originSummary": [
      "« Plusieurs grands fournisseurs d'accès à Internet en Allemagne bloquent des sites pirates grâce à un accord volontaire avec les détenteurs de droits, en gardant les noms de domaine concernés secrets. »",
      "« Un étudiant de 17 ans, Damian, et ses amis ont lancé CUIIliste.de pour exposer tous les domaines bloqués, plaidant pour la transparence et la liberté d'expression. »",
      "Le système institutionnalisé de blocage des sites pirates en Allemagne, CUII, émet des ordres de blocage sans jugements de tribunal, ce qui soulève des préoccupations concernant la transparence et la censure potentielle."
    ],
    "commentSummary": [
      "Un étudiant de 17 ans a révélé la liste secrète des sites pirates bloqués en Allemagne, suscitant des discussions sur la manière de contourner ces blocages en utilisant des VPN, DNSCrypt et des serveurs DNS alternatifs.",
      "Les utilisateurs ont débattu de la facilité de contourner le blocage basé sur le DNS et des défis juridiques et techniques associés au torrenting en Allemagne.",
      "Les implications plus larges de la censure d'Internet et l'efficacité de telles mesures ont également été discutées."
    ],
    "points": 253,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724419219
  },
  {
    "id": 41330007,
    "title": "« Le DOJ poursuit RealPage pour un système de tarification algorithmique qui nuit aux locataires »",
    "originLink": "https://www.justice.gov/opa/pr/justice-department-sues-realpage-algorithmic-pricing-scheme-harms-millions-american-renters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330007",
    "commentBody": "",
    "originSummary": [
      "« Le ministère de la Justice et plusieurs procureurs généraux d'État ont intenté une action civile antitrust contre RealPage Inc. pour avoir prétendument utilisé un système de tarification algorithmique afin de réduire la concurrence entre les propriétaires et de monopoliser le marché des logiciels de gestion des revenus commerciaux. »",
      "« La poursuite allègue que RealPage a violé les sections 1 et 2 de la loi Sherman en partageant des informations non publiques sur les taux de location entre les propriétaires pour influencer les prix des appartements, nuisant ainsi à des millions de locataires américains en les privant de conditions de location compétitives. »",
      "« RealPage, qui détiendrait une part de marché de 80 % dans ce secteur des logiciels, est accusé d'utiliser ses données pour maintenir un monopole et limiter la concurrence. »"
    ],
    "commentSummary": [
      "« Le DOJ a intenté une action en justice contre RealPage, alléguant que son logiciel de tarification algorithmique facilite la fixation des prix entre les propriétaires, entraînant une augmentation des loyers. »",
      "« Le logiciel utilise des données exclusives pour suggérer des prix de location, ce que le DOJ affirme réduire la concurrence et nuire aux locataires en évitant des prix compétitifs. »",
      "« Le procès a déclenché un débat plus large sur le logement en tant qu'industrie axée sur le profit, abordant des questions telles que les lois de zonage, le contrôle des loyers et l'équilibre entre l'offre et la demande sur les marchés du logement. »"
    ],
    "points": 216,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1724428306
  },
  {
    "id": 41329505,
    "title": "SurrealEngine : Réimplémentation open-source de l'Unreal Engine avec UT99 jouable",
    "originLink": "https://github.com/dpjudas/SurrealEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41329505",
    "commentBody": "",
    "originSummary": [
      "« Le projet Surreal Engine vise à réimplémenter l'Unreal Engine original pour rendre les cartes d'Unreal Tournament (UT99) jouables. »",
      "« Le moteur peut charger et rendre des cartes, avec la machine virtuelle Unrealscript presque terminée, mais certaines fonctions natives manquent encore, ce qui peut entraîner des exceptions potentielles. »",
      "Les jeux pris en charge incluent diverses versions d'Unreal Tournament, Unreal, Deus Ex, et d'autres, avec certains jeux comme Unreal Tournament v436 et Unreal Gold v226 déjà en état jouable."
    ],
    "commentSummary": [
      "« SurrealEngine est une réimplémentation open-source de l'Unreal Engine 1, permettant des versions jouables de Unreal Tournament 99 (UT99). »",
      "« Ce projet est important car il redonne vie à un moteur de jeu classique, le rendant accessible et jouable sur du matériel moderne sans nécessiter le moteur propriétaire original. »",
      "Le réaménagement prend en charge les anciens matériels avec des cartes vidéo de 64/128 Mo et utilise SDL2 et OpenGL 2.1, en mettant l'accent sur la préservation et l'accessibilité des jeux vintage."
    ],
    "points": 187,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1724424609
  },
  {
    "id": 41323454,
    "title": "« Que se passe-t-il dans l'apprentissage automatique ? Quelques modèles minimaux »",
    "originLink": "https://writings.stephenwolfram.com/2024/08/whats-really-going-on-in-machine-learning-some-minimal-models/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41323454",
    "commentBody": "",
    "originSummary": [
      "« Malgré les avancées dans les réseaux neuronaux, le fonctionnement interne et les raisons de leur efficacité restent en grande partie mystérieux, ce qui incite à des efforts pour simplifier et visualiser ces modèles. »",
      "« Les réseaux neuronaux en maillage, qui limitent les connexions à au plus deux neurones, offrent une alternative plus visualisable et compréhensible tout en exécutant des fonctions complexes. »",
      "Les systèmes discrets, inspirés par l'évolution biologique, utilisent des règles simples et des mutations aléatoires pour atteindre des objectifs, offrant une nouvelle approche de l'apprentissage automatique qui exploite l'irréductibilité computationnelle."
    ],
    "commentSummary": [
      "« L'article de Stephen Wolfram explore les modèles minimaux et l'univers computationnel, en utilisant les automates cellulaires pour examiner des questions philosophiques profondes. »",
      "« La discussion inclut les réseaux neuronaux, la complexité computationnelle et le potentiel de nouvelles techniques d'apprentissage automatique efficaces, suscitant à la fois des éloges et des critiques. »",
      "« L'article souligne le débat en cours sur la nature de l'apprentissage automatique et la quête de nouveaux algorithmes plus efficaces. »"
    ],
    "points": 173,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1724353547
  },
  {
    "id": 41330478,
    "title": "Conte de mise en garde sur l'utilisation de la banque Chase pour les entreprises indépendantes",
    "originLink": "https://jxnl.co/writing/2024/09/21/chase-bank-small-business-nightmare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330478",
    "commentBody": "",
    "originSummary": [
      "L'auteur a rencontré un grave problème avec la Chase Bank, où 180 000 $ ont été gelés sans avertissement, perturbant presque leurs opérations commerciales.",
      "« Malgré une relation de dix ans et la fourniture de tous les documents nécessaires, la Chase Bank a bloqué les transactions et n'a pas résolu le problème rapidement, entraînant une perte de confiance. »",
      "L'auteur souligne l'importance de diversifier les options bancaires et suggère de considérer des alternatives comme Mercury Bank, qu'ils ont trouvé plus favorable aux besoins des petites entreprises."
    ],
    "commentSummary": [
      "« Un conte de mise en garde souligne les défis d'utiliser la banque Chase pour les entreprises indépendantes, avec un cas spécifique où un compte a été fermé sans raisons claires, causant des désagréments significatifs. »",
      "Des expériences similaires avec Citibank sont partagées, où des divergences dans les noms de compte ont conduit à de longues luttes pour accéder aux fonds de retraite, nécessitant une documentation exhaustive et de multiples interactions avec la banque.",
      "« La discussion souligne le problème plus large des inefficacités bureaucratiques des grandes banques et du manque d'autonomisation des clients, ce qui pousse certains à envisager des alternatives comme les coopératives de crédit ou les solutions fintech. »"
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1724431098
  },
  {
    "id": 41325719,
    "title": "Surfer : Centralisez toutes vos données personnelles provenant des plateformes en ligne",
    "originLink": "https://github.com/CEREBRUS-MAXIMUS/Surfer-Data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325719",
    "commentBody": "",
    "originSummary": [
      "« Surfer est un exportateur d'empreintes numériques qui consolide les données personnelles de diverses plateformes en ligne dans un seul dossier, répondant ainsi au problème des données dispersées. »",
      "« Les plateformes prises en charge incluent Twitter, LinkedIn, GitHub, YouTube, Spotify, Notion, ChatGPT, Gmail, avec iMessages, les signets Twitter et Reddit à venir bientôt. »",
      "Cette application utilise Supabase pour des analyses anonymisées et a une feuille de route qui inclut l'obtention d'un certificat de signature de code Windows, l'ajout de plus de plateformes et l'exploration de l'intégration des dispositifs portables."
    ],
    "commentSummary": [
      "Surfer : le premier exportateur d'empreintes numériques au monde\" prétend centraliser les données personnelles de sept grandes plateformes en ligne, mais les utilisateurs estiment qu'il a besoin de plus d'intégrations pour être vraiment utile.",
      "« Le projet a suscité des discussions sur la confidentialité des données, certains plaidant pour des solutions décentralisées et d'autres suggérant des améliorations telles que l'exportation quotidienne et un meilleur marketing. »",
      "« Les alternatives et outils similaires mentionnés incluent GraphRag de Microsoft, HPI de Karlicoss, DogSheep et Peergos, mettant en évidence un paysage concurrentiel pour les outils de gestion des données personnelles. »"
    ],
    "points": 127,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1724379180
  },
  {
    "id": 41326357,
    "title": "Confessions d'un physicien théoricien",
    "originLink": "https://nautil.us/confessions-of-a-theoretical-physicist-787199/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326357",
    "commentBody": "",
    "originSummary": [
      "« Vijay Balasubramanian, un physicien théoricien, partage des idées dans son article \"Confessions d'un physicien théoricien,\" publié le 19 août 2024. »",
      "« Balasubramanian occupe des postes à l'Université de Pennsylvanie, à la Vrije Universiteit Brussel et à l'Institut de Santa Fe, et sera le professeur George Eastman à l'Université d'Oxford pour l'année académique 2024-2025. »",
      "Nautilus offre une expérience sans publicité pour les membres et propose des articles sur des sujets variés tels que les neurosciences, la technologie et la philosophie."
    ],
    "commentSummary": [
      "Un physicien théoricien partage des perspectives sur la nature de la découverte scientifique, en soulignant l'importance de la curiosité et des moments d'eureka dans l'avancement des connaissances.",
      "« La discussion met en lumière la nature imprévisible et souvent collaborative des percées en physique, illustrant comment des suggestions désinvoltes peuvent conduire à des changements significatifs dans la direction de la recherche. »",
      "« Le post aborde également des débats philosophiques plus larges sur le libre arbitre et l'esprit humain, déclenchés par la nature spontanée des moments d'eureka, et comment ces moments remettent en question notre compréhension de la prise de décision consciente. »"
    ],
    "points": 126,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724390075
  },
  {
    "id": 41328964,
    "title": "« Le nombre de morts stupéfiant des mensonges scientifiques »",
    "originLink": "https://www.vox.com/future-perfect/368350/scientific-research-fraud-crime-jail-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328964",
    "commentBody": "",
    "originSummary": [
      "« La fraude scientifique peut entraîner des conséquences graves, y compris une augmentation des taux de mortalité, comme on l'a vu dans le cas du cardiologue Don Poldermans, dont les données falsifiées ont conduit à environ 800 000 décès. »",
      "« La mauvaise conduite scientifique est plus répandue qu'on ne le croit généralement, avec des répercussions minimales pour les contrevenants, et il peut falloir des années pour rétracter des études erronées, ce qui affecte les soins aux patients. »",
      "« Il existe des propositions visant à criminaliser la fraude scientifique ou à établir des comités de révision indépendants pour garantir la responsabilité, car les sanctions actuelles sont insuffisantes et les institutions évitent souvent des enquêtes approfondies pour protéger leur réputation. »"
    ],
    "commentSummary": [
      "« La discussion se concentre sur l'impact sévère de la fraude scientifique dans la recherche médicale, avec un cas mis en évidence où des recherches frauduleuses sur les bêta-bloquants pourraient avoir conduit à 800 000 décès. »",
      "« Les questions clés débattues incluent des problèmes systémiques tels que la dépendance excessive à des études uniques, de mauvaises pratiques de réplication et une mauvaise interprétation des résultats par les médias. »",
      "Les suggestions d'amélioration incluent de meilleurs freins et contrepoids, la poursuite des chercheurs frauduleux et l'amélioration des pratiques de recherche et de la responsabilité dans divers domaines."
    ],
    "points": 113,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724420720
  },
  {
    "id": 41325514,
    "title": "Zettlr : Prise de notes et publication avec Markdown",
    "originLink": "https://lwn.net/Articles/984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325514",
    "commentBody": "",
    "originSummary": [
      "« Zettlr est un éditeur Markdown WYSIWYM (What You See Is What You Mean), adapté à diverses tâches d'écriture et offrant une personnalisation poussée. »",
      "« La dernière version, 3.2.0, a été publiée le 11 juin 2024, et le logiciel est multiplateforme, disponible pour Linux, Windows et macOS. »",
      "« Zettlr inclut des fonctionnalités telles que le rendu Markdown en temps réel, des vues multiples de documents, des modes Emacs et Vim, et des outils pour le suivi de la progression de l'écriture, les citations et la vérification grammaticale. »"
    ],
    "commentSummary": [
      "« Zettlr est un outil de prise de notes et de publication qui utilise Markdown, attirant l'attention pour sa nature open-source et l'absence de verrouillage par un fournisseur. »",
      "« Les utilisateurs comparent Zettlr à d'autres outils comme Obsidian, en mettant en avant les différences en termes d'extensibilité, de performance et d'options de personnalisation. »",
      "« Les discussions soulignent l'importance de Markdown pour l'interopérabilité et la flexibilité, certains utilisateurs le préférant aux éditeurs de texte enrichi pour sa simplicité et sa compatibilité avec les systèmes de contrôle de version comme Git. »"
    ],
    "points": 108,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1724375411
  },
  {
    "id": 41327956,
    "title": "Externalisation coûte des milliards à Boeing (2019)",
    "originLink": "https://medium.com/javascript-scene/why-cutting-costs-is-expensive-how-9-hour-software-engineers-cost-boeing-billions-b76dbe571957",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41327956",
    "commentBody": "",
    "originSummary": [
      "Boeing a pris des mesures de réduction des coûts, notamment en externalisant l'ingénierie logicielle à des sous-traitants moins chers, ce qui a contribué aux défaillances du 737 MAX, entraînant deux accidents mortels et l'immobilisation de l'avion dans le monde entier.",
      "« Ces incidents ont entraîné des pertes de plus de 6 milliards de dollars en capitalisation boursière pour Boeing, soulignant les dangers de privilégier les économies de coûts au détriment de la qualité des logiciels. »",
      "« L'affaire souligne l'importance d'investir dans des pratiques de développement logiciel de haute qualité, une formation adéquate, un mentorat et des tests rigoureux pour prévenir des résultats coûteux et tragiques. »"
    ],
    "commentSummary": [
      "« L'externalisation du développement de logiciels par Boeing a entraîné des pertes financières importantes et des problèmes de qualité, soulignant les risques associés à de telles pratiques. »",
      "« Le défaut du système d'augmentation des caractéristiques de manœuvre (MCAS) dans le 737 MAX est un exemple frappant, où les mesures de réduction des coûts et des protocoles de sécurité inadéquats ont entraîné des résultats tragiques. »",
      "« La discussion souligne la nécessité d'une supervision professionnelle en ingénierie et d'une éventuelle certification pour les systèmes logiciels critiques afin de prévenir des incidents similaires à l'avenir. »"
    ],
    "points": 106,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1724411344
  },
  {
    "id": 41328447,
    "title": "Nanolog prend en charge la journalisation avec une latence médiane de 7 ns",
    "originLink": "https://github.com/PlatformLab/NanoLog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328447",
    "commentBody": "",
    "originSummary": [
      "« NanoLog est un système de journalisation haute performance pour C++ qui atteint plus de 80 millions de journaux par seconde avec une latence médiane de juste un peu plus de 7 nanosecondes. »",
      "« Il surpasse d'autres systèmes de journalisation comme spdlog, Log4j2, Boost, glog et Windows Event Tracing (ETW) tant en termes de débit que de latence d'exécution. »",
      "« NanoLog utilise une approche unique en extrayant les informations de journal statiques au moment de la compilation et en enregistrant uniquement les composants dynamiques à l'exécution, reportant le formatage à un processus hors ligne. »"
    ],
    "commentSummary": [
      "« Nanolog propose une journalisation avec une latence médiane de 7 nanosecondes, bien que la latence réelle des applications soit d'environ 17 nanosecondes. »",
      "« Il utilise un fil d'exécution en arrière-plan pour gérer la plupart du travail, visant à minimiser la surcharge dans le fil de journalisation. »",
      "« Cette technique, bien que non révolutionnaire, est couramment utilisée dans les logiciels embarqués et autres systèmes de journalisation pour optimiser les performances. »"
    ],
    "points": 102,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1724416335
  },
  {
    "id": 41326179,
    "title": "« EPUBCheck – Le vérificateur de conformité officiel pour les publications ePub »",
    "originLink": "https://github.com/w3c/epubcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326179",
    "commentBody": "",
    "originSummary": [
      "EPUBCheck est l'outil officiel de validation des publications EPUB, disponible en tant qu'outil en ligne de commande ou bibliothèque Java, et maintenu par le Consortium DAISY pour le W3C.",
      "« La dernière version, EPUBCheck v5.1.0, prend en charge la validation des fichiers EPUB 2 et 3 selon la spécification EPUB 3.3. »",
      "Un soutien financier est nécessaire pour son développement et sa maintenance continus, et il est open source sous la licence BSD à 3 clauses."
    ],
    "commentSummary": [
      "EPUBCheck est l'outil officiel de validation des publications ePub, garantissant qu'elles respectent les normes de l'industrie.",
      "« L'industrie de l'édition repose souvent sur des pratiques obsolètes, de nombreux auteurs utilisant Microsoft Word, ce qui nécessite une conversion manuelle pour les livres électroniques et imprimés. »",
      "« Les utilisateurs ont partagé diverses méthodes pour créer des ebooks, y compris LaTeX et pandoc, et ont discuté de l'importance d'outils comme EPUBCheck pour réussir les vérifications de validation. »"
    ],
    "points": 99,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724387495
  },
  {
    "id": 41326138,
    "title": "Le sémaglutide comme l'Ozempic brûle la graisse viscérale, ne se contente pas de supprimer l'appétit",
    "originLink": "https://onlinelibrary.wiley.com/doi/full/10.1002/oby.24126",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326138",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Le sémaglutide, similaire à l'Ozempic, cible et réduit la graisse viscérale, qui est liée aux troubles métaboliques et à la résistance à l'insuline, offrant des avantages pour la santé au-delà de la suppression de l'appétit.",
      "« La capacité de ce traitement à cibler spécifiquement la graisse viscérale le distingue des médicaments de perte de poids précédents, offrant potentiellement des avantages pour la santé plus larges. »",
      "« La popularité croissante du sémaglutide met en évidence la demande de solutions efficaces pour la perte de poids, malgré les préoccupations concernant la dépendance à long terme et les risques inconnus. »"
    ],
    "points": 97,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724386715
  }
]
