[
  {
    "id": 41325889,
    "title": "Claude's API tukee nyt CORS-pyyntöjä, mikä mahdollistaa asiakaspään sovellukset",
    "originLink": "https://simonwillison.net/2024/Aug/23/anthropic-dangerous-direct-browser-access/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325889",
    "commentBody": "",
    "originSummary": [
      "Anthropic on ottanut käyttöön CORS (Cross-Origin Resource Sharing) -tuen JSON-rajapinnoilleen, mikä mahdollistaa suorat kutsut Claude LLM:ille (Large Language Models) käyttäjän selaimesta.",
      "Tämä ominaisuus aktivoidaan lisäämällä HTTP-pyyntöotsikko `anthropic-dangerous-direct-browser-access: true`, mikä mahdollistaa selaimen kautta tehtävät kutsut ilman välityspalvelinta.",
      "Tämä päivitys on erityisen hyödyllinen sisäisille työkaluille tai sovelluksille, joissa käyttäjät antavat omat API-avaimensa, esimerkkinä Haiku-sovellus, joka luo haikuja valokuvista käyttämällä Anthropic API:a."
    ],
    "commentSummary": [
      "Claudin API tukee nyt CORS (Cross-Origin Resource Sharing) -pyyntöjä, mikä mahdollistaa asiakaspään sovellusten suoran vuorovaikutuksen sen kanssa.",
      "Kayttäjät voivat tuoda omat avaimensa, mikä vähentää ylläpitoa ja kustannuksia, tehden kehittäjille helpommaksi jakaa mainoksettomia sovelluksia ilman jatkuvaa ylläpitoa.",
      "Vaikka jotkut käyttäjät suosivat OAuthia parannetun turvallisuuden vuoksi, \"tuo omat avaimet\" -lähestymistapa on edelleen suosittu sen yksinkertaisuuden ja kustannustehokkuuden vuoksi, vaikka se vaatiikin luottamusta käytettävään sivustoon."
    ],
    "points": 300,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1724382333
  },
  {
    "id": 41326604,
    "title": "Meidän täytyy vapauttaa postinumerotietokanta",
    "originLink": "https://takes.jamesomalley.co.uk/p/secret-paf-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326604",
    "commentBody": "",
    "originSummary": [
      "Luottamuksellinen raportti korostaa tarvetta vapauttaa Postinumero-osoitetiedosto (PAF) yksityisestä hallinnasta innovaation ja talouskasvun edistämiseksi.",
      "Royal Mailin yksityistämisen jälkeen vuonna 2013 PAF:in käyttö on tullut kalliiksi, mikä on tukahduttanut kehitystä.",
      "Vuonna 2016 hallituksen yritys luoda PAF uudelleen ilman Royal Mailin tietoja johti virheelliseen tietokantaan, mikä osoitti sen olevan epäkäytännöllistä ja kallista; siksi raportti suosittelee, että hallitus ottaa PAF:n takaisin haltuunsa ja julkaisee sen avoimena datana."
    ],
    "commentSummary": [
      "Postinumero-osoitetiedosto (PAF) Isossa-Britanniassa on Royal Mailin hallinnassa ja sen käyttö on kallista, mikä johtaa ongelmiin osoitetietojen tarkkuudessa ja tietojen kattavuudessa.",
      "Ranskan hallitus on luonut \"BAN\" (Base Adresse Nationale) -nimisen ilmaisen ja avoimen postiosoiterekisterin, joka sisältää GPS-koordinaatit, päivitysrajapinnat ja API:t, ja toimii mallina Yhdistyneelle kuningaskunnalle.",
      "Kannattajat väittävät, että PAF:n tekeminen vapaasti saataville Isossa-Britanniassa, kuten Ranskan BAN, parantaisi osoitetietojen tarkkuutta ja saatavuutta."
    ],
    "points": 269,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1724394989
  },
  {
    "id": 41328784,
    "title": "17-vuotias opiskelija paljastaa Saksan 'salaisen' piraattisivustojen estolistan",
    "originLink": "https://torrentfreak.com/17-year-old-student-exposes-germanys-secret-pirate-site-blocklist-240822/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328784",
    "commentBody": "",
    "originSummary": [
      "Useat suuret internet-palveluntarjoajat Saksassa estävät piraattisivustoja vapaaehtoisen sopimuksen kautta oikeudenhaltijoiden kanssa, pitäen estettyjen verkkotunnusten nimet salassa.",
      "17-vuotias opiskelija Damian ja hänen ystävänsä perustivat CUIIliste.de-sivuston paljastaakseen kaikki estotut verkkotunnukset, edistäen läpinäkyvyyttä ja sananvapautta.",
      "Saksan institutionalisoitu piraattisivustojen estojärjestelmä, CUII, antaa estoja ilman oikeuden päätöksiä, mikä herättää huolta läpinäkyvyydestä ja mahdollisesta sensuurista."
    ],
    "commentSummary": [
      "17-vuotias opiskelija paljasti Saksan salaisen piraattisivustojen estolistan, mikä herätti keskusteluja näiden estojen kiertämisestä VPN:ien, DNSCryptin ja vaihtoehtoisten DNS-palvelimien avulla.",
      "Käyttäjät keskustelivat DNS-pohjaisen eston kiertämisen helppoudesta sekä torrenttien käyttöön liittyvistä laillisista ja teknisistä haasteista Saksassa.",
      "Internet-sensuurin laajemmat vaikutukset ja tällaisten toimenpiteiden tehokkuus olivat myös keskustelun aiheina."
    ],
    "points": 253,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724419219
  },
  {
    "id": 41330007,
    "title": "Yhdysvaltain oikeusministeriö haastaa RealPagen oikeuteen algoritmiseen hinnoittelujärjestelmään liittyen, joka vahingoittaa vuokralaisia",
    "originLink": "https://www.justice.gov/opa/pr/justice-department-sues-realpage-algorithmic-pricing-scheme-harms-millions-american-renters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330007",
    "commentBody": "",
    "originSummary": [
      "Oikeusministeriö ja useat osavaltioiden oikeusministerit ovat nostaneet siviilioikeudellisen kilpailunrajoitusjutun RealPage Inc. -yhtiötä vastaan, syyttäen sitä algoritmiseen hinnoittelujärjestelmään perustuvan kilpailun vähentämisestä vuokranantajien keskuudessa ja kaupallisen tulonhallintaohjelmistojen markkinoiden monopolisoimisesta.",
      "Oikeusjuttu väittää, että RealPage rikkoi Sherman Actin 1 ja 2 pykälää jakamalla ei-julkista vuokrahintatietoa vuokranantajien kesken vaikuttaakseen asuntojen hinnoitteluun, mikä vahingoitti miljoonia amerikkalaisia vuokralaisia riistämällä heiltä kilpailukykyiset vuokraehdot.",
      "RealPage, jonka väitetään hallitsevan 80 %:n markkinaosuutta tällä ohjelmistoalalla, on syytetty datansa käyttämisestä monopolin ylläpitämiseen ja kilpailun rajoittamiseen."
    ],
    "commentSummary": [
      "Yhdysvaltain oikeusministeriö on nostanut kanteen RealPagea vastaan, väittäen, että sen algoritminen hinnoitteluohjelmisto helpottaa vuokranantajien välistä hintakartellia, mikä johtaa korkeampiin vuokriin.",
      "Ohjelmisto käyttää omia tietoja ehdottaakseen vuokrahintoja, mikä oikeusministeriön mukaan vähentää kilpailua ja vahingoittaa vuokralaisia välttämällä kilpailukykyisiä hintoja.",
      "Oikeusjuttu on herättänyt laajemman keskustelun asumisesta voittoa tavoittelevana teollisuutena, koskien muun muassa kaavoituslakeja, vuokrasääntelyä ja kysynnän ja tarjonnan tasapainoa asuntomarkkinoilla."
    ],
    "points": 216,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1724428306
  },
  {
    "id": 41329505,
    "title": "SurrealEngine: Unreal Enginen avoimen lähdekoodin uudelleentoteutus, jossa voi pelata UT99:ää",
    "originLink": "https://github.com/dpjudas/SurrealEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41329505",
    "commentBody": "",
    "originSummary": [
      "Surreal Engine -projekti pyrkii toteuttamaan alkuperäisen Unreal Enginen uudelleen, jotta Unreal Tournament (UT99) -kartat olisivat pelattavissa.",
      "Moottori voi ladata ja renderöidä karttoja, ja Unrealscript VM on lähes valmis, mutta jotkin alkuperäiset funktiot puuttuvat edelleen, mikä voi johtaa mahdollisiin poikkeuksiin.",
      "Tuetut pelit sisältävät useita versioita Unreal Tournamentista, Unrealista, Deus Existä ja muista, ja jotkut pelit, kuten Unreal Tournament v436 ja Unreal Gold v226, ovat jo pelattavassa tilassa."
    ],
    "commentSummary": [
      "SurrealEngine on avoimen lähdekoodin uudelleentoteutus Unreal Engine 1:stä, joka mahdollistaa pelattavat versiot Unreal Tournament 99:stä (UT99).",
      "Tämä projekti on merkittävä, koska se herättää henkiin klassisen pelimoottorin, tehden siitä saatavilla ja pelattavissa nykyaikaisella laitteistolla ilman alkuperäistä suljettua moottoria.",
      "Uudelleenimplementointi tukee vanhempaa laitteistoa, jossa on 64/128MB videokortit, ja käyttää SDL2:ta ja OpenGL 2.1:tä, korostaen vanhojen pelien säilyttämistä ja saavutettavuutta."
    ],
    "points": 187,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1724424609
  },
  {
    "id": 41323454,
    "title": "Mitä koneoppimisessa tapahtuu? Joitakin minimaalisia malleja",
    "originLink": "https://writings.stephenwolfram.com/2024/08/whats-really-going-on-in-machine-learning-some-minimal-models/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41323454",
    "commentBody": "",
    "originSummary": [
      "Huolimatta hermoverkkojen edistysaskeleista, niiden sisäiset toiminnat ja syyt niiden tehokkuudelle ovat edelleen suurelta osin mysteeri, mikä on johtanut pyrkimyksiin yksinkertaistaa ja visualisoida näitä malleja.",
      "Verkkoneuraaliverkot, jotka rajoittavat yhteydet enintään kahteen neuroniin, tarjoavat visuaalisemman ja ymmärrettävämmän vaihtoehdon samalla, kun ne suorittavat monimutkaisia toimintoja.",
      "Epäjatkuvat järjestelmät, jotka ovat saaneet inspiraationsa biologisesta evoluutiosta, käyttävät yksinkertaisia sääntöjä ja satunnaisia mutaatioita tavoitteiden saavuttamiseksi, tarjoten uuden lähestymistavan koneoppimiseen, joka hyödyntää laskennallista peruuttamattomuutta."
    ],
    "commentSummary": [
      "Stephen Wolframin artikkeli syventyy minimimalleihin ja laskennalliseen universumiin, käyttäen solulaskentaa syvällisten filosofisten kysymysten tutkimiseen.",
      "Keskustelu sisältää neuroverkot, laskennallisen monimutkaisuuden ja mahdollisuuden uusille, tehokkaille koneoppimistekniikoille, herättäen sekä kiitosta että kritiikkiä.",
      "Artikkeli korostaa jatkuvaa keskustelua koneoppimisen luonteesta ja pyrkimyksestä kehittää tehokkaampia algoritmeja."
    ],
    "points": 173,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1724353547
  },
  {
    "id": 41330478,
    "title": "Varoittava tarina Chase-pankin käytöstä indie-yritykselle",
    "originLink": "https://jxnl.co/writing/2024/09/21/chase-bank-small-business-nightmare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330478",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja koki vakavan ongelman Chase Bankin kanssa, jossa 180 000 dollaria jäädytettiin ilman varoitusta, mikä oli vähällä häiritä heidän liiketoimintaansa.",
      "Huolimatta vuosikymmenen kestäneestä suhteesta ja kaikkien tarvittavien asiakirjojen toimittamisesta, Chase Bank esti tapahtumat eikä ratkaissut ongelmaa nopeasti, mikä johti luottamuksen menettämiseen.",
      "Kirjoittaja korostaa pankkivaihtoehtojen monipuolistamisen tärkeyttä ja ehdottaa harkitsemaan vaihtoehtoja, kuten Mercury Bankia, jonka he kokivat tukevan paremmin pienten yritysten tarpeita."
    ],
    "commentSummary": [
      "Varoittava tarina tuo esiin indie-yritysten haasteet Chase-pankin käytössä, erityisesti tapauksen, jossa tili suljettiin ilman selkeitä syitä, aiheuttaen merkittävää haittaa.",
      "Samanlaisia kokemuksia on jaettu Citibankin kanssa, jossa tilin nimien epäjohdonmukaisuudet johtivat pitkittyneisiin kamppailuihin eläkerahastojen saamiseksi, mikä vaati laajaa dokumentointia ja useita vuorovaikutuksia pankin kanssa.",
      "Keskustelu korostaa laajempaa ongelmaa suurten pankkien byrokraattisista tehottomuuksista ja asiakasvaltuutuksen puutteesta, mikä saa jotkut harkitsemaan vaihtoehtoja, kuten luotto-osuuskuntia tai fintech-ratkaisuja."
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1724431098
  },
  {
    "id": 41325719,
    "title": "Surfer: Keskitä kaikki henkilökohtaiset tietosi verkkoalustoilta",
    "originLink": "https://github.com/CEREBRUS-MAXIMUS/Surfer-Data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325719",
    "commentBody": "",
    "originSummary": [
      "Surfer on digitaalinen jalanjäljen viejä, joka yhdistää henkilökohtaiset tiedot eri verkkoympäristöistä yhteen kansioon, ratkaisten hajanaisten tietojen ongelman.",
      "Tuetut alustat ovat Twitter, LinkedIn, GitHub, YouTube, Spotify, Notion, ChatGPT, Gmail, ja pian tulossa ovat iMessages, Twitter Bookmarks ja Reddit.",
      "Sovellus käyttää Supabasea anonymisoituun analytiikkaan ja sen tiekarttaan kuuluu Windows-koodin allekirjoitussertifikaatin hankkiminen, useampien alustojen lisääminen ja puettavien laitteiden integroinnin tutkiminen."
    ],
    "commentSummary": [
      "\"Surfer: Maailman ensimmäinen digitaalisen jalanjäljen viejä\" väittää keskittävänsä henkilökohtaiset tiedot seitsemältä suurelta verkkoalustalta, mutta käyttäjien mielestä se tarvitsee enemmän integraatioita ollakseen todella arvokas.",
      "Projekti on herättänyt keskusteluja tietosuojasta, ja jotkut kannattavat hajautettuja ratkaisuja, kun taas toiset ehdottavat parannuksia, kuten päivittäistä vientiä ja parempaa markkinointia.",
      "Vaihtoehtoja ja vastaavia työkaluja, jotka mainitaan, ovat muun muassa Microsoftin GraphRag, Karlicossin HPI, DogSheep ja Peergos, mikä korostaa henkilökohtaisten tietojen hallintatyökalujen kilpailullista maisemaa."
    ],
    "points": 127,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1724379180
  },
  {
    "id": 41326357,
    "title": "Tunnustuksia teoreettiselta fyysikolta",
    "originLink": "https://nautil.us/confessions-of-a-theoretical-physicist-787199/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326357",
    "commentBody": "",
    "originSummary": [
      "Vijay Balasubramanian, teoreettinen fyysikko, jakaa näkemyksiään artikkelissaan \"Teoreettisen fyysikon tunnustuksia\", joka julkaistiin 19. elokuuta 2024.",
      "Balasubramanian toimii Pennsylvanian yliopistossa, Vrije Universiteit Brusselissa ja Santa Fe Instituutissa, ja tulee olemaan George Eastman -professori Oxfordin yliopistossa lukuvuonna 2024–2025.",
      "Nautilus tarjoaa jäsenilleen mainoksettoman kokemuksen ja julkaisee artikkeleita monenlaisista aiheista, kuten neurotieteestä, teknologiasta ja filosofiasta."
    ],
    "commentSummary": [
      "Tieteellinen fyysikko jakaa näkemyksiä tieteellisen löytämisen luonteesta, korostaen uteliaisuuden ja eureka-hetkien merkitystä tiedon edistämisessä.",
      "Keskustelu korostaa läpimurtojen ennakoimatonta ja usein yhteistyöhön perustuvaa luonnetta fysiikassa, havainnollistaen, kuinka satunnaiset ehdotukset voivat johtaa merkittäviin muutoksiin tutkimuksen suunnassa.",
      "Kirjoitus käsittelee myös laajempia filosofisia keskusteluja vapaasta tahdosta ja ihmismielestä, joita spontaanit oivallushetket herättävät, ja kuinka nämä hetket haastavat ymmärrystämme tietoisesta päätöksenteosta."
    ],
    "points": 126,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724390075
  },
  {
    "id": 41328964,
    "title": "Tieteen valheiden järkyttävä kuolonuhrien määrä",
    "originLink": "https://www.vox.com/future-perfect/368350/scientific-research-fraud-crime-jail-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328964",
    "commentBody": "",
    "originSummary": [
      "Tieteellinen petos voi johtaa vakaviin seurauksiin, mukaan lukien kuolleisuuden lisääntymiseen, kuten kardiologi Don Poldermansin tapauksessa, jonka väärennetyt tiedot johtivat arviolta 800 000 kuolemaan.",
      "Tieteellinen vilppi on yleisempää kuin yleisesti uskotaan, ja rikkomuksista seuraa vain vähäisiä seuraamuksia, ja virheellisten tutkimusten peruuttaminen voi kestää vuosia, mikä vaikuttaa potilaiden hoitoon.",
      "On ehdotuksia tieteellisen petoksen kriminalisoimiseksi tai riippumattomien tarkastuslautakuntien perustamiseksi vastuullisuuden varmistamiseksi, sillä nykyiset rangaistukset ovat riittämättömiä ja laitokset usein välttävät perusteellisia tutkimuksia suojellakseen mainettaan."
    ],
    "commentSummary": [
      "Keskustelu keskittyy tieteellisen vilpin vakaviin vaikutuksiin lääketieteellisessä tutkimuksessa, ja esille nostetaan tapaus, jossa vilpillinen beetasalpaajatutkimus on saattanut johtaa 800 000 kuolemaan.",
      "Keskeisiä keskusteltuja kysymyksiä ovat järjestelmälliset ongelmat, kuten liiallinen riippuvuus yksittäisistä tutkimuksista, huonot replikaatiokäytännöt ja median virheellinen raportointi löydöksistä.",
      "Ehdotuksia parannuksiksi ovat paremmat valvonta- ja tasapainomekanismit, vilpillisten tutkijoiden syytteeseenpano sekä tutkimuskäytäntöjen ja vastuullisuuden parantaminen eri aloilla."
    ],
    "points": 113,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724420720
  },
  {
    "id": 41325514,
    "title": "Zettlr: Muistiinpanojen tekeminen ja julkaiseminen Markdownilla",
    "originLink": "https://lwn.net/Articles/984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325514",
    "commentBody": "",
    "originSummary": [
      "Zettlr on WYSIWYM (What You See Is What You Mean) Markdown-editori, joka soveltuu monenlaisiin kirjoitustehtäviin ja tarjoaa syvällisiä mukautusmahdollisuuksia.",
      "Uusin versio, 3.2.0, julkaistiin 11. kesäkuuta 2024, ja ohjelmisto on monialustainen, saatavilla Linuxille, Windowsille ja macOS:lle.",
      "Zettlr sisältää ominaisuuksia, kuten reaaliaikaisen Markdown-renderöinnin, useita dokumenttinäkymiä, Emacs- ja Vim-tilat sekä työkaluja kirjoittamisen edistymisen, viittausten ja kieliopin tarkistamiseen."
    ],
    "commentSummary": [
      "Zettlr on muistiinpanojen tekemiseen ja julkaisemiseen tarkoitettu työkalu, joka käyttää Markdownia ja herättää huomiota avoimen lähdekoodinsa ja toimittajalukon puuttumisen ansiosta.",
      "Kayttäjät vertailevat Zettlriä muihin työkaluihin, kuten Obsidianiin, korostaen eroja laajennettavuudessa, suorituskyvyssä ja mukautusvaihtoehdoissa.",
      "Keskusteluissa korostetaan Markdownin merkitystä yhteensopivuuden ja joustavuuden kannalta, ja jotkut käyttäjät suosivat sitä rikkaiden tekstieditorien sijaan sen yksinkertaisuuden ja yhteensopivuuden vuoksi versionhallintajärjestelmien, kuten Gitin, kanssa."
    ],
    "points": 108,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1724375411
  },
  {
    "id": 41327956,
    "title": "Ulkoistaminen maksoi Boeingille miljardeja (2019)",
    "originLink": "https://medium.com/javascript-scene/why-cutting-costs-is-expensive-how-9-hour-software-engineers-cost-boeing-billions-b76dbe571957",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41327956",
    "commentBody": "",
    "originSummary": [
      "Boeingin kustannusten leikkaustoimenpiteet, mukaan lukien ohjelmistosuunnittelun ulkoistaminen halvemmille alihankkijoille, myötävaikuttivat 737 MAX -koneen epäonnistumisiin, mikä johti kahteen kuolemaan johtaneeseen onnettomuuteen ja lentokoneen maailmanlaajuiseen lentokieltoon.",
      "Nämä tapaukset johtivat yli 6 miljardin dollarin markkina-arvon menetyksiin Boeingille, korostaen kustannussäästöjen asettamisen ohjelmistojen laadun edelle vaaroja.",
      "Tapaus korostaa korkealaatuisten ohjelmistokehityskäytäntöjen, asianmukaisen koulutuksen, mentoroinnin ja perusteellisen testauksen tärkeyttä, jotta vältetään kalliit ja traagiset seuraukset."
    ],
    "commentSummary": [
      "Boeingin ohjelmistokehityksen ulkoistaminen on johtanut merkittäviin taloudellisiin tappioihin ja laatuongelmiin, mikä korostaa tällaisten käytäntöjen riskejä.",
      "737 MAX -lentokoneen ohjausominaisuuksien parannusjärjestelmän (MCAS) virhe on hyvä esimerkki siitä, kuinka kustannusten leikkaaminen ja riittämättömät turvallisuusprotokollat johtivat traagisiin seurauksiin.",
      "Keskustelussa korostetaan ammattimaisen insinöörivalvonnan ja mahdollisen sertifioinnin tarvetta kriittisille ohjelmistojärjestelmille vastaavien tapausten estämiseksi tulevaisuudessa."
    ],
    "points": 106,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1724411344
  },
  {
    "id": 41328447,
    "title": "Nanolog tukee lokitusta 7 ns mediaaniviiveellä",
    "originLink": "https://github.com/PlatformLab/NanoLog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328447",
    "commentBody": "",
    "originSummary": [
      "NanoLog on suorituskykyinen lokitusjärjestelmä C++:lle, joka saavuttaa yli 80 miljoonaa lokitusta sekunnissa keskimääräisellä viiveellä, joka on hieman yli 7 nanosekuntia.",
      "Se ylittää suorituskyvyssä muut kirjausjärjestelmät, kuten spdlog, Log4j2, Boost, glog ja Windows Event Tracing (ETW), sekä läpäisykyvyssä että suoritusaikaviiveessä.",
      "NanoLog käyttää ainutlaatuista lähestymistapaa erottamalla staattiset lokitiedot käännösaikana ja kirjaamalla vain dynaamiset komponentit ajonaikana, siirtäen muotoilun offline-prosessiin."
    ],
    "commentSummary": [
      "Nanolog tarjoaa lokitusta, jonka mediaaniviive on 7 nanosekuntia, vaikka todellinen sovellusviive on noin 17 nanosekuntia.",
      "Se käyttää taustasäiettä hoitamaan suurimman osan työstä, pyrkien minimoimaan ylikuormituksen lokitussäikeessä.",
      "Tämä tekniikka, vaikkakaan ei vallankumouksellinen, on yleisesti käytössä sulautetuissa ohjelmistoissa ja muissa lokitusjärjestelmissä suorituskyvyn optimoimiseksi."
    ],
    "points": 102,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1724416335
  },
  {
    "id": 41326179,
    "title": "EPUBCheck – Virallinen ePub-julkaisujen vaatimustenmukaisuuden tarkistustyökalu",
    "originLink": "https://github.com/w3c/epubcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326179",
    "commentBody": "",
    "originSummary": [
      "EPUBCheck on virallinen työkalu EPUB-julkaisujen validointiin. Se on saatavilla komentorivityökaluna tai Java-kirjastona, ja sitä ylläpitää DAISY-konsortio W3C:lle.",
      "Uusin julkaisu, EPUBCheck v5.1.0, tukee EPUB 2- ja 3-tiedostojen validointia EPUB 3.3 -määrittelyn mukaisesti.",
      "Rahoitustukea tarvitaan sen jatkuvaan kehitykseen ja ylläpitoon, ja se on avoimen lähdekoodin ohjelmisto 3-Clause BSD -lisenssillä."
    ],
    "commentSummary": [
      "EPUBCheck on virallinen työkalu ePub-julkaisujen validointiin, varmistaen niiden täyttävän alan standardit.",
      "Julkaisuala luottaa usein vanhentuneisiin käytäntöihin, ja monet kirjailijat käyttävät Microsoft Wordia, mikä edellyttää manuaalista muuntamista e-kirjoiksi ja painotuotteiksi.",
      "Käyttäjät jakoivat erilaisia menetelmiä e-kirjojen luomiseen, mukaan lukien LaTeX ja pandoc, ja keskustelivat työkalujen, kuten EPUBCheckin, tärkeydestä validointitarkistusten läpäisemiseksi."
    ],
    "points": 99,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724387495
  },
  {
    "id": 41326138,
    "title": "Semaglutidi, kuten Ozempic, polttaa viskeraalista rasvaa, ei vain hillitse ruokahalua.",
    "originLink": "https://onlinelibrary.wiley.com/doi/full/10.1002/oby.24126",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326138",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Semaglutidi, samoin kuin Ozempic, kohdistuu ja vähentää viskeraalista rasvaa, joka liittyy aineenvaihduntasairauksiin ja insuliiniresistenssiin, tarjoten terveyshyötyjä ruokahalun tukahduttamisen lisäksi.",
      "Tämän hoidon kyky kohdistua erityisesti viskeraaliseen rasvaan erottaa sen aiemmista painonpudotuslääkkeistä, mikä voi tarjota laajempia terveyshyötyjä.",
      "Nouseva semaglutidin suosio korostaa tehokkaiden painonpudotusratkaisujen kysyntää, huolimatta huolista pitkäaikaisesta riippuvuudesta ja tuntemattomista riskeistä."
    ],
    "points": 97,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724386715
  }
]
