[
  {
    "id": 41325889,
    "title": "Adesso l'API di Claude supporta le richieste CORS, consentendo applicazioni lato client",
    "originLink": "https://simonwillison.net/2024/Aug/23/anthropic-dangerous-direct-browser-access/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325889",
    "commentBody": "",
    "originSummary": [
      "Anthropic ha abilitato il supporto CORS (Cross-Origin Resource Sharing) per le loro API JSON, consentendo chiamate dirette ai modelli di linguaggio di grandi dimensioni (LLM) Claude dal browser dell'utente.",
      "Questa funzione viene attivata aggiungendo l'intestazione della richiesta HTTP `anthropic-dangerous-direct-browser-access: true`, facilitando le chiamate basate su browser senza un proxy.",
      "Questo aggiornamento è particolarmente utile per strumenti o app interne in cui gli utenti forniscono le proprie chiavi API, come esemplificato dall'app Haiku che genera haiku dalle foto utilizzando l'API di Anthropic."
    ],
    "commentSummary": [
      "Adesso l'API di Claude supporta le richieste CORS (Cross-Origin Resource Sharing), permettendo alle applicazioni lato client di interagire direttamente con essa.",
      "Gli utenti possono portare le proprie chiavi, il che riduce la manutenzione e i costi, rendendo più facile per gli sviluppatori distribuire app senza pubblicità senza manutenzione costante.",
      "Anche se alcuni utenti preferiscono OAuth per una maggiore sicurezza, l'approccio \"porta le tue chiavi\" rimane popolare per la sua semplicità e convenienza economica, sebbene richieda fiducia nel sito utilizzato."
    ],
    "points": 300,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1724382333
  },
  {
    "id": 41326604,
    "title": "Abbiamo bisogno di liberare il File degli Indirizzi Postali",
    "originLink": "https://takes.jamesomalley.co.uk/p/secret-paf-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326604",
    "commentBody": "",
    "originSummary": [
      "Il rapporto confidenziale evidenzia la necessità di liberare il Postcode Address File (PAF) dal controllo privato per favorire l'innovazione e la crescita economica.",
      "Da quando Royal Mail è stata privatizzata nel 2013, accedere al PAF è diventato costoso, soffocando lo sviluppo.",
      "Un tentativo del governo nel 2016 di ricreare il PAF senza i dati di Royal Mail ha portato a un dataset difettoso, dimostrando che è impraticabile e costoso; pertanto, il rapporto raccomanda che il governo recuperi e rilasci il PAF come dati aperti."
    ],
    "commentSummary": [
      "Il Postcode Address File (PAF) nel Regno Unito è controllato da Royal Mail ed è costoso da accedere, portando a problemi di accuratezza degli indirizzi e completezza dei dati.",
      "Il governo francese ha creato il \"BAN\" (Base Adresse Nationale), un database di indirizzi postali gratuito e aperto con coordinate GPS, interfacce di aggiornamento e API, che funge da modello per il Regno Unito.",
      "Alcuni sostenitori sostengono che rendere il PAF liberamente disponibile nel Regno Unito, simile al BAN della Francia, migliorerebbe la precisione e l'accessibilità degli indirizzi."
    ],
    "points": 269,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1724394989
  },
  {
    "id": 41328784,
    "title": "Studente di 17 anni svela la 'segreta' lista di siti pirata bloccati in Germania",
    "originLink": "https://torrentfreak.com/17-year-old-student-exposes-germanys-secret-pirate-site-blocklist-240822/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328784",
    "commentBody": "",
    "originSummary": [
      "Alcuni grandi ISP in Germania stanno bloccando i siti pirata attraverso un accordo volontario con i titolari dei diritti, mantenendo segreti i nomi di dominio interessati.",
      "Un studente di 17 anni, Damian, e i suoi amici hanno lanciato CUIIliste.de per esporre tutti i domini bloccati, promuovendo la trasparenza e la libertà di espressione.",
      "Il sistema istituzionalizzato di blocco dei siti pirata in Germania, CUII, emette ordini di blocco senza sentenze giudiziarie, sollevando preoccupazioni sulla trasparenza e sul potenziale censura."
    ],
    "commentSummary": [
      "Uno studente di 17 anni ha rivelato la lista segreta dei siti pirata bloccati in Germania, scatenando discussioni su come aggirare questi blocchi utilizzando VPN, DNSCrypt e server DNS alternativi.",
      "Gli utenti hanno discusso della facilità di eludere il blocco basato su DNS e delle sfide legali e tecniche associate al torrenting in Germania.",
      "Le implicazioni più ampie della censura su internet e l'efficacia di tali misure sono state anche discusse."
    ],
    "points": 253,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724419219
  },
  {
    "id": 41330007,
    "title": "Il DOJ fa causa a RealPage per uno schema di prezzi algoritmici che danneggia gli inquilini",
    "originLink": "https://www.justice.gov/opa/pr/justice-department-sues-realpage-algorithmic-pricing-scheme-harms-millions-american-renters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330007",
    "commentBody": "",
    "originSummary": [
      "Il Dipartimento di Giustizia e diversi Procuratori Generali statali hanno intentato una causa civile antitrust contro RealPage Inc. per aver presumibilmente utilizzato uno schema di determinazione dei prezzi algoritmico per ridurre la concorrenza tra i proprietari e monopolizzare il mercato del software di gestione delle entrate commerciali.",
      "Il contenzioso sostiene che RealPage abbia violato le Sezioni 1 e 2 dello Sherman Act condividendo informazioni non pubbliche sui tassi di affitto tra i proprietari per influenzare i prezzi degli appartamenti, danneggiando milioni di inquilini americani privandoli di condizioni di locazione competitive.",
      "RealPage, che presumibilmente detiene una quota di mercato dell'80% in questo settore software, è accusata di utilizzare i suoi dati per mantenere un monopolio e limitare la concorrenza."
    ],
    "commentSummary": [
      "Il DOJ ha intentato una causa contro RealPage, sostenendo che il suo software di determinazione dei prezzi algoritmici facilita la fissazione dei prezzi tra i proprietari, portando a un aumento degli affitti.",
      "Il software utilizza dati proprietari per suggerire i prezzi degli affitti, il che secondo il DOJ riduce la concorrenza e danneggia gli inquilini evitando prezzi competitivi.",
      "La causa ha innescato un dibattito più ampio sull'edilizia abitativa come industria orientata al profitto, toccando questioni come le leggi di zonizzazione, il controllo degli affitti e l'equilibrio tra domanda e offerta nei mercati immobiliari."
    ],
    "points": 216,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1724428306
  },
  {
    "id": 41329505,
    "title": "SurrealEngine: Reimplementazione open-source di Unreal Engine con UT99 giocabile",
    "originLink": "https://github.com/dpjudas/SurrealEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41329505",
    "commentBody": "",
    "originSummary": [
      "Il progetto Surreal Engine mira a reimplementare l'originale Unreal Engine per rendere giocabili le mappe di Unreal Tournament (UT99).",
      "Il motore può caricare e renderizzare mappe, con la VM di Unrealscript quasi completa, ma alcune funzioni native sono ancora mancanti, portando a potenziali eccezioni.",
      "Tra i giochi supportati ci sono varie versioni di Unreal Tournament, Unreal, Deus Ex e altri, con alcuni giochi come Unreal Tournament v436 e Unreal Gold v226 già in uno stato giocabile."
    ],
    "commentSummary": [
      "SurrealEngine è una reimplementazione open-source di Unreal Engine 1, che consente versioni giocabili di Unreal Tournament 99 (UT99).",
      "Questo progetto è significativo perché rivitalizza un motore di gioco classico, rendendolo accessibile e giocabile su hardware moderno senza richiedere il motore proprietario originale.",
      "Il reimplementazione supporta hardware più vecchio con schede video da 64/128MB e utilizza SDL2 e OpenGL 2.1, enfatizzando la conservazione e l'accessibilità dei giochi vintage."
    ],
    "points": 187,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1724424609
  },
  {
    "id": 41323454,
    "title": "Che cosa sta succedendo nell'apprendimento automatico? Alcuni modelli minimi",
    "originLink": "https://writings.stephenwolfram.com/2024/08/whats-really-going-on-in-machine-learning-some-minimal-models/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41323454",
    "commentBody": "",
    "originSummary": [
      "Nonostante i progressi nelle reti neurali, il funzionamento interno e le ragioni della loro efficacia rimangono in gran parte misteriosi, spingendo a sforzi per semplificare e visualizzare questi modelli.",
      "Le reti neurali a maglia, che limitano le connessioni a un massimo di due neuroni, offrono un'alternativa più visualizzabile e comprensibile pur eseguendo funzioni complesse.",
      "Le reti discrete, ispirate all'evoluzione biologica, utilizzano regole semplici e mutazioni casuali per raggiungere obiettivi, offrendo un nuovo approccio all'apprendimento automatico che sfrutta l'irriducibilità computazionale."
    ],
    "commentSummary": [
      "Il articolo di Stephen Wolfram approfondisce i modelli minimali e l'universo computazionale, utilizzando automi cellulari per esplorare profonde questioni filosofiche.",
      "Il dibattito include reti neurali, complessità computazionale e il potenziale per nuove tecniche di apprendimento automatico efficienti, suscitando sia elogi che critiche.",
      "Il articolo sottolinea il dibattito in corso sulla natura del machine learning e la ricerca di algoritmi più efficienti."
    ],
    "points": 173,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1724353547
  },
  {
    "id": 41330478,
    "title": "Racconto ammonitore sull'uso della banca Chase per le piccole imprese",
    "originLink": "https://jxnl.co/writing/2024/09/21/chase-bank-small-business-nightmare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330478",
    "commentBody": "",
    "originSummary": [
      "Il autore ha avuto un grave problema con Chase Bank, dove $180.000 sono stati congelati senza preavviso, quasi interrompendo le loro operazioni aziendali.",
      "Nonostante una relazione decennale e la fornitura di tutti i documenti necessari, Chase Bank ha bloccato le transazioni e non ha risolto il problema tempestivamente, portando a una perdita di fiducia.",
      "L'autore sottolinea l'importanza di diversificare le opzioni bancarie e suggerisce di considerare alternative come Mercury Bank, che hanno trovato più favorevole alle esigenze delle piccole imprese."
    ],
    "commentSummary": [
      "Un racconto ammonitore evidenzia le sfide dell'utilizzo della banca Chase per le piccole imprese, con un caso specifico in cui un conto è stato chiuso senza motivi chiari, causando notevoli disagi.",
      "Esperienze simili con Citibank sono condivise, dove discrepanze nei nomi dei conti hanno portato a lunghe lotte per accedere ai fondi pensionistici, richiedendo una documentazione estesa e molteplici interazioni con la banca.",
      "Il dibattito sottolinea il problema più ampio delle inefficienze burocratiche delle grandi banche e della mancanza di empowerment dei clienti, spingendo alcuni a considerare alternative come le cooperative di credito o le soluzioni fintech."
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1724431098
  },
  {
    "id": 41325719,
    "title": "Surfer: Centralizza tutti i tuoi dati personali dalle piattaforme online",
    "originLink": "https://github.com/CEREBRUS-MAXIMUS/Surfer-Data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325719",
    "commentBody": "",
    "originSummary": [
      "Surfer è un esportatore di impronte digitali che consolida i dati personali da varie piattaforme online in una singola cartella, affrontando il problema dei dati sparsi.",
      "Le piattaforme supportate includono Twitter, LinkedIn, GitHub, YouTube, Spotify, Notion, ChatGPT, Gmail, con iMessages, Twitter Bookmarks e Reddit in arrivo presto.",
      "L'app utilizza Supabase per le analisi anonime e ha una roadmap che include l'ottenimento di un certificato di firma del codice per Windows, l'aggiunta di più piattaforme e l'esplorazione dell'integrazione con dispositivi indossabili."
    ],
    "commentSummary": [
      "Surfer: Il primo esportatore di impronte digitali al mondo\" afferma di centralizzare i dati personali da sette principali piattaforme online, ma gli utenti sostengono che ha bisogno di più integrazioni per essere veramente utile.",
      "Il progetto ha suscitato discussioni sulla privacy dei dati, con alcuni che sostengono soluzioni decentralizzate e altri che suggeriscono miglioramenti come l'esportazione giornaliera e un marketing migliore.",
      "Le alternative e gli strumenti simili menzionati includono GraphRag di Microsoft, HPI di Karlicoss, DogSheep e Peergos, evidenziando un panorama competitivo per gli strumenti di gestione dei dati personali."
    ],
    "points": 127,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1724379180
  },
  {
    "id": 41326357,
    "title": "Confessioni di un fisico teorico",
    "originLink": "https://nautil.us/confessions-of-a-theoretical-physicist-787199/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326357",
    "commentBody": "",
    "originSummary": [
      "Vijay Balasubramanian, un fisico teorico, condivide approfondimenti nel suo articolo \"Confessioni di un fisico teorico,\" pubblicato il 19 agosto 2024.",
      "Balasubramanian ricopre posizioni presso l'Università della Pennsylvania, la Vrije Universiteit Brussel e il Santa Fe Institute, e sarà il George Eastman Professor all'Università di Oxford per l'anno accademico 2024-2025.",
      "Nautilus offre un'esperienza senza pubblicità per i membri e presenta articoli su argomenti diversi come neuroscienze, tecnologia e filosofia."
    ],
    "commentSummary": [
      "Un fisico teorico condivide intuizioni sulla natura della scoperta scientifica, sottolineando l'importanza della curiosità e dei momenti eureka nel progresso della conoscenza.",
      "Il dibattito mette in evidenza la natura imprevedibile e spesso collaborativa delle scoperte in fisica, illustrando come suggerimenti casuali possano portare a cambiamenti significativi nella direzione della ricerca.",
      "Il post tocca anche dibattiti filosofici più ampi sul libero arbitrio e la mente umana, scatenati dalla natura spontanea dei momenti di eureka, e su come questi momenti sfidino la nostra comprensione del processo decisionale consapevole."
    ],
    "points": 126,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724390075
  },
  {
    "id": 41328964,
    "title": "Il numero impressionante di morti causate dalle menzogne scientifiche",
    "originLink": "https://www.vox.com/future-perfect/368350/scientific-research-fraud-crime-jail-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328964",
    "commentBody": "",
    "originSummary": [
      "Le frodi scientifiche possono portare a gravi conseguenze, tra cui l'aumento dei tassi di mortalità, come nel caso del cardiologo Don Poldermans, i cui dati falsificati hanno portato a un numero stimato di 800.000 decessi.",
      "Le cattive condotte scientifiche sono più diffuse di quanto comunemente si creda, con minime ripercussioni per i trasgressori, e possono volerci anni per ritirare studi errati, influenzando l'assistenza ai pazienti.",
      "Ci sono proposte per criminalizzare la frode scientifica o istituire comitati di revisione indipendenti per garantire la responsabilità, poiché le attuali sanzioni sono insufficienti e le istituzioni spesso evitano indagini approfondite per proteggere la loro reputazione."
    ],
    "commentSummary": [
      "Il dibattito si concentra sul grave impatto della frode scientifica nella ricerca medica, con un caso evidenziato in cui la ricerca fraudolenta sui beta-bloccanti potrebbe aver causato 800.000 morti.",
      "Le questioni chiave dibattute includono problemi sistemici come l'eccessiva dipendenza da singoli studi, pratiche di replicazione scadenti e la cattiva informazione dei media sui risultati.",
      "Le proposte di miglioramento includono migliori controlli e bilanciamenti, il perseguimento dei ricercatori fraudolenti e il potenziamento delle pratiche di ricerca e della responsabilità in vari settori."
    ],
    "points": 113,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724420720
  },
  {
    "id": 41325514,
    "title": "Zettlr: Prendere Appunti e Pubblicare con Markdown",
    "originLink": "https://lwn.net/Articles/984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325514",
    "commentBody": "",
    "originSummary": [
      "Zettlr è un editor Markdown WYSIWYM (What You See Is What You Mean), adatto a vari compiti di scrittura e offre una profonda personalizzazione.",
      "È stata rilasciata l'ultima versione, la 3.2.0, l'11 giugno 2024, e il software è multipiattaforma, disponibile per Linux, Windows e macOS.",
      "Zettlr include funzionalità come il rendering in tempo reale del Markdown, viste multiple dei documenti, modalità Emacs e Vim, e strumenti per il progresso della scrittura, citazioni e controllo grammaticale."
    ],
    "commentSummary": [
      "Zettlr è uno strumento per prendere appunti e pubblicare che utilizza Markdown, attirando l'attenzione per la sua natura open-source e l'assenza di vincoli del fornitore.",
      "Gli utenti stanno confrontando Zettlr con altri strumenti come Obsidian, evidenziando le differenze in termini di estensibilità, prestazioni e opzioni di personalizzazione.",
      "Le discussioni sottolineano l'importanza di Markdown per l'interoperabilità e la flessibilità, con alcuni utenti che lo preferiscono agli editor di testo ricco per la sua semplicità e compatibilità con i sistemi di controllo delle versioni come Git."
    ],
    "points": 108,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1724375411
  },
  {
    "id": 41327956,
    "title": "Esternalizzazione costa miliardi a Boeing (2019)",
    "originLink": "https://medium.com/javascript-scene/why-cutting-costs-is-expensive-how-9-hour-software-engineers-cost-boeing-billions-b76dbe571957",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41327956",
    "commentBody": "",
    "originSummary": [
      "Boeing ha adottato misure di riduzione dei costi, tra cui l'esternalizzazione dell'ingegneria del software a fornitori più economici, che hanno contribuito ai fallimenti del 737 MAX, portando a due incidenti mortali e alla messa a terra dell'aereo in tutto il mondo.",
      "Questi incidenti hanno comportato perdite di oltre 6 miliardi di dollari in capitalizzazione di mercato per Boeing, evidenziando i pericoli di dare priorità al risparmio sui costi rispetto alla qualità del software.",
      "Il caso sottolinea l'importanza di investire in pratiche di sviluppo software di alta qualità, formazione adeguata, tutoraggio e test approfonditi per prevenire risultati costosi e tragici."
    ],
    "commentSummary": [
      "Boeing ha esternalizzato lo sviluppo del software, il che ha portato a significative perdite finanziarie e problemi di qualità, evidenziando i rischi associati a tali pratiche.",
      "Il difetto del Sistema di Aumento delle Caratteristiche di Manovra (MCAS) nel 737 MAX è un esempio lampante, dove misure di riduzione dei costi e protocolli di sicurezza inadeguati hanno portato a esiti tragici.",
      "Il dibattito sottolinea la necessità di una supervisione ingegneristica professionale e di una possibile certificazione per i sistemi software critici al fine di prevenire incidenti simili in futuro."
    ],
    "points": 106,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1724411344
  },
  {
    "id": 41328447,
    "title": "Nanolog supporta la registrazione con una latenza mediana di 7 ns",
    "originLink": "https://github.com/PlatformLab/NanoLog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328447",
    "commentBody": "",
    "originSummary": [
      "NanoLog è un sistema di logging ad alte prestazioni per C++ che raggiunge oltre 80 milioni di log al secondo con una latenza mediana di poco più di 7 nanosecondi.",
      "Supera altri sistemi di logging come spdlog, Log4j2, Boost, glog e Windows Event Tracing (ETW) sia in termini di throughput che di latenza di runtime.",
      "NanoLog utilizza un approccio unico estraendo le informazioni di log statiche durante la compilazione e registrando solo i componenti dinamici durante l'esecuzione, rinviando la formattazione a un processo offline."
    ],
    "commentSummary": [
      "Nanolog offre un sistema di logging con una latenza mediana di 7 nanosecondi, sebbene la latenza reale nelle applicazioni sia di circa 17 nanosecondi.",
      "Utilizza un thread in background per gestire la maggior parte del lavoro, con l'obiettivo di ridurre al minimo il sovraccarico nel thread di logging.",
      "Questa tecnica, pur non essendo rivoluzionaria, è comunemente utilizzata nel software embedded e in altri sistemi di registrazione per ottimizzare le prestazioni."
    ],
    "points": 102,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1724416335
  },
  {
    "id": 41326179,
    "title": "EPUBCheck – Il verificatore ufficiale di conformità per le pubblicazioni ePub",
    "originLink": "https://github.com/w3c/epubcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326179",
    "commentBody": "",
    "originSummary": [
      "EPUBCheck è lo strumento ufficiale per la validazione delle pubblicazioni EPUB, disponibile come strumento da riga di comando o libreria Java, e mantenuto dal Consorzio DAISY per W3C.",
      "Il rilascio più recente, EPUBCheck v5.1.0, supporta la validazione dei file EPUB 2 e 3 rispetto alla specifica EPUB 3.3.",
      "È necessario un supporto finanziario per il suo sviluppo e manutenzione continui, ed è open source sotto la licenza BSD a 3 clausole."
    ],
    "commentSummary": [
      "EPUBCheck è lo strumento ufficiale per la validazione delle pubblicazioni ePub, garantendo che soddisfino gli standard del settore.",
      "Il settore editoriale spesso si basa su pratiche obsolete, con molti autori che utilizzano Microsoft Word, rendendo necessaria la conversione manuale per ebook e stampa.",
      "Gli utenti hanno condiviso diversi metodi per creare ebook, tra cui LaTeX e pandoc, e hanno discusso l'importanza di strumenti come EPUBCheck per superare i controlli di validazione."
    ],
    "points": 99,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724387495
  },
  {
    "id": 41326138,
    "title": "Semaglutide come Ozempic brucia il grasso viscerale, non si limita a sopprimere l'appetito",
    "originLink": "https://onlinelibrary.wiley.com/doi/full/10.1002/oby.24126",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326138",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Semaglutide, simile a Ozempic, mira e riduce il grasso viscerale, che è collegato a disturbi metabolici e resistenza all'insulina, offrendo benefici per la salute oltre alla soppressione dell'appetito.",
      "Questa capacità del trattamento di mirare specificamente al grasso viscerale lo distingue dai precedenti farmaci per la perdita di peso, potenzialmente offrendo vantaggi per la salute più ampi.",
      "La crescente popolarità del semaglutide evidenzia la domanda di soluzioni efficaci per la perdita di peso, nonostante le preoccupazioni riguardo alla dipendenza a lungo termine e ai rischi sconosciuti."
    ],
    "points": 97,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724386715
  }
]
