[
  {
    "id": 41325889,
    "title": "Claude'un API'si artık CORS isteklerini destekliyor ve bu da istemci tarafı uygulamaları etkinleştiriyor",
    "originLink": "https://simonwillison.net/2024/Aug/23/anthropic-dangerous-direct-browser-access/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325889",
    "commentBody": "",
    "originSummary": [
      "Anthropic, kullanıcıların tarayıcılarından Claude LLM'lerine (Büyük Dil Modelleri) doğrudan çağrılar yapmalarına olanak tanıyan JSON API'leri için CORS (Kaynaklar Arası Paylaşım) desteğini etkinleştirdi.",
      "Bu özellik, proxy olmadan tarayıcı tabanlı çağrıları kolaylaştıran `anthropic-dangerous-direct-browser-access: true` HTTP istek başlığını ekleyerek etkinleştirilir.",
      "Bu güncelleme, kullanıcıların kendi API anahtarlarını sağladığı iç araçlar veya uygulamalar için özellikle faydalıdır; örneğin, Anthropic API kullanarak fotoğraflardan haiku üreten Haiku uygulaması."
    ],
    "commentSummary": [
      "CORS (Çapraz Kaynak Paylaşımı) isteklerini artık destekleyen Claude'un API'si, istemci tarafı uygulamaların doğrudan onunla etkileşime girmesine olanak tanıyor.",
      "Kullanıcılar kendi anahtarlarını getirebilirler, bu da bakım ve maliyetleri azaltır, geliştiricilerin sürekli bakım gerektirmeyen reklamsız uygulamaları dağıtmasını kolaylaştırır.",
      "Bazı kullanıcılar gelişmiş güvenlik için OAuth'u tercih ederken, \"kendi anahtarlarını getir\" yaklaşımı, basitliği ve maliyet etkinliği nedeniyle popülerliğini koruyor, ancak kullanılan siteye güven gerektiriyor."
    ],
    "points": 300,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1724382333
  },
  {
    "id": 41326604,
    "title": "Posta Kodu Adres Dosyasını serbest bırakmamız gerekiyor",
    "originLink": "https://takes.jamesomalley.co.uk/p/secret-paf-report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326604",
    "commentBody": "",
    "originSummary": [
      "Gizli rapor, yenilik ve ekonomik büyümeyi teşvik etmek için Posta Kodu Adres Dosyası'nın (PAF) özel kontrolünden kurtarılması gerektiğini vurgulamaktadır.",
      "Royal Mail'in 2013'te özelleştirilmesinden bu yana, PAF'a erişim maliyetli hale geldi ve bu durum gelişimi engelledi.",
      "2016 yılında hükümetin, Royal Mail'in verileri olmadan PAF'ı yeniden oluşturma girişimi hatalı bir veri seti ile sonuçlandı ve bunun uygulanamaz ve maliyetli olduğunu kanıtladı; bu nedenle rapor, hükümetin PAF'ı geri alıp açık veri olarak yayımlamasını tavsiye ediyor."
    ],
    "commentSummary": [
      "Birleşik Krallık'taki Posta Kodu Adres Dosyası (PAF), Royal Mail tarafından kontrol edilmektedir ve erişimi pahalıdır, bu da adres doğruluğu ve veri kapsamlılığı ile ilgili sorunlara yol açmaktadır.",
      "Fransa hükümeti, GPS koordinatları, güncelleme arayüzleri ve API'lerle birlikte ücretsiz ve açık bir posta adresi veritabanı olan \"BAN\"ı (Base Adresse Nationale) oluşturdu ve bu, Birleşik Krallık için bir model olarak hizmet ediyor.",
      "Destekçiler, Fransa'nın BAN'ına benzer şekilde PAF'ın Birleşik Krallık'ta ücretsiz olarak sunulmasının adres doğruluğunu ve erişilebilirliğini artıracağını savunuyor."
    ],
    "points": 269,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1724394989
  },
  {
    "id": 41328784,
    "title": "17 Yaşındaki Öğrenci Almanya'nın 'Gizli' Korsan Site Engelleme Listesini Ortaya Çıkardı",
    "originLink": "https://torrentfreak.com/17-year-old-student-exposes-germanys-secret-pirate-site-blocklist-240822/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328784",
    "commentBody": "",
    "originSummary": [
      "Almanya'daki birkaç büyük internet servis sağlayıcısı, hak sahipleriyle yaptıkları gönüllü bir anlaşma aracılığıyla korsan siteleri engelliyor ve etkilenen alan adlarını gizli tutuyor.",
      "17 yaşındaki öğrenci Damian ve arkadaşları, tüm engellenmiş alan adlarını ifşa etmek, şeffaflık ve ifade özgürlüğünü savunmak için CUIIliste.de'yi başlattı.",
      "Almanya'nın kurumsallaşmış korsan site engelleme düzenlemesi CUII, mahkeme kararları olmadan engelleme emirleri veriyor, bu da şeffaflık ve potansiyel sansür hakkında endişelere yol açıyor."
    ],
    "commentSummary": [
      "17 yaşındaki bir öğrenci, Almanya'nın gizli korsan site engelleme listesini ifşa etti ve bu engelleri VPN'ler, DNSCrypt ve alternatif DNS sunucuları kullanarak aşma konusundaki tartışmaları ateşledi.",
      "Kullanıcılar, DNS tabanlı engellemeyi aşmanın kolaylığını ve Almanya'da torrent kullanımıyla ilgili yasal ve teknik zorlukları tartıştı.",
      "İnternet sansürünün daha geniş kapsamlı etkileri ve bu tür önlemlerin etkinliği de tartışıldı."
    ],
    "points": 253,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724419219
  },
  {
    "id": 41330007,
    "title": "Adalet Bakanlığı, Kiracıları Zarar Veren Algoritmik Fiyatlandırma Planı Nedeniyle RealPage'e Dava Açtı",
    "originLink": "https://www.justice.gov/opa/pr/justice-department-sues-realpage-algorithmic-pricing-scheme-harms-millions-american-renters",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330007",
    "commentBody": "",
    "originSummary": [
      "Adalet Bakanlığı ve birkaç eyalet Başsavcısı, RealPage Inc.'e karşı, ev sahipleri arasındaki rekabeti azaltmak ve ticari gelir yönetim yazılımı pazarını tekelleştirmek için algoritmik bir fiyatlandırma planı kullandığı iddiasıyla sivil bir antitröst davası açtı.",
      "Dava, RealPage'in, ev sahipleri arasında kamuya açık olmayan kira oranı bilgilerini paylaşarak daire fiyatlarını etkilemek suretiyle Sherman Yasası'nın 1. ve 2. Bölümlerini ihlal ettiğini ve milyonlarca Amerikalı kiracıyı rekabetçi kiralama koşullarından mahrum bırakarak zarar verdiğini iddia ediyor.",
      "RealPage'in, bu yazılım sektöründe %80 pazar payına sahip olduğu iddia ediliyor ve verilerini kullanarak tekel oluşturmak ve rekabeti sınırlamakla suçlanıyor."
    ],
    "commentSummary": [
      "Adalet Bakanlığı, RealPage'e karşı bir dava açtı ve algoritmik fiyatlandırma yazılımının ev sahipleri arasında fiyat sabitlemeyi kolaylaştırarak kiraların artmasına neden olduğunu iddia etti.",
      "Ticaret Bakanlığı, yazılımın kiralama fiyatlarını önermek için özel veriler kullandığını ve bunun rekabeti azalttığını ve rekabetçi fiyatlandırmadan kaçınarak kiracıları zarara uğrattığını iddia ediyor.",
      "Dava, konutun kâr odaklı bir sektör olarak ele alınması konusunda daha geniş bir tartışma başlattı ve imar yasaları, kira kontrolü ve konut piyasalarındaki arz ve talep dengesi gibi konulara değindi."
    ],
    "points": 216,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1724428306
  },
  {
    "id": 41329505,
    "title": "SurrealEngine: Oynanabilir UT99 ile Unreal Engine'in açık kaynaklı yeniden uygulaması",
    "originLink": "https://github.com/dpjudas/SurrealEngine",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41329505",
    "commentBody": "",
    "originSummary": [
      "Surreal Engine projesi, Unreal Tournament (UT99) haritalarını oynanabilir hale getirmek için orijinal Unreal Engine'i yeniden uygulamayı amaçlamaktadır.",
      "Motor, haritaları yükleyip render edebilir, Unrealscript VM neredeyse tamamlanmış durumda, ancak bazı yerel işlevler hala eksik, bu da potansiyel istisnalara yol açabilir.",
      "Desteklenen oyunlar arasında çeşitli Unreal Tournament, Unreal, Deus Ex ve diğerleri bulunmakta olup, Unreal Tournament v436 ve Unreal Gold v226 gibi bazı oyunlar zaten oynanabilir durumda."
    ],
    "commentSummary": [
      "SurrealEngine, Unreal Tournament 99 (UT99) oynanabilir sürümlerine olanak tanıyan, Unreal Engine 1'in açık kaynaklı bir yeniden uygulamasıdır.",
      "Bu proje, klasik bir oyun motorunu yeniden canlandırdığı için önemlidir; orijinal tescilli motoru gerektirmeden modern donanımda erişilebilir ve oynanabilir hale getiriyor.",
      "Yeniden uygulama, 64/128MB video kartlarına sahip eski donanımları destekler ve SDL2 ve OpenGL 2.1 kullanır, eski oyunların korunması ve erişilebilirliğine vurgu yapar."
    ],
    "points": 187,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1724424609
  },
  {
    "id": 41323454,
    "title": "Makine Öğreniminde Neler Oluyor? Bazı Minimal Modeller",
    "originLink": "https://writings.stephenwolfram.com/2024/08/whats-really-going-on-in-machine-learning-some-minimal-models/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41323454",
    "commentBody": "",
    "originSummary": [
      "Sinir ağlarındaki ilerlemelere rağmen, bu modellerin iç işleyişi ve etkinliklerinin nedenleri büyük ölçüde gizemini koruyor, bu da bu modelleri basitleştirme ve görselleştirme çabalarını teşvik ediyor.",
      "Bağlantıları en fazla iki nöronla sınırlayan ağ sinir ağları, karmaşık işlevleri yerine getirirken daha görselleştirilebilir ve anlaşılabilir bir alternatif sunar.",
      "Kesikli sistemler, biyolojik evrimden ilham alarak, basit kurallar ve rastgele mutasyonlar kullanarak hedeflere ulaşır ve hesaplamalı indirgenemezlikten yararlanan yeni bir makine öğrenimi yaklaşımı sunar."
    ],
    "commentSummary": [
      "Stephen Wolfram'ın makalesi, minimal modeller ve hesaplama evrenine derinlemesine dalarak, hücresel otomatları kullanarak derin felsefi soruları araştırıyor.",
      "Bu tartışma, sinir ağları, hesaplama karmaşıklığı ve yeni, verimli makine öğrenme tekniklerinin potansiyelini içeriyor ve hem övgü hem de eleştiri uyandırıyor.",
      "Makale, makine öğreniminin doğası ve daha verimli algoritmalar arayışı konusundaki devam eden tartışmayı vurguluyor."
    ],
    "points": 173,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1724353547
  },
  {
    "id": 41330478,
    "title": "Dikkatli olun: Bağımsız işletmeler için Chase bankasını kullanma hikayesi",
    "originLink": "https://jxnl.co/writing/2024/09/21/chase-bank-small-business-nightmare/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41330478",
    "commentBody": "",
    "originSummary": [
      "Yazar, Chase Bank ile ciddi bir sorun yaşadı; $180,000 uyarı yapılmadan donduruldu ve bu durum neredeyse iş operasyonlarını aksatıyordu.",
      "On yıllık bir ilişkiye ve gerekli tüm belgelerin sağlanmasına rağmen, Chase Bank işlemleri engelledi ve sorunu derhal çözmeyi başaramadı, bu da güven kaybına yol açtı.",
      "Yazar, bankacılık seçeneklerini çeşitlendirmenin önemini vurguluyor ve küçük işletme ihtiyaçlarına daha destekleyici buldukları Mercury Bank gibi alternatifleri değerlendirmeyi öneriyor."
    ],
    "commentSummary": [
      "Uyarıcı bir hikaye, bağımsız işletmeler için Chase bankasını kullanmanın zorluklarını vurguluyor; belirli bir durumda, bir hesabın net nedenler olmadan kapatılması ve bu durumun önemli rahatsızlıklara yol açması anlatılıyor.",
      "Citibank ile benzer deneyimler paylaşılmakta, hesap isimlerindeki tutarsızlıklar emeklilik fonlarına erişimde uzun süren mücadelelere yol açmış, kapsamlı belgeler ve banka ile birden fazla etkileşim gerektirmiştir.",
      "Bu tartışma, büyük bankaların bürokratik verimsizlikleri ve müşteri yetkilendirmesindeki eksiklikleri gibi daha geniş bir sorunu vurguluyor ve bazılarını kredi birlikleri veya fintech çözümleri gibi alternatifleri düşünmeye yönlendiriyor."
    ],
    "points": 146,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1724431098
  },
  {
    "id": 41325719,
    "title": "Surfer: Çevrimiçi platformlardan tüm kişisel verilerinizi merkezileştirin",
    "originLink": "https://github.com/CEREBRUS-MAXIMUS/Surfer-Data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325719",
    "commentBody": "",
    "originSummary": [
      "Surfer, dağınık veriler sorununu ele alarak çeşitli çevrimiçi platformlardan kişisel verileri tek bir klasörde birleştiren bir dijital ayak izi ihracatçısıdır.",
      "Desteklenen platformlar arasında Twitter, LinkedIn, GitHub, YouTube, Spotify, Notion, ChatGPT, Gmail bulunmakta olup, iMessages, Twitter Bookmarks ve Reddit yakında eklenecektir.",
      "Uygulama, anonimleştirilmiş analizler için Supabase kullanıyor ve bir Windows kod imzalama sertifikası edinmeyi, daha fazla platform eklemeyi ve giyilebilir cihaz entegrasyonunu keşfetmeyi içeren bir yol haritasına sahip."
    ],
    "commentSummary": [
      "Surfer: Dünyanın İlk Dijital Ayak İzi İhracatçısı\" yedi büyük çevrimiçi platformdan kişisel verileri merkezileştirdiğini iddia ediyor, ancak kullanıcılar gerçekten değerli olabilmesi için daha fazla entegrasyona ihtiyaç duyduğunu savunuyor.",
      "Proje, veri gizliliği konusunda tartışmalara yol açtı; bazıları merkeziyetsiz çözümleri savunurken, diğerleri günlük ihracat ve daha iyi pazarlama gibi iyileştirmeler öneriyor.",
      "Alternatifler ve benzer araçlar arasında Microsoft'un GraphRag, Karlicoss'un HPI, DogSheep ve Peergos yer almakta olup, kişisel veri yönetim araçları için rekabetçi bir ortamı vurgulamaktadır."
    ],
    "points": 127,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1724379180
  },
  {
    "id": 41326357,
    "title": "Teorik Bir Fizikçinin İtirafları",
    "originLink": "https://nautil.us/confessions-of-a-theoretical-physicist-787199/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326357",
    "commentBody": "",
    "originSummary": [
      "Vijay Balasubramanian, teorik bir fizikçi, 19 Ağustos 2024'te yayımlanan \"Bir Teorik Fizikçinin İtirafları\" başlıklı makalesinde görüşlerini paylaşıyor.",
      "Balasubramanian, Pennsylvania Üniversitesi, Vrije Universiteit Brussel ve Santa Fe Enstitüsü'nde görev yapmaktadır ve 2024-2025 akademik yılı için Oxford Üniversitesi'nde George Eastman Profesörü olacaktır.",
      "Nautilus, üyelerine reklamsız bir deneyim sunar ve nörobilim, teknoloji ve felsefe gibi çeşitli konularda makaleler içerir."
    ],
    "commentSummary": [
      "Teorik bir fizikçi, bilimsel keşfin doğası üzerine içgörüler paylaşıyor ve merak ile eureka anlarının bilgi ilerlemesindeki önemini vurguluyor.",
      "Tartışma, fizikteki atılımların öngörülemez ve genellikle işbirlikçi doğasını vurguluyor, rastgele önerilerin araştırma yönünde önemli değişimlere yol açabileceğini gösteriyor.",
      "Yazı ayrıca, aniden gelen aydınlanma anlarının kendiliğinden doğasıyla tetiklenen özgür irade ve insan zihni hakkındaki daha geniş felsefi tartışmalara değiniyor ve bu anların bilinçli karar verme anlayışımızı nasıl zorladığını ele alıyor."
    ],
    "points": 126,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1724390075
  },
  {
    "id": 41328964,
    "title": "Bilimsel yalanların şaşırtıcı ölüm oranı",
    "originLink": "https://www.vox.com/future-perfect/368350/scientific-research-fraud-crime-jail-time",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328964",
    "commentBody": "",
    "originSummary": [
      "Bilimsel sahtekarlık, kardiyolog Don Poldermans'ın sahte verilerinin tahmini 800.000 ölüme yol açtığı durumda görüldüğü gibi, artan ölüm oranları da dahil olmak üzere ciddi sonuçlara yol açabilir.",
      "Bilimsel suistimal, yaygın olarak inanıldığından daha yaygındır, suçlular için minimal sonuçlar doğurur ve hatalı çalışmaların geri çekilmesi yıllar alabilir, bu da hasta bakımını etkiler.",
      "Bilimsel sahtekarlığı suç saymak veya hesap verebilirliği sağlamak için bağımsız inceleme kurulları kurmak gibi öneriler var, çünkü mevcut cezalar yetersiz ve kurumlar genellikle itibarlarını korumak için kapsamlı soruşturmalardan kaçınıyor."
    ],
    "commentSummary": [
      "Bu tartışma, tıbbi araştırmalarda bilimsel sahtekarlığın ciddi etkisine odaklanıyor ve sahte beta bloker araştırmasının 800.000 ölüme yol açmış olabileceği vurgulanan bir vakayı öne çıkarıyor.",
      "Ele alınan temel konular arasında tek çalışmalara aşırı bağımlılık, zayıf replikasyon uygulamaları ve bulguların medyada yanlış raporlanması gibi sistemik sorunlar yer almaktadır.",
      "İyileştirme önerileri arasında daha iyi denetim ve dengeler, sahtekar araştırmacıların yargılanması ve çeşitli alanlarda araştırma uygulamalarının ve hesap verebilirliğin artırılması yer almaktadır."
    ],
    "points": 113,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1724420720
  },
  {
    "id": 41325514,
    "title": "Zettlr: Markdown ile Not Alma ve Yayınlama",
    "originLink": "https://lwn.net/Articles/984502/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41325514",
    "commentBody": "",
    "originSummary": [
      "Zettlr, çeşitli yazma görevleri için uygun ve derin özelleştirme sunan bir WYSIWYM (Gördüğünüz Şey Anlamınızdır) Markdown editörüdür.",
      "En son sürüm olan 3.2.0, 11 Haziran 2024'te yayınlandı ve yazılım, Linux, Windows ve macOS için kullanılabilen çapraz platformdur.",
      "Zettlr, gerçek zamanlı Markdown işleme, birden fazla belge görünümü, Emacs ve Vim modları ve yazma ilerlemesi, alıntılar ve dilbilgisi denetimi için araçlar gibi özellikler içerir."
    ],
    "commentSummary": [
      "Zettlr, Markdown kullanan, açık kaynaklı yapısı ve satıcı bağımlılığı olmamasıyla dikkat çeken bir not alma ve yayınlama aracıdır.",
      "Kullanıcılar, Zettlr'ı Obsidian gibi diğer araçlarla karşılaştırarak genişletilebilirlik, performans ve özelleştirme seçeneklerindeki farklılıkları vurguluyor.",
      "Yapılan tartışmalar, Markdown'un birlikte çalışabilirlik ve esneklik açısından önemini vurguluyor, bazı kullanıcılar basitliği ve Git gibi sürüm kontrol sistemleriyle uyumluluğu nedeniyle zengin metin editörlerine tercih ediyor."
    ],
    "points": 108,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1724375411
  },
  {
    "id": 41327956,
    "title": "Taşeron Kullanımı Boeing'e Milyarlara Mal Oldu (2019)",
    "originLink": "https://medium.com/javascript-scene/why-cutting-costs-is-expensive-how-9-hour-software-engineers-cost-boeing-billions-b76dbe571957",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41327956",
    "commentBody": "",
    "originSummary": [
      "Boeing'in maliyet düşürme önlemleri, yazılım mühendisliğini daha ucuz taşeronlara devretmeyi de içeren, 737 MAX'in arızalarına katkıda bulundu ve bu da iki ölümcül kazaya ve uçağın dünya çapında yere indirilmesine yol açtı.",
      "Boeing için piyasa değeri kayıplarında 6 milyar dolardan fazla zarara yol açan bu olaylar, maliyet tasarruflarını yazılım kalitesinin önüne koymanın tehlikelerini vurgulamaktadır.",
      "Bu vaka, maliyetli ve trajik sonuçları önlemek için yüksek kaliteli yazılım geliştirme uygulamalarına, uygun eğitime, mentorluk ve kapsamlı testlere yatırım yapmanın önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "Boeing'in yazılım geliştirmeyi dış kaynaklara devretmesi, önemli mali kayıplara ve kalite sorunlarına yol açarak bu tür uygulamalarla ilgili riskleri gözler önüne serdi.",
      "Manevra Karakteristikleri Artırma Sistemi (MCAS) hatası, 737 MAX'te maliyet düşürme önlemleri ve yetersiz güvenlik protokollerinin trajik sonuçlara yol açtığı başlıca bir örnektir.",
      "Bu tartışma, benzer olayların gelecekte önlenmesi için kritik yazılım sistemlerinde profesyonel mühendislik denetimi ve olası sertifikasyon gerekliliğini vurgulamaktadır."
    ],
    "points": 106,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1724411344
  },
  {
    "id": 41328447,
    "title": "Nanolog, 7 ns medyan gecikme süresiyle günlük kaydını destekler",
    "originLink": "https://github.com/PlatformLab/NanoLog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41328447",
    "commentBody": "",
    "originSummary": [
      "NanoLog, C++ için yüksek performanslı bir günlükleme sistemidir ve saniyede 80 milyondan fazla günlük kaydı yaparken, ortalama gecikme süresi sadece 7 nanosaniyenin biraz üzerindedir.",
      "Verimlilik ve çalışma süresi gecikmesi açısından spdlog, Log4j2, Boost, glog ve Windows Olay İzleme (ETW) gibi diğer günlükleme sistemlerinden daha üstün performans gösterir.",
      "NanoLog, derleme zamanında statik günlük bilgilerini çıkararak ve çalışma zamanında yalnızca dinamik bileşenleri kaydederek benzersiz bir yaklaşım kullanır, biçimlendirmeyi çevrimdışı bir sürece erteler."
    ],
    "commentSummary": [
      "Nanolog, ortalama 7 nanosaniye gecikme süresiyle günlük kaydı sunar, ancak gerçek uygulama gecikmesi yaklaşık 17 nanosaniyedir.",
      "Çoğu işi halletmek için bir arka plan iş parçacığı kullanır ve bu sayede günlükleme iş parçacığındaki yükü en aza indirmeyi amaçlar.",
      "Bu teknik, devrim niteliğinde olmasa da, performansı optimize etmek için gömülü yazılım ve diğer günlük sistemlerinde yaygın olarak kullanılır."
    ],
    "points": 102,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1724416335
  },
  {
    "id": 41326179,
    "title": "EPUBCheck – ePub yayınları için resmi uygunluk denetleyicisi",
    "originLink": "https://github.com/w3c/epubcheck",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326179",
    "commentBody": "",
    "originSummary": [
      "EPUBCheck, EPUB yayınlarını doğrulamak için kullanılan resmi araçtır ve komut satırı aracı veya Java kütüphanesi olarak mevcuttur. DAISY Konsorsiyumu tarafından W3C için bakım yapılmaktadır.",
      "En son sürüm, EPUBCheck v5.1.0, EPUB 2 ve 3 dosyalarının EPUB 3.3 spesifikasyonuna karşı doğrulanmasını destekler.",
      "Finansal destek, devam eden geliştirme ve bakım için gereklidir ve 3 Maddeli BSD Lisansı altında açık kaynaktır."
    ],
    "commentSummary": [
      "EPUBCheck, ePub yayınlarının doğrulanması için resmi araçtır ve bu yayınların endüstri standartlarına uygun olmasını sağlar.",
      "Yayıncılık sektörü genellikle eski uygulamalara dayanır, birçok yazar Microsoft Word kullanır ve bu da e-kitaplar ve baskılar için manuel dönüştürmeyi gerektirir.",
      "Kullanıcılar, LaTeX ve pandoc gibi çeşitli yöntemlerle e-kitap oluşturma yöntemlerini paylaştılar ve EPUBCheck gibi araçların doğrulama kontrollerinden geçmenin önemini tartıştılar."
    ],
    "points": 99,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1724387495
  },
  {
    "id": 41326138,
    "title": "Semaglutid, Ozempic gibi, iştahı bastırmakla kalmaz, visseral yağı da yakar.",
    "originLink": "https://onlinelibrary.wiley.com/doi/full/10.1002/oby.24126",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41326138",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Semaglutid, Ozempic'e benzer şekilde, metabolik bozukluklar ve insülin direnci ile bağlantılı olan visseral yağı hedefler ve azaltır, iştah baskılamanın ötesinde sağlık faydaları sunar.",
      "Bu tedavinin visseral yağı özel olarak hedefleme yeteneği, onu önceki kilo kaybı ilaçlarından ayırarak potansiyel olarak daha geniş sağlık avantajları sunar.",
      "Semaglutidin artan popülaritesi, uzun vadeli bağımlılık ve bilinmeyen riskler hakkındaki endişelere rağmen, etkili kilo verme çözümlerine olan talebi vurgulamaktadır."
    ],
    "points": 97,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1724386715
  }
]
