[
  {
    "title": "Oppo Reno 11 and Reno 11 Pro smartphones garner 250k pre-orders ahead of launch",
    "originLink": "https://gadgettendency.com/oppo-reno-11-and-reno-11-pro-smartphones-have-already-collected-250-thousand-pre-orders-although-there-are-still-five-days-before-the-premiere/",
    "originBody": "Phones Oppo Reno 11 and Reno 11 Pro smartphones have already collected 250 thousand pre-orders, although there are still five days before the premiere Share Tweet Published 24 mins ago on November 19, 2023 By Jeff Tucker According to the MyDrivers resource, 250 thousand pre-orders have already been collected for Oppo smartphones of the Reno11 line, which only takes into account orders on the Oppo Mall platform (220 thousand) and the Oppo brand store on the JD.com site (30 thousand), although pre-orders are also accepted on TMall and Pinduoduo. That is, in reality, the volume of pre-orders should be greater. Prices are not yet known. According to preliminary data, Oppo Reno 11 will be built on a single-chip MediaTek Dimensity 8200 system, and Reno 11 Pro will be based on SoC Qualcomm Snapdragon 8 Plus Gen 1. The main sensor of the main camera of Reno 11 Pro will be a 50-megapixel Sony IMX890, while the main one of Reno 11 The sensor will be a 50-megapixel Sony LYT-600. The charging power for Oppo Reno 11 will be 67 W, Oppo Reno 11 Pro – 80 W. The official premiere of the Reno 11 line will take place on November 23. Along with smartphones, the Oppo Pad Air2 tablet will be presented. OPPO Click to comment Leave a Reply Your email address will not be published. Required fields are marked * Comment * Name * Email * Website Save my name, email, and website in this browser for the next time I comment. Phones iPhone 16 and 16 Plus will still only offer 60Hz screens Published 9 mins ago on November 19, 2023 By Robert Adams It’s possible that the base next-generation iPhones will still have 60Hz screens. Insider Revegnus claims that the iPhone 16 and 16 Plus will receive 60Hz LTPS panels. In the first case, the diagonal will be 6.12 inches, in the second – 6.69 inches. That is, nothing will change relative to the current generation, although, of course, the panels themselves may be more modern. But the screens of the iPhone 16 Pro and 16 Pro Max, as previously stated by other sources, will grow to 6.3 and 6.9 inches, respectively. To be more precise, 6.27 and 6.86 inches. Let us remember that earlier there were rumors that the younger iPhone 16 would receive 90 Hz screens. Also, previously, even younger new products were assigned an Action button. What else, besides the platform, will be new for the iPhone 16 and 16 Plus is still unknown. Insider Revegnus was the first to publish a photo of the Samsung Galaxy Z Flip5 before its release, reported on the AMD GPU in the Exynos 1480 SoC, and also described the characteristics of the Exynos 2400, which were then confirmed in Geekbench software. Continue Reading Phones Samsung Galaxy S20 FE will not receive Android 14 and One UI 6.0, but the company continues to release updates for this model Published 2 hours ago on November 19, 2023 By Robert Adams Samsung has released another firmware update for the already middle-aged Galaxy S20 FE smartphone, and the update was released for both versions: both on the Exynos SoC and on the Snapdragon SoC. Image: Samsung The new patch contains the November Android security updates – both from Google itself and from Samsung. It closes 65 security holes. Also, the November security patch is out now for the Galaxy Tab S6 Lite and Galaxy Tab Active 3. The Samsung Galaxy S20 FE came out with Android 10 and has already received an update to Android 13. Android 14 and, accordingly, the One UI 6.0 interface are not included in this model, but the smartphone continues to receive targeted updates – security and individual applications. Continue Reading Phones Honor Magic5 Pro is the best smartphone in its price category according to the results of extensive testing by China Telecom Published 4 hours ago on November 19, 2023 By Henry Brown China Telecom has published the “November 2023 User Device Analytics Report.” Data from a large study conducted by the operator suggests that the best smartphone in its price category (costing more than 5,000 yuan – that is, more than $690) is the Honor Magic5 Pro. Honor Magic5 is also the best in its category (from 3000 to 5000 yuan – from 415 to 690 dollars). Honor Magic5 Pro became the best in terms of communication quality in general, as well as the 5G modem and Wi-Fi adapter separately. Honor Magic5 Pro also became the best in terms of battery life and stability. Honor Magic5 Pro uses the proprietary Honor C1 chip, which is designed to improve communication quality. In particular, it allows you to reduce the delay in data transfer over Wi-Fi by 90% and increase Wi-Fi speed by half. It also improves cellular signal reception by 35%. Continue Reading Advertisement Latest Stories Phones9 mins ago iPhone 16 and 16 Plus will still only offer 60Hz screens It’s possible that the base next-generation iPhones will still have 60Hz screens. Insider Revegnus claims that the iPhone 16 and... News22 mins ago The world’s largest solar power plant located in a single space was launched in the UAE Shortly before the start of the COP28 event, the United Arab Emirates launched the 2GW Al Dhafra Solar PV solar... Phones24 mins ago Oppo Reno 11 and Reno 11 Pro smartphones have already collected 250 thousand pre-orders, although there are still five days before the premiere According to the MyDrivers resource, 250 thousand pre-orders have already been collected for Oppo smartphones of the Reno11 line, which... News59 mins ago The most powerful Stirling engine was tested in China; it produced 102 kW (almost 140 hp) While NASA is just preparing to present its prototype Stirling engine (it is supposed to be used as part of... Advertisement Most Popular Electric Cars7 days ago 2 kg versus 10 kg, complete elimination of lead and the ability to start a car even after a year. BYD has completely switched to lithium iron phosphate starting batteries Components7 days ago Intel is confident in its dominance in the processor market, despite the active offensive of AMD and Arm News5 days ago This is a record: an Internet line with a speed of 1.2 terabits per second has been launched in China News6 days ago Is this the new king of mobile photography? Lots of stunning shots taken with the Vivo X100 Pro",
    "originSummary": [
      "The Oppo Reno 11 and Reno 11 Pro smartphones have already amassed 250,000 pre-orders prior to their official launch, with five days left to go.",
      "Pre-orders were collected on the Oppo Mall platform and JD.com's Oppo brand store, with other platforms also accepting pre-orders.",
      "The smartphones' prices have not been disclosed yet.",
      "The Reno 11 will be equipped with a MediaTek Dimensity 8200 system, while the Reno 11 Pro will feature a Qualcomm Snapdragon 8 Plus Gen 1 system.",
      "Both devices will sport a 50-megapixel main camera sensor, with the Reno 11 Pro using the Sony IMX890 sensor and the Reno 11 using the Sony LYT-600 sensor.",
      "The charging power for the Reno 11 is set at 67W, while the Reno 11 Pro will have 80W.",
      "The official launch of the Reno 11 series is scheduled for November 23, which will also introduce the Oppo Pad Air2 tablet."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700400417535
  }
]
