[
  {
    "id": 40805099,
    "title": "Empresa de telecomunicações sul-coreana ataca usuários de torrent com malware",
    "originLink": "https://www.tomshardware.com/tech-industry/cyber-security/south-korean-telecom-company-attacks-torrent-users-with-malware-over-600000-people-report-missing-files-strange-folders-and-disabled-pcs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805099",
    "commentBody": "",
    "originSummary": [
      "KT Corporation, uma grande empresa de telecomunicações sul-coreana, infectou intencionalmente mais de 600.000 usuários com malware para interromper o serviço de Grid baseado em BitTorrent da Webhard, começando em maio de 2020.",
      "Malware causou problemas como arquivos ausentes, pastas estranhas e PCs desativados, e foi rastreado até o centro de dados da KT.",
      "Autoridades acusaram 13 indivíduos, incluindo funcionários da KT, e a KT defendeu suas ações citando sobrecarga na rede e taxas de uso não pagas, embora a instalação não autorizada de malware tenha causado problemas significativos aos clientes."
    ],
    "commentSummary": [
      "Empresa de telecomunicações sul-coreana supostamente mira usuários de torrent com malware, levantando preocupações significativas de privacidade e ética.",
      "O incidente destaca problemas contínuos com provedores de serviços de internet (ISPs) na Coreia do Sul, incluindo altas taxas e possível abuso de poder.",
      "Esta situação gerou discussões sobre o estado da liberdade e infraestrutura da internet na Coreia do Sul, que já foi conhecida por suas rápidas velocidades de internet, mas agora enfrenta críticas por práticas desatualizadas e controle governamental."
    ],
    "points": 406,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1719439380
  },
  {
    "id": 40807032,
    "title": "25 anos de videoclipes perdidos enquanto a Paramount encerra o site da Comedy Central",
    "originLink": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40807032",
    "commentBody": "",
    "originSummary": [
      "Paramount fechou o site ComedyCentral.com, removendo mais de 25 anos de clipes do The Daily Show e do The Colbert Report, direcionando os visitantes para provedores de TV ou Paramount+.",
      "Outros programas como The Opposition with Jordan Klepper e Lights Out with David Spade também são afetados, com episódios mais antigos não disponíveis no Paramount+.",
      "Esta medida faz parte das ações de corte de custos da Paramount para gerenciar mais de 14 bilhões de dólares em dívidas, seguindo ações semelhantes com MTV.com e CMT.com, visando simplificar os sites e direcionar os espectadores para o Paramount+."
    ],
    "commentSummary": [
      "Paramount removeu 25 anos de clipes de vídeo do site da Comedy Central, gerando críticas sobre a percepção de subvalorização do conteúdo pela administração.",
      "Críticos argumentam que o conteúdo poderia ter sido monetizado ou preservado, destacando as complexidades dos direitos de mídia e os desafios regulatórios na distribuição de conteúdo mais antigo.",
      "A remoção é vista como uma medida de corte de custos pela Paramount em meio a dificuldades financeiras, com alguns lamentando a perda da história cultural e sugerindo a pirataria como um meio de preservação."
    ],
    "points": 396,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1719460502
  },
  {
    "id": 40808820,
    "title": "Google Sheets migrou seu trabalhador de cálculo de JavaScript para WasmGC",
    "originLink": "https://web.dev/case-studies/google-sheets-wasmgc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808820",
    "commentBody": "",
    "originSummary": [
      "Google Sheets fez a transição de JavaScript para WasmGC (Coleta de Lixo do WebAssembly) para melhorar o desempenho, especialmente para planilhas grandes.",
      "WasmGC suporta linguagens com coleta de lixo como Java, oferecendo uma velocidade quase nativa na web, e o Google Sheets está entre os primeiros a implementá-lo.",
      "Inicialmente, o desempenho do WasmGC era mais lento do que o do JavaScript, mas otimizações subsequentes melhoraram significativamente sua velocidade, demonstrando seu potencial para revolucionar o desenvolvimento de aplicações web."
    ],
    "commentSummary": [
      "Google Sheets mudou seu mecanismo de cálculo de JavaScript para WasmGC, inicialmente experimentando um desempenho mais lento, mas depois otimizando-o para ser duas vezes mais rápido que a versão em JS.",
      "Essa mudança envolveu esforços significativos de reimplementação, incluindo desvirtualização e aproveitamento das APIs do navegador, com o objetivo de melhorar o desempenho e utilizar o coletor de lixo nativo do V8.",
      "Apesar das melhorias, alguns usuários ainda acham o Google Sheets mais lento em comparação com aplicativos nativos como o Excel, destacando a evolução contínua e a otimização das tecnologias web."
    ],
    "points": 302,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1719480849
  },
  {
    "id": 40806698,
    "title": "Soneto Claude 3.5",
    "originLink": "https://thezvi.substack.com/p/on-claude-35-sonnet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806698",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Anthropic introduziu o recurso Projetos para usuários Pro e Team, permitindo múltiplos projetos com seus próprios materiais de referência, aumentando a conveniência para os usuários.",
      "Claude 3.5 Sonnet está recebendo elogios por suas habilidades de codificação, com usuários observando que ele ajuda programadores experientes a trabalharem mais rápido e é superior a outros modelos como o GPT-4.",
      "Os usuários estão discutindo as aplicações práticas e limitações do Claude 3.5 Sonnet, incluindo seu desempenho em tarefas de sumarização, recomendação e assistência em codificação, com alguns preferindo-o às ofertas da OpenAI."
    ],
    "points": 277,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1719456130
  },
  {
    "id": 40804122,
    "title": "A Forth Deck mini: um computador Forth portátil com uma CPU discreta",
    "originLink": "http://mynor.org/my4th_forthdeck.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40804122",
    "commentBody": "",
    "originSummary": [
      "A Forth Deck mini é um computador portátil Forth com uma CPU discreta, apresentando um LCD de 40x4 caracteres, teclado QWERTY de 56 botões e bateria LiPo de 6,6 Wh com 6 horas de autonomia.",
      "Inclui uma CPU lógica CMOS de 8 bits, 32 KB de ROM, 32 KB de RAM, até 256 KB de EEPROM e RS-232 com 4800 baud, lembrando os computadores domésticos dos anos 70 e 80 com interpretadores Basic embutidos.",
      "Aparelho pode ser montado usando um kit da Budgetronics, excluindo a bateria e o circuito de carregamento, e está licenciado sob a Licença Creative Commons Atribuição-CompartilhaIgual 4.0 Internacional."
    ],
    "commentSummary": [
      "A Forth Deck mini é um computador Forth portátil com uma CPU discreta construída com alguns chips lógicos e uma EEPROM, operando em um barramento de dados e endereços de 8 bits.",
      "Entusiastas estão discutindo seu design, possíveis modificações e comparações com outros CPUs como o Novix NC4000, assim como a ideia de um dialeto Forth baseado em Factor para scripting.",
      "As conversas destacam os desafios de criar computadores modernos para hobbyistas com bons teclados e displays, fazendo referência a dispositivos como o TRS-80 Model 100 e o AlphaSmart, e mencionando alternativas como o M5Stack Cardputer e o Zorzpad."
    ],
    "points": 266,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1719432751
  },
  {
    "id": 40805251,
    "title": "Os cérebros produzem muito lixo. Agora os cientistas acham que sabem para onde ele vai",
    "originLink": "https://www.npr.org/sections/shots-health-news/2024/06/26/g-s1-6177/brain-waste-removal-system-amyloid-alzheimer-toxins",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805251",
    "commentBody": "",
    "originSummary": [
      "Cientistas descobriram novos detalhes sobre o sistema de remoção de resíduos do cérebro, que é essencial para manter a saúde cerebral e prevenir distúrbios.",
      "Pesquisas publicadas na Nature revelam que ondas elétricas lentas durante o sono ajudam a empurrar o fluido carregado de resíduos das profundezas do cérebro para sua superfície, onde é absorvido pela corrente sanguínea e removido pelo fígado e pelos rins.",
      "Este sistema glinfático é crucial para a eliminação de amiloide, uma substância ligada à doença de Alzheimer, e a remoção de resíduos prejudicada pode contribuir para vários distúrbios cerebrais como Alzheimer, Parkinson, dores de cabeça e depressão."
    ],
    "commentSummary": [
      "Os cientistas identificaram que o sono profundo desempenha um papel crucial na eliminação de resíduos cerebrais, incluindo proteínas amiloides, que estão ligadas ao Alzheimer e à demência.",
      "Pesquisas sugerem que induzir ondas elétricas lentas no cérebro através da estimulação por luz e som poderia melhorar essa limpeza de resíduos, embora a maioria dos estudos atualmente seja em camundongos.",
      "Fatores como o consumo de café, exercícios e padrões de sono também estão sendo discutidos por seu potencial impacto na saúde do cérebro."
    ],
    "points": 244,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1719440509
  },
  {
    "id": 40805010,
    "title": "Bots de voz com tempos de resposta de 500ms",
    "originLink": "https://fastvoiceagent.cerebrium.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805010",
    "commentBody": "",
    "originSummary": [
      "Experimentação com interfaces de voz e grandes modelos de linguagem (LLMs) começou após o lançamento do GPT-4, destacando a natureza envolvente e os novos desafios das interações de voz com IA generativa.",
      "Alcançar um tempo de resposta de voz para voz de 500ms é desafiador, mas possível ao hospedar transcrição, inferência de LLM e geração de voz juntos, otimizando o roteamento de dados e garantindo um bom cache de wifi e VRAM.",
      "A demonstração de um bot de voz capaz de 500ms e um contêiner para implantação em GPUs A10/A100/H100 está disponível, com métricas atuais mostrando um ciclo total de resposta de 759ms, indicando rápida evolução da IA e potenciais simplificações futuras."
    ],
    "commentSummary": [
      "É possível que bots de voz alcancem tempos de resposta de 500ms otimizando os processos de transcrição, inferência de LLM e geração de voz, juntamente com roteamento de dados eficiente e caching.",
      "Os indicadores para resposta de voz a voz totalizam 759ms, mas futuros LLMs com capacidades nativas de áudio podem reduzir ainda mais esse tempo.",
      "Os usuários destacaram a importância da baixa latência nas interações de IA, especialmente no atendimento ao cliente, e discutiram possíveis melhorias técnicas, como suporte a navegadores e processamento no dispositivo."
    ],
    "points": 241,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1719438663
  },
  {
    "id": 40803783,
    "title": "Impressão 3D de metal de próxima geração",
    "originLink": "https://fabric8labs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40803783",
    "commentBody": "",
    "originSummary": [
      "Fabric8Labs, uma startup de San Diego, garantiu US$ 50 milhões em financiamento da Série B para avançar sua tecnologia de manufatura aditiva eletroquímica.",
      "A verba apoiará a construção de uma nova fábrica de impressão 3D, aumentando significativamente a força de trabalho da empresa.",
      "Este investimento destaca o crescente interesse e a entrada de capital em startups de impressão 3D, impulsionados por tecnologias de manufatura inovadoras."
    ],
    "commentSummary": [
      "Impressão 3D de metal de próxima geração pela Fabric8Labs emprega métodos eletroquímicos para fabricação precisa, rápida e versátil, alcançando resolução em nível de micrômetros.",
      "Esta técnica combina processos aditivos e subtrativos, depositando principalmente metais puros e algumas ligas, tornando-a mais segura e eficiente em termos de energia ao evitar altas temperaturas e pós metálicos.",
      "A tecnologia da Fabric8Labs é promissora para aplicações como PCBs (Placas de Circuito Impresso) e estruturas internas complexas, e a empresa está explorando oportunidades comerciais com essa abordagem única."
    ],
    "points": 236,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1719430874
  },
  {
    "id": 40807923,
    "title": "Eplot: Um novo pacote para criar gráficos no Emacs",
    "originLink": "https://lars.ingebrigtsen.no/2024/06/26/a-new-package-for-making-charts-in-emacs-eplot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40807923",
    "commentBody": "",
    "originSummary": [
      "Um novo pacote do Emacs chamado eplot foi lançado, projetado para criar gráficos simples diretamente no Emacs.",
      "Eplot aborda limitações encontradas em ferramentas existentes como chart.el e Gnuplot, oferecendo recursos como números sensatos no eixo Y e gradientes SVG.",
      "A embalagem é fácil de usar, permitindo que os usuários gerem gráficos digitando M-x eplot em um buffer com números, e está documentada no GitHub."
    ],
    "commentSummary": [
      "Um novo pacote chamado Eplot foi lançado para criar gráficos no Emacs, um editor de texto popular entre os desenvolvedores.",
      "A embalagem atraiu atenção por sua simplicidade e flexibilidade, com sugestões para melhorar a experiência do usuário aproveitando as variáveis locais de arquivos e diretórios do Emacs.",
      "Discussões destacam comparações com outras ferramentas de criação de gráficos como Gnuplot e Matplotlib, observando os pontos fortes e fracos de cada uma no contexto do Emacs."
    ],
    "points": 216,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1719470024
  },
  {
    "id": 40806930,
    "title": "Há 6 meses, eu deixei o complexo industrial de besteiras",
    "originLink": "https://www.joanwestenberg.com/6-months-ago,-i-left-the-bullshit-industrial-complex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806930",
    "commentBody": "",
    "originSummary": [
      "Um ex-profissional de relações públicas de tecnologia revela seu passado promovendo startups exageradas, que financiaram um estilo de vida luxuoso, mas levaram a dúvidas éticas.",
      "Decidiram deixar a indústria lucrativa, mas moralmente questionável, para se concentrar em escrever honestamente sobre o impacto real da tecnologia e do capital de risco na vida humana.",
      "Apesar dos riscos financeiros e de carreira, eles encontram integridade e realização pessoal em seu novo caminho, rejeitando as promessas vazias da indústria de tecnologia."
    ],
    "commentSummary": [
      "A autora expressa desilusão com a indústria de tecnologia, observando uma mudança de resolver problemas humanos para extrair valor nos últimos 25 anos.",
      "Observações principais incluem uma postagem no Reddit afirmando que os anos 90 foram o auge da humanidade e uma citação viral sobre a IA fazer tarefas domésticas em vez de trabalho criativo, destacando uma visão nostálgica do otimismo tecnológico do passado.",
      "Apesar das preocupações com a exploração de dados e os motivos orientados pelo lucro, ainda há esperança nas comunidades de código aberto e em hacks inovadores, embora a busca incessante pelo lucro tenha levado a um desânimo generalizado."
    ],
    "points": 210,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1719459232
  },
  {
    "id": 40804489,
    "title": "Denunciantes federais têm direito a indenizações por salários futuros perdidos, decide tribunal",
    "originLink": "https://www.govexec.com/pay-benefits/2024/06/federal-whistleblowers-are-entitled-damages-missed-future-pay-court-rules/397638/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40804489",
    "commentBody": "",
    "originSummary": [
      "A Corte de Apelações dos EUA para o Circuito Federal decidiu que denunciantes federais podem receber indenizações compensatórias por perdas futuras de ganhos se sua demissão prejudicou seu potencial de ganho.",
      "Deborah Perlick, demitida após relatar fundos desaparecidos, argumentou com sucesso por uma compensação adicional além do pagamento retroativo, impactando suas futuras perspectivas de emprego.",
      "Esta decisão estabelece um precedente para denunciantes federais, permitindo reivindicações por ganhos futuros perdidos sem a necessidade de emprego futuro garantido, e o caso foi remetido ao Conselho de Proteção dos Sistemas de Mérito para uma decisão final."
    ],
    "commentSummary": [
      "A justiça decidiu que os denunciantes federais têm direito a indenizações por salários futuros perdidos, mesmo sem um emprego futuro garantido, desde que haja evidências suficientes de provável emprego futuro.",
      "Esta decisão pode encorajar mais denunciantes ao aliviar preocupações sobre a perda de ganhos futuros e alinha os direitos dos funcionários federais com os dos funcionários do setor privado.",
      "A questão, envolvendo um funcionário do VA (Veterans Affairs), enfatizou que o dano reputacional que afeta ganhos futuros é indenizável."
    ],
    "points": 205,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1719435248
  },
  {
    "id": 40808933,
    "title": "Lições que Eu Gostaria de Ter Aprendido (1996) [pdf]",
    "originLink": "https://www.ams.org/notices/199701/comm-rota.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808933",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "‘Lessons I Wish I Had Been Taught (1996)’ de Gian-Carlo Rota gerou discussões no Hacker News, com usuários compartilhando unidades de medida únicas como ‘microcentury’ (50 minutos) e ‘nanoacre’ (4 milímetros quadrados).",
      "Conversas também abordaram a duração das palestras, a capacidade de atenção e a importância de introduções envolventes em trabalhos acadêmicos, refletindo sobre os ensinamentos impactantes de Rota.",
      "A discussão destacou um interesse recorrente nas percepções de Rota, com usuários relembrando experiências pessoais e fazendo referência a discussões e recursos relacionados."
    ],
    "points": 186,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1719482778
  },
  {
    "id": 40808808,
    "title": "Advogados dos Correios realizaram reunião secreta com juiz para impedir divulgação",
    "originLink": "https://www.lawgazette.co.uk/news/post-office-lawyers-held-secret-meeting-with-judge-to-stop-disclosure/5119593.article",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808808",
    "commentBody": "",
    "originSummary": [
      "Os advogados dos Correios realizaram uma reunião secreta com um juiz em 2013 para impedir a divulgação de um relatório que revelava possíveis problemas com o sistema Horizon aos advogados de defesa em um julgamento criminal.",
      "A investigação ouviu que o advogado de acusação Martin Smith admitiu que não cumpriu com seus deveres e carecia da expertise necessária, levantando preocupações sobre condenações passadas e práticas de divulgação.",
      "A investigação em andamento continua a revelar vários problemas de divulgação à medida que os Correios se aproximam da mediação e das revisões de condenações passadas."
    ],
    "commentSummary": [
      "Advogados dos Correios se reuniram secretamente com um juiz para bloquear a divulgação de provas, resultando em condenações injustas.",
      "Os defensores públicos estão sobrecarregados, gerenciando até 700 casos anualmente, o que prejudica a defesa eficaz.",
      "A justiça favorece aqueles que podem pagar advogados particulares, ressaltando a necessidade de reformas legais e melhor financiamento para defensores públicos a fim de garantir julgamentos justos."
    ],
    "points": 182,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1719480716
  },
  {
    "id": 40806356,
    "title": "DoorDash e Arbitragem de Pizza (2020)",
    "originLink": "https://www.readmargins.com/p/doordash-and-pizza-arbitrage",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806356",
    "commentBody": "",
    "originSummary": [
      "Doordash listou uma pizzaria sem a permissão do proprietário, levando a problemas com entregas frias e preços incorretos.",
      "Uma oportunidade de arbitragem surgiu devido a erros de precificação do Doordash, permitindo lucro ao fazer pedidos a preços mais baixos e vender a preços mais altos dos restaurantes.",
      "O artigo critica o modelo de negócios de entrega de alimentos como ineficiente e explorador, sugerindo que uma abordagem mais integrada, como a da Domino's, pode ser mais sustentável."
    ],
    "commentSummary": [
      "DoorDash e serviços de entrega de alimentos semelhantes enfrentam críticas por modelos de negócios insustentáveis que dependem de mão de obra mal remunerada e altos custos de aquisição de clientes.",
      "Críticos argumentam que essas práticas exacerbam a desigualdade econômica e sugerem taxar o capital acumulado para redistribuir a riqueza.",
      "A discussão inclui preocupações sobre o impacto negativo na qualidade dos restaurantes e a ética desses serviços de entrega, questionando sua sustentabilidade e benefícios a longo prazo."
    ],
    "points": 174,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1719451012
  },
  {
    "id": 40805351,
    "title": "Corcel – Use o backend do WordPress com Laravel ou qualquer aplicação PHP",
    "originLink": "https://github.com/corcel/corcel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805351",
    "commentBody": "",
    "originSummary": [
      "Corcel é uma biblioteca PHP construída sobre o Eloquent ORM do Laravel, permitindo a recuperação direta de dados de um banco de dados WordPress, utilizável com Laravel ou qualquer projeto PHP via Composer.",
      "Os principais recursos incluem suporte para tipos de post personalizados, shortcodes, taxonomias, páginas, anexos, revisões, miniaturas, opções, menus, usuários e autenticação.",
      "Instalação e configuração são simples, com registro automático para Laravel 5.5+ e configuração manual para versões mais antigas ou projetos não Laravel."
    ],
    "commentSummary": [
      "Corcel permite o uso de um backend WordPress com Laravel ou qualquer aplicação PHP, provando ser eficaz em ambientes de produção.",
      "Os usuários integraram com sucesso o Corcel com Laravel, Filament e LunarPHP para melhorar o desempenho, como resgatar sites WooCommerce lentos.",
      "Corcel é elogiado por sua interface perfeita com dados do WordPress, oferecendo uma solução sustentável para projetos PHP que precisam interagir com bancos de dados do WordPress, e é comparado favoravelmente a ferramentas como Prismic, Strapi e Shopify."
    ],
    "points": 147,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1719441239
  }
]
