[
  {
    "id": 40805099,
    "title": "شركة اتصالات كورية جنوبية تهاجم مستخدمي التورنت بالبرمجيات الخبيثة",
    "originLink": "https://www.tomshardware.com/tech-industry/cyber-security/south-korean-telecom-company-attacks-torrent-users-with-malware-over-600000-people-report-missing-files-strange-folders-and-disabled-pcs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805099",
    "commentBody": "",
    "originSummary": [
      "قامت شركة KT Corporation، وهي شركة اتصالات كورية جنوبية كبرى، بإصابة أكثر من 600,000 مستخدم ببرمجيات خبيثة عمدًا لتعطيل خدمة Grid Service المستندة إلى BitTorrent التابعة لشركة Webhard، وذلك بدءًا من مايو 2020.",
      "تسبب البرمجيات الخبيثة في مشاكل مثل الملفات المفقودة، والمجلدات الغريبة، وتعطيل أجهزة الكمبيوتر، وتم تتبع مصدرها إلى مركز بيانات KT.",
      "وجهت السلطات اتهامات لـ 13 فردًا، بما في ذلك موظفي شركة KT، ودافعت شركة KT عن أفعالها بالإشارة إلى الضغط على الشبكة ورسوم الاستخدام غير المدفوعة، على الرغم من أن تثبيت البرمجيات الخبيثة غير المصرح به أدى إلى مشاكل كبيرة للعملاء."
    ],
    "commentSummary": [
      "شركة اتصالات كورية جنوبية تستهدف مستخدمي التورنت ببرامج ضارة، مما يثير مخاوف كبيرة بشأن الخصوصية والأخلاقيات.",
      "تسلط الحادثة الضوء على المشاكل المستمرة مع مزودي خدمات الإنترنت (ISPs) في كوريا الجنوبية، بما في ذلك الرسوم العالية وإمكانية إساءة استخدام السلطة.",
      "أثارت هذه الحالة نقاشات حول حالة حرية الإنترنت والبنية التحتية في كوريا الجنوبية، التي كانت تُعرف سابقًا بسرعات الإنترنت العالية ولكنها تواجه الآن انتقادات بسبب الممارسات القديمة وسيطرة الحكومة."
    ],
    "points": 406,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1719439380
  },
  {
    "id": 40807032,
    "title": "25 عامًا من مقاطع الفيديو تختفي مع إغلاق باراماونت لموقع كوميدي سنترال",
    "originLink": "https://latenighter.com/news/paramount-axes-comedy-central-website-show-clips-library/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40807032",
    "commentBody": "",
    "originSummary": [
      "أغلقت شركة باراماونت موقع ComedyCentral.com، مما أدى إلى إزالة أكثر من 25 عامًا من المقاطع من برنامج The Daily Show وبرنامج The Colbert Report، موجهة الزوار إلى مزودي التلفزيون أو Paramount+.",
      "برامج أخرى مثل The Opposition مع جوردان كليبر وLights Out مع ديفيد سبيد تتأثر أيضًا، حيث أن الحلقات القديمة غير متوفرة على Paramount+.",
      "تأتي هذه الخطوة كجزء من تدابير خفض التكاليف التي تتبعها شركة باراماونت لإدارة ديون تزيد عن 14 مليار دولار، وذلك بعد اتخاذ إجراءات مماثلة مع MTV.com وCMT.com، بهدف تبسيط المواقع وجذب المشاهدين إلى Paramount+."
    ],
    "commentSummary": [
      "أزالت شركة باراماونت 25 عامًا من مقاطع الفيديو من موقع كوميدي سنترال، مما أثار انتقادات حول ما يُعتبر تقليلًا من قيمة المحتوى من قبل الإدارة.",
      "يجادل النقاد بأن المحتوى كان يمكن تحقيق أرباح منه أو الحفاظ عليه، مما يبرز تعقيدات حقوق الإعلام والتحديات التنظيمية في توزيع المحتوى القديم.",
      "يُنظر إلى الإزالة كإجراء لخفض التكاليف من قبل شركة باراماونت في ظل الصعوبات المالية، حيث يأسف البعض لفقدان التاريخ الثقافي ويقترحون القرصنة كوسيلة للحفاظ عليه."
    ],
    "points": 396,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1719460502
  },
  {
    "id": 40808820,
    "title": "نقلت Google Sheets عامل الحساب الخاص بها من JavaScript إلى WasmGC",
    "originLink": "https://web.dev/case-studies/google-sheets-wasmgc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808820",
    "commentBody": "",
    "originSummary": [
      "انتقلت جداول بيانات Google من JavaScript إلى WasmGC (جمع القمامة في WebAssembly) لتعزيز الأداء، خاصة بالنسبة لجداول البيانات الكبيرة.",
      "يدعم WasmGC اللغات التي تعتمد على جمع القمامة مثل جافا، مما يوفر سرعة قريبة من الأصلية على الويب، وتعد جوجل شيتس من أوائل التطبيقات التي قامت بتنفيذه.",
      "كان الأداء الأولي لـ WasmGC أبطأ من JavaScript، ولكن التحسينات اللاحقة قد حسنت سرعته بشكل كبير، مما يظهر إمكانيته في إحداث ثورة في تطوير تطبيقات الويب."
    ],
    "commentSummary": [
      "انتقلت جداول بيانات Google من محرك الحسابات القائم على JavaScript إلى WasmGC، حيث شهدت في البداية أداءً أبطأ ولكنها قامت لاحقًا بتحسينه ليصبح أسرع بمرتين من النسخة القائمة على JavaScript.",
      "تضمنت الخطوة جهود إعادة تنفيذ كبيرة، بما في ذلك إزالة الافتراضية والاستفادة من واجهات برمجة تطبيقات المتصفح، بهدف تحسين الأداء واستخدام جامع القمامة الأصلي V8.",
      "على الرغم من التحسينات، لا يزال بعض المستخدمين يجدون أن جداول بيانات جوجل أبطأ مقارنة بالتطبيقات الأصلية مثل إكسل، مما يبرز التطور المستمر وتحسين تقنيات الويب."
    ],
    "points": 302,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1719480849
  },
  {
    "id": 40806698,
    "title": "كلود 3.5 سونيت",
    "originLink": "https://thezvi.substack.com/p/on-claude-35-sonnet",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806698",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قدمت شركة Anthropic ميزة المشاريع لمستخدمي Pro وTeam، مما يتيح وجود مشاريع متعددة بمواد مرجعية خاصة بها، مما يعزز من راحة المستخدمين.",
      "يحظى كلود 3.5 سونيت بإشادة كبيرة لقدراته في البرمجة، حيث يلاحظ المستخدمون أنه يساعد المبرمجين الخبراء على العمل بسرعة أكبر ويتفوق على نماذج أخرى مثل GPT-4.",
      "يناقش المستخدمون التطبيقات العملية والقيود الخاصة بـ Claude 3.5 Sonnet، بما في ذلك أدائه في مهام التلخيص والتوصيات والمساعدة في البرمجة، مع تفضيل البعض له على عروض OpenAI."
    ],
    "points": 277,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1719456130
  },
  {
    "id": 40804122,
    "title": "السطح الرابع المصغر: حاسوب فورت محمول بوحدة معالجة مركزية منفصلة",
    "originLink": "http://mynor.org/my4th_forthdeck.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40804122",
    "commentBody": "",
    "originSummary": [
      "يُعد جهاز Forth Deck mini حاسوبًا محمولًا يعمل بنظام Forth مع وحدة معالجة مركزية منفصلة، ويتميز بشاشة LCD بحجم 40x4 حرف، ولوحة مفاتيح QWERTY تحتوي على 56 زرًا، وبطارية LiPo بسعة 6.6 واط ساعي توفر وقت تشغيل يصل إلى 6 ساعات.",
      "يتضمن وحدة معالجة مركزية منطقية CMOS بثمانية بت، وذاكرة قراءة فقط بسعة 32 كيلوبايت، وذاكرة وصول عشوائي بسعة 32 كيلوبايت، وذاكرة EEPROM تصل إلى 256 كيلوبايت، وواجهة RS-232 بسرعة 4800 بود، مما يذكرنا بأجهزة الكمبيوتر المنزلية في السبعينيات والثمانينيات التي تحتوي على مفسرات Basic مدمجة.",
      "يمكن تجميع الجهاز باستخدام مجموعة من Budgetronics، باستثناء البطارية ودائرة الشحن، وهو مرخص بموجب رخصة المشاع الإبداعي النسبة-المشاركة على قدم المساواة 4.0 الدولية."
    ],
    "commentSummary": [
      "يعد جهاز Forth Deck mini حاسوبًا محمولًا يعمل بنظام Forth، ويتميز بوحدة معالجة مركزية منفصلة مبنية باستخدام عدد قليل من رقائق المنطق وذاكرة EEPROM، ويعمل على ناقل بيانات وعناوين بعرض 8 بت.",
      "المتحمسون يناقشون تصميمه، والتعديلات المحتملة، والمقارنات مع وحدات المعالجة المركزية الأخرى مثل Novix NC4000، وكذلك فكرة لهجة Factor المستندة إلى لغة Forth للبرمجة النصية.",
      "تسلط المحادثة الضوء على تحديات إنشاء أجهزة الكمبيوتر الحديثة للهواة التي تتمتع بلوحات مفاتيح وشاشات جيدة، مشيرة إلى أجهزة مثل TRS-80 Model 100 وAlphaSmart، وذكر بدائل مثل M5Stack Cardputer وZorzpad."
    ],
    "points": 266,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1719432751
  },
  {
    "id": 40805251,
    "title": "الدماغ ينتج الكثير من الفضلات. الآن يعتقد العلماء أنهم يعرفون إلى أين تذهب",
    "originLink": "https://www.npr.org/sections/shots-health-news/2024/06/26/g-s1-6177/brain-waste-removal-system-amyloid-alzheimer-toxins",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805251",
    "commentBody": "",
    "originSummary": [
      "اكتشف العلماء تفاصيل جديدة حول نظام إزالة النفايات في الدماغ، وهو أمر ضروري للحفاظ على صحة الدماغ ومنع الاضطرابات.",
      "كشفت أبحاث نُشرت في مجلة Nature أن الموجات الكهربائية البطيئة أثناء النوم تساعد في دفع السوائل المحملة بالنفايات من أعماق الدماغ إلى سطحه، حيث يتم امتصاصها في مجرى الدم وإزالتها بواسطة الكبد والكلى.",
      "يعد هذا النظام الجليمفاتي ضروريًا لإزالة الأميلويد، وهي مادة مرتبطة بمرض الزهايمر، وقد يساهم ضعف إزالة الفضلات في الإصابة باضطرابات دماغية مختلفة مثل الزهايمر، وباركنسون، والصداع، والاكتئاب."
    ],
    "commentSummary": [
      "حدد العلماء أن النوم العميق يلعب دورًا حاسمًا في تنظيف مخلفات الدماغ، بما في ذلك بروتينات الأميلويد، التي ترتبط بمرض الزهايمر والخرف.",
      "تشير الأبحاث إلى أن تحفيز الموجات الكهربائية البطيئة في الدماغ من خلال التحفيز بالضوء والصوت يمكن أن يعزز عملية التخلص من النفايات، على الرغم من أن معظم الدراسات الحالية تُجرى على الفئران.",
      "يتم أيضًا مناقشة عوامل مثل استهلاك القهوة، وممارسة الرياضة، وأنماط النوم لتأثيرها المحتمل على صحة الدماغ."
    ],
    "points": 244,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1719440509
  },
  {
    "id": 40805010,
    "title": "روبوتات صوتية بزمن استجابة 500 مللي ثانية",
    "originLink": "https://fastvoiceagent.cerebrium.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805010",
    "commentBody": "",
    "originSummary": [
      "بدأت التجارب مع واجهات الصوت والنماذج اللغوية الكبيرة (LLMs) بعد إصدار GPT-4، مما أبرز الطبيعة الجذابة والتحديات الجديدة للتفاعلات الصوتية مع الذكاء الاصطناعي التوليدي.",
      "تحقيق زمن استجابة صوت إلى صوت يبلغ 500 مللي ثانية يعد تحديًا ولكنه ممكن من خلال استضافة النسخ، واستدلال النموذج اللغوي الكبير، وتوليد الصوت معًا، وتحسين توجيه البيانات، وضمان وجود اتصال واي فاي جيد وتخزين مؤقت لذاكرة الفيديو العشوائية (VRAM).",
      "يتوفر عرض توضيحي لروبوت صوتي قادر على الاستجابة في 500 مللي ثانية وحاوية لنشره على وحدات معالجة الرسومات A10/A100/H100، مع إظهار المقاييس الحالية لدورة استجابة إجمالية تبلغ 759 مللي ثانية، مما يشير إلى تطور سريع للذكاء الاصطناعي وإمكانية تبسيطات مستقبلية."
    ],
    "commentSummary": [
      "يمكن للروبوتات الصوتية تحقيق أوقات استجابة تصل إلى 500 مللي ثانية من خلال تحسين عمليات النسخ، واستدلال النماذج اللغوية الكبيرة، وتوليد الصوت، بالإضافة إلى توجيه البيانات بكفاءة وتخزينها المؤقت.",
      "إجمالي زمن الاستجابة من صوت إلى صوت يبلغ 759 مللي ثانية، ولكن من المحتمل أن تقلل النماذج اللغوية الكبيرة المستقبلية ذات القدرات الصوتية الأصلية هذا الوقت.",
      "أبرز المستخدمون أهمية انخفاض زمن الاستجابة في التفاعلات مع الذكاء الاصطناعي، خاصة في خدمة العملاء، وناقشوا التحسينات التقنية المحتملة مثل دعم المتصفح والمعالجة على الجهاز."
    ],
    "points": 241,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1719438663
  },
  {
    "id": 40803783,
    "title": "الجيل القادم من الطباعة المعدنية ثلاثية الأبعاد",
    "originLink": "https://fabric8labs.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40803783",
    "commentBody": "",
    "originSummary": [
      "حصلت شركة Fabric8Labs الناشئة في سان دييغو على تمويل بقيمة 50 مليون دولار في جولة التمويل من الفئة B لتطوير تكنولوجيا التصنيع الإضافي الكهروكيميائي الخاصة بها.",
      "سيدعم التمويل بناء مصنع جديد للطباعة ثلاثية الأبعاد، مما سيزيد بشكل كبير من قوة العمل في الشركة.",
      "تسلط هذه الاستثمارات الضوء على الاهتمام المتزايد وتدفق رأس المال إلى الشركات الناشئة في مجال الطباعة ثلاثية الأبعاد، مدفوعة بالتقنيات التصنيعية المبتكرة."
    ],
    "commentSummary": [
      "تستخدم الطباعة المعدنية ثلاثية الأبعاد من الجيل التالي بواسطة Fabric8Labs طرقًا كيميائية كهربائية للتصنيع الدقيق والسريع والمتنوع، محققة دقة على مستوى الميكرون.",
      "تجمع هذه التقنية بين العمليات الإضافية والطرحية، حيث تودع المعادن النقية وبعض السبائك، مما يجعلها أكثر أمانًا وكفاءة في استهلاك الطاقة من خلال تجنب درجات الحرارة العالية ومساحيق المعادن.",
      "تكنولوجيا شركة Fabric8Labs واعدة لتطبيقات مثل اللوحات الدوائر المطبوعة (PCBs) والهياكل الداخلية المعقدة، وتستكشف الشركة الفرص التجارية بهذا النهج الفريد."
    ],
    "points": 236,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1719430874
  },
  {
    "id": 40807923,
    "title": "إيبلوت: حزمة جديدة لإنشاء الرسوم البيانية في إيمكس",
    "originLink": "https://lars.ingebrigtsen.no/2024/06/26/a-new-package-for-making-charts-in-emacs-eplot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40807923",
    "commentBody": "",
    "originSummary": [
      "تم إصدار حزمة Emacs جديدة تسمى eplot، مصممة لإنشاء رسوم بيانية بسيطة مباشرة داخل Emacs.",
      "يحل eplot المشكلات الموجودة في الأدوات الحالية مثل chart.el وGnuplot، حيث يقدم ميزات مثل أرقام Y-axis منطقية وتدرجات SVG.",
      "الحزمة سهلة الاستخدام، مما يسمح للمستخدمين بإنشاء الرسوم البيانية عن طريق كتابة M-x eplot في المخزن المؤقت الذي يحتوي على أرقام، وهي موثقة على GitHub."
    ],
    "commentSummary": [
      "تم إصدار حزمة جديدة تسمى Eplot لإنشاء الرسوم البيانية في Emacs، وهو محرر نصوص شائع بين المطورين.",
      "حظيت الحزمة بالاهتمام لبساطتها ومرونتها، مع اقتراحات لتحسين تجربة المستخدم من خلال الاستفادة من المتغيرات المحلية للملفات والمجلدات في Emacs.",
      "تسلط المناقشات الضوء على المقارنات مع أدوات الرسم البياني الأخرى مثل Gnuplot وMatplotlib، مشيرة إلى نقاط القوة والضعف لكل منها في سياق Emacs."
    ],
    "points": 216,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1719470024
  },
  {
    "id": 40806930,
    "title": "منذ 6 أشهر، تركت المجمع الصناعي الهرائي",
    "originLink": "https://www.joanwestenberg.com/6-months-ago,-i-left-the-bullshit-industrial-complex",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806930",
    "commentBody": "",
    "originSummary": [
      "يكشف محترف سابق في العلاقات العامة التقنية عن ماضيه في الترويج للشركات الناشئة المبالغ في تقديرها، والتي مولت نمط حياة فاخر لكنها أثارت شكوكًا أخلاقية.",
      "قرروا ترك الصناعة المربحة ولكن المشكوك فيها أخلاقياً للتركيز على الكتابة الصادقة حول التأثير البشري الحقيقي للتكنولوجيا ورأس المال المغامر.",
      "على الرغم من المخاطر المالية والمهنية، يجدون النزاهة والإشباع الشخصي في مسارهم الجديد، رافضين وعود صناعة التكنولوجيا الفارغة."
    ],
    "commentSummary": [
      "يعبر المؤلف عن خيبة أمله من صناعة التكنولوجيا، مشيرًا إلى تحولها من حل المشكلات الإنسانية إلى استخراج القيمة على مدار الـ 25 عامًا الماضية.",
      "تشمل الملاحظات الرئيسية منشورًا على Reddit يدعي أن التسعينيات كانت ذروة الإنسانية واقتباسًا فيروسيًا حول قيام الذكاء الاصطناعي بالأعمال المنزلية بدلاً من العمل الإبداعي، مما يبرز نظرة حنينية للتفاؤل التكنولوجي في الماضي.",
      "على الرغم من المخاوف بشأن استغلال البيانات والدوافع الربحية، لا يزال هناك أمل في المجتمعات مفتوحة المصدر والابتكارات المبتكرة، على الرغم من أن السعي الدؤوب وراء الربح قد أدى إلى انتشار خيبة الأمل."
    ],
    "points": 210,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1719459232
  },
  {
    "id": 40804489,
    "title": "يحق للمبلغين الفيدراليين الحصول على تعويضات عن الأجور المستقبلية المفقودة، وفقًا لحكم المحكمة",
    "originLink": "https://www.govexec.com/pay-benefits/2024/06/federal-whistleblowers-are-entitled-damages-missed-future-pay-court-rules/397638/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40804489",
    "commentBody": "",
    "originSummary": [
      "قضت محكمة الاستئناف الفيدرالية الأمريكية بأن المبلغين الفيدراليين يمكنهم الحصول على تعويضات عن الأرباح المستقبلية المفقودة إذا كان فصلهم من العمل قد أضر بإمكاناتهم في الكسب.",
      "ديبورا بيرليك، التي تم فصلها بعد الإبلاغ عن أموال مفقودة، نجحت في المطالبة بتعويض إضافي يتجاوز الأجر المتأخر، مما أثر على فرصها الوظيفية المستقبلية.",
      "يضع هذا الحكم سابقة للمبلغين الفيدراليين، مما يسمح بالمطالبة بالأرباح المستقبلية المفقودة دون الحاجة إلى ضمان التوظيف المستقبلي، وتم إعادة القضية إلى مجلس حماية نظم الجدارة لاتخاذ قرار نهائي."
    ],
    "commentSummary": [
      "حكمت محكمة بأن المبلغين الفيدراليين يستحقون تعويضات عن الأجور المستقبلية المفقودة، حتى بدون ضمان وظيفة مستقبلية، بشرط وجود أدلة كافية على احتمالية التوظيف في المستقبل.",
      "قد يشجع هذا القرار المزيد من المبلغين عن المخالفات من خلال تخفيف المخاوف بشأن فقدان الأرباح المستقبلية ويتماشى مع حقوق الموظفين الفيدراليين مع حقوق موظفي القطاع الخاص.",
      "تؤكد القضية، التي تتعلق بموظف في إدارة شؤون المحاربين القدامى (VA)، أن الضرر الذي يلحق بالسمعة ويؤثر على الأرباح المستقبلية يمكن تعويضه."
    ],
    "points": 205,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1719435248
  },
  {
    "id": 40808933,
    "title": "دروس أتمنى لو تم تعليمي إياها (1996) [pdf]",
    "originLink": "https://www.ams.org/notices/199701/comm-rota.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808933",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "أثارت مقالة \"الدروس التي كنت أتمنى أن أتعلمها (1996)\" لجان-كارلو روتا نقاشات على موقع Hacker News، حيث شارك المستخدمون وحدات قياس فريدة مثل \"الميكروسنتشري\" (50 دقيقة) و\"النانوأكر\" (4 مليمترات مربعة).",
      "شملت المحادثات أيضًا مدة المحاضرات، وفترات الانتباه، وأهمية المقدمات الجذابة في الأوراق الأكاديمية، مع التأمل في تعاليم روتا المؤثرة.",
      "سلط الموضوع الضوء على اهتمام متكرر برؤى روتا، حيث استرجع المستخدمون تجاربهم الشخصية وأشاروا إلى مناقشات وموارد ذات صلة."
    ],
    "points": 186,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1719482778
  },
  {
    "id": 40808808,
    "title": "عقد محامو مكتب البريد اجتماعًا سريًا مع القاضي لمنع الإفصاح",
    "originLink": "https://www.lawgazette.co.uk/news/post-office-lawyers-held-secret-meeting-with-judge-to-stop-disclosure/5119593.article",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40808808",
    "commentBody": "",
    "originSummary": [
      "عقد محامو مكتب البريد اجتماعًا سريًا مع قاضٍ في عام 2013 لمنع الكشف عن تقرير يكشف عن مشكلات محتملة في نظام هورايزون لمحامي الدفاع في محاكمة جنائية.",
      "سمعت التحقيقات أن المحامي الملاحق مارتن سميث اعترف بأنه لم يلتزم بواجباته وافتقر إلى الخبرة اللازمة، مما أثار مخاوف بشأن الإدانات السابقة وممارسات الإفصاح.",
      "يستمر التحقيق الجاري في كشف العديد من قضايا الإفصاح مع اقتراب مكتب البريد من الوساطة ومراجعات الإدانات السابقة."
    ],
    "commentSummary": [
      "اجتمع محامو مكتب البريد سرًا مع قاضٍ لمنع الكشف عن الأدلة، مما أدى إلى إدانات خاطئة.",
      "المحامون العامون مثقلون بالأعباء، حيث يديرون ما يصل إلى 700 قضية سنويًا، مما يعيق الدفاع الفعال.",
      "النظام القضائي يفضل أولئك الذين يستطيعون تحمل تكاليف المحامين الخاصين، مما يبرز الحاجة إلى إصلاحات قانونية وتمويل أفضل للمحامين العامين لضمان محاكمات عادلة."
    ],
    "points": 182,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1719480716
  },
  {
    "id": 40806356,
    "title": "DoorDash والتحكيم في البيتزا (2020)",
    "originLink": "https://www.readmargins.com/p/doordash-and-pizza-arbitrage",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40806356",
    "commentBody": "",
    "originSummary": [
      "أدرجت دورداش مطعم بيتزا دون إذن المالك، مما أدى إلى مشاكل في توصيل الطلبات باردة وتسعير غير صحيح.",
      "ظهرت فرصة للمراجحة بسبب أخطاء التسعير في Doordash، مما أتاح الربح من الطلب بأسعار منخفضة والبيع بأسعار المطاعم الأعلى.",
      "تنتقد المقالة نموذج عمل توصيل الطعام باعتباره غير فعال واستغلالي، وتقترح أن نهجًا أكثر تكاملًا مثل دومينوز قد يكون أكثر استدامة."
    ],
    "commentSummary": [
      "تواجه شركة DoorDash وخدمات توصيل الطعام المماثلة انتقادات بسبب نماذج الأعمال غير المستدامة التي تعتمد على العمالة منخفضة الأجر وتكاليف اكتساب العملاء المرتفعة.",
      "يجادل النقاد بأن هذه الممارسات تفاقم التفاوت الاقتصادي ويقترحون فرض ضرائب على رأس المال المتراكم لإعادة توزيع الثروة.",
      "تشمل المناقشة مخاوف بشأن التأثير السلبي على جودة المطاعم وأخلاقيات هذه الخدمات التوصيلية، مما يثير تساؤلات حول استدامتها وفوائدها على المدى الطويل."
    ],
    "points": 174,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1719451012
  },
  {
    "id": 40805351,
    "title": "كورسل – استخدم واجهة ووردبريس الخلفية مع لارافيل أو أي تطبيق PHP",
    "originLink": "https://github.com/corcel/corcel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40805351",
    "commentBody": "",
    "originSummary": [
      "كورسل هي مكتبة PHP مبنية على Eloquent ORM من Laravel، تُمكّن من استرجاع البيانات مباشرة من قاعدة بيانات ووردبريس، ويمكن استخدامها مع Laravel أو أي مشروع PHP عبر Composer.",
      "تشمل الميزات الرئيسية دعم الأنواع المخصصة من المنشورات، والرموز القصيرة، والتصنيفات، والصفحات، والمرفقات، والمراجعات، والصور المصغرة، والخيارات، والقوائم، والمستخدمين، والمصادقة.",
      "عملية التثبيت والتكوين سهلة، مع التسجيل التلقائي لإصدارات Laravel 5.5+ والإعداد اليدوي للإصدارات الأقدم أو المشاريع غير التابعة لـ Laravel."
    ],
    "commentSummary": [
      "كورسل يمكّن من استخدام واجهة خلفية ووردبريس مع لارافيل أو أي تطبيق PHP، مما يثبت فعاليته في بيئات الإنتاج.",
      "قام المستخدمون بدمج Corcel بنجاح مع Laravel وFilament وLunarPHP لتحسين الأداء، مثل إنقاذ مواقع WooCommerce البطيئة.",
      "يُشاد بـ Corcel لواجهته السلسة مع بيانات WordPress، حيث يقدم حلاً قابلاً للصيانة لمشاريع PHP التي تحتاج إلى التفاعل مع قواعد بيانات WordPress، ويُقارن بشكل إيجابي مع أدوات مثل Prismic وStrapi وShopify."
    ],
    "points": 147,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1719441239
  }
]
