[
  {
    "id": 40817852,
    "title": "Software-galaksit",
    "originLink": "https://anvaka.github.io/pm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817852",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Ohjelmistogalaksit visualisoivat ohjelmistoprojekteja pisteinä, jotka edustavat kutakin ohjelmaa ja sen monimutkaisuutta, herättäen keskusteluja sen haasteista ja mahdollisista parannuksista.",
      "Käyttäjät keskustelevat visualisoinnin käytännöllisyydestä, ja jotkut ehdottavat sen voivan toimia opetusvälineenä, kun taas toiset muistelevat vastaavia työkaluja.",
      "On kiinnostusta laajentaa mukaan otettavia tietoaineistoja, kuten Linux Kernel tai Java Maven -arkisto, korostaen projektin taiteellista ja teknistä saavutusta."
    ],
    "points": 511,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1719550493
  },
  {
    "id": 40815139,
    "title": "200 ihmistä syytetty 2,7 miljardin dollarin terveydenhuollon petostapauksessa",
    "originLink": "https://apnews.com/article/justice-department-health-care-fraud-garland-24948b951896d0f265c29ba3fcacf858",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815139",
    "commentBody": "",
    "originSummary": [
      "Yhdysvaltain oikeusministeri Merrick Garland ilmoitti syytteistä lähes 200 henkilöä vastaan valtakunnallisessa terveydenhuijauksen vastaisessa iskussa, jossa väärien vaatimusten kokonaismäärä on yli 2,7 miljardia dollaria.",
      "Syytteisiin kuuluu 900 miljoonan dollarin huijaus Arizonassa, jossa kahden haavanhoitoyrityksen omistajan väitetään hyväksyneen yli 330 miljoonan dollarin lahjuksia vilpillisestä Medicare-laskutuksesta, mikä johti potilaiden kuolemiin.",
      "Viranomaiset takavarikoivat yli 230 miljoonan dollarin arvosta omaisuutta ja syyttivät 193 henkilöä, mukaan lukien 76 terveydenhuollon ammattilaista, muista huijauksista, jotka liittyivät tekaistuun riippuvuuden hoitoon alkuperäiskansoille ja väärin merkittyihin HIV-lääkkeisiin Floridassa."
    ],
    "commentSummary": [
      "Viranomaiset ovat syyttäneet 200 henkilöä 2,7 miljardin dollarin terveydenhuollon petosiskussa, mikä korostaa operaation laajuutta ja vakavuutta.",
      "Syytettyjen joukossa Alexandra Gehrke ja Jeffrey King pidätettiin Phoenixin lentokentällä, ja heillä oli hallussaan lainvalvonnan välttelyä käsitteleviä raskauttavia kirjoja, mikä viittaa siihen, että he valmistautuivat pakenemaan.",
      "Tapaus korostaa todisteiden, kuten pakattujen laukkujen ja tietyn kirjallisuuden, merkitystä lentoriskin määrittämisessä ja oikeudellisten päätösten, kuten takuiden ja tuomioiden, vaikuttamisessa."
    ],
    "points": 398,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1719522594
  },
  {
    "id": 40814011,
    "title": "Moderni 8-bittinen suunnittelu, rakennettu 1950-luvun elektroniputkia käyttäen",
    "originLink": "https://www.valve.computer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814011",
    "commentBody": "",
    "originSummary": [
      "Valve.Computer on moderni 8-bittinen tietokone, joka käyttää 1950-luvun elektroniputkia. Se otettiin käyttöön ensimmäisen kerran 28. toukokuuta 2021, ja se on nyt asennettu taideteokseksi.",
      "Se käyttää 1 120 termionista triodia, jotka on konfiguroitu NOR-portteina, muodostaen muistirekisterit, 8-bittisen ALU:n, oskillaattorit ja releajurit, ja se voi suorittaa ohjelmia kuten PONG ja 32-bittinen Fibonaccin lukujono.",
      "Projekti, joka sai inspiraationsa Bletchley Parkista, kesti 18 kuukautta rakentaa ja on ehdolla Turner-palkinnon saajaksi, korostaen sen taiteellisia ja teknisiä ansioita."
    ],
    "commentSummary": [
      "Moderni 8-bittinen tietokone, joka on rakennettu 1950-luvun elektroniputkia käyttäen, on herättänyt merkittävää kiinnostusta ja keskustelua tekniikan harrastajien keskuudessa.",
      "Käyttäjät jakoivat tarinoita vanhasta laitteistosta, kylmä- ja lämminbuuttien eroista sekä termionisten venttiilien monimutkaisuudesta, tuoden esiin sekä haasteet että omistautumisen, joita niihin liittyy.",
      "Projektia kiiteltiin sen luovuudesta, nostalgian herättämisestä ja tukevien kumppaneiden merkityksen korostamisesta omien intohimojen tavoittelussa."
    ],
    "points": 388,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719515890
  },
  {
    "id": 40820949,
    "title": "Korkein oikeus kumoaa 40 vuotta vanhan \"Chevron deference\" -opin",
    "originLink": "https://www.axios.com/2024/06/28/supreme-court-chevron-doctrine-ruling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820949",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Korkein oikeus on kumonnut \"Chevron deference\" -opin, päättäen 40 vuotta kestäneen ennakkotapauksen, joka salli liittovaltion virastojen tulkita epäselviä lakeja.",
      "Kriitikot väittävät, että tämä päätös saattaa johtaa epävakauteen, sillä tuomioistuimet tulkitsevat nyt epäselviä lakeja, mikä saattaa lisätä kongressin lainsäädäntötyötä ja vaikuttaa sääntelyn vakauteen.",
      "Ratkaisua pidetään merkittävänä muutoksena hallituksen haarojen välisessä valtasuhteessa, ja tuomari Kagan oli eri mieltä, että virastot ovat paremmin soveltuvia lakien tulkitsemiseen asiantuntemuksensa vuoksi."
    ],
    "points": 303,
    "commentCount": 656,
    "retryCount": 0,
    "time": 1719585072
  },
  {
    "id": 40816158,
    "title": "Infrastruktuurin asennus ja avoimen lähdekoodin skriptit 70B-mallin kouluttamiseen paljaalta metallilta",
    "originLink": "https://imbue.com/research/70b-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40816158",
    "commentBody": "",
    "originSummary": [
      "Pieni tiimi koulutti onnistuneesti 70 miljardin parametrin mallin infrastruktuurillaan, ylittäen zero-shot GPT-4:n päättelytehtävissä.",
      "Järjestelyyn kuului 4 092 H100 GPU:ta 511 tietokoneessa, jotka oli yhdistetty kolmitasoisen InfiniBand-verkon kautta, sisältäen yksityiskohtaisen provisioinnin, diagnostiikan ja automatisoidut terveystarkastukset.",
      "He jakavat kattavan oppaan ja skriptit vastaavan infrastruktuurin pystyttämiseen, painottaen toistettavuutta, automaatiota ja perusteellista testausta, ja ovat avoimia palkkaamaan."
    ],
    "commentSummary": [
      "Pieni tiimi koulutti onnistuneesti 70 miljardin parametrin mallin alusta alkaen, ja se suoriutui paremmin kuin nollashotti GPT-4 päättelytehtävissä.",
      "He käyttivät huippusuorituskykyistä klusteria, jossa oli yli 12 000 yhteyttä, varmistaen kaikkien komponenttien saumattoman toiminnan.",
      "Tiimi jakaa avoimen lähdekoodin skriptejä ja oppaan infrastruktuurin asennukseen osana kolmiosaista työkalupakettia, johon sisältyy myös osiot arvioinneista ja hyperparametrien optimoinnista."
    ],
    "points": 247,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1719529720
  },
  {
    "id": 40815130,
    "title": "Python kamppailee Applen App Storen hylkäysten kanssa",
    "originLink": "https://lwn.net/SubscriberLink/979671/4fb7c1827536d1ae/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815130",
    "commentBody": "",
    "originSummary": [
      "Päivitys Python 3.11:stä 3.12:een aiheutti joidenkin Python-sovellusten hylkäämisen Applen sovelluskaupoissa, koska urllib-parserissa oli merkkijono \"itms-services\", joka on kielletty hiekkalaatikossa olevissa sovelluksissa macOS:ssä.",
      "Eric Froemlingin virheraportti johti keskusteluun Python-kehittäjien keskuudessa siitä, miten sovelluskaupan tarkistusprosesseja voitaisiin huomioida, harkiten ratkaisuja kuten obfuskaatiota ja jakelutason paikkauksia.",
      "Yksimielisyys saavutettiin lisätä rakennusaikainen vaihtoehto nimeltä \"--with-app-store-compliance\" Python 3.13:een, joka poistaisi ongelmallisen koodin sovelluskauppaan lähettämistä varten, korostaen ilmaisohjelmistoprojektien kohtaamia haasteita läpinäkymättömien tarkastusprosessien kanssa."
    ],
    "commentSummary": [
      "Python-sovelluksia hylätään Apple App Storesta niiden binääreissä olevan \"itms-services\" URL-skeeman vuoksi, ja Windows Defender merkitsee nämä sovellukset myös haitallisiksi, kun ne on rakennettu PyInstallerilla.",
      "Kehittäjät väittävät, että suuret käyttöjärjestelmäalustat haittaavat pieniä kehittäjiä vaatimalla kalliita koodin allekirjoitussertifikaatteja, mikä tekee sovellusten jakelusta haastavaa.",
      "Vaihtoehtoina ehdotetaan Homebrew'n käyttöä Mac-sovelluksille tai SignPathin ilmaisia sertifikaatteja Windows-rakennelmille, mikä korostaa laajempaa ongelmaa sovellusten jakeluun liittyvissä turvallisuuteen liittyvissä hylkäyksissä."
    ],
    "points": 238,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1719522551
  },
  {
    "id": 40818422,
    "title": "Frame.work-kannettava on nyt saatavilla Tanskassa, Suomessa ja Ruotsissa",
    "originLink": "https://community.frame.work/t/now-available-in-denmark-finland-and-sweden/53690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818422",
    "commentBody": "",
    "originSummary": [
      "DestroyaFramework on ilmoittanut, että heidän tuotteensa, mukaan lukien Framework Laptop 13 ja 16, ovat nyt saatavilla toimitettavaksi Tanskaan, Suomeen ja Ruotsiin.",
      "Uusi Framework Laptop 13, jossa on Intel Core Ultra Series 1 -prosessorit, on saatavilla ennakkotilaukseen, yhdessä tanskalaisten ja ruotsalais-suomalaisten näppäimistöjen kanssa.",
      "Näppäimistöt Framework Laptop 16:lle ovat saatavilla heinäkuun lopulla, ja varastopäivityksistä voi tilata sähköposti-ilmoituksia tuotesivulta."
    ],
    "commentSummary": [
      "Frame.work-kannettava on nyt saatavilla Tanskassa, Suomessa ja Ruotsissa, ja siinä on oikeat tanskalaiset näppäimistöt, mikä vastaa kritiikkiin pohjoismaisten näppäimistöasettelujen soveltuvuudesta koodaamiseen.",
      "Frameworkin modulaarinen suunnittelu mahdollistaa helpon päivityksen ja korjauksen, korostaen korjattavuutta ja ympäristöhyötyjä, vaikka jotkut käyttäjät huomauttavatkin ongelmista akun keston ja webkameran laadun suhteen.",
      "Laajentuminen Norjaan on monimutkaista sen EU:n ulkopuolisen aseman vuoksi, mikä vaikuttaa kustannuksiin ja logistiikkaan."
    ],
    "points": 205,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1719558557
  },
  {
    "id": 40814728,
    "title": "FCC:n sääntö velvoittaisi operaattorit avaamaan kaikki puhelimet 60 päivän jälkeen",
    "originLink": "https://techcrunch.com/2024/06/27/fcc-rule-would-make-carriers-unlock-all-phones-after-60-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814728",
    "commentBody": "",
    "originSummary": [
      "FCC ehdottaa sääntöä, joka vaatii operaattoreita avaamaan puhelimet 60 päivää oston jälkeen kuluttajien prosessin yksinkertaistamiseksi.",
      "FCC:n puheenjohtaja Jessica Rosenworcel ilmoitti ehdotetun sääntöjen laatimista koskevan ilmoituksen (NPRM) selkeiden, koko maan kattavien lukituksen avaamista koskevien sääntöjen laatimiseksi, ja yleisön palaute on tervetullutta 18. heinäkuuta alkaen.",
      "Säännön tavoitteena on tarjota johdonmukaisuutta ja läpinäkyvyyttä, mikä helpottaa kuluttajien operaattorin vaihtamista."
    ],
    "commentSummary": [
      "FCC on ehdottanut sääntöä, joka velvoittaa operaattorit avaamaan puhelimet 60 päivän jälkeen, tavoitteena vähentää elektroniikkajätettä ja helpottaa operaattoreiden välistä vaihtamista.",
      "Yhdysvallat erottuu siinä, että siellä on operaattorilukittuja puhelimia, mikä antaa operaattoreille merkittävää valtaa puhelimen ominaisuuksien ja päivitysten suhteen, toisin kuin Euroopassa, jossa puhelimet voidaan lukita etänä maksamattomuuden vuoksi.",
      "Ehdotus on herättänyt keskustelua, sillä jotkut pitävät operaattorilukituksia kuluttajavastaisina, kun taas toiset väittävät niiden auttavan rahoittamaan puhelimia henkilöille, joilla on huono luottokelpoisuus."
    ],
    "points": 172,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719520021
  },
  {
    "id": 40815097,
    "title": "RStudion tekijä julkaisee uuden R- ja Python-IDE:n",
    "originLink": "https://www.infoworld.com/article/3715702/maker-of-rstudio-launches-new-r-and-python-ide.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815097",
    "commentBody": "",
    "originSummary": [
      "Posit, aiemmin tunnettu nimellä RStudio, on julkaissut beta-version Positronista, uudesta R- ja Python-ohjelmointikielille tarkoitetusta integroidusta kehitysympäristöstä (IDE), joka perustuu Visual Studio Codeen.",
      "Positron on saatavilla macOS-, Windows- ja Linux-käyttöjärjestelmille, ja se on suunniteltu käyttäjäystävälliseksi sisäänrakennetulla tuella R:lle ja Pythonille, mikä poistaa lisälaajennusten tarpeen.",
      "IDE sisältää data- ja muuttujatutkijan helppoa datan käsittelyä varten ja tukee muita VS Code -laajennuksia OpenVSX-rekisterin kautta, vaikka se onkin vielä varhaisessa kehitysvaiheessa."
    ],
    "commentSummary": [
      "RStudion tekijä on julkaissut uuden integroidun kehitysympäristön (IDE) nimeltä Positron, joka tukee sekä R- että Python-kieliä.",
      "Uudesta julkaisusta huolimatta RStudion kehittäminen ja ylläpito jatkuu, ja jotkin R-spesifiset ominaisuudet pysyvät yksinomaan siinä.",
      "Positron pyrkii kuromaan umpeen R:n ja Pythonin välisen kuilun tarjoamalla yhtenäisen ympäristön data-analyysille ja pakettien kehittämiselle."
    ],
    "points": 171,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719522351
  },
  {
    "id": 40817079,
    "title": "NYC:n ruuhkamaksujen kuolema",
    "originLink": "https://www.apricitas.io/p/the-death-of-nyc-congestion-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817079",
    "commentBody": "",
    "originSummary": [
      "Kuvernööri Kathy Hochul ilmoitti toistaiseksi voimassa olevasta tauosta New Yorkin ruuhkamaksujärjestelmässä, jonka tarkoituksena oli veloittaa ajoneuvoilta, jotka saapuvat Ala-Manhattaniin, rahoittaakseen liikenneprojekteja.",
      "Peruutus, joka johtuu esikaupunkien autoilijoiden vastustuksesta ja huolista MTA:n kulutustehokkuudesta, vaarantaa keskeiset infrastruktuurihankkeet ja rahoituksen.",
      "Tämä päätös korostaa laajempia ongelmia Yhdysvaltain kaupungeissa ja infrastruktuurissa, tuoden esiin tehottomuudet, korkeat kustannukset ja paikallisen vastustuksen joukkoliikenneinvestoinneissa."
    ],
    "commentSummary": [
      "New Yorkin ruuhkamaksusuunnitelma, jonka tarkoituksena on vähentää liikennettä ja rahoittaa julkista liikennettä, on pysähtynyt osavaltion politiikan vuoksi.",
      "Kriitikot mainitsevat MTA:n huonon hallinnoinnin ja korkeat kustannukset syinä lisärahoitusta vastaan, kun taas kannattajat väittävät sen voivan parantaa liikenteen sujuvuutta ja julkista liikennettä.",
      "Keskustelu korostaa laajempia kaupunkisuunnittelun ja julkisen politiikan kysymyksiä, tasapainottaen mukavuuden ja kestävyyden välillä."
    ],
    "points": 159,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1719540106
  },
  {
    "id": 40819784,
    "title": "Onko kirkkaan ilman turbulenssi yleistymässä?",
    "originLink": "https://www.flightradar24.com/blog/is-cat-more-common/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Selkeän ilman turbulenssitapaukset (CAT) eivät näytä trendiä onnettomuustilastoissa, sillä NTSB raportoi vain merkittävät tapaukset.",
      "Tekijät, kuten ilmastonmuutos ja lisääntynyt lentomatkustus, voivat myötävaikuttaa CAT:n (selkeän ilman turbulenssin) yleistymiseen, mutta uudemmat lentokoneet, joissa on edistyneitä sensoreita ja lentäjien raportointi, tekevät sen tarkasta mittaamisesta vaikeaa.",
      "Suihkuvirran käyttäytyminen, johon ilmastonmuutos vaikuttaa, vaikuttaa myös selkeän ilman turbulenssin (CAT) esiintymistiheyteen, mutta nykyaikaiset lentokoneet on suunniteltu kestämään turbulenssia, ja lentäjät on koulutettu hallitsemaan sitä."
    ],
    "points": 147,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719576296
  },
  {
    "id": 40818809,
    "title": "Mikä on paras koodipohja, jonka parissa olet koskaan työskennellyt?",
    "originLink": "https://news.ycombinator.com/item?id=40818809",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Googlen monorepoa ylistetään sen erinomaisista työkaluista, joihin kuuluu välitön muokattavien tilannekuvien luominen ja täydellisesti toistettavat rakennelmat klustereissa.",
      "Ominaisuudet kuten välitön koodihaku, nopea syyllisen etsintä ja symbolien haku sekä laajat ennakkotarkistukset takaavat korkean tuottavuuden ja yhtenäisen koodi/testilaadun.",
      "Ympäristö ylläpitää johdonmukaista tyyliä kulttuurin, automaattisten linttereiden ja pakollisten koodikatselmointien avulla, mikä tekee siitä erottuvan kokemuksen kehittäjille."
    ],
    "points": 134,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719564044
  },
  {
    "id": 40820063,
    "title": "Uusia tapoja havaita gravitaatioaaltoja",
    "originLink": "https://www.nature.com/articles/d41586-024-02003-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820063",
    "commentBody": "",
    "originSummary": [
      "Ensimmäinen suora gravitaatioaaltojen havaitseminen vuonna 2015 LIGO- ja Virgo-observatorioiden toimesta mullisti fysiikan, mahdollistaen tähtitieteilijöiden 'kuulla' kosmisia tapahtumia.",
      "Nykyiset ilmaisimet ovat rajoitettuja taajuuksille 100–1 000 Hz välillä, mutta uudet instrumentit ja tekniikat pyrkivät havaitsemaan laajemman alueen, megahertsistä nanohertsiin.",
      "Viisi uutta menetelmää ovat Pulsarien ajoitusryhmät, mikroaaltoteleskoopit, atomien interferometria, pöytätunnistimet ja kvanttikiteet, joista kukin kohdistuu eri taajuusalueisiin ja lupaa paljastaa lisää kosmisia ilmiöitä."
    ],
    "commentSummary": [
      "Ensimmäisen sukupolven gravitaatioaaltodetektorit eivät onnistuneet havaitsemaan aaltoja, mikä kumosi Weberin vuoden 1987 väitteen, mutta nykyiset interferometrit kuten LIGO, Virgo ja KAGRA ovat onnistuneesti havainneet niitä.",
      "Gravitaatioaallot vahvistavat Einsteinin yleisen suhteellisuusteorian, mutta kvanttigravitaation teoria on edelleen ratkaisematta, ja sekä säieteoria että silmukkakvanttigravitaatio tarjoavat mahdollisia mutta haastavia selityksiä.",
      "Tulevat projektit, kuten LISA, pyrkivät parantamaan havaitsemiskykyjä, ja LIGO-laitosten julkiset kierrokset ovat saatavilla opetustarkoituksiin."
    ],
    "points": 132,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1719578482
  },
  {
    "id": 40818987,
    "title": "Parkinsonin yhteys suolistobakteereihin viittaa odottamattomaan, yksinkertaiseen hoitoon",
    "originLink": "https://www.sciencealert.com/parkinsons-link-to-gut-bacteria-suggests-unexpected-simple-treatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818987",
    "commentBody": "",
    "originSummary": [
      "Tutkijat ovat tunnistaneet tiettyjä suolistomikrobeja, jotka liittyvät riboflaviinin (B2-vitamiini) ja biotiinin (B7-vitamiini) vähentyneisiin tasoihin Parkinsonin tautia sairastavilla potilailla, mikä viittaa B-vitamiinilisän mahdolliseen hoitokeinoon.",
      "Tutkimus, jota johti Hiroshi Nishiwaki Nagoyan yliopistosta, havaitsi, että suolistobakteerien muutokset vaikuttivat lyhytketjuisten rasvahappojen (SCFA) ja polyamiinien tuotantoon, jotka ovat tärkeitä terveelle suoliston limakerrokselle.",
      "Löydökset, jotka on julkaistu npj Parkinson's Disease -lehdessä, viittaavat siihen, että terveellisen suolistomikrobiston ylläpitäminen ja ympäristömyrkkyjen vähentäminen voivat auttaa suojaamaan Parkinsonin oireilta."
    ],
    "commentSummary": [
      "Tutkimus viittaa yhteyteen suolistobakteerien ja Parkinsonin taudin välillä, mikä osoittaa, että tietyt bakteerikannat saattavat myötävaikuttaa sairauteen.",
      "Keskusteluja on syntynyt mahdollisista hyödyistä, joita riboflaviinin (B2) ja biotiinin (B7) kaltaisten vitamiinien lisäravinteiden käytöllä voi olla oireiden lievittämisessä.",
      "Tutkimus korostaa suoliston terveyden merkitystä neurologisissa sairauksissa, mutta kehottaa tekemään lisää tutkimusta ja huomauttaa, että nykyisiä hoitoja ei pidä unohtaa."
    ],
    "points": 127,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1719566635
  },
  {
    "id": 40819617,
    "title": "Rhisotope-projekti: Radioisotooppien asettaminen eläviin sarvikuonoihin",
    "originLink": "https://www.wits.ac.za/news/latest-news/general-news/2024/2024-06/a-novel-way-to-save-rhinos-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819617",
    "commentBody": "",
    "originSummary": [
      "Rhisotope-projekti Witsin yliopistossa on alkanut lisätä pieniä annoksia radioisotooppeja sarvikuonojen sarviin auttaakseen salakuljetettujen sarvien havaitsemisessa kansainvälisillä rajoilla.",
      "Tätä innovatiivista lähestymistapaa, jota seurataan kuuden kuukauden ajan, pyritään estämään salametsästystä tekemällä sarvikuonojen sarvista havaittavia ja vähemmän arvokkaita mustassa pörssissä.",
      "Hanke hyödyntää globaalia ydinturvallisuusinfrastruktuuria ja keskittyy koulutukseen ja sosiaaliseen kohottamiseen, erityisesti naisten ja tyttöjen voimaannuttamiseen maaseutuyhteisöissä."
    ],
    "commentSummary": [
      "Rhisotope-projektin tavoitteena on estää sarvikuonojen salametsästystä asettamalla radioisotooppeja niiden sarviin, jolloin ne voidaan havaita rajoilla.",
      "Kriitikot väittävät menetelmän olevan tehoton hitaan injektioprosessin ja heikon norsunluun vastaisten lakien täytäntöönpanon vuoksi, ehdottaen vaihtoehtoja kuten värjäystä, toksiinien infuusiota tai laboratoriossa kasvatettua keratiinia.",
      "Projekti on tällä hetkellä konseptin todentamisvaiheessa, ja käynnissä on tutkimusta sen toteutettavuuden ja turvallisuuden arvioimiseksi."
    ],
    "points": 116,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719574534
  }
]
