[
  {
    "id": 40817852,
    "title": "مجرات البرمجيات",
    "originLink": "https://anvaka.github.io/pm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817852",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تقوم Software Galaxies بتصور المشاريع البرمجية كنقاط، تمثل كل برنامج وتعقيداته، مما يثير النقاشات حول تحدياته والتحسينات المحتملة.",
      "يناقش المستخدمون مدى عملية التصور، حيث يقترح البعض أنه يمكن أن يكون أداة تعليمية بينما يسترجع آخرون ذكرياتهم عن أدوات مشابهة.",
      "هناك اهتمام بتوسيع مجموعات البيانات المدرجة، مثل نواة لينكس أو مستودع جافا مافن، مما يبرز الإنجاز الفني والتقني للمشروع."
    ],
    "points": 511,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1719550493
  },
  {
    "id": 40815139,
    "title": "اتهام 200 شخص في حملة قمع احتيال في الرعاية الصحية بقيمة 2.7 مليار دولار",
    "originLink": "https://apnews.com/article/justice-department-health-care-fraud-garland-24948b951896d0f265c29ba3fcacf858",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815139",
    "commentBody": "",
    "originSummary": [
      "أعلن المدعي العام الأمريكي ميريك غارلاند عن توجيه اتهامات ضد ما يقرب من 200 فرد في حملة وطنية لمكافحة الاحتيال في الرعاية الصحية، حيث بلغت قيمة المطالبات الزائفة أكثر من 2.7 مليار دولار.",
      "تشمل التهم مخططًا بقيمة 900 مليون دولار في أريزونا، حيث يُزعم أن مالكي شركتين لرعاية الجروح قبلا أكثر من 330 مليون دولار كرشاوى مقابل فواتير احتيالية لميديكير، مما أدى إلى وفاة مرضى.",
      "صادرت السلطات أكثر من 230 مليون دولار من الأصول ووجهت اتهامات لـ 193 فردًا، بما في ذلك 76 من المهنيين الطبيين، بتورطهم في مخططات أخرى تتعلق بعلاج الإدمان الوهمي للأمريكيين الأصليين وأدوية فيروس نقص المناعة البشرية المزيفة في فلوريدا."
    ],
    "commentSummary": [
      "وجهت السلطات اتهامات إلى 200 شخص في حملة لمكافحة الاحتيال في مجال الرعاية الصحية بقيمة 2.7 مليار دولار، مما يبرز حجم وخطورة العملية.",
      "من بين المتهمين، تم القبض على ألكسندرا جيرك وجيفري كينغ في مطار فينيكس ومعهما كتب تدينهما حول كيفية التهرب من تطبيق القانون، مما يشير إلى أنهما كانا يستعدان للفرار.",
      "تؤكد القضية على أهمية الأدلة مثل الحقائب المعبأة والأدبيات المحددة في تحديد مخاطر الهروب وتأثيرها على القرارات القضائية بشأن الكفالة والحكم."
    ],
    "points": 398,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1719522594
  },
  {
    "id": 40814011,
    "title": "تصميم حديث بثماني بتات، مبني باستخدام صمامات حرارية من خمسينيات القرن الماضي",
    "originLink": "https://www.valve.computer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814011",
    "commentBody": "",
    "originSummary": [
      "الكمبيوتر Valve.Computer هو كمبيوتر حديث بثمانية بت يستخدم صمامات حرارية من خمسينيات القرن الماضي، وقد بدأ تشغيله لأول مرة في 28 مايو 2021، وهو الآن مثبت كتركيب فني.",
      "يستخدم 1,120 صمامًا ثلاثيًا حراريًا مكونًا كبوابات NOR، لتشكيل سجلات الذاكرة، ووحدة الحساب والمنطق 8-بت، والمذبذبات، ومحركات الترحيل، ويمكنه تشغيل برامج مثل PONG ومتتالية فيبوناتشي 32-بت.",
      "استغرق بناء المشروع، المستوحى من بلتشلي بارك، 18 شهرًا وتم تقديمه لجائزة تيرنر، مما يبرز مزاياه الفنية والتقنية."
    ],
    "commentSummary": [
      "جهاز كمبيوتر حديث بثماني بتات تم بناؤه باستخدام صمامات حرارية من خمسينيات القرن الماضي قد أثار اهتمامًا كبيرًا ونقاشًا بين عشاق التكنولوجيا.",
      "شارك المستخدمون قصصًا عن الأجهزة القديمة، والفروقات بين التشغيل البارد والدافئ، وتعقيدات الصمامات الحرارية، مما أبرز التحديات والتفاني المتضمن.",
      "تم الإشادة بالمشروع لإبداعه، حيث أثار الحنين وأكد على أهمية الشركاء الداعمين في متابعة الشغف."
    ],
    "points": 388,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719515890
  },
  {
    "id": 40820949,
    "title": "المحكمة العليا تلغي مبدأ \"تشيفرون ديفرنس\" الذي استمر لمدة 40 عامًا",
    "originLink": "https://www.axios.com/2024/06/28/supreme-court-chevron-doctrine-ruling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820949",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ألغت المحكمة العليا مبدأ \"التقدير التشريعي\" المعروف بـ \"Chevron deference\"، منهية بذلك سابقة استمرت لمدة 40 عامًا كانت تسمح للوكالات الفيدرالية بتفسير القوانين الغامضة.",
      "يجادل النقاد بأن هذا القرار قد يؤدي إلى عدم الاستقرار، حيث ستقوم المحاكم الآن بتفسير القوانين الغامضة، مما قد يزيد من عبء العمل التشريعي على الكونغرس ويؤثر على استقرار اللوائح.",
      "يُنظر إلى الحكم على أنه تغيير كبير في توازن القوى بين فروع الحكومة، حيث اعترضت القاضية كاجان على أن الوكالات أكثر تأهيلاً لتفسير القوانين بسبب خبرتها."
    ],
    "points": 303,
    "commentCount": 656,
    "retryCount": 0,
    "time": 1719585072
  },
  {
    "id": 40816158,
    "title": "إعداد البنية التحتية والبرمجيات مفتوحة المصدر لتدريب نموذج 70B من الصفر",
    "originLink": "https://imbue.com/research/70b-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40816158",
    "commentBody": "",
    "originSummary": [
      "نجح فريق صغير في تدريب نموذج يحتوي على 70 مليار معلمة على بنيتهم التحتية، متفوقًا على نموذج GPT-4 في مهام الاستدلال بدون تدريب مسبق.",
      "تضمنت الإعدادات 4,092 وحدة معالجة رسومات H100 موزعة على 511 جهاز كمبيوتر، متصلة عبر شبكة InfiniBand ثلاثية المستويات، مع توفير تفصيلي، وتشخيصات، وفحوصات صحية آلية.",
      "إنهم يشاركون دليلًا شاملاً ونصوصًا لإعداد بنية تحتية مماثلة، مع التركيز على القابلية للتكرار، والأتمتة، والاختبار الشامل، وهم منفتحون على التوظيف."
    ],
    "commentSummary": [
      "نجح فريق صغير في تدريب نموذج يحتوي على 70 مليار معلمة من الصفر، متفوقًا على نموذج GPT-4 في مهام الاستدلال بدون تدريب مسبق.",
      "استخدموا عنقودًا عالي الأداء يحتوي على أكثر من 12,000 اتصال، مما يضمن تشغيلًا سلسًا لجميع المكونات.",
      "يشارك الفريق نصوصًا مفتوحة المصدر ودليلًا لإعداد البنية التحتية كجزء من مجموعة أدوات مكونة من ثلاثة أجزاء، والتي تتضمن أيضًا أقسامًا عن التقييمات وتحسين المعاملات الفائقة."
    ],
    "points": 247,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1719529720
  },
  {
    "id": 40815130,
    "title": "بايثون تواجه رفض متجر تطبيقات آبل",
    "originLink": "https://lwn.net/SubscriberLink/979671/4fb7c1827536d1ae/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815130",
    "commentBody": "",
    "originSummary": [
      "أدى الترقية من بايثون 3.11 إلى 3.12 إلى رفض بعض تطبيقات بايثون من قبل متاجر تطبيقات آبل بسبب وجود السلسلة النصية \"itms-services\" في محلل urllib، وهو ما يُحظر في التطبيقات المعزولة على نظام macOS.",
      "أدى تقرير الأخطاء الذي قدمه إريك فروملينغ إلى مناقشة بين مطوري بايثون حول كيفية التكيف مع عمليات مراجعة متجر التطبيقات، مع الأخذ في الاعتبار حلولًا مثل التشويش والتصحيح على مستوى التوزيع.",
      "تم التوصل إلى توافق لإضافة خيار وقت البناء يسمى \"--with-app-store-compliance\" لبايثون 3.13، والذي سيزيل الشيفرة الإشكالية لتقديم التطبيقات في متاجر التطبيقات، مما يسلط الضوء على التحديات التي تواجهها مشاريع البرمجيات الحرة مع عمليات المراجعة غير الشفافة."
    ],
    "commentSummary": [
      "يتم رفض تطبيقات بايثون من متجر تطبيقات آبل بسبب مخطط URL \"itms-services\" في ملفاتها الثنائية، كما يقوم Windows Defender بوضع علامة على هذه التطبيقات عند بنائها باستخدام PyInstaller.",
      "يجادل المطورون بأن منصات أنظمة التشغيل الرئيسية تعيق المطورين الصغار من خلال اشتراط شهادات توقيع الكود المكلفة، مما يجعل توزيع التطبيقات تحديًا.",
      "تشمل البدائل المقترحة استخدام Homebrew لتطبيقات Mac أو الشهادات المجانية من SignPath لبناءات Windows، مما يسلط الضوء على القضية الأوسع المتعلقة بالرفض المرتبط بالأمان في توزيع التطبيقات."
    ],
    "points": 238,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1719522551
  },
  {
    "id": 40818422,
    "title": "الكمبيوتر المحمول Frame.work متاح الآن في الدنمارك وفنلندا والسويد",
    "originLink": "https://community.frame.work/t/now-available-in-denmark-finland-and-sweden/53690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818422",
    "commentBody": "",
    "originSummary": [
      "أعلنت DestroyaFramework أن منتجاتها، بما في ذلك الحاسوب المحمول Framework 13 و16، أصبحت متاحة الآن للشحن إلى الدنمارك وفنلندا والسويد.",
      "يتوفر الآن الحجز المسبق لجهاز Framework Laptop 13 الجديد المزود بمعالجات Intel Core Ultra Series 1، بالإضافة إلى لوحات المفاتيح الدنماركية والسويدية/الفنلندية.",
      "ستتوفر لوحات المفاتيح لجهاز Framework Laptop 16 في أواخر يوليو، مع توفر تنبيهات عبر البريد الإلكتروني لتحديثات المخزون على صفحة المنتج."
    ],
    "commentSummary": [
      "أصبح الآن حاسوب Frame.work متاحًا في الدنمارك وفنلندا والسويد، ويتميز بلوحات مفاتيح دنماركية مناسبة، مما يعالج الانتقادات الموجهة لتصميمات لوحات المفاتيح النوردية المستخدمة في البرمجة.",
      "يتيح التصميم المعياري لإطار العمل ترقيات وإصلاحات سهلة، مما يبرز قابلية الإصلاح والفوائد البيئية، على الرغم من أن بعض المستخدمين يشيرون إلى مشاكل في عمر البطارية وجودة الكاميرا.",
      "التوسع إلى النرويج معقد بسبب وضعها خارج الاتحاد الأوروبي، مما يؤثر على التكاليف واللوجستيات."
    ],
    "points": 205,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1719558557
  },
  {
    "id": 40814728,
    "title": "قاعدة لجنة الاتصالات الفيدرالية ستجبر شركات الاتصالات على فتح جميع الهواتف بعد 60 يومًا",
    "originLink": "https://techcrunch.com/2024/06/27/fcc-rule-would-make-carriers-unlock-all-phones-after-60-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814728",
    "commentBody": "",
    "originSummary": [
      "تقترح لجنة الاتصالات الفيدرالية قاعدة تلزم شركات الاتصالات بفتح الهواتف بعد 60 يومًا من الشراء لتبسيط العملية للمستهلكين.",
      "أعلنت رئيسة لجنة الاتصالات الفيدرالية جيسيكا روزنوورسيل عن إشعار بوضع قواعد مقترحة (NPRM) لتحديد قواعد فتح الأجهزة بشكل واضح على مستوى البلاد، مع دعوة الجمهور لتقديم ملاحظاتهم بدءًا من 18 يوليو.",
      "تهدف القاعدة إلى توفير الاتساق والشفافية، مما يسهل على المستهلكين تغيير شركات الاتصالات."
    ],
    "commentSummary": [
      "اقترحت لجنة الاتصالات الفيدرالية (FCC) قاعدة تلزم شركات الاتصالات بفتح قفل الهواتف بعد 60 يومًا، بهدف تقليل النفايات الإلكترونية وتسهيل الانتقال بين شركات الاتصالات.",
      "تتميز الولايات المتحدة بوجود هواتف مقفلة من قبل شركات الاتصالات، مما يمنح هذه الشركات سيطرة كبيرة على ميزات الهواتف وتحديثاتها، على عكس أوروبا حيث يمكن قفل الهواتف عن بُعد في حالة عدم السداد.",
      "أثار الاقتراح جدلاً، حيث يرى البعض أن قفل الهواتف من قبل شركات الاتصالات يعد ضد مصلحة المستهلك، بينما يجادل آخرون بأنه يساعد في تمويل الهواتف للأفراد ذوي الائتمان الضعيف."
    ],
    "points": 172,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719520021
  },
  {
    "id": 40815097,
    "title": "مُصنِّع RStudio يطلق بيئة تطوير متكاملة جديدة لـ R وPython",
    "originLink": "https://www.infoworld.com/article/3715702/maker-of-rstudio-launches-new-r-and-python-ide.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815097",
    "commentBody": "",
    "originSummary": [
      "أصدرت شركة بوزيت، المعروفة سابقًا باسم RStudio، نسخة تجريبية من بوزيترون، وهو بيئة تطوير متكاملة (IDE) جديدة للغات البرمجة R وPython، مبنية على Visual Studio Code.",
      "يتوفر بوزيترون لأنظمة macOS وWindows وLinux، وهو مصمم ليكون سهل الاستخدام مع دعم مدمج للغات R وPython، مما يلغي الحاجة إلى إضافات إضافية.",
      "تتضمن بيئة التطوير المتكاملة مستكشفًا للبيانات والمتغيرات لتسهيل التعامل مع البيانات وتدعم إضافات VS Code الأخرى عبر سجل OpenVSX، على الرغم من أنها لا تزال في مراحل التطوير المبكرة."
    ],
    "commentSummary": [
      "أطلقت الشركة المصنعة لـ RStudio بيئة تطوير متكاملة (IDE) جديدة تسمى Positron، والتي تدعم كل من R و Python.",
      "على الرغم من الإصدار الجديد، سيستمر تطوير وصيانة RStudio، مع بقاء بعض الميزات الخاصة بـ R حصرية له.",
      "تسعى بوزيترون إلى سد الفجوة بين R وPython، من خلال تقديم بيئة موحدة لتحليل البيانات وتطوير الحزم."
    ],
    "points": 171,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719522351
  },
  {
    "id": 40817079,
    "title": "موت تسعير الازدحام في مدينة نيويورك",
    "originLink": "https://www.apricitas.io/p/the-death-of-nyc-congestion-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817079",
    "commentBody": "",
    "originSummary": [
      "أعلنت الحاكمة كاثي هوشول عن وقف مؤقت غير محدد لخطة تسعير الازدحام في مدينة نيويورك، والتي كانت تهدف إلى فرض رسوم على المركبات التي تدخل منطقة مانهاتن السفلى لتمويل مشاريع النقل.",
      "الإلغاء، الذي دفعته معارضة السائقين في الضواحي والمخاوف بشأن كفاءة إنفاق هيئة النقل الحضرية، يهدد مشاريع البنية التحتية الرئيسية والتمويل.",
      "يؤكد هذا القرار على قضايا أوسع في المدن الأمريكية والبنية التحتية، مسلطًا الضوء على عدم الكفاءة، التكاليف العالية، والمعارضة المحلية في استثمارات النقل العام."
    ],
    "commentSummary": [
      "خطة تسعير الازدحام في مدينة نيويورك، التي تهدف إلى تقليل حركة المرور وتمويل النقل العام، قد توقفت بسبب السياسة الحكومية.",
      "ينتقد المعارضون سوء إدارة هيئة النقل الحضرية (MTA) والتكاليف العالية كأسباب ضد التمويل الإضافي، بينما يجادل المؤيدون بأنه يمكن أن يحسن تدفق حركة المرور والنقل العام.",
      "النقاش يبرز قضايا أوسع في التخطيط الحضري والسياسات العامة، موازنة بين الراحة والاستدامة."
    ],
    "points": 159,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1719540106
  },
  {
    "id": 40819784,
    "title": "هل أصبحت اضطرابات الهواء الصافي أكثر شيوعًا؟",
    "originLink": "https://www.flightradar24.com/blog/is-cat-more-common/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "لا تظهر حوادث الاضطرابات الجوية الصافية (CAT) اتجاهًا في إحصاءات الحوادث، حيث إن المجلس الوطني لسلامة النقل (NTSB) يبلغ فقط عن الحوادث الكبيرة.",
      "عوامل مثل تغير المناخ وزيادة السفر الجوي قد تساهم في زيادة تكرار الاضطرابات الجوية المفاجئة، ولكن الطائرات الأحدث المزودة بأجهزة استشعار متقدمة وتقارير الطيارين تجعل من الصعب قياسها بدقة.",
      "يتأثر سلوك التيار النفاث بالتغير المناخي، مما يؤثر أيضًا على تكرار الاضطرابات الجوية، لكن الطائرات الحديثة مصممة للتعامل مع الاضطرابات، ويتم تدريب الطيارين على إدارتها."
    ],
    "points": 147,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719576296
  },
  {
    "id": 40818809,
    "title": "ما هو أفضل قاعدة شفرات عملت عليها على الإطلاق؟",
    "originLink": "https://news.ycombinator.com/item?id=40818809",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يُشاد بمستودع Google الأحادي لأدواته الاستثنائية، والتي تشمل إنشاء فوري للقطات قابلة للتعديل وبناءات قابلة لإعادة الإنتاج بشكل مثالي على العناقيد.",
      "ميزات مثل البحث الفوري عن الأكواد، والتعرف السريع على المسؤولية والرموز، وفحوصات ما قبل الإرسال الشاملة تضمن إنتاجية عالية وجودة موحدة للأكواد/الاختبارات.",
      "البيئة تفرض أسلوبًا متسقًا من خلال الثقافة، وأدوات التحقق التلقائي من الشيفرة، والمراجعات الإلزامية للشيفرة، مما يجعلها تجربة مميزة للمطورين."
    ],
    "points": 134,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719564044
  },
  {
    "id": 40820063,
    "title": "طرق جديدة لرصد الأمواج الجاذبية",
    "originLink": "https://www.nature.com/articles/d41586-024-02003-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820063",
    "commentBody": "",
    "originSummary": [
      "أول اكتشاف مباشر لموجات الجاذبية في عام 2015 بواسطة مراصد LIGO وVirgo أحدث ثورة في الفيزياء، مما مكّن الفلكيين من 'سماع' الأحداث الكونية.",
      "الكواشف الحالية محدودة بالترددات بين 100-1,000 هرتز، لكن الأدوات والتقنيات الجديدة تهدف إلى اكتشاف نطاق أوسع، من الترددات بالميغاهرتز إلى النانوهرتز.",
      "تشمل الطرق الخمس الجديدة مصفوفات توقيت النجوم النابضة، التلسكوبات الميكروية، تداخل الذرات، الكواشف المكتبية، والبلورات الكمية، وكل منها يستهدف نطاقات تردد مختلفة ويعد بالكشف عن المزيد من الظواهر الكونية."
    ],
    "commentSummary": [
      "فشلت الجيل الأول من كاشفات الموجات الجاذبية في اكتشاف الموجات، مما أدى إلى دحض ادعاء ويبر في عام 1987، لكن أجهزة التداخل الحالية مثل LIGO وVirgo وKAGRA قد نجحت في اكتشافها.",
      "تؤكد الأمواج الجاذبية نظرية النسبية العامة لأينشتاين، ومع ذلك تظل نظرية الكم للجاذبية غير محلولة، حيث تقدم نظرية الأوتار والجاذبية الكمومية الحلقية تفسيرات محتملة ولكنها صعبة.",
      "المشاريع المستقبلية مثل LISA تهدف إلى تعزيز قدرات الكشف، والجولات العامة لمنشآت LIGO متاحة لأغراض تعليمية."
    ],
    "points": 132,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1719578482
  },
  {
    "id": 40818987,
    "title": "ارتباط مرض باركنسون ببكتيريا الأمعاء يشير إلى علاج بسيط وغير متوقع",
    "originLink": "https://www.sciencealert.com/parkinsons-link-to-gut-bacteria-suggests-unexpected-simple-treatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818987",
    "commentBody": "",
    "originSummary": [
      "حدد الباحثون ميكروبات معينة في الأمعاء مرتبطة بانخفاض مستويات الريبوفلافين (فيتامين B2) والبيوتين (فيتامين B7) لدى مرضى باركنسون، مما يشير إلى أن تناول مكملات فيتامين B قد يكون علاجًا محتملاً.",
      "وجدت الدراسة التي قادها هيروشي نيشيواكي من جامعة ناغويا أن التغيرات في بكتيريا الأمعاء أثرت على إنتاج الأحماض الدهنية قصيرة السلسلة (SCFAs) والبوليامينات، وهي ضرورية لطبقة مخاطية معوية صحية.",
      "تشير النتائج، التي نُشرت في npj Parkinson's Disease، إلى أن الحفاظ على ميكروبيوم أمعاء صحي وتقليل السموم البيئية يمكن أن يساعد في الحماية من أعراض مرض باركنسون."
    ],
    "commentSummary": [
      "تشير دراسة إلى وجود صلة بين بكتيريا الأمعاء ومرض باركنسون، مما يدل على أن بعض السلالات البكتيرية قد تساهم في الحالة.",
      "ظهرت مناقشات حول الفوائد المحتملة لتناول مكملات الفيتامينات مثل الريبوفلافين (B2) والبيوتين (B7) لتخفيف الأعراض.",
      "تؤكد الدراسة على أهمية صحة الأمعاء في الحالات العصبية لكنها تنصح بضرورة إجراء المزيد من الأبحاث وعدم تجاهل العلاجات الحالية."
    ],
    "points": 127,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1719566635
  },
  {
    "id": 40819617,
    "title": "مشروع الريزوتوب: إدخال النظائر المشعة في وحيد القرن الحي",
    "originLink": "https://www.wits.ac.za/news/latest-news/general-news/2024/2024-06/a-novel-way-to-save-rhinos-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819617",
    "commentBody": "",
    "originSummary": [
      "بدأ مشروع Rhisotope في جامعة ويتس بإدخال جرعات منخفضة من النظائر المشعة في قرون وحيد القرن للمساعدة في اكتشاف القرون المهربة عند الحدود الدولية.",
      "تهدف هذه المقاربة المبتكرة، التي تم مراقبتها على مدى ستة أشهر، إلى ردع الصيد الجائر من خلال جعل قرون وحيد القرن قابلة للكشف وأقل قيمة في السوق السوداء.",
      "يستفيد المشروع من البنية التحتية للأمن النووي العالمي ويركز على التعليم والارتقاء الاجتماعي، مع التركيز بشكل خاص على تمكين النساء والفتيات في المجتمعات الريفية."
    ],
    "commentSummary": [
      "يهدف مشروع Rhisotope إلى ردع صيد وحيد القرن غير المشروع عن طريق إدخال النظائر المشعة في قرونها، مما يجعلها قابلة للكشف عند الحدود.",
      "يجادل النقاد بأن الطريقة غير فعالة بسبب عملية الحقن البطيئة وضعف تطبيق قوانين مكافحة العاج، ويقترحون بدائل مثل الصبغ، أو حقن السموم، أو الكيراتين المزروع في المختبر.",
      "المشروع حاليًا في مرحلة إثبات المفهوم، مع استمرار الأبحاث لتقييم جدواه وسلامته."
    ],
    "points": 116,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719574534
  }
]
