[
  {
    "id": 40817852,
    "title": "Galaxies de logiciels",
    "originLink": "https://anvaka.github.io/pm/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817852",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« Software Galaxies visualise les projets logiciels sous forme de points, représentant chaque programme et sa complexité, suscitant des discussions sur ses défis et ses améliorations potentielles. »",
      "« Les utilisateurs débattent de la praticité de la visualisation, certains suggérant qu'elle pourrait servir d'outil éducatif et d'autres se remémorant des outils similaires. »",
      "« Il y a un intérêt à élargir les ensembles de données inclus, tels que le noyau Linux ou le dépôt Java Maven, mettant en lumière la réalisation artistique et technique du projet. »"
    ],
    "points": 511,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1719550493
  },
  {
    "id": 40815139,
    "title": "« 200 personnes inculpées dans une répression de la fraude aux soins de santé de 2,7 milliards de dollars »",
    "originLink": "https://apnews.com/article/justice-department-health-care-fraud-garland-24948b951896d0f265c29ba3fcacf858",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815139",
    "commentBody": "",
    "originSummary": [
      "« Le procureur général des États-Unis, Merrick Garland, a annoncé des accusations contre près de 200 individus dans le cadre d'une répression nationale contre la fraude dans le domaine de la santé, avec des fausses déclarations totalisant plus de 2,7 milliards de dollars. »",
      "« Les accusations incluent un stratagème de 900 millions de dollars en Arizona, où deux propriétaires d'une entreprise de soins des plaies auraient accepté plus de 330 millions de dollars en pots-de-vin pour des facturations frauduleuses à Medicare, entraînant la mort de patients. »",
      "Les autorités ont saisi plus de 230 millions de dollars d'actifs et inculpé 193 individus, dont 76 professionnels de la santé, pour d'autres stratagèmes impliquant de faux traitements de la dépendance pour les Amérindiens et des médicaments contre le VIH mal étiquetés en Floride."
    ],
    "commentSummary": [
      "« Les autorités ont inculpé 200 personnes dans le cadre d'une répression de la fraude dans le secteur de la santé de 2,7 milliards de dollars, soulignant l'ampleur et la gravité de l'opération. »",
      "« Parmi les personnes inculpées, Alexandra Gehrke et Jeffrey King ont été arrêtés à l'aéroport de Phoenix avec des livres incriminants sur l'évasion des forces de l'ordre, ce qui suggère qu'ils se préparaient à fuir. »",
      "« L'affaire souligne l'importance de preuves telles que des valises prêtes et des documents spécifiques pour déterminer le risque de fuite et influencer les décisions judiciaires concernant la libération sous caution et la condamnation. »"
    ],
    "points": 398,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1719522594
  },
  {
    "id": 40814011,
    "title": "Un design moderne de 8 bits, construit en utilisant des valves thermioniques des années 1950",
    "originLink": "https://www.valve.computer/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814011",
    "commentBody": "",
    "originSummary": [
      "Le Valve.Computer est un ordinateur moderne 8 bits utilisant des valves thermioniques des années 1950, opérationnel pour la première fois le 28 mai 2021, et maintenant monté en tant qu'installation artistique.",
      "« Il utilise 1 120 triodes thermioniques configurées en portes NOR, formant des registres de mémoire, une UAL de 8 bits, des oscillateurs et des pilotes de relais, et peut exécuter des programmes comme PONG et une séquence de Fibonacci de 32 bits. »",
      "« Le projet, inspiré par Bletchley Park, a pris 18 mois à construire et est inscrit pour le prix Turner, mettant en lumière ses mérites artistiques et techniques. »"
    ],
    "commentSummary": [
      "« Un ordinateur moderne de 8 bits construit à l'aide de valves thermioniques des années 1950 a suscité un intérêt et des discussions considérables parmi les passionnés de technologie. »",
      "Les utilisateurs ont partagé des histoires sur le matériel ancien, les différences entre les démarrages à froid et à chaud, et les complexités des valves thermioniques, mettant en lumière à la fois les défis et le dévouement impliqués.",
      "« Le projet a été salué pour sa créativité, évoquant la nostalgie et soulignant l'importance des partenaires de soutien dans la poursuite de ses passions. »"
    ],
    "points": 388,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1719515890
  },
  {
    "id": 40820949,
    "title": "« La Cour suprême annule la doctrine de \"déférence Chevron\" vieille de 40 ans »",
    "originLink": "https://www.axios.com/2024/06/28/supreme-court-chevron-doctrine-ruling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820949",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« La Cour suprême a annulé la doctrine de la \"déférence Chevron\", mettant fin à un précédent de 40 ans qui permettait aux agences fédérales d'interpréter des lois ambiguës. »",
      "« Les critiques soutiennent que cette décision pourrait entraîner de l'instabilité, car les tribunaux interpréteront désormais des lois ambiguës, ce qui pourrait augmenter la charge législative du Congrès et affecter la stabilité réglementaire. »",
      "« La décision est considérée comme un changement significatif dans l'équilibre des pouvoirs entre les branches du gouvernement, la juge Kagan dissentant que les agences sont mieux adaptées pour interpréter les lois en raison de leur expertise. »"
    ],
    "points": 303,
    "commentCount": 656,
    "retryCount": 0,
    "time": 1719585072
  },
  {
    "id": 40816158,
    "title": "« Configuration de l'infrastructure et scripts open-source pour entraîner un modèle de 70 milliards à partir de zéro »",
    "originLink": "https://imbue.com/research/70b-infrastructure/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40816158",
    "commentBody": "",
    "originSummary": [
      "« Une petite équipe a réussi à entraîner un modèle de 70 milliards de paramètres sur leur infrastructure, surpassant GPT-4 en mode zero-shot dans les tâches de raisonnement. »",
      "« La configuration impliquait 4 092 GPU H100 répartis sur 511 ordinateurs, connectés via un réseau InfiniBand à trois niveaux, avec une provision détaillée, des diagnostics et des vérifications de santé automatisées. »",
      "« Ils partagent un guide complet et des scripts pour mettre en place une infrastructure similaire, en mettant l'accent sur la reproductibilité, l'automatisation et des tests approfondis, et sont ouverts à l'embauche. »"
    ],
    "commentSummary": [
      "Une petite équipe a réussi à entraîner un modèle de 70 milliards de paramètres à partir de zéro, surpassant GPT-4 en mode zéro-shot sur des tâches de raisonnement.",
      "Ils ont utilisé un cluster haute performance avec plus de 12 000 connexions, garantissant le fonctionnement sans faille de tous les composants.",
      "« L'équipe partage des scripts open-source et un guide pour la configuration de l'infrastructure dans le cadre d'une boîte à outils en trois parties, qui comprend également des sections sur les évaluations et l'optimisation des hyperparamètres. »"
    ],
    "points": 247,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1719529720
  },
  {
    "id": 40815130,
    "title": "« Python lutte contre les rejets de l'App Store d'Apple »",
    "originLink": "https://lwn.net/SubscriberLink/979671/4fb7c1827536d1ae/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815130",
    "commentBody": "",
    "originSummary": [
      "« Une mise à niveau de Python 3.11 à 3.12 a entraîné le rejet de certaines applications Python par les magasins d'applications d'Apple en raison de la présence de la chaîne \"itms-services\" dans l'analyseur urllib, ce qui est interdit dans les applications en bac à sable sur macOS. »",
      "« Le rapport de bogue d'Eric Froemling a conduit à une discussion parmi les développeurs Python sur la manière de s'adapter aux processus de révision des magasins d'applications, en envisageant des solutions comme l'obfuscation et le patching au niveau de la distribution. »",
      "« Un consensus a été atteint pour ajouter une option de compilation appelée \"--with-app-store-compliance\" pour Python 3.13, qui supprimerait le code problématique pour les soumissions aux magasins d'applications, mettant en lumière les défis auxquels les projets de logiciels libres sont confrontés avec des processus de révision opaques. »"
    ],
    "commentSummary": [
      "Les applications Python sont rejetées de l'App Store d'Apple en raison du schéma d'URL \"itms-services\" dans leurs binaires, et Windows Defender signale également ces applications lorsqu'elles sont construites avec PyInstaller.",
      "« Les développeurs soutiennent que les principales plateformes de systèmes d'exploitation entravent les petits développeurs en exigeant des certificats de signature de code coûteux, rendant la distribution des applications difficile. »",
      "Les alternatives suggérées incluent l'utilisation de Homebrew pour les applications Mac ou des certificats gratuits de SignPath pour les builds Windows, mettant en lumière le problème plus large des rejets liés à la sécurité dans la distribution des applications."
    ],
    "points": 238,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1719522551
  },
  {
    "id": 40818422,
    "title": "Le laptop Frame.work est désormais disponible au Danemark, en Finlande et en Suède",
    "originLink": "https://community.frame.work/t/now-available-in-denmark-finland-and-sweden/53690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818422",
    "commentBody": "",
    "originSummary": [
      "« DestroyaFramework a annoncé que leurs produits, y compris le Framework Laptop 13 et 16, sont désormais disponibles pour expédition au Danemark, en Finlande et en Suède. »",
      "« Le nouveau Framework Laptop 13 avec processeurs Intel Core Ultra Series 1 est disponible en précommande, ainsi que des claviers danois et suédois/finlandais. »",
      "Les claviers pour le Framework Laptop 16 seront disponibles fin juillet, avec des alertes par e-mail pour les mises à jour de stock disponibles sur la page du produit."
    ],
    "commentSummary": [
      "« L'ordinateur portable Frame.work est désormais disponible au Danemark, en Finlande et en Suède, avec des claviers danois appropriés, répondant aux critiques des dispositions de clavier nordiques pour la programmation. »",
      "Le design modulaire de Framework permet des mises à niveau et des réparations faciles, mettant l'accent sur la réparabilité et les avantages environnementaux, bien que certains utilisateurs notent des problèmes de durée de vie de la batterie et de qualité de la webcam.",
      "« L'expansion en Norvège est compliquée par son statut hors UE, ce qui impacte les coûts et la logistique. »"
    ],
    "points": 205,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1719558557
  },
  {
    "id": 40814728,
    "title": "« La règle de la FCC obligerait les opérateurs à déverrouiller tous les téléphones après 60 jours »",
    "originLink": "https://techcrunch.com/2024/06/27/fcc-rule-would-make-carriers-unlock-all-phones-after-60-days/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40814728",
    "commentBody": "",
    "originSummary": [
      "« La FCC propose une règle exigeant que les opérateurs déverrouillent les téléphones 60 jours après l'achat afin de simplifier le processus pour les consommateurs. »",
      "Jessica Rosenworcel, présidente de la FCC, a annoncé l'Avis de Proposition de Règlement (NPRM) pour établir des règles claires et nationales de déverrouillage, avec des commentaires publics invités à partir du 18 juillet.",
      "« La règle vise à fournir cohérence et transparence, facilitant ainsi le changement d'opérateur pour les consommateurs. »"
    ],
    "commentSummary": [
      "« La FCC a proposé une règle obligeant les opérateurs à déverrouiller les téléphones après 60 jours, dans le but de réduire les déchets électroniques et de faciliter le changement d'opérateur. »",
      "« Les États-Unis se distinguent par leurs téléphones verrouillés par les opérateurs, ce qui donne aux opérateurs un contrôle significatif sur les fonctionnalités et les mises à jour des téléphones, contrairement à l'Europe où les téléphones peuvent être verrouillés à distance en cas de non-paiement. »",
      "« La proposition a suscité un débat, certains considérant les verrous opérateurs comme étant anti-consommateurs, tandis que d'autres soutiennent qu'ils aident à financer les téléphones pour les personnes ayant un mauvais crédit. »"
    ],
    "points": 172,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1719520021
  },
  {
    "id": 40815097,
    "title": "« Le créateur de RStudio lance un nouvel IDE pour R et Python »",
    "originLink": "https://www.infoworld.com/article/3715702/maker-of-rstudio-launches-new-r-and-python-ide.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40815097",
    "commentBody": "",
    "originSummary": [
      "« Posit, anciennement connu sous le nom de RStudio, a publié une version bêta de Positron, un nouvel environnement de développement intégré (IDE) pour R et Python, basé sur Visual Studio Code. »",
      "« Positron est disponible pour macOS, Windows et Linux, et est conçu pour être convivial avec un support intégré pour R et Python, éliminant ainsi le besoin d'extensions supplémentaires. »",
      "« L'IDE comprend un explorateur de données et de variables pour une manipulation facile des données et prend en charge d'autres extensions VS Code via le registre OpenVSX, bien qu'il soit encore en développement précoce. »"
    ],
    "commentSummary": [
      "Le créateur de RStudio a lancé un nouvel environnement de développement intégré (IDE) appelé Positron, qui prend en charge à la fois R et Python.",
      "« Malgré la nouvelle version, RStudio continuera d'être développé et maintenu, avec certaines fonctionnalités spécifiques à R qui resteront exclusives à celui-ci. »",
      "« Positron vise à combler le fossé entre R et Python, offrant un environnement unifié pour l'analyse de données et le développement de packages. »"
    ],
    "points": 171,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1719522351
  },
  {
    "id": 40817079,
    "title": "« La mort de la tarification de la congestion à New York »",
    "originLink": "https://www.apricitas.io/p/the-death-of-nyc-congestion-pricing",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40817079",
    "commentBody": "",
    "originSummary": [
      "« La gouverneure Kathy Hochul a annoncé une pause indéfinie sur le projet de tarification de la congestion de New York, qui visait à facturer les véhicules entrant dans le Lower Manhattan pour financer des projets de transport. »",
      "« L'annulation, motivée par l'opposition des conducteurs de banlieue et des préoccupations concernant l'efficacité des dépenses de la MTA, met en péril des projets d'infrastructure clés et leur financement. »",
      "« Cette décision souligne des problèmes plus larges dans les villes américaines et les infrastructures, mettant en évidence des inefficacités, des coûts élevés et une opposition locale aux investissements dans les transports en commun. »"
    ],
    "commentSummary": [
      "« Le plan de tarification de la congestion de New York, destiné à réduire le trafic et à financer les transports en commun, a été retardé par la politique de l'État. »",
      "« Les critiques citent la mauvaise gestion et les coûts élevés de la MTA comme raisons contre un financement supplémentaire, tandis que les partisans soutiennent que cela pourrait améliorer la circulation et les transports en commun. »",
      "« Le débat souligne des questions plus larges de planification urbaine et de politiques publiques, équilibrant commodité et durabilité. »"
    ],
    "points": 159,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1719540106
  },
  {
    "id": 40819784,
    "title": "« La turbulence en air clair devient-elle plus fréquente ? »",
    "originLink": "https://www.flightradar24.com/blog/is-cat-more-common/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819784",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Les incidents de turbulences en air clair (CAT) ne montrent pas de tendance dans les statistiques d'accidents, car le NTSB ne rapporte que les incidents significatifs.",
      "« Des facteurs tels que le changement climatique et l'augmentation des voyages aériens peuvent contribuer à une CAT plus fréquente, mais les nouveaux avions équipés de capteurs avancés et les rapports des pilotes rendent la mesure difficile. »",
      "Le comportement du courant-jet, influencé par le changement climatique, affecte également la fréquence des turbulences en air clair, mais les avions modernes sont conçus pour gérer les turbulences, et les pilotes sont formés pour les maîtriser."
    ],
    "points": 147,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1719576296
  },
  {
    "id": 40818809,
    "title": "« Quel est le meilleur code source sur lequel vous avez jamais travaillé ? »",
    "originLink": "https://news.ycombinator.com/item?id=40818809",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818809",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "« Le monorepo de Google est loué pour ses outils exceptionnels, qui incluent la création instantanée de snapshots modifiables et des builds parfaitement reproductibles sur des clusters. »",
      "Des fonctionnalités telles que la recherche de code instantanée, l'attribution rapide des responsabilités et la recherche de symboles, ainsi que des vérifications préalables étendues, garantissent une productivité élevée et une qualité uniforme du code/test.",
      "« L'environnement impose un style cohérent grâce à la culture, aux auto-linters et aux revues de code obligatoires, offrant ainsi une expérience exceptionnelle pour les développeurs. »"
    ],
    "points": 134,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1719564044
  },
  {
    "id": 40820063,
    "title": "« Nouvelles méthodes pour détecter les ondes gravitationnelles »",
    "originLink": "https://www.nature.com/articles/d41586-024-02003-6",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40820063",
    "commentBody": "",
    "originSummary": [
      "« La première détection directe des ondes gravitationnelles en 2015 par les observatoires LIGO et Virgo a révolutionné la physique, permettant aux astronomes de 'entendre' les événements cosmiques. »",
      "Les détecteurs actuels sont limités à des fréquences comprises entre 100 et 1 000 Hz, mais de nouveaux instruments et techniques visent à détecter une gamme plus large, allant des mégahertz aux nanohertz.",
      "Les cinq nouvelles méthodes incluent les réseaux de chronométrage de pulsars, les télescopes à micro-ondes, l'interférométrie atomique, les détecteurs de bureau et les cristaux quantiques, chacun ciblant différentes gammes de fréquences et promettant de révéler davantage de phénomènes cosmiques."
    ],
    "commentSummary": [
      "« La première génération de détecteurs d'ondes gravitationnelles n'a pas réussi à détecter des ondes, discréditant ainsi la revendication de Weber en 1987, mais les interféromètres actuels comme LIGO, Virgo et KAGRA les ont détectées avec succès. »",
      "« Les ondes gravitationnelles confirment la relativité générale d'Einstein, mais une théorie quantique de la gravité reste non résolue, avec la théorie des cordes et la gravité quantique à boucles offrant des explications potentielles mais difficiles. »",
      "Les projets futurs comme LISA visent à améliorer les capacités de détection, et des visites publiques des installations de LIGO sont disponibles à des fins éducatives."
    ],
    "points": 132,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1719578482
  },
  {
    "id": 40818987,
    "title": "Le lien entre la maladie de Parkinson et les bactéries intestinales suggère un traitement simple et inattendu",
    "originLink": "https://www.sciencealert.com/parkinsons-link-to-gut-bacteria-suggests-unexpected-simple-treatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40818987",
    "commentBody": "",
    "originSummary": [
      "Les chercheurs ont identifié des microbes intestinaux spécifiques liés à des niveaux réduits de riboflavine (vitamine B2) et de biotine (vitamine B7) chez les patients atteints de la maladie de Parkinson, suggérant une supplémentation en vitamines B comme traitement potentiel.",
      "« L'étude, dirigée par Hiroshi Nishiwaki de l'Université de Nagoya, a révélé que les changements dans les bactéries intestinales affectaient la production d'acides gras à chaîne courte (AGCC) et de polyamines, essentiels pour une couche de mucus intestinal saine. »",
      "« Les résultats, publiés dans npj Parkinson's Disease, indiquent que le maintien d'un microbiome intestinal sain et la réduction des toxines environnementales pourraient aider à se protéger contre les symptômes de la maladie de Parkinson. »"
    ],
    "commentSummary": [
      "« Une étude suggère un lien entre les bactéries intestinales et la maladie de Parkinson, indiquant que certaines souches bactériennes pourraient contribuer à cette condition. »",
      "Des discussions ont émergé sur les avantages potentiels de la supplémentation en vitamines comme la riboflavine (B2) et la biotine (B7) pour atténuer les symptômes.",
      "« L'étude souligne l'importance de la santé intestinale sur les conditions neurologiques, mais conseille que davantage de recherches sont nécessaires et que les traitements actuels ne doivent pas être ignorés. »"
    ],
    "points": 127,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1719566635
  },
  {
    "id": 40819617,
    "title": "« Le projet Rhisotope : Insertion de radioisotopes dans des rhinocéros vivants »",
    "originLink": "https://www.wits.ac.za/news/latest-news/general-news/2024/2024-06/a-novel-way-to-save-rhinos-.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40819617",
    "commentBody": "",
    "originSummary": [
      "« Le projet Rhisotope à l'Université de Wits a commencé à insérer de faibles doses de radio-isotopes dans les cornes de rhinocéros pour aider à détecter les cornes de contrebande aux frontières internationales. »",
      "« Cette approche innovante, surveillée sur une période de six mois, vise à dissuader le braconnage en rendant les cornes de rhinocéros détectables et moins précieuses sur le marché noir. »",
      "« Le projet s'appuie sur l'infrastructure mondiale de sécurité nucléaire et se concentre sur l'éducation et l'élévation sociale, en particulier l'autonomisation des femmes et des filles dans les communautés rurales. »"
    ],
    "commentSummary": [
      "« Le projet Rhisotope vise à dissuader le braconnage des rhinocéros en insérant des radio-isotopes dans leurs cornes, les rendant détectables aux frontières. »",
      "« Les critiques soutiennent que la méthode est inefficace en raison de la lenteur du processus d'injection et de la faible application des lois anti-ivoire, suggérant des alternatives comme la teinture, l'infusion de toxines ou la kératine cultivée en laboratoire. »",
      "« Le projet est actuellement dans la phase de preuve de concept, avec des recherches en cours pour évaluer sa viabilité et sa sécurité. »"
    ],
    "points": 116,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1719574534
  }
]
