[
  {
    "id": 40145963,
    "title": "بايدن يوقع قانونا يتطلب من ByteDance تصفية TikTok",
    "originLink": "https://www.theverge.com/2024/4/24/24139036/biden-signs-tiktok-ban-bill-divest-foreign-aid-package",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40145963",
    "commentBody": "",
    "originSummary": [
      "وقع الرئيس جو بايدن مشروع قانون ليصبح قانونا يفرض على ByteDance ، الشركة الأم ل TikTok ومقرها الصين ، تصفية المنصة في غضون 9 إلى 12 شهرا لمنع الحظر الأمريكي.",
      "تم تمرير مشروع القانون ، وهو جزء من حزمة مساعدات أجنبية ، من خلال تكتيكات سياسية ، مما دفع TikTok إلى الإعلان عن معارضة قانونية ، مما أثار مخاوف بشأن رد فعل الصين.",
      "يجادل الرئيس التنفيذي لشركة TikTok ضد الحظر ، ويؤطره على أنه إسكات لتعبير المستخدم ، مما يزيد من تكثيف النقاش حول مستقبل المنصة."
    ],
    "commentSummary": [
      "وقع الرئيس بايدن مشروع قانون يكلف ByteDance ، الشركة الأم ل TikTok ، ببيع عملياتها في الولايات المتحدة ، مشيرا إلى مخاوف تتعلق بالأمن القومي فيما يتعلق باستغلال بيانات الحكومة الصينية المحتملة.",
      "تركز المناقشات على توازن القوى بين الولايات المتحدة والصين ، وقوانين خصوصية البيانات ، والعلاقات الدولية ، وتداعيات حظر TikTok ، بما في ذلك المخاوف بشأن النفوذ الصيني والدعاية والتلاعب بوسائل التواصل الاجتماعي.",
      "تستمر المناقشات حول الخوارزميات المسببة للإدمان في وسائل التواصل الاجتماعي ، والتحكم في المحتوى الأجنبي ، والآثار الاجتماعية والأمنية لكون TikTok تحت سيطرة الحكومة الصينية أو بيعها لكيانات أمريكية."
    ],
    "points": 702,
    "commentCount": 1428,
    "retryCount": 0,
    "time": 1713974395
  },
  {
    "id": 40150639,
    "title": "شركات الطيران المكلفة برد أموال الركاب عن اضطرابات الرحلات الجوية",
    "originLink": "https://abcnews.go.com/Politics/airlines-give-automatic-refunds-canceled-flights-delayed-3/story?id=109573733",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40150639",
    "commentBody": "",
    "originSummary": [
      "أدخلت وزارة النقل قواعد جديدة تلزم شركات الطيران بتقديم مبالغ نقدية مستردة للرحلات الملغاة أو المتأخرة بشكل كبير ، وكذلك للأمتعة المفقودة التي لم يتم تسليمها في غضون 12 ساعة ، لحماية حقوق الركاب وردع الرسوم الخفية.",
      "يجب على شركات الطيران الالتزام باللوائح في غضون ستة أشهر ، وضمان حصول العملاء على المبالغ المستردة التي يستحقونها وتحميل شركات الطيران المسؤولية عن التزاماتها.",
      "وتهدف المبادرة إلى تعزيز حماية العملاء وضمان الشفافية فيما يتعلق بسياسات استرداد الأموال في صناعة الطيران."
    ],
    "commentSummary": [
      "تخضع شركات الطيران للتدقيق لرفضها استرداد الأموال النقدية للرحلات الملغاة أو المتأخرة ، مما ينتهك اللوائح في الولايات المتحدة والاتحاد الأوروبي.",
      "يتخذ الركاب ، غير الراضين عن القسائم ، إجراءات قانونية لتأمين المبالغ المستردة المستحقة لهم ، مما يؤدي إلى مناقشات حول الصناعة التي تعطي الأولوية للربح على رضا العملاء.",
      "يتم تسليط الضوء على أهمية لوائح شركات الطيران الأكثر وضوحا والمطبقة لمعالجة قضايا مثل تأخير الرحلات ، والحجز الزائد ، وتفويت رحلات الربط ، والقصر غير المصحوبين بذويهم ، مع تبادل التجارب المتناقضة بين الركاب."
    ],
    "points": 519,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1713997763
  },
  {
    "id": 40149095,
    "title": "IBM تستحوذ على HashiCorp مقابل 6.4 مليار دولار",
    "originLink": "https://www.reuters.com/markets/deals/ibm-buy-hashicorp-64-billion-deal-expand-cloud-software-2024-04-24/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40149095",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "من المقرر أن تستحوذ شركة IBM على HashiCorp في صفقة بقيمة 6.4 مليار دولار ، مما يثير مخاوف بشأن الابتكار والثقافة والجوانب المالية للموظفين.",
      "تحيط التكهنات بالتأثير على منتجات HashiCorp ، مثل Terraform و Nomad ، حيث يتساءل المستخدمون عن التغييرات المحتملة في الترخيص ومستقبل المنتجات.",
      "تمتد المناقشات إلى استخدام لغات البرمجة مثل Go و Rust لمعالجة الأخطاء وتطوير البرمجيات ، إلى جانب انتقادات قسم الاستشارات في IBM ، Kyndryl ، ووجهات النظر المختلفة حول مكانة IBM في قطاع التكنولوجيا."
    ],
    "points": 466,
    "commentCount": 316,
    "retryCount": 0,
    "time": 1713990092
  },
  {
    "id": 40151952,
    "title": "قوة القراءة وراء الذاكرة",
    "originLink": "https://blog.jim-nielsen.com/2024/you-are-what-you-read/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40151952",
    "commentBody": "",
    "originSummary": [
      "يؤكد المقال أن تأثير قراءة المحتوى واستهلاكه يمتد إلى ما هو أبعد من مجرد الحفظ ، وتشكيل أفكارنا وسلوكنا.",
      "إنه يشدد على أهمية توسيع نطاق تفكيرنا من خلال القراءة والانتقائية بشأن المحتوى الذي نتعامل معه.",
      "يوضح إدراج القصص الشخصية التأثير الدائم للتعليم على الأفراد ، مع التركيز على الآثار الدائمة لما نقرأه ونتعلمه."
    ],
    "commentSummary": [
      "يستكشف المقال كيف تتفاعل التجارب السابقة وصنع القرار والإرادة الحرة ، مع التركيز على تأثير القراءة والسفر والبيئة على المعتقدات والسلوكيات.",
      "إنه يؤكد على أهمية الاختيار الواعي للمحتوى عبر الإنترنت ويثير استفسارات فلسفية حول الوعي والوكالة الشخصية والتأثيرات المجتمعية على صنع القرار.",
      "تقدم المناقشة نظرة ثاقبة على الديناميات المعقدة التي تشكل السلوك البشري وتشكيل الهوية ، مما يدفع إلى التفكير في تعقيدات هذه العمليات."
    ],
    "points": 416,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1714006717
  },
  {
    "id": 40149136,
    "title": "IBM تعزز منصة البيئة السحابية الهجينة بالاستحواذ على HashiCorp بقيمة 6.4 مليار دولار",
    "originLink": "https://newsroom.ibm.com/2024-04-24-IBM-to-Acquire-HashiCorp-Inc-Creating-a-Comprehensive-End-to-End-Hybrid-Cloud-Platform",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40149136",
    "commentBody": "",
    "originSummary": [
      "تستحوذ IBM على HashiCorp مقابل 6.4 مليار دولار لتعزيز قدراتها الإدارية متعددة السحابة وتعزيز النمو في المجالات الاستراتيجية ، بما في ذلك تعزيز منصة السحابة الهجينة.",
      "ستعمل أدوات الأتمتة والأمن الخاصة ب HashiCorp ، مثل Terraform ، على إثراء خدمات IBM وتوسيع نطاق وصولها إلى عملاء المؤسسات ، في انتظار الموافقات التنظيمية.",
      "ويتماشى هذا الاستحواذ مع هدف آي بي إم المتمثل في توسيع السحابة الهجينة واستخدام الذكاء الاصطناعي، مع توقع تعزيز الأرباح والتدفقات النقدية."
    ],
    "commentSummary": [
      "اشترت شركة IBM شركة HashiCorp، Inc مقابل 6.4 مليار دولار ، مما أدى إلى مناقشات حول مشاركة IBM المتزايدة في البرامج مفتوحة المصدر.",
      "أثار الاستحواذ تكهنات حول عمليات الاستحواذ المستقبلية المحتملة لشركة IBM في صناعة التكنولوجيا."
    ],
    "points": 351,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1713990286
  },
  {
    "id": 40147534,
    "title": "عندما تكتشف الموسيقى الهضاب: استكشاف ألحان جديدة تتجاوز 30",
    "originLink": "https://www.statsignificant.com/p/when-do-we-stop-finding-new-music",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40147534",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال في ركود الموسيقى ، ويسلط الضوء على متى يتوقف الأفراد عادة عن اكتشاف موسيقى جديدة بناء على تحليل البيانات.",
      "تشكل عوامل مثل تأثيرات الأجيال والمفاضلة بين الاستكشاف والاستغلال تفضيلاتنا الموسيقية ، حيث تشير الأبحاث إلى ركود الأذواق الموسيقية حوالي 30-33 عاما بسبب الخيارات الساحقة والأولويات المتغيرة.",
      "إن تنمية الانفتاح والبحث بنشاط عن موسيقى جديدة يمكن أن يكافح الشلل الموسيقي ، مما يشجع على التوازن بين استكشاف الألحان الجديدة والاستمتاع بالكلاسيكيات المحبوبة من أجل الرضا."
    ],
    "commentSummary": [
      "يناقش المشاركون القيود المفروضة على خوارزميات التوصية الموسيقية الحالية ويتبادلون الخبرات في اكتشاف موسيقى جديدة ومتنوعة.",
      "يعد تأثير خدمات البث ، وتغيير اتجاهات صناعة الموسيقى ، والتفضيلات الشخصية على طعم الموسيقى ، والتحديات في تصنيف الموسيقى والتوصية بها بناء على التفضيلات الفردية من الموضوعات الرئيسية.",
      "تتناول المحادثة أيضا الفصل العنصري في الصناعة ، والتأثيرات التاريخية على أنواع الموسيقى ، وتؤكد على أهمية استكشاف الموسيقى الجديدة بنشاط للنمو الثقافي والموسيقي."
    ],
    "points": 309,
    "commentCount": 425,
    "retryCount": 0,
    "time": 1713981018
  },
  {
    "id": 40148563,
    "title": "استكشاف العلاقات العرقية والتقاليد الجنوبية في \"إديستو\" لبادجيت باول",
    "originLink": "https://lithub.com/i-now-lack-the-juice-to-fuel-the-bluster-to-conceal-that-i-am-a-simpleton-padgett-powell-legend/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148563",
    "commentBody": "",
    "originSummary": [
      "\"Edisto\" لبادجيت باول يتعمق في رحلة بلوغ سن الرشد لسيمونز إيفرسون مانيغولت في الجنوب ، ويتطرق إلى العلاقات العرقية وديناميكيات الأسرة.",
      "يسلط باول الضوء على استخدام الراوي الشاب لعرض عبثية التكامل العرقي ، والتفكير في التقاليد الأدبية الجنوبية والخيال التجريبي.",
      "يتناول المقطع التحديات مع القراء المعاصرين ، ومحرري الحساسية ، والعنصرية ، وتطور الخيال الأدبي ، ويقدم نظرة ثاقبة حول مواضيع مختلفة وفرصة لدعم Literary Hub."
    ],
    "commentSummary": [
      "يتعمق المقال في المناقشات والمناقشات والمقابلات المتعلقة باللغة والأدب والعرق والهوية ، ويتناول موضوعات مثل اختيار الكلمات ، وكتابة مصطلحات مثل \"أسود\" و \"أبيض\" بالأحرف الكبيرة ، وتطور أسلوب النثر.",
      "كما يتطرق إلى مفهوم التحقق ويستكشف العنصرية والهوية العرقية وتعقيدات الخطاب عبر الإنترنت."
    ],
    "points": 300,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1713987140
  },
  {
    "id": 40146088,
    "title": "ندفة الثلج في القطب الشمالي: أكبر نموذج مفتوح المصدر 128x3B MoE",
    "originLink": "https://replicate.com/snowflake/snowflake-arctic-instruct",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40146088",
    "commentBody": "",
    "originSummary": [
      "يتيح تطبيق Readme Demo للمستخدمين التفاعل مع Arctic ، وهو نموذج الذكاء الاصطناعي محول هجين كثيف MoE تم إنشاؤه بواسطة فريق أبحاث Snowflake الذكاء الاصطناعي.",
      "يمكن الوصول إلى نقاط التفتيش النموذجية في القطب الشمالي بموجب ترخيص Apache-2.0 لكل من الإصدارات الأساسية والمضبوطة بالتعليمات ، مما يعزز البحث والنماذج الأولية واستخدام المنتج.",
      "يقدم مستودع Github الخاص ب Snowflake Arctic مواد تكميلية مثل البرامج التعليمية وكتب الطبخ للاستفادة من نموذج المعلمات القوي البالغ 480 مليار الذي يجمع بين محول كثيف يبلغ 10 مليارات محول مع 128 × 3.66 مليار MoE MLP ضخم."
    ],
    "commentSummary": [
      "تركز مناقشات صناعة التكنولوجيا على نماذج الذكاء الاصطناعي مثل Snowflake Arctic و Llama-3 ، مع تسليط الضوء على الآثار البيئية وتحديات الجودة وقضايا المنافسة.",
      "التركيز على مزايا وعيوب نماذج الذكاء الاصطناعي ، وعدم وجود عائد استثمار إيجابي في بعض الأسواق ، وأهمية بيانات التدريب مفتوحة المصدر للنماذج مفتوحة المصدر الحقيقية.",
      "تشمل المحادثات نماذج MOE للاستدلال على وحدة المعالجة المركزية ، وتطور سرعة ساعة وحدة المعالجة المركزية ، والمناقشات حول قابلية استنساخ النموذج والامتثال للمصدر المفتوح ، مع التركيز على الآثار والمخاوف الأخلاقية في تطبيقات الذكاء الاصطناعي."
    ],
    "points": 284,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1713974978
  },
  {
    "id": 40147883,
    "title": "أداة الواجهة الأمامية المحسنة لوظيفة السحب والإفلات",
    "originLink": "https://github.com/atlassian/pragmatic-drag-and-drop",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40147883",
    "commentBody": "",
    "originSummary": [
      "السحب والإفلات العملي عبارة عن سلسلة أدوات متعددة الاستخدامات لإضافة وظائف السحب والإفلات دون عناء إلى تطبيقات الويب ، والتي تظهر في منتجات مثل Trello و Jira و Confluence.",
      "الكود متاح للجمهور تحت مساحة الاسم @atlaskit على npm ، ولكن لا يتم قبول المساهمات في الوقت الحالي ، مع حزم اختيارية يمكن استبدالها بسهولة لتصميم المكتبات وعرضها.",
      "يتكامل مع أنظمة التصميم ولغات البرمجة المختلفة ، ويقف على الجهود التعاونية للعديد من الأفراد في Atlassian."
    ],
    "commentSummary": [
      "يقيم المنشور إيجابيات وسلبيات مكتبات مكونات السحب والإفلات ، مع التركيز على تحديات إمكانية الوصول على الأجهزة المحمولة ، والتي تتميز برد فعل جميل DND و dndkit.",
      "يسلط الضوء على صراعات تنفيذ السحب والإفلات لواجهات ألعاب الورق المعقدة ، ويوصي بالسحب والإفلات العملي و SortableJS لمثل هذه المهام.",
      "يشارك المستخدمون الإحباطات بشأن وظيفة السحب والإفلات على الأجهزة التي تعمل باللمس ، بما في ذلك مشاكل أداء Jira وصعوبات استخدام هذه الميزات على الأنظمة الأساسية للجوال."
    ],
    "points": 279,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1713983127
  },
  {
    "id": 40143814,
    "title": "شركة موندراغون: تعاونية صناعية رائدة",
    "originLink": "https://www.theguardian.com/lifeandstyle/2024/apr/24/in-the-us-they-think-were-communists-the-70000-workers-showing-the-world-another-way-to-earn-a-living",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40143814",
    "commentBody": "",
    "originSummary": [
      "شركة موندراغون في إسبانيا هي أكبر تعاونية صناعية على مستوى العالم ، حيث يتقاسم 70000 عامل ومالك الأرباح ، مسترشدين بروح تتمحور حول الإنسان متأثرة بالكاثوليكية ورواد روتشديل.",
      "على الرغم من العقبات ، تزدهر موندراغون من خلال التأكيد على التنظيم الديمقراطي ، والتضامن مع الأجور ، والمسؤولية الاجتماعية ، والحفاظ على قدرتها التنافسية في السوق.",
      "وقد حفز هذا النموذج التعاوني الاهتمام على الصعيد الدولي، وقدم بديلا محتملا لأطر الأعمال الرأسمالية التقليدية."
    ],
    "commentSummary": [
      "تبحث المناقشة في مزايا وعيوب التعاونيات المملوكة للموظفين ، باستخدام شركة Mondragón في إقليم الباسك كمثال.",
      "يتم استكشاف أنواع مختلفة من التعاونيات ، وتأثيرها على القطاعات المختلفة ، والتناقض بين التعاونيات المملوكة للعملاء والمملوكة للموظفين.",
      "تشمل الموضوعات الاختلافات بين الاشتراكية والرأسمالية ، وفعالية الشركات المملوكة للعمال ، وعواقب زيادة الأجور على الموظفين ، وإلقاء الضوء على الطبيعة المعقدة لنماذج الملكية والأيديولوجيات الاقتصادية."
    ],
    "points": 277,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1713963486
  },
  {
    "id": 40143669,
    "title": "Faer-rs: الجبر الخطي الفعال في الصدأ",
    "originLink": "https://github.com/sarah-ek/faer-rs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40143669",
    "commentBody": "",
    "originSummary": [
      "Faer عبارة عن صندوق Rust يركز على عمليات الجبر الخطي المحمولة والصحيحة والأداء ، ويقدم أغلفة عالية المستوى لمهام المصفوفة مثل الضرب والعكس.",
      "تعرض البيانات المعيارية أدائها مقابل المكتبات الأخرى مثل ndarray و nalgebra ، مع قياسات التوقيت لمختلف طرق التحلل وعمليات المصفوفة.",
      "يتم الترحيب بالمساهمات عبر خادم Discord ، مع مقارنات التوقيت التي توضح أداء أسرع للمصفوفات الأكبر وحسابات Hermitian في حسابات تحلل القيمة الذاتية."
    ],
    "commentSummary": [
      "تتعمق مناقشة GitHub في نقص الموارد المشتركة والتعليمات البرمجية في مكتبات Rust للمصفوفات والمصفوفات مثل ndarray و nalgebra و faer ، مع تفوق faer-rs في معايير تحلل LU.",
      "يتناول موضوعات مثل التهيئة المسبقة في الحسابات العددية ، وتحسين BLIS ، والمخاوف المتعلقة بالكلمة الرئيسية التلقائية في قياس Eigen.",
      "تكشف المعايير متعددة مؤشرات الترابط عن تفوق Faer على OpenBLAS عند مقارنتها ب MKL ، باستخدام Rayon للتوازي ، والتنافس مع مكتبات مثل fastdiv و good_lp ، مع التأكيد على أهمية الكود الفعال والتعاون في دقة القياس."
    ],
    "points": 211,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1713962469
  },
  {
    "id": 40148707,
    "title": "قصر النظر في مرحلة الطفولة: الوباء العالمي في ازدياد",
    "originLink": "https://theconversation.com/nearsightedness-is-at-epidemic-levels-and-the-problem-begins-in-childhood-225255",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148707",
    "commentBody": "",
    "originSummary": [
      "قصر النظر ، أو قصر النظر ، آخذ في الارتفاع في جميع أنحاء العالم ، حيث من المتوقع أن يحتاج ما يقدر بنصف سكان العالم إلى نظارات بحلول عام 2050.",
      "ترتبط الزيادة في قصر النظر بزيادة وقت الشاشة وتقليل الوقت الذي يقضيه في الهواء الطلق ، مما يؤكد أهمية الكشف المبكر وتصحيح الرؤية لوقف تقدمه.",
      "يمكن أن يساعد تشجيع الأنشطة الخارجية وفترات الراحة المنتظمة من المهام القريبة في التخفيف من تطور قصر النظر أو تأجيله."
    ],
    "commentSummary": [
      "يرتبط ارتفاع قصر النظر ، خاصة بين الأطفال ، بعدم كفاية التعرض للضوء الطبيعي ، مما أثار مناقشات حول استخدام العدسات التصحيحية لوقف تقدمه.",
      "تتراوح التوصيات من تأييد النظارات إلى التشكيك في فعاليتها ، في حين يتم اقتراح اقتراحات مثل قطرات الأتروبين والأنشطة الخارجية للحد من تطور قصر النظر.",
      "تمتد المناقشات إلى الاستعدادات الوراثية ، والمحفزات البيئية ، وأهمية فحوصات الرؤية المبكرة والتعليم في مكافحة معدلات قصر النظر المتصاعدة."
    ],
    "points": 204,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1713987887
  },
  {
    "id": 40146505,
    "title": "الفولاذ يكشف النقاب عن مولد SDK لتكامل API",
    "originLink": "https://www.stainlessapi.com/blog/announcing-the-stainless-sdk-generator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40146505",
    "commentBody": "",
    "originSummary": [
      "أطلقت Stainless مولد SDK ، مما يسهل تطوير مكتبات العملاء لواجهات برمجة التطبيقات المعروفة مثل OpenAI و Cloudflare ، مما يبسط عملية التكامل للمطورين.",
      "تعمل الأداة على أتمتة إنشاء وصيانة حزم SDK بلغات برمجة مختلفة ، مما يعزز الكفاءة والموثوقية في تكامل واجهة برمجة التطبيقات.",
      "تهدف مبادرة Stainless إلى تعزيز النظام البيئي REST من خلال تمكين إنشاء واجهات برمجة تطبيقات عالية الجودة وآمنة من النوع وتوفر استوديو SDK لتحديد المشكلات وحلها قبل الإصدار."
    ],
    "commentSummary": [
      "يعمل Stainless SDK Generator على أتمتة صيانة روابط لغة API العامة ، مما يعزز جودة SDK ويوفر الوقت الهندسي.",
      "يعالج المشكلات التي تمت مواجهتها في إدارة مجموعات SDK المتعددة ، ومنع التناقضات من واجهة برمجة التطبيقات الأصلية وتبسيط التطوير.",
      "تم الإشادة ب Stainless لسهولة الاستخدام والتخصيص وإمكانية تعزيز قابلية التشغيل البيني ، مما يجعلها الخيار الأفضل لتوليد SDK."
    ],
    "points": 203,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1713976475
  },
  {
    "id": 40148833,
    "title": "إرث حفلات LAN: الحنين إلى الماضي وتجربة الألعاب الجماعية",
    "originLink": "https://aftermath.site/lan-party-merritt-k-book-read-only-memory-rom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148833",
    "commentBody": "",
    "originSummary": [
      "يتعمق المقال والكتاب في ذروة وتراجع حفلات LAN ، حيث تجمع اللاعبون محليا للألعاب متعددة اللاعبين قبل الإنترنت عالي السرعة على نطاق واسع.",
      "يناقش الأهمية الثقافية والجوانب الاجتماعية لأطراف LAN ، ويقارنها بالتحول نحو الألعاب عبر الإنترنت وخدمات التوفيق.",
      "يشار إلى التطورات التكنولوجية في الألعاب وتأثير الاتجاهات الثقافية مثل الرسوم المتحركة والنو ميتال ، مما يسلط الضوء على الحنين إلى الاتصال الشخصي والشعور المجتمعي للألعاب المبكرة ضد مجتمع اليوم الذي تحركه التكنولوجيا."
    ],
    "commentSummary": [
      "يستكشف المقال ذروة وتراجع أحزاب LAN خلال أواخر تسعينيات القرن العشرين وأوائل أواخر القرن العشرين ، مع التركيز على روح المجتمع ، وتبادل الخبرات الفنية ، والحنين إلى الماضي الذي يعاني منه المشاركون.",
      "يناقش مخاوف الوالدين فيما يتعلق بسلامة الأطفال عبر الإنترنت وكيف تطورت أطراف LAN داخل مجتمع الألعاب بمرور الوقت.",
      "يتذكر المستخدمون الألعاب المفضلة ومشكلات الاتصال والجاذبية الدائمة لأطراف LAN على الرغم من التقدم التكنولوجي."
    ],
    "points": 199,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1713988600
  }
]
