[
  {
    "id": 40145963,
    "title": "Biden podpísal zákon, ktorý vyžaduje, aby sa spoločnosť ByteDance zbavila TikToku",
    "originLink": "https://www.theverge.com/2024/4/24/24139036/biden-signs-tiktok-ban-bill-divest-foreign-aid-package",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40145963",
    "commentBody": "",
    "originSummary": [
      "Americký prezident Joe Biden podpísal zákon, podľa ktorého musí ByteDance, materská spoločnosť TikToku so sídlom v Číne, do 9 až 12 mesiacov odpredať túto platformu, aby zabránila jej zákazu v USA.",
      "Návrh zákona, ktorý je súčasťou balíka zahraničnej pomoci, prešiel politickou taktikou, čo podnietilo spoločnosť TikTok, aby oznámila právny nesúhlas, čo vyvolalo obavy z reakcie Číny.",
      "Generálny riaditeľ TikToku sa proti zákazu ohradzuje a označuje ho za umlčovanie prejavov používateľov, čo ešte viac zintenzívňuje diskusiu o budúcnosti platformy."
    ],
    "commentSummary": [
      "Prezident Biden podpísal návrh zákona, ktorý materskej spoločnosti TikTok, ByteDance, nariaďuje predať svoje prevádzky v USA, pričom sa odvoláva na obavy o národnú bezpečnosť v súvislosti s možným zneužívaním údajov čínskou vládou.",
      "Diskusie sa zameriavajú na mocenskú rovnováhu medzi USA a Čínou, zákony o ochrane osobných údajov, medzinárodné vzťahy a dôsledky zákazu TikToku vrátane obáv z čínskeho vplyvu, propagandy a manipulácie sociálnych médií.",
      "Prebiehajú diskusie o návykových algoritmoch v sociálnych médiách, kontrole obsahu zo zahraničia a spoločenských a bezpečnostných dôsledkoch toho, že TikTok je pod kontrolou čínskej vlády alebo je predaný americkým subjektom."
    ],
    "points": 702,
    "commentCount": 1428,
    "retryCount": 0,
    "time": 1713974395
  },
  {
    "id": 40150639,
    "title": "Letecké spoločnosti majú povinnosť vrátiť peniaze cestujúcim za prerušenie letu",
    "originLink": "https://abcnews.go.com/Politics/airlines-give-automatic-refunds-canceled-flights-delayed-3/story?id=109573733",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40150639",
    "commentBody": "",
    "originSummary": [
      "Ministerstvo dopravy zaviedlo nové pravidlá, ktoré leteckým spoločnostiam ukladajú povinnosť poskytovať peňažné náhrady za zrušené alebo výrazne meškajúce lety, ako aj za stratenú batožinu, ktorá nebola doručená do 12 hodín, s cieľom chrániť práva cestujúcich a zabrániť skrytým poplatkom.",
      "Letecké spoločnosti musia do šiestich mesiacov dodržiavať tieto nariadenia, čím sa zabezpečí, že zákazníci dostanú náhrady, na ktoré majú nárok, a letecké spoločnosti budú zodpovedné za svoje povinnosti.",
      "Cieľom tejto iniciatívy je zvýšiť ochranu zákazníkov a zabezpečiť transparentnosť politík v oblasti refundácie v leteckom priemysle."
    ],
    "commentSummary": [
      "Letecké spoločnosti sú pod drobnohľadom, pretože odmietajú vrátiť peniaze za zrušené alebo meškajúce lety, čím porušujú predpisy v USA a EÚ.",
      "Cestujúci, ktorí nie sú spokojní s poukážkami, podnikajú právne kroky, aby si zabezpečili oprávnené náhrady, čo vedie k diskusiám o tom, že v tomto odvetví sa uprednostňuje zisk pred spokojnosťou zákazníkov.",
      "Zdôrazňuje sa význam jasnejších a účinnejších predpisov leteckých spoločností na riešenie problémov, ako sú meškanie letov, nadmerné rezervácie, zmeškané prípoje a maloleté osoby bez sprievodu, pričom cestujúci sa delia o kontrastné skúsenosti."
    ],
    "points": 519,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1713997763
  },
  {
    "id": 40149095,
    "title": "Spoločnosť IBM kupuje spoločnosť HashiCorp za 6,4 miliardy dolárov",
    "originLink": "https://www.reuters.com/markets/deals/ibm-buy-hashicorp-64-billion-deal-expand-cloud-software-2024-04-24/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40149095",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Spoločnosť IBM sa chystá prevziať spoločnosť HashiCorp za 6,4 miliardy dolárov, čo vyvoláva obavy o inovácie, kultúru a finančné aspekty pre zamestnancov.",
      "Špekuluje sa o vplyve na produkty spoločnosti HashiCorp, ako sú Terraform a Nomad, pričom používatelia sa pýtajú na možné zmeny v udeľovaní licencií a budúcnosť produktov.",
      "Diskutuje sa o využívaní programovacích jazykov, ako sú Go a Rust, na spracovanie chýb a vývoj softvéru, ako aj o kritike konzultačnej divízie IBM, Kyndryl, a o rôznych názoroch na miesto IBM v technologickom sektore."
    ],
    "points": 466,
    "commentCount": 316,
    "retryCount": 0,
    "time": 1713990092
  },
  {
    "id": 40151952,
    "title": "Sila čítania za hranicami pamäti",
    "originLink": "https://blog.jim-nielsen.com/2024/you-are-what-you-read/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40151952",
    "commentBody": "",
    "originSummary": [
      "V článku sa zdôrazňuje, že vplyv čítania a konzumácie obsahu presahuje obyčajné zapamätanie, formuje naše myšlienky a správanie.",
      "Zdôrazňuje význam rozširovania nášho myslenia prostredníctvom čítania a selektívneho výberu obsahu.",
      "Zahrnutie osobných príbehov ilustruje trvalý vplyv vzdelávania na jednotlivca a zdôrazňuje trvalé účinky toho, čo čítame a čo sa učíme."
    ],
    "commentSummary": [
      "V článku sa skúma, ako na seba vzájomne pôsobia minulé skúsenosti, rozhodovanie a slobodná vôľa, pričom sa zdôrazňuje vplyv čítania, cestovania a prostredia na presvedčenie a správanie.",
      "Zdôrazňuje význam vedomého výberu online obsahu a vyvoláva filozofické otázky o vedomí, osobnom konaní a spoločenskom vplyve na rozhodovanie.",
      "Diskusia poskytuje pohľad na zložitú dynamiku formovania ľudského správania a identity a podnecuje k zamysleniu sa nad zložitosťou týchto procesov."
    ],
    "points": 416,
    "commentCount": 237,
    "retryCount": 0,
    "time": 1714006717
  },
  {
    "id": 40149136,
    "title": "IBM posilňuje platformu hybridného cloudu akvizíciou spoločnosti HashiCorp za 6,4 miliardy USD",
    "originLink": "https://newsroom.ibm.com/2024-04-24-IBM-to-Acquire-HashiCorp-Inc-Creating-a-Comprehensive-End-to-End-Hybrid-Cloud-Platform",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40149136",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť IBM kupuje spoločnosť HashiCorp za 6,4 miliardy dolárov s cieľom posilniť svoje schopnosti v oblasti správy viacerých cloudov a podporiť rast v strategických oblastiach vrátane vylepšenia svojej hybridnej cloudovej platformy.",
      "Automatizačné a bezpečnostné nástroje spoločnosti HashiCorp, ako napríklad Terraform, obohatia služby IBM a rozšíria jej prístup k podnikovým zákazníkom, pričom sa čaká na schválenie regulačnými orgánmi.",
      "Táto akvizícia je v súlade s cieľom spoločnosti IBM rozšíriť využívanie hybridného cloudu a umelej inteligencie s očakávaním zvýšenia príjmov a peňažných tokov."
    ],
    "commentSummary": [
      "Spoločnosť IBM kúpila spoločnosť HashiCorp, Inc. za 6,4 miliardy dolárov, čo viedlo k diskusiám o rastúcej angažovanosti IBM v oblasti softvéru s otvoreným zdrojovým kódom.",
      "Táto akvizícia vyvolala špekulácie o možných budúcich akvizíciách spoločnosti IBM v technologickom odvetví."
    ],
    "points": 351,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1713990286
  },
  {
    "id": 40147534,
    "title": "Keď sa objavovanie hudby zastaví: Objavovanie nových melódií po tridsiatke",
    "originLink": "https://www.statsignificant.com/p/when-do-we-stop-finding-new-music",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40147534",
    "commentBody": "",
    "originSummary": [
      "Článok sa zaoberá hudobnou stagnáciou a na základe analýzy údajov poukazuje na to, kedy jednotlivci zvyčajne prestávajú objavovať novú hudbu.",
      "Naše hudobné preferencie formujú faktory, ako sú generačné vplyvy a kompromis medzi objavovaním a využívaním, pričom výskumy naznačujú stagnáciu hudobného vkusu okolo 30. až 33. roku života v dôsledku prevahy možností a zmeny priorít.",
      "Pestovanie otvorenej mysle a aktívne vyhľadávanie novej hudby môže bojovať proti hudobnej paralýze a podporovať rovnováhu medzi objavovaním čerstvých skladieb a vychutnávaním si obľúbenej klasiky, ktorá prináša spokojnosť."
    ],
    "commentSummary": [
      "Účastníci diskutujú o obmedzeniach súčasných algoritmov na odporúčanie hudby a vymieňajú si skúsenosti s objavovaním novej a rozmanitej hudby.",
      "Kľúčovými témami sú vplyv streamovacích služieb, meniace sa trendy v hudobnom priemysle, osobné preferencie v oblasti hudobného vkusu a výzvy pri kategorizácii a odporúčaní hudby na základe individuálnych preferencií.",
      "Rozhovor sa zaoberá aj rasovou segregáciou v hudobnom priemysle, historickými vplyvmi na hudobné žánre a zdôrazňuje význam aktívneho objavovania novej hudby pre kultúrny a hudobný rast."
    ],
    "points": 309,
    "commentCount": 425,
    "retryCount": 0,
    "time": 1713981018
  },
  {
    "id": 40148563,
    "title": "Skúmanie rasových vzťahov a južanskej tradície v knihe Padgetta Powella \"Edisto",
    "originLink": "https://lithub.com/i-now-lack-the-juice-to-fuel-the-bluster-to-conceal-that-i-am-a-simpleton-padgett-powell-legend/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148563",
    "commentBody": "",
    "originSummary": [
      "\"Edisto\" od Padgetta Powella sa zaoberá dospievaním Simona Eversona Manigaulta na Juhu, pričom sa dotýka rasových vzťahov a rodinnej dynamiky.",
      "Powell vyzdvihuje využitie mladého rozprávača na poukázanie na absurditu rasovej integrácie, pričom reflektuje južanské literárne tradície a experimentálnu fikciu.",
      "Pasáž sa zaoberá výzvami moderného čitateľa, citlivými redaktormi, rasizmom a vývojom literárnej fikcie, ponúka pohľad na rôzne témy a možnosť podporiť Literárny Hub."
    ],
    "commentSummary": [
      "Článok sa venuje diskusiám, debatám a rozhovorom o jazyku, literatúre, rase a identite, pričom sa zaoberá témami, ako je výber slov, písanie veľkých písmen v pojmoch ako \"čierny\" a \"biely\" a vývoj štýlu prózy.",
      "Dotýka sa tiež konceptu verizmu a skúma rasizmus, etnickú identitu a zložitosti online diskurzu."
    ],
    "points": 300,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1713987140
  },
  {
    "id": 40146088,
    "title": "Snehové vločky Arctic: Najväčší otvorený model 128x3B MoE",
    "originLink": "https://replicate.com/snowflake/snowflake-arctic-instruct",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40146088",
    "commentBody": "",
    "originSummary": [
      "Ukážková aplikácia Readme umožňuje používateľom komunikovať s Arktídom, modelom hybridného transformátora AI s hustým MoE, ktorý vytvoril výskumný tím Snowflake AI.",
      "Kontrolné body modelu Arctic sú prístupné pod licenciou Apache-2.0 pre základnú verziu aj verziu vyladenú podľa pokynov, čo podporuje výskum, vytváranie prototypov a používanie produktov.",
      "Úložisko Github spoločnosti Snowflake Arctic ponúka doplnkové materiály, ako sú návody a kuchárske knihy na využitie výkonného modelu s 480 miliardami parametrov, ktorý kombinuje 10 miliardový hustý transformátor s masívnym MLP s rozlíšením 128x3,66 miliardy MoE."
    ],
    "commentSummary": [
      "Diskusie v technickom priemysle sa zameriavajú na modely umelej inteligencie, ako sú Snowflake Arctic a Llama-3, pričom sa zdôrazňujú vplyvy na životné prostredie, výzvy v oblasti kvality a otázky hospodárskej súťaže.",
      "Dôraz na výhody a nevýhody modelov AI, nedostatok pozitívnej návratnosti investícií na niektorých trhoch a význam otvoreného poskytovania tréningových údajov pre skutočné modely s otvoreným zdrojovým kódom.",
      "Prednášky zahŕňajú modely MOE na odvodzovanie CPU, vývoj taktovacej frekvencie CPU a diskusie o reprodukovateľnosti modelov a zhode s otvoreným zdrojovým kódom s dôrazom na dôsledky a etické otázky v aplikáciách umelej inteligencie."
    ],
    "points": 284,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1713974978
  },
  {
    "id": 40147883,
    "title": "Vylepšený nástroj Front-End pre funkciu Drag-and-Drop",
    "originLink": "https://github.com/atlassian/pragmatic-drag-and-drop",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40147883",
    "commentBody": "",
    "originSummary": [
      "Pragmatic drag and drop je všestranný súbor nástrojov na jednoduché pridávanie funkcií drag and drop do webových aplikácií, ktoré sa používajú v produktoch ako Trello, Jira a Confluence.",
      "Kód je verejne dostupný pod menným priestorom @atlaskit na npm, ale príspevky sa momentálne neprijímajú, pričom voliteľné balíky sa dajú ľahko zameniť za knižnice štýlov a zobrazení.",
      "Integruje sa s rôznymi návrhovými systémami a programovými jazykmi, pričom stojí na spolupráci mnohých ľudí v spoločnosti Atlassian."
    ],
    "commentSummary": [
      "V príspevku sa hodnotia výhody a nevýhody knižníc komponentov typu drag-and-drop so zameraním na problémy s prístupnosťou na mobilných zariadeniach, pričom sa uvádzajú knižnice react-beautiful-dnd a dndkit.",
      "Poukazuje na problémy s implementáciou drag-and-drop pre zložité rozhrania kartových hier a odporúča na takéto úlohy Pragmatic drag-and-drop a SortableJS.",
      "Používatelia zdieľajú frustráciu z funkcií drag-and-drop na dotykových zariadeniach vrátane problémov s výkonom systému Jira a ťažkostí s využívaním týchto funkcií na mobilných platformách."
    ],
    "points": 279,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1713983127
  },
  {
    "id": 40143814,
    "title": "Spoločnosť Mondragón Corporation: Popredné priemyselné družstvo",
    "originLink": "https://www.theguardian.com/lifeandstyle/2024/apr/24/in-the-us-they-think-were-communists-the-70000-workers-showing-the-world-another-way-to-earn-a-living",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40143814",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Mondragón Corporation v Španielsku je najväčším priemyselným družstvom na svete, ktoré má 70 000 zamestnancov - vlastníkov, ktorí sa podieľajú na zisku a riadia sa ľudským étosom ovplyvneným katolicizmom a Rochdale Pioneers.",
      "Napriek prekážkam sa spoločnosti Mondragón darí, pretože kladie dôraz na demokratickú organizáciu, mzdovú solidaritu a sociálnu zodpovednosť a udržiava si konkurencieschopnosť na trhu.",
      "Tento družstevný model vzbudil záujem na medzinárodnej úrovni a ponúka potenciálnu alternatívu ku konvenčným kapitalistickým obchodným rámcom."
    ],
    "commentSummary": [
      "V diskusii sa skúmajú výhody a nevýhody družstiev vlastnených zamestnancami na príklade spoločnosti Mondragón v Baskicku.",
      "Skúmajú sa rôzne typy družstiev, ich vplyv na rôzne odvetvia a kontrast medzi družstvami vo vlastníctve zákazníkov a vo vlastníctve zamestnancov.",
      "Témy zahŕňajú rozdiely medzi socializmom a kapitalizmom, efektívnosť podnikov vlastnených zamestnancami a dôsledky zvyšovania miezd pre zamestnancov, čím sa objasňuje zložitá povaha modelov vlastníctva a ekonomických ideológií."
    ],
    "points": 277,
    "commentCount": 274,
    "retryCount": 0,
    "time": 1713963486
  },
  {
    "id": 40143669,
    "title": "Faer-rs: Efektívna lineárna algebra v jazyku Rust",
    "originLink": "https://github.com/sarah-ek/faer-rs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40143669",
    "commentBody": "",
    "originSummary": [
      "Faer je skript Rust zameraný na prenosné, korektné a výkonné operácie lineárnej algebry, ktorý ponúka vysokoúrovňové obaly pre maticové úlohy, ako je násobenie a inverzia.",
      "Porovnávacie údaje ukazujú jej výkonnosť v porovnaní s inými knižnicami, ako sú ndarray a nalgebra, s meraním časovania pre rôzne metódy rozkladu a operácie s maticami.",
      "Príspevky sú vítané prostredníctvom servera Discord, pričom časové porovnania demonštrujú vyšší výkon pre väčšie matice a hermitovské výpočty pri výpočtoch rozkladu vlastných čísel."
    ],
    "commentSummary": [
      "V diskusii na GitHube sa rozoberá nedostatok zdieľaných zdrojov a kódu v knižniciach Rust pre matice a polia, ako sú ndarray, nalgebra a faer, pričom faer-rs vyniká v benchmarkoch LU rozkladu.",
      "Zaoberá sa témami, ako je predpodmienenie v numerických výpočtoch, optimalizácia BLIS a obavy týkajúce sa kľúčového slova auto vo vlastnom benchmarkingu.",
      "Viacvláknové benchmarky ukazujú, že Faer v porovnaní s MKL prekonáva OpenBLAS, využíva Rayon na paralelizmus a konkuruje knižniciam ako fastdiv a good_lp, čo zdôrazňuje význam efektívneho kódu a spolupráce pri presnosti benchmarkov."
    ],
    "points": 211,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1713962469
  },
  {
    "id": 40148707,
    "title": "Detská krátkozrakosť: Globálna epidémia na vzostupe",
    "originLink": "https://theconversation.com/nearsightedness-is-at-epidemic-levels-and-the-problem-begins-in-childhood-225255",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148707",
    "commentBody": "",
    "originSummary": [
      "Krátkozrakosť alebo krátkozrakosť je na celom svete na vzostupe a odhaduje sa, že do roku 2050 bude okuliare potrebovať polovica svetovej populácie.",
      "Nárast krátkozrakosti súvisí s nárastom času stráveného pri obrazovke a znížením času stráveného vonku, čo zdôrazňuje význam včasného odhalenia a korekcie zraku na zastavenie jej rozvoja.",
      "Podporovanie aktivít na čerstvom vzduchu a pravidelné prestávky v práci zblízka môžu pomôcť zmierniť alebo oddialiť rozvoj krátkozrakosti."
    ],
    "commentSummary": [
      "Nárast krátkozrakosti, najmä u detí, súvisí s nedostatočným vystavením prirodzenému svetlu, čo vyvoláva diskusie o používaní korekčných šošoviek na zastavenie jej vývoja.",
      "Odporúčania sa pohybujú od podpory okuliarov až po pochybnosti o ich účinnosti, zatiaľ čo na obmedzenie progresie krátkozrakosti sa navrhujú napríklad atropínové kvapky a aktivity vonku.",
      "Diskutuje sa o genetických predispozíciách, environmentálnych faktoroch a o význame včasného vyšetrenia zraku a vzdelávania v boji proti rastúcemu počtu krátkozrakých."
    ],
    "points": 204,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1713987887
  },
  {
    "id": 40146505,
    "title": "Spoločnosť Stainless predstavila generátor SDK pre integráciu API",
    "originLink": "https://www.stainlessapi.com/blog/announcing-the-stainless-sdk-generator",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40146505",
    "commentBody": "",
    "originSummary": [
      "Spoločnosť Stainless spustila generátor SDK, ktorý uľahčuje vývoj klientskych knižníc pre známe rozhrania API, ako sú OpenAI a Cloudflare, čím vývojárom zjednodušuje proces integrácie.",
      "Nástroj automatizuje generovanie a údržbu SDK v rôznych programovacích jazykoch, čím zvyšuje efektivitu a spoľahlivosť integrácie API.",
      "Iniciatíva spoločnosti Stainless je zameraná na zlepšenie ekosystému REST tým, že umožňuje vytvárať vysokokvalitné, typovo bezpečné rozhrania API a ponúka SDK Studio na identifikáciu a riešenie problémov pred vydaním."
    ],
    "commentSummary": [
      "Nerezový generátor SDK automatizuje údržbu verejných jazykových väzieb API, čím zvyšuje kvalitu SDK a šetrí čas inžinierov.",
      "Rieši problémy, ktoré sa vyskytujú pri správe viacerých SDK, zabraňuje rozdielom oproti pôvodnému API a zefektívňuje vývoj.",
      "Nerez je chválený pre svoju používateľskú prívetivosť, prispôsobiteľnosť a potenciál na zvýšenie interoperability, čo ho stavia do pozície najlepšej voľby na vytváranie SDK."
    ],
    "points": 203,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1713976475
  },
  {
    "id": 40148833,
    "title": "Dedičstvo strán LAN: Nostalgia a spoločný herný zážitok",
    "originLink": "https://aftermath.site/lan-party-merritt-k-book-read-only-memory-rom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40148833",
    "commentBody": "",
    "originSummary": [
      "Článok a kniha sa zaoberajú rozkvetom a úpadkom LAN párty, na ktorých sa hráči stretávali na lokálnej úrovni, aby si zahrali hry pre viacerých hráčov ešte pred rozšírením vysokorýchlostného internetu.",
      "Rozoberá kultúrny význam a sociálne aspekty LAN párty a porovnáva ich s prechodom k online hrám a službám na vyhľadávanie partnerov.",
      "Spomína sa technologický pokrok v oblasti hier a vplyv kultúrnych trendov, ako sú anime a nu metal, pričom sa zdôrazňuje nostalgia za osobným prepojením a komunitným pocitom raných hier v porovnaní s dnešnou spoločnosťou založenou na technológiách."
    ],
    "commentSummary": [
      "Článok skúma rozkvet a úpadok LAN párty koncom 90. rokov a začiatkom nového tisícročia, pričom sa zameriava na ducha komunity, zdieľanie technických znalostí a nostalgiu, ktorú účastníci zažívali.",
      "Diskutuje o obavách rodičov týkajúcich sa online bezpečnosti detí a o tom, ako sa v priebehu času vyvíjali LAN párty v rámci hernej komunity.",
      "Používatelia spomínajú na obľúbené hry, problémy s pripojením a pretrvávajúcu príťažlivosť LAN párty napriek technologickému pokroku."
    ],
    "points": 199,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1713988600
  }
]
