[
  {
    "id": 42057647,
    "title": "டிரம்ப் இரண்டாவது முறையாக ஜனாதிபதியாக வெற்றி பெறுகிறார்",
    "originLink": "https://thehill.com/homenews/campaign/4969061-trump-wins-presidential-election/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057647",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். டிரம்ப் இரண்டாவது முறை ஜனாதிபதி பதவியைப் பெறுகிறார், இது பொருளாதார கொள்கைகள் மற்றும் ஜனநாயக உத்திகள் குறித்து விவாதங்களைத் தூண்டுகிறது.- விமர்சகர்கள், பொருளாதார பிரச்சினைகளைச் சரியாக எதிர்கொள்ள ஜனநாயகர்கள் போராடியதாகவும், இது வாக்காளர் அதிருப்திக்கு காரணமாக இருந்ததாகவும் கூறுகின்றனர்.- தேர்தல் முடிவு எதிர்கால கொள்கைகள் குறித்து கேள்விகளை எழுப்புகிறது, குறிப்பாக பணவீக்கம், பிரச்சார செய்தி மற்றும் சுற்றுச்சூழல் மற்றும் பொருளாதார தாக்கங்கள் தொடர்பாக."
    ],
    "points": 1307,
    "commentCount": 5721,
    "retryCount": 0,
    "time": 1730875789
  },
  {
    "id": 42057431,
    "title": "பயனுள்ள உட்பொதிக்கப்பட்ட macOS கட்டளை வரி பயன்பாடுகள்",
    "originLink": "https://weiyen.net/articles/useful-macos-cmd-line-utilities",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057431",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "TEXT: macOS பல்வேறு உட்பொதிக்கப்பட்ட கட்டளை வரி பயன்பாடுகளை வழங்குகிறது, அவை உற்பத்தித்திறன் மற்றும் அமைப்பு மேலாண்மையை மேம்படுத்துகின்றன, `afconvert` ஆடியோ மாற்றத்திற்கும், `diskutil` சேமிப்பு மேலாண்மைக்கும் உதவுகின்றன.- `open`, `caffeinate`, மற்றும் `sips` போன்ற கருவிகள் முறையே பயன்பாடுகளை துவக்க, தூக்கத்தைத் தடுக்க, மற்றும் படங்களை செயலாக்க உதவுகின்றன, அதேசமயம் `pbcopy` மற்றும் `pbpaste` கிளிப்போர்டு பணிகளை நிர்வகிக்கின்றன.- மேம்பட்ட பயன்பாடுகளில் `pmset` மின்சார அமைப்புகளுக்காக, `networkQuality` இணைய வேக சோதனைகளுக்காக, `say` உரை குரலாக்கத்திற்காக, மற்றும் `mdfind` கோப்பு தேடலுக்காக உள்ளன, முழுமையான அமைப்பு கட்டுப்பாடு மற்றும் செயல்பாட்டை வழங்குகின்றன."
    ],
    "points": 557,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730872300
  },
  {
    "id": 42054449,
    "title": "ஏஎம்டி, தரவுக்கூடம் துறையில் இன்டெலுக்கு மேல் விற்பனை செய்கிறது",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054449",
    "commentBody": "",
    "originSummary": [
      "ஏஎம்டி, டேட்டாசெண்டர் சிபியூ விற்பனையில் முதல்முறையாக இன்டெலை முந்தியுள்ளது, ஏஎம்டியின் வருவாய் Q3 இல் $3.549 பில்லியனாக உயர்ந்து, இன்டெலின் $3.3 பில்லியனை மிஞ்சியுள்ளது.",
      "இந்த சாதனை AMD இன் போட்டித் திறனுள்ள EPYC செயலிகளுக்கு சொந்தமானது, அவை Intel இன் Xeon CPU களை விட மேல் செயல்திறன் கொண்டதாக உள்ளன.",
      "AMD இன் வெற்றியை அடுத்து, Nvidia தரவுத்தள சந்தையில் முன்னணி நிலையைத் தக்கவைத்துள்ளது, அதன் AI GPUக்கள் மற்றும் நெட்வொர்க் தயாரிப்புகள் குறிப்பிடத்தக்க அளவில் அதிக விற்பனையை உருவாக்குகின்றன, இதில் Q2 FY2025 இல் கணினி GPU விற்பனை $22.604 பில்லியன் அடைந்துள்ளது."
    ],
    "commentSummary": [
      "ஏஎம்டி டேட்டாசெண்டர் விற்பனையில் இன்டெலை முந்தியுள்ளது, இது ஒரு முக்கிய தொழில் மாற்றத்தையும் ஏஎம்டியின் வளர்ந்துவரும் செல்வாக்கையும் குறிக்கிறது.",
      "இந்த மாற்றம் AMD இன் EPYC செயலிகளுக்கு காரணமாகும், அவை தங்கள் செயல்திறன் மற்றும் திறமைக்காக விரும்பப்படுகின்றன, இது சேவையக தர செயலி மேம்பாடுகளில் AMD இன் மூலோபாய முன்னேற்றங்களை பிரதிபலிக்கிறது.",
      "இந்த மாற்றம், நிறுவனங்கள் பாரம்பரியமாக எச்சரிக்கையுடன் மேம்படுத்தும் சுழற்சிகளை பின்பற்றினாலும், அவர்கள் படிப்படியாக ஏஎம்டி தீர்வுகளை ஏற்றுக்கொள்வதால், தங்கள் சந்தை ஆதிக்கத்தை தக்கவைத்துக்கொள்ள இண்டெல் எதிர்கொள்ளும் சவால்களை வலியுறுத்துகிறது."
    ],
    "points": 450,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1730834835
  },
  {
    "id": 42056923,
    "title": "திரைப்படங்களில் தலைப்பு காட்சிகள்",
    "originLink": "https://www.titledrops.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056923",
    "commentBody": "",
    "originSummary": [
      "\"தங்களை முழுமையாக நிரப்பியவர்கள்\" என்பது டொமினிகஸ் பவூர் மற்றும் அலிஸ் துட்ட் ஆகியோரின் ஒரு ஆய்வு ஆகும், இதில் திரைப்படங்களில் தலைப்பு கைவிடல்கள் எவ்வாறு நிகழ்கின்றன என்பதை ஆய்வு செய்கின்றனர், அங்கு கதாபாத்திரங்கள் திரைப்படத்தின் தலைப்பை குறிப்பிடுகின்றனர். - இந்த ஆராய்ச்சி 80 ஆண்டுகளில் 73,921 திரைப்படங்களை உள்ளடக்கியது, 36.5% திரைப்படங்களில் குறைந்தது ஒரு தலைப்பு கைவிடல் இடம்பெறுகிறது, ஒரு திரைப்படத்திற்கு சராசரியாக 10.3 கைவிடல்கள் உள்ளன. - இந்த ஆய்வு காலப்போக்கில் உள்ள போக்குகளை, கதாபாத்திர பெயரிடப்பட்ட திரைப்படங்களின் தாக்கத்தை, தலைப்பு கைவிடல்கள், திரைப்படத்தின் தரம் மற்றும் வகை ஆகியவற்றின் தொடர்பை ஆய்வு செய்கிறது, மேலும் ஆராய்ச்சிக்காக முழு தரவுத்தொகுப்பு கிடைக்கிறது."
    ],
    "commentSummary": [
      "திரைப்படங்களில் தலைப்பு குறைதல்கள் என்பது ஒரு கதாபாத்திரம் திரைப்படத்தின் தலைப்பை படத்தின் போது குறிப்பிடும் போது ஏற்படும், இது titledrops.net இல் பகுப்பாய்வு செய்யப்படும் ஒரு கருத்தாகும்.",
      "விவாதங்கள் மற்றும் எடுத்துக்காட்டுகள் ஆகியவற்றை இந்த பகுப்பாய்வு உள்ளடக்கியுள்ளது, அதில் \"It\" போன்ற பொதுவான சொற்கள் தலைப்பு கைவிடலாகக் கருதப்பட வேண்டுமா என்பதையும், கதாபாத்திரங்களின் பெயர்களால் அழைக்கப்படும் திரைப்படங்கள் ஏற்படுத்தும் சவால்களையும் உள்ளடக்கியுள்ளது.",
      "கட்டுரை மேலும் தலைப்பு கைவிடுதல்களை வெவ்வேறு மொழிகள் மற்றும் சூழல்களில் புரிந்து கொள்ள மொழிபெயர்ப்பு மற்றும் விளக்கத்தின் சிக்கல்களைப் பற்றியும் விவரிக்கிறது."
    ],
    "points": 406,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730861286
  },
  {
    "id": 42057036,
    "title": "டிராக்கர் பீப்பர் (2022)",
    "originLink": "https://berthub.eu/articles/posts/tracker-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057036",
    "commentBody": "",
    "originSummary": [
      "ஒரு கருவி உருவாக்கப்பட்டது, இது ஒரு கணினி கூகுளுக்கு தரவை அனுப்பும் ஒவ்வொரு முறையும் ஒரு பீப் ஒலிக்கிறது, பயனர் ஒப்புதல் இல்லாமல் தரவின் பரிமாற்றத்தின் அடிக்கடி நிகழ்வுகளை வெளிப்படுத்துகிறது.- இந்த கருவி பெரும் கவனத்தை பெற்றது, ஒரு வீடியோ விளக்கம் ஒரு வாரத்தில் ஒரு மில்லியன் பார்வைகளை அடைந்தது, இது ஃபேஸ்புக் மற்றும் பிற டிராக்கர்களுக்கு விரிவான ஆதரவை ஏற்படுத்தியது.- தற்போது லினக்ஸ், ஓஎஸ்எக்ஸ் மற்றும் பிஎஸ்டி க்கான பதிப்புகள் கிடைக்கின்றன, எதிர்கால திட்டங்களில் ஆப்பிள், விண்டோஸ், ஐஓஎஸ் மற்றும் ஆண்ட்ராய்டு பதிப்புகள் மற்றும் போன்கள் மற்றும் டேப்லெட்களில் டிராக்கர் செயல்பாட்டை கேட்கக்கூடிய வகையில் WiFi ஐப் பயன்படுத்தி நேரடி விளக்கம் அடங்கும்."
    ],
    "commentSummary": [
      "டிராக்கர் பீப்பர் (2022) என்பது கூகிள் போன்ற நிறுவனங்களுக்கு ஒவ்வொரு தரவுப் பரிமாற்றத்தையும் ஒலியால் சுட்டிக்காட்டும் ஒரு திட்டமாகும், இது தரவுப் பின்தொடரலின் அடிக்கடி நிகழ்வுகளைப் பற்றிய விழிப்புணர்வை ஏற்படுத்துகிறது. - இந்த திட்டம் தனியுரிமை கவலைகள், தகவலை ஒலியால் வெளிப்படுத்தும் சோனிபிகேஷன் நன்மைகள், மற்றும் ஒலியுடன் கூடிய பழைய கணினி சூழலுக்கான நினைவுகளைப் பற்றிய விவாதங்களைத் தூண்டுகிறது. - பயனர்களிடமிருந்து வரும் பரிந்துரைகள், தேவையற்ற தரவுக் கோரிக்கைகளைத் தடுக்க Pi-hole போன்ற கருவிகளைப் பயன்படுத்துவது மற்றும் தனியுரிமைக்கு உகந்த தொழில்நுட்பத்தை எளிதில் அணுகக்கூடியதாக மாற்றுவதற்கான ஆதரவை உள்ளடக்கியவை."
    ],
    "points": 360,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1730863269
  },
  {
    "id": 42057851,
    "title": "புதிய யூபிடர் படங்கள்",
    "originLink": "https://www.missionjuno.swri.edu/junocam/processing?source=all&ob_from=2024-10-01&ob_to=2024-11-01&phases%5B%5D=PERIJOVE+66&perpage=16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057851",
    "commentBody": "",
    "originSummary": [
      "JunoCam படத்தொகுப்பு JunoCam இல் இருந்து மூல படங்களை பொது பதிவிறக்கத்திற்காக வழங்குகிறது, இது பயனர்களுக்கு தங்கள் படைப்புகளை செயலாக்கி பகிர அனுமதிக்கிறது.",
      "குடிமக்கள் விஞ்ஞானிகள் படத்தை செயலாக்கத்தில் பங்கேற்க ஊக்குவிக்கப்படுகிறார்கள், யூபிடரின் கதிர்வீச்சு மூலம் ஏற்படும் சவால்களை எதிர்கொள்ளும் போதிலும், அறிவியல் அறிக்கைகள் மற்றும் கலை நிகழ்ச்சிகளுக்கு பங்களிக்கின்றனர்.",
      "கேலரியில் மூல மற்றும் செயலாக்கப்பட்ட படங்கள் இரண்டும் அடங்கும், வடிகட்டும் விருப்பங்களுடன் கிடைக்கின்றன, இது வியாழன் மற்றும் அதன் நிலவுகளை ஆராய்வதற்கான அழைப்பாக உள்ளது."
    ],
    "commentSummary": [
      "நாசாவின் ஜூனோ மிஷனில் இருந்து கிடைத்த புதிய படங்கள், வலைதள விவாதங்களை உருவாக்கி, வியாழன் கிரகத்தின் வண்ணமயமான மற்றும் இயக்கமிக்க வானிலை அமைப்பை வெளிப்படுத்துகின்றன.",
      "ஜூனோ, 2011 இல் ஏவப்பட்டு 2016 முதல் வியாழன் கிரகத்தைச் சுற்றி வருகிறது, ஆரம்பத்தில் கேமரா இல்லாமல் இருந்தது, ஆனால் கல்வி நோக்கங்களுக்காக ஒன்று சேர்க்கப்பட்டது, இப்போது அறிவியல் ஆய்வில் உதவுகிறது.",
      "இந்த மிஷன் விண்வெளி ஆராய்ச்சியில் உள்ள சவால்களை, radiation மற்றும் எரிபொருள் தேவைகளை போன்றவற்றை முன்னிலைப்படுத்துகிறது, அதேசமயம் பொது ஆர்வம் மற்றும் கல்வியில் ஈர்க்கும் காட்சிகளின் பங்கையும் வலியுறுத்துகிறது."
    ],
    "points": 323,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1730878237
  },
  {
    "id": 42056918,
    "title": "98.css – பழைய பயனர் இடைமுகங்களின் உண்மையான மறுபிரதிகளை உருவாக்க ஒரு வடிவமைப்பு முறைமை",
    "originLink": "https://jdan.github.io/98.css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056918",
    "commentBody": "",
    "originSummary": [
      "98.css என்பது Windows 98 தோற்றத்தை ஒத்திருக்கும் பயனர் இடைமுகங்களை உருவாக்க வடிவமைக்கப்பட்ட CSS நூலகமாகும், இது அர்த்தமுள்ள HTML மற்றும் அணுகல் திறனை முக்கியமாகக் கொண்டுள்ளது. - இந்த நூலகம் JavaScript-இல் இருந்து விடுபட்டது, எந்த முன்னணி கட்டமைப்புடனும் இணக்கமாக இருக்கும், மேலும் unpkg மூலம் இறக்குமதி செய்யப்படலாம் அல்லது npm மூலம் நிறுவப்படலாம். - இது பொத்தான்கள், சரிபார்ப்பு பெட்டிகள், மற்றும் ஸ்லைடர்கள் போன்ற பல்வேறு கூறுகளை வழங்குகிறது, மேலும் MIT உரிமத்தின் கீழ் திறந்த மூலமாக உள்ளது, GitHub இல் பங்களிப்புகள் ஊக்குவிக்கப்படுகின்றன."
    ],
    "commentSummary": [
      "98.css என்பது பழமையான பயனர் இடைமுகங்களை மீண்டும் உருவாக்குவதற்கான ஒரு வடிவமைப்பு அமைப்பு ஆகும், இது Windows 3.11 முதல் Mac OS 9 வரை உள்ள தீம்களை கொண்டுள்ளது மற்றும் உயர் தீர்மான திரைகளுக்கான அளவிடக்கூடிய வெக்டார் கிராஃபிக்ஸ் (SVG) ஐகான்களை உள்ளடக்கியது.",
      "TEXT: இந்த திட்டம் அதன் எளிமை மற்றும் நினைவூட்டும் கவர்ச்சி காரணமாக பாராட்டப்படுகிறது, ஆனால் சில பயனர்கள் எழுத்துரு காட்சியமைப்பில் சிக்கல்கள் இருப்பதாக அறிவித்துள்ளனர்.",
      "இது பயனர் இடைமுக வடிவமைப்பில் விவாதங்களை தூண்டியுள்ளது, குறிப்பாக XP.css மற்றும் 7.css போன்ற பிற திட்டங்களைப் போலவே பழைய இடைமுகங்களின் தெளிவு மற்றும் எளிமை மீது குறிப்பிடத்தக்க ஆர்வத்தை ஏற்படுத்தியுள்ளது."
    ],
    "points": 285,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1730861218
  },
  {
    "id": 42055979,
    "title": "மொசில்லா தனது ஆதரவு பிரிவை நீக்குகிறது",
    "originLink": "https://www.theverge.com/2024/11/5/24289124/mozilla-foundation-layoffs-advocacy-global-programs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055979",
    "commentBody": "",
    "originSummary": [
      "Mozilla அதன் பணியாளர்களை அக்டோபர் மாத இறுதியில் 30% குறைத்துள்ளது, இது ஒரு இலவச மற்றும் திறந்த வலைவை மேம்படுத்தும் அதன் ஆதரவு பிரிவை பாதிக்கிறது.",
      "இது 2023 இல் இரண்டாவது முறையாக பணிநீக்கம் செய்யப்படுவதை குறிக்கிறது, இதற்கு முன் பிப்ரவரியில் ஒரு குறைப்பு நடந்தது, சமீபத்திய குறைப்புகளுக்கு முன்பு அறக்கட்டளையில் சுமார் 120 ஊழியர்கள் இருந்தனர்.",
      "பணிநீக்கங்களுக்குப் பிறகும், மொசில்லா தனது பணி முக்கியமான பகுதியாக வாதாடல் தொடர்கிறது என்று வலியுறுத்துகிறது, எதிர்கால இலக்குகளை அடைய கவனம் மற்றும் கடினமான முடிவுகள் அவசியம் என்பதை நிர்வாக இயக்குநர் நபியா சயீத் குறிப்பிடுகிறார்."
    ],
    "commentSummary": [
      "மொசில்லா தனது ஆதரவு பிரிவை குறைக்கிறது, இது கூகுளிலிருந்து எதிர்பார்க்கப்படும் குறைந்த தேடல் வருவாய் மற்றும் தொழில்நுட்ப சட்டம் மற்றும் செயற்கை நுண்ணறிவு மாற்றங்களால் சுமார் 36 வேலைகளை பாதிக்கக்கூடும்.",
      "இந்த முடிவு, முக்கியமான தளங்களின் கீழ் இணையம் மேலும் மையமயமாகும் போது, மொசில்லாவின் ஆதரவின் செயல்திறனைப் பற்றிய விவாதங்களைத் தூண்டுகிறது.",
      "Mozilla தனது உலாவியை மேம்படுத்துவதற்கு முன்னுரிமை கொடுக்க வேண்டும் என்பதே ஒரு பரிந்துரை ஆகும், அதற்கு பதிலாக ஆதரவு முயற்சிகளை முன்னெடுக்க வேண்டும்."
    ],
    "points": 211,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1730847885
  },
  {
    "id": 42058309,
    "title": "ஒலி சிக்னல்களுடன் உள்ள செல்வாக்காளர்கள் தரவுத்தளம்",
    "originLink": "https://old.reddit.com/r/cursor/comments/1gku61m/i_created_this_app_in_two_weekends_with_cursor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42058309",
    "commentBody": "",
    "originSummary": [
      "TEXT: ஒரு புதிய செயலி இரண்டு வார இறுதிகளில் Cursor பயன்படுத்தி உருவாக்கப்பட்டது, TikTok க்கான விரிவான செல்வாக்காளர் தரவுத்தொகுப்பை வழங்குவதன் மூலம் மாதாந்திர மறு வருவாய் (MRR) $1,000 ஐ அடைந்தது.- இந்த செயலி TikTok ஐ சேகரித்து வீடியோக்களை பகுப்பாய்வு செய்கிறது, மேம்பட்ட வடிகட்டிகள், வீடியோ ஆடியோ பதிவிறக்கங்கள், மற்றும் விளம்பர வகைகள், முக்கிய வார்த்தைகள், மற்றும் தயாரிப்புகள் பற்றிய தரவுகளை எடுக்கும் அம்சங்களை வழங்குகிறது.- இது தற்போது சுமார் 570,000 செல்வாக்காளர்களை உள்ளடக்கியுள்ளது, போட்டியாளர் பகுப்பாய்வு மற்றும் செல்வாக்காளர் அணுகலை உதவுகிறது, மேலும் மேம்பாட்டிற்காக கருத்துக்களையும் சோதனையாளர்களையும் தேடுகிறது."
    ],
    "commentSummary": [
      "TEXT: இரண்டு வார இறுதிகளில் TikTok ஐ ஸ்கிரேப் செய்து, இன்ஃப்ளூயன்சர்களின் தரவுத்தொகுப்பை உருவாக்க புதிய செயலி உருவாக்கப்பட்டது, இது மாதாந்திர மறு வருவாய் (MRR) $1,000 ஐ அடைந்தது.- இந்த செயலி வீடியோக்களை பகுப்பாய்வு செய்து, தரவுகளை எடுத்து, பயனர்கள் உரை மற்றும் வகைகள் மூலம் வடிகட்ட அனுமதிக்கிறது, விளம்பர வகைகள், முக்கிய வார்த்தைகள் மற்றும் தயாரிப்புகளை அடையாளம் காண ஆடியோ செயலாக்கத்தையும் உள்ளடக்கியது.- தற்போதைய தரவுத்தொகுப்பில் சுமார் 570,000 இன்ஃப்ளூயன்சர்கள் உள்ளனர், போட்டியாளர்களின் இன்ஃப்ளூயன்சர்களை பகுப்பாய்வு செய்யும் கருவிகளை வழங்குகிறது மற்றும் குறிப்பிட்ட நிசங்களுக்கு ஏற்றவைகளை கண்டுபிடிக்க, சரிபார்க்கப்பட்ட மின்னஞ்சல்களுடன் வழங்குகிறது."
    ],
    "points": 206,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1730883795
  },
  {
    "id": 42056420,
    "title": "அமெரிக்காவில் வெறும் 5.3% வெல்டர்கள் பெண்கள். பல ஆண்டுகள் பேராசிரியராக இருந்த பிறகு, நான் ஒருவராக ஆனேன்",
    "originLink": "https://theconversation.com/only-5-3-of-welders-in-the-us-are-women-after-years-as-a-writing-professor-i-became-one-heres-what-i-learned-240431",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056420",
    "commentBody": "",
    "originSummary": [
      "பெண்கள் அமெரிக்காவில் வெல்டர்களில் 5.3% மட்டுமே உள்ளனர், இது இந்த துறையில் ஒரு முக்கிய பாலின வேறுபாட்டை வெளிப்படுத்துகிறது.",
      "தமிழில் எழுத வேண்டும். 2017 முதல் 2022 வரை, தொழில்களில் உள்ள பெண்களின் எண்ணிக்கை 47% அதிகரித்துள்ளது, இது தொடர்ந்த சவால்கள் இருந்தபோதிலும் அதிகரிக்கும் ஆர்வத்தையும் பங்கேற்பையும் குறிக்கிறது.",
      "பெண்கள் தொழில்களில் எதிர்கொள்ளும் சவால்களில் உடல் உழைப்பு மற்றும் பாலின பாகுபாடு அடங்கும், மேலும் தொழிலாளிப் பெண்கள் அடிக்கடி கண்காணிப்பு மற்றும் விரும்பாத கருத்துக்களை எதிர்கொள்கிறார்கள்."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். கட்டுரை வெல்டிங் தொழிலில் பெண்களின் குறைந்த சதவீதத்தைப் பற்றி விவரிக்கிறது, அமெரிக்க வெல்டர்களில் 5.3% மட்டுமே பெண்கள் உள்ளனர், மேலும் பாலின தடைகளை விட வர்க்கத் தடைகளை அதிகமாகக் குறிப்பிடுகிறது.",
      "இது, ஆண்-பெண் தொடர்புகளைப் பொறுத்தவரை, தொழிலாளர் வர்க்கக் சமூகங்கள், பரிசுத்தமாக்கும் பழக்கமுள்ள கல்வியியல் துறையை விட அதிகமாக ஏற்றுக்கொள்ளக்கூடும் என்பதை முன்வைக்கிறது.",
      "பெரிய பிரச்சினையான பாலினச்சார்பின்மை மற்றும் வேலைநிலையியல் குறித்து பேசப்படுகிறது, இதில் சவால்கள் பெண்களுக்கு மட்டும் அல்லாமல் அலுவலகத்திலிருந்து உடல் உழைப்பு சூழலுக்கு மாறும் பண்பாட்டுக்கு ஏற்ப ஏற்படுகின்றன என்பதே வாதமாக உள்ளது."
    ],
    "points": 189,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1730852688
  },
  {
    "id": 42054813,
    "title": "ஏன் நிறுவனங்கள் மேகத்தை விட்டு விலகுகின்றன: மேக மறுபதிவின் எழுச்சி",
    "originLink": "https://thenewstack.io/why-companies-are-ditching-the-cloud-the-rise-of-cloud-repatriation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054813",
    "commentBody": "",
    "originSummary": [
      "கிளவுட் ரீபேட்ரியேஷன் என்பது ஒரு வளர்ந்து வரும் போக்காகும், இதில் நிறுவனங்கள் பொது கிளவுட் சேவைகளிலிருந்து வேலைப்பளுவுகளை மீண்டும் உள்ளக அல்லது தனியார் சூழலுக்கு மாற்றுகின்றன, இது செலவு மற்றும் நம்பகத்தன்மை பற்றிய கவலைகள் மூலம் இயக்கப்படுகிறது. - 37சிக்னல்ஸ் மற்றும் GEICO போன்ற குறிப்பிடத்தக்க நிறுவனங்கள் இந்த மாற்றத்தை செய்துள்ளன, அதிக சேமிப்பு செலவுகள், விற்பனையாளர் பூட்டு, மற்றும் தனிப்பயன் மேம்பாடு தேவையை முக்கிய காரணிகளாகக் குறிப்பிடுகின்றன. - ரீபேட்ரியேட் செய்யும் முடிவு குறிப்பிட்ட வணிக தேவைகள் மற்றும் வேலைப்பளு பண்புகளால் பாதிக்கப்படுகிறது, சில நிறுவனங்கள் சொந்த கட்டமைப்பிலிருந்து பயனடைகின்றன, மற்றவர்கள் மாற்று தொழில்நுட்பங்களைப் பயன்படுத்தி கிளவுட் சூழல்களில் புதுமைகளைத் தொடருகின்றனர்."
    ],
    "commentSummary": [
      "TEXT: நிறுவனங்கள், AWS, Azure, மற்றும் Google Cloud Platform (GCP) போன்ற முக்கிய வழங்குநர்களின் தொடர்ந்த வளர்ச்சியினையும் பொருட்படுத்தாமல், அதிக செலவுகள் மற்றும் செயல்திறன் குறைபாடுகள் குறித்த கவலைகளால் மேக சேவைகளின் பயன்பாட்டை மறுபரிசீலனை செய்து வருகின்றன.- 37signals மற்றும் GEICO போன்ற குறிப்பிடத்தக்க நிறுவனங்கள், செலவுகள் மற்றும் கட்டுப்பாடு தொடர்பான பிரச்சினைகளை மேற்கோள் காட்டி, மேக தீர்வுகளை விட்டு விலக விரும்புகின்றன.- இந்த போக்கு, குறிப்பாக பரந்தவெளி மற்றும் சேமிப்பு செலவுகள் தொடர்பாக, மேக சேவைகளின் செலவு-நன்மை விகிதத்தை மதிப்பீடு செய்வதன் முக்கியத்துவத்தை வணிகங்களுக்கு வலியுறுத்துகிறது."
    ],
    "points": 187,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1730837953
  },
  {
    "id": 42057139,
    "title": "ஏன் ஆழ்ந்த கற்றல் வெடிப்பு பெரும்பாலானவர்களை ஆச்சரியப்படுத்தியது",
    "originLink": "https://www.understandingai.org/p/why-the-deep-learning-boom-caught",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057139",
    "commentBody": "",
    "originSummary": [
      "ஆழமான கற்றல் வெடிப்பு எதிர்பாராதது, ஏனெனில் 2008 ஆம் ஆண்டில் நரம்பியல் வலையமைப்புகள் காலாவதியானவை என்று கருதப்பட்டன, ஆனால் AlexNet போன்ற மாதிரிகளின் வெற்றி இந்த கருத்தை மாற்றியது.",
      "தமிழில் எழுத வேண்டும். பேராசிரியர் ஃபெய்-ஃபெய் லியின் ImageNet தரவுத்தொகுப்பு, 14 மில்லியன் லேபிள் செய்யப்பட்ட படங்களுடன், நியூரல் நெட்வொர்க்குகள் மற்றும் GPUக்களின் திறனை வெளிப்படுத்திய AlexNet மாதிரியை செயல்படுத்துவதில் முக்கிய பங்கு வகித்தது.",
      "முக்கியமான நபர்கள் ஜெஃப்ரி ஹின்டன், ஜென்சன் ஹுவாங், மற்றும் ஃபெய்-ஃபெய் லி பாரம்பரிய ஞானத்தை சவாலுக்கு உட்படுத்தி, செயற்கை நுண்ணறிவு தொழில்நுட்பத்தை முன்னேற்றுவதில் முக்கிய பங்கு வகித்தனர்."
    ],
    "commentSummary": [
      "மூலமேற்கோள்: நரம்பு வலையமைப்புகள், பெரிய தரவுகள் மற்றும் GPU கணினி செயலாக்கத்தின் ஒருங்கிணைப்பால் ஆழமான கற்றல் வளர்ச்சி ஏற்பட்டது, இதில் ஜெஃப்ரி ஹின்டன், ஃபெய்-ஃபெய் லி மற்றும் ஜென்சன் ஹுவாங் ஆகியோரின் முக்கிய பங்களிப்புகள் இருந்தன.- ஹின்டனின் பின்பற்றும் அல்காரிதம், லியின் ImageNet தரவுத்தொகுப்பு மற்றும் என்விடியாவின் GPU தொழில்நுட்பம் AI ஐ பாரம்பரிய முறைமைகளிலிருந்து தரவுவழி அணுகுமுறைகளுக்கு மாற்றுவதில் முக்கிய பங்கு வகித்தன.- ஆரம்ப சந்தேகத்திற்குப் பிறகும், ஆழமான கற்றலின் தழுவல் மற்றும் பெரிய தரவுத்தொகுப்புகளின் பயன்பாடு மாற்றமடைந்துள்ளது, ஆனால் விளக்கத்தன்மை மற்றும் செயல்திறன் போன்ற சவால்கள் தொடர்கின்றன. மூலமேற்கோள் முடிவு."
    ],
    "points": 184,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1730865901
  },
  {
    "id": 42062230,
    "title": "தனியார் மேகம் கணினி பாதுகாப்பு வழிகாட்டி",
    "originLink": "https://security.apple.com/documentation/private-cloud-compute/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42062230",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "இந்த விவாதம் ஆப்பிளின் தனியார் மேக கணினி பாதுகாப்பு வழிகாட்டி மற்றும் பயனர் தரவின் மீது ஆப்பிளின் கட்டுப்பாட்டைச் சுற்றியுள்ள நம்பிக்கை பிரச்சினைகள் குறித்து மையமாக உள்ளது.",
      "ஆப்பிளின் பாதுகாப்பை மேம்படுத்தும் முயற்சிகளுக்கு மத்தியிலும், அவர்களின் தரவுகளுக்கான அணுகல் மற்றும் அவர்களின் செயல்பாடுகளின் வெளிப்படைத்தன்மை குறித்து கவலைகள் தொடர்கின்றன.",
      "இந்த உரையாடல், தொழில்நுட்ப நிறுவனங்களிடம் தரவுகளை நம்புவதில் உள்ள உட்புற ஆபத்துகளை மற்றும் தற்போதைய பாதுகாப்பு மாதிரிகளில் தரவுக் காப்பியத்தை உறுதிப்படுத்துவதில் உள்ள சவால்களை வெளிப்படுத்துகிறது."
    ],
    "points": 180,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1730900935
  },
  {
    "id": 42054867,
    "title": "மொசில்லா அறக்கட்டளை 30% ஊழியர்களை பணிநீக்கம் செய்கிறது, ஆதரவு பிரிவை கைவிடுகிறது",
    "originLink": "https://techcrunch.com/2024/11/05/mozilla-foundation-lays-off-30-staff-drops-advocacy-division/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054867",
    "commentBody": "",
    "originSummary": [
      "மொசில்லா அறக்கட்டளை தனது ஊழியர்களில் 30% ஐ, சுமார் 36 ஊழியர்களை பாதிக்கும் வகையில், நெகிழ்வுத்தன்மை மற்றும் கவனத்தை மேம்படுத்தும் மறுசீரமைப்பின் ஒரு பகுதியாக பணிநீக்கம் செய்துள்ளது. இது ஆண்டின் இரண்டாவது பணிநீக்கமாகும், முந்தைய குறைப்புகள் ஃபயர்பாக்ஸ் மேம்பாட்டு குழுவை பாதித்தன, இது அமைப்பின் தொடர்ச்சியான கட்டமைப்பு மாற்றங்களை குறிக்கிறது. அறக்கட்டளையின் நிர்வாக இயக்குநர் நபீஹா சயீத், ஆதரவு மற்றும் உலகளாவிய திட்டங்கள் பிரிவுகளை நீக்கியதை குறிப்பிடினார், அதே நேரத்தில் ஆதரவை ஒரு முக்கிய கவனமாக வைத்திருப்பதை, வேகமான தொழில்நுட்ப மாற்றங்களுக்கு பதிலளிக்க ஒருங்கிணைந்த கதை மற்றும் மூலோபாய தகவல்தொடர்புகளின் முக்கியத்துவத்தை வலியுறுத்தினார்."
    ],
    "commentSummary": [
      "மொசில்லா அறக்கட்டளை தனது பணியாளர்களில் 30% பேரை பணிநீக்கம் செய்து, அதன் ஆதரவு பிரிவை நீக்குகிறது. இதற்குக் காரணம், கூகுள், ஃபயர்பாக்ஸ் இன் இயல்புநிலை தேடுபொறியாக இருப்பதற்கான கட்டணங்களை நிறுத்தினால், வருவாய் இழப்பு ஏற்படக்கூடும் என்பதே ஆகும். இது மொசில்லாவின் வருவாயில் 86% ஆகும்.",
      "தமிழில் எழுத வேண்டும். Firefox இன் எதிர்காலம் குறித்து கவலைகள் எழுந்துள்ளன, அதில் அது Chromium அடிப்படையிலான உலாவியாக மாறுமா என்ற ஊகங்களும் உள்ளன, இது உலாவி சந்தையில் அதன் தனித்துவமான நிலையை பாதிக்கும்.",
      "பணிநீக்கங்கள் மொசில்லாவின் நிதி சிக்கல்களை வலியுறுத்துகின்றன மற்றும் நிறுவனத்தின் ஆதரவு பணியாளர்களின்றி இணைய சுதந்திரம் மற்றும் தனியுரிமை ஆதரவு பற்றிய எதிர்காலத்தைப் பற்றிய கேள்விகளை எழுப்புகின்றன."
    ],
    "points": 180,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1730838540
  },
  {
    "id": 42055558,
    "title": "1979 இல் இருந்து ஒரு மர்மமான ஸ்கேட்போர்டரை கண்டுபிடித்தல்",
    "originLink": "https://www.ncrabbithole.com/p/tony-hawk-fayetteville-nc-girl-skateboarder-1979",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055558",
    "commentBody": "",
    "originSummary": [
      "டெக்ஸ்ட்: டோனி ஹாக் 1979 ஆம் ஆண்டின் புகைப்படத்தை கண்டுபிடித்தார், அதில் 10 வயது ஷாண்டா ஷேன் ஸ்கேட்போர்டிங் செய்து கொண்டிருந்தார், இது முதலில் blackarchives.co இல் பதிவிடப்பட்டது மற்றும் ஃபயட் வில்லே ஆப்சர்வர் காப்பகங்களில் கண்டுபிடிக்கப்பட்டது. - டோனி ஹாக் அதை பகிர்ந்த பிறகு புகைப்படம் வைரலானது, இதனால் ஃபயட் வில்லே ஆப்சர்வர் மறுபடியும் உருவாக்கப்பட்டது மற்றும் ஷாண்டாவை அவரது ஸ்கேட்போர்டிங் கடந்தகாலத்துடன் மீண்டும் இணைத்தது. - ஷாண்டா, இப்போது 56 வயதாகி கேப் ஃபியர் வாலி ஹெல்த் இல் வேலை செய்கிறார், தனது ஸ்கேட்போர்டிங் நாட்களை நினைவுகூருகிறார் மற்றும் சமீபத்தில் தனது மகனின் ஆர்வத்தால் ஊக்கமளிக்கப்பட்டு மீண்டும் ஸ்கேட்போர்டிங் முயற்சித்துள்ளார்."
    ],
    "commentSummary": [
      "1979 ஆம் ஆண்டின் மர்மமான ஸ்கேட்போர்டர் கவனத்தை ஈர்த்துள்ளார், இது 'கூஃபி ஃபுட்' (வலது கால் முன்னால்) மற்றும் 'ரெகுலர்' (இடது கால் முன்னால்) போன்ற ஸ்கேட்போர்டிங் நிலைப்பாடுகள் பற்றிய விவாதங்களை தூண்டியுள்ளது. - அந்த ஸ்கேட்போர்டரின் சமகாலத்தவர் டோனி ஹாக், ஆர்வம் காட்டியுள்ளார், இது பிரபலங்களின் கவனம் மறக்கப்பட்ட கதைகளை மீண்டும் உயிர்ப்பிக்க உதவுவதைக் காட்டுகிறது. - இந்தக் கதை, கடந்த கால தருணங்களை மீண்டும் கண்டுபிடிக்கும் ஆர்வத்துடன் கூடிய பரந்த போக்கை பிரதிபலிக்கிறது, 'கூஃபி ஃபுட்' என்ற சொல் ஒருவேளை டிஸ்னி கார்ட்டூனில் இருந்து தோன்றியிருக்கலாம்."
    ],
    "points": 179,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1730844019
  }
]
