[
  {
    "id": 42057647,
    "title": "Trump voittaa presidentinvaalit toisen kerran",
    "originLink": "https://thehill.com/homenews/campaign/4969061-trump-wins-presidential-election/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057647",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Trump varmistaa toisen presidenttikauden, mikä herättää keskusteluja talouspolitiikasta ja demokraattien strategioista. - Kriitikot väittävät, että demokraatit kamppailivat tehokkaasti käsitelläkseen taloudellisia kysymyksiä, mikä lisäsi äänestäjien tyytymättömyyttä. - Vaalitulokset herättävät kysymyksiä tulevista politiikoista, erityisesti inflaation, kampanjaviestinnän sekä ympäristö- ja talousvaikutusten osalta."
    ],
    "points": 1307,
    "commentCount": 5721,
    "retryCount": 0,
    "time": 1730875789
  },
  {
    "id": 42057431,
    "title": "Hyödylliset macOS:n sisäänrakennetut komentorivityökalut",
    "originLink": "https://weiyen.net/articles/useful-macos-cmd-line-utilities",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057431",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "macOS tarjoaa monenlaisia sisäänrakennettuja komentorivityökaluja, jotka parantavat tuottavuutta ja järjestelmän hallintaa, kuten `afconvert` äänen muuntamiseen ja `diskutil` tallennuksen hallintaan. Työkalut kuten `open`, `caffeinate` ja `sips` auttavat sovellusten käynnistämisessä, estävät nukkumisen ja käsittelevät kuvia, kun taas `pbcopy` ja `pbpaste` hallitsevat leikepöydän tehtäviä. Edistyneisiin työkaluihin kuuluvat `pmset` virta-asetuksiin, `networkQuality` internetnopeuden tarkistuksiin, `say` tekstin ääneen lukemiseen ja `mdfind` tiedostojen hakuun, tarjoten kattavaa järjestelmän hallintaa ja toiminnallisuutta."
    ],
    "points": 557,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730872300
  },
  {
    "id": 42054449,
    "title": "AMD myy enemmän kuin Intel datakeskustilassa",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054449",
    "commentBody": "",
    "originSummary": [
      "AMD on ohittanut Intelin datakeskusten suorittimien myynnissä ensimmäistä kertaa, kun AMD:n liikevaihto nousi 3,549 miljardiin dollariin kolmannella vuosineljänneksellä, ylittäen Intelin 3,3 miljardia dollaria.",
      "Tämä saavutus johtuu AMD:n kilpailukykyisistä EPYC-prosessoreista, jotka ovat suoriutuneet paremmin kuin Intelin Xeon-suorittimet.",
      "Huolimatta AMD:n menestyksestä, Nvidia pysyy datakeskusmarkkinoiden johtajana, ja sen tekoäly-GPU:t ja verkkotuotteet tuottavat huomattavasti suurempia myyntejä, mukaan lukien 22,604 miljardia dollaria laskentateho-GPU-myyntiä tilikauden 2025 toisen neljänneksen aikana."
    ],
    "commentSummary": [
      "AMD on ohittanut Intelin datakeskusten myynnissä, mikä viittaa merkittävään alan muutokseen ja AMD:n kasvavaan vaikutusvaltaan.",
      "Tämä muutos johtuu AMD:n EPYC-prosessoreista, joita suositaan niiden suorituskyvyn ja tehokkuuden vuoksi, mikä heijastaa AMD:n strategisia parannuksia palvelintason suorittimissa.",
      "Siirtymä korostaa haasteita, joita Intel kohtaa säilyttääkseen markkinajohtajuutensa, kun yritykset ottavat vähitellen käyttöön AMD:n ratkaisuja huolimatta perinteisesti konservatiivisista päivityssykleistä."
    ],
    "points": 450,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1730834835
  },
  {
    "id": 42056923,
    "title": "Elokuvien nimien mainitseminen",
    "originLink": "https://www.titledrops.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056923",
    "commentBody": "",
    "originSummary": [
      "\"Full of Themselves\" on Dominikus Baurin ja Alice Thudtin tutkimus, joka analysoi elokuvien nimien mainitsemista elokuvissa, joissa hahmot mainitsevat elokuvan nimen. Tutkimus kattaa 73 921 elokuvaa 80 vuoden ajalta ja toteaa, että 36,5 % elokuvista sisältää vähintään yhden nimen maininnan, keskimäärin 10,3 mainintaa elokuvaa kohden. Tutkimus tarkastelee ajan myötä tapahtuvia trendejä, hahmojen nimien mukaan nimettyjen elokuvien vaikutusta sekä nimen mainintojen, elokuvan laadun ja genren välistä suhdetta, ja koko aineisto on saatavilla lisätutkimuksia varten."
    ],
    "commentSummary": [
      "Elokuvien nimipudotukset tapahtuvat, kun hahmo mainitsee elokuvan nimen sen aikana, konsepti, jota analysoidaan sivustolla titledrops.net.",
      "Analyysi sisältää esimerkkejä ja keskusteluja, kuten siitä, tulisiko yleisiä sanoja kuten \"It\" pitää nimipudotuksina, sekä haasteita, joita aiheuttavat elokuvat, jotka on nimetty hahmojen mukaan.",
      "Artikkeli käsittelee myös käännöksen ja tulkinnan monimutkaisuutta, kun pyritään ymmärtämään otsikoiden esiintymistä eri kielissä ja konteksteissa."
    ],
    "points": 406,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730861286
  },
  {
    "id": 42057036,
    "title": "Tracker Beeper (2022)",
    "originLink": "https://berthub.eu/articles/posts/tracker-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057036",
    "commentBody": "",
    "originSummary": [
      "Työkalu kehitettiin lähettämään äänimerkki aina, kun tietokone lähettää tietoja Googlelle, paljastaen tietojen lähetyksen tiheyden ilman käyttäjän suostumusta. - Työkalu sai merkittävää huomiota, ja sen videoesittely saavutti miljoona katselukertaa viikossa, mikä johti laajennettuun tukeen Facebookille ja muille seurantatyökaluille. - Tällä hetkellä saatavilla Linuxille, OSX:lle ja BSD:lle, tulevaisuuden suunnitelmiin kuuluu versiot Applelle, Windowsille, iOS:lle ja Androidille sekä live-demo, joka käyttää WiFiä havainnollistaakseen seurantatoimintaa puhelimissa ja tableteissa kuuluvasti."
    ],
    "commentSummary": [
      "Tracker Beeper (2022) on projekti, joka antaa äänimerkin jokaisesta tietojen siirrosta yrityksille, kuten Google, lisäten tietoisuutta tietojen seurannan tiheydestä. Projekti herättää keskusteluja yksityisyyteen liittyvistä huolenaiheista, sonifikaation hyödyistä (äänen käyttäminen tiedon välittämiseen) ja nostalgisista tunteista vanhempia tietokoneympäristöjä kohtaan, joissa oli kuultavaa palautetta. Käyttäjien ehdotuksiin kuuluu työkalujen, kuten Pi-holen, käyttö ei-toivottujen tietopyyntöjen estämiseksi ja yksityisyyttä edistävän teknologian saavutettavuuden puolesta puhuminen."
    ],
    "points": 360,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1730863269
  },
  {
    "id": 42057851,
    "title": "Uusia kuvia Jupiterista",
    "originLink": "https://www.missionjuno.swri.edu/junocam/processing?source=all&ob_from=2024-10-01&ob_to=2024-11-01&phases%5B%5D=PERIJOVE+66&perpage=16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057851",
    "commentBody": "",
    "originSummary": [
      "JunoCam-kuvagalleria tarjoaa JunoCamin raakatiedostoja julkiseen lataukseen, mikä mahdollistaa käyttäjien käsitellä ja jakaa omia luomuksiaan.",
      "Kansalaistieteilijöitä kannustetaan osallistumaan kuvankäsittelyyn, mikä edistää sekä tieteellisiä raportteja että taiteellisia esityksiä, huolimatta Jupiterin säteilyn aiheuttamista haasteista.",
      "Galleria sisältää sekä käsittelemättömiä että käsiteltyjä kuvia, ja siinä on suodatusvaihtoehtoja, jotka kutsuvat tutkimaan Jupiteria ja sen kuita."
    ],
    "commentSummary": [
      "Uudet kuvat NASAn Juno-missiosta ovat herättäneet keskustelua verkossa, esitellen Jupiterin eläväistä ja dynaamista ilmakehää.",
      "Juno, joka laukaistiin vuonna 2011 ja on kiertänyt Jupiteria vuodesta 2016, ei alun perin ollut varustettu kameralla, mutta sellainen lisättiin opetustarkoituksiin ja se auttaa nyt tieteellisessä tutkimuksessa.",
      "Tehtävä korostaa avaruustutkimuksen haasteita, kuten säteilyä ja polttoaineen tarpeita, samalla kun se painottaa kiinnostavien visuaalien merkitystä yleisön kiinnostuksen ja koulutuksen kannalta."
    ],
    "points": 323,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1730878237
  },
  {
    "id": 42056918,
    "title": "98.css – Suunnittelujärjestelmä vanhojen käyttöliittymien uskolliseen uudelleenluomiseen",
    "originLink": "https://jdan.github.io/98.css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056918",
    "commentBody": "",
    "originSummary": [
      "98.css on CSS-kirjasto, joka on suunniteltu luomaan käyttöliittymiä, jotka muistuttavat Windows 98 -estetiikkaa, painottaen semanttista HTML:ää ja saavutettavuutta. Kirjasto on JavaScript-vapaa, mikä takaa yhteensopivuuden minkä tahansa frontend-kehyksen kanssa, ja sen voi tuoda unpkg:n kautta tai asentaa npm:n kautta. Se tarjoaa erilaisia komponentteja, kuten painikkeita, valintaruutuja ja liukusäätimiä, ja on avoimen lähdekoodin MIT-lisenssin alaisuudessa, ja siihen kannustetaan osallistumaan GitHubissa."
    ],
    "commentSummary": [
      "98.css on suunnittelujärjestelmä, joka pyrkii luomaan uudelleen vanhoja käyttöliittymiä, ja siinä on teemoja Windows 3.11:stä Mac OS 9:ään. Se sisältää skaalautuvia vektorikuvakkeita (SVG) korkean resoluution näytöille.",
      "Projektia arvostetaan sen yksinkertaisuudesta ja nostalgisesta vetovoimasta, vaikka jotkut käyttäjät ovat raportoineet ongelmista fontin renderöinnissä.",
      "Se on herättänyt keskusteluja käyttöliittymäsuunnittelusta, erityisesti vanhempien käyttöliittymien selkeydestä ja yksinkertaisuudesta, samankaltaisesti kuin muut projektit kuten XP.css ja 7.css."
    ],
    "points": 285,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1730861218
  },
  {
    "id": 42055979,
    "title": "Mozilla lakkauttaa vaikuttamisyksikkönsä",
    "originLink": "https://www.theverge.com/2024/11/5/24289124/mozilla-foundation-layoffs-advocacy-global-programs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055979",
    "commentBody": "",
    "originSummary": [
      "Mozilla on vähentänyt työvoimaansa 30 % lokakuun lopulla, mikä vaikuttaa sen edunvalvontaosastoon, joka edistää vapaata ja avointa verkkoa.",
      "Tämä merkitsee vuoden 2023 toista irtisanomiskierrosta, kun aiempi vähennys tapahtui helmikuussa, jättäen säätiölle noin 120 työntekijää ennen viimeisimpiä leikkauksia.",
      "Huolimatta irtisanomisista Mozilla pitää kiinni siitä, että vaikuttamistyö on edelleen olennainen osa sen tehtävää, ja toimitusjohtaja Nabhia Syed korostaa keskittymisen ja vaikeiden päätösten tekemisen välttämättömyyttä tulevien tavoitteiden saavuttamiseksi."
    ],
    "commentSummary": [
      "Mozilla on vähentämässä vaikuttamisyksikköään, mikä saattaa vaikuttaa noin 36 työpaikkaan, johtuen odotetusti pienemmistä hakutuloista Googlelta sekä muutoksista teknologiassa ja tekoälylainsäädännössä.",
      "Tämä päätös herättää keskusteluja Mozillan vaikuttamistyön tehokkuudesta, erityisesti kun internet keskittyy yhä enemmän suurten alustojen alaisuuteen.",
      "On esitetty ehdotus, että Mozillan tulisi asettaa etusijalle selaimensa parantaminen sen sijaan, että se keskittyisi vaikuttamistoimiin."
    ],
    "points": 211,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1730847885
  },
  {
    "id": 42058309,
    "title": "Vaikuttajien tietokanta äänisignaaleilla",
    "originLink": "https://old.reddit.com/r/cursor/comments/1gku61m/i_created_this_app_in_two_weekends_with_cursor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42058309",
    "commentBody": "",
    "originSummary": [
      "Uusi sovellus kehitettiin kahdessa viikonlopussa Cursorin avulla, saavuttaen 1 000 dollarin kuukausittaisen toistuvan liikevaihdon (MRR) tarjoamalla kattavan vaikuttajarekisterin TikTokille. Sovellus kerää tietoa TikTokista analysoidakseen videoita ja tarjoaa ominaisuuksia, kuten kehittyneitä suodattimia, videoiden äänilatauksia sekä tietojen poimintaa promootioluokista, avainsanoista ja tuotteista. Se sisältää tällä hetkellä noin 570 000 vaikuttajaa, mikä auttaa kilpailija-analyysissä ja vaikuttajayhteyksissä, ja etsii palautetta ja testaajia jatkokehitystä varten."
    ],
    "commentSummary": [
      "Uusi sovellus kehitettiin kahden viikonlopun aikana keräämään tietoa TikTokista ja luomaan tietokannan vaikuttajista, saavuttaen 1 000 dollarin kuukausittaisen toistuvan liikevaihdon (MRR). Sovellus analysoi videoita, poimii tietoja ja antaa käyttäjille mahdollisuuden suodattaa tekstiä ja kategorioita, mukaan lukien äänikäsittelyä, tunnistaakseen mainoskategoriat, avainsanat ja tuotteet. Tietokanta sisältää tällä hetkellä noin 570 000 vaikuttajaa, tarjoten työkaluja kilpailijoiden vaikuttajien analysointiin ja sopivien löytämiseen tiettyihin markkinarakoihin, ja mukana on vahvistetut sähköpostit."
    ],
    "points": 206,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1730883795
  },
  {
    "id": 42056420,
    "title": "Vain 5,3 % Yhdysvaltain hitsaajista on naisia. Vuosien professorina toimimisen jälkeen minusta tuli yksi heistä.",
    "originLink": "https://theconversation.com/only-5-3-of-welders-in-the-us-are-women-after-years-as-a-writing-professor-i-became-one-heres-what-i-learned-240431",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056420",
    "commentBody": "",
    "originSummary": [
      "Naiset edustavat vain 5,3 % hitsaajista Yhdysvalloissa, mikä korostaa merkittävää sukupuolten välistä eroa alalla.",
      "Vuosien 2017 ja 2022 välillä naisten määrä ammateissa kasvoi 47 %, mikä osoittaa kasvavaa kiinnostusta ja osallistumista jatkuvista haasteista huolimatta.",
      "Naisten kohtaamat haasteet ammateissa sisältävät fyysiset vaatimukset ja seksismin, ja naistyöntekijät kohtaavat usein tarkkailua ja ei-toivottuja kommentteja."
    ],
    "commentSummary": [
      "Artikkeli käsittelee naisten alhaista osuutta hitsausalalla, sillä vain 5,3 % Yhdysvaltain hitsaajista on naisia, ja korostaa enemmän luokkakysymyksiä kuin sukupuolikysymyksiä.",
      "Se viittaa siihen, että työväenluokan yhteisöt saattavat olla hyväksyvämpiä mies-nais-dynamiikan suhteen verrattuna akateemiseen maailmaan, joka pyrkii siistimään vuorovaikutuksia.",
      "Seksismin ja työpaikkadynamiikan laajempaa ongelmaa käsitellään, ja esitetään väite, että haasteet eivät ole erityisiä naisille, vaan pikemminkin kulttuurin muutokselle toimistosta fyysisiin työympäristöihin."
    ],
    "points": 189,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1730852688
  },
  {
    "id": 42054813,
    "title": "Yritykset hylkäävät pilvipalvelut: Pilvipalveluista luopumisen nousu",
    "originLink": "https://thenewstack.io/why-companies-are-ditching-the-cloud-the-rise-of-cloud-repatriation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054813",
    "commentBody": "",
    "originSummary": [
      "Pilvipalveluiden palauttaminen on kasvava trendi, jossa yritykset siirtävät työkuormia julkisista pilvipalveluista takaisin omiin tai yksityisiin ympäristöihin, mikä johtuu kustannus- ja luotettavuushuolista. Huomattavat yritykset, kuten 37signals ja GEICO, ovat tehneet tämän siirron, korostaen korkeita tallennuskustannuksia, toimittajalukkoa ja räätälöidyn optimoinnin tarvetta keskeisinä tekijöinä. Päätökseen palauttaa vaikuttavat erityiset liiketoimintatarpeet ja työkuormien ominaisuudet, jolloin jotkut yritykset hyötyvät omasta infrastruktuurista, kun taas toiset jatkavat innovointia pilviympäristöissä käyttäen vaihtoehtoisia teknologioita."
    ],
    "commentSummary": [
      "Yritykset arvioivat uudelleen pilvipalveluiden käyttöään korkeiden kustannusten ja tehottomuuksien vuoksi, vaikka suurten palveluntarjoajien, kuten AWS:n, Azuren ja Google Cloud Platformin (GCP), kasvu jatkuu. Huomattavat yritykset, kuten 37signals ja GEICO, päättävät siirtyä pois pilviratkaisuista vedoten kustannuksiin ja hallinnan puutteeseen liittyviin ongelmiin. Tämä suuntaus korostaa yritysten tarvetta arvioida omia erityisvaatimuksiaan ja pilvipalveluiden kustannus-hyötysuhdetta, erityisesti kaistanleveyden ja tallennuskustannusten osalta."
    ],
    "points": 187,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1730837953
  },
  {
    "id": 42057139,
    "title": "Miksi syväoppimisen nousu yllätti lähes kaikki",
    "originLink": "https://www.understandingai.org/p/why-the-deep-learning-boom-caught",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057139",
    "commentBody": "",
    "originSummary": [
      "Syväoppimisen nousu oli odottamaton, sillä neuroverkkoja pidettiin vanhentuneina vuoteen 2008 mennessä, mutta sellaisten mallien kuin AlexNetin menestys muutti tämän käsityksen.",
      "Professori Fei-Fei Lin ImageNet-datasarja, jossa on 14 miljoonaa merkittyä kuvaa, oli keskeinen AlexNet-mallin mahdollistamisessa, mikä esitteli hermoverkkojen ja GPU:iden potentiaalin.",
      "Keskeiset henkilöt, kuten Geoffrey Hinton, Jensen Huang ja Fei-Fei Li, olivat ratkaisevassa asemassa haastamassa perinteistä ajattelua ja edistämässä tekoälyteknologiaa."
    ],
    "commentSummary": [
      "Syväoppimisen nousu johtui neuroverkkojen, big datan ja GPU-laskennan yhdistymisestä, ja siihen vaikuttivat merkittävästi Geoffrey Hinton, Fei-Fei Li ja Jensen Huang. Hintonin takapropagointialgoritmi, Lin ImageNet-datasetti ja Nvidian GPU-teknologia olivat keskeisiä tekijöitä, jotka siirsivät tekoälyn perinteisistä paradigmoista datalähtöisiin lähestymistapoihin. Alkuperäisestä skeptisyydestä huolimatta syväoppimisen mukautuvuus ja suurten datasetien hyödyllisyys ovat olleet mullistavia, vaikka haasteita, kuten tulkittavuus ja tehokkuus, on edelleen olemassa."
    ],
    "points": 184,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1730865901
  },
  {
    "id": 42062230,
    "title": "Yksityisen pilvilaskennan tietoturvaopas",
    "originLink": "https://security.apple.com/documentation/private-cloud-compute/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42062230",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Keskustelu keskittyy Applen yksityisen pilvilaskennan tietoturvaoppaaseen ja jatkuviin luottamusongelmiin, jotka liittyvät Applen hallintaan käyttäjätiedoista.",
      "Huolimatta Applen pyrkimyksistä parantaa turvallisuutta, huolenaiheet heidän mahdollisesta pääsystään tietoihin ja toimintojensa läpinäkyvyydestä jatkuvat.",
      "Keskustelu tuo esiin teknologia-alan yrityksiin kohdistuvan luottamuksen riskit ja haasteet tietosuojan varmistamisessa nykyisten turvallisuusmallien puitteissa."
    ],
    "points": 180,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1730900935
  },
  {
    "id": 42054867,
    "title": "Mozillan säätiö irtisanoo 30 % henkilöstöstään, lakkauttaa vaikuttamisyksikön",
    "originLink": "https://techcrunch.com/2024/11/05/mozilla-foundation-lays-off-30-staff-drops-advocacy-division/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054867",
    "commentBody": "",
    "originSummary": [
      "Mozillan säätiö on irtisanonut 30 % henkilöstöstään, mikä vaikuttaa noin 36 työntekijään, osana uudelleenjärjestelyä ketteryyden ja keskittymisen parantamiseksi. Tämä on vuoden toinen irtisanomiskierros, ja aiemmat leikkaukset vaikuttivat Firefoxin kehitystiimiin, mikä viittaa jatkuviin rakenteellisiin muutoksiin organisaatiossa. Säätiön toimitusjohtaja Nabiha Syed korosti vaikuttamisen ja globaalien ohjelmien osastojen poistamista, mutta säilytti vaikuttamisen keskeisenä painopisteenä, korostaen yhtenäisen kertomuksen ja strategisen viestinnän merkitystä vastauksena nopeisiin teknologisiin muutoksiin."
    ],
    "commentSummary": [
      "Mozillan säätiö irtisanoo 30 % henkilöstöstään ja lakkauttaa vaikuttamistoimintonsa mahdollisen tulonmenetyksen vuoksi, jos Google lopettaa maksut Firefoxin oletushakukoneena olemisesta, mikä muodostaa 86 % Mozillan tuloista.",
      "Huolia on herännyt Firefoxin tulevaisuudesta, mukaan lukien spekulaatiot siitä, voisiko se siirtyä Chromium-pohjaiseksi selaimeksi, mikä vaikuttaisi sen ainutlaatuiseen asemaan selainmarkkinoilla.",
      "Yt-neuvottelut korostavat Mozillan taloudellisia vaikeuksia ja herättävät kysymyksiä internetin vapauden ja yksityisyyden puolustamisen tulevaisuudesta ilman säätiön puolestapuhujia."
    ],
    "points": 180,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1730838540
  },
  {
    "id": 42055558,
    "title": "Vuoden 1979 salaperäisen skeittaajan jäljittäminen",
    "originLink": "https://www.ncrabbithole.com/p/tony-hawk-fayetteville-nc-girl-skateboarder-1979",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055558",
    "commentBody": "",
    "originSummary": [
      "Tony Hawk löysi vuonna 1979 otetun valokuvan 10-vuotiaasta Shaunda Shaneista skeittaamassa, joka oli alun perin julkaistu blackarchives.co-sivustolla ja löytyi Fayetteville Observerin arkistoista. Valokuva levisi laajalle Tony Hawkin jaettua sen, mikä johti Fayetteville Observerin tekemään uudelleenluontiin ja Shaundan yhdistymiseen skeittausmenneisyyteensä. Shaunda, joka on nyt 56-vuotias ja työskentelee Cape Fear Valley Healthissa, muistelee skeittausaikojaan ja on äskettäin kokeillut skeittausta uudelleen poikansa kiinnostuksen innoittamana."
    ],
    "commentSummary": [
      "Salaperäinen skeittaaja vuodelta 1979 on herättänyt huomiota, mikä on käynnistänyt keskusteluja skeittausasennoista, kuten \"goofy footed\" (oikea jalka edessä) ja \"regular\" (vasen jalka edessä). Tony Hawk, skeittaajan aikalainen, on osoittanut kiinnostusta, korostaen julkkisten huomion vaikutusta unohdettujen tarinoiden elvyttämisessä. Tarina heijastaa laajempaa nostalgiaa ja menneiden hetkien uudelleen löytämisen viehätystä, ja termi \"goofy-footed\" saattaa olla peräisin Disneyn piirretystä."
    ],
    "points": 179,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1730844019
  }
]
