[
  {
    "id": 42057647,
    "title": "ट्रम्प दूसरी बार राष्ट्रपति पद का चुनाव जीतते हैं",
    "originLink": "https://thehill.com/homenews/campaign/4969061-trump-wins-presidential-election/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057647",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ट्रम्प ने दूसरा राष्ट्रपति कार्यकाल सुरक्षित किया, जिससे आर्थिक नीतियों और डेमोक्रेटिक रणनीतियों पर चर्चाएं शुरू हो गईं।- आलोचकों का सुझाव है कि डेमोक्रेट्स आर्थिक मुद्दों को प्रभावी ढंग से संबोधित करने में संघर्ष कर रहे थे, जिससे मतदाताओं में असंतोष बढ़ा।- चुनाव परिणाम भविष्य की नीतियों के बारे में सवाल उठाता है, विशेष रूप से मुद्रास्फीति, अभियान संदेश, और पर्यावरणीय और आर्थिक प्रभावों के संबंध में।"
    ],
    "points": 1307,
    "commentCount": 5721,
    "retryCount": 0,
    "time": 1730875789
  },
  {
    "id": 42057431,
    "title": "उपयोगी बिल्ट-इन macOS कमांड-लाइन यूटिलिटीज",
    "originLink": "https://weiyen.net/articles/useful-macos-cmd-line-utilities",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057431",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "macOS विभिन्न अंतर्निहित कमांड-लाइन उपयोगिताओं की पेशकश करता है जो उत्पादकता और सिस्टम प्रबंधन को बढ़ाते हैं, जैसे ऑडियो रूपांतरण के लिए `afconvert` और स्टोरेज प्रबंधन के लिए `diskutil`। - `open`, `caffeinate`, और `sips` जैसे उपकरण क्रमशः अनुप्रयोगों को लॉन्च करने, नींद को रोकने, और छवियों को संसाधित करने में सहायता करते हैं, जबकि `pbcopy` और `pbpaste` क्लिपबोर्ड कार्यों का प्रबंधन करते हैं। - उन्नत उपयोगिताओं में पावर सेटिंग्स के लिए `pmset`, इंटरनेट गति जांच के लिए `networkQuality`, टेक्स्ट वोकलाइजेशन के लिए `say`, और फ़ाइल खोज के लिए `mdfind` शामिल हैं, जो व्यापक सिस्टम नियंत्रण और कार्यक्षमता प्रदान करते हैं।"
    ],
    "points": 557,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730872300
  },
  {
    "id": 42054449,
    "title": "डेटासेंटर क्षेत्र में एएमडी ने इंटेल को पीछे छोड़ा",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/for-the-first-time-ever-amd-outsells-intel-in-the-datacenter-space",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054449",
    "commentBody": "",
    "originSummary": [
      "एएमडी ने पहली बार डेटा सेंटर सीपीयू बिक्री में इंटेल को पीछे छोड़ दिया है, जिसमें एएमडी की राजस्व Q3 में $3.549 बिलियन तक पहुंच गई है, जो इंटेल के $3.3 बिलियन से अधिक है।",
      "इस उपलब्धि का श्रेय AMD के प्रतिस्पर्धी EPYC प्रोसेसरों को दिया जाता है, जिन्होंने Intel के Xeon CPUs को पीछे छोड़ दिया है।",
      "एएमडी की सफलता के बावजूद, एनवीडिया अभी भी डाटासेंटर बाजार में अग्रणी है, जहां इसके एआई जीपीयू और नेटवर्किंग उत्पादों की बिक्री काफी अधिक है, जिसमें Q2 FY2025 में कंप्यूट जीपीयू की बिक्री $22.604 बिलियन शामिल है।"
    ],
    "commentSummary": [
      "एएमडी ने डेटा सेंटर बिक्री में इंटेल को पीछे छोड़ दिया है, जो एक प्रमुख उद्योग परिवर्तन और एएमडी के बढ़ते प्रभाव को दर्शाता है।",
      "इस परिवर्तन का श्रेय AMD के EPYC प्रोसेसरों को दिया जाता है, जिन्हें उनके प्रदर्शन और दक्षता के लिए पसंद किया जाता है, जो सर्वर-ग्रेड CPU में AMD के रणनीतिक सुधारों को दर्शाता है।",
      "यह परिवर्तन इस बात को रेखांकित करता है कि इंटेल को अपने बाजार प्रभुत्व को बनाए रखने में किन चुनौतियों का सामना करना पड़ रहा है, क्योंकि उद्यम धीरे-धीरे एएमडी समाधानों को अपनाते जा रहे हैं, भले ही पारंपरिक रूप से उनके उन्नयन चक्र रूढ़िवादी रहे हों।"
    ],
    "points": 450,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1730834835
  },
  {
    "id": 42056923,
    "title": "फिल्मों में शीर्षक का उल्लेख",
    "originLink": "https://www.titledrops.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056923",
    "commentBody": "",
    "originSummary": [
      "\\\"फुल ऑफ देमसेल्व्स\\\" डोमिनिकस बाउर और एलिस थुड्ट द्वारा एक अध्ययन है जो फिल्मों में शीर्षक ड्रॉप्स की घटना का विश्लेषण करता है, जहां पात्र फिल्म के शीर्षक का उल्लेख करते हैं।- यह शोध 80 वर्षों में 73,921 फिल्मों को कवर करता है, जिसमें पाया गया कि 36.5% फिल्मों में कम से कम एक शीर्षक ड्रॉप शामिल है, और औसतन प्रति फिल्म 10.3 ड्रॉप्स होते हैं।- अध्ययन समय के साथ रुझानों, चरित्र-नामित फिल्मों के प्रभाव, और शीर्षक ड्रॉप्स, फिल्म की गुणवत्ता, और शैली के बीच संबंध की जांच करता है, जिसमें आगे की खोज के लिए पूरा डेटासेट उपलब्ध है।"
    ],
    "commentSummary": [
      "फिल्मों में शीर्षक ड्रॉप्स तब होती हैं जब कोई पात्र फिल्म के दौरान फिल्म के शीर्षक का उल्लेख करता है, एक अवधारणा जिसका विश्लेषण titledrops.net पर किया गया है।",
      "विश्लेषण में उदाहरण और बहसें शामिल हैं, जैसे कि क्या \"यह\" जैसे सामान्य शब्दों को शीर्षक ड्रॉप माना जाना चाहिए, और उन फिल्मों द्वारा प्रस्तुत चुनौतियाँ जिनके नाम पात्रों के नाम पर होते हैं।",
      "लेख में विभिन्न भाषाओं और संदर्भों में शीर्षक ड्रॉप्स को समझने में अनुवाद और व्याख्या की जटिलताओं पर भी चर्चा की गई है।"
    ],
    "points": 406,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1730861286
  },
  {
    "id": 42057036,
    "title": "ट्रैकर बीपर (2022)",
    "originLink": "https://berthub.eu/articles/posts/tracker-beeper/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057036",
    "commentBody": "",
    "originSummary": [
      "एक उपकरण विकसित किया गया था जो हर बार जब कोई कंप्यूटर गूगल को डेटा भेजता है, तो एक बीप ध्वनि उत्पन्न करता है, जिससे उपयोगकर्ता की सहमति के बिना डेटा ट्रांसमिशन की आवृत्ति का पता चलता है।- इस उपकरण ने महत्वपूर्ण ध्यान आकर्षित किया, एक वीडियो प्रदर्शन ने एक सप्ताह में एक मिलियन दृश्य प्राप्त किए, जिससे फेसबुक और अन्य ट्रैकर्स के लिए विस्तारित समर्थन मिला।- वर्तमान में यह लिनक्स, OSX, और BSD के लिए उपलब्ध है, भविष्य की योजनाओं में एप्पल, विंडोज, iOS, और एंड्रॉइड के लिए संस्करण शामिल हैं, और फोन और टैबलेट पर ट्रैकर गतिविधि को श्रव्य रूप से प्रदर्शित करने के लिए वाईफाई का उपयोग करके एक लाइव डेमो शामिल है।"
    ],
    "commentSummary": [
      "ट्रैकर बीपर (2022) एक परियोजना है जो कंपनियों जैसे गूगल को प्रत्येक डेटा ट्रांसफर को श्रव्य रूप से संकेत देती है, जिससे डेटा ट्रैकिंग की आवृत्ति के बारे में जागरूकता बढ़ती है।- यह परियोजना गोपनीयता चिंताओं, ध्वनिकीकरण के लाभ (जानकारी को ध्वनि के माध्यम से व्यक्त करना), और श्रव्य प्रतिक्रिया के साथ पुराने कंप्यूटिंग वातावरण के लिए उदासीनता पर चर्चाओं को प्रज्वलित करती है।- उपयोगकर्ताओं से सुझावों में अनचाहे डेटा अनुरोधों को ब्लॉक करने के लिए Pi-hole जैसे उपकरणों का उपयोग करना और अधिक सुलभ गोपनीयता-अनुकूल तकनीक की वकालत करना शामिल है।"
    ],
    "points": 360,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1730863269
  },
  {
    "id": 42057851,
    "title": "बृहस्पति की नई छवियाँ",
    "originLink": "https://www.missionjuno.swri.edu/junocam/processing?source=all&ob_from=2024-10-01&ob_to=2024-11-01&phases%5B%5D=PERIJOVE+66&perpage=16",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057851",
    "commentBody": "",
    "originSummary": [
      "जूनोकैम इमेज गैलरी सार्वजनिक डाउनलोड के लिए जूनोकैम से कच्ची छवियां प्रदान करती है, जिससे उपयोगकर्ता अपनी रचनाओं को प्रोसेस और साझा कर सकते हैं।",
      "नागरिक वैज्ञानिकों को छवि प्रसंस्करण में भाग लेने के लिए प्रोत्साहित किया जाता है, जो बृहस्पति की विकिरण से उत्पन्न चुनौतियों के बावजूद वैज्ञानिक रिपोर्टों और कलात्मक प्रदर्शनों दोनों में योगदान देते हैं।",
      "गैलरी में कच्ची और संसाधित छवियाँ दोनों शामिल हैं, जिसमें फिल्टरिंग विकल्प उपलब्ध हैं, जो बृहस्पति और उसके चंद्रमाओं की खोज के लिए आमंत्रित करती हैं।"
    ],
    "commentSummary": [
      "नासा के जूनो मिशन से प्राप्त नई छवियों ने ऑनलाइन चर्चाओं को जन्म दिया है, जो बृहस्पति के जीवंत और गतिशील वातावरण को प्रदर्शित करती हैं।",
      "जूनो, जिसे 2011 में लॉन्च किया गया और 2016 से बृहस्पति की परिक्रमा कर रहा है, को शुरू में कैमरे के साथ नहीं सुसज्जित किया गया था, लेकिन शैक्षिक उद्देश्यों के लिए एक कैमरा जोड़ा गया, जो अब वैज्ञानिक अध्ययन में सहायता कर रहा है।",
      "मिशन अंतरिक्ष अन्वेषण में चुनौतियों को उजागर करता है, जैसे विकिरण और ईंधन की आवश्यकताएं, जबकि सार्वजनिक रुचि और शिक्षा में आकर्षक दृश्यों की भूमिका पर जोर देता है।"
    ],
    "points": 323,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1730878237
  },
  {
    "id": 42056918,
    "title": "98.css – पुराने यूआई की सटीक पुनर्रचनाओं के निर्माण के लिए एक डिज़ाइन सिस्टम",
    "originLink": "https://jdan.github.io/98.css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056918",
    "commentBody": "",
    "originSummary": [
      "98.css एक CSS लाइब्रेरी है जो उपयोगकर्ता इंटरफेस बनाने के लिए डिज़ाइन की गई है, जो Windows 98 की सौंदर्य शैली को दर्शाती है, और यह सेमांटिक HTML और एक्सेसिबिलिटी पर जोर देती है।- यह लाइब्रेरी जावास्क्रिप्ट-मुक्त है, जो इसे किसी भी फ्रंटएंड फ्रेमवर्क के साथ संगत बनाती है, और इसे unpkg के माध्यम से आयात किया जा सकता है या npm के माध्यम से स्थापित किया जा सकता है।- यह बटन, चेकबॉक्स, और स्लाइडर्स जैसे विभिन्न घटक प्रदान करती है, और MIT लाइसेंस के तहत ओपन-सोर्स है, जिसमें GitHub पर योगदान को प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "98.css एक डिज़ाइन प्रणाली है जिसका उद्देश्य विंटेज यूजर इंटरफेस को फिर से बनाना है, जिसमें विंडोज 3.11 से मैक ओएस 9 तक के थीम शामिल हैं, और इसमें उच्च-रिज़ॉल्यूशन डिस्प्ले के लिए स्केलेबल वेक्टर ग्राफिक्स (SVG) आइकन शामिल हैं।",
      "इस परियोजना की सराहना इसकी सरलता और पुरानी यादों की अपील के लिए की जाती है, हालांकि कुछ उपयोगकर्ताओं ने फॉन्ट रेंडरिंग के साथ समस्याओं की रिपोर्ट की है।",
      "इसने उपयोगकर्ता इंटरफ़ेस डिज़ाइन पर चर्चाओं को जन्म दिया है, जिसमें पुराने इंटरफ़ेस की स्पष्टता और सरलता में उल्लेखनीय रुचि है, जो XP.css और 7.css जैसे अन्य परियोजनाओं के समान है।"
    ],
    "points": 285,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1730861218
  },
  {
    "id": 42055979,
    "title": "मोज़िला अपनी वकालत शाखा को समाप्त कर रहा है",
    "originLink": "https://www.theverge.com/2024/11/5/24289124/mozilla-foundation-layoffs-advocacy-global-programs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055979",
    "commentBody": "",
    "originSummary": [
      "मोज़िला ने अक्टूबर के अंत में अपनी कार्यबल को 30% तक कम कर दिया है, जिससे उसकी वकालत शाखा प्रभावित हुई है जो एक स्वतंत्र और खुले वेब को बढ़ावा देती है।",
      "यह 2023 में छंटनी का दूसरा दौर है, जिसमें पहले की कटौती फरवरी में हुई थी, जिससे नवीनतम कटौती से पहले फाउंडेशन में लगभग 120 कर्मचारी रह गए थे।",
      "छंटनी के बावजूद, मोज़िला इस बात पर कायम है कि वकालत उसके मिशन का एक महत्वपूर्ण हिस्सा बनी हुई है, जिसमें कार्यकारी निदेशक नाभिया सैयद ने भविष्य के उद्देश्यों को पूरा करने के लिए ध्यान केंद्रित करने और कठिन निर्णय लेने की आवश्यकता पर जोर दिया है।"
    ],
    "commentSummary": [
      "मोज़िला अपने वकालत विभाग को कम कर रहा है, जिससे लगभग 36 नौकरियों पर प्रभाव पड़ सकता है, क्योंकि गूगल से अपेक्षित कम खोज राजस्व और तकनीकी कानून और एआई में बदलाव हो रहे हैं।",
      "यह निर्णय मोज़िला की वकालत की प्रभावशीलता पर चर्चाओं को प्रेरित करता है, विशेष रूप से जब इंटरनेट प्रमुख प्लेटफार्मों के तहत अधिक केंद्रीकृत हो रहा है।",
      "यह सुझाव दिया गया है कि मोज़िला को अपने ब्राउज़र को बेहतर बनाने को प्राथमिकता देनी चाहिए बजाय इसके कि वह वकालत के प्रयासों पर ध्यान केंद्रित करे।"
    ],
    "points": 211,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1730847885
  },
  {
    "id": 42058309,
    "title": "ऑडियो संकेतों के साथ प्रभावशाली व्यक्तियों का डेटाबेस",
    "originLink": "https://old.reddit.com/r/cursor/comments/1gku61m/i_created_this_app_in_two_weekends_with_cursor/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42058309",
    "commentBody": "",
    "originSummary": [
      "एक नया ऐप दो सप्ताहांत में कर्सर का उपयोग करके विकसित किया गया, जिसने TikTok के लिए एक व्यापक इन्फ्लुएंसर डेटाबेस प्रदान करके $1,000 मासिक आवर्ती राजस्व (MRR) प्राप्त किया।- यह ऐप TikTok को स्क्रैप करता है ताकि वीडियो का विश्लेषण किया जा सके, और इसमें उन्नत फिल्टर, वीडियो ऑडियो डाउनलोड, और प्रमोशन श्रेणियों, कीवर्ड्स, और उत्पादों पर डेटा निष्कर्षण जैसी विशेषताएं शामिल हैं।- वर्तमान में इसमें लगभग 570,000 इन्फ्लुएंसर शामिल हैं, जो प्रतियोगी विश्लेषण और इन्फ्लुएंसर आउटरीच में मदद करते हैं, और आगे के विकास के लिए प्रतिक्रिया और परीक्षकों की तलाश कर रहा है।"
    ],
    "commentSummary": [
      "एक नया ऐप दो सप्ताहांत में विकसित किया गया था जो TikTok से डेटा स्क्रैप करके इन्फ्लुएंसर्स का एक डेटाबेस बनाता है, जिससे $1,000 की मासिक आवर्ती राजस्व (MRR) प्राप्त हुई।- यह ऐप वीडियो का विश्लेषण करता है, डेटा निकालता है, और उपयोगकर्ताओं को टेक्स्ट और श्रेणियों के अनुसार फ़िल्टर करने की अनुमति देता है, जिसमें प्रमोशन श्रेणियों, कीवर्ड्स और उत्पादों की पहचान के लिए ऑडियो प्रोसेसिंग शामिल है।- वर्तमान में डेटाबेस में लगभग 570,000 इन्फ्लुएंसर्स शामिल हैं, जो प्रतियोगियों के इन्फ्लुएंसर्स का विश्लेषण करने और विशिष्ट निचेस के लिए उपयुक्त इन्फ्लुएंसर्स खोजने के लिए उपकरण प्रदान करता है, जिसमें सत्यापित ईमेल भी उपलब्ध कराए जाते हैं।"
    ],
    "points": 206,
    "commentCount": 1,
    "retryCount": 0,
    "time": 1730883795
  },
  {
    "id": 42056420,
    "title": "संयुक्त राज्य अमेरिका में केवल 5.3% वेल्डर महिलाएं हैं। वर्षों तक प्रोफेसर रहने के बाद, मैं एक बन गई।",
    "originLink": "https://theconversation.com/only-5-3-of-welders-in-the-us-are-women-after-years-as-a-writing-professor-i-became-one-heres-what-i-learned-240431",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42056420",
    "commentBody": "",
    "originSummary": [
      "महिलाएं अमेरिका में केवल 5.3% वेल्डर्स का प्रतिनिधित्व करती हैं, जो इस क्षेत्र में एक महत्वपूर्ण लैंगिक असमानता को दर्शाता है।",
      "2017 से 2022 तक, व्यापारिक क्षेत्रों में महिलाओं की संख्या में 47% की वृद्धि हुई, जो दर्शाता है कि चल रही चुनौतियों के बावजूद उनकी रुचि और भागीदारी बढ़ रही है।",
      "व्यापार में महिलाओं के लिए चुनौतियों में शारीरिक मांगें और लिंगभेद शामिल हैं, जिसमें व्यापारिक महिलाएं अक्सर जांच और अवांछित टिप्पणियों का सामना करती हैं।"
    ],
    "commentSummary": [
      "लेख में वेल्डिंग पेशे में महिलाओं के कम प्रतिशत पर चर्चा की गई है, जिसमें केवल 5.3% अमेरिकी वेल्डर महिलाएं हैं, और यह लिंग की तुलना में वर्ग बाधाओं को अधिक उजागर करता है।",
      "यह सुझाव देता है कि श्रमिक वर्ग की समुदायों में पुरुष-महिला गतिशीलता को अधिक स्वीकार किया जा सकता है, जबकि अकादमिक क्षेत्र में बातचीत को अधिक स्वच्छ बनाने की प्रवृत्ति होती है।",
      "लिंगभेद और कार्यस्थल की गतिशीलता के व्यापक मुद्दे को संबोधित किया गया है, जिसमें यह तर्क दिया गया है कि चुनौतियाँ केवल महिलाओं के लिए नहीं हैं, बल्कि कार्यालय से भौतिक कार्य वातावरण में संस्कृति के बदलाव से संबंधित हैं।"
    ],
    "points": 189,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1730852688
  },
  {
    "id": 42054813,
    "title": "कंपनियां क्लाउड को क्यों छोड़ रही हैं: क्लाउड पुनर्वास का उदय",
    "originLink": "https://thenewstack.io/why-companies-are-ditching-the-cloud-the-rise-of-cloud-repatriation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054813",
    "commentBody": "",
    "originSummary": [
      "क्लाउड रिपैट्रिएशन एक बढ़ती हुई प्रवृत्ति है जिसमें कंपनियाँ सार्वजनिक क्लाउड सेवाओं से वर्कलोड्स को वापस ऑन-प्रिमाइसेस या निजी वातावरण में स्थानांतरित करती हैं, जो लागत और विश्वसनीयता की चिंताओं से प्रेरित होती है। - 37सिग्नल्स और GEICO जैसी उल्लेखनीय कंपनियों ने इस बदलाव को अपनाया है, जो उच्च स्टोरेज लागत, विक्रेता लॉक-इन, और कस्टम ऑप्टिमाइजेशन की आवश्यकता जैसे मुद्दों को प्रमुख कारक के रूप में उजागर करती हैं। - रिपैट्रिएट करने का निर्णय विशिष्ट व्यावसायिक आवश्यकताओं और वर्कलोड विशेषताओं से प्रभावित होता है, जिसमें कुछ कंपनियाँ स्वामित्व वाले बुनियादी ढांचे से लाभान्वित होती हैं जबकि अन्य वैकल्पिक प्रौद्योगिकियों का उपयोग करके क्लाउड वातावरण में नवाचार जारी रखती हैं।"
    ],
    "commentSummary": [
      "कंपनियां उच्च लागत और अक्षमताओं को लेकर चिंताओं के कारण क्लाउड सेवाओं के अपने उपयोग का पुनर्मूल्यांकन कर रही हैं, भले ही AWS, Azure, और Google क्लाउड प्लेटफ़ॉर्म (GCP) जैसे प्रमुख प्रदाताओं की निरंतर वृद्धि हो रही है।- 37signals और GEICO जैसी उल्लेखनीय कंपनियां लागत और नियंत्रण से संबंधित मुद्दों का हवाला देते हुए क्लाउड समाधानों से दूर जाने का विकल्प चुन रही हैं।- यह प्रवृत्ति व्यवसायों के लिए उनके अद्वितीय आवश्यकताओं और क्लाउड सेवाओं के लागत-लाभ अनुपात का आकलन करने के महत्व को रेखांकित करती है, विशेष रूप से बैंडविड्थ और भंडारण खर्चों के संबंध में।"
    ],
    "points": 187,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1730837953
  },
  {
    "id": 42057139,
    "title": "क्यों गहन शिक्षण का उछाल लगभग सभी को आश्चर्यचकित कर गया",
    "originLink": "https://www.understandingai.org/p/why-the-deep-learning-boom-caught",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42057139",
    "commentBody": "",
    "originSummary": [
      "डीप लर्निंग का उभार अप्रत्याशित था, क्योंकि 2008 तक न्यूरल नेटवर्क को पुराना माना जाता था, लेकिन एलेक्सनेट जैसे मॉडलों की सफलता ने इस धारणा को बदल दिया।",
      "प्रो. फेई-फेई ली का इमेजनेट डेटासेट, जिसमें 14 मिलियन लेबल किए गए चित्र शामिल हैं, एलेक्सनेट मॉडल को सक्षम बनाने में महत्वपूर्ण था, जिसने न्यूरल नेटवर्क और जीपीयू की क्षमता को प्रदर्शित किया।",
      "ज्योफ्री हिंटन, जेनसन हुआंग, और फेई-फेई ली जैसी प्रमुख हस्तियों ने पारंपरिक सोच को चुनौती देने और एआई तकनीक को आगे बढ़ाने में महत्वपूर्ण भूमिका निभाई।"
    ],
    "commentSummary": [
      "डीप लर्निंग की उछाल को न्यूरल नेटवर्क, बड़े डेटा, और GPU कंप्यूटिंग के संगम द्वारा प्रेरित किया गया था, जिसमें ज्योफ्री हिंटन, फेई-फेई ली, और जेनसन हुआंग का महत्वपूर्ण योगदान था।- हिंटन के बैकप्रोपेगेशन एल्गोरिदम, ली के इमेजनेट डेटासेट, और एनवीडिया की GPU तकनीक ने AI को पारंपरिक प्रतिमानों से डेटा-चालित दृष्टिकोणों की ओर स्थानांतरित करने में महत्वपूर्ण भूमिका निभाई।- प्रारंभिक संदेह के बावजूद, डीप लर्निंग की अनुकूलनशीलता और बड़े डेटासेट की उपयोगिता ने इसे परिवर्तनकारी बना दिया है, हालांकि व्याख्यात्मकता और दक्षता जैसी चुनौतियाँ बनी हुई हैं।"
    ],
    "points": 184,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1730865901
  },
  {
    "id": 42062230,
    "title": "प्राइवेट क्लाउड कंप्यूट सुरक्षा गाइड",
    "originLink": "https://security.apple.com/documentation/private-cloud-compute/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42062230",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "चर्चा का केंद्र बिंदु एप्पल के प्राइवेट क्लाउड कंप्यूट सुरक्षा गाइड और उपयोगकर्ता डेटा पर एप्पल के नियंत्रण के संबंध में चल रही विश्वास समस्याएं हैं।",
      "एप्पल की सुरक्षा सुधारने के प्रयासों के बावजूद, उनके डेटा तक संभावित पहुंच और उनके संचालन की पारदर्शिता को लेकर चिंताएं बनी हुई हैं।",
      "यह वार्तालाप डेटा के साथ तकनीकी कंपनियों पर भरोसा करने के अंतर्निहित जोखिमों और वर्तमान सुरक्षा मॉडलों के भीतर डेटा गोपनीयता सुनिश्चित करने की चुनौतियों को उजागर करता है।"
    ],
    "points": 180,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1730900935
  },
  {
    "id": 42054867,
    "title": "मोज़िला फाउंडेशन ने 30% कर्मचारियों की छंटनी की, एडवोकेसी डिवीजन को बंद किया",
    "originLink": "https://techcrunch.com/2024/11/05/mozilla-foundation-lays-off-30-staff-drops-advocacy-division/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42054867",
    "commentBody": "",
    "originSummary": [
      "मोज़िला फाउंडेशन ने अपने कर्मचारियों का 30% हिस्सा, लगभग 36 कर्मचारियों को, पुनर्गठन के हिस्से के रूप में निकाल दिया है ताकि चुस्ती और फोकस को बढ़ाया जा सके।- यह वर्ष में दूसरी बार छंटनी है, जिसमें पहले की कटौती ने फ़ायरफ़ॉक्स विकास टीम को प्रभावित किया था, जो संगठन के भीतर चल रहे संरचनात्मक परिवर्तनों को दर्शाता है।- फाउंडेशन की कार्यकारी निदेशक, नबीहा सैयद ने वकालत और वैश्विक कार्यक्रमों के विभागों को हटाने पर प्रकाश डाला, जबकि वकालत को एक मुख्य फोकस के रूप में बनाए रखा, तेजी से तकनीकी परिवर्तनों के जवाब में एकीकृत कथा और रणनीतिक संचार के महत्व पर जोर दिया।"
    ],
    "commentSummary": [
      "मोज़िला फाउंडेशन अपने कर्मचारियों के 30% को नौकरी से निकाल रही है और अपने वकालत विभाग को समाप्त कर रही है, क्योंकि अगर गूगल फायरफॉक्स के डिफ़ॉल्ट सर्च इंजन के लिए भुगतान करना बंद कर देता है, तो संभावित राजस्व हानि हो सकती है, जो मोज़िला के राजस्व का 86% हिस्सा है।",
      "फायरफॉक्स के भविष्य को लेकर चिंताएँ उत्पन्न हुई हैं, जिसमें यह अटकलें भी शामिल हैं कि क्या यह एक क्रोमियम-आधारित ब्राउज़र में परिवर्तित हो सकता है, जो ब्राउज़र बाजार में इसकी अनूठी स्थिति को प्रभावित करेगा।",
      "छंटनी मोज़िला की वित्तीय कठिनाइयों को उजागर करती है और बिना फाउंडेशन के वकालत स्टाफ के इंटरनेट स्वतंत्रता और गोपनीयता वकालत के भविष्य पर सवाल उठाती है।"
    ],
    "points": 180,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1730838540
  },
  {
    "id": 42055558,
    "title": "1979 के एक रहस्यमय स्केटबोर्डर का पता लगाना",
    "originLink": "https://www.ncrabbithole.com/p/tony-hawk-fayetteville-nc-girl-skateboarder-1979",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42055558",
    "commentBody": "",
    "originSummary": [
      "टोनी हॉक ने 10 वर्षीय शॉन्डा शेन की 1979 की एक फोटो खोजी, जिसमें वह स्केटबोर्डिंग कर रही थीं। यह फोटो मूल रूप से blackarchives.co द्वारा पोस्ट की गई थी और Fayetteville Observer के अभिलेखागार में पाई गई थी।- टोनी हॉक द्वारा इसे साझा करने के बाद फोटो वायरल हो गई, जिससे Fayetteville Observer ने इसका पुनर्निर्माण किया और शॉन्डा को उनके स्केटबोर्डिंग अतीत से फिर से जोड़ा।- शॉन्डा, जो अब 56 वर्ष की हैं और Cape Fear Valley Health में काम कर रही हैं, अपने स्केटबोर्डिंग दिनों को याद करती हैं और हाल ही में अपने बेटे की रुचि से प्रेरित होकर फिर से स्केटबोर्डिंग करने की कोशिश की है।"
    ],
    "commentSummary": [
      "1979 के एक रहस्यमय स्केटबोर्डर ने ध्यान आकर्षित किया है, जिससे स्केटबोर्डिंग के स्टांस जैसे \"गूफी फुटेड\" (दायां पैर आगे) और \"रेगुलर\" (बायां पैर आगे) पर चर्चाएं शुरू हो गई हैं।- टोनी हॉक, जो उस स्केटबोर्डर के समकालीन हैं, ने इसमें रुचि दिखाई है, जिससे यह स्पष्ट होता है कि कैसे सेलिब्रिटी का ध्यान भूली-बिसरी कहानियों को पुनर्जीवित करने में प्रभाव डाल सकता है।- यह कहानी अतीत के क्षणों को फिर से खोजने की जिज्ञासा और पुरानी यादों के व्यापक रुझान को दर्शाती है, जिसमें \"गूफी-फुटेड\" शब्द का संभवतः एक डिज्नी कार्टून से उत्पत्ति हुई है।"
    ],
    "points": 179,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1730844019
  }
]
