[
  {
    "id": 40694254,
    "title": "நாங்கள் உலகின் மிகச் சிறிய மற்றும் மலிவான நெட்வொர்க் ஸ்விட்சை உருவாக்கினோம்",
    "originLink": "https://docs.murexrobotics.com/elec/boards/networking/switch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694254",
    "commentBody": "",
    "originSummary": [
      "MUREX Robotics, எக்ஸெட்டர், NH இல் இருந்து ஒரு உயர்நிலைப் பள்ளி குழு, JLCPCB இல் இருந்து $6.9 க்கு கிடைக்கும் ஒரு திறந்த மூல தொழில்நுட்பத்தை வெளியிட்டுள்ளது.",
      "அவர்கள் 25 யூனிட்களுக்குக் குறைவானவற்றை $10 மற்றும் கப்பல் செலவுடன் விற்பனை செய்கிறார்கள், மேலும் போர்டு கோப்புகள் GitHub இல் அணுகக்கூடியவையாக உள்ளன.",
      "வினவல்களுக்கு, Byran ஐ byran@mrx.ee அல்லது Max ஐ max@mrx.ee இல் தொடர்பு கொள்ளவும்."
    ],
    "commentSummary": [
      "MUREX Robotics, எக்ஸெட்டர், NH இல் இருந்து ஒரு உயர்நிலைப் பள்ளி குழு, உலகின் மிகச் சிறிய மற்றும் மலிவான நெட்வொர்க் ஸ்விட்சை $6.9 விலையில் உருவாக்கியுள்ளது.",
      "சுவிட்ச் திறந்த மூலமாகும் மற்றும் செலவினத்தை குறைத்து அணுகக்கூடியதாக வடிவமைக்கப்பட்டுள்ளது, அளவு மற்றும் செலவு முக்கியமான பயன்பாடுகளை இலக்காகக் கொண்டுள்ளது.",
      "அணி விரைவில் இந்த பலகைகளின் ஒரு சிறிய தொகுப்பை விற்க திட்டமிட்டுள்ளது, திறந்த மூல மின்னணுவியல் மூலம் தொழில்நுட்பத்தை ஜனநாயகமாக்கும் அவர்களின் பணி மீது கவனம் செலுத்துகிறது."
    ],
    "points": 527,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1718504815
  },
  {
    "id": 40694768,
    "title": "நீங்கள் ஒரு SSH ஹனிபாட்டை 30 நாட்கள் இயக்கிய பிறகு பெறுவது",
    "originLink": "https://blog.sofiane.cc/ssh_honeypot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694768",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஒரு பயனர் 30 நாட்களுக்கு SSH ஹனிபாட் இயக்கியபோது, முக்கியமாக IPv4 இடத்தை ஸ்கேன் செய்யும் \"இணைய பாதுகாப்பு நிறுவனங்கள்\" மூலம் குறிப்பிடத்தக்க சட்டவிரோத போக்குவரத்தை கவனித்தார்.",
      "இந்த நெட்வொர்க்குகளைத் தடுக்குதல் தேவையற்ற போக்குவரத்தை 50% க்கும் மேல் குறைத்தது, ஆனால் இந்த விவாதம் CGNAT (Carrier-Grade Network Address Translation) காரணமாக IP தடுக்கலின் வரம்புகளை வலியுறுத்துகிறது.",
      "Emphasis is placed on using security tools like fail2ban, VPNs, and public key authentication to protect servers, with users sharing experiences of self-hosting and the challenges of constant attacks."
    ],
    "points": 480,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1718513532
  },
  {
    "id": 40695997,
    "title": "அறையில் மிகவும் புத்திசாலியாக இருக்க முயற்சிக்காதீர்கள்; மிகவும் கருணையுள்ளவராக இருக்க முயற்சிக்கவும்",
    "originLink": "https://www.jorgegalindo.me/en/blog/posts/do-not-be-the-smartest-in-the-room-try-to-be-the-kindest",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695997",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "நல்லிணக்கத்தை அறிவு விட முக்கியமாகக் கருதுவது, கேட்பது, மரியாதை, பரிவு மற்றும் பிரச்சினை தீர்க்கும் திறன் மூலம் குழு இயக்கம் மற்றும் உற்பத்தித்திறனை மேம்படுத்த முடியும்.",
      "அன்பு நீடித்த தாக்கத்தை உருவாக்குகிறது மற்றும் நேர்மறையான வேலை சூழலை ஊக்குவிக்கிறது, இது நீண்டகால வெற்றிக்கு முக்கியமானது.",
      "புத்திசாலித்தனம் முக்கியமானது என்றாலும், தொழில்முறை சூழலில் அன்பின் நன்மைகளை குறைத்து மதிப்பிடக்கூடாது."
    ],
    "points": 349,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1718533643
  },
  {
    "id": 40696992,
    "title": "நல்ஆர்பி நீதிபதி போட்டியிடாத விதியை அநியாயமான தொழிலாளர் நடைமுறை என்று அறிவிக்கிறார்",
    "originLink": "https://www.nlrbedge.com/p/in-first-case-of-its-kind-nlrb-judge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40696992",
    "commentBody": "",
    "originSummary": [
      "என்.எல்.ஆர்.பி. நீதிபதி சாரா கார்பினன், போட்டியில்லா மற்றும் சக ஊழியர்களை அழைக்காத விதிகள் அநியாயமான தொழிலாளர் நடைமுறைகள் என்று தீர்மானித்தார், இது ஒரு முக்கியமான தீர்ப்பாகும்.",
      "இந்த வழக்கில் J.O. மொரி, இன்க். சம்பந்தப்பட்டது, அங்கு ஒரு தொழிற்சங்க அமைப்பாளர் \"சால்டிங்\" (சக ஊழியர்களை அமைத்தல்) காரணமாக பணிநீக்கம் செய்யப்பட்டார், மற்றும் நீதிபதி அந்த அமைப்பாளரை மீண்டும் பணியில் அமர்த்தி, பின்வருமானத்தை வழங்க உத்தரவிட்டார்.",
      "இது ஒரு நிர்வாக சட்ட நீதிபதி (ALJ) இந்த விதிகளை அநியாயமான தொழிலாளர் நடைமுறைகளாக தீர்மானித்த முதல் முறை ஆகும், இந்த விதிகளுக்கு எதிராக NLRB இன் நிலைப்பாட்டை வலியுறுத்துகிறது, குறிப்பாக மேற்பார்வையாளர் அல்லாத தொழிலாளர்களுக்கு."
    ],
    "commentSummary": [
      "ஒரு NLRB நீதிபதி, போட்டியிடாத விதிகள் ஒரு அநியாயமான தொழிலாளர் நடைமுறையாகும் என்று தீர்ப்பளித்துள்ளார், இது பிற கட்டுப்படுத்தும் வேலைவாய்ப்பு நடைமுறைகள் பற்றிய விவாதங்களைத் தூண்டியுள்ளது.",
      "இந்த தீர்ப்பு, வேலை வாய்ப்பு மாறுதலை தடுக்கிறது என்று சிலர் வாதிடும், பரிந்துரை வழங்குவதில் மேலாளர்களைத் தடுக்கின்ற நிறுவனக் கொள்கைகள் மற்றும் அழைப்பினைத் தடுக்கின்ற விதிமுறைகள் குறித்த விவாதங்களை ஏற்படுத்தியுள்ளது.",
      "இந்த முடிவு, வேலைக்காரர்களுக்கும் வேலை வழங்குநர்களுக்கும் இடையிலான அதிகாரத்தை சமநிலைப்படுத்துவதற்கான பெரிய உரையாடலின் ஒரு பகுதியாகும், நியாயமான அணுகுமுறையையும் வேலை சந்தை இயக்கத்தையும் உறுதிப்படுத்துவதற்கான வேலைக்காரர் பாதுகாப்புகளை அதிகரிக்க வேண்டிய கோரிக்கைகளுடன்."
    ],
    "points": 339,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1718545226
  },
  {
    "id": 40693451,
    "title": "பிரஞ்சு நீதிமன்றம் கூகுள், கிளவுட்ஃப்ளேர், சிஸ்கோ ஆகியவற்றுக்கு DNS-ஐ நச்சு ஊற்ற உத்தரவிட்டுள்ளது",
    "originLink": "https://torrentfreak.com/google-cloudflare-cisco-will-poison-dns-to-stop-piracy-block-circumvention-240613/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693451",
    "commentBody": "",
    "originSummary": [
      "ஒரு பிரெஞ்சு நீதிமன்றம் கூகுள், கிளவுட்ஃப்ளேர், மற்றும் சிஸ்கோ ஆகியவற்றை சுமார் 117 கடத்தல் விளையாட்டு ஸ்ட்ரீமிங் டொமைன்களுக்கு அணுகலை தங்களின் DNS தீர்மானிகளின் மூலம் தடுக்க உத்தரவிட்டுள்ளது, இது ஒளிபரப்பாளர் Canal+ க்கான கடத்தல் எதிர்ப்பு முயற்சிகளை தீவிரமாக்குகிறது.",
      "Canal+ க்கு இந்த தளங்களை தேடல் முடிவுகளில் இருந்து நீக்க அனுமதி வழங்கப்பட்டுள்ளது, பிரான்சில் உள்ள தற்போதைய தள-தடை சட்டங்களை பயன்படுத்தி கடத்தலை எதிர்க்க.",
      "பைரசிகள் விகிதத்தில் குறைந்த தாக்கம் பற்றிய வாதங்கள் இருந்தபோதிலும், நீதிமன்றம் Canal+ உரிமைகளை நிலைநிறுத்தியது, மேலும் Google அந்த உத்தரவைப் பின்பற்றும் என்று உறுதிப்படுத்தியுள்ளது, எதிர்கால எதிர்ப்பு பைரசிகள் உத்திகள் பற்றிய கேள்விகளை எழுப்புகிறது."
    ],
    "commentSummary": [
      "ஒரு பிரெஞ்சு நீதிமன்றம் கூகுள், கிளவுட்ஃப்ளேர், மற்றும் சிஸ்கோ ஆகியவற்றை அவர்களின் DNS தீர்மானிகளை மாற்றி சுமார் 117 கடத்தல் விளையாட்டு ஸ்ட்ரீமிங் டொமைன்களுக்கு அணுகலைத் தடுக்க உத்தரவிட்டுள்ளது.",
      "இந்த தீர்ப்பு, இதற்கு முந்தைய அமெரிக்க சட்டத்திற்கு எதிரான தொழில்நுட்ப நிறுவனங்களின் எதிர்ப்புடன் மாறுபடுகிறது, அவர்கள் தங்களின் கட்டுப்பாட்டை பராமரிக்கவும், சட்டப்பூர்வ பிரச்சினைகளை தவிர்க்கவும் தங்களின் நிலைப்பாட்டில் மாற்றத்தை வெளிப்படுத்துகிறது.",
      "விமர்சகர்கள் இந்த தடைகளை தவிர்க்க தனிப்பட்ட DNS தீர்மானிகளை பயன்படுத்த முன்மொழிகின்றனர், இது காப்புரிமை மீறல் தடுப்பு நடவடிக்கைகள் மற்றும் இணைய சுதந்திரம் ஆகியவற்றின் சமநிலையைப் பற்றி தொடர்ந்தும் விவாதங்களை ஏற்படுத்துகிறது."
    ],
    "points": 295,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1718493980
  },
  {
    "id": 40697831,
    "title": "ராஸ்பெர்ரி பை 5 ஒரு டினி-மினி-மைக்ரோ பிசிக்கு சமம் அல்ல",
    "originLink": "https://louwrentius.com/the-raspberry-pi-5-is-no-match-for-a-tini-mini-micro-pc.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40697831",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi 5, 2023 ஆம் ஆண்டின் இறுதியில் வெளியிடப்பட்டது, மேம்பட்ட செயல்திறனை வழங்குகிறது ஆனால் SD கார்டு சேமிப்பு மற்றும் முந்தைய மாதிரிகளுடன் ஒப்பிடும்போது அதிக செலவினால் இன்னும் கட்டுப்படுத்தப்பட்டுள்ளது.",
      "பிராண்டுகள் போன்ற டெல், லெனோவோ, மற்றும் எச்பி ஆகியவற்றின் இரண்டாம் கை 1L மினி பிசிக்கள் செயலாக்க சக்தி, RAM திறன், மற்றும் சேமிப்பு விருப்பங்கள் (SATA மற்றும் NVME SSDகள்) ஆகியவற்றில் பை 5 ஐ விட மேம்பட்டவை.",
      "Raspberry Pi 5 ஆற்றல் திறனுடன் செயல்படுகின்றது, ஆனால் இரண்டாம் கை மினி கணினிகள் வீட்டுப் சேவையக பயன்பாடுகளுக்கு சிறந்தவை, ஏனெனில் அவை மேம்பட்ட செயல்திறன் மற்றும் உட்பொதிக்கப்பட்ட SSD/NVME ஆதரவை கொண்டுள்ளன."
    ],
    "commentSummary": [
      "ராஸ்பெர்ரி பை 5 அதன் மலிவுத்தன்மையை இழந்துவிட்டது, ப்ரோட்காம் உடன் உள்ள சிறப்பு ஒப்பந்தம் முடிவுக்கு வந்ததால், தற்போதைய சந்தையில் அது குறைவான போட்டித்தன்மையுடன் உள்ளது.",
      "பயனர்கள் இரண்டாம் கை மினி கணினிகளில் சிறந்த மதிப்பை கண்டுபிடிக்கின்றனர், அவை ஒரே விலையில் அதிக சக்தி மற்றும் அம்சங்களை வழங்குகின்றன.",
      "பை 5 கல்வி மற்றும் GPIO (பொது நோக்க உள்ளீடு/வெளியீடு) பயன்பாடுகளில் வலுவாக இருந்தாலும், பயன்படுத்தப்பட்ட இன்டெல் NUCக்கள் அல்லது புதிய N100 மினி பிசிக்கள் பொதுவான கணினி பணிகளுக்கு மேலும் ஈர்க்கக்கூடியவையாக உள்ளன."
    ],
    "points": 257,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1718552283
  },
  {
    "id": 40693944,
    "title": "வலை உலாவியில் WebAssembly மற்றும் OpenGL பயன்படுத்தி SimCity",
    "originLink": "https://micropolisweb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693944",
    "commentBody": "",
    "originSummary": [
      "Micropolis in WebAssembly என்பது Maxis நிறுவனத்தின் மூலம் உருவாக்கப்பட்ட அசல் SimCity Classic இன் ஒரு பகுதி ஆகும், இது Will Wright ஆல் வடிவமைக்கப்பட்டது மற்றும் Don Hopkins ஆல் மாற்றப்பட்டது.",
      "திட்டம் முன்னேறி வருகிறது, தொடர்ந்து நடைபெறும் மேம்பாடு Patreon இல் ஆதரிக்கப்படுகிறது மற்றும் GitHub இல் கிடைக்கிறது.",
      "பயனர்கள் மவுஸ் மற்றும் விசைப்பலகை குறுக்கு வழிகள் போன்ற பல்வேறு கட்டுப்பாடுகளைப் பயன்படுத்தி விளையாட்டுடன் தொடர்பு கொள்ளலாம், மேலும் எதிர்கால புதுப்பிப்புகளில் கூடுதல் அம்சங்கள் மற்றும் ஈஸ்டர் முட்டைகள் வாக்குறுதி அளிக்கப்படுகின்றன."
    ],
    "commentSummary": [
      "சிம் சிட்டி வெப் உலாவியில் வெப் அசெம்ப்ளி மற்றும் ஓபன் ஜிஎல் பயன்படுத்தி மாற்றப்பட்டுள்ளது, இதனால் மென்பொருள் நிறுவ தேவையின்றி அணுகக்கூடியதாக உள்ளது.",
      "இந்த திட்டம் அசல் SimCity Classic குறியீட்டின் அடிப்படையில் அமைந்துள்ளது மற்றும் மேம்பட்ட செயல்திறன் மற்றும் அணுகல் வசதியுடன் விளையாட்டை நவீன தளங்களுக்கு கொண்டு வருவதை நோக்கமாகக் கொண்டுள்ளது.",
      "துறைமுகம் இன்னும் ஒரு பணியில் உள்ளது, பயனர் இடைமுகத்தை மேம்படுத்த, மொபைல் ஆதரவைச் சேர்க்க, மற்றும் செயல்திறனை மேம்படுத்த தொடர்ந்து முயற்சிகள் மேற்கொள்ளப்பட்டு வருகின்றன."
    ],
    "points": 214,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1718500358
  },
  {
    "id": 40694103,
    "title": "ஒரு நபர் தொழில்நுட்ப தொடக்க நிறுவனத்தின் கட்டமைப்பு (2021)",
    "originLink": "https://anthonynsimon.com/blog/one-man-saas-architecture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694103",
    "commentBody": "",
    "originSummary": [
      "பதிவு, AWS இல் Kubernetes பயன்படுத்தி ஒரே நபர் SaaS (சாப்ட்வேர் அஸ் அ சர்வீஸ்) இயக்குவதற்கான உள்கட்டமைப்பு அமைப்பை விளக்குகிறது, இதன் குறைந்த அழுத்தம் மற்றும் சுயநிதி தன்மையை முக்கியமாகக் குறிப்பிடுகிறது.",
      "முக்கிய கூறுகள் Cloudflare மற்றும் AWS உடன் போக்குவரத்து மேலாண்மை, GitHub Actions மற்றும் Flux மூலம் பிரயோக ஆட்டோமேஷன், மற்றும் Kubernetes இன் autoscaling மற்றும் liveliness probes மூலம் நம்பகத்தன்மை ஆகியவற்றை உள்ளடக்கியவை.",
      "கூடுதல் அம்சங்கள் Redis உடன் காட்சிங், Django Ratelimit உடன் வீதியை வரையறுத்தல், Celery உடன் திட்டமிட்ட பணிகள், மற்றும் New Relic மற்றும் Sentry உடன் கண்காணிப்பு ஆகியவற்றை உள்ளடக்கியது, தனிநபர் தொழில்நுட்ப ஸ்டார்ட்அப்பை மேலாண்மை செய்வதற்கான முழுமையான கண்ணோட்டத்தை வழங்குகிறது."
    ],
    "commentSummary": [
      "ஒரு தொடக்க நிறுவனத்திற்கு சிறந்த தொழில்நுட்ப குவியல் என்பது குழுவினர் ஏற்கனவே அறிந்திருக்கும் ஒன்றாகும், ஏனெனில் புதிய தொழில்நுட்பங்களை கற்றல் தேவையற்ற சிக்கல்களை ஏற்படுத்தக்கூடும்.",
      "உடனடி வெளியீட்டை முன்னுரிமையாகக் கொண்டு, பின்னர் மறுசீரமைப்பை பரிசீலிக்கவும்; பயனர்கள் அடிப்படை தொழில்நுட்பத்தை விட செயல்படும் தயாரிப்பைப் பற்றியே அதிகம் கவலைப்படுகிறார்கள்.",
      "சில புதிய தொழில்நுட்பங்கள், குபெர்னெட்ஸ் போன்றவை அதிகமாக இருக்கக்கூடும், எளிமையான தீர்வுகள், டாக்கர் ஸ்வார்ம் அல்லது மேலாண்மை சேவைகள் போன்றவை எளிமை மற்றும் அளவீட்டுத்திறனை சமநிலைப்படுத்துவதற்கு மிகவும் பொருத்தமாக இருக்கலாம்."
    ],
    "points": 203,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718502714
  },
  {
    "id": 40695839,
    "title": "சாதாரண சபோட்டாஜ் மென்பொருளுக்காக (2023)",
    "originLink": "https://erikbern.com/2023/12/13/simple-sabotage-for-software.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695839",
    "commentBody": "",
    "originSummary": [
      "சிஐஏவின் \"எளிய சபோட்டாஜ்\" புத்தகம் இரண்டாம் உலகப் போரின் போது உற்பத்தித்திறனை சீர்குலைக்கும் நிலையான ஆலோசனைகளை வழங்குகிறது, இப்போது நகைச்சுவையாக நவீன தொழில்நுட்ப சூழல்களுக்கு ஏற்ப மாற்றப்பட்டுள்ளது.",
      "பரிந்துரைக்கப்பட்ட சபோட்டாஜ் நுட்பங்களில் CTO க்கு நீண்ட மறுஎழுதல்களை தேவைப்படுத்துவது, பல்வேறு மொழிகளை ஊக்குவிப்பது, மற்றும் சிக்கல்களை அதிகரிக்க அமைப்புகளை பிரிப்பது ஆகியவை அடங்கும்.",
      "மற்ற முறைகள் பயனுள்ள அளவுகோல்களை நிராகரிப்பது, சம்பளத்தை பதவி மற்றும் குழு அளவுடன் இணைப்பது, மற்றும் ஒரு கருத்துப்பூர்வமான வேலைவாய்ப்பு செயல்முறையை உருவாக்குவது ஆகியவை, அனைத்தும் நம்பகமான நடவடிக்கைகளின் மூலம் உற்பத்தித்திறனை மெதுவாகக் குறைப்பதை நோக்கமாகக் கொண்டவை."
    ],
    "commentSummary": [
      "சாதாரண சபோட்டாஜ் பற்றிய ஒரு விவாதம், எரிக் பெர்னார்ட்சன் எழுதிய 2023 கட்டுரையை மேற்கோள் காட்டி, முதன்மை CIA சபோட்டாஜ் உத்திகள் எவ்வளவு பயனுள்ளதாக உள்ளன என்பதைக் கேள்வி எழுப்புகிறது.",
      "கருத்துரையாளர்கள் இந்த உத்தியோகபூர்வங்களின் நடைமுறை மற்றும் தாக்கத்தை விவாதிக்கின்றனர், மோசமான மேலாண்மை மற்றும் தவறான லாபத்தை மேம்படுத்துதல் இயற்கையாகவே நிறுவனங்களை முடக்கக்கூடும் என்று குறிப்பிடுகின்றனர்.",
      "உரையாடல் வரலாற்று சூழலை, தகுதியின்மையின் பங்கினை, மற்றும் சிக்கலான சுயசேவை அமைப்புகள் மற்றும் கட்டாயமாக அலுவலகத்திற்கு திரும்பும் கொள்கைகள் போன்ற நவீன நடைமுறைகளை உள்ளடக்கியுள்ளது, அவை தவறுதலாக சபோட்டாஜ் கொள்கைகளுடன் ஒத்துப்போகக்கூடும்."
    ],
    "points": 187,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1718530792
  },
  {
    "id": 40695754,
    "title": "ஐரோப்பிய மாற்றங்கள்",
    "originLink": "https://european-alternatives.eu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695754",
    "commentBody": "",
    "originSummary": [
      "இந்த பதிவில் பல்வேறு டிஜிட்டல் சேவைகள் மற்றும் தயாரிப்புகளுக்கான ஐரோப்பிய மாற்றுகளை குறிப்பிடுகிறது, உள்ளூர் வியாபாரங்களுக்கு ஆதரவு மற்றும் GDPR (பொது தரவுப் பாதுகாப்பு ஒழுங்குமுறை) கடைப்பிடிப்பை முக்கியமாகக் கூறுகிறது.",
      "இது வலை பகுப்பாய்வு, மேக கணினி, மற்றும் மின்னஞ்சல் வழங்குநர்கள் போன்ற பல்வேறு சேவைகளின் வகைகளை, கிடைக்கக்கூடிய மாற்று எண்ணிக்கையுடன் பட்டியலிடுகிறது.",
      "இந்த பதிவில் ஐரோப்பிய வழங்குநர்களை தேர்வு செய்வதன் நன்மைகளை வலியுறுத்துகிறது, இதில் VAT திருப்பிச் செலுத்தல்கள், பொதுவான ஐரோப்பிய கட்டண முறைகள், மற்றும் ஐரோப்பிய ஒன்றியத்தின் ஒருங்கிணைந்த சட்டங்களால் உரிமைகளை எளிதாக அமல்படுத்துதல் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "European Alternatives ஐரோப்பிய ஒன்றியம், ஐரோப்பிய பொருளாதார பகுதி, ஐரோப்பிய சுயாதீன வர்த்தக அமைப்பு அல்லது ஆழமான மற்றும் விரிவான சுதந்திர வர்த்தக பகுதி உறுப்பினர் நாடுகளில் உள்ள நிறுவனங்களின் தயாரிப்புகள் மற்றும் சேவைகளை பட்டியலிடுகிறது, ஐரோப்பிய ஒன்றியத்திற்கு வெளியே உள்ள துணை-ஹோஸ்டிங் வழங்குநர்களை தவிர்க்கிறது.",
      "இத்தளம் அடையாளம் மற்றும் அணுகல் மேலாண்மை, VPS வழங்குநர்கள், மற்றும் தேடுபொறிகள் போன்ற பிரிவுகளை உள்ளடக்கியது, பிரெக்சிட் பிறகு ஐக்கிய இராச்சிய விலக்கு மற்றும் ஐரோப்பிய ஒன்றிய ஒழுங்குமுறை இணக்கம் பற்றிய விவாதங்களுடன்.",
      "பயனர்கள் Hetzner மற்றும் Tuta போன்ற சேவைகளின் தரம் மற்றும் ஐரோப்பிய தொழில்நுட்பப் பரப்பில் தரவுப் பாதுகாப்பு மற்றும் போட்டியின் அரசியல் விளைவுகள் பற்றியும் விவாதிக்கின்றனர்."
    ],
    "points": 182,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718529476
  },
  {
    "id": 40698442,
    "title": "சிம் சிட்டி உருவாக்குதல்: உலகத்தை ஒரு இயந்திரத்தில் எவ்வாறு வைக்கலாம்",
    "originLink": "https://mitpress.mit.edu/9780262547482/building-simcity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40698442",
    "commentBody": "",
    "originSummary": [
      "\"சிம் சிட்டி உருவாக்கம்\" என்ற சைம் கிஙோல்டின் நூல், வில் ரைட் உருவாக்கிய முக்கியமான சிமுலேஷன் விளையாட்டு சிம் சிட்டியின் வரலாறு மற்றும் வளர்ச்சியை ஆராய்கிறது.",
      "புத்தகம் SimCity-யின் கணினி ஒத்திகை மீதான தாக்கத்தை மற்றும் விளையாட்டின் பின்னணியில் உள்ள Maxis நிறுவனத்தின் வரலாற்றை வரைபடங்கள் மற்றும் புகைப்படங்கள் போன்ற காட்சிப் பொருட்களுடன் விவரிக்கிறது.",
      "MIT பத்திரிகையால் வெளியிடப்பட்டு, இது ஜூன் 2024 முதல் இரு மிருதுப் புத்தகம் மற்றும் மின்புத்தகம் வடிவங்களில் கிடைக்கும்."
    ],
    "commentSummary": [
      "Chaim Gingold, Spore இன் ஆசிரியர் மற்றும் வடிவமைப்பாளர், ஜூலை 19 ஆம் தேதி மாலை 2 மணிக்கு (ET) Twitch இல் ROMchip இன் ஏற்பாட்டில், Will Wright அவர்களால் நேர்காணல் செய்யப்படும் ஒரு கேள்வி மற்றும் பதில் அமர்விற்கு கிடைக்கிறார்.",
      "ஸ்டீவர்ட் பிராண்ட், கிஙோல்டின் புத்தகத்தை கணினி துறையில் புதுமை மற்றும் தோற்றக் கதைகளில் சிறந்த ஒன்றாகப் பாராட்டினார்.",
      "Gingold பரிந்துரைக்கிறார் City Skylines, Minecraft, மற்றும் Tiny Glade ஆகியவை SimCityக்கு நவீன வாரிசுகளாக, விளையாட்டு மேம்பாட்டில் உருவாக்கும் AI இன் தாக்கத்தை முக்கியமாகக் குறிப்பிடுகிறார்."
    ],
    "points": 130,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1718556931
  },
  {
    "id": 40693500,
    "title": "SQLite மற்ற அனைத்து தரவுத்தொகுப்புக் இயந்திரங்களை விட அதிகமாக பயன்படுத்தப்படுவதற்கான வாய்ப்பு உள்ளது",
    "originLink": "https://sqlite.org/mostdeployed.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693500",
    "commentBody": "",
    "originSummary": [
      "SQLite என்பது மிக அதிகமாகப் பயன்படுத்தப்படும் தரவுத்தொகுப்பு இயந்திரமாகும், இது பில்லியன் கணக்கான சாதனங்கள் மற்றும் பயன்பாடுகளில், அதாவது Android, iOS, Mac, Windows 10, முக்கிய வலை உலாவிகள் மற்றும் பல பிரபலமான பயன்பாடுகளில் உள்ளது.",
      "உலகளவில் 4 பில்லியனுக்கும் மேற்பட்ட ஸ்மார்ட்போன்களில் ஒவ்வொன்றிலும் நூற்றுக்கணக்கான SQLite தரவுத்தொகுப்புகள் உள்ளன, எனவே உலகளவில் ஒரு டிரில்லியனுக்கும் மேற்பட்ட செயல்பாட்டிலுள்ள SQLite தரவுத்தொகுப்புகள் இருக்கக்கூடும்.",
      "SQLite என்பது அதிகமாகப் பயன்படுத்தப்படும் ஐந்து மென்பொருள் தொகுதிகளில் ஒன்றாகும், zlib க்கு பிறகு இரண்டாவது மிகப் பரவலாகப் பயன்படுத்தப்படும் மென்பொருள் நூலகமாகவும், ஒரு சாதனத்திற்கு பல நிகழ்வுகள் இருப்பதால் மிகப் பரவலாகப் பயன்படுத்தப்படும் மென்பொருள் கூறாகவும் இருக்கக்கூடும்."
    ],
    "commentSummary": [
      "SQLite அதன் எளிமை, நம்பகத்தன்மை மற்றும் ஆஃப்லைன் செயல்பாடு காரணமாக, மற்ற அனைத்து தரவுத்தொகுப்பு இயந்திரங்களை விட அதிகமாக பயன்படுத்தப்படுகிறது.",
      "பயனர்கள் json+zip இலிருந்து gzipped SQLite க்கு மாறுகின்றனர், ஏனெனில் தரவுத்தொகுப்புகளை பதிவிறக்கம் செய்யும்போது அல்லது பகிரும்போது சிறந்த திட்டக்கோவையைப் பின்பற்ற முடியும்.",
      "அதன் பிரபலத்திற்குப் பிறகும், SQLite பங்களிப்புகளுக்கு திறந்ததாக இல்லை, ஆனால் அதன் கோப்பு வடிவம் நன்றாக ஆவணமாக்கப்பட்டு நிலையானதாக உள்ளது, இது iOS மற்றும் Android உட்பட பல பயன்பாடுகளுக்கு சிறந்ததாக இருக்கிறது."
    ],
    "points": 126,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1718494730
  },
  {
    "id": 40699079,
    "title": "நிபுணர்கள் மற்றும் பின்பற்றுபவர்கள்",
    "originLink": "https://fs.blog/experts-vs-imitators/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699079",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "சர்ச்சை நிபுணர்களை பின்பற்றுபவர்களுடன் ஒப்பிடுகிறது, உண்மையான நிபுணத்துவம் ஆழமான புரிதலும் பயனுள்ள தொடர்பாடலும் உள்ளடக்கியது என்பதை வலியுறுத்துகிறது.",
      "நிபுணர்கள் சிக்கலான தலைப்புகளை எளிய சொற்களில் விளக்கும் திறன் முக்கியமானது என்று வாதிடுகின்றனர், தொழில்நுட்ப அறிவுடன் சேர்ந்து நல்ல தொடர்பு திறனின் முக்கியத்துவத்தை வலியுறுத்துகின்றனர்.",
      "சர்ச்சை நிபுணர்கள் சிக்கலான கருத்துக்களை சாதாரண மக்களுக்கு எடுத்துரைப்பதில் எதிர்கொள்ளும் சவால்களைப் பற்றி பேசுகிறது, இந்த சிரமங்களை விளக்க programming மொழிகள் Rust மற்றும் Python போன்ற உதாரணங்களைப் பயன்படுத்துகிறது."
    ],
    "points": 121,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1718562798
  },
  {
    "id": 40695165,
    "title": "எனது முதல் எம்பெடெட் லினக்ஸ் அமைப்பை உருவாக்குதல்",
    "originLink": "https://popovicu.com/posts/making-my-first-embedded-linux-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695165",
    "commentBody": "",
    "originSummary": [
      "பதிவு, முன் அனுபவமின்றி ஒரு லினக்ஸ் அமைப்பை அடிப்படையில் உருவாக்கும் பயணத்தை விவரிக்கிறது, ஆரம்பத்தில் எந்த PCB (அச்சு மின்சுற்று பலகை) அனுபவமும் இல்லாமல்.",
      "முக்கிய படிகள் Atmel ATtiny போன்ற மைக்ரோகண்ட்ரோலர்களை நிரலாக்குவது, தனிப்பயன் PCB வடிவமைப்பது, மற்றும் F1C100s SoC (சிஸ்டம் ஆன் சிப்) பயன்படுத்தி ஒரு எம்பெடெட் லினக்ஸ் போர்டை உருவாக்குவது ஆகியவற்றை உள்ளடக்கியவை.",
      "திட்டம் avrdude போன்ற கருவிகளை பயன்படுத்தி நிரலாக்கம் செய்வது, சிக்கலான வழிமுறைகளுக்கான 4-அடுக்கு PCB மற்றும் தனிப்பயன் பலகைக்கு Lichee Pi மென்பொருள் படத்தை ஏற்படுத்துவது ஆகியவற்றை உள்ளடக்கியது."
    ],
    "commentSummary": [
      "ஒரு பயனர் தங்கள் முதல் எம்பெடெட் லினக்ஸ் அமைப்பை உருவாக்கிய அனுபவத்தை பகிர்ந்து கொண்டார், இது தொழில்நுட்ப விவரங்கள் மற்றும் மேம்பாடுகள் பற்றிய விவாதத்தை தூண்டியது.",
      "முக்கிய அம்சங்களில் 16 மெகாபிட் ஃபிளாஷ், வேறுபட்ட வழிமுறை, மற்றும் எஸ்.டி கார்டு இணைப்பியைச் சேர்ப்பதன் சாத்தியமான நன்மைகள் அடங்கும்.",
      "திட்டம் 533MHz ஒற்றை-மைய ARMv7 உடன் 32MB உள்ளக DRAM கொண்ட Allwinner F1C100S ஐ பயன்படுத்தியது, இது மற்ற ஒத்த செயலிகளுடன் ஒப்பீடுகளை தூண்டியது."
    ],
    "points": 120,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1718520685
  },
  {
    "id": 40693787,
    "title": "2,299 தலைப்புகள் பற்றிய வலைப்பதிவுகளின் தொகுப்பு",
    "originLink": "https://ooh.directory/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693787",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "புதிய 2,299 வலைப்பதிவுகளின் தொகுப்பு பல்வேறு தலைப்புகளில் ooh.directory இல் தொடங்கப்பட்டுள்ளது, இது யாஹூவின் வகைப்படுத்தப்பட்ட இணைப்பு அடைவு போன்ற ஆரம்ப இணைய அடைவுகளை நினைவூட்டுகிறது.",
      "பயனர்கள் விளம்பரங்களால் நிரம்பிய தேடுபொறிகளுடன் ஒப்பிடும்போது, கண்டறிதல் திறனை மேம்படுத்தும் வகையில் தொகுக்கப்பட்ட அடைவு இயல்பை பாராட்டுகின்றனர்.",
      "அறிவிப்பு குறிப்பேடு புதிய வலைப்பதிவுகள் மற்றும் நேர்காணல் பெறுபவர்களை கண்டுபிடிக்க ஒரு மதிப்புமிக்க வளமாகக் கருதப்படுகிறது, குறிப்பாக AI உருவாக்கிய உள்ளடக்கம் பரவலாக உள்ள காலத்தில்."
    ],
    "points": 116,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1718498525
  }
]
