[
  {
    "id": 40694254,
    "title": "״יצרנו את המתג הרשת הקטן והזול ביותר בעולם״",
    "originLink": "https://docs.murexrobotics.com/elec/boards/networking/switch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694254",
    "commentBody": "",
    "originSummary": [
      "מורקס רובוטיקה, צוות תיכון מאקסטר, ניו המפשייר, שחרר טכנולוגיה בקוד פתוח הזמינה במחיר של 6.9 דולר מ-JLCPCB.",
      "״הם מוכרים סדרה מוגבלת של פחות מ-25 יחידות במחיר של 10 דולר בתוספת משלוח, עם קבצי לוח נגישים ב-GitHub.״",
      "״לשאלות, פנו לביירן בכתובת byran@mrx.ee או למקס בכתובת max@mrx.ee.״"
    ],
    "commentSummary": [
      "מורקס רובוטיקה, צוות תיכון מאקסטר, ניו המפשייר, פיתח את מתג הרשת הקטן והזול ביותר בעולם, במחיר של 6.9 דולר.",
      "מתג זה הוא קוד פתוח ומתוכנן להיות חסכוני ונגיש, ומיועד ליישומים שבהם הגודל והעלות הם קריטיים.",
      "״הצוות מתכנן למכור בקרוב כמות קטנה של לוחות אלה, תוך הדגשת משימתם להנגיש טכנולוגיה באמצעות אלקטרוניקה בקוד פתוח.״"
    ],
    "points": 527,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1718504815
  },
  {
    "id": 40694768,
    "title": "מה מקבלים לאחר הפעלת מלכודת SSH למשך 30 יום",
    "originLink": "https://blog.sofiane.cc/ssh_honeypot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694768",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״משתמש שהפעיל מלכודת SSH למשך 30 ימים ציין תעבורה בלתי לגיטימית משמעותית, בעיקר מחברות \"אבטחת אינטרנט\" שסורקות את מרחב ה-IPv4.״",
      "חסימת הרשתות הללו הפחיתה את התעבורה הלא רצויה ביותר מ-50%, אך הדיון מדגיש את המגבלות של חסימת IP בשל CGNAT (תרגום כתובות רשת ברמת ספק השירות).",
      "ניתן דגש על שימוש בכלי אבטחה כמו fail2ban, VPNs ואימות מפתח ציבורי להגנה על שרתים, כאשר משתמשים משתפים חוויות של אירוח עצמי והאתגרים של התקפות מתמידות."
    ],
    "points": 480,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1718513532
  },
  {
    "id": 40695997,
    "title": "אל תנסה להיות החכם ביותר בחדר; נסה להיות האדיב ביותר",
    "originLink": "https://www.jorgegalindo.me/en/blog/posts/do-not-be-the-smartest-in-the-room-try-to-be-the-kindest",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695997",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "להדגיש אדיבות על פני אינטליגנציה יכול לשפר את הדינמיקה והפרודוקטיביות של הצוות באמצעות הקשבה, כבוד, אמפתיה ופתרון בעיות.",
      "נדיבות יוצרת השפעה מתמשכת ומטפחת סביבה עבודה חיובית, שהיא חיונית להצלחה לטווח הארוך.",
      "בעוד שאינטליגנציה היא חשובה, אין להמעיט בערכן של היתרונות של אדיבות בסביבה מקצועית."
    ],
    "points": 349,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1718533643
  },
  {
    "id": 40696992,
    "title": "שופט NLRB מכריז כי סעיף אי-תחרות הוא נוהג עבודה בלתי הוגן",
    "originLink": "https://www.nlrbedge.com/p/in-first-case-of-its-kind-nlrb-judge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40696992",
    "commentBody": "",
    "originSummary": [
      "״השופטת של NLRB, שרה קרפינן, פסקה כי סעיפי אי-תחרות ואי-שידול עמיתים לעבודה הם פרקטיקות עבודה לא הוגנות, מה שמסמן החלטה תקדימית.״",
      "״המקרה כלל את חברת J.O. Mory, Inc., שבה מארגן איגוד פוטר בשל \"המלחה\" (ארגון עמיתים לעבודה), והשופט הורה על השבת המארגן לעבודה עם תשלום רטרואקטיבי.״",
      "״זוהי הפעם הראשונה ששופט חוק מנהלי (ALJ) פסק כי סעיפים אלו הם פרקטיקות עבודה לא הוגנות, מה שמדגיש את עמדת ה-NLRB נגד סעיפים כאלה עבור עובדים שאינם מפקחים.״"
    ],
    "commentSummary": [
      "שופט של ה-NLRB פסק כי סעיפי אי-תחרות הם פרקטיקה לא הוגנת בעבודה, מה שהצית דיונים על פרקטיקות מגבילות אחרות בתעסוקה.",
      "פסק הדין הוביל לדיונים על סעיפי אי-שידול ומדיניות חברות שמגבילות מנהלים מלתת המלצות, שלדעת חלק מהאנשים פוגעות בניידות תעסוקתית.",
      "ההחלטה הזו היא חלק משיחה רחבה יותר על איזון הכוח בין מעסיקים לעובדים, עם קריאות להגברת ההגנות על העובדים כדי להבטיח יחס הוגן וניידות בשוק העבודה."
    ],
    "points": 339,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1718545226
  },
  {
    "id": 40693451,
    "title": "בית משפט צרפתי מורה לגוגל, Cloudflare, סיסקו להרעיל DNS כדי לעצור פיראטיות",
    "originLink": "https://torrentfreak.com/google-cloudflare-cisco-will-poison-dns-to-stop-piracy-block-circumvention-240613/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693451",
    "commentBody": "",
    "originSummary": [
      "״בית משפט צרפתי הורה לגוגל, Cloudflare וסיסקו לחסום גישה לכ-117 דומיינים של סטרימינג פיראטי של ספורט דרך פותרי ה-DNS שלהם, מה שמגביר את מאמצי המלחמה בפיראטיות עבור השדרן Canal+.״",
      "Canal+ קיבלה גם אישור להסיר אתרים אלה מתוצאות החיפוש, תוך ניצול חוקי חסימת האתרים הקיימים בצרפת למאבק בפיראטיות.",
      "על אף הטענות לגבי ההשפעה המינימלית על שיעורי הפיראטיות, בית המשפט אישר את זכויות Canal+, וגוגל אישרה כי תציית לצו, מה שמעלה שאלות לגבי אסטרטגיות עתידיות למניעת פיראטיות."
    ],
    "commentSummary": [
      "״בית משפט צרפתי הורה לגוגל, Cloudflare, ו-Cisco לשנות את פותרי ה-DNS שלהם כדי לחסום גישה לכ-117 דומיינים של אתרי סטרימינג פיראטיים של ספורט.״",
      "פסק דין זה מנוגד להתנגדות הקודמת של חברות הטכנולוגיה לחקיקה דומה בארה\"ב, ומדגיש שינוי בעמדתן לשמור על שליטה ולהימנע מבעיות משפטיות.",
      "מבקרים מציעים להשתמש בפתרונות DNS אישיים כדי לעקוף את החסימות הללו, מה שמעורר ויכוחים מתמשכים על האיזון בין אמצעי מניעת פיראטיות לחופש האינטרנט."
    ],
    "points": 295,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1718493980
  },
  {
    "id": 40697831,
    "title": "ה-Raspberry Pi 5 אינו משתווה למחשב Tini-Mini-Micro",
    "originLink": "https://louwrentius.com/the-raspberry-pi-5-is-no-match-for-a-tini-mini-micro-pc.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40697831",
    "commentBody": "",
    "originSummary": [
      "ה-Raspberry Pi 5, שיצא בסתיו 2023, מציע ביצועים משופרים אך עדיין מוגבל על ידי אחסון בכרטיס SD ועלויות גבוהות יותר בהשוואה לדגמים קודמים.",
      "מחשבי מיני 1L יד שנייה ממותגים כמו Dell, Lenovo ו-HP עולים על ה-Pi 5 מבחינת כוח עיבוד, קיבולת זיכרון RAM ואפשרויות אחסון (SATA ו-NVME SSDs).",
      "״בעוד שרספברי פאי 5 הוא חסכוני באנרגיה, מחשבי מיני יד שנייה מתאימים יותר ליישומי שרת ביתי בשל הביצועים העדיפים שלהם ותמיכה מובנית ב-SSD/NVME.״"
    ],
    "commentSummary": [
      "ה-Raspberry Pi 5 איבד את נגישותו הכלכלית עקב סיום עסקה מיוחדת עם Broadcom, מה שהופך אותו לפחות תחרותי בשוק הנוכחי.",
      "משתמשים מוצאים ערך טוב יותר במחשבי מיני יד שנייה, המציעים יותר כוח ותכונות במחיר דומה.",
      "״בעוד שה-Pi 5 נשאר חזק ביישומים חינוכיים וביישומי GPIO (קלט/פלט כללי), חלופות כמו NUCs של אינטל משומשים או מחשבי מיני N100 חדשים הם יותר אטרקטיביים למשימות מחשוב כלליות.״"
    ],
    "points": 257,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1718552283
  },
  {
    "id": 40693944,
    "title": "SimCity בדפדפן האינטרנט באמצעות WebAssembly ו-OpenGL",
    "originLink": "https://micropolisweb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693944",
    "commentBody": "",
    "originSummary": [
      "Micropolis ב-WebAssembly הוא גרסה של SimCity Classic המקורי של Maxis, שעוצב על ידי ויל רייט והועבר על ידי דון הופקינס.",
      "״הפרויקט מתפתח, עם פיתוח מתמשך הנתמך ב-Patreon וזמין ב-GitHub.״",
      "משתמשים יכולים לתקשר עם המשחק באמצעות בקרות שונות, כגון עכבר וקיצורי מקלדת, עם תכונות נוספות וביצי פסחא מובטחות בעדכונים עתידיים."
    ],
    "commentSummary": [
      "סימסיטי הועבר לדפדפן האינטרנט באמצעות WebAssembly ו-OpenGL, מה שהופך אותו לנגיש ללא צורך בהתקנת תוכנה.",
      "פרויקט זה מבוסס על קוד המקור של SimCity Classic המקורי ושואף להביא את המשחק לפלטפורמות מודרניות עם ביצועים משופרים ונגישות מוגברת.",
      "״הנמל עדיין בעבודה, עם מאמצים מתמשכים לשפר את ממשק המשתמש, להוסיף תמיכה במובייל ולייעל את הביצועים.״"
    ],
    "points": 214,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1718500358
  },
  {
    "id": 40694103,
    "title": "ארכיטקטורה מאחורי סטארט-אפ טכנולוגי של אדם אחד (2021)",
    "originLink": "https://anthonynsimon.com/blog/one-man-saas-architecture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694103",
    "commentBody": "",
    "originSummary": [
      "״הפוסט מתאר את תשתית ההקמה להפעלת SaaS (תוכנה כשירות) על ידי אדם אחד באמצעות Kubernetes על AWS, תוך הדגשת אופיו נטול הלחץ והמימון העצמי שלו.״",
      "״רכיבים מרכזיים כוללים ניהול תעבורה עם Cloudflare ו-AWS, אוטומציה של פריסה באמצעות GitHub Actions ו-Flux, ואמינות באמצעות יכולות האוטוסקיילינג ובדיקות החיות של Kubernetes.״",
      "מאפיינים נוספים כוללים שמירה במטמון עם Redis, הגבלת קצב עם Django Ratelimit, משימות מתוזמנות עם Celery, וניטור עם New Relic ו-Sentry, המספקים סקירה מקיפה של ניהול סטארטאפ טכנולוגי עצמאי."
    ],
    "commentSummary": [
      "״ערימת הטכנולוגיות הטובה ביותר לסטארטאפ היא זו שהצוות כבר מכיר, שכן לימוד טכנולוגיות חדשות יכול להוסיף מורכבות מיותרת.״",
      "לתעדף פריסה מהירה ולשקול רפקטורינג מאוחר יותר; המשתמשים מתעניינים יותר במוצר פונקציונלי מאשר בטכנולוגיה הבסיסית.",
      "״בעוד שחלק מהטכנולוגיות החדשות כמו Kubernetes עשויות להיות מוגזמות, פתרונות פשוטים יותר כמו Docker Swarm או שירותים מנוהלים יכולים להיות מתאימים יותר לאיזון בין פשטות ויכולת הרחבה.״"
    ],
    "points": 203,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718502714
  },
  {
    "id": 40695839,
    "title": "חבלה פשוטה לתוכנה (2023)",
    "originLink": "https://erikbern.com/2023/12/13/simple-sabotage-for-software.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695839",
    "commentBody": "",
    "originSummary": [
      "הספר 'חבלה פשוטה' של ה-CIA ממלחמת העולם השנייה מספק עצות נצחיות על שיבוש פרודוקטיביות, וכעת מותאם בהומור לסביבות טכנולוגיות מודרניות.",
      "דרכי חבלה מוצעות עבור מנהל טכנולוגיות ראשי כוללות דרישה לשכתובים ממושכים, עידוד שימוש בשפות תכנות מגוונות, ופיצול מערכות להגדלת המורכבות.",
      "דרכים אחרות כוללות התעלמות ממדדים שימושיים, קישור פיצויים לתואר וגודל הצוות, ויצירת תהליך גיוס סובייקטיבי, כל זאת במטרה להאט בעדינות את הפרודוקטיביות באמצעות פעולות סבירות."
    ],
    "commentSummary": [
      "״דיון על חבלה פשוטה בתוכנה, בהתייחס למאמר מ-2023 מאת אריק ברנהרדסון, מעלה שאלות לגבי היעילות של טקטיקות החבלה המקוריות של ה-CIA.״",
      "פרשנים מתווכחים על המעשיות וההשפעה של אסטרטגיות אלו, ומציינים כי ניהול גרוע ואופטימיזציה מוטעית של רווחים יכולים באופן טבעי לשתק ארגונים.",
      "השיחה כוללת הקשר היסטורי, תפקיד של חוסר יכולת, ופרקטיקות מודרניות כמו מערכות שירות עצמי מורכבות ומדיניות חובה לחזרה למשרד שעשויות להתאים באופן בלתי מכוון לעקרונות חבלה."
    ],
    "points": 187,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1718530792
  },
  {
    "id": 40695754,
    "title": "חלופות אירופאיות",
    "originLink": "https://european-alternatives.eu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695754",
    "commentBody": "",
    "originSummary": [
      "הפוסט מדגיש חלופות אירופאיות לשירותים ומוצרים דיגיטליים שונים, תוך שימת דגש על תמיכה בעסקים מקומיים והקפדה על תקנות הגנת המידע הכלליות (GDPR).",
      "״הוא מפרט קטגוריות של שירותים עם מספר החלופות הזמינות, כגון ניתוח אתרים, מחשוב ענן וספקי דואר אלקטרוני, בין היתר.״",
      "הפוסט מדגיש את היתרונות בבחירת ספקים אירופיים, כולל החזרי מע\"מ, שיטות תשלום אירופיות נפוצות ואכיפת זכויות קלה יותר בתוך האיחוד האירופי בשל חוקים מאוחדים."
    ],
    "commentSummary": [
      "אלטרנטיבות אירופאיות מפרטות מוצרים ושירותים מחברות המבוססות במדינות החברות באיחוד האירופי, האזור הכלכלי האירופי, איגוד הסחר החופשי האירופי, או במדינות החתומות על הסכם הסחר החופשי המעמיק והמקיף, למעט ספקי אירוח משנה שאינם חלק מהאיחוד האירופי/איגוד הסחר החופשי האירופי.",
      "״האתר מכסה קטגוריות כגון ניהול זהויות וגישה, ספקי VPS, ומנועי חיפוש, עם דיונים על ההדרה של בריטניה לאחר הברקזיט ועמידה בתקנות האיחוד האירופי.״",
      "משתמשים גם מתווכחים על איכות השירותים כמו Hetzner ו-Tuta, ועל ההשלכות הגיאופוליטיות של פרטיות נתונים ותחרות בנוף הטכנולוגי האירופי."
    ],
    "points": 182,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718529476
  },
  {
    "id": 40698442,
    "title": "בניית SimCity: איך לשים את העולם במכונה",
    "originLink": "https://mitpress.mit.edu/9780262547482/building-simcity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40698442",
    "commentBody": "",
    "originSummary": [
      "ספרו של חיים גינגולד, 'בניית SimCity', חוקר את ההיסטוריה והפיתוח של משחק הסימולציה המשפיע SimCity, שנוצר על ידי ויל רייט.",
      "הספר עוסק בהשפעת SimCity על סימולציה ממוחשבת ובהיסטוריה של Maxis, החברה שמאחורי המשחק, עם חומרים ויזואליים כמו דיאגרמות ותצלומים.",
      "פורסם על ידי הוצאת MIT Press, הוא יהיה זמין הן בפורמט כריכה רכה והן בפורמט ספר אלקטרוני החל מיוני 2024."
    ],
    "commentSummary": [
      "״חיים גינגולד, מחבר ומעצב במשחק Spore, זמין למפגש שאלות ותשובות, כאשר ויל רייט יראיין אותו ב-19 ביולי בשעה 2 בצהריים לפי שעון מזרח ארה\"ב ב-Twitch, בהנחיית ROMchip.״",
      "סטיוארט בראנד שיבח את ספרו של גינגולד כאחד מסיפורי המקור והדיווחים הטובים ביותר על חדשנות במחשוב.",
      "גינגולד ממליץ על City Skylines, Minecraft ו-Tiny Glade כיורשים מודרניים ל-SimCity, ומדגיש את ההשפעה של בינה מלאכותית גנרטיבית על פיתוח משחקים."
    ],
    "points": 130,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1718556931
  },
  {
    "id": 40693500,
    "title": "סביר להניח ש-SQLite בשימוש יותר מכל מנועי מסדי הנתונים האחרים יחד",
    "originLink": "https://sqlite.org/mostdeployed.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693500",
    "commentBody": "",
    "originSummary": [
      "SQLite היא מנוע מסד הנתונים הנפוץ והמשומש ביותר, הנמצא במיליארדי מכשירים ויישומים, כולל Android, iOS, Mac, Windows 10, דפדפני אינטרנט מרכזיים ויישומים פופולריים שונים.",
      "עם למעלה מ-4 מיליארד סמארטפונים שכל אחד מהם מכיל מאות מסדי נתונים של SQLite, סביר להניח שישנם למעלה מטריליון מסדי נתונים פעילים של SQLite ברחבי העולם.",
      "SQLite היא אחת מחמשת המודולים התוכנה המותקנים ביותר, ייתכן שהיא הספרייה התוכנה השנייה הכי נפוצה אחרי zlib, וייתכן שהיא הרכיב התוכנה הכי נפוץ בשל מספר המופעים שלה בכל מכשיר."
    ],
    "commentSummary": [
      "SQLite נמצא בשימוש נרחב, ככל הנראה יותר מכל מנועי מסדי הנתונים האחרים יחד, בשל קלות השימוש, האמינות והפונקציונליות הלא מקוונת שלו.",
      "״משתמשים עוברים מ-json+zip ל-SQLite דחוס ב-gzip לאכיפת סכימה טובה יותר בעת הורדת נתונים לגיבויים או שיתוף.״",
      "״למרות הפופולריות שלו, SQLite אינו פתוח לתרומות, אך פורמט הקבצים שלו מתועד היטב ויציב, מה שהופך אותו לאידיאלי עבור יישומים רבים, כולל iOS ו-Android.״"
    ],
    "points": 126,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1718494730
  },
  {
    "id": 40699079,
    "title": "מומחים מול מחקים",
    "originLink": "https://fs.blog/experts-vs-imitators/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699079",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "דיון זה משווה בין מומחים לחקיינים, ומדגיש כי מומחיות אמיתית כוללת הבנה מעמיקה ותקשורת יעילה.",
      "מומחים טוענים כי היכולת להסביר נושאים מורכבים במונחים פשוטים היא קריטית, ומדגישים את החשיבות של כישורי תקשורת טובים לצד ידע טכני.",
      "״השיחה נוגעת באתגרים שאיתם מתמודדים מומחים בהעברת מושגים מורכבים לאנשים שאינם מומחים, תוך שימוש בדוגמאות כמו שפות התכנות ראסט ופייתון כדי להמחיש את הקשיים הללו.״"
    ],
    "points": 121,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1718562798
  },
  {
    "id": 40695165,
    "title": "יצירת מערכת לינוקס משובצת ראשונה שלי",
    "originLink": "https://popovicu.com/posts/making-my-first-embedded-linux-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695165",
    "commentBody": "",
    "originSummary": [
      "״הפוסט מפרט את מסעו של המחבר בבניית מערכת לינוקס מאפס, החל ללא ניסיון קודם ב-PCB (לוח מעגלים מודפס).״",
      "״השלבים המרכזיים כוללים תכנות מיקרו-בקרים כמו ה-Atmel ATtiny, תכנון PCB מותאם אישית, ויצירת לוח לינוקס משובץ באמצעות ה-F1C100s SoC (מערכת על שבב).״",
      "״הפרויקט כלל שימוש בכלים כמו avrdude לתכנות, PCB בעל 4 שכבות לניתוב מורכב, והתאמת תמונת תוכנה של Lichee Pi ללוח המותאם אישית.״"
    ],
    "commentSummary": [
      "משתמש שיתף את חווייתו ביצירת מערכת לינוקס משובצת ראשונה שלו, מה שעורר דיון על פרטים טכניים ושיפורים.",
      "״נקודות מפתח כוללות את השימוש בזיכרון פלאש של 16 מגה-ביט, ניתוב דיפרנציאלי, והיתרונות הפוטנציאליים של הוספת מחבר כרטיס SD.״",
      "הפרויקט השתמש ב-Allwinner F1C100S, מעבד ARMv7 חד-ליבתי במהירות 533MHz עם 32MB של DRAM מובנה, מה שהוביל להשוואות עם מעבדים דומים אחרים."
    ],
    "points": 120,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1718520685
  },
  {
    "id": 40693787,
    "title": "מאגר של 2,299 בלוגים על כל נושא",
    "originLink": "https://ooh.directory/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693787",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "״אוסף חדש של 2,299 בלוגים בנושאים שונים הושק באתר ooh.directory, המזכיר את ספריות האינטרנט המוקדמות כמו ספריית הקישורים הממוינת של Yahoo.״",
      "״משתמשים מעריכים את האופי המותאם של המדריך, שמשפר את יכולת הגילוי בהשוואה למנועי חיפוש מלאי פרסומות.״",
      "ספריית הכתובות נחשבת למשאב יקר ערך למציאת בלוגים חדשים ומרואיינים, במיוחד בעידן שבו תוכן שנוצר על ידי בינה מלאכותית נפוץ."
    ],
    "points": 116,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1718498525
  }
]
