[
  {
    "id": 40694254,
    "title": "Teimme maailman pienimmän ja halvimman verkkokytkimen",
    "originLink": "https://docs.murexrobotics.com/elec/boards/networking/switch",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694254",
    "commentBody": "",
    "originSummary": [
      "MUREX Robotics, Exeterin, NH:n lukiotiimi, on julkaissut avoimen lähdekoodin teknologian, joka on saatavilla 6,9 dollarilla JLCPCB:ltä.",
      "He myyvät alle 25 yksikön rajoitettua erää hintaan 10 dollaria plus toimituskulut, ja piirilevytiedostot ovat saatavilla GitHubissa.",
      "Ota yhteyttä tiedusteluissa Byraniin osoitteessa byran@mrx.ee tai Maxiin osoitteessa max@mrx.ee."
    ],
    "commentSummary": [
      "MUREX Robotics, Exeterin, NH:n lukiotiimi, on kehittänyt maailman pienimmän ja halvimman verkkokytkimen, jonka hinta on 6,9 dollaria.",
      "Kytkin on avoimen lähdekoodin ja suunniteltu kustannustehokkaaksi ja helposti saatavilla olevaksi, kohdistuen sovelluksiin, joissa koko ja kustannukset ovat kriittisiä.",
      "Tiimi aikoo pian myydä pienen erän näitä piirilevyjä, korostaen heidän tavoitettaan demokratisoida teknologiaa avoimen lähdekoodin elektroniikan avulla."
    ],
    "points": 527,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1718504815
  },
  {
    "id": 40694768,
    "title": "Mitä saat, kun ajat SSH-hunajapurkkia 30 päivän ajan",
    "originLink": "https://blog.sofiane.cc/ssh_honeypot/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694768",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "30 päivää SSH-hunajapurkkia ajanut käyttäjä huomasi merkittävää laittomaa liikennettä, pääasiassa IPv4-tilaa skannaavilta \"internet-turvallisuusyrityksiltä\".",
      "Estojen asettaminen näille verkoille vähensi ei-toivottua liikennettä yli 50 %, mutta keskustelu korostaa IP-estoihin liittyviä rajoituksia CGNAT:n (Carrier-Grade Network Address Translation) vuoksi.",
      "Painotetaan tietoturvatyökalujen, kuten fail2banin, VPN:ien ja julkisen avaimen todennuksen, käyttöä palvelimien suojaamiseksi, ja käyttäjät jakavat kokemuksiaan itseisännöinnistä ja jatkuvien hyökkäysten haasteista."
    ],
    "points": 480,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1718513532
  },
  {
    "id": 40695997,
    "title": "Älä yritä olla huoneen älykkäin; yritä olla ystävällisin",
    "originLink": "https://www.jorgegalindo.me/en/blog/posts/do-not-be-the-smartest-in-the-room-try-to-be-the-kindest",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695997",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Korostamalla ystävällisyyttä älykkyyden sijaan voidaan parantaa tiimidynamiikkaa ja tuottavuutta kuuntelemisen, kunnioituksen, empatian ja ongelmanratkaisun kautta.",
      "Ystävällisyys luo pysyvän vaikutuksen ja edistää positiivista työympäristöä, mikä on ratkaisevan tärkeää pitkän aikavälin menestyksen kannalta.",
      "Vaikka älykkyys on tärkeää, ei ammatillisessa ympäristössä ilmenevän ystävällisyyden hyötyjä tulisi aliarvioida."
    ],
    "points": 349,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1718533643
  },
  {
    "id": 40696992,
    "title": "NLRB-tuomari julistaa kilpailukieltolausekkeen epäoikeudenmukaiseksi työvoimakäytännöksi",
    "originLink": "https://www.nlrbedge.com/p/in-first-case-of-its-kind-nlrb-judge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40696992",
    "commentBody": "",
    "originSummary": [
      "NLRB-tuomari Sarah Karpinen päätti, että kilpailukieltosopimukset ja työkavereiden houkuttelukieltolausekkeet ovat epäoikeudenmukaisia työvoimakäytäntöjä, mikä merkitsee merkittävää päätöstä.",
      "Tapaus koski J.O. Mory, Inc.:iä, jossa ammattiliiton järjestäjä erotettiin \"suolaamisen\" (työkavereiden järjestämisen) vuoksi, ja tuomari määräsi järjestäjän palautettavaksi työhönsä takautuvalla palkalla.",
      "Tämä on ensimmäinen kerta, kun hallintolain tuomari (ALJ) on todennut nämä lausekkeet epäoikeudenmukaisiksi työvoimakäytännöiksi, korostaen NLRB:n kantaa tällaisia lausekkeita vastaan ei-valvovien työntekijöiden osalta."
    ],
    "commentSummary": [
      "Työoikeuslautakunnan tuomari on todennut, että kilpailukieltosopimukset ovat epäoikeudenmukainen työvoimakäytäntö, mikä on herättänyt keskusteluja muista rajoittavista työsuhdekäytännöistä.",
      "Tuomio on johtanut keskusteluihin houkuttelukieltolausekkeista ja yrityskäytännöistä, jotka estävät johtajia antamasta suosituksia, joiden jotkut väittävät haittaavan työpaikan vaihtamista.",
      "Tämä päätös on osa laajempaa keskustelua vallan tasapainottamisesta työnantajien ja työntekijöiden välillä, ja siihen liittyy vaatimuksia työntekijöiden suojelun lisäämisestä oikeudenmukaisen kohtelun ja työmarkkinoiden liikkuvuuden varmistamiseksi."
    ],
    "points": 339,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1718545226
  },
  {
    "id": 40693451,
    "title": "Ranskalainen tuomioistuin määrää Googlen, Cloudflaren ja Ciscon myrkyttämään DNS:n piratismin estämiseksi",
    "originLink": "https://torrentfreak.com/google-cloudflare-cisco-will-poison-dns-to-stop-piracy-block-circumvention-240613/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693451",
    "commentBody": "",
    "originSummary": [
      "Ranskalainen tuomioistuin on määrännyt Googlen, Cloudflaren ja Ciscon estämään pääsyn noin 117 piraattiurheilun suoratoistodomeenille heidän DNS-resolvereidensa kautta, tehostaen Canal+-lähetysyhtiön piratisminvastaisia toimia.",
      "Canal+ on myös saanut luvan poistaa nämä sivustot hakutuloksista hyödyntäen Ranskan nykyisiä sivustojen estämistä koskevia lakeja piratismin torjumiseksi.",
      "Huolimatta väitteistä, joiden mukaan vaikutus piratismiin olisi vähäinen, tuomioistuin vahvisti Canal+:n oikeudet, ja Google on vahvistanut noudattavansa määräystä, mikä herättää kysymyksiä tulevista piratismin vastaisista strategioista."
    ],
    "commentSummary": [
      "Ranskalainen tuomioistuin on määrännyt Googlen, Cloudflaren ja Ciscon muuttamaan DNS-resolvaajiaan estääkseen pääsyn noin 117 piraattiurheilun suoratoistosivustolle.",
      "Tämä päätös on ristiriidassa teknologia-alan yritysten aiemman vastustuksen kanssa vastaavaa Yhdysvaltain lainsäädäntöä kohtaan, mikä korostaa muutosta niiden kannassa hallinnan säilyttämiseksi ja oikeudellisten ongelmien välttämiseksi.",
      "Kriitikot ehdottavat henkilökohtaisten DNS-resolverien käyttöä näiden estojen kiertämiseksi, mikä on käynnistänyt jatkuvia keskusteluja piratismin vastaisten toimien ja internetin vapauden tasapainosta."
    ],
    "points": 295,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1718493980
  },
  {
    "id": 40697831,
    "title": "Raspberry Pi 5 ei pärjää Tini-Mini-Micro PC:lle",
    "originLink": "https://louwrentius.com/the-raspberry-pi-5-is-no-match-for-a-tini-mini-micro-pc.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40697831",
    "commentBody": "",
    "originSummary": [
      "Raspberry Pi 5, joka julkaistiin syksyllä 2023, tarjoaa parannettua suorituskykyä, mutta sitä rajoittaa edelleen SD-korttimuisti ja korkeammat kustannukset verrattuna aiempiin malleihin.",
      "Toisen käden 1L minitietokoneet, kuten Dell, Lenovo ja HP, ylittävät Pi 5:n suorituskyvyssä, RAM-muistin kapasiteetissa ja tallennusvaihtoehdoissa (SATA ja NVME SSD:t).",
      "Vaikka Raspberry Pi 5 on energiatehokas, käytetyt mini-PC:t sopivat paremmin kotipalvelinsovelluksiin niiden paremman suorituskyvyn ja sisäänrakennetun SSD/NVME-tuen ansiosta."
    ],
    "commentSummary": [
      "Raspberry Pi 5 on menettänyt edullisuutensa Broadcomin kanssa tehdyn erikoissopimuksen päättymisen vuoksi, mikä tekee siitä vähemmän kilpailukykyisen nykyisillä markkinoilla.",
      "Käyttäjät löytävät parempaa vastinetta käytetyistä mini-PC:istä, jotka tarjoavat enemmän tehoa ja ominaisuuksia samanlaisella hinnalla.",
      "Vaikka Pi 5 on edelleen vahva opetuskäytössä ja GPIO (yleiskäyttöinen tulo/lähtö) sovelluksissa, vaihtoehdot kuten käytetyt Intel NUCit tai uudet N100 mini-PC:t ovat houkuttelevampia yleisiin laskentatehtäviin."
    ],
    "points": 257,
    "commentCount": 218,
    "retryCount": 0,
    "time": 1718552283
  },
  {
    "id": 40693944,
    "title": "SimCity verkkoselaimessa käyttäen WebAssemblya ja OpenGL:ää",
    "originLink": "https://micropolisweb.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693944",
    "commentBody": "",
    "originSummary": [
      "Micropolis WebAssemblyssa on käännös alkuperäisestä SimCity Classic -pelistä, jonka on suunnitellut Will Wright ja kääntänyt Don Hopkins.",
      "Projekti kehittyy, ja sen jatkuvaa kehitystä tuetaan Patreonissa ja se on saatavilla GitHubissa.",
      "Pelkäjät voivat olla vuorovaikutuksessa pelin kanssa käyttämällä erilaisia ohjaimia, kuten hiirtä ja näppäimistön pikanäppäimiä, ja tulevissa päivityksissä luvataan lisää ominaisuuksia ja pääsiäismunia."
    ],
    "commentSummary": [
      "SimCity on siirretty verkkoselaimeen käyttämällä WebAssemblya ja OpenGL:ää, mikä tekee siitä käytettävissä olevan ilman ohjelmiston asentamista.",
      "Tämä projekti perustuu alkuperäiseen SimCity Classic -koodiin ja sen tavoitteena on tuoda peli nykyaikaisille alustoille parannetulla suorituskyvyllä ja saavutettavuudella.",
      "Satama on edelleen keskeneräinen työ, ja jatkuvia ponnisteluja tehdään käyttöliittymän parantamiseksi, mobiilituen lisäämiseksi ja suorituskyvyn optimoimiseksi."
    ],
    "points": 214,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1718500358
  },
  {
    "id": 40694103,
    "title": "Yhden hengen teknologiayrityksen arkkitehtuuri (2021)",
    "originLink": "https://anthonynsimon.com/blog/one-man-saas-architecture/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40694103",
    "commentBody": "",
    "originSummary": [
      "Kirjoitus kuvaa infrastruktuurin asennusta yhden henkilön SaaS-palvelun (Software as a Service) pyörittämiseksi Kubernetesin avulla AWS:ssä, korostaen sen vähästressistä ja omarahoitteista luonnetta.",
      "Keskeisiä komponentteja ovat liikenteen hallinta Cloudflaren ja AWS:n avulla, käyttöönoton automaatio GitHub Actionsin ja Fluxin kautta sekä luotettavuus Kubernetesin automaattisen skaalaamisen ja elinvoimaisuustutkien avulla.",
      "Lisäominaisuuksiin kuuluvat välimuistitus Redisillä, nopeusrajoitukset Django Ratelimitillä, ajastetut tehtävät Celeryllä sekä valvonta New Relicillä ja Sentryllä, tarjoten kattavan yleiskuvan yksin toimivan teknologiayrityksen hallinnasta."
    ],
    "commentSummary": [
      "Paras teknologiapino startupille on sellainen, jonka tiimi jo tuntee, sillä uusien teknologioiden opettelu voi lisätä tarpeetonta monimutkaisuutta.",
      "Priorisoi nopea käyttöönotto ja harkitse refaktorointia myöhemmin; käyttäjät välittävät enemmän toimivasta tuotteesta kuin sen taustalla olevasta teknologiasta.",
      "Vaikka jotkin uudet teknologiat, kuten Kubernetes, saattavat olla liioittelua, yksinkertaisemmat ratkaisut, kuten Docker Swarm tai hallinnoidut palvelut, voivat olla sopivampia yksinkertaisuuden ja skaalautuvuuden tasapainottamiseksi."
    ],
    "points": 203,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1718502714
  },
  {
    "id": 40695839,
    "title": "Yksinkertainen sabotointi ohjelmistolle (2023)",
    "originLink": "https://erikbern.com/2023/12/13/simple-sabotage-for-software.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695839",
    "commentBody": "",
    "originSummary": [
      "Toisen maailmansodan aikainen CIA:n \"Simple Sabotage\" -kirja tarjoaa ajattomia neuvoja tuottavuuden häiritsemiseen, nyt humoristisesti sovitettuna nykyaikaisiin teknologia-ympäristöihin.",
      "Ehdotetut sabotaasitekniikat teknologiajohtajalle sisältävät pitkien uudelleenkirjoitusten vaatimisen, erilaisten kielten käytön kannustamisen ja järjestelmien jakamisen monimutkaisuuden lisäämiseksi.",
      "Muita menetelmiä ovat hyödyllisten mittareiden hylkääminen, palkkion sitominen titteliin ja tiimin kokoon sekä subjektiivisen rekrytointiprosessin luominen, joiden kaikkien tarkoituksena on hienovaraisesti hidastaa tuottavuutta uskottavien toimien kautta."
    ],
    "commentSummary": [
      "Keskustelu yksinkertaisesta sabotoinnista ohjelmistoissa, viitaten Erik Bernhardssonin vuoden 2023 artikkeliin, kyseenalaistaa alkuperäisten CIA:n sabotaasitaktiikoiden tehokkuuden.",
      "Kommentoijat keskustelevat näiden strategioiden käytännöllisyydestä ja vaikutuksista, huomauttaen, että huono johtaminen ja harhaanjohtava voiton optimointi voivat luonnostaan rampauttaa organisaatioita.",
      "Keskustelu sisältää historiallista kontekstia, epäpätevyysroolin ja nykyaikaisia käytäntöjä, kuten monimutkaisia itsepalvelujärjestelmiä ja pakollisia toimistolle palaamisen politiikkoja, jotka saattavat tahattomasti noudattaa sabotoinnin periaatteita."
    ],
    "points": 187,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1718530792
  },
  {
    "id": 40695754,
    "title": "Eurooppalaiset vaihtoehdot",
    "originLink": "https://european-alternatives.eu",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695754",
    "commentBody": "",
    "originSummary": [
      "Postaus korostaa eurooppalaisia vaihtoehtoja erilaisille digitaalisille palveluille ja tuotteille, painottaen paikallisten yritysten tukemista ja GDPR:n (General Data Protection Regulation) noudattamista.",
      "Se luettelee palvelukategoriat ja niissä saatavilla olevien vaihtoehtojen määrän, kuten verkkoanalytiikka, pilvipalvelut ja sähköpostipalveluntarjoajat, muiden muassa.",
      "Julkaisu korostaa eurooppalaisten palveluntarjoajien valitsemisen etuja, kuten ALV-palautuksia, yleisiä eurooppalaisia maksutapoja ja oikeuksien helpompaa täytäntöönpanoa EU:n yhtenäisten lakien ansiosta."
    ],
    "commentSummary": [
      "European Alternatives listaa tuotteita ja palveluita yrityksiltä, jotka sijaitsevat EU-, ETA-, EFTA- tai DCFTA-maissa, pois lukien EU:n/EFTA:n ulkopuoliset alihosting-palveluntarjoajat.",
      "Sivusto kattaa kategorioita, kuten identiteetin ja pääsyn hallinta, VPS-palveluntarjoajat ja hakukoneet, keskusteluineen Brexitin jälkeisestä Ison-Britannian poissulkemisesta ja EU-säädösten noudattamisesta.",
      "Lisäksi käyttäjät keskustelevat palveluiden, kuten Hetznerin ja Tutaan, laadusta sekä tietosuojaan ja kilpailuun liittyvistä geopoliittisista vaikutuksista Euroopan teknologiakentässä."
    ],
    "points": 182,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1718529476
  },
  {
    "id": 40698442,
    "title": "SimCityn rakentaminen: Kuinka laittaa maailma koneeseen",
    "originLink": "https://mitpress.mit.edu/9780262547482/building-simcity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40698442",
    "commentBody": "",
    "originSummary": [
      "Chaim Gingoldin teos \"Building SimCity\" tutkii vaikutusvaltaisen SimCity-simulaatiopelin historiaa ja kehitystä, jonka on luonut Will Wright.",
      "Kirja käsittelee SimCityn vaikutusta tietokonesimulaatioihin ja Maxisin, pelin takana olevan yrityksen, historiaa visuaalisten materiaalien, kuten kaavioiden ja valokuvien, avulla.",
      "Julkaisijana The MIT Press, se tulee saataville sekä pehmeäkantisena että e-kirjana kesäkuusta 2024 alkaen."
    ],
    "commentSummary": [
      "Chaim Gingold, Spore-pelin kirjoittaja ja suunnittelija, on saatavilla kysymys-vastaus -sessioon, jossa Will Wright haastattelee häntä 19. heinäkuuta klo 14.00 ET Twitchissä, ROMchipin isännöimänä.",
      "Stewart Brand kehui Gingoldin kirjaa yhdeksi parhaista alkuperätarinoista ja kuvauksista tietotekniikan innovaatioista.",
      "Gingold suosittelee City Skylinesiä, Minecraftia ja Tiny Gladea nykyaikaisina seuraajina SimCitylle, korostaen generatiivisen tekoälyn vaikutusta pelikehitykseen."
    ],
    "points": 130,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1718556931
  },
  {
    "id": 40693500,
    "title": "SQLitea käytetään todennäköisesti enemmän kuin kaikkia muita tietokantamoottoreita yhteensä",
    "originLink": "https://sqlite.org/mostdeployed.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693500",
    "commentBody": "",
    "originSummary": [
      "SQLite on laajimmin käytetty tietokantamoottori, joka on läsnä miljardeissa laitteissa ja sovelluksissa, mukaan lukien Android, iOS, Mac, Windows 10, suuret verkkoselaimet ja erilaiset suositut sovellukset.",
      "Yli 4 miljardin älypuhelimen sisältäessä satoja SQLite-tietokantoja, maailmassa on todennäköisesti yli biljoona aktiivista SQLite-tietokantaa.",
      "SQLite on yksi viidestä eniten käytetystä ohjelmistomoduulista, mahdollisesti toiseksi laajimmin käytetty ohjelmistokirjasto zlibin jälkeen, ja mahdollisesti laajimmin käytetty ohjelmistokomponentti sen useiden laitekohtaisten instanssien vuoksi."
    ],
    "commentSummary": [
      "SQLitea käytetään laajasti, todennäköisesti enemmän kuin kaikkia muita tietokantamoottoreita yhteensä, sen helppokäyttöisyyden, luotettavuuden ja offline-toiminnallisuuden ansiosta.",
      "Kayttäjät siirtyvät json+zip:stä gzippattuun SQLiteen paremman skeeman valvonnan vuoksi, kun he lataavat tietoja varmuuskopioita tai jakamista varten.",
      "Huolimatta suosiostaan, SQLite ei ole avoin kontribuutioille, mutta sen tiedostomuoto on hyvin dokumentoitu ja vakaa, mikä tekee siitä ihanteellisen moniin sovelluksiin, mukaan lukien iOS ja Android."
    ],
    "points": 126,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1718494730
  },
  {
    "id": 40699079,
    "title": "Asiantuntijat vs. Jäljittelijät",
    "originLink": "https://fs.blog/experts-vs-imitators/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699079",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Väittelyssä verrataan asiantuntijoita jäljittelijöihin, korostaen, että todellinen asiantuntemus sisältää syvällisen ymmärryksen ja tehokkaan viestinnän.",
      "Asiantuntijat väittävät, että kyky selittää monimutkaisia aiheita yksinkertaisin termein on ratkaisevan tärkeää, korostaen hyvien viestintätaitojen merkitystä teknisen tiedon rinnalla.",
      "Keskustelu käsittelee asiantuntijoiden kohtaamia haasteita monimutkaisten käsitteiden välittämisessä maallikoille, käyttäen esimerkkeinä ohjelmointikieliä Rust ja Python havainnollistamaan näitä vaikeuksia."
    ],
    "points": 121,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1718562798
  },
  {
    "id": 40695165,
    "title": "Ensimmäisen sulautetun Linux-järjestelmäni tekeminen",
    "originLink": "https://popovicu.com/posts/making-my-first-embedded-linux-system/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40695165",
    "commentBody": "",
    "originSummary": [
      "Kirjoitus kuvaa kirjoittajan matkaa Linux-järjestelmän rakentamisessa alusta alkaen, ilman aiempaa kokemusta piirilevyistä (PCB).",
      "Keskeisiä vaiheita ovat mikrokontrollerien, kuten Atmel ATtiny, ohjelmointi, mukautetun piirilevyn suunnittelu ja sulautetun Linux-kortin luominen F1C100s SoC:ta (System on Chip) käyttäen.",
      "Projekti sisälsi työkalujen, kuten avrdude, käyttämisen ohjelmointiin, 4-kerroksisen piirilevyn monimutkaiseen reititykseen ja Lichee Pi -ohjelmistokuvan mukauttamisen räätälöidylle piirilevylle."
    ],
    "commentSummary": [
      "Käyttäjä jakoi kokemuksensa ensimmäisen sulautetun Linux-järjestelmänsä luomisesta, mikä herätti keskustelua teknisistä yksityiskohdista ja parannuksista.",
      "Keskeisiä kohtia ovat 16 Mbit flash-muistin käyttö, differentiaalinen reititys ja mahdolliset edut SD-korttiliittimen lisäämisestä.",
      "Projekti hyödynsi Allwinner F1C100S:ää, 533 MHz:n yksiytimistä ARMv7-prosessoria, jossa on 32 Mt sisäistä DRAM-muistia, mikä herätti vertailuja muihin vastaaviin prosessoreihin."
    ],
    "points": 120,
    "commentCount": 7,
    "retryCount": 0,
    "time": 1718520685
  },
  {
    "id": 40693787,
    "title": "Kokoelma 2 299 blogia kaikista aiheista",
    "originLink": "https://ooh.directory/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40693787",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Uusi kokoelma, joka sisältää 2 299 blogia eri aiheista, on julkaistu ooh.directory-sivustolla, muistuttaen varhaisia verkkohakemistoja, kuten Yahoon kategorisoitua linkkihakemistoa.",
      "Kayttäjät arvostavat hakemiston kuratoitua luonnetta, mikä parantaa löydettävyyttä verrattuna mainoksilla täytettyihin hakukoneisiin.",
      "Hakemistoa pidetään arvokkaana resurssina uusien blogien ja haastateltavien löytämiseen, erityisesti aikakautena, jolloin tekoälyn tuottama sisältö on yleistä."
    ],
    "points": 116,
    "commentCount": 17,
    "retryCount": 0,
    "time": 1718498525
  }
]
