[
  {
    "id": 40962675,
    "title": "Bagaimana Mengetahui Kapan Saatnya Pergi",
    "originLink": "https://thecodist.com/how-to-know-when-its-time-to-go/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40962675",
    "commentBody": "",
    "originSummary": [
      "Penulis pensiun pada tahun 2021 setelah hampir 40 tahun bekerja sebagai programmer, bukan karena kurangnya kemampuan tetapi karena kurangnya keinginan untuk melanjutkan.",
      "Mereka menekankan pentingnya bersikap jujur tentang kemampuan dan minat seseorang, mencatat bahwa mempertahankan karier yang panjang di industri yang berubah dengan cepat adalah tantangan.",
      "Penulis terus menulis kode untuk seni generatif, menemukan bahwa itu lebih kompleks dan menyenangkan daripada pekerjaan mereka sebelumnya, menyoroti kepuasan pribadi dalam mengejar minat baru."
    ],
    "commentSummary": [
      "Seorang insinyur Apple yang sudah pensiun merenungkan pergeseran dari pengambilan keputusan yang didorong oleh teknik ke pengambilan keputusan yang didorong oleh pemasaran di dalam perusahaan, yang mendorong kepergiannya.",
      "Meskipun meninggalkan dunia korporat, insinyur tersebut terus melakukan pemrograman untuk seni generatif, menemukan bahwa hal itu lebih kompleks dan inventif daripada pekerjaan sebelumnya.",
      "Postingan tersebut menyoroti perasaan yang lebih luas di kalangan programmer yang berjuang dengan lingkungan kerja modern dan perubahan teknologi yang cepat, dengan beberapa menemukan ketenangan dalam proyek pribadi atau kontribusi open-source."
    ],
    "points": 304,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1720984589
  },
  {
    "id": 40962767,
    "title": "Fusion – Sebuah OS hobi yang diimplementasikan dalam Nim",
    "originLink": "https://github.com/khaledh/fusion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40962767",
    "commentBody": "",
    "originSummary": [
      "Fusion OS adalah sistem operasi hobi untuk arsitektur x86-64, dikembangkan menggunakan bahasa pemrograman Nim.",
      "Fitur saat ini mencakup UEFI Bootloader, Manajer Memori Fisik dan Virtual, Mode Pengguna, Multitasking Preemptif, Panggilan Sistem, Pemuatan ELF, dan Interupsi Timer.",
      "Fitur yang direncanakan bertujuan untuk menambahkan Demand Paging, Komunikasi Antar-Proses, Disk I/O, Sistem File, Input Keyboard/Mouse, GUI Shell, dan Jaringan."
    ],
    "commentSummary": [
      "Fusion adalah sistem operasi (OS) hobi yang diimplementasikan dalam bahasa pemrograman Nim, dibahas di GitHub oleh penulis khaledh.",
      "Nim dipilih karena sintaksnya yang mirip dengan Python, tidak adanya pengumpul sampah default, interoperabilitas C yang sangat baik, dan fitur-fitur bermanfaat lainnya.",
      "Diskusi tersebut menyoroti perpustakaan standar komprehensif Nim, kebutuhan akan dukungan Integrated Development Environment (IDE) yang lebih baik, dan tipe jumlah sejati, serta wawasan tentang tantangan pengembangan OS seperti pergantian tugas."
    ],
    "points": 298,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1720986220
  },
  {
    "id": 40965892,
    "title": "AI Gemini milik Google tertangkap memindai file PDF di Google Drive tanpa izin",
    "originLink": "https://www.tomshardware.com/tech-industry/artificial-intelligence/gemini-ai-caught-scanning-google-drive-hosted-pdf-files-without-permission-user-complains-feature-cant-be-disabled",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40965892",
    "commentBody": "",
    "originSummary": [
      "AI Gemini milik Google ditemukan memindai file PDF di Google Drive tanpa persetujuan pengguna, menimbulkan kekhawatiran privasi yang signifikan.",
      "Kevin Bankston, seorang Penasihat Senior tentang Tata Kelola AI, melaporkan bahwa Gemini merangkum pengembalian pajaknya tanpa izin, meskipun fitur tersebut seharusnya dinonaktifkan.",
      "Insiden ini menyoroti masalah privasi yang terus berlanjut di industri teknologi, khususnya bagi pengguna Google Workspace Labs, dan menekankan pengawasan terhadap dampak AI pada privasi pengguna."
    ],
    "commentSummary": [
      "AI Gemini milik Google ditemukan memindai file PDF di Google Drive tanpa persetujuan pengguna, memicu diskusi tentang kebijakan opt-in AI.",
      "Perdebatan berpusat pada apakah fitur AI harus memerlukan aktivasi eksplisit dari pengguna, dengan kekhawatiran tentang penyalahgunaan data dan pelanggaran privasi.",
      "Insiden ini menekankan pentingnya kebijakan penggunaan AI yang transparan dan peningkatan kontrol pengguna atas data pribadi."
    ],
    "points": 282,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1721028338
  },
  {
    "id": 40966312,
    "title": "Firefox 128 mengaktifkan pengukuran iklan yang menjaga privasi secara default",
    "originLink": "https://mstdn.social/@Lokjo/112772496939724214",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40966312",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Firefox 128 memperkenalkan pengukuran iklan yang \"melindungi privasi\" secara default, memungkinkan pelacakan iklan tanpa mengungkapkan tindakan spesifik pengguna.",
      "Kritikus berpendapat bahwa fitur ini mengkompromikan privasi pengguna dan menguntungkan pengiklan, menimbulkan kekhawatiran tentang hubungan keuangan Mozilla dengan periklanan.",
      "Pengguna dapat menonaktifkan fitur tersebut di pengaturan, dan alternatif seperti LibreWolf atau penyesuaian melalui about:config direkomendasikan untuk privasi yang lebih baik."
    ],
    "points": 228,
    "commentCount": 178,
    "retryCount": 0,
    "time": 1721034656
  },
  {
    "id": 40966414,
    "title": "Rust untuk Sistem Berkas",
    "originLink": "https://lwn.net/Articles/978738/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40966414",
    "commentBody": "",
    "originSummary": [
      "Pada KTT Linux Storage, Filesystem, Memory Management, dan BPF 2024, Wedson Almeida Filho dan Kent Overstreet membahas penggunaan Rust untuk sistem berkas Linux, menyoroti potensi manfaatnya.",
      "Set patch RFC Almeida dari Desember 2023 memperkenalkan abstraksi Rust untuk sistem berkas, dengan tujuan memanfaatkan sistem tipe Rust untuk menangkap kesalahan pada waktu kompilasi dan mengotomatisasi pembersihan sumber daya, meningkatkan produktivitas dan mengurangi kerentanan terkait memori.",
      "Kekhawatiran muncul tentang ketidakcocokan antara API C dan Rust, dengan saran untuk menyelaraskan nama fungsi agar lebih familiar, dan tantangan dalam menjaga sinkronisasi antara kode C yang berkembang dan binding Rust diakui."
    ],
    "commentSummary": [
      "Diskusi tentang integrasi Rust ke dalam kernel Linux menyoroti tantangan dan manfaat, terutama dalam pengembangan sistem berkas.",
      "Alat seperti bindgen dan cbindgen sangat penting untuk menjembatani kesenjangan antara Rust dan C, meskipun beberapa pengembang menemukan interoperabilitasnya kompleks.",
      "Perdebatan menekankan potensi Rust untuk meningkatkan keamanan dan ketepatan, tetapi juga mencatat kekhawatiran tentang pemeliharaan API paralel dan kurva pembelajaran bagi pengembang yang baru mengenal Rust."
    ],
    "points": 220,
    "commentCount": 146,
    "retryCount": 0,
    "time": 1721036357
  },
  {
    "id": 40962965,
    "title": "Just Be Rich (2021)",
    "originLink": "https://keenen.xyz/just-be-rich/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40962965",
    "commentBody": "",
    "originSummary": [
      "Para investor dan CEO Silicon Valley, yang dulu dianggap sebagai inovator, kini dikritik sebagai monopolis dan sedang membela diri terhadap klaim-klaim ini.",
      "Esai Paul Graham, 'How People Get Rich Now,' berpendapat bahwa kekayaan modern lebih berbasis prestasi dibandingkan masa lalu tetapi mengabaikan kesenjangan kekayaan yang semakin besar dan implikasinya.",
      "Meskipun memulai bisnis saat ini lebih mudah, manfaatnya terbatas pada minoritas, dan ketimpangan kekayaan tetap menjadi masalah signifikan, bukan hanya konsep radikal kiri."
    ],
    "commentSummary": [
      "Kajian tentang pajak kekayaan di Norwegia meneliti manfaatnya, seperti memastikan orang kaya membayar pajak, dan kelemahannya, seperti membebani pengusaha dan perusahaan rintisan.",
      "Kritikus berpendapat bahwa pajak kekayaan menghambat investasi dan inovasi, yang berpotensi menyebabkan individu kaya meninggalkan negara tersebut.",
      "Kajian ini juga mencakup isu-isu yang lebih luas seperti ketimpangan kekayaan, peran keberuntungan dalam akumulasi kekayaan, dan efektivitas pengeluaran pemerintah, menyoroti kompleksitas dalam menyeimbangkan perpajakan yang adil, dorongan investasi, dan stabilitas sosial."
    ],
    "points": 214,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1720988205
  },
  {
    "id": 40964261,
    "title": "Tabloid: Bahasa pemrograman judul clickbait (2021)",
    "originLink": "https://tabloid.vercel.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40964261",
    "commentBody": "",
    "originSummary": [
      "Tabloid adalah bahasa pemrograman Turing-complete yang dirancang untuk menulis program dalam gaya judul berita clickbait.",
      "Kode ini memiliki sintaks unik seperti 'ANDA TIDAK INGIN MELEWATKAN' untuk output cetak dan 'PAKAR MENGKLAIM...UNTUK MENJADI' untuk penugasan variabel, tanpa konstruksi pengulangan bawaan, bergantung pada rekursi sebagai gantinya.",
      "Bahasa ini memiliki interpreter yang ditulis dalam JavaScript dan implementasi yang sebagian besar kompatibel dalam Racket, mendukung angka, string, dan boolean."
    ],
    "commentSummary": [
      "Tabloid adalah bahasa pemrograman dengan judul clickbait, ideal untuk mengukur kinerja pembuatan kode model bahasa besar (LLM), seperti GPT-4.",
      "GPT-4 kesulitan dengan tugas-tugas dasar di Tabloid, sering kali berhalusinasi kata kunci seperti 'BERITA TERKINI' karena kesalahan sintaksis dan kurangnya pelatihan khusus.",
      "Claude, model bahasa lainnya, berhasil menulis kode dalam Tabloid, menunjukkan bahwa pelatihan sintaksis yang lebih banyak dapat meningkatkan kinerja dalam bahasa-bahasa khusus seperti itu."
    ],
    "points": 192,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1721002379
  },
  {
    "id": 40964924,
    "title": "Kehidupan seks yang menarik dan rumit dari burung gereja berkerah putih",
    "originLink": "https://www.audubon.org/news/the-fascinating-and-complicated-sex-lives-white-throated-sparrows",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40964924",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Para ilmuwan menggunakan pita warna untuk mengidentifikasi burung pipit berkerah putih, membantu dalam studi perilaku tanpa perlu menangkap kembali.",
      "Kutilang menunjukkan perilaku yang mirip dengan pasangan manusia, dengan burung bergaris putih yang lebih agresif dan burung bergaris cokelat yang lebih penyayang.",
      "Istilah 'gender' dalam studi ini merujuk pada sifat-sifat dari jenis kelamin genetik dan perilaku, meskipun penggunaan ini jarang dalam biologi."
    ],
    "points": 148,
    "commentCount": 18,
    "retryCount": 0,
    "time": 1721012100
  },
  {
    "id": 40967069,
    "title": "Saya bukan penggemar strlcpy(3)",
    "originLink": "https://nrk.neocities.org/articles/not-a-fan-of-strlcpy",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40967069",
    "commentBody": "",
    "originSummary": [
      "strlcpy(3), sebuah fungsi OpenBSD, sering dianggap lebih aman daripada strcpy(3) dan strncpy(3), tetapi tidak efisien dan tidak aman jika string sumber tidak diakhiri dengan null.",
      "Ulrich Drepper menolak strlcpy untuk glibc karena ketidakefisienannya, karena fungsi ini memproses seluruh string sumber meskipun hanya sebagian yang dibutuhkan.",
      "Kombinasi seperti memccpy(3), strdup(3), dan kombinasi strlen(3) dan memcpy(3) direkomendasikan untuk efisiensi dan portabilitas yang lebih baik."
    ],
    "commentSummary": [
      "Penulis mengkritik `strlcpy(3)` karena potensinya menyebabkan bug buffer-overflow akibat format ukuran variabel tanpa spesifikasi panjang.",
      "Mereka mendukung penggunaan string yang dihitung daripada yang diakhiri dengan null, dengan mengutip contoh seperti crate string kompak Rust dan bukti sejarah dari kelompok Cedar di PARC.",
      "Penulis menyarankan bahwa meskipun `strlcpy(3)` bertujuan untuk mencegah kerusakan dan masalah memori, metode ini bukanlah yang paling efisien, dan penanganan string dalam bahasa C sudah ketinggalan zaman dibandingkan dengan alternatif seperti string Pascal."
    ],
    "points": 135,
    "commentCount": 211,
    "retryCount": 0,
    "time": 1721045027
  },
  {
    "id": 40962942,
    "title": "Jaringan Listrik California Melewati Gelombang Panas dengan Baterai",
    "originLink": "https://thinc.blog/2024/07/14/california-grid-breezes-through-heat-wave-due-to-renewables-batteries/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40962942",
    "commentBody": "",
    "originSummary": [
      "Jaringan listrik California berhasil mengatasi gelombang panas tanpa pemadaman atau keadaan darurat, yang dikaitkan dengan energi terbarukan dan penyimpanan baterai.",
      "Strategi utama termasuk peningkatan jaringan dan peningkatan energi bersih, terutama tenaga surya dan penyimpanan baterai, yang sekarang setara dengan lima pembangkit nuklir besar.",
      "Dalam tahun 2024, California memiliki 50 hari lebih banyak dengan energi terbarukan 100% dibandingkan dengan tahun 2023, menunjukkan peningkatan signifikan dalam kinerja jaringan."
    ],
    "commentSummary": [
      "Jaringan listrik California berhasil menangani gelombang panas dengan menggunakan penyimpanan baterai, menunjukkan potensi sistem baterai skala besar untuk menyimpan kelebihan energi surya untuk digunakan pada malam hari.",
      "Perkembangan ini dapat mengurangi ketergantungan pada pembangkit listrik puncak, yang kurang dapat diandalkan dan lebih mahal, menjadikan penyimpanan baterai sebagai pengubah permainan untuk energi terbarukan.",
      "Diskusi juga mencakup tantangan dan manfaat dari berbagai metode penyimpanan energi, dampak regulasi, dan potensi penggunaan baterai kendaraan listrik (EV) bekas dalam penyimpanan jaringan."
    ],
    "points": 107,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1720988069
  },
  {
    "id": 40968493,
    "title": "Kemunculan kamera memicu perjuangan untuk melindungi privasi di Era Gilded",
    "originLink": "https://www.smithsonianmag.com/history/how-the-rise-of-the-camera-launched-a-fight-to-protect-gilded-age-americans-privacy-180984656/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40968493",
    "commentBody": "",
    "originSummary": [
      "Kemunculan kamera Kodak pada akhir abad ke-19 dan awal abad ke-20 membuat fotografi dapat diakses oleh masyarakat umum, yang mengakibatkan pelanggaran privasi yang meluas.",
      "Insiden seperti penggunaan tanpa izin oleh Elizabeth Peck dalam sebuah iklan dan gugatan Abigail Roberson terhadap Franklin Mills Flour menyoroti penyalahgunaan gambar pribadi untuk keuntungan.",
      "Kemarahan publik atas pelanggaran privasi semacam itu mendorong New York untuk mengesahkan undang-undang 'hak privasi' pada tahun 1903, menetapkan preseden bagi negara bagian lain untuk diikuti."
    ],
    "commentSummary": [
      "Kehadiran kamera selama Era Gilded menimbulkan kekhawatiran privasi yang signifikan, karena mereka memungkinkan penangkapan dan pelestarian momen dengan fidelitas tinggi.",
      "Perkembangan teknologi, dari fotografi awal hingga ponsel pintar modern, secara konsisten menantang norma privasi, mendorong diskusi tentang perlunya undang-undang privasi yang lebih baik dan penggunaan teknologi yang bijaksana.",
      "Perdebatan yang sedang berlangsung berpusat pada menyeimbangkan manfaat teknologi dengan perlindungan hak privasi di dunia yang semakin terhubung."
    ],
    "points": 94,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1721055845
  },
  {
    "id": 40963278,
    "title": "Data penggajian yang bocor menunjukkan berapa banyak Valve membayar stafnya dan betapa sedikit orang yang dipekerjakannya",
    "originLink": "https://www.theverge.com/2024/7/13/24197477/valve-employs-few-hundred-people-payroll-redacted",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40963278",
    "commentBody": "",
    "originSummary": [
      "Valve mempekerjakan tenaga kerja yang mengejutkan kecil, hanya 336 staf pada tahun 2021, menurut data penggajian yang bocor dari gugatan antitrust Wolfire.",
      "Keterangan tersebut mengungkapkan distribusi karyawan Valve dalam kategori 'Admin,' 'Games,' 'Steam,' dan 'Hardware,' dengan penggajian 'Games' mencapai puncaknya sebesar $221 juta pada tahun 2017.",
      "Ukuran staf Valve yang kecil dan profitabilitas tinggi per karyawan, melebihi Google, Amazon, dan Microsoft, menjelaskan daftar produk yang terbatas dan ketergantungannya pada bantuan eksternal untuk perangkat keras dan perangkat lunak."
    ],
    "commentSummary": [
      "Data penggajian yang bocor menunjukkan bahwa Valve hanya mempekerjakan 79 orang untuk mengelola Steam, sebuah toko game besar.",
      "Tim kecil Valve dianggap efisien, dengan fokus pada stabilitas daripada perubahan fitur yang konstan, tidak seperti perusahaan besar yang sering berkembang secara tidak perlu.",
      "Pendekatan lean ini menyoroti penekanan Valve pada kelincahan dan efisiensi, yang berkontribusi pada kesuksesannya."
    ],
    "points": 93,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1720991979
  },
  {
    "id": 40968245,
    "title": "Makhluk yang terdampar di pantai Selandia Baru mungkin adalah paus paling langka",
    "originLink": "https://www.cbsnews.com/news/creature-that-washed-up-on-new-zealand-beach-may-be-worlds-rarest-whale-a-spade-toothed-whale/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40968245",
    "commentBody": "",
    "originSummary": [
      "Kadal gigi sekop yang langka, spesies paus paling langka di dunia, terdampar di pantai Selandia Baru, memberikan para ilmuwan kesempatan penelitian yang unik.",
      "Paus berparuh sepanjang lima meter ini adalah spesimen ketujuh yang pernah ditemukan, tanpa ada catatan penampakan hidup, menjadikannya penemuan penting bagi biologi kelautan.",
      "Paus tersebut telah dipindahkan ke penyimpanan dingin untuk pemeriksaan, yang melibatkan iwi Māori setempat, dan pengujian genetik untuk mengonfirmasi identifikasinya bisa memakan waktu berbulan-bulan."
    ],
    "commentSummary": [
      "Kadal paus langka ditemukan di pantai Selandia Baru, memberikan kesempatan unik untuk analisis DNA.",
      "Spesies ini termasuk di antara mamalia besar yang paling sedikit dipelajari, memicu minat ilmiah yang meningkat."
    ],
    "points": 90,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1721054204
  },
  {
    "id": 40964852,
    "title": "ZeroMQ: Kerangka Kerja Konkuren Berkinerja Tinggi",
    "originLink": "https://zeromq.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40964852",
    "commentBody": "",
    "originSummary": [
      "ZeroMQ adalah perpustakaan pesan universal sumber terbuka yang berfungsi sebagai kerangka kerja konkuren, menyediakan soket untuk pesan atomik melalui berbagai transportasi seperti dalam proses, antar proses, TCP, dan multicast.",
      "Itu mendukung beberapa API bahasa dan sistem operasi, menawarkan pola seperti pub-sub, push-pull, dan client-server, membuatnya cepat dan dapat diskalakan.",
      "ZeroMQ didukung oleh komunitas open-source yang besar dan aktif serta digunakan oleh perusahaan-perusahaan besar seperti Microsoft, Samsung, dan Facebook."
    ],
    "commentSummary": [
      "ZeroMQ adalah kerangka kerja concurrency berkinerja tinggi, tetapi status pengembangan aktifnya saat ini tidak jelas.",
      "Pengguna telah mencatat berbagai masalah dan perbedaan dengan ZeroMQ dan penerusnya, nanomsg dan nng, termasuk model threading, propagasi kesalahan, dan bug spesifik.",
      "Lisensi ZeroMQ telah berubah menjadi MPL 2.0, membuatnya lebih mudah digunakan secara legal, dan ada diskusi tentang alternatif seperti NATS dan zenoh.io."
    ],
    "points": 88,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1721010959
  },
  {
    "id": 40962829,
    "title": "Kecerdasan Buatan Membutuhkan Tembaga. Ia Baru Saja Membantu Menemukan Jutaan Ton Tembaga di Zambia.",
    "originLink": "https://www.nytimes.com/2024/07/11/climate/kobold-zambia-copper-ai-mining.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40962829",
    "commentBody": "",
    "originSummary": [
      "KoBold Metals telah menemukan deposit tembaga besar di Chililabombwe, Zambia, yang berpotensi menjadi yang terbesar dalam lebih dari satu dekade, dengan perkiraan produksi tahunan sebesar 300.000 ton.",
      "Penemuan ini, yang didorong oleh teknologi A.I. dari KoBold, memiliki implikasi geopolitik yang signifikan, membantu AS dalam persaingannya dengan China atas mineral penting untuk teknologi energi bersih.",
      "Didukung oleh investor seperti Bill Gates dan Sam Altman, KoBold berencana untuk menginvestasikan $2,3 miliar di tambang tersebut, dengan produksi yang diharapkan dimulai pada awal tahun 2030-an, sementara pemerintah AS mendukung pembangunan rel kereta api senilai $2,3 miliar untuk ekspor tembaga."
    ],
    "commentSummary": [
      "Teknologi AI telah digunakan untuk menemukan jutaan ton tembaga di Zambia, menyoroti potensinya dalam eksplorasi sumber daya.",
      "Kenaikan permintaan tembaga didorong oleh elektrifikasi kendaraan dan permintaan jaringan, bukan langsung oleh AI.",
      "Kejadian ini penting karena kelangkaan deposit tembaga besar yang baru, memberikan dorongan ekonomi yang substansial bagi Zambia."
    ],
    "points": 87,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1720986938
  }
]
