[
  {
    "title": "Samsung Regains Top Spot in Southeast Asia Smartphone Market",
    "originLink": "https://m.ajudaily.com/view/20240307095927562",
    "originBody": "이미지 확대 [YONHAP PHOTO] SEOUL -- Samsung Electronics has regained its position as the top player in Southeast Asia's smartphone market, thanks to increased consumer attention towards the company's artificial intelligence-based smartphone features. Boosted by sales of affordable phones, Chinese electronics maker Transsion overtook Samsung to become the leader in late 2023. The South Korean tech giant, renowned for its hi-tech smartphones, is primarily targeting Southeast Asian consumers with its premium flagship smartphones -- the \"Galaxy S\" series and the foldable \"Galaxy Z\" series. According to Statista, a global market research company, Samsung holds the leading position in the foldable smartphone market, with a global market share of about 70 percent as of 2023. Data released by the market research firm Canalys on March 7 showed that smartphone shipments in five Southeast Asian countries, including Indonesia, the Philippines, Thailand, Vietnam, and Malaysia, reached 7.26 million units in January 2024, a 20 percent increase from the same period in 2023. Samsung Electronics shipped 1.5 million units, capturing the highest market share of 20 percent, thanks to the release of the Galaxy S24 series. This marks a return to the top spot that Samsung lost to Transsion in December last year. Canalys analyzed that the overall recovery in the Southeast Asian market, coupled with increased demand and interest in the Galaxy S24 series' AI-based features, led to these results. Xiaomi followed Samsung with 18 percent, while Transsion, Oppo, and Vivo pursued with 15 percent, 15 percent, and 12 percent, respectively. However, Samsung is lagging behind Chinese companies in terms of growth trends. In the Southeast Asian market, Samsung's smartphone shipments in January decreased by 11 percent compared to the same period in 2023, and its market share also dropped by 7 percentage points (from 27 percent in January last year). Meanwhile, during the same period, shipments of Xiaomi and Transsion grew rapidly by 128 percent and 190 percent, respectively. On a country-by-country basis, Oppo took the top spot in Indonesia, the largest smartphone market in Southeast Asia, while Transsion led the second market, the Philippines, in terms of shipments. Park Sae-jin swatchsjp@ajunews.com © Aju Business Daily & www.ajunews.com Copyright: All materials on this site may not be reproduced, distributed, transmitted, displayed, published or broadcast without the authorization from the Aju News Corporation.",
    "originSummary": [
      "Samsung Electronics is back as the top player in Southeast Asia's smartphone market, thanks to its AI-based smartphone features, and it dominates the global foldable smartphone market.",
      "In January 2024, Samsung shipped 1.5 million units, securing a 20% market share, while Xiaomi follows closely with 18%. Transsion, Oppo, and Vivo trail with 15%, 15%, and 12% market share respectively.",
      "Despite its leading position, Samsung's growth lags behind Chinese competitors, experiencing an 11% decrease in shipments compared to the previous year. Oppo leads in Indonesia, and Transsion dominates the Philippines in terms of smartphone shipments."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1709816832825
  }
]
