[
  {
    "id": 38088538,
    "title": "GPT-3.5 속도와 16k 컨텍스트로 코딩에서 GPT-4를 능가하는 Phind 모델",
    "originLink": "https://www.phind.com/phindmodelhn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38088538",
    "commentBody": "",
    "originSummary": [
      "Phind는 7세대 모델을 개선하여 GPT-4의 코딩 능력을 능가하고 기술적인 질문에 대한 답변을 5배 더 빠르게 제공합니다.",
      "오픈 소스 CodeLlama-34B를 기반으로 하는 업데이트된 모델은 휴먼에벌 점수 74.7%를 달성했습니다.",
      "복잡한 쿼리 처리와 관련된 몇 가지 문제에도 불구하고, 이 모델은 사용자 커뮤니티의 열렬한 지지를 받고 있으며 초당 최대 100개의 토큰을 처리하고 최대 16,000개의 토큰을 지원할 수 있습니다."
    ],
    "commentSummary": [
      "온라인 사용자들은 특히 코딩 작업에 인공지능 모델 GPT-4와 Phind를 사용하면서 다양한 경험을 하고 있으며, 두 모델 모두 각자의 장단점이 있습니다.",
      "Phind는 속도와 문맥에 대한 이해가 뛰어나며, GPT-4는 높은 수준의 디자인 처리와 후속 쿼리에서 탁월하지만, 사용자들은 정규식을 사용한 원샷 트레이닝과 산문 감지 기능 포함 등 GPT-4에 대한 개선 사항을 제안했습니다.",
      "이러한 모델의 성능, 비용, 사용자 편의성을 중심으로 활발한 논의가 이루어지고 있으며, 향후에는 IDE 통합의 용이성, 독점 소프트웨어 투명성, 인용 효과, 토큰 확장에 중점을 두고 개선이 이루어질 가능성이 있습니다."
    ],
    "points": 806,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1698774047
  },
  {
    "id": 38089342,
    "title": "맥OS 소노마 부팅 실패",
    "originLink": "https://github.com/AsahiLinux/docs/wiki/macOS-Sonoma-Boot-Failures",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089342",
    "commentBody": "",
    "originSummary": [
      "맥북 프로 사용자는 맥OS 소노마 및 맥OS 벤츄라 13.6의 심각한 버그로 인해 심각한 부팅 실패를 경험하고 있으며, 이로 인해 검은 화면이 지속적으로 나타납니다.",
      "이 버그는 아사히 리눅스를 설치한 사용자와 설치하지 않은 사용자를 포함한 모든 사용자에게 영향을 미치며, 이제 설치 프로그램에서 이러한 문제를 자동으로 확인합니다.",
      "사용자는 Apple이 버그를 수정할 때까지 시스템 업그레이드를 자제하는 것이 좋습니다. 이미 영향을 받은 사용자는 아사히 리눅스 인스톨러를 사용하여 진단 및 해결책을 찾을 수 있으며, 부팅할 수 없는 사용자는 복구를 위해 DFU(장치 펌웨어 업데이트) 모드가 필요할 수 있습니다."
    ],
    "commentSummary": [
      "Hacker News의 사용자 토론에 따르면 디스플레이 재생률을 기기의 비휘발성 랜덤 액세스 메모리(NVRAM)에 저장하기로 한 Apple의 결정은 잠재적으로 macOS에서 부팅 손상을 일으킬 수 있다고 합니다.",
      "이 문제는 디스플레이 모드 변경, 오래된 부트 로더 소프트웨어, 특정 macOS 업데이트의 잠재적 문제와 관련이 있는 것으로 보입니다. 일부 사용자는 하드웨어 오류에 직면했으며 Apple의 대응에 대해 우려하고 있습니다.",
      "사용자들은 그래픽 확장 가능한 펌웨어 인터페이스(EFI)와 텍스트 전용 대안 사이에서 토론을 벌였으며, 다양한 사용자 인터페이스, 부트 로더, 화면 해상도가 컴퓨터 성능에 미치는 영향에 대해 폭넓은 대화를 나눴습니다."
    ],
    "points": 596,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1698777232
  },
  {
    "id": 38087573,
    "title": "2023년 실제 사용자들에게 더 빨라진 Firefox",
    "originLink": "https://hacks.mozilla.org/2023/10/down-and-to-the-right-firefox-got-faster-for-real-users-in-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38087573",
    "commentBody": "",
    "originSummary": [
      "2023년에 출시될 Mozilla의 Firefox 브라우저는 실제 사용자 경험을 시뮬레이션하고 개선을 추진하기 위한 Speedometer 3 노력의 일환으로 성능 개선이 이루어졌습니다.",
      "네트워크에서 첫 번째 데이터 바이트를 수신한 후 첫 번째 비주얼을 로드하는 데 걸리는 시간이 15% 단축되고 자바스크립트 실행 시간이 20% 단축되는 등 개선 사항이 있었습니다.",
      "또한 '키 누르기 현재 지연 시간'이 10% 개선되어 사용자가 입력할 때 더 빠른 피드백을 제공함으로써 사용자 경험을 우선시하는 Firefox의 진전을 보여줍니다."
    ],
    "commentSummary": [
      "2023년부터 파이어폭스 사용자와 개발자들은 브라우저의 속도, 개선 사항, 성능 문제를 평가해왔으며, 최근 버전과 애드온은 일부 소프트웨어 비호환성 문제와 새로운 표준의 느린 채택에도 불구하고 높은 평가를 받았습니다.",
      "자바스크립트 처리와 데이터 수집 관행은 주요 토론 주제였으며, 일부 사용자는 개인정보 보호 우려에도 불구하고 이 두 가지가 Firefox의 개선에 필수적이라고 강조했습니다.",
      "잠재적인 개인정보 침해 소지가 있는 브라우저 원격 측정 데이터 사용에 대해 사용자들이 소프트웨어 개선에 있어 브라우저의 역할을 강조하고 옵트인 시스템을 옹호하는 등 논쟁이 벌어졌습니다."
    ],
    "points": 594,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1698770353
  },
  {
    "id": 38089247,
    "title": "AI만으로 앵그리버드 복사하기",
    "originLink": "https://twitter.com/javilopen/status/1719363262179938401",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089247",
    "commentBody": "",
    "originSummary": [
      "사용자 Javi Lopez는 AI 기술을 통해 '앵그리 펌킨 🎃'이라는 프로젝트를 개발했습니다.",
      "프로젝트 개발에는 코딩을 위한 고급 AI 모델인 GPT-4가 활용되었습니다.",
      "이 프로젝트의 그래픽은 이미지 생성용 AI 모델인 Midjourney/DALL-E를 사용하여 제작되었습니다."
    ],
    "commentSummary": [
      "이 토론에서는 게임 개발, 웹 디자인, 코드 생성과 같은 작업에서 AI, 특히 OpenAI의 ChatGPT를 사용하는 것에 대해 논의하며 효율성과 신뢰성에 대한 대조적인 의견을 강조합니다.",
      "일부 개발자는 신속한 프로토타입 제작과 창의력 배양을 가능하게 하는 AI에 박수를 보내지만, 다른 개발자는 잠재적인 부정확성과 상당한 프로그래밍 기술의 필요성에 대해 우려를 표합니다.",
      "AI가 일자리 대체, 독창적이지 않은 콘텐츠 생산, 저품질 콘텐츠 악화 등에 미칠 수 있는 영향을 포함하여 제기된 문제들은 이 유망한 기술이 여전히 지속적인 개선과 신중한 관리가 필요하다는 것을 시사합니다."
    ],
    "points": 549,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1698776835
  },
  {
    "id": 38094620,
    "title": "유블록 오리진 1.53",
    "originLink": "https://github.com/gorhill/uBlock/releases/tag/1.53.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38094620",
    "commentBody": "",
    "originSummary": [
      "GitHub의 gorhill/uBlock 프로젝트에서 로거 출력에 대한 개선 사항, 버그 수정 및 새로운 필터링 표현식이 포함된 업데이트 버전 1.53.0을 출시했습니다.",
      "이 업데이트에는 알 수 없는 출처의 사용자 지정 필터를 추가하지 않도록 주의하는 내용이 포함되어 있어 온라인 보안을 강조하고 있습니다.",
      "기존 스크립트의 개선 사항과 사용자 피드백을 기반으로 한 변경 사항이 포함된 이번 업데이트의 구현에는 기여자 kzar, ryanbr, peace2000이 핵심적으로 참여했습니다."
    ],
    "commentSummary": [
      "최근 업데이트된 광고 차단 확장 프로그램인 uBlock Origin은 YouTube와 같은 플랫폼에서의 효과를 중심으로 온라인에서 많은 논의를 불러일으키고 있습니다.",
      "사용자들은 크롬 기반 브라우저에 비해 파이어폭스에서 성능이 향상되었다고 보고하고 있어 확장 프로그램의 브라우저마다 다른 결과에 대한 논쟁이 벌어지고 있습니다.",
      "사용자들은 디지털 광고가 환경에 미치는 영향과 광고 차단을 통한 경제성에 대한 우려를 표명하며, uBlock Origin과 같은 광고 차단 프로그램을 통해 절약되는 시간과 비용을 언급하는 한편, 광고 차단 성능을 방해하는 YouTube와 같은 플랫폼의 잠재적인 조치에 대해 논의하고 있습니다."
    ],
    "points": 429,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1698813182
  },
  {
    "id": 38092612,
    "title": "노르웨이의 메타 행동 광고 금지가 EU 전체로 확대되었습니다.",
    "originLink": "https://www.datatilsynet.no/aktuelt/aktuelle-nyheter-2023/datatilsynets-vedtak-mot-meta-utvides-til-eueos-og-gjores-permanent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38092612",
    "commentBody": "",
    "originSummary": [
      "유럽 데이터 보호 위원회는 노르웨이의 Facebook 및 Instagram의 행동 기반 마케팅 금지 조치를 EU/EEA 전체로 확대했습니다. 이 결정은 이러한 플랫폼에서의 불법 추적, 감시 및 프로파일링을 다루고 있습니다.",
      "과거의 금지 조치에도 불구하고 메타(구 페이스북)는 계속해서 사용자 데이터를 불법적으로 처리해 왔습니다. 이에 따라 위원회는 아일랜드에 있는 메타의 유럽 본사에 대한 금지 조치를 시행하기 위해 아일랜드 데이터 보호 당국에 이 결정을 전달했습니다.",
      "메타는 향후 행동 기반 마케팅을 위한 데이터 사용에 대한 사용자 동의를 확보할 계획이지만, 아직 구체적인 변경 사항은 시행하지 않았습니다. 또한, 위원회는 동의를 거부하는 사용자에게 요금을 부과하는 메타의 해결책에 대해서도 회의적인 입장을 표명했습니다."
    ],
    "commentSummary": [
      "유럽연합은 사용자 동의를 구하지 않은 메타의 행동 광고에 대한 금지 조치를 연장했으며, 데이터 공유를 거부하는 사용자에게 요금을 부과할 계획입니다.",
      "이 금지 조치는 메타가 이러한 문제를 해결할 때까지 유효하며, 사용자들 사이에서 데이터 프라이버시, 광고 차단 영향 및 광고 효과에 대한 논의를 촉발할 것입니다.",
      "유럽 데이터 보호 위원회는 EU의 일반 데이터 보호 규정(GDPR) 위반을 이유로 Disqus의 노르웨이 내 개인 데이터 처리를 일시적으로 금지했습니다."
    ],
    "points": 413,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1698793811
  },
  {
    "id": 38089356,
    "title": "배심원단, 부동산 중개업자들의 공모를 인정하고 약 18억 달러의 손해배상금 지급 판결",
    "originLink": "https://www.wsj.com/real-estate/jury-finds-realtors-conspired-to-keep-commissions-high-awards-nearly-1-8-billion-in-damages-b26f9c2f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089356",
    "commentBody": "",
    "originSummary": [
      "연방 배심원단은 전미부동산중개인협회와 몇몇 주요 주택 중개업체가 수수료율을 인위적으로 높게 유지하기로 공모한 혐의로 유죄 판결을 내렸으며, 이로 인해 약 18억 달러의 손해배상을 청구했습니다.",
      "이 사건은 주택 가격 상승에도 불구하고 높은 수수료율을 유지하여 부동산 중개업자의 수익을 강화해온 오랜 업계 규칙에 변화를 불러일으킬 수 있는 계기가 될 수 있습니다.",
      "이번 소송은 온라인 부동산 검색 기술의 발전에도 불구하고 불법적인 업계 관행이 소비자의 비용 절감을 가로막고 있다고 주장하며 제기된 두 건의 반독점 소송 중 첫 번째 소송입니다."
    ],
    "commentSummary": [
      "배심원단이 주택 거래 비용을 부풀리려는 음모를 이유로 유명 부동산 사건에 대해 18억 달러의 손해배상금을 지급했습니다.",
      "비평가들은 부동산 중개인이 제공하는 가치에 의문을 제기하며 중개인의 업무 방식과 수수료율에 대한 투명성을 강화해야 한다고 주장하고 있습니다.",
      "고정 수수료 모델, 소유자 판매(FSBO) 리스팅을 위한 대체 다중 리스팅 서비스(MLS), 구매자 지불 모델 등 전미부동산중개인협회가 보유한 주택 시장에 대한 통제권을 무너뜨리기 위한 대안이 제시되고 있습니다."
    ],
    "points": 298,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1698777311
  },
  {
    "id": 38090521,
    "title": "그랜드 테프트 오토 III 재구현",
    "originLink": "https://openrw.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38090521",
    "commentBody": "",
    "originSummary": [
      "오픈소스 프로젝트인 OpenRW는 고전 비디오 게임인 GTA III의 엔진을 현대 시스템과 호환되도록 재구현하는 것을 목표로 하고 있습니다. 궁극적인 목표는 오리지널 게임플레이와 모든 게임 데이터 형식과의 호환성, 최신 게임패드 지원을 구현하는 '버전 1.0'에 도달하는 것입니다.",
      "OpenRW가 개발되면 플레이어 수정, 게임플레이 변경, 멀티플레이어 기능 활성화가 가능하지만, 플레이하려면 게임 데이터가 설치된 GTA III 사본이 필요합니다.",
      "OpenRW는 현재 개발 중이며, 깃허브를 통해 누구에게나 기여를 공개하고 있습니다. 2013년에 tsjost와 danhedron에 의해 시작되었지만, Rockstar Games는 이를 지지하지 않습니다."
    ],
    "commentSummary": [
      "한 해커 뉴스 게시물의 대화는 테이크투의 소송으로 인해 중단된 그랜드 테프트 오토 III 재구현 프로젝트에 관한 것이지만, 모로윈드 게임 프로젝트인 OpenMW는 여전히 활발하게 개발되고 있습니다.",
      "사용자들은 소스 코드를 이해하고 재개발할 때 합법적이라고 주장되는 '클린룸' 리버스 엔지니어링 프로세스에 대해 논의했습니다.",
      "참가자들은 오래된 코드와 게임 리마스터링 관행과의 관련성을 언급하며 GTA 3 디파이널 에디션의 품질에 대해 면밀히 조사했습니다."
    ],
    "points": 286,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1698781980
  },
  {
    "id": 38095542,
    "title": "기술 업계에서 도대체 무슨 일이 일어나고 있는 걸까요?",
    "originLink": "https://ludic.mataroa.blog/blog/what-the-goddamn-hell-is-going-on-in-the-tech-industry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38095542",
    "commentBody": "",
    "originSummary": [
      "저자는 대형 기술 기업의 기술 생산성 낭비에 대한 우려를 표명하며, FAANG 및 기타 유명 기업의 비효율성과 문제를 무시하는 경영진에 대한 보고를 언급합니다.",
      "내레이터는 변화에 저항하는 사람, 어려운 상황을 견디는 사람, 기존 문제에 대해 부정하는 사람 등 세 가지 범주의 독자를 식별합니다.",
      "그는 지원 그룹을 만들 것을 제안하고 현재 비생산적인 업무 환경에서 벗어나고자 하는 직원을 돕기 위한 가이드를 작성하고 있습니다."
    ],
    "commentSummary": [
      "저자는 오래된 시스템과 비윤리적인 개인을 탐색할 수 있는 사람에게 보상을 주는 기술 업계의 채용 관행을 비판하며, 기술 역량과 함께 중요한 소프트 스킬에 초점을 맞추는 데 상당한 결함이 있음을 강조합니다.",
      "이 기사에서는 기술 업계에서 더 나은 관리가 시급히 필요하다는 점을 강조하며, 숙련되고 윤리적인 리더를 찾는 데 어려움을 겪고 있으며 기존의 '한 명의 관리자가 모든 것을 관리'하는 방식보다 관리자의 역할을 분담할 것을 제안합니다.",
      "또한 기술 업계가 경제 위기에 대응하는 방법, 기업의 수익 창출 방식 변화, 기술 인력에 대한 보상이 경제에 미치는 영향에 대해서도 논의했습니다."
    ],
    "points": 218,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1698824407
  },
  {
    "id": 38086894,
    "title": "인텔 82586 네트워크 칩 다이의 이더넷 백오프 리버스 엔지니어링",
    "originLink": "http://www.righto.com/2023/10/reverse-engineering-ethernet-backoff-on.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38086894",
    "commentBody": "",
    "originSummary": [
      "Ken Shirriff의 블로그 게시물은 1982년에 출시된 인텔의 82586 이더넷 LAN 코프로세서 칩의 기술적 작동 방식을 자세히 설명합니다.",
      "이 게시물에서는 칩이 네트워크 충돌을 관리하고, 지수 백오프를 사용하며, 통신을 위해 공유 메모리 구조를 사용하는 방법을 강조합니다. 또한 카운터 회로, 동적 래치 회로 및 마스크 레지스터 내의 메커니즘에 대해서도 언급합니다.",
      "이더넷 백오프 메커니즘과 시스템의 잠재적 단점에 대해서도 논의하여 주제에 대한 추가적인 관점을 추가합니다."
    ],
    "commentSummary": [
      "인텔 82586 네트워크 칩을 리버스 엔지니어링하여 이더넷 백오프에서의 역할을 연구한 결과, 최신 칩은 트랜지스터가 더 많음에도 불구하고 더 적은 작업을 수행한다는 사실을 발견했습니다.",
      "최신 칩에는 10비트 카운터와 고급 네트워크 인터페이스 카드(NIC)와 같은 구형 모델의 특정 기능이 포함되어 있어 82586과 상당한 유사성을 보여 구형 기술의 지속적인 영향력을 강조합니다.",
      "로버트 가너는 과거와 현재의 칩 설계와 기술을 모두 기록한 이더넷의 역사에 관한 책을 집필 중이며, 이더넷의 발전에 대해 심도 있게 살펴볼 수 있는 것으로 알려졌습니다."
    ],
    "points": 187,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1698767997
  },
  {
    "id": 38086598,
    "title": "최소한의 TCP/IP 스택, MicroTCP",
    "originLink": "https://github.com/cozis/microtcp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38086598",
    "commentBody": "",
    "originSummary": [
      "MicroTCP는 나폴리 페데리코 2세 대학의 컴퓨터 네트워킹 과정 중 개인 학습 프로젝트의 일환으로 \"cozis\"가 만든 최소한의 포괄적인 TCP/IP 네트워크 스택입니다.",
      "Windows 및 Linux와 모두 호환되는 이 스택은 ARP, IPv4, ICMP, TCP 통신 처리를 위한 모든 기능을 제공하며, 마이크로컨트롤러와 함께 사용할 수 있도록 조정할 수 있습니다.",
      "현재 진행 중인 테스트에도 불구하고 MicroTCP는 이미 로컬 네트워크 HTTP 트래픽을 관리할 수 있는 역량을 갖추고 있습니다."
    ],
    "commentSummary": [
      "최소한의 TCP/IP 스택 프로젝트인 MicroTCP는 실제 애플리케이션 및 단위 테스트에 대한 폭넓은 논의와 함께 낮은 코드 및 RAM 요구 사항으로 인해 관심을 받고 있습니다.",
      "이 프로젝트의 개발자는 라이선스 문제에도 불구하고 안정성을 확보할 때까지 개발을 계속할 계획입니다.",
      "포럼에서는 반복 학습, 온라인 연구, 전문가 조언에 의존하여 DOS용 TCP/IP 스택을 처음부터 구축하는 방법에 대해 집중적으로 논의합니다. 또한 시스템의 추상화 계층과 네트워크 운영을 해독하는 데 있어 OSI(개방형 시스템 상호연결) 모델의 적용에 대해서도 자세히 살펴봅니다."
    ],
    "points": 185,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1698766992
  },
  {
    "id": 38095699,
    "title": "Bear가 CSS로 분석하는 방법",
    "originLink": "https://herman.bearblog.dev/how-bear-does-analytics-with-css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38095699",
    "commentBody": "",
    "originSummary": [
      "허먼의 곰 블로그는 엄격한 개인정보 보호 표준을 유지하면서 클라이언트 측 자바스크립트를 사용하지 않고 사용자 참여를 추적하는 고유한 분석 시스템을 만들었습니다.",
      "이 새로운 방법은 광고 차단기에 의해 차단되는 경우가 많은 서버 로그나 기존 분석 도구 대신 CSS를 사용합니다. 커서가 페이지 위로 이동하면 사용자 참여를 추적하여 조회한 게시물의 URL을 트리거합니다.",
      "이 시스템은 식별 정보를 저장하지 않고 페이지의 고유한 '읽기' 횟수를 위해 IP 주소를 날짜와 함께 해시 처리하여 사용자 개인정보를 보호합니다. IP 주소는 일시적으로만 저장됩니다."
    ],
    "commentSummary": [
      "해싱된 IP 주소는 안전한 알고리즘을 사용함에도 불구하고 가역적인 특성으로 인해 온라인 토론에서 면밀한 조사를 받고 있으며, 해싱이 데이터를 진정으로 익명화하지 못한다는 유럽연합 데이터 보호 기관의 견해에 주목하고 있습니다.",
      "보안 강화를 위한 권장 사례로는 해시를 솔트 처리하고, 범용 고유 식별자를 독립적으로 생성하며, 임시 또는 비밀 솔트를 사용하는 것이 있습니다.",
      "매출과 사용자 경험을 향상시키기 위한 데이터 수집의 필요성에 대한 논의가 활발하게 이루어지고 있으며, GDPR 준수, 사용자 개인정보 보호, 콘텐츠 개선, 데이터의 저장 및 분할에 대한 우려도 커지고 있습니다."
    ],
    "points": 184,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698826089
  },
  {
    "id": 38093353,
    "title": "Distil-Whisper: 6배 더 빠르고 49% 더 작아진 위스퍼의 증류 버전입니다.",
    "originLink": "https://github.com/huggingface/distil-whisper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38093353",
    "commentBody": "",
    "originSummary": [
      "허깅페이스는 OpenAI의 영어 음성 인식 시스템 '위스퍼'의 최적화된 버전인 '디스틸 위스퍼'를 도입했습니다.",
      "개선된 모델은 6배 더 빠르고 49% 더 작아졌지만 익숙하지 않은 평가 데이터 세트에서 1% WER(단어 오류율) 이내의 거의 동일한 정확도로 성능을 발휘합니다. 또한 노이즈와 환각에 대한 내성이 향상되어 오류율을 효과적으로 줄입니다.",
      "Distil-Whisper는 11월 2일에 출시되며, 추론 기능을 활성화하고 허깅 페이스의 트랜스포머 라이브러리와 통합하기 위한 가이드라인이 함께 제공됩니다. 이 시스템은 10개 도메인에 걸쳐 18,000명 이상의 화자로부터 22,000시간 분량의 의사 레이블이 지정된 오디오 데이터를 사용하여 미세 조정되었습니다."
    ],
    "commentSummary": [
      "OpenAI는 AI 음성 인식 도구인 Whisper의 더 효율적인 버전인 Distil-Whisper를 출시했습니다. 6배 더 빠르고 49% 더 작아진 이 버전은 전력이 제한된 장치와 웹 브라우저에 적합합니다.",
      "Distil-Whisper는 주로 구두점 및 필러 단어 문제로 인해 영어 전사 시 1~2%의 오류율을 보입니다.",
      "일부 사용자는 이 모델을 미세 조정하여 개인 음성 어시스턴트를 만들기 위한 다른 도구와 잠재적으로 통합하려고 합니다."
    ],
    "points": 177,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1698800141
  },
  {
    "id": 38088856,
    "title": "퀄컴 스냅드래곤 8세대 3 모바일 플랫폼에서 사용 가능한 업스트림 Linux 지원",
    "originLink": "https://www.linaro.org/blog/upstream-linux-support-now-available-for-the-the-qualcomm-snapdragon-8-gen-3-mobile-platform/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38088856",
    "commentBody": "",
    "originSummary": [
      "리나로의 엔지니어 닐 암스트롱은 퀄컴 스냅드래곤 8세대 3 모바일 플랫폼에 대한 업스트림 리눅스 지원을 활성화하여 선구적인 솔루션을 제공하고자 하는 리나로의 노력을 강조했습니다.",
      "2023년 10월 25일에 게시된 이 지원을 통해 Linux 통합, 성능 최적화, 메인라인에서 AOSP(Android 오픈 소스 프로젝트)를 실행할 수 있으며, 활성화된 기능 중 Qualcomm® Kryo™ CPU, 저속 I/O, 고밀도 스토리지, 고속 주변 장치를 사용할 수 있습니다.",
      "향후 계획에는 Linux 커널 커뮤니티와 협력하여 모든 패치 시리즈를 신속하게 병합하고 더 많은 기능을 활성화하는 것이 포함됩니다."
    ],
    "commentSummary": [
      "리눅스는 이제 퀄컴 하이퍼바이저 종속성을 가진 퀄컴의 스냅드래곤 8세대 3 모바일 플랫폼을 지원하므로 시스템 운영에 미치는 영향에 대한 우려가 제기되고 있습니다.",
      "사용자들은 독점 펌웨어 사용, Android 오픈 소스 프로젝트의 바이너리 블롭으로 인한 잠재적 보안 위험, 오픈 소스 펌웨어를 비공개 소스 하드웨어와 함께 사용할 때의 취약성에 대해 토론을 벌였습니다.",
      "사용자들 간의 토론에서는 솔더링 메모리가 장착된 업그레이드 불가 노트북에 대한 대조적인 견해와 System76 및 퓨리즘 제품의 가격, 품질, 윤리적 측면에 대한 의견도 반영되었습니다."
    ],
    "points": 171,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1698775287
  },
  {
    "id": 38087448,
    "title": "iPhone으로 촬영하고 Mac에서 편집한 Apple의 기조연설 이벤트",
    "originLink": "https://www.apple.com/newsroom/2023/10/behind-the-scenes-at-scary-fast-apples-keynote-event-shot-on-iphone/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38087448",
    "commentBody": "",
    "originSummary": [
      "Apple의 '무서운 속도' 이벤트는 iPhone 15 Pro Max를 사용하여 촬영하고 Mac에서 편집하여 기술의 성능을 보여줬습니다. 이 이벤트에서는 M3 칩 제품군이 탑재된 새로운 MacBook Pro와 24인치 iMac이 소개되었습니다.",
      "iPhone 15 Pro Max는 스마트폰 최초로 아카데미 컬러 인코딩 시스템(ACES)을 지원하여 사용자가 Apple Log 인코딩을 통해 최대 4K60의 ProRes 비디오를 캡처할 수 있습니다.",
      "이 행사에서는 빠른 데이터 전송, 외장 SSD 드라이브에 직접 기록, 포스트 프로덕션에서 저조도 성능과 컬러 그레이딩 유연성을 위한 향상된 카메라 기능 등 새로운 iPhone의 USB-C 커넥터의 기능도 강조했습니다."
    ],
    "commentSummary": [
      "애플은 최근 이벤트에서 아이폰의 동영상 기능을 시연하면서 전문가용 카메라로서의 기능에 대한 논쟁을 불러일으켰습니다.",
      "비평가들은 전문가 수준의 비디오 촬영을 위해서는 값비싼 추가 장비와 포스트 프로덕션 작업이 필요하기 때문에 iPhone 사용으로 인한 잠재적 비용 절감 효과가 미미하다고 주장합니다.",
      "지지자들은 이 기기의 휴대성과 사용 편의성을 강조하며 저예산 영화나 독립 프로젝트에 적합한 옵션이 될 수 있다고 말합니다."
    ],
    "points": 171,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1698769957
  }
]
