[
  {
    "id": 38088538,
    "title": "Phind Model mengalahkan GPT-4 dalam pengkodean, dengan kecepatan GPT-3.5 dan konteks 16k",
    "originLink": "https://www.phind.com/phindmodelhn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38088538",
    "commentBody": "",
    "originSummary": [
      "Phind telah menyempurnakan model generasi ke-7 untuk mengungguli kemampuan pengkodean GPT-4 dan memberikan jawaban atas pertanyaan teknis lima kali lebih cepat.",
      "Model yang diperbarui, yang didasarkan pada CodeLlama-34B yang bersumber terbuka, telah mencapai skor HumanEval 74,7%.",
      "Meskipun ada beberapa masalah dalam menangani kueri yang rumit, model ini telah diterima dengan hangat oleh komunitas pengguna, dan dapat memproses hingga 100 token per detik dan mendukung hingga 16 ribu token."
    ],
    "commentSummary": [
      "Pengguna online menunjukkan pengalaman yang beragam saat menggunakan model AI GPT-4 dan Phind, terutama untuk tugas-tugas pengkodean; kedua model tersebut memiliki kelebihan dan kekurangannya masing-masing.",
      "Phind menonjol karena kecepatan dan pemahaman konteksnya, sementara GPT-4 unggul dalam penanganan desain tingkat tinggi dan kueri tindak lanjut; namun, pengguna telah mengusulkan peningkatan untuk GPT-4, seperti memungkinkan pelatihan sekali tembak dengan regex dan penyertaan deteksi prosa.",
      "Perdebatan yang kuat berkisar pada kinerja, biaya, dan keramahan pengguna dari model-model ini, dengan perbaikan di masa depan yang mungkin berfokus pada kemudahan integrasi IDE, transparansi perangkat lunak berpemilik, efektivitas kutipan, dan perluasan token."
    ],
    "points": 806,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1698774047
  },
  {
    "id": 38089342,
    "title": "Kegagalan Boot macOS Sonoma",
    "originLink": "https://github.com/AsahiLinux/docs/wiki/macOS-Sonoma-Boot-Failures",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089342",
    "commentBody": "",
    "originSummary": [
      "Pengguna MacBook Pro telah mengalami kegagalan boot yang parah karena bug yang signifikan di macOS Sonoma dan macOS Ventura 13.6, yang menyebabkan layar hitam terus-menerus.",
      "Bug mempengaruhi semua pengguna, termasuk mereka yang sudah dan belum menginstal Asahi Linux, dengan installer yang sekarang memeriksa masalah ini secara otomatis.",
      "Pengguna disarankan untuk tidak melakukan upgrade sistem sampai Apple memperbaiki bug tersebut. Mereka yang telah terkena dampak dapat menggunakan penginstal Asahi Linux untuk diagnosis dan solusi, sementara mereka yang tidak dapat melakukan booting mungkin memerlukan mode DFU (Device Firmware Update) untuk pemulihan."
    ],
    "commentSummary": [
      "Keputusan Apple untuk menyimpan kecepatan refresh tampilan dalam Non-Volatile Random-Access Memory (NVRAM) perangkat berpotensi menyebabkan kerusakan boot pada macOS, berdasarkan diskusi pengguna di Hacker News.",
      "Masalah ini tampaknya terkait dengan perubahan mode tampilan, perangkat lunak bootloader yang sudah ketinggalan zaman, dan potensi masalah dengan pembaruan macOS tertentu. Beberapa pengguna mengalami kegagalan perangkat keras dan memiliki kekhawatiran tentang tanggapan Apple.",
      "Pengguna telah memperdebatkan antara Extensible Firmware Interface (EFI) grafis dan alternatif teks saja, dengan percakapan yang lebih luas yang membahas antarmuka pengguna yang berbeda, pemuat boot, dan bagaimana resolusi layar memengaruhi kinerja komputer."
    ],
    "points": 596,
    "commentCount": 246,
    "retryCount": 0,
    "time": 1698777232
  },
  {
    "id": 38087573,
    "title": "Firefox menjadi lebih cepat untuk pengguna nyata pada tahun 2023",
    "originLink": "https://hacks.mozilla.org/2023/10/down-and-to-the-right-firefox-got-faster-for-real-users-in-2023/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38087573",
    "commentBody": "",
    "originSummary": [
      "Browser Firefox Mozilla pada tahun 2023 telah mengalami peningkatan kinerja sebagai bagian dari upaya Speedometer 3, yang bertujuan untuk mensimulasikan pengalaman pengguna di dunia nyata dan mendorong peningkatan.",
      "Peningkatan yang dilakukan meliputi pengurangan 15% waktu untuk memuat visual pertama sejak menerima byte pertama data dari jaringan dan pengurangan waktu eksekusi JavaScript sebesar 20%.",
      "Ada juga peningkatan sebesar 10% dalam \"keypress present latency\", yang menawarkan umpan balik yang lebih cepat kepada pengguna saat mengetik, menunjukkan kemajuan Firefox dalam memprioritaskan pengalaman pengguna."
    ],
    "commentSummary": [
      "Pengguna dan pengembang Firefox telah menilai kecepatan, kemajuan, dan masalah kinerja peramban ini sejak tahun 2023; versi terbaru dan pengaya mendapat peringkat tinggi meskipun ada beberapa masalah ketidakcocokan perangkat lunak dan lambatnya adopsi standar baru.",
      "Penanganan JavaScript dan praktik pengumpulan data merupakan poin utama dari diskusi, dengan beberapa pengguna menyoroti keduanya sebagai hal yang penting untuk peningkatan Firefox meskipun ada masalah privasi.",
      "Penggunaan data telemetri peramban, yang berpotensi melanggar privasi, diperdebatkan, dengan para pengguna yang menekankan perannya dalam peningkatan perangkat lunak dan mengadvokasi sistem opt-in."
    ],
    "points": 594,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1698770353
  },
  {
    "id": 38089247,
    "title": "Menyalin Angry Birds hanya dengan AI",
    "originLink": "https://twitter.com/javilopen/status/1719363262179938401",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089247",
    "commentBody": "",
    "originSummary": [
      "Pengguna Javi Lopez telah mengembangkan sebuah proyek bernama \"Angry Pumpkins 🎃\" melalui teknologi AI.",
      "GPT-4, sebuah model AI canggih untuk pengkodean, digunakan dalam pengembangan proyek ini.",
      "Grafik untuk proyek ini dibuat dengan menggunakan Midjourney/DALL-E, sebuah model AI untuk menghasilkan gambar."
    ],
    "commentSummary": [
      "Diskusi berkisar pada penggunaan AI, khususnya ChatGPT dari OpenAI, dalam tugas-tugas seperti pengembangan game, desain web, dan pembuatan kode, dengan menyoroti pendapat-pendapat yang berbeda tentang efisiensi dan keandalannya.",
      "Sementara beberapa pengembang memuji AI karena memungkinkan pembuatan prototipe yang cepat dan menumbuhkan kreativitas, yang lain menyuarakan kekhawatiran tentang potensi ketidakakuratan dan kebutuhan akan keterampilan pemrograman yang substansial.",
      "Masalah yang diangkat termasuk kemungkinan implikasi AI terhadap perpindahan pekerjaan, produksi konten yang tidak orisinal, dan memperburuk konten berkualitas rendah, yang menunjukkan bahwa teknologi yang menjanjikan ini masih membutuhkan penyempurnaan dan manajemen yang bijaksana."
    ],
    "points": 549,
    "commentCount": 263,
    "retryCount": 0,
    "time": 1698776835
  },
  {
    "id": 38094620,
    "title": "uBlock Origin 1.53",
    "originLink": "https://github.com/gorhill/uBlock/releases/tag/1.53.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38094620",
    "commentBody": "",
    "originSummary": [
      "Proyek gorhill/uBlock di GitHub telah merilis pembaruan, versi 1.53.0 yang mencakup peningkatan, perbaikan bug, dan ekspresi pemfilteran baru untuk keluaran logger.",
      "Pembaruan ini berisi catatan peringatan agar tidak menambahkan filter khusus dari sumber yang tidak dikenal, sehingga menekankan keamanan online.",
      "Kontributor kzar, ryanbr, dan peace2000 telah berperan penting dalam implementasi pembaruan ini, yang juga mencakup penyempurnaan scriptlet yang sudah ada dan perubahan berdasarkan umpan balik dari pengguna."
    ],
    "commentSummary": [
      "Pembaruan ekstensi pemblokiran iklan terbaru, uBlock Origin, memicu diskusi online, dengan keefektifannya pada platform seperti YouTube sebagai intinya.",
      "Pengguna melaporkan peningkatan kinerja di Firefox dibandingkan dengan peramban berbasis Chromium, sehingga menimbulkan perdebatan tentang hasil ekstensi yang bervariasi di berbagai peramban.",
      "Para pengguna mengungkapkan keprihatinan mereka tentang dampak lingkungan dari iklan digital dan keekonomisan pemblokiran iklan, dengan alasan penghematan waktu dan biaya dengan pemblokir iklan seperti uBlock Origin, sembari mendiskusikan tindakan potensial dari platform seperti YouTube untuk menghalangi kinerja pemblokir iklan."
    ],
    "points": 429,
    "commentCount": 222,
    "retryCount": 0,
    "time": 1698813182
  },
  {
    "id": 38092612,
    "title": "Larangan Norwegia terhadap iklan perilaku Meta diperluas ke seluruh Uni Eropa",
    "originLink": "https://www.datatilsynet.no/aktuelt/aktuelle-nyheter-2023/datatilsynets-vedtak-mot-meta-utvides-til-eueos-og-gjores-permanent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38092612",
    "commentBody": "",
    "originSummary": [
      "Dewan Perlindungan Data Eropa telah memperluas larangan Norwegia terhadap pemasaran berbasis perilaku di Facebook dan Instagram di seluruh Uni Eropa/EEA. Keputusan ini membahas pelacakan, pengawasan, dan pembuatan profil ilegal pada platform ini.",
      "Meskipun ada larangan di masa lalu, Meta (sebelumnya Facebook) terus menangani data pengguna secara tidak sah. Oleh karena itu, dewan telah meneruskan keputusan ini kepada otoritas perlindungan data Irlandia untuk memberlakukan larangan tersebut di kantor pusat Meta Eropa di Irlandia.",
      "Meskipun Meta berencana untuk mengamankan persetujuan pengguna untuk penggunaan data untuk pemasaran berbasis perilaku di masa depan, Meta belum menerapkan perubahan spesifik apa pun. Dewan juga menyatakan skeptis terhadap solusi yang disarankan Meta untuk mengenakan biaya kepada pengguna yang menolak memberikan persetujuan."
    ],
    "commentSummary": [
      "Uni Eropa telah memperpanjang larangan terhadap iklan perilaku Meta karena kegagalannya untuk meminta persetujuan pengguna dan berencana untuk menagih pengguna yang tidak mau berbagi data.",
      "Larangan tersebut tetap berlaku hingga Meta menyelesaikan masalah ini, sehingga mendorong diskusi tentang privasi data, dampak pemblokiran iklan, dan efektivitas iklan di antara para pengguna.",
      "Dewan Perlindungan Data Eropa telah melarang Disqus untuk sementara waktu memproses data pribadi di Norwegia, dengan alasan pelanggaran Peraturan Perlindungan Data Umum (GDPR) Uni Eropa."
    ],
    "points": 413,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1698793811
  },
  {
    "id": 38089356,
    "title": "Juri Mendapati Realtors Bersekongkol, Memberikan Ganti Rugi Hampir $1,8 Miliar",
    "originLink": "https://www.wsj.com/real-estate/jury-finds-realtors-conspired-to-keep-commissions-high-awards-nearly-1-8-billion-in-damages-b26f9c2f",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38089356",
    "commentBody": "",
    "originSummary": [
      "Juri federal telah memvonis National Association of Realtors dan beberapa broker perumahan besar bersekongkol untuk mempertahankan tingkat komisi yang tinggi secara artifisial, yang menyebabkan kerugian sekitar $1,8 miliar.",
      "Kasus ini berpotensi memicu perubahan dalam peraturan industri yang sudah berlangsung lama, yang telah mempertahankan tingkat komisi yang tinggi bahkan di tengah kenaikan harga rumah, sehingga meningkatkan keuntungan bagi para agen real estat.",
      "Gugatan ini merupakan yang pertama dari dua kasus antimonopoli yang menuduh bahwa praktik-praktik ilegal dalam industri ini telah menghalangi konsumen untuk mengurangi biaya mereka, meskipun ada kemajuan dalam teknologi pencarian properti secara online."
    ],
    "commentSummary": [
      "Juri telah memberikan ganti rugi sebesar $1,8 miliar dalam sebuah kasus real estat yang terkenal, dengan alasan adanya konspirasi untuk menggelembungkan biaya transaksi perumahan.",
      "Para kritikus mempertanyakan nilai yang diberikan oleh makelar dan menganjurkan transparansi yang lebih besar tentang praktik dan tingkat komisi mereka.",
      "Strategi alternatif disarankan untuk mengganggu kontrol atas pasar perumahan yang dipegang oleh National Association of Realtors, termasuk model biaya tetap, alternatif Multiple Listing Service (MLS) untuk daftar For Sale By Owner (FSBO), dan model pembeli-membayar."
    ],
    "points": 298,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1698777311
  },
  {
    "id": 38090521,
    "title": "Implementasi Ulang Grand Theft Auto III",
    "originLink": "https://openrw.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38090521",
    "commentBody": "",
    "originSummary": [
      "OpenRW, sebuah proyek sumber terbuka, bermaksud mengimplementasikan ulang mesin video game klasik GTA III agar kompatibel dengan sistem kontemporer. Tujuan utamanya adalah mencapai \"Versi 1.0,\" mengimplementasikan gameplay orisinil dan kompatibilitas dengan semua format data game, dan dukungan gamepad modern.",
      "Setelah dikembangkan, OpenRW mungkin memungkinkan modifikasi pemain, perubahan gameplay, dan mengaktifkan fitur multipemain, tetapi salinan GTA III dengan data game yang terinstal akan diperlukan untuk bermain.",
      "OpenRW saat ini sedang dalam tahap pengembangan, dengan kontribusi yang terbuka untuk siapa saja melalui GitHub. Diprakarsai oleh tsjost dan danhedron pada tahun 2013, proyek ini tidak didukung oleh Rockstar Games."
    ],
    "commentSummary": [
      "Pembicaraan dalam postingan Hacker News seputar proyek Grand Theft Auto III Re-Implementation yang dihentikan karena tuntutan hukum dari Take-Two, sementara OpenMW, proyek game Morrowind, masih aktif dikembangkan.",
      "Para pengguna mendiskusikan proses reverse engineering 'ruang bersih', sebuah praktik yang dianggap legal ketika memahami dan mengembangkan kembali kode sumber.",
      "Kualitas Edisi Definitif GTA 3 diteliti, dengan para peserta yang juga mengutip kode lama dan relevansinya dengan praktik remaster game."
    ],
    "points": 286,
    "commentCount": 120,
    "retryCount": 0,
    "time": 1698781980
  },
  {
    "id": 38095542,
    "title": "Apa yang Sedang Terjadi di Industri Teknologi?",
    "originLink": "https://ludic.mataroa.blog/blog/what-the-goddamn-hell-is-going-on-in-the-tech-industry/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38095542",
    "commentBody": "",
    "originSummary": [
      "Penulis mengungkapkan keprihatinannya atas produktivitas teknis yang terbuang di perusahaan-perusahaan teknologi besar, merujuk pada laporan-laporan tentang inefisiensi dan manajemen yang mengabaikan masalah-masalah di FAANG dan perusahaan-perusahaan terkemuka lainnya.",
      "Narator mengidentifikasi tiga kategori pembaca: mereka yang menolak perubahan, mereka yang bertahan dalam kondisi yang menantang, dan mereka yang menyangkal masalah yang ada.",
      "Dia mengusulkan untuk membentuk kelompok pendukung dan saat ini sedang menyusun panduan untuk membantu karyawan yang ingin keluar dari lingkungan kerja yang tidak produktif."
    ],
    "commentSummary": [
      "Penulis mengkritik praktik perekrutan di industri teknologi, yang sering kali memberikan penghargaan kepada mereka yang dapat menavigasi sistem yang sudah ketinggalan zaman dan individu yang tidak beretika, menyoroti kekurangan yang signifikan dalam fokus pada keterampilan lunak yang penting di samping kompetensi teknologi.",
      "Artikel ini menekankan kebutuhan mendesak industri teknologi akan manajemen yang lebih baik, membahas perjuangan dalam menemukan pemimpin yang terampil dan beretika, dan menyarankan peran manajerial bersama daripada pendekatan tradisional \"satu manajer untuk semua\".",
      "Selain itu, dibahas pula bagaimana industri teknologi merespons krisis ekonomi, perubahan cara perusahaan menghasilkan pendapatan, dan dampak pemberian kompensasi kepada para pekerja teknologi terhadap perekonomian."
    ],
    "points": 218,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1698824407
  },
  {
    "id": 38086894,
    "title": "Rekayasa balik Ethernet backoff pada die chip jaringan Intel 82586",
    "originLink": "http://www.righto.com/2023/10/reverse-engineering-ethernet-backoff-on.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38086894",
    "commentBody": "",
    "originSummary": [
      "Artikel blog oleh Ken Shirriff menggali cara kerja teknis chip koprosesor Ethernet LAN 82586 Intel yang dirilis pada tahun 1982.",
      "Tulisan ini menyoroti bagaimana chip mengelola tabrakan jaringan, menggunakan backoff eksponensial, dan menggunakan struktur memori bersama untuk komunikasi. Juga disebutkan mekanisme dalam sirkuit penghitung, sirkuit kait dinamis, dan register mask.",
      "Mekanisme backoff Ethernet dan potensi kelemahan sistem juga dibahas, menambahkan perspektif tambahan pada topik ini."
    ],
    "commentSummary": [
      "Chip jaringan Intel 82586 direkayasa ulang untuk mempelajari perannya dalam Ethernet backoff, dan menemukan bahwa chip yang lebih baru, meskipun memiliki lebih banyak transistor, melakukan lebih sedikit tugas.",
      "Chip modern membawa fitur tertentu dari model lama seperti penghitung 10-bit dan Network Interface Card (NIC) kelas atas yang menunjukkan kemiripan yang cukup besar dengan 82586, menyoroti pengaruh teknologi lama yang masih ada.",
      "Sebuah buku tentang sejarah Ethernet, yang mendokumentasikan desain dan teknologi chip di masa lalu dan saat ini, kabarnya sedang disusun oleh Robert Garner, yang menawarkan tinjauan mendalam tentang perkembangan Ethernet."
    ],
    "points": 187,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1698767997
  },
  {
    "id": 38086598,
    "title": "MicroTCP, tumpukan TCP/IP minimal",
    "originLink": "https://github.com/cozis/microtcp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38086598",
    "commentBody": "",
    "originSummary": [
      "MicroTCP adalah tumpukan jaringan TCP/IP yang minimal namun komprehensif yang dibuat oleh \"cozis\" sebagai bagian dari proyek pembelajaran pribadi selama kursus Jaringan Komputer di Università degli Studi di Napoli Federico II.",
      "Stack yang kompatibel dengan Windows dan Linux ini menyediakan fungsionalitas penuh untuk menangani komunikasi ARP, IPv4, ICMP, dan TCP, dan berpotensi untuk diadaptasi untuk digunakan dengan mikrokontroler.",
      "Meskipun masih dalam tahap pengujian, MicroTCP telah memiliki kapasitas untuk mengelola lalu lintas HTTP jaringan lokal."
    ],
    "commentSummary": [
      "MicroTCP, sebuah proyek tumpukan TCP/IP minimal, mulai diminati karena kebutuhan kode dan RAM-nya yang rendah, bersama dengan diskusi yang lebih luas tentang aplikasi dunia nyata dan pengujian unit.",
      "Pencipta proyek ini berencana untuk melanjutkan pengembangan hingga mencapai kestabilan, meskipun ada masalah lisensi.",
      "Wacana forum membahas tentang membangun tumpukan TCP/IP dari bawah ke atas untuk DOS, bersandar pada pembelajaran berulang, penelitian online, dan saran ahli. Forum ini juga mempelajari lapisan abstraksi dalam sistem dan penerapan model OSI (Open Systems Interconnection) dalam menguraikan operasi jaringan."
    ],
    "points": 185,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1698766992
  },
  {
    "id": 38095699,
    "title": "Bagaimana Bear melakukan analisis dengan CSS",
    "originLink": "https://herman.bearblog.dev/how-bear-does-analytics-with-css/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38095699",
    "commentBody": "",
    "originSummary": [
      "Herman's Bear Blog telah menciptakan sistem analitik unik yang melacak keterlibatan pengguna dengan tetap mempertahankan standar privasi yang ketat dan tanpa menggunakan Javascript di sisi klien.",
      "Metode baru ini menggunakan CSS, bukan log server atau alat analisis konvensional, yang sering kali diblokir oleh pemblokir iklan. Metode ini melacak keterlibatan pengguna ketika kursor melayang di atas halaman, memicu URL untuk postingan yang dilihat.",
      "Sistem ini memastikan privasi pengguna dengan meng-hash alamat IP dengan tanggal untuk mendapatkan jumlah 'baca' yang unik dari sebuah halaman, tanpa menyimpan informasi identifikasi apa pun. Sistem ini hanya menyimpan alamat IP untuk sementara."
    ],
    "commentSummary": [
      "Alamat IP hash berada di bawah pengawasan dalam diskusi online karena sifatnya yang dapat dibalik, meskipun menggunakan algoritme yang aman, sehingga menarik perhatian badan perlindungan data Uni Eropa yang memandang bahwa hashing tidak benar-benar menganonimkan data.",
      "Praktik yang disarankan untuk meningkatkan keamanan termasuk mengasinkan hash, membuat pengenal unik universal secara independen, dan menggunakan garam sementara atau rahasia.",
      "Perdebatan tentang perlunya pengumpulan data untuk meningkatkan pendapatan dan pengalaman pengguna telah mendapatkan daya tarik, sementara kekhawatiran termasuk kepatuhan GDPR, privasi pengguna, penyempurnaan konten, dan penyimpanan dan partisi data."
    ],
    "points": 184,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1698826089
  },
  {
    "id": 38093353,
    "title": "Distil-Whisper: versi suling dari Whisper yang 6 kali lebih cepat, 49% lebih kecil",
    "originLink": "https://github.com/huggingface/distil-whisper",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38093353",
    "commentBody": "",
    "originSummary": [
      "Hugging Face telah memperkenalkan Distil-Whisper, sebuah versi yang dioptimalkan dari sistem pengenalan suara bahasa Inggris OpenAI yang disebut Whisper.",
      "Model yang telah ditingkatkan ini enam kali lebih cepat, 49% lebih kecil, tetapi bekerja dengan akurasi yang hampir sama dalam 1% WER (Word Error Rate) pada set data evaluasi yang tidak dikenal. Model ini juga meningkatkan toleransi terhadap kebisingan dan halusinasi, yang secara efektif mengurangi tingkat kesalahan.",
      "Distil-Whisper akan dirilis pada tanggal 2 November dan disertai dengan panduan untuk mengaktifkan fitur inferensi dan menggabungkannya dengan perpustakaan Transformers dari Hugging Face. Sistem ini disetel dengan baik menggunakan 22.000 jam data audio berlabel semu dari lebih dari 18.000 pembicara di 10 domain."
    ],
    "commentSummary": [
      "OpenAI telah merilis versi yang lebih efisien dari alat pengenalan suara AI mereka, Whisper, yang disebut Distil-Whisper. Alat ini enam kali lebih cepat dan 49% lebih kecil, sehingga cocok untuk perangkat dan peramban web dengan daya terbatas.",
      "Distil-Whisper memiliki tingkat kesalahan 1-2% untuk transkripsi bahasa Inggris, terutama karena masalah dengan tanda baca dan kata-kata pengisi.",
      "Beberapa pengguna berusaha menyempurnakan model ini dan berpotensi mengintegrasikannya dengan alat lain untuk membuat asisten suara pribadi."
    ],
    "points": 177,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1698800141
  },
  {
    "id": 38088856,
    "title": "Dukungan Linux hulu tersedia untuk Platform Seluler Qualcomm Snapdragon 8 Gen 3",
    "originLink": "https://www.linaro.org/blog/upstream-linux-support-now-available-for-the-the-qualcomm-snapdragon-8-gen-3-mobile-platform/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38088856",
    "commentBody": "",
    "originSummary": [
      "Insinyur Linaro, Neil Armstrong, telah mengaktifkan dukungan Linux hulu untuk Qualcomm Snapdragon 8 Gen 3 Mobile Platform, menggarisbawahi komitmen Linaro untuk menawarkan solusi yang inovatif.",
      "Diterbitkan pada 25 Oktober 2023, dukungan ini memungkinkan integrasi Linux, pengoptimalan kinerja, dan menjalankan AOSP (Android Open Source Project) dengan Mainline, dengan CPU Qualcomm® Kryo™, I/O Berkecepatan Rendah, Penyimpanan Kepadatan Tinggi, Periferal Berkecepatan Tinggi di antara fitur-fitur yang diaktifkan.",
      "Rencana masa depan termasuk berkolaborasi dengan komunitas kernel Linux untuk menggabungkan semua seri patch dengan cepat dan mengaktifkan lebih banyak fitur."
    ],
    "commentSummary": [
      "Linux sekarang menawarkan dukungan untuk Platform Mobile Snapdragon 8 Gen 3 dari Qualcomm dengan ketergantungan pada Qualcomm Hypervisor, sehingga menimbulkan kekhawatiran akan dampaknya pada operasi sistem.",
      "Para pengguna terlibat dalam perdebatan mengenai penggunaan firmware berpemilik, potensi risiko keamanan dari gumpalan biner dalam proyek sumber terbuka Android, dan kerentanan firmware sumber terbuka ketika digunakan dengan perangkat keras sumber tertutup.",
      "Diskusi di antara para pengguna juga mencerminkan pandangan yang kontras mengenai laptop yang tidak dapat di-upgrade dengan memori yang disolder, serta harga, kualitas, dan aspek etika dari produk System76 dan Purism."
    ],
    "points": 171,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1698775287
  },
  {
    "id": 38087448,
    "title": "Pengambilan gambar acara utama Apple pada iPhone dan diedit pada Mac",
    "originLink": "https://www.apple.com/newsroom/2023/10/behind-the-scenes-at-scary-fast-apples-keynote-event-shot-on-iphone/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38087448",
    "commentBody": "",
    "originSummary": [
      "Acara \"Scary Fast\" oleh Apple difilmkan dengan menggunakan iPhone 15 Pro Max dan diedit pada Mac untuk menampilkan kemampuan teknologi mereka. Acara ini memperkenalkan MacBook Pro dan iMac 24 inci yang baru, keduanya dilengkapi dengan keluarga chip M3.",
      "iPhone 15 Pro Max, untuk pertama kalinya dalam sebuah smartphone, mendukung Academy Color Encoding System (ACES), memungkinkan pengguna untuk merekam video ProRes hingga 4K60 dengan pengkodean Apple Log.",
      "Acara ini juga menekankan kemampuan konektor USB-C iPhone baru dalam transfer data yang cepat, perekaman langsung ke drive SSD eksternal, dan kemampuan kamera yang lebih baik untuk performa cahaya rendah dan fleksibilitas gradasi warna pada pascaproduksi."
    ],
    "commentSummary": [
      "Acara Apple baru-baru ini memicu perdebatan mengenai kemampuan iPhone sebagai kamera profesional, setelah mendemonstrasikan fungsi videonya.",
      "Para kritikus berpendapat bahwa videografi tingkat profesional memerlukan peralatan tambahan yang mahal dan pekerjaan pasca-produksi, sehingga potensi penghematan penggunaan iPhone menjadi minimal.",
      "Para pendukung menyoroti portabilitas dan kemudahan penggunaan perangkat ini, yang berpotensi menjadikannya pilihan yang layak untuk film beranggaran rendah atau proyek independen."
    ],
    "points": 171,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1698769957
  }
]
