[
  {
    "id": 37949656,
    "title": "Az ArXiv 10 millió dollárt kap a fejlesztésekre",
    "originLink": "https://news.cornell.edu/stories/2023/10/research-repository-arxiv-receives-10m-upgrades",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37949656",
    "commentBody": "",
    "originSummary": [
      "A Cornell Tech több mint 10 millió dollárt szerzett a Simons Alapítványtól és a Nemzeti Tudományos Alapítványtól az arXiv, a nyílt hozzáférésű tudományos cikkek adattárának támogatására.",
      "A finanszírozás megkönnyíti az arXiv felhőbe történő átállását és kódjának modernizálását, javítva ezzel a kutatók hozzáférhetőségét. Új keresési és ajánlási módszereket is integrálnak.",
      "Az 1991-ben alapított arXiv-ot ma a Cornell Tech működteti, és a különböző tudományterületek tudományos publikációinak megosztásának kiemelkedő platformja. A legújabb finanszírozási támogatás elősegíti a folyamatos innovációt."
    ],
    "commentSummary": [
      "Az ArXiv, a tudományos cikkek online adattára 10 millió dolláros támogatást kapott a fejlesztésekhez. A remények szerint a szolgáltatások javítása a funkcionalitás veszélyeztetése nélkül valósul meg, különös hangsúlyt fektetve a jobb hozzáférhetőségre és a web-natív papírok befogadására.",
      "A felhasználók aggodalmukat fejezték ki a nagy technológiai vállalatoktól való függőség miatt, ami vitát váltott ki a megfelelő finanszírozási forrásokról, beleértve az ipari óriásokat vagy a Nemzeti Tudományos Alapítványt.",
      "A beszélgetések az ArXiv működésének helyszínéül szolgáló Bay Area megélhetési költségeiről is folytak, kitérve a kiadásokra és a középosztálybeli jövedelemről alkotott elképzelésekre."
    ],
    "points": 471,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1697754499
  },
  {
    "id": 37941075,
    "title": "Saját BitTorrent építése",
    "originLink": "https://app.codecrafters.io/courses/bittorrent/overview",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37941075",
    "commentBody": "",
    "originSummary": [
      "A CodeCrafters egy olyan BitTorrent-kliens létrehozására irányuló kihívást mutat be, amely képes megfejteni egy .torrent-fájlt és letölteni egy társtulajdonostól a tartalmat, azzal a céllal, hogy a résztvevők megismerjék a torrent-fájlok szerkezetét és a kapcsolódó fogalmakat.",
      "A kihívás szakaszosan bontakozik ki, kezdve a kódolt karakterláncok, majd a kódolt egész számok dekódolásával.",
      "Azok a felhasználók, akik vállalták ezt a kihívást, elismerően nyilatkoznak a szisztematikus útmutatóról és az azonnali visszajelzésről, ami azt mutatja, hogy a CodeCrafters hatékonyan kínál programozási kihívásokat tapasztalt fejlesztőknek különböző területeken, például a Git, a Redis, a Docker, az SQLite és a Grep területén."
    ],
    "commentSummary": [
      "A szerző megosztja a Codecrafters \"Építsd meg a saját BitTorrented\" kihívásán való részvétel során szerzett tapasztalatait, és rávilágít a BitTorrent-kliensek szélesebb körű elterjedése során felmerülő kihívásokra.",
      "A különböző programozási nyelveken kódolási kihívásokat kínáló Codecrafters platform a felhasználók szavazatai alapján további kihívások bevezetését tervezi, többek között BitTorrent-alapú Linux csomagkezelőket és teljesítmény-összehasonlításokat.",
      "A tanfolyam platformján problémákat azonosítottak, például egy zárproblémát, és azt ígérték, hogy a weboldal tulajdonosa azonnal megoldja őket."
    ],
    "points": 431,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1697712836
  },
  {
    "id": 37943843,
    "title": "A korai európaiak évezredeken át ettek tengeri algát.",
    "originLink": "https://www.smithsonianmag.com/smart-news/early-europeans-ate-seaweed-and-aquatic-plants-180983102/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37943843",
    "commentBody": "",
    "originSummary": [
      "A régészek bizonyítékot találtak arra, hogy a korai európaiak tengeri moszatot és más vízi növényeket fogyasztottak a megkövesedett foglepedék elemzése szerint.",
      "A Nature Communications című folyóiratban közzétett tanulmány 28 európai lelőhelyről származó 74 korai ember mintáit elemezte, és 26 mintában tengeri moszatok és vízinövények nyomait találta.",
      "Ezek az eredmények megkérdőjelezik azt a feltételezést, hogy a mezőgazdaság megjelenése csökkentette e vízi élelmiszerek fogyasztását, és érveket sorakoztatnak fel táplálkozási előnyeik és környezeti fenntarthatóságuk mellett."
    ],
    "commentSummary": [
      "A szöveg kiemeli a tengeri moszat mint élelmiszerforrás történelmi és kulturális jelentőségét a különböző kultúrákban, valamint a konyhai felhasználását és egészségügyi előnyeit.",
      "A cikk tárgyalja a tengeri moszat fogyasztásának csökkenését Európában az iparosodás következtében, ami a haladással összefüggő kulturális változást tükrözi.",
      "A szöveg a tengeri moszatok fogyasztásának előnyeiről és kockázatairól, többek között a tápanyagtartalmáról és a szennyező anyagoknak való esetleges kitettségéről folyó vitát is vizsgálja."
    ],
    "points": 374,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1697727681
  },
  {
    "id": 37950952,
    "title": "A Nota egy olyan nyelv, amely dokumentumokat ír, például tudományos dolgozatokat és blogbejegyzéseket.",
    "originLink": "https://nota-lang.org/#def-nota",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37950952",
    "commentBody": "",
    "originSummary": [
      "A Nota egy olyan új nyelv, amelyet dokumentumok - például tudományos dolgozatok és blogbejegyzések - létrehozására terveztek, és amely JavaScript programokba fordítható, így a dokumentumok bármilyen webböngészővel rendelkező eszközön megtekinthetők.",
      "A Nota egyedülálló előnye abban rejlik, hogy képes a tartalom szerkezetét megjeleníteni, dinamikus és hozzáférhető dokumentumokat létrehozni anélkül, hogy széles körű webfejlesztői ismeretekre lenne szükség.",
      "A Nota jelenleg fejlődik, és nyitott a korai alkalmazók számára, akik döntő szerepet játszhatnak a dokumentumnyelvek jövőjének alakításában."
    ],
    "commentSummary": [
      "A cikk a Nota, egy dokumentumíró nyelv fejlesztésére összpontosít, amely a komplex jelölőnyelvek, például a TeX és a LaTeX lehetséges alternatívája.",
      "A jelentés felvázolja a meglévő eszközökben rejlő kihívásokat, és hangsúlyozza, hogy a dokumentumformátumok terén innovációra van szükség, beleértve az interaktív élményt biztosító dinamikus elemek beépítését.",
      "A cikk a PDF és az EPUB formátum előnyeit és hátrányait, a LaTeX kiszorításának akadályait, valamint a szélesebb közösségnek a Nota hasznosságáról alkotott eltérő nézeteit is elemzi."
    ],
    "points": 313,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1697763651
  },
  {
    "id": 37946017,
    "title": "A Convoy teherfuvarozási startup vevő nélkül zárja be működését",
    "originLink": "https://www.bloomberg.com/news/articles/2023-10-19/bezos-backed-startup-convoy-closes-operations-with-no-buyer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37946017",
    "commentBody": "",
    "originSummary": [
      "A Convoy, a Jeff Bezos és Bill Gates által támogatott kamionos startup megszünteti működését, mivel nem sikerült felvásárlót találnia.",
      "A vezérigazgató, Dan Lewis tájékoztatta a dolgozókat, hogy csütörtök lesz az utolsó munkanapjuk, és megemlítette, hogy stratégiai lehetőségeket vizsgálnak a jövőre nézve.",
      "Korábban a Convoy értékelése 3,8 milliárd dollár volt."
    ],
    "commentSummary": [
      "A Convoy, egy kamionos induló vállalkozás pénzügyi nehézségek miatt beszüntette működését, így alkalmazottai végkielégítés vagy egészségügyi juttatások nélkül maradtak, ami vitát váltott ki az induló vállalkozások alkalmazottainak jogszabályi védelméről.",
      "A Convoy bezárása közepette az Uber Freight jelentős változásokat mutatott be a Transplace felvásárlása után, bár a Convoy felvásárlása az ügyfélkör átfedésének hiánya miatt igen valószínűtlen.",
      "Az ezt követő beszélgetés olyan fontos kérdéseket érint, mint az egészségbiztosítás, a szakszervezetek szerepe a technológiai iparban és a pénzügyi felkészültség fontossága a startupok foglalkoztatásában."
    ],
    "points": 307,
    "commentCount": 516,
    "retryCount": 0,
    "time": 1697737426
  },
  {
    "id": 37943931,
    "title": "Autotab - Egy mesterséges intelligenciával működő Chrome-bővítmény Selenium szkriptek létrehozásához",
    "originLink": "https://www.autotab.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37943931",
    "commentBody": "",
    "originSummary": [
      "Az Autotab egy Chrome-bővítmény, amely a böngészési műveletek alapján Selenium kódot hoz létre, megkönnyítve ezzel a böngésző automatizálás egyszerű létrehozását.",
      "Kimeneti kódot biztosít a felhasználók számára, amelyet kézzel módosíthatnak és beépíthetnek más projektekbe.",
      "A gyors automatizáláshoz egy induló GitHub-tárat is biztosít, és a fejlesztők nyitottak a felhasználói visszajelzésekre."
    ],
    "commentSummary": [
      "Az Autotab egy mesterséges intelligenciával működő Chrome-bővítmény, amely Selenium kódot készít a webböngésző műveleteinek automatizálásához, és célja, hogy a mesterséges intelligencia által generált szoftvereket a nem technikai felhasználók számára is elérhetővé tegye.",
      "Az eszköz tervezi az öngyógyító automatizációkat, és összehasonlítást tartalmaz más eszközökkel, például a UI.Vision és a Playwright; a rendszer a demókat képernyőfelvevő szoftverrel rögzíti.",
      "A megbeszélésen szó esik a lehetséges fejlesztésekről is, például a hitelesítési bővítmények támogatásáról, több nyelv, például az R támogatásáról, valamint a más böngészőkkel, például a Firefoxszal való kompatibilitásról."
    ],
    "points": 292,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1697728120
  },
  {
    "id": 37947772,
    "title": "Az Apple Swift és SwiftUI használata az iOS 17-ben",
    "originLink": "https://blog.timac.org/2023/1019-state-of-swift-and-swiftui-ios17/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37947772",
    "commentBody": "",
    "originSummary": [
      "A jelentés az iOS 17 elemzését vizsgálja, a beépített alkalmazásokra, a bináris programok számára és a fejlesztésükhöz használt programozási nyelvekre összpontosítva.",
      "Megfigyelhető a SwiftUI és a Swift használatának növekedése az iOS 17-ben, amelyet az UIKit és a SwiftUI használatának összehasonlításával együtt emeltünk ki.",
      "A jelentés megjegyzi, hogy míg a Swift jelen van a macOS-ben, addig az iOS biztonságos enklávéjából hiányzik, ami jól mutatja a programozási nyelvek elterjedésének trendjeit az Apple platformjain."
    ],
    "commentSummary": [
      "A cikk a Swift és a SwiftUI növekvő használatát tárgyalja az iOS 17-ben, a C programozási nyelv hanyatlására és a Swift egyre nagyobb arányú alkalmazására összpontosítva az iOS bináris programokban.",
      "A cikk a Swift kód újraírásának előnyeit és hátrányait egyaránt feltárja, kiemelve a befektetés megtérülésének értékelésének fontosságát az új nyelvre való áttérés során.",
      "Felhívja a figyelmet a SwiftUI teljesítményével kapcsolatos problémákra a régebbi eszközökön, és felhasználói tapasztalatokat tartalmaz a widgetekkel kapcsolatos nehézségekről és a pontatlan adatmegjelenítésekről az Apple iOS platformon."
    ],
    "points": 288,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1697744929
  },
  {
    "id": 37949899,
    "title": "Kérjük, fizessen egy év semmiért",
    "originLink": "https://joe-steel.com/2023-10-19-Please-Pay-For-a-Year-of-Nothing.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37949899",
    "commentBody": "",
    "originSummary": [
      "A szerző úgy döntött, hogy lemondja Disney+ előfizetését a platform áremelkedése és a szórakoztatóipar termelési leállása miatt, ami korlátozott új tartalmakhoz vezet.",
      "A szerző elégedetlenségét fejezi ki mind a Disney+ jelenlegi kínálatával, mind pedig azzal, hogy az olyan streaming-óriások, mint a Prime Video és a Netflix a mennyiséget helyezik előtérbe a minőséggel szemben.",
      "A szerző úgy véli, hogy a gyártási késésekből adódó új tartalmak hiánya kihívást jelenthet a streamingszolgáltatások előfizetőinek megtartására, és nem látja előre a Disney+ előfizetésük közeljövőbeni újraaktiválását."
    ],
    "commentSummary": [
      "A fő vita a felhasználói élményről, a technikai minőségről és a streamingszolgáltatások tartalmáról szól, különös tekintettel a Netflixre és a Disney+-ra.",
      "Számos kérdés merült fel, mint például a felhasználói felület, a tartalom elérhetősége és a technikai problémák, ami általános elégedetlenséghez vezetett az árképzéssel, a tartalomkereséssel és az ilyen szolgáltatások értékteremtésével kapcsolatban.",
      "A további témák között szerepelnek a tartalomhoz való hozzáférés alternatív módszerei, például a kalózkodás, a művészek pénzügyi támogatása, a streaming szolgáltatások etikai vonatkozásai, valamint az újszerű és vonzó tartalmak iránti igény. Mindezekből következik az a javaslat, hogy az embereknek aktívabban kellene részt venniük a média egyszerű fogyasztása helyett."
    ],
    "points": 259,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1697755938
  },
  {
    "id": 37946203,
    "title": "Csak fizetni Figma, mert semmi más nem működik",
    "originLink": "https://fasterthanli.me/articles/just-paying-figma-15-dollars",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37946203",
    "commentBody": "",
    "originSummary": [
      "A szerző megosztja két ingyenes és nyílt forráskódú tervezőeszközzel kapcsolatos tapasztalatait: Figma és Penpot.",
      "A Figma a megbízhatósága, a fejlett funkciói és a jobb funkcionalitása miatt nyeri el a szerző tetszését.",
      "Annak ellenére, hogy a szerző mindkét eszközt nagyra értékeli, a Figmát részesíti előnyben, és azt tervezi, hogy a jövőben is azt fogja használni."
    ],
    "commentSummary": [
      "Ez a témakör a nyílt forráskódú szoftverprojektek során felmerülő akadályokat és korlátozásokat tárgyalja, beleértve a finomítással és a felhasználóbarátsággal kapcsolatos problémákat számos szabad és nyílt forráskódú szoftver (FOSS) kezdeményezésben.",
      "Hangsúlyozza a személyes értékek és a projekt szükségleteinek összeegyeztetésének összetettségét, a hatékony kommunikáció, a kiterjedt dokumentáció és a szigorú tesztelés alapvető szerepét, valamint a megfelelő finanszírozás és erőforrások szükségességét.",
      "Elismeri a védett szoftverekkel való versengés nehézségeit, és példákat említ sikeres FOSS-projektekre és lehetséges szoftveralternatívákra."
    ],
    "points": 258,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1697738281
  },
  {
    "id": 37941881,
    "title": "Peter Thiel FBI informátor volt",
    "originLink": "https://www.businessinsider.com/peter-thiel-fbi-informant-charles-johnson-johnathan-buma-chs-genius-2023-10",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37941881",
    "commentBody": "",
    "originSummary": [
      "Peter Thiel technológiai milliárdosról kiderült, hogy az FBI informátora, aki \"bizalmas emberi forrásként\" dolgozik, különös tekintettel a Szilícium-völgybe való beszivárgásra irányuló külföldi kísérletekre.",
      "Thiel cselekedete, hogy FBI-informátor lett, a Trump és a MAGA mozgalomtól való eltávolodásának részeként értékelhető.",
      "Szerepe kiemeli befolyásos státuszát az irodával együttműködő jobboldali személyiségek körében, és azt is hangsúlyozza, hogy a Palantir adatszolgáltató céghez hasonló üzleti érdekeltségei révén érdekelt a kormányzati ügynökségekben."
    ],
    "commentSummary": [
      "A beszélgetések elsősorban Peter Thiel vállalkozóra és FBI-informátorra összpontosítanak, különböző ellentmondásos cselekedeteit és meggyőződéseit vizsgálva.",
      "A témák között szerepelnek Thiel kritikái a Google-lal szemben, állítólagos kapcsolatai a kínai kormánnyal, a bűnüldöző szervekkel való kapcsolata, valamint a Gawker bukásában játszott szerepe.",
      "Ez a gazdag magánszemélyek, a hírszerző ügynökségek és a technológiai ipar közötti hatalmi dinamikára helyezi a hangsúlyt, és kérdéseket vet fel Thiel libertariánus elveihez való ragaszkodásával, valamint kapcsolatainak és kapcsolatainak lehetséges hatásaival kapcsolatban."
    ],
    "points": 241,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1697718257
  },
  {
    "id": 37950014,
    "title": "A Toyota átveszi az észak-amerikai töltési szabványt",
    "originLink": "https://pressroom.toyota.com/toyota-adopts-the-north-american-charging-standard-to-expand-customer-charging-options/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37950014",
    "commentBody": "",
    "originSummary": [
      "A Toyota Motor North America a Teslával kötött megállapodás alapján 2025-től átveszi az észak-amerikai töltési szabványt (NACS) akkumulátoros elektromos járművei (BEV) számára.",
      "Ez a döntés lehetővé teszi a Toyota és Lexus ügyfelek számára, hogy hozzáférjenek a több mint 12 000 Tesla Superchargerhez Észak-Amerikában, és célja, hogy az ügyfelek számára kényelmesebb töltési lehetőségeket és nagyobb utazási hatótávolságot biztosítson.",
      "Egyes Toyota és Lexus BEV járművek NACS-csatlakozókkal lesznek felszerelve, és a kombinált töltőrendszerrel (CCS) felszerelt járművekkel rendelkező ügyfelek számára NACS-töltéshez szükséges adaptereket biztosítanak."
    ],
    "commentSummary": [
      "A Toyota által elfogadott észak-amerikai EV-töltési szabvány segíti a Teslát azáltal, hogy növeli a Supercharger-hálózat elterjedtségét és ismertségét, ezáltal erősítve a Tesla befolyását az EV-piacon.",
      "A diskurzus arra utal, hogy a Tesla töltési monopóliummá válhat, miközben a Tesla Supercharger-hálózatának más töltőállomásokkal való kompatibilitásától eltekintve a töltés benzinkutakkal szembeni relatív egyszerűségét is megvitatja.",
      "Olyan témák kerülnek terítékre, mint a Tesla akkumulátorok költsége és tartóssága, az akkumulátorok újrafelhasználása és újrafeldolgozása, a kormányzati támogatások és az elektromos járművek töltési struktúráinak technikai aspektusai. Az európai és az amerikai töltési szabványok közötti különbségek és a regionális töltőhálózatok hatékonysága is kiemelt figyelmet kap."
    ],
    "points": 223,
    "commentCount": 278,
    "retryCount": 0,
    "time": 1697756732
  },
  {
    "id": 37944269,
    "title": "A kutatók 14 ezer éves fák évgyűrűiben azonosították a valaha volt legnagyobb napvihart",
    "originLink": "https://phys.org/news/2023-10-largest-solar-storm-ancient-year-old.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37944269",
    "commentBody": "",
    "originSummary": [
      "A kutatók a legnagyobb ismert napvihart mutatták ki az ősi fák évgyűrűiben, amelyet 14 300 évvel ezelőttre datáltak.",
      "A tanulmány szerint hasonló események napjainkban is szörnyű következményekkel járhatnak, például áramkimaradásokkal, valamint a távközlési és műholdas rendszerek károsodásával.",
      "A csapat hangsúlyt fektet az ilyen napviharok megértésére és az azokra való felkészülésre a globális kommunikációs és energetikai infrastruktúránk védelme érdekében, és rámutat, hogy még sok mindent meg kell még tudnunk a Nap viselkedéséről és a kapcsolódó kockázatokról."
    ],
    "commentSummary": [
      "A fák évgyűrűi a legnagyobb feljegyzett napviharról árulkodtak, hangsúlyozva a jövőbeli napviharokra való felkészülés és az elektromos hálózat árnyékolásának szükségességét. Egy napvihar pusztító hatása a jelenlegi technológiára pusztító lehet.",
      "Viták folynak a napkitörések Földre gyakorolt hatásairól, és a csere-transzformátorok hiánya miatti hosszú távú áramkimaradásoktól tartanak. A védelmi intézkedéseket nem a finanszírozás vagy a politikai akarat akadályozza, hanem az atomerőművekre, a vízszivattyúkra és az áruelosztásra gyakorolt hatásokra összpontosítanak.",
      "A lehetséges megközelítések közé tartozik a napviharok idején a megszakítók földelése, egy stratégiai transzformátor-tartalék létrehozása és a transzformátorok robotnak való álcázása. A transzformátor-tartalék fenntartásának logisztikai és pénzügyi költségeit mérlegelik a lehetséges eredményekkel szemben."
    ],
    "points": 194,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1697729418
  },
  {
    "id": 37946080,
    "title": "Az Instagram bocsánatot kér a \"terrorista\" szó beillesztéséért a palesztin biofordításokba",
    "originLink": "https://www.404media.co/instagram-palestinian-arabic-bio-translation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37946080",
    "commentBody": "",
    "originSummary": [
      "Az Instagram bocsánatot kért egy automatikus fordítási hiba miatt, amely helytelenül fordította le a \"palesztin\" szót és egy arab kifejezést tartalmazó életrajzokat, ami sértő tartalmakat generált.",
      "A problémát a TikTok-on fedezték fel és osztották meg, ami után az Instagram elkezdte beilleszteni a \"terrorista\" kifejezést az érintett fordításokba.",
      "Ez az eset rávilágít az automatizált fordítórendszerekkel kapcsolatos lehetséges problémákra, beleértve az elfogult vagy hibás fordítások valószínűségét."
    ],
    "commentSummary": [
      "Az Instagram elismerte és bocsánatot kért, hogy fordítóeszköze tévesen beépítette a \"terrorista\" kifejezést a palesztin életrajzok fordításába, ami aggodalmat keltett a felhasználókban a megélhetésükre és hírnevükre gyakorolt lehetséges káros hatások miatt.",
      "Az eset kiemeli, hogy sürgősen szükség van fokozott biztosítékokra és egyértelműségre a gépi fordítások használata során, és vitákat vált ki a nyelvi pontosságról, az AI nyelvi modellek elfogultságáról és az ilyen fordítások megbízhatóságáról.",
      "A tágabb értelemben vett diskurzusban aggodalmak merültek fel a technológiai szervezetek kormányzati befolyásolásával, az adatvédelmi kérdésekkel és a vitatott izraeli-palesztin konfliktussal kapcsolatban, többek között Abby Martin újságíró is említést tett erről."
    ],
    "points": 186,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1697737691
  },
  {
    "id": 37944680,
    "title": "Az FCC a II. cím szerinti hálózatsemlegességi szabályokkal halad előre a 3-2 pártvonalas szavazáson",
    "originLink": "https://arstechnica.com/tech-policy/2023/10/fcc-moves-ahead-with-title-ii-net-neutrality-rules-in-3-2-party-line-vote/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37944680",
    "commentBody": "",
    "originSummary": [
      "Az FCC 3-2 arányban megszavazta a hálózatsemlegességi szabályok újjáélesztésére irányuló javaslatot, amely az internetszolgáltatókat (ISP-ket) közös fuvarozóként szabályozza.",
      "Ez a terv a szélessávú szolgáltatás távközlési szolgáltatássá történő átminősítését foglalja magában, ami lehetővé teszi az FCC számára, hogy a hírközlési törvény II. címe alapján ellenőrizze az internetszolgáltatókat, hasonlóan a 2015-ben hozott, de később hatályon kívül helyezett intézkedésekhez.",
      "A javaslat véglegesítése előtt nyilvános véleményezési időszak áll rendelkezésre, bár a szélessávú iparág várhatóan bírósági úton támadja meg a javaslatot."
    ],
    "commentSummary": [
      "A vita elsősorban a különböző hálózatsemlegességi törvények hatásairól szól, a középpontban a kaliforniai törvénnyel és annak következményeivel.",
      "A résztvevők megvitatják az internetszolgáltatók (ISP-k) azon képességét, hogy prioritást adjanak az internetforgalomnak, a hálózatsemlegességről szóló törvényekkel kapcsolatos folyamatban lévő jogi küzdelmeket, valamint a joghatóság és a szabályozás bonyolult kérdéseit.",
      "A beszélgetés a szolgáltatási tervekre és az internetszolgáltatói monopóliumokra gyakorolt lehetséges hatásokat is vizsgálja, kiemelve a fogyasztók védelmét szolgáló szabályozás szükségességét, valamint a hálózatsemlegességgel, a kormányzati beavatkozással és a szabad piaccal kapcsolatos ellentétes álláspontokat."
    ],
    "points": 179,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1697731319
  },
  {
    "id": 37942574,
    "title": "A Mojo már elérhető Macen is",
    "originLink": "https://www.modular.com/blog/mojo-is-now-available-on-mac",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37942574",
    "commentBody": "",
    "originSummary": [
      "Az eredetileg Linuxra kiadott Mojo mostantól a Mac felhasználók számára is elérhető, így ők is letölthetik, telepíthetik a Mojo SDK-t, és elkezdhetik a programfejlesztést.",
      "A közlemény lépésről lépésre telepítési utasításokat tartalmaz, és kiemeli a Mojo hivatalos Visual Studio Code bővítményét, megkönnyítve annak használatát.",
      "A cikk kiemeli a Mojo sebességét és teljesítményét Macen, és különböző forrásokat ajánl, beleértve a dokumentációt és a példákat, valamint bemutatja a Mojo Discord közösséget a további felfedezéshez."
    ],
    "commentSummary": [
      "A beszélgetések elsősorban a Mojo programozási nyelvre, annak fejlesztésére és más nyelvekhez való viszonyára összpontosítanak.",
      "Folyamatos viták folynak a Mojo általános teljesítményéről, a Python ökoszisztémába való integrációjáról, marketingstratégiáiról és bizonyos funkciók követelményeiről.",
      "A vélemények eltérőek, egyesek érdeklődést mutatnak a Mojo kipróbálása iránt, mások pedig szkeptikusak az állításokkal és a kompatibilitással kapcsolatban."
    ],
    "points": 173,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1697721978
  }
]
