[
  {
    "id": 38733968,
    "title": "ஹெய்னோட் அறிமுகம்: டெவலப்பர்களுக்கான சரியான ஸ்க்ராச்பேட்",
    "originLink": "https://heynote.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38733968",
    "commentBody": "",
    "originSummary": [
      "ஹெய்னோட் என்பது அதன் டெவலப்பரால் அவர்களின் சொந்த தேவைகள் மற்றும் விருப்பங்களைப் பூர்த்தி செய்ய உருவாக்கப்பட்ட குறிப்பு எடுக்கும் பயன்பாடாகும்.",
      "பயன்பாடு ஒரு முக்கிய எழுத்து இடத்துடன் ஒரு எளிய இடைமுகத்தைக் கொண்டுள்ளது மற்றும் தாவல்கள் இல்லாமல் வெவ்வேறு யோசனைகளை வேறுபடுத்தவும் ஒழுங்கமைக்கவும் \"தொகுதிகள்\" என்ற கருத்தைப் பயன்படுத்துகிறது.",
      "இதேபோன்ற குறிப்பு எடுக்கும் தீர்வைத் தேடும் மற்றவர்களுக்கும் இது பயனளிக்கும் என்ற எதிர்பார்ப்புடன் ஹெய்னோட் வெளியிடப்பட்டது."
    ],
    "commentSummary": [
      "ஹெய்னோட் என்பது டெவலப்பர்களுக்காக குறிப்பாக உருவாக்கப்பட்ட ஒரு குறிப்பு எடுக்கும் பயன்பாடாகும், அவர்கள் கருத்துக்களை வழங்குகிறார்கள் மற்றும் கூடுதல் தொகுதிகள் மற்றும் யுஐ மேம்பாடுகள் உள்ளிட்ட புதிய அம்சங்களை முன்மொழிகிறார்கள்.",
      "ஹெய்னோட் ஒரு திறந்த மூல பயன்பாட்டா இல்லையா என்பது குறித்து தொடர்ந்து விவாதம் நடந்து வருகிறது.",
      "பயனர்கள் பயன்பாட்டின் வரம்புகள், செயல்திறன் பற்றி விவாதிக்கிறார்கள் மற்றும் அவர்களின் வளர்ச்சித் தேவைகளுக்கான மாற்று தளங்களை ஆராய்கிறார்கள். இருப்பினும், ஹெய்னோட் பொதுவாக அதன் எளிமை மற்றும் பயனுக்காக பாராட்டைப் பெறுகிறது, குறிப்பாக அதன் தனி தொகுதிகள் அம்சம்."
    ],
    "points": 851,
    "commentCount": 262,
    "retryCount": 0,
    "time": 1703252031
  },
  {
    "id": 38735066,
    "title": "Nand to Tetris: இலவச திறந்த மூல பொருட்களுடன் புதிதாக ஒரு கணினி அமைப்பை உருவாக்கவும்",
    "originLink": "https://www.nand2tetris.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38735066",
    "commentBody": "",
    "originSummary": [
      "நந்தின் அதிகாரப்பூர்வ வலைத்தளம் முதல் டெட்ரிஸ் படிப்புகள் மற்றும் அதனுடன் தொடர்புடைய புத்தகம் ஒரு கணினி அமைப்பு மற்றும் மென்பொருள் படிநிலையை கட்டமைப்பதற்கான விரிவுரைகள், திட்ட பொருட்கள் மற்றும் கருவிகளை அடிமட்டத்திலிருந்து வழங்குகிறது.",
      "பொருட்கள் இலவசமாகக் கிடைக்கின்றன மற்றும் இலாப நோக்கற்ற கல்வி பயன்பாட்டிற்கான திறந்த மூலமாகும்.",
      "பாடநெறிகள் ஆன்லைனில் வழங்கப்படுகின்றன மற்றும் பல்வேறு நிலைகளில் உள்ள மாணவர்களுக்கு ஏற்ப வடிவமைக்கப்பட்டுள்ளன, பயிற்றுவிப்பாளர்களைத் தொடர்புகொள்வதன் மூலம் கூடுதல் பாடப்பொருட்கள் கிடைக்கின்றன."
    ],
    "commentSummary": [
      "இந்த பத்தி கணினி வன்பொருள், நிரலாக்கம் மற்றும் கல்வியில் பல தலைப்புகளை உள்ளடக்கியது.",
      "\"நந்த் முதல் டெட்ரிஸ் வரை\" திட்டத்தின் அனுபவங்கள் மற்றும் டிரான்சிஸ்டர்கள் மற்றும் ஒருங்கிணைந்த சுற்றுகளில் வளங்களைக் கற்றுக்கொள்வதற்கான பரிந்துரைகள் இதில் அடங்கும்.",
      "இந்த பத்தி கணினி அறிவியல் படிப்புகள், திட்டங்கள் மற்றும் கோட்பாட்டு கணினி அறிவியல் குறித்த விவாதங்களையும் விவாதிக்கிறது."
    ],
    "points": 578,
    "commentCount": 161,
    "retryCount": 0,
    "time": 1703259119
  },
  {
    "id": 38739563,
    "title": "யூடியூப் எவ்வளவு பெரியது? புதுமையான ஆராய்ச்சி முறைகள் மூலம் வரம்புகளை சவால் செய்தல்",
    "originLink": "https://ethanzuckerman.com/2023/12/22/how-big-is-youtube/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38739563",
    "commentBody": "",
    "originSummary": [
      "யூடியூப்பின் அளவைத் தீர்மானிப்பதில் உள்ள சிரமத்தையும் தற்போதைய ஆராய்ச்சி முறைகளின் வரம்புகளையும் ஆசிரியர் ஆராய்கிறார்.",
      "யூடியூப் வீடியோக்களின் எண்ணிக்கையை மதிப்பிடுவதற்கு அவர்கள் \"குடிபோதை டயலிங்\" எனப்படும் தனித்துவமான அணுகுமுறையை அறிமுகப்படுத்துகிறார்கள்.",
      "சீரற்ற வீடியோக்களைப் பயன்படுத்தி நடந்து வரும் ஆராய்ச்சி மற்றும் பயனர் உருவாக்கிய ஊடக தளங்களில் தரவை வெளியிட வேண்டியதன் அவசியம் ஆகியவை முன்னிலைப்படுத்தப்படுகின்றன.",
      "ஆசிரியர் நிதி ஆதாரங்களை ஒப்புக்கொள்கிறார் மற்றும் கோவிட் உடனான அவர்களின் அனுபவத்தைக் குறிப்பிடுகிறார்."
    ],
    "commentSummary": [
      "சுருக்கம் யூடியூப் தொடர்பான விவாதங்கள் மற்றும் தலைப்புகளை உள்ளடக்கியது, இதில் அதன் அளவு, வீடியோக்களின் எண்ணிக்கையை மதிப்பிடுதல், ஆய்வுகளின் வரம்புகள் மற்றும் தவறான தகவல்கள் மற்றும் போலி வீடியோ ஐடிகள் பற்றிய கவலைகள் ஆகியவை அடங்கும்.",
      "கூகிள் யூடியூப் ஏபிஐயை பூட்டியுள்ளது, இது தரவு அணுகல் மற்றும் தள மாற்றங்கள் குறித்த கவலைகளை எழுப்பியுள்ளது.",
      "யூடியூப் வீடியோக்களின் மதிப்பு குறித்த விவாதங்கள் மற்றும் சதி கோட்பாடுகள் மற்றும் நம்பிக்கைகள் பற்றிய உரையாடல்களும் விவாதங்களின் ஒரு பகுதியாகும்."
    ],
    "points": 496,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1703285719
  },
  {
    "id": 38732770,
    "title": "கிளிக்ஜாக்கிங் மூலம் ஃபிஷிங் தாக்குதல்களை அனுமதிக்கும் வாட்ஸ்அப் பாதிப்பு",
    "originLink": "https://00xbyte.github.io/posts/Don%27t-Believe-Your-Eyes-A-WhatsApp-Clickjacking-Vulnerability/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38732770",
    "commentBody": "",
    "originSummary": [
      "ஃபிஷிங் தாக்குதல்களுக்கு பயன்படுத்தக்கூடிய வாட்ஸ்அப்பில் கிளிக்ஜாக்கிங் பாதிப்பை கட்டுரையின் ஆசிரியர் வெளிப்படுத்துகிறார்.",
      "பாதிப்பைக் கண்டறியும் செயல்முறையை அவர்கள் விளக்குகிறார்கள் மற்றும் ஒரு செய்தி முன்னோட்டம் எதிர்பார்த்ததை விட வேறு தளத்தில் கிளிக் செய்வதன் மூலம் பயனர்களை எவ்வாறு ஏமாற்ற முடியும் என்பதை நிரூபிக்கின்றன.",
      "யூனிகோட் எழுத்துக்களைப் பயன்படுத்தி இணைப்புகளை மறைப்பதற்கான ஒரு நுட்பத்தையும் ஆசிரியர் விவாதிக்கிறார், மேலும் இந்த பிரச்சினைக்கு மெட்டாவின் பதிலில் தங்கள் ஏமாற்றத்தை வெளிப்படுத்துகிறார். அவை வாட்ஸ்அப்பில் 2 கே 2 இ ஃபிஷிங் தாக்குதல்களிலிருந்து பாதுகாக்க ஒரு தணிப்பு மூலோபாயத்தை வழங்குகின்றன."
    ],
    "commentSummary": [
      "வாட்ஸ்அப்பில் ஒரு கிளிக்ஜாக்கிங் பாதிப்பு கண்டுபிடிக்கப்பட்டுள்ளது, இது ஃபிஷிங் தாக்குதல்கள் குறித்த கவலைகளை எழுப்பியுள்ளது.",
      "விவாதம் வாட்ஸ்அப்பில் முன்னோட்ட URLகளுடன் தொடர்புடைய பாதுகாப்பு அபாயங்களை மையமாகக் கொண்டுள்ளது மற்றும் பொருத்தமான URLகளை அமல்படுத்துவது அல்லது முன்னோட்ட அம்சத்தை அகற்றுவது போன்ற பல்வேறு தீர்வுகளை முன்மொழிகிறது.",
      "ஃபிஷிங் தாக்குதல்களைத் தடுப்பதற்கான சாத்தியமான தீர்வாக பாஸ்கிகள் பரிந்துரைக்கப்படுகின்றன, ஆனால் பயன்பாடு மற்றும் செயல்படுத்தும் சவால்கள் விவாதிக்கப்படுகின்றன. மெட்டா மற்றும் கூகிள் தேடலில் வலது-இடது உரை பதிப்பு மற்றும் தவறாக வழிநடத்தும் URL களில் பாதுகாப்பு பாதிப்புகள் குறித்தும் குறிப்பிடப்பட்டுள்ளது."
    ],
    "points": 332,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1703239928
  },
  {
    "id": 38736919,
    "title": "தடைகளை அகற்ற மரிஜுவானா குற்றங்களுக்காக தனிநபர்களுக்கு பைடன் மன்னிப்பு",
    "originLink": "https://www.whitehouse.gov/briefing-room/presidential-actions/2023/12/22/a-proclamation-on-granting-pardon-for-the-offense-of-simple-possession-of-marijuana-attempted-simple-possession-of-marijuana-or-use-of-marijuana/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38736919",
    "commentBody": "",
    "originSummary": [
      "அதிபர் ஜோ பைடன், கஞ்சா வைத்திருந்தல், வைத்திருக்க முயற்சித்தல் அல்லது மரிஜுவானாவைப் பயன்படுத்துதல் ஆகியவற்றில் ஈடுபட்ட அல்லது தண்டிக்கப்பட்ட நபர்களுக்கு பொதுமன்னிப்பு வழங்கியுள்ளார்.",
      "இந்த தண்டனைகளால் விதிக்கப்பட்ட வேலைவாய்ப்பு, வீட்டுவசதி மற்றும் கல்வி ஆகியவற்றில் உள்ள தடைகளை அகற்றுவதை இந்த மன்னிப்புகள் நோக்கமாகக் கொண்டுள்ளன.",
      "இந்த மன்னிப்பு கூட்டாட்சி மற்றும் கொலம்பியா மாவட்ட சட்டங்களுக்கும், கூட்டாட்சி ஒழுங்குமுறைகளின் குறியீட்டில் உள்ள குறிப்பிட்ட விதிகளுக்கும் பொருந்தும். சட்டமா அதிபர் விண்ணப்பங்களை பரிசீலனை செய்து தகுதியான நபர்களுக்கு மன்னிப்பு சான்றிதழ்களை வழங்குவார். எவ்வாறாயினும், குற்றம் நடந்தபோது அமெரிக்காவில் சட்டப்பூர்வமாக இல்லாத குடிமக்கள் அல்லாதவர்கள் இந்த மன்னிப்பிற்கு தகுதியற்றவர்கள்."
    ],
    "commentSummary": [
      "மரிஜுவானா குற்றங்களுக்கான மன்னிப்பு, சட்டப்பூர்வத்தன்மை, அரசாங்க ஒழுங்குமுறை, இன ஏற்றத்தாழ்வுகள் மற்றும் மதுவிலக்கின் செயல்திறன் உள்ளிட்ட மரிஜுவானாவின் பல்வேறு அம்சங்களை இந்த விவாதம் உள்ளடக்கியது.",
      "விவாதங்கள் ஜனாதிபதியின் மன்னிப்புகள், அவசரகால அதிகாரங்கள், சட்டமன்ற நடவடிக்கை, சமூக-பொருளாதார தாக்கம், தீங்கு குறைப்பு மற்றும் மரிஜுவானா பற்றிய பொது புரிதலைச் சுற்றி வருகின்றன.",
      "போதைப்பொருள் சட்டங்களின் சமமற்ற அமலாக்கம், இராணுவ-தொழில்துறை வளாகத்தின் பங்கு மற்றும் ஓபியாய்டு நெருக்கடி ஆகியவற்றையும் இந்த உரையாடல் கையாளுகிறது, ஒழுங்குமுறை மற்றும் சட்டப்பூர்வமாக்கலுக்கு ஆதரவாகவும் எதிராகவும் வாதங்களை வழங்குகிறது. ஒட்டுமொத்தமாக, இது மருந்துக் கொள்கையின் சிக்கலான தன்மையையும் அதன் பரந்த அளவிலான தாக்கங்களையும் வலியுறுத்துகிறது."
    ],
    "points": 302,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1703269364
  },
  {
    "id": 38738619,
    "title": "தொடரும் ஸ்பேம் தாக்குதலைக் கட்டுப்படுத்த கூகிள் போராடுகிறது",
    "originLink": "https://www.searchenginejournal.com/google-search-overwhelmed-by-massive-spam-attack/504527/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38738619",
    "commentBody": "",
    "originSummary": [
      "கூகிள் தற்போது ஒரு பெரிய ஸ்பேம் தாக்குதலின் கீழ் உள்ளது, இது பல நாட்களாக நடந்து வருகிறது.",
      "ஸ்பேமர்கள் கூகிளின் வழிமுறைகளில் உள்ள பலவீனங்களைப் பயன்படுத்திக்கொள்கிறார்கள், குறிப்பாக உள்ளூர் தேடல் மற்றும் லாங்டெயில் முக்கிய வார்த்தைகளில்.",
      "ஸ்பேமர்கள் தங்கள் பக்கங்களைக் கண்டுபிடித்து அட்டவணைப்படுத்த Google-க்கு உதவ இணைப்பு நெட்வொர்க்குகளைப் பயன்படுத்துகின்றனர், மேலும் பல டொமைன்கள் நூறாயிரக்கணக்கான முக்கிய வார்த்தைகளுக்கு தரவரிசைப்படுத்தப்படுகின்றன.",
      "Google IP முகவரியுடன் பார்வையிடப்படாவிட்டால் ஸ்பேம் பக்கங்கள் தானாகவே பிற டொமைன்களுக்குத் திருப்பிவிடப்படும்.",
      "கூகிள் இந்த சிக்கலை ஏற்றுக்கொண்டு, அதை தீர்க்க தீவிரமாக செயல்பட்டு வருகிறது."
    ],
    "commentSummary": [
      "கூகிள்போட்டை இலக்காகக் கொண்ட ஸ்பேம் தாக்குதலை எதிர்த்துப் போராடுவதற்கான கூகிளின் முயற்சிகள், இலக்கு விளம்பரங்களைச் சுற்றியுள்ள விவாதங்கள், கூகிளில் தேடல் முடிவுகளின் தரம் குறித்த கவலைகள் மற்றும் மாற்று தேடுபொறிகளைப் பற்றிய விவாதங்கள் உள்ளிட்ட பல தலைப்புகளைச் சுற்றி விவாதம் சுழல்கிறது.",
      "பங்கேற்பாளர்கள் விளம்பரங்களால் நிரப்பப்பட்ட வலைத்தளங்களில் விரக்தியை வெளிப்படுத்துகிறார்கள் மற்றும் கூகிளின் விளம்பர தேர்வு வழிமுறையில் ஊகிக்கின்றனர்.",
      "இந்த உரையாடல் ஸ்பேம், தேடுபொறி வழிமுறைகள், தேடல் முடிவு தரம் மற்றும் ஆன்லைன் விளம்பரம் தொடர்பான சிக்கல்களை வெளிச்சம் போட்டுக் காட்டுகிறது."
    ],
    "points": 273,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1703278821
  },
  {
    "id": 38739130,
    "title": "ப்ளூஸ்கி பயன்பாட்டு புதுப்பிப்பு: உள்நுழையாமல் இடுகைகள், சுயவிவரங்கள் மற்றும் பயனர் தேடலை அணுகவும்",
    "originLink": "https://bsky.app/profile/bsky.app/post/3kh5rbndrjd2x",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38739130",
    "commentBody": "",
    "originSummary": [
      "எச்.டி.எம்.எல், பாடி மற்றும் #root போன்ற கூறுகளுக்கான சி.எஸ்.எஸ் பாணிகளுடன் எதிர்வினை-நேட்டிவ்-வலை மீட்டமைப்பில் செய்யப்பட்ட மாற்றங்களை இந்த இடுகை விளக்குகிறது.",
      "இது வண்ண தீமிங், புரோஸ்மிரர் ஸ்டைலிங் மற்றும் கருவிக்குறிப்புகள் பற்றிய தகவல்களை வழங்குகிறது.",
      "இந்த இடுகை ப்ளூஸ்கி பயன்பாட்டின் சமீபத்திய புதுப்பிப்பையும் குறிப்பிடுகிறது, இது பயனர்கள் உள்நுழையாமல் இடுகைகள், சுயவிவரங்கள் மற்றும் பயனர் தேடலை அணுக அனுமதிக்கிறது, அத்துடன் உள்நுழைந்த பயனர்களுக்கு இடுகை பார்வையைக் கட்டுப்படுத்துவதற்கான மிதமான விருப்பத்தையும் குறிப்பிடுகிறது. ஒரு டைம்ஸ்டாம்ப் உடன் இந்த பதிவு முடிகிறது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ட்விட்டருக்கு சாத்தியமான மாற்றான ப்ளூஸ்கியை ஆராய்கிறது, அதன் அம்சங்கள் மற்றும் வளர்ச்சி செயல்முறையை கோடிட்டுக் காட்டுகிறது.",
      "ப்ளூஸ்கி பயனர் அனுபவம், மாறுபட்ட உள்ளடக்கம் மற்றும் திறந்த ஏபிஐ ஆகியவற்றில் கவனம் செலுத்தி வடிவமைக்கப்பட்டுள்ளது.",
      "கருத்து நூல்கள் ப்ளூஸ்கி பற்றிய கலவையான கருத்துக்களை வெளிப்படுத்துகின்றன, உள்ளடக்க தரம், அழைப்பு அமைப்புகள் மற்றும் சமூக ஊடக தளங்களில் மேம்பட்ட சமிக்ஞை-இரைச்சல் விகிதத்தின் தேவை பற்றிய விவாதங்கள். ப்ளூஸ்கி மீதான ஆர்வமும் எதிர்பார்ப்பும் அதன் சாத்தியமான வெற்றியைப் பற்றிய கவலைகள் மற்றும் சந்தேகங்களால் தூண்டப்படுகின்றன."
    ],
    "points": 263,
    "commentCount": 290,
    "retryCount": 0,
    "time": 1703282197
  },
  {
    "id": 38733440,
    "title": "நீண்ட காலத்திற்கு: பெற்றோர், மரபணு மேம்பாடுகள் மற்றும் சுய வழிசெலுத்தல் பற்றிய பிரதிபலிப்புகள்",
    "originLink": "https://www.astralcodexten.com/p/in-the-long-run-were-all-dad",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38733440",
    "commentBody": "",
    "originSummary": [
      "விந்தணு வீணாவதன் முக்கியத்துவத்தையும் சந்ததிகளின் சாத்தியமான திறன்களையும் ஆசிரியர் பிரதிபலிக்கிறார்.",
      "இரட்டையர்களை எதிர்பார்ப்பதில் உள்ள சவால்கள் மற்றும் பெயர்களின் முக்கியத்துவம் ஒரு கருவுறுதல் கிளினிக்கில் ஆசிரியரின் தனிப்பட்ட அனுபவத்திலிருந்து விவாதிக்கப்படுகிறது.",
      "இந்த கட்டுரை திடீரென மரபணு ரீதியாக வடிவமைக்கப்பட்ட பல் பாக்டீரியாவின் சாத்தியமான நன்மைகள் உட்பட, சர்பிரிசல்-மினிமேஷன் இயந்திரங்கள், முன்கணிப்பு துல்லியம், அறிவு தேடல் மற்றும் மரபணு மேம்பாடுகள் குறித்த விவாதத்திற்கு மாறுகிறது."
    ],
    "commentSummary": [
      "அத்தியாவசிய திறன்களை கற்பிப்பதில் பெற்றோரின் பங்கு, குழந்தைகளின் நடத்தையில் குடும்ப வலைப்பதிவின் தாக்கம், கட்டுரைகளில் பைபிள் மேற்கோள்களை இணைப்பது மற்றும் ஸ்காட் அலெக்சாண்டரின் எழுத்து பாணி போன்ற பல்வேறு தலைப்புகளை ஆன்லைன் விவாதம் உள்ளடக்கியது.",
      "குழந்தைகளைப் பராமரிக்கும் போது எழுதுவதில் உள்ள சவால்கள், பிரசவம் தொடர்பான தலைப்புகள், மக்கள்தொகை வளர்ச்சி விகிதங்கள், விவாகரத்து சட்டங்கள், குழந்தைகளைப் பெறுவதற்கான காரணங்கள், குறைந்து வரும் பிறப்பு விகிதங்கள், மனநலம் மற்றும் மதவாதம் ஆகியவை இதில் அடங்கும்.",
      "கூடுதலாக, விவாதம் ஸ்காட் அலெக்சாண்டரின் வலைப்பதிவின் பகுப்பாய்வை உள்ளடக்கியது."
    ],
    "points": 261,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1703247619
  },
  {
    "id": 38737028,
    "title": "WebGPU சோதனை இப்போது சஃபாரி தொழில்நுட்ப முன்னோட்டத்தில் திறக்கப்பட்டுள்ளது",
    "originLink": "https://webkit.org/blog/14879/webgpu-now-available-for-testing-in-safari-technology-preview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38737028",
    "commentBody": "",
    "originSummary": [
      "வலையில் உயர் செயல்திறன் கொண்ட 3 டி கிராபிக்ஸ் மற்றும் கணக்கீடுகளை செயல்படுத்தும் புதிய ஏபிஐயான வெப்ஜிபியூ இப்போது சஃபாரி தொழில்நுட்ப முன்னோட்டத்தில் சோதனைக்கு கிடைக்கிறது.",
      "WebGPU GPU செயல்பாட்டை வலை உள்ளடக்கத்தில் பயன்படுத்த அனுமதிக்கிறது மற்றும் ஜாவாஸ்கிரிப்டில் எழுதப்படுகிறது.",
      "WebGPU ஐ இயக்க, சஃபாரி விருப்பத்தேர்வுகளில் சில அம்ச கொடிகள் இயக்கப்பட வேண்டும்.",
      "WebGPU API ஆனது WebGL போலவே ஜாவாஸ்கிரிப்ட் மூலம் அணுகப்படுகிறது.",
      "ஜிபியு சாதனங்கள், கேன்வாஸ் சூழல், ரெண்டர் பைப்லைன்கள் மற்றும் அழைப்புகளை வரைதல் போன்ற பல்வேறு கூறுகள் கிராபிக்ஸ் வெளியீடுகளை உருவாக்கவும் கட்டமைக்கவும் பயன்படுத்தப்படுகின்றன.",
      "WGSL எனப்படும் ஒரு புதிய நிழல் மொழியையும் WEBGPU அறிமுகப்படுத்துகிறது.",
      "பயனர்கள் WebGPU ஐ முயற்சிக்கவும், அவர்கள் எதிர்கொள்ளும் ஏதேனும் பிழைகள் அல்லது சிக்கல்களைப் புகாரளிக்கவும் ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "சஃபாரியில் வெப்ஜிபியு செயல்படுத்துதல், வெப்ஜிபியுவில் பைனரி வடிவங்களைப் பயன்படுத்துதல் மற்றும் எக்ஸ்கோடில் டபிள்யூஜிஎஸ்எல் ஆதரவை ஒருங்கிணைத்தல் போன்ற வலை தொழில்நுட்ப தலைப்புகளின் வரம்பை இந்த விவாதம் உள்ளடக்கியது.",
      "தொலைபேசிகள் மற்றும் உலாவிகளில் மொழி மாதிரிகளை இயக்குவது, சஃபாரி மற்றும் குரோம் உடனான பயனர் அனுபவங்கள் மற்றும் சஃபாரியின் செயல்திறன் மற்றும் சந்தை பங்கு பற்றிய விவாதங்களும் இதில் அடங்கும்.",
      "ஆப்பிளின் மூலோபாய நகர்வுகள், சாத்தியமான வழக்குகள் மற்றும் நம்பிக்கை எதிர்ப்பு நடவடிக்கைகள் மற்றும் வலை ஏபிஐக்களில் அவற்றின் முதலீடு குறித்து ஊகங்கள் உள்ளன. எபிபானி மற்றும் மிடோரி வலை உலாவிகளும் அவற்றின் சிக்கல்களுடன் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 202,
    "commentCount": 143,
    "retryCount": 0,
    "time": 1703270093
  },
  {
    "id": 38732781,
    "title": "NewPipe 0.26.0 புதுப்பிப்பு: YouTube ஸ்ட்ரீம்களுக்கான திருத்தங்கள், மேம்பட்ட உள்ளடக்க அணுகல் மற்றும் மேம்பட்ட அம்சங்கள்",
    "originLink": "https://github.com/TeamNewPipe/NewPipe/releases/tag/v0.26.0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38732781",
    "commentBody": "",
    "originSummary": [
      "டீம்நியூபைப் / நியூபைப் பொது அறிவிப்புகள் ஃபோர்க் பல குறிப்பிடத்தக்க புதுப்பிப்புகள் மற்றும் பிழை திருத்தங்களுடன் பதிப்பு 0.26.0 ஐ வெளியிட்டுள்ளது.",
      "புதிய பதிப்பு யூடியூப் ஸ்ட்ரீம்களில் உள்ள பிழைகளை நிவர்த்தி செய்கிறது மற்றும் சேனல்களிலிருந்து உள்ளடக்கத்திற்கான அணுகலை மேம்படுத்துகிறது.",
      "மேம்பாடுகளில் படத் தரத்தைத் தேர்ந்தெடுக்கும் திறன், மேம்பட்ட வெற்று மாநில செய்திகள் மற்றும் பிளேயர் இடைமுகங்கள் மற்றும் சிறந்த ஆடியோ ஸ்ட்ரீம் தேர்வு ஆகியவை அடங்கும். புதுப்பிப்பில் உள்ளூர்மயமாக்கல் மற்றும் ஆவண புதுப்பிப்புகள், அத்துடன் பிளேயர் ஆடியோ கவனம், பதிவிறக்கங்கள் மற்றும் பயனற்ற சுட்டி விதிவிலக்குகளுக்கான திருத்தங்களும் அடங்கும். பிற மேம்பாட்டு முயற்சிகள் மெயின்ஆக்டிவிட்டியை எளிமைப்படுத்துதல், நூலகங்களைப் புதுப்பித்தல், பதிவிறக்க உதவியாளர்களை மேம்படுத்துதல், நினைவக கசிவுகளை சரிசெய்தல் மற்றும் குறியீடு தரத்தை மேம்படுத்துதல் ஆகியவற்றில் கவனம் செலுத்தின."
    ],
    "commentSummary": [
      "நியூபைப் என்பது ஆண்ட்ராய்டுக்கான மாற்று யூடியூப் கிளையண்ட் ஆகும், இது பின்னணி பிளேபேக் போன்ற அம்சங்களை வழங்குகிறது, இது பயனர்கள் மிகவும் பாராட்டுகிறது.",
      "சில பயனர்கள் நியூபைப்பைப் பயன்படுத்தும் போது ஆட்டோப்ளேவில் சிக்கல்களை எதிர்கொள்கின்றனர், இது சிலருக்கு ஒரு குறைபாடாக இருக்கலாம்.",
      "துரதிர்ஷ்டவசமாக, ஐஓஎஸ் பயனர்களுக்கு நியூபைப் கிடைக்கவில்லை, ஏனெனில் இது அதிகாரப்பூர்வ யூடியூப் பயன்பாட்டிலிருந்து சுயாதீனமானது."
    ],
    "points": 201,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1703240065
  },
  {
    "id": 38734164,
    "title": "எல்.ஈ.டி தொழில்துறை துளையிடலை உருவாக்குதல்: ஒரு DIY வெற்றிக் கதை",
    "originLink": "https://mitxela.com/projects/scaffold",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38734164",
    "commentBody": "",
    "originSummary": [
      "உரையின் ஆசிரியர் தங்கள் நண்பரின் காதுக்கு குறுக்கே ஒரு பட்டியில் எல்.ஈ.டி.களை செருகுவதன் மூலம் எல்.ஈ.டி தொழில்துறை துளையிடலை உருவாக்கினார்.",
      "இறந்த எல்.ஈ.டி மற்றும் பேட்டரியை மாற்றுவதில் சிரமங்கள் போன்ற சவால்களை அவர்கள் எதிர்கொண்டனர், ஆனால் அவர்கள் பொதுவாக முடிவு குறித்து மகிழ்ச்சியடைந்தனர்.",
      "எல்.ஈ.டி தொழில்துறை துளையிடல் வணிக ரீதியாக கிடைக்கவில்லை என்று ஆசிரியர் கூறினார், ஆனால் ஆர்வமுள்ள நபர்கள் கூடுதல் தகவலுக்கு அவர்களைத் தொடர்பு கொள்ளலாம்."
    ],
    "commentSummary": [
      "நிதி, கலாச்சார மற்றும் ரியல் எஸ்டேட் பிரச்சினைகள் காரணமாக எஸ்.எஃப் பே ஏரியா மற்றும் போர்ட்லேண்ட் போன்ற பல்வேறு இடங்களில் தொழில்துறை மற்றும் உலோக வேலை உபகரணங்களைக் கொண்ட ஹேக்கர் இடங்கள் குறைந்து வருகின்றன.",
      "இலாபம் இல்லாமை மற்றும் துல்லியமான உலோக வேலை உபகரணங்களின் அதிக செலவுகள் ஆகியவையும் பங்களிக்கும் காரணிகளாகும்.",
      "எவ்வாறாயினும், டெக்ஷாப் விட்டுச்சென்ற வெற்றிடத்தை நிரப்ப மேக்கர் நெக்சஸ் போன்ற மாற்று வழிகள் உருவாகி வருகின்றன, இது ஆர்டுயினோ அல்லது ராஸ்பெர்ரி பை போன்ற அணுகக்கூடிய கருவிகளுடன் வகுப்புகள் அல்லது எளிய திட்டங்கள் மூலம் இந்த திறன்களைக் கற்றுக்கொள்வதற்கான வாய்ப்புகளை மக்களுக்கு வழங்குகிறது."
    ],
    "points": 197,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1703253543
  },
  {
    "id": 38733384,
    "title": "எல்.எல்.எம்.களை அதிகரிப்பது: வேகம் மற்றும் செயல்திறனை அதிகரிப்பதற்கான உத்திகள்",
    "originLink": "https://vgel.me/posts/faster-inference/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38733384",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை தன்னியக்க மொழி மாதிரி (எல்.எல்.எம்) அனுமானத்தின் வேகம் மற்றும் செயல்திறனை மேம்படுத்துவதற்கான பல்வேறு நுட்பங்கள் மற்றும் உத்திகளை ஆராய்கிறது.",
      "வன்பொருள் பயன்பாடு, கம்பைலர்கள், பேட்ச்சிங், மாதிரி எடை குறைப்பு, குவாண்டிசேஷன், கே.வி.கேச்சிங், மல்டி-வினவல் கவனம், ஊக டிகோடிங் மற்றும் கட்டமைக்கப்பட்ட தரவு உருவாக்கத்தை மேம்படுத்துதல் ஆகியவை அடங்கும்.",
      "இந்த தேர்வுமுறைகளின் குறிக்கோள் எல்.எல்.எம் அனுமானத்தின் ஒட்டுமொத்த செயல்திறன் மற்றும் நம்பகத்தன்மையை மேம்படுத்துவதாகும், எதிர்காலத்தில் டிரான்ஸ்பார்மர் அல்லாத மாதிரிகள் டிரான்ஸ்பார்மர்களுக்கு போட்டியாக இருக்கும்."
    ],
    "commentSummary": [
      "மொழி மாதிரிகளில் (எல்.எல்.எம்) பயன்படுத்தப்படும் பிற கட்டமைப்புகளுடன் ஒப்பிடும்போது டிரான்ஸ்பார்மர்கள் மிகவும் சக்திவாய்ந்த ஆனால் குறைந்த நினைவக செயல்திறன் கொண்டதாகக் கருதப்படுகின்றன மற்றும் நீண்ட உள்ளீடுகளுடன் போராடுகின்றன.",
      "அவற்றின் வரம்புகள் இருந்தபோதிலும், எல்.எல்.எம்களில் டிரான்ஸ்பார்மர்கள் ஆதிக்கம் செலுத்துகின்றன, மேலும் தொழில்நுட்ப நிறுவனங்கள் அவற்றின் செயல்திறனை மேம்படுத்த புதுமையான சிப் கட்டமைப்புகளில் முதலீடு செய்கின்றன.",
      "வேலை வாய்ப்புகள், டிரான்ஸ்பார்மர் கட்டமைப்புகளை மேம்படுத்துவதன் முக்கியத்துவம், எதிர்காலத்தில் சாத்தியமான செலவு குறைந்த மாதிரிகள், அதிக பயிற்சி செலவுகள், உரை உருவாக்க மாதிரிகளில் மேம்பாடுகள் மற்றும் இந்த மாதிரிகளை திறம்பட இயக்க நுகர்வோர் வன்பொருளில் முன்னேற்றங்களின் தேவை ஆகியவையும் இந்த விவாதத்தில் அடங்கும். கிளவுட் அடிப்படையிலான சேவைகள் மற்றும் சந்தாக்களை நோக்கிய போக்கு உள்ளது, தணிக்கை மற்றும் தணிக்கை முயற்சிகளை உடைக்கும் செயற்கை நுண்ணறிவின் திறன் குறித்த கவலைகளும் எழுப்பப்பட்டுள்ளன. செயற்கை நுண்ணறிவின் தாக்கத்தைச் சுற்றி நுகர்வோர் தர சிப்களை வடிவமைக்க ஒரு பரிந்துரை செய்யப்படுகிறது."
    ],
    "points": 193,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1703246967
  },
  {
    "id": 38736054,
    "title": "சிம்போஸ்: இசட் 80 வன்பொருள் மற்றும் அதற்கு அப்பால் 8பிட் பல்பணி ஓஎஸ்",
    "originLink": "http://www.symbos.de/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38736054",
    "commentBody": "",
    "originSummary": [
      "சிம்போஸ் என்பது பல ரெட்ரோ கணினி அமைப்புகளுக்கு கிடைக்கக்கூடிய 8-பிட் பல்பணி இயக்க முறைமை ஆகும்.",
      "இது பலவிதமான பயன்பாடுகள், பயன்பாடுகள், மல்டிமீடியா, கேம்கள் மற்றும் டெஸ்க்டாப் விட்ஜெட்களை வழங்குகிறது.",
      "சமீபத்திய புதுப்பிப்புகளில் சிம்போஸ் என்.சி வெளியீடு அடங்கும், இது சுருக்கப்பட்ட தரவு ஆதரவு மற்றும் பல்வேறு பயன்பாடுகளுக்கு மேம்பாடுகளைச் சேர்க்கிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் இசட் 80 அடிப்படையிலான கணினிகளின் தொழில்நுட்ப அம்சங்கள் மற்றும் அம்சங்களில் கவனம் செலுத்துகிறது, அதாவது இசட் 80 செயலியின் பல்பணி திறன்கள் மற்றும் ஈஇசட் 80 இன் செயல்திறன்.",
      "பங்கேற்பாளர்கள் 65 சி 816 வங்கி அமைப்பின் வரம்புகளை ஒப்பிட்டு, தனித்துவமான அம்சங்களைக் கொண்ட பழைய கணினிகளுக்கான ஏக்கத்தைப் பகிர்ந்து கொள்கிறார்கள்.",
      "சில பயனர்கள் பேட்டரி ஆயுள் மற்றும் வீணான கணினி சக்தி உள்ளிட்ட நவீன சாதனங்களின் வரம்புகளை சுட்டிக்காட்டுகின்றனர்."
    ],
    "points": 165,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1703264242
  }
]
