[
  {
    "title": "중국의 전자상거래 플랫폼, 그린피스로부터 부적절한 기후 노력으로 비판받다",
    "originLink": "https://www.reuters.com/sustainability/chinas-e-commerce-platforms-not-doing-enough-climate-greenpeace-2023-11-09/",
    "originBody": "",
    "originSummary": [
      "그린피스의 보고서는 핀둬둬, 콰이쇼우, 도우인, 알리바바 등 중국 이커머스 플랫폼이 지속가능성을 증진하고 기후 변화에 대응하는 데 충분한 노력을 기울이지 않는다고 비판합니다.",
      "핀둬둬는 최악의 성과를 거둔 반면, 알리바바는 기후 변화에 대응하기 위해 사용자와 기업을 참여시키는 전략으로 최고로 인정받았습니다.",
      "이 보고서는 또한 콰이쇼우와 더우인 플랫폼에서 금지된 제품을 판매할 수 있다는 점을 강조하며, 이커머스 대기업들이 지속가능성과 환경 보호를 위한 추가 조치를 취할 것을 촉구합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "Greenpeace has released a report criticizing China's e-commerce platforms, including Pinduoduo, Kuaishou, Douyin, and Alibaba, for their insufficient efforts in promoting sustainability and combating climate change.",
      "Pinduoduo was ranked as the worst performer, while Alibaba was recognized as the best, mainly due to its strategy of engaging users and businesses in responding to climate change.",
      "The report also highlighted the presence of prohibited products on Kuaishou and Douyin platforms, calling for e-commerce giants to take additional measures to promote sustainability and protect the environment."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535863380
  },
  {
    "title": "쑤닝, 핀둬둬, 더우인이 주요 플레이어로 급성장하고 있는 라이브 커머스 플랫폼 시장",
    "originLink": "https://www.argylereport.com/news/live-commerce-platform-market-next-big-thing-major-giants-suning-pinduoduo-douyin/336726/",
    "originBody": "",
    "originSummary": [
      "글로벌 라이브 커머스 플랫폼 시장은 쑤닝, 핀둬둬, 더우인 등 주요 업체를 중심으로 상당한 성장세를 보이고 있습니다.",
      "시장은 이커머스 자체 구축 플랫폼, 콘텐츠 커뮤니티 플랫폼, 전통적인 소셜 플랫폼 등 다양한 유형으로 나뉩니다.",
      "의류 및 가방, 미용 제품, 식품, 전자기기 등 다양한 산업 분야에서 사용됩니다.",
      "이 보고서는 업계 개요, 시장 분석 및 인사이트를 제공하여 투자자가 최신 정보를 파악하는 데 도움을 줍니다.",
      "또한 주요 시장 참여자, 시장 동향 및 향후 성장 기회에 대한 세부 정보도 포함되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "The global live commerce platform market is witnessing substantial growth, with leading players such as Suning, Pinduoduo, and Douyin dominating the market.",
      "The market is segmented into different types, including e-commerce self-built platforms, content community platforms, and traditional social platforms.",
      "Live commerce platforms are utilized in various industries, such as clothing & bags, beauty products, food, and electrical devices.",
      "The report offers an industry overview, market analysis, and insights to assist investors in staying informed.",
      "It also provides information on key market players, current trends, and future growth prospects in the industry."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699535863380
  }
]
