[
  {
    "id": 38452959,
    "title": "خطأي البالغ 500 مليون دولار في مركبة المريخ: دروس في الفشل والابتكار",
    "originLink": "https://www.chrislewicki.com/articles/failurestory",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38452959",
    "commentBody": "",
    "originSummary": [
      "في عام 2003 ، خلال مرحلة التجميع والاختبار لمركبة سبيريت مارس روفر التابعة لناسا ، دمرت موجة من الكهرباء محركات أداة تآكل الصخور (RAT) المتصلة بالذراع الروبوتية للمركبة ، مما أدى إلى خسارة 500 مليون دولار.",
      "يؤكد الحادث على أهمية التعلم من الفشل وأهمية الدعم من الزملاء ، حيث تمت استعادة الاتصال في النهاية واستمر الاختبار.",
      "يشجع المؤلف ، كريس لويكي ، الآخرين الآن على مشاركة قصص فشلهم لتعزيز الحكمة الجماعية وتشجيع الابتكار في صناعة الفضاء."
    ],
    "commentSummary": [
      "تستكشف مجموعة المناقشات والحكايات مجموعة متنوعة من الموضوعات ، بما في ذلك الأخطاء المكلفة في الصناعات المختلفة ، وعواقب التوقف عن العمل على الخدمات عبر الإنترنت ، وتحديات إدارة قواعد البيانات والأخطاء.",
      "ويشدد على أهمية التعلم من الإخفاقات ويتناول أهمية المسؤولية والمساءلة في الصناعات عالية المخاطر.",
      "تشمل الموضوعات الأخرى التي يتم تناولها التحديات في البعثات الفضائية ، واستخدام المحركات المصقولة ، وقضايا التوظيف والتعب في الوظائف الحرجة ، واستخدام طلاب الدراسات العليا كعمالة غير مكلفة."
    ],
    "points": 693,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1701213377
  },
  {
    "id": 38448653,
    "title": "MeshGPT: توليد شبكات مثلث عالية الدقة مع نماذج المحولات",
    "originLink": "https://nihalsid.github.io/mesh-gpt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38448653",
    "commentBody": "",
    "originSummary": [
      "MeshGPT هي تقنية جديدة تستخدم نماذج المحولات لتوليد شبكات مثلثة من خلال التدريب على مفردات هندسية مكتسبة.",
      "تنتج هذه الطريقة شبكات عالية الجودة ذات حواف حادة وتماسك واكتناز ، وتتفوق على طرق توليد الشبكات الأخرى في تغطية الشكل والدقة.",
      "MeshGPT لديه تطبيقات في إكمال الشكل ، وتوليد الأصول 3D للمشاهد ، ويمكن أن تولد شبكات كتسلسلات باستخدام شبكة فك التشفير وتكميم المتجهات."
    ],
    "commentSummary": [
      "تستكشف المناقشة إمكانات نماذج وشبكات 3D التي تم إنشاؤها بواسطة الذكاء الاصطناعي باستخدام محولات فك التشفير فقط والتضمينات الكمية.",
      "توجد آراء مختلفة حول الابتكار والتطبيق العملي لهذه التقنيات في صناعات مثل الألعاب وإنتاج الأفلام / التلفزيون.",
      "يسلط المقال الضوء أيضا على المخاوف بشأن الأمن الوظيفي للفنانين والحاجة إلى تحسينات في النمذجة الذكاء الاصطناعي وتوليد كائنات 3D."
    ],
    "points": 634,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1701194196
  },
  {
    "id": 38444834,
    "title": "دورة برمجة C ++ المتقدمة: تدريب عملي ومحدث لتحسين الكفاءة",
    "originLink": "https://github.com/federico-busato/Modern-CPP-Programming",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38444834",
    "commentBody": "",
    "originSummary": [
      "هذه الدورة التدريبية ذات الوصول المفتوح مثالية للأفراد الذين لديهم فهم قوي للغة C والبرمجة الموجهة للكائنات ويرغبون في تعزيز مهاراتهم في C ++.",
      "تقدم الدورة منهجا شاملا يتضمن برمجة C ++ الأساسية بالإضافة إلى موضوعات ومفاهيم أكثر تقدما.",
      "يوفر معلومات عملية وحديثة ، تتضمن أحدث معايير اللغة والميزات وتجربة هندسة البرمجيات في العالم الحقيقي من المدرب."
    ],
    "commentSummary": [
      "تغطي المحادثة مجموعة من الموضوعات في برمجة C ++ ، بما في ذلك موارد التعلم وأفضل الممارسات والتحديات والمقارنات مع لغات أخرى مثل Rust.",
      "يناقش المشاركون استخدام ميزات لغوية محددة ، ومدى ملاءمة C ++ لمختلف الصناعات والتطبيقات ، وأهمية فهم المفاهيم مثل المؤشرات والمراجع.",
      "كما تمت مناقشة أدوات الأتمتة وفرض اللغة وجودة التعليمات البرمجية ، إلى جانب موقف Microsoft من الأمان وإعلانها الأخير حول التحول إلى Rust."
    ],
    "points": 466,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1701172984
  },
  {
    "id": 38444719,
    "title": "تطوير Half-Life: نظرة على صنع الألعاب الكلاسيكية",
    "originLink": "https://www.youtube.com/watch?v=TbZ3HzvFEto",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38444719",
    "commentBody": "",
    "originSummary": [
      "يقدم الملخص لمحة عامة عن تطوير لعبة الفيديو Half-Life.",
      "ويغطي جوانب مختلفة مثل استخدام الكود المصدري ل Quake ، والتحديات في إنشاء تسلسلات نصية ، والتركيز على التفاعل وإجراءات اللاعب ، وتنفيذ نماذج الشخصيات ومواجهات العدو.",
      "بالإضافة إلى ذلك ، يناقش عملية بناء المستوى ، وإنشاء صور متماسكة ، وإشراك فريق صغير لتصميم المستوى.",
      "يتطرق الملخص أيضا إلى إنشاء الصوت والحوار ، واستخدام القطارات كعناصر تفاعلية ، وأهمية التماسك البصري والتفاصيل الصغيرة ، وإشراك مختلف الأفراد في إنتاج اللعبة."
    ],
    "commentSummary": [
      "يشارك المستخدمون في موضوع مناقشة للاحتفال بالذكرى السنوية ال 25 للعبة الفيديو Half-Life ، ومشاركة تجاربهم وذكرياتهم عن اللعبة ومطوريها.",
      "يتعمق الموضوع أيضا في موضوعات مثل تطوير الألعاب والاستوديوهات المستقلة ونجاح Valve ، مع استكشاف أهمية اللعب الممتع ومناقشة المشهد المتطور لهذه الصناعة.",
      "يتم التكهن بالألعاب الأخرى والإصدارات المستقبلية ، كما تتم معالجة مخاوف مثل دوار الحركة في الألعاب."
    ],
    "points": 371,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1701171637
  },
  {
    "id": 38445745,
    "title": "ايكيا تكشف النقاب عن مستشعرات المنزل الذكي بأسعار معقولة للأبواب والنوافذ والحركة وتسرب المياه",
    "originLink": "https://www.theverge.com/2023/11/28/23977693/ikea-sensors-door-window-water-motion-price-date-specs",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38445745",
    "commentBody": "",
    "originSummary": [
      "أطلقت Ikea ثلاثة مستشعرات منزلية ذكية ميسورة التكلفة للكشف عن فتح الأبواب والنوافذ والحركة وتسرب المياه.",
      "يبلغ سعر المستشعرات أقل من 10 دولارات لكل منها وستكون متاحة عالميا في النصف الأول من عام 2024.",
      "تشتمل المستشعرات على مستشعر Parasoll ، والذي يمكن إقرانه بمصباح Ikea الكهربائي بدون محور ذكي ، ومستشعر الحركة Vallhorn للاستخدام الداخلي والخارجي ، ومستشعر المياه Badring مع صفارة إنذار مدمجة وقدرات إشعار الهاتف المحمول."
    ],
    "commentSummary": [
      "تدور المناقشة حول الأجهزة المنزلية الذكية باستخدام تقنية Zigbee ، حيث يقارن المستخدمون العلامات التجارية ، ويشاركون تجارب عمر البطارية ، ويناقشون مخاوف أمان البيانات ، ويقيمون وظائف المستشعر والمحور وموثوقيتهم.",
      "تم ذكر فوائد Zigbee لأتمتة المنزل ، إلى جانب اقتراحات لتحسين توافق الجهاز.",
      "تشمل الموضوعات الأخرى اكتشاف تسرب المياه ، وتصريف غرفة الغسيل ، وتكلفة وتوافر تقنية التشغيل الآلي للمنزل ، مما يوفر نظرة شاملة على تفضيلات واهتمامات وتجارب عشاق المنزل الذكي."
    ],
    "points": 369,
    "commentCount": 230,
    "retryCount": 0,
    "time": 1701180138
  },
  {
    "id": 38444577,
    "title": "كتابة الوثائق الفنية لمنزلك: دليل لأصحاب المنازل",
    "originLink": "https://luke.hsiao.dev/blog/housing-documentation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38444577",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال مفهوم إنشاء وثائق فنية لمنزل الفرد ، مستوحاة من ممارسات توثيق البرمجيات.",
      "يدعو المؤلف إلى استخدام إطار يسمى Diátaxis لتنظيم الوثائق ويقترح تنفيذه باستخدام مواد ل Mkdocs.",
      "توفر المقالة عينة من تكوين Mkdocs و Justfile للمعاينات المحلية وتؤكد على فوائد الحصول على وثائق للمنزل ونقلها إلى المالكين في المستقبل."
    ],
    "commentSummary": [
      "تركز المناقشة على أهمية تنظيم وتوثيق المعلومات حول المنازل والممتلكات ، بما في ذلك تفاصيل التجديد وأدلة الأجهزة وسجلات الصيانة.",
      "يشارك بعض مالكي المنازل تجارب إيجابية مع عمليات التفتيش على المنازل والتقارير الشاملة ، بينما يعبر آخرون عن إحباطهم عندما يتجاهل الملاك الجدد توثيق منازلهم الذكية.",
      "تم ذكر طرق مختلفة للتوثيق ، مثل المجلدات المادية والأدوات الرقمية وبرامج DIY ، إلى جانب استخدام التكنولوجيا مثل رموز QR ونظارات الواقع المعزز. كما تتم مناقشة الاختلافات الثقافية وارتباطات الأجيال بالمنازل."
    ],
    "points": 312,
    "commentCount": 145,
    "retryCount": 0,
    "time": 1701169945
  },
  {
    "id": 38445020,
    "title": "Microsoft Open-Sources ThreadX RTOS, Azure RTOS Development Suite",
    "originLink": "https://www.theregister.com/2023/11/28/microsoft_opens_sources_threadx/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38445020",
    "commentBody": "",
    "originSummary": [
      "لدى Microsoft ThreadX RTOS مفتوح المصدر ومجموعة تطوير Azure RTOS بموجب ترخيص معهد ماساتشوستس للتكنولوجيا.",
      "ThreadX هو RTOS شائع يعمل على مليارات الأجهزة ، بما في ذلك Raspberry Pis.",
      "تبرعت Microsoft بالبرنامج لمؤسسة Eclipse ، والتي ستسمى الآن Eclipse ThreadX."
    ],
    "commentSummary": [
      "جعلت Microsoft نظام التشغيل المضمن في الوقت الفعلي (RTOS) ThreadX مفتوح المصدر ، مما يشير إلى الابتعاد عن خارطة الطريق الخاصة بها ل Azure RTOS.",
      "أدى استحواذ Amazon على FreeRTOS إلى حصول Microsoft على ThreadX ، ولكن يبدو أنهم يركزون الآن على مجالات أخرى.",
      "تناقش المقالة أهمية شهادات السلامة ل RTOS ، وتحديات إصدار البرامج الثابتة وبرامج تشغيل GPU ، ونقص عمال التطوير المدمجين."
    ],
    "points": 285,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1701174920
  },
  {
    "id": 38447491,
    "title": "موافقة إدارة الغذاء والدواء الأمريكية (FDA) على الاختراق تقترب من تمديد عمر الكلب الكبير",
    "originLink": "https://loyalfordogs.com/posts/loyal-announces-historic-fda-milestone-for-large-dog-lifespan-extension-drug",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38447491",
    "commentBody": "",
    "originSummary": [
      "تلقت شركة التكنولوجيا الحيوية Loyal موافقة إدارة الغذاء والدواء الأمريكية (FDA) لتطوير والموافقة على عقارها LOY-001 لإطالة عمر الكلاب ذات السلالات الكبيرة.",
      "يعمل LOY-001 عن طريق تقليل مستويات هرمون IGF-1 الذي يعتقد أنه يساهم في تسريع الشيخوخة في الكلاب الكبيرة.",
      "لا يزال Loyal بحاجة إلى تلبية متطلبات السلامة والتصنيع وإجراء دراسة تأكيدية ، ولكن يمكن للأطباء البيطريين بالفعل وصف LOY-001 بفضل عملية الموافقة المشروطة لإدارة الغذاء والدواء."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على أهمية التمرين والتحفيز العقلي لسلالات الكلاب الكبيرة.",
      "يتم استكشاف الفوائد المحتملة والاعتبارات الأخلاقية لإطالة عمر الكلاب والبشر.",
      "تمت مناقشة مدى ملاءمة سلالات الكلاب المختلفة للعيش في شقة والاختلافات بين امتلاك الكلاب الكبيرة مقابل الكلاب الصغيرة."
    ],
    "points": 261,
    "commentCount": 168,
    "retryCount": 0,
    "time": 1701188863
  },
  {
    "id": 38450390,
    "title": "SDXL Turbo: إنشاء نص إلى صورة عالي الجودة في الوقت الفعلي",
    "originLink": "https://stability.ai/news/stability-ai-sdxl-turbo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38450390",
    "commentBody": "",
    "originSummary": [
      "SDXL Turbo هو نموذج لتوليد النص إلى صورة في الوقت الفعلي يستخدم تقنية تقطير جديدة لتحقيق توليد صور عالية الجودة.",
      "من خلال عملية إنشاء الصور بخطوة واحدة ، يقلل SDXL Turbo الخطوات الضرورية من 50 إلى خطوة واحدة فقط ، مما يجعلها أكثر كفاءة.",
      "يتضمن النموذج التقطير بالانتشار العدائي (ADD) ، وهي تقنية تقطير تحافظ على دقة عالية لأخذ العينات وتعالج المشكلات الشائعة الموجودة في طرق التقطير الأخرى."
    ],
    "commentSummary": [
      "يستكشف المقال SDXL Turbo ، وهو نموذج لتوليد النص إلى صورة ، ويثير مخاوف بشأن استخدامه غير التجاري وتجنب OpenAI لأسواق معينة مثل المواد الإباحية.",
      "ويناقش استخدام خدمات توليد النصوص المدفوعة والمجانية الذكاء الاصطناعي والمتطلبات الحسابية العالية لضبط النموذج.",
      "يتعمق المقال في موضوعات مثل تحقيق الدخل المحتمل من نماذج الذكاء الاصطناعي التي يتم تشغيلها محليا ، وربحية OpenAI ، والإباحية التي تم إنشاؤها بواسطة الذكاء الاصطناعي ، وهيمنة Google ، والقضايا القانونية المحيطة بالمحتوى الذي تم إنشاؤه الذكاء الاصطناعي ، واستخدامات وقيود الصور التي تم إنشاؤها بواسطة الذكاء الاصطناعي ، وحالة حقوق الطبع والنشر للأعمال التي تم إنشاؤها الذكاء الاصطناعي ، ودور المهندسين والفنانين الذكاء الاصطناعي في العملية الإبداعية."
    ],
    "points": 220,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1701201416
  },
  {
    "id": 38446353,
    "title": "Keras 3.0: تشغيل مهام سير عمل Keras على أطر عمل متعددة مع تحسين الأداء والتوافق المحسن",
    "originLink": "https://keras.io/keras_3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38446353",
    "commentBody": "",
    "originSummary": [
      "Keras 3.0 هو أحدث إصدار من مكتبة التعلم الآلي التي توفر التوافق مع أطر عمل متعددة مثل JAX و TensorFlow و PyTorch.",
      "يوفر تحسين الأداء ، وتوازي النموذج ، ودعم توازي البيانات على نطاق واسع.",
      "يحافظ Keras 3 على التوافق مع الإصدارات السابقة مع Keras 2 ويقدم دليل ترحيل لتغييرات التعليمات البرمجية الضرورية. بالإضافة إلى ذلك ، فهو يدعم استراتيجيات التوزيع في TensorFlow و PyTorch و JAX."
    ],
    "commentSummary": [
      "تركز المناقشة على إصدار Keras 3.0 وميزاته ومنافسته مع PyTorch.",
      "يدرس المستخدمون مزايا واعتبارات اعتماد Keras ، بما في ذلك توافقه مع الأطر الأخرى وموقعه في السوق.",
      "تعترف المحادثة أيضا بشعبية ونقاط قوة PyTorch ، وتسلط الضوء على التحديات التي يواجهها مطورو البرامج مفتوحة المصدر وأهمية الحوار المحترم والبناء."
    ],
    "points": 213,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1701183218
  },
  {
    "id": 38452712,
    "title": "أبل تنهي شراكة بطاقات الائتمان مع جولدمان ساكس",
    "originLink": "https://www.wsj.com/finance/banking/apple-pulls-plug-on-goldman-credit-card-partnership-ca1dfb45",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38452712",
    "commentBody": "",
    "originSummary": [
      "تنهي شركة آبل شراكتها في بطاقات الائتمان مع جولدمان ساكس ، مما يمثل نهاية غزوة البنك في الإقراض الاستهلاكي.",
      "سيتم إنهاء العقد في غضون العام المقبل إلى 15 شهرا ، مما يؤدي إلى وقف عروض بطاقات الائتمان وحسابات التوفير من Apple.",
      "تسلط هذه الخطوة الضوء على تحول Apple بعيدا عن الخدمات المالية ورغبتها في التركيز على أعمالها الأساسية في التكنولوجيا والإلكترونيات الاستهلاكية."
    ],
    "commentSummary": [
      "أنهت شركة آبل شراكتها في بطاقة الائتمان مع جولدمان ساكس ، مما أثار مناقشات حول شركاء جدد محتملين مثل أمريكان إكسبريس.",
      "يعد قبول أمريكان إكسبريس من قبل التجار ، وخاصة خارج الولايات المتحدة ، موضوعا للنقاش بسبب اختلاف وجهات النظر حول الدعم ومعدلات القبول والرسوم.",
      "هناك تكهنات حول تحول Apple إلى بنك جديد لبطاقة Apple Card الخاصة بها وتوسيع عروضها المالية ، مما أثار مناقشات حول خيارات الاستثمار وحسابات التوفير وخدمة العملاء ورسوم بطاقات الائتمان."
    ],
    "points": 212,
    "commentCount": 208,
    "retryCount": 0,
    "time": 1701212219
  },
  {
    "id": 38446027,
    "title": "قراصنة لهم علاقات مع الصين نهب صانع رقائق NXP لسنوات 2 ، وكشف نقاط الضعف المحتملة",
    "originLink": "https://arstechnica.com/security/2023/11/hackers-spent-2-years-looting-secrets-of-chipmaker-nxp-before-being-detected/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38446027",
    "commentBody": "",
    "originSummary": [
      "تسللت مجموعة قرصنة يعتقد أن لها علاقات مع الصين ، والمعروفة باسم \"Chimera\" أو \"G0114\" ، إلى شبكة شركة صناعة الرقائق الهولندية NXP لأكثر من عامين.",
      "تمكنت المجموعة من الوصول إلى صناديق بريد الموظفين ومحركات أقراص الشبكة لسرقة تصميمات الرقائق والملكية الفكرية.",
      "لم تكشف NXP عن الخرق لعملائها ، مما أثار مخاوف بشأن نقاط الضعف المحتملة في منتجاتها ، حيث يمكن استخدام البيانات المسروقة لاستغلال العيوب في رقائق NXP المضمنة في الأجهزة المختلفة."
    ],
    "commentSummary": [
      "نجح المتسللون في سرقة أسرار من شركة NXP لصناعة الرقائق لمدة عامين قبل اكتشافهم ، مما أثار مخاوف بشأن أمن منتجات NXP وإمكانية سرقة الملكية الفكرية.",
      "استخدم المتسللون التخزين السحابي لتجنب الاكتشاف ومن المتوقع أنه ربما كانت هناك أبواب خلفية موجودة مسبقا في رقائق NXP سمحت لهم بالوصول.",
      "تشير المقالة إلى أن هجمات برامج الفدية كان من الممكن أن تكون طريقة أكثر فاعلية لإجبار NXP على معالجة نقاط الضعف الأمنية الخاصة بها ، كما تستكشف إمكانية مشاركة الدولة القومية وإمكانية وقوع حوادث مماثلة في المستقبل."
    ],
    "points": 206,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1701181554
  }
]
