[
  {
    "id": 41422311,
    "title": "100만 사용자",
    "originLink": "https://blog.spacehey.com/entry?id=1245177",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422311",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "한 고등학생이 기본 기술인 바닐라 PHP, HTML, MySQL을 사용하여 MySpace를 연상시키는 소셜 미디어 사이트 SpaceHey를 개발했으며, 이 사이트는 100만 명의 사용자를 돌파했다.",
      "SpaceHey는 광고와 알고리즘 같은 현대 소셜 미디어 문제를 피하고, 단순함과 맞춤화를 제공하여 사용자들에게 매력적으로 다가갑니다.",
      "해커 뉴스에서의 논의는 사이트의 기술 스택, 사용자 경험, 그리고 소셜 미디어 디자인에 대한 더 넓은 함의에 초점을 맞추며, 향수와 플랫폼의 장점에 대한 토론이 이루어집니다."
    ],
    "points": 668,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725246788
  },
  {
    "id": 41420597,
    "title": "극한 Pi 부팅 최적화",
    "originLink": "https://kittenlabs.de/blog/2024/09/01/extreme-pi-boot-optimization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420597",
    "commentBody": "",
    "originSummary": [
      "SolarCamPi 프로젝트는 태양광 카메라 시스템의 에너지 효율성을 높이기 위해 Raspberry Pi Zero 2 W의 부팅 시간을 3.5초로 최적화했습니다.",
      "주요 최적화에는 불필요한 하드웨어 기능 비활성화, CPU 설정 조정, 그리고 맞춤형 간소화된 커널 사용이 포함되었습니다.",
      "이러한 변화는 에너지 소비를 5배 줄이는 결과를 가져왔으며, 부팅 시간과 전력 효율성 모두에서 상당한 개선을 보여주었습니다."
    ],
    "commentSummary": [
      "극한 Pi 부팅 최적화는 애플리케이션을 커널에 연결된 initramfs에 번들링하고 파일 시스템 마운트를 피하며, 잠재적으로 BusyBox init을 간단한 bash 스크립트로 대체하는 것을 포함합니다.",
      "논의된 기술에는 불필요한 커널 모듈 비활성화, zstd 압축 사용, 그리고 부팅 시간을 최적화하기 위한 chroot 테스트가 포함됩니다.",
      "대화는 Google Coral 및 ESP32와 같은 대안과 비교하여 Raspberry Pi 하드웨어의 전력 소비 문제를 강조하며, 효율적인 부팅 및 전력 관리 전략의 필요성을 강조합니다."
    ],
    "points": 472,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1725226615
  },
  {
    "id": 41421846,
    "title": "OrbStack: Docker 컨테이너와 리눅스를 실행하는 빠르고 가볍고 쉬운 방법",
    "originLink": "https://orbstack.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421846",
    "commentBody": "",
    "originSummary": [
      "OrbStack은 Docker 컨테이너와 리눅스를 실행하기 위한 강력한 기능을 제공하면서 메모리와 CPU 사용을 최소화하도록 설계된 Docker Desktop의 가볍고 효율적인 대안을 소개합니다.",
      "주요 기능으로는 빠른 시작 시간, 낮은 자원 소비, CLI 및 파일 공유와의 원활한 통합, 그리고 Rosetta를 사용하여 Apple Silicon에서 x86 컨테이너를 실행할 수 있는 지원이 포함됩니다.",
      "이 제품은 성능 향상으로 인해 개발자들로부터 긍정적인 피드백을 받았으며, 특히 M1/M2 맥에서 더욱 두드러집니다. 이는 더 효율적인 컨테이너 관리 솔루션을 찾는 사람들에게 매력적인 선택이 되고 있습니다."
    ],
    "commentSummary": [
      "OrbStack은 macOS에서 Docker 컨테이너와 리눅스를 실행하기 위한 새로운 도구로, Docker Desktop에 비해 상당한 성능 향상을 제공합니다.",
      "사용자들은 OrbStack이 컴파일 시간을 극적으로 줄여주고 macOS에서 WSL2와 유사한 경험을 제공한다고 보고하여 개발자들에게 매력적인 옵션이 되고 있다고 말합니다.",
      "백업 소프트웨어와 드문 디스크 이미지와 관련된 몇 가지 문제에도 불구하고, 전반적인 사용자 피드백은 OrbStack의 세련된 UI, 더 나은 통합, 그리고 Colima와 Docker Desktop 같은 대안들에 비해 더 빠른 성능을 강조하고 있습니다."
    ],
    "points": 251,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1725240956
  },
  {
    "id": 41424371,
    "title": "게임 조각 모음",
    "originLink": "https://defrag-game.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41424371",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "하드 드라이브 조각 모음의 개념에서 영감을 받은 새로운 게임 'Defrag the Game'이 출시되었지만, 현실적인 시뮬레이션을 의도한 것은 아닙니다.",
      "플레이어들은 지침의 부족과 실제 디스크 조각 모음 과정과의 차이로 인해 게임이 혼란스럽다고 느끼며, 이에 따라 다양한 피드백이 나오고 있습니다.",
      "이 게임은 React를 사용하여 제작되었으며, 일부 사용자는 이를 즐기지만 다른 사용자들은 성능 문제와 불명확한 점수 매커니즘을 보고했습니다."
    ],
    "points": 217,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1725275302
  },
  {
    "id": 41422126,
    "title": "일본의 사찰 건축업체인 금강조, 1,500년 가까이 생존해왔다",
    "originLink": "https://www.openculture.com/2024/08/how-the-oldest-company-in-the-world-has-survived-nearly-1500-years.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422126",
    "commentBody": "",
    "originSummary": [
      "세계에서 가장 오래된 지속적으로 운영되는 회사인 금강조합은 거의 1,500년 동안 사업을 해왔으며, 원래 578년에 일본 최초의 불교 사원인 시텐노지를 건설하기 위해 설립되었습니다.",
      "회사는 40대에 걸쳐 콩고 가문에 의해 운영되어 왔으며, 관 제작을 포함한 다양한 사업으로 다각화하여 여러 도전에 적응해 왔습니다.",
      "2006년, 금강조가 다카마쓰 건설 그룹의 자회사가 되었지만, 현대적인 기술을 사용하여 사원 건축의 전통적인 장인 정신을 계속 이어가고 있습니다."
    ],
    "commentSummary": [
      "일본의 사찰 건축 회사인 콘고구미는 거의 1,500년 동안 운영되다가 재정적 어려움으로 인해 2006년에 매각되고 파산을 선언했습니다.",
      "회사의 쇠퇴는 금융 공학, 경쟁, 그리고 일본 경제의 독특한 구조에 의해 영향을 받았습니다.",
      "이 논의는 오랜 역사를 가진 기업들, 가족 경영 기업들, 그리고 문화적 및 경제적 요인이 기업의 장수에 미치는 영향을 강조합니다."
    ],
    "points": 202,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725243919
  },
  {
    "id": 41421650,
    "title": "Tbsp – treesitter 기반 소스 처리 언어",
    "originLink": "https://git.peppe.rs/languages/tbsp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421650",
    "commentBody": "",
    "originSummary": [
      "트리 기반 소스 처리 언어(tbsp)의 마스터 브랜치에는 최근 Akshay에 의해 여러 커밋이 이루어져 활발한 개발이 진행 중임을 나타냅니다.",
      "주요 업데이트에는 목록 및 인덱스 표현식의 추가, 노드를 `usize`(Rust의 부호 없는 정수형 타입)로 저장하는 기능, 그리고 `string::substr` 함수의 도입이 포함됩니다.",
      "README에 사용 로드맵을 추가하고 프로젝트 이름을 'trawk'에서 'tbsp'로 변경하는 등 중요한 문서화 및 사용성 개선이 이루어졌습니다."
    ],
    "commentSummary": [
      "Tbsp는 코드 구문 분석 및 분석 도구인 Treesitter를 기반으로 하는 소스 처리 언어입니다.",
      "사용자들은 비편집기 사용 사례를 위한 고수준 API의 필요성과 표준 문법 구조의 부재에 대해 논의하고 있습니다.",
      "tree-sitter-graph, ast-grep, 그리고 Semgrep과 같은 관련 프로젝트와 같은 도구들은 문법을 더 잘 처리하고 시각화하는 데 권장됩니다."
    ],
    "points": 191,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1725239056
  },
  {
    "id": 41423303,
    "title": "전화선 농촌 외부 설비",
    "originLink": "http://cityinfrastructure.com/single.php?d=RuralOutsidePlant&t=Rural%20Outside%20Plant",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423303",
    "commentBody": "",
    "originSummary": [
      "농촌 외부 설비는 전화 회사의 케이블과 장비가 가정을 중앙 사무소에 연결하는 것을 포함하며, 더 작은 중앙 사무소와 더 긴 케이블 거리와 같은 눈에 띄는 차이점이 있습니다.",
      "주요 구성 요소에는 고쌍수 케이블을 분할하기 위한 점퍼드 와이어 인터페이스(JWI), 피더 케이블, 전신주, 그리고 케이블 분배를 위한 접속함이 포함됩니다.",
      "디지털 신호를 증폭하고 열 방출을 관리하기 위해 T1 리피터와 HRE-458 HiGain 원격 Therm-O-Nator 인클로저와 같은 고급 장비가 사용됩니다."
    ],
    "commentSummary": [
      "이 논의는 전통적인 구리 기반 전화 시스템에서 현대적인 광섬유로의 전환을 강조하며, 속도와 신뢰성 측면에서 광섬유의 이점을 강조합니다.",
      "사용자들은 ISDN, DSL, 광섬유 등 다양한 통신 기술에 대한 개인적인 경험과 통찰을 공유하며, 이러한 기술이 연결성과 서비스 품질에 미치는 영향을 논의합니다.",
      "대화는 또한 로딩 코일의 사용, 케이블의 압력 조절, 도난 방지를 위한 구리에서 섬유로의 교체와 같은 농촌 및 도시 통신 인프라의 도전과 특이점에 대해 다룹니다."
    ],
    "points": 148,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1725261688
  },
  {
    "id": 41423577,
    "title": "리눅스에서 Toshiba NAS HDD 펌웨어 업그레이드하기",
    "originLink": "https://syscall.eu/blog/2024/08/28/toshiba_hdd_firmware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423577",
    "commentBody": "",
    "originSummary": [
      "한 사용자가 원래 Windows에서만 사용할 수 있었던 Toshiba HDD 펌웨어 업데이트 프로그램을 Linux에서 작동하도록 성공적으로 리버스 엔지니어링했습니다.",
      "이 과정에는 업데이트 파일을 추출하고, 플래싱 과정을 이해하며, 특정 리눅스 명령어를 사용하여 펌웨어를 업데이트하는 것이 포함되었습니다.",
      "이 성과는 리눅스 사용자가 윈도우 도구에 의존하지 않고도 도시바 NAS HDD 펌웨어를 업데이트할 수 있게 합니다."
    ],
    "commentSummary": [
      "논의는 리눅스에서 도시바 NAS HDD 펌웨어를 업데이트하는 것의 중요성과 위험성에 중점을 둡니다.",
      "펌웨어 업데이트는 특정 문제를 해결할 수 있지만 새로운 버그를 유발할 수도 있으므로 변경 로그를 검토하고 필요할 때만 업데이트하는 것이 중요합니다.",
      "대화는 펌웨어 업데이트에 대한 다양한 경험과 의견을 강조하며, 신중함의 필요성과 펌웨어를 업데이트하거나 업데이트하지 않을 경우의 잠재적 결과를 강조합니다."
    ],
    "points": 127,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1725265246
  },
  {
    "id": 41425563,
    "title": "숙고하다: 뇌가 '오프라인' 상태에서도 많은 경험을 처리하는 방법",
    "originLink": "https://news.yale.edu/2024/08/14/sleep-it-how-brain-processes-many-experiences-even-when-offline",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425563",
    "commentBody": "",
    "originSummary": [
      "예일 연구원들은 해마가 수면 중에 깨어 있는 동안의 경험을 재생하고 묶어서 기억으로 저장하여 기억 인코딩과 회상을 향상시킨다는 것을 발견했습니다.",
      "이 연구는 Nature Neuroscience에 게재되었으며, 뇌가 최대 15개의 관련 없는 경험을 초단위 프레임으로 압축하여 네트워크 용량과 효율성을 향상시킬 수 있음을 보여주었습니다.",
      "발견된 바에 따르면, 첫 번째와 가장 최근의 경험이 가장 강한 표상을 가지는 일련의 위치 효과가 나타났으며, 이는 기억 형성과 인지 과정에 대한 통찰을 제공합니다."
    ],
    "commentSummary": [
      "뇌는 수면 중에 해마 재생을 통해 경험을 처리하여 기억 통합과 문제 해결을 돕습니다.",
      "인지 피로는 뇌가 기억을 재생하도록 유도하며, 이는 휴식이 학습과 인지 기능에 중요하다는 것을 시사합니다.",
      "휴식 취하기, 걷기, 명상과 같은 기법들이 학습과 문제 해결을 최적화하는 전략으로 논의됩니다."
    ],
    "points": 116,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725286628
  },
  {
    "id": 41425259,
    "title": "DOjS – 사운드가 포함된 DOS 자바스크립트 캔버스",
    "originLink": "https://github.com/SuperIlu/DOjS",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425259",
    "commentBody": "",
    "originSummary": [
      "DOjS는 MS-DOS, FreeDOS 또는 DOS 기반 Windows를 위해 설계된 JavaScript 프로그래밍 환경으로, 통합 편집기, 그래픽, 사운드 출력 및 마우스, 키보드, 조이스틱 입력 지원 기능을 갖추고 있습니다.",
      "p5js와의 호환성을 제공하여 DOS 명령 프롬프트에서 스크립트를 작성하고 실행할 수 있으며, 2D/3D 그래픽, 오디오 샘플링, IPX/TCP/IP 네트워킹을 포함한 다양한 멀티미디어 및 네트워킹 기능을 지원합니다.",
      "DOjS는 DOSBox, 실제 하드웨어 또는 가상 머신에서 실행할 수 있으며, 최소한 4MB RAM을 갖춘 386이 필요하지만, 최적의 성능을 위해서는 32MB RAM을 갖춘 펜티엄급 기계를 권장합니다."
    ],
    "commentSummary": [
      "DOjS는 개발자가 캔버스 요소를 사용하여 사운드 및 그래픽을 포함한 DOS용 애플리케이션을 만들 수 있게 해주는 JavaScript 프레임워크입니다.",
      "최소한 4MB의 RAM을 가진 Intel 80386이 필요하지만, 더 나은 성능을 위해 32MB RAM을 가진 펜티엄급 기계를 권장합니다.",
      "개발자는 스크립트와 자산을 ZIP 파일로 패키징하여 DOJS.EXE와 함께 배포할 수 있으며, 이를 통해 MS-DOS용 Mastodon 클라이언트인 DOStodon과 같은 실제 애플리케이션을 만들 수 있습니다."
    ],
    "points": 113,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1725283989
  },
  {
    "id": 41425383,
    "title": "그들은 더 이상 그렇게 만들지 않는다: 3.5mm 헤드폰 잭 소켓",
    "originLink": "https://kevinboone.me/headphonejack.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425383",
    "commentBody": "",
    "originSummary": [
      "3.5mm 헤드폰 잭은 더 나은 음질, 다양한 기기와의 호환성, 그리고 음악을 들으면서 휴대폰을 충전할 수 있는 기능을 제공하여 무선 대안보다 더 신뢰할 수 있고 편리합니다.",
      "애플, 삼성, 구글과 같은 주요 제조업체들은 무선 오디오 기술을 추진하기 위해 헤드폰 잭을 제거하여 소비자의 편의성을 희생시키면서 재정적으로 이익을 보고 있습니다.",
      "소비자들은 여전히 Motorola, Asus, Sony와 같은 브랜드의 3.5mm 잭이 있는 휴대폰을 찾을 수 있으며, Apple, Samsung, Google의 구형 모델을 선택할 수도 있습니다."
    ],
    "commentSummary": [
      "대부분의 최신 휴대폰에서 3.5mm 헤드폰 잭이 제거되면서 오디오 공유 및 다른 장치와의 연결이 더 번거로워졌습니다.",
      "블루투스 헤드폰은 인기가 있지만, 유선 헤드폰에 비해 배터리 수명 제한, 연결 문제, 그리고 열등한 마이크 품질과 같은 문제를 겪고 있습니다.",
      "많은 사용자가 여전히 단순성, 신뢰성 및 우수한 음질 때문에 헤드폰 잭이 있는 휴대전화를 선호합니다."
    ],
    "points": 107,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1725285097
  },
  {
    "id": 41420112,
    "title": "‘경악스러운’ 가짜 AMD Ryzen 7 7800X3D 칩 조사 중 – 구매자 주의",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/mindblowing-fake-amd-ryzen-7-7800x3d-chip-investigated-buyers-beware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420112",
    "commentBody": "",
    "originSummary": [
      "TechTuber Der8auer는 한 팬이 루마니아의 마켓플레이스인 OLX에서 구입한 가짜 AMD Ryzen 7 7800X3D CPU를 폭로하며, 검증되지 않은 출처에서 기술 제품을 구매하는 것의 위험성을 강조했습니다.",
      "가짜 CPU에는 잘못된 기판 색상, 커패시터에 보호 수지가 없고, 얇은 PCB와 덮개를 벗겼을 때 실제 실리콘이 없는 등 여러 가지 명백한 징후가 있었습니다.",
      "Der8auer는 위조품의 품질을 칭찬했지만, 구매자들에게 주의할 것을 경고하며 이러한 사기를 피하기 위해 신뢰할 수 있는 출처에서 구매하는 것이 중요하다고 강조했습니다."
    ],
    "commentSummary": [
      "가짜 AMD Ryzen 7 7800X3D 칩, 본질적으로 작동하지 않는 금속/플라스틱 조각이 조사 중에 있으며, 구매자 주의가 요구되고 있습니다.",
      "이 사기는 보증 사기와 그러한 사기성 비즈니스 모델의 지속 불가능한 특성에 대한 논의를 촉발시켰습니다.",
      "Aliexpress와 OLX와 같은 플랫폼에서 위조 제품의 만연과 사기 거래에 대해 구매자가 겪는 어려움도 강조되고 있습니다."
    ],
    "points": 98,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1725222670
  },
  {
    "id": 41421591,
    "title": "귀납적 또는 연역적? LLM의 기본 추론 능력 재고",
    "originLink": "https://arxiv.org/abs/2408.00114",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421591",
    "commentBody": "",
    "originSummary": [
      "이 연구는 대형 언어 모델(LLM)에서 연역적 추론과 귀납적 추론의 차이를 탐구하며, 이는 이전에 철저히 검토되지 않은 주제입니다.",
      "연구자들은 LLM의 귀납적 추론을 평가하기 위해 SolverLearner 프레임워크를 도입했으며, LLM이 귀납적 과제에서 뛰어난 성과를 보이지만, 특히 반사실적 시나리오에서 연역적 추론에는 어려움을 겪는다는 것을 발견했습니다.",
      "이 연구는 다양한 유형의 추론에서 LLM의 강점과 약점을 강조하여 AI 모델의 향후 개선을 위한 통찰력을 제공하기 때문에 중요합니다."
    ],
    "commentSummary": [
      "논쟁의 중심은 GPT와 같은 대형 언어 모델(LLM)이 진정으로 추론을 하는지 아니면 단순히 학습된 데이터에서 배운 패턴을 되풀이하는지에 관한 것이다.",
      "일부는 LLM이 통계적 텍스트 생성기일 뿐 진정한 추론을 할 수 없다고 주장하는 반면, 다른 사람들은 이들이 귀납적 또는 연역적 추론을 수행할 수 있는 능력에 대해 논의합니다.",
      "이 대화는 또한 LLM의 한계와 개선 가능성이 있는 영역을 강조합니다."
    ],
    "points": 89,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1725238146
  },
  {
    "id": 41422283,
    "title": "Awk 구문 분석은 까다롭다",
    "originLink": "https://www.raygard.net/awkdoc/pages/awk_parsing_is_tricky.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422283",
    "commentBody": "",
    "originSummary": [
      "awk 프로그래밍 언어를 구문 분석하는 것은 복잡하며, 그 문법과 의미는 yacc 전문가에게도 도전 과제가 됩니다.",
      "다양한 awk 버전은 구문 분석에서 일관성이 없어서 동일한 코드에 대해 다른 결과를 초래하며, 이는 원래 awk 문법의 모호성을 부각시킵니다.",
      "아놀드 로빈스(gawk 유지자)와 벤 호이트(goawk)와 같은 저명한 인물들은 이러한 불일치를 인식하고, 이를 yacc 파싱의 결정론적 특성과 충돌 해결에 기인한다고 설명합니다."
    ],
    "commentSummary": [
      "이 논의는 프로그래머와 시스템 관리자에게 Awk를 배우는 것이 중요하다는 점을 강조하며, 텍스트 조작 작업에 있어 그 단순성과 효율성을 강조합니다.",
      "Awk와 Perl 및 Python과 같은 다른 스크립팅 언어들 간의 비교가 이루어지며, Awk의 간결한 문법과 Unix 계열 시스템에서 기본적으로 제공되는 점이 빠르고 간단한 작업에 특히 유용하다는 점이 언급됩니다.",
      "대화는 또한 언어를 구문 분석하는 데 있어서의 어려움에 대해 다루고 있으며, 일부 사용자는 이해와 유지보수의 용이성을 이유로 yacc와 같은 구문 분석기 생성기보다 직접 작성한 구문 분석기를 옹호하고 있습니다."
    ],
    "points": 88,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1725246276
  },
  {
    "id": 41421325,
    "title": "더블린 코어, 그것은 무엇에 유용한가요?",
    "originLink": "https://www.thisdaysportion.com/posts/dublin-core-what-is-it-good-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421325",
    "commentBody": "",
    "originSummary": [
      "Open Graph, Schema.org, 마이크로포맷, 더블린 코어와 같은 메타 스키마는 웹 페이지에 구조화된 정보를 삽입하여 컴퓨터가 데이터를 쉽게 찾을 수 있도록 합니다.",
      "Open Graph는 소셜 미디어에서 널리 채택되고 있으며, Schema.org는 Google 검색 스니펫에 선호됩니다; 서비스에 따라 여러 스키마를 사용하는 것이 필요할 수 있습니다.",
      "메타 스키마는 읽기 나중에 서비스, 소셜 미디어 스니펫 및 학술 서비스에서 사용되며, 다양한 플랫폼에서 지원 수준이 다릅니다."
    ],
    "commentSummary": [
      "더블린 코어(DC)는 90년대에 메타데이터와 스키마 분야에서 중요한 역할을 했으며, 박물관에서 사이트 간 검색 가능한 자산을 목표로 했지만, 글로벌 포털은 실현되지 않았습니다.",
      "오늘날, 복잡한 표준을 사용하는 것과 더 간단한 마이크로포맷을 사용하는 것 사이에 논쟁이 있으며, 우수한 검색 엔진과 인공지능이 상세한 메타데이터의 필요성을 줄이고 있습니다.",
      "DC는 실질적인 구현이 제한적임에도 불구하고 Museums Data Service와 TANC와 같은 프로젝트에서 여전히 관련성이 있으며, Omeka-S와 DSpace와 같은 플랫폼에서 사용되고 있습니다."
    ],
    "points": 88,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1725234904
  }
]
