[
  {
    "id": 41422311,
    "title": "1M Pengguna",
    "originLink": "https://blog.spacehey.com/entry?id=1245177",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422311",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Seorang siswa sekolah menengah mengembangkan SpaceHey, sebuah situs media sosial yang mengingatkan pada MySpace, menggunakan teknologi dasar seperti vanilla PHP, HTML, dan MySQL, dan telah mencapai 1 juta pengguna.",
      "SpaceHey menghindari masalah media sosial modern seperti iklan dan algoritma, menawarkan kesederhanaan dan kustomisasi, yang menarik bagi pengguna.",
      "Kajian di Hacker News berfokus pada tumpukan teknologi situs, pengalaman pengguna, dan implikasi yang lebih luas untuk desain media sosial, dengan perdebatan tentang nostalgia dan keunggulan platform."
    ],
    "points": 668,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725246788
  },
  {
    "id": 41420597,
    "title": "Optimisasi Boot Pi Ekstrem",
    "originLink": "https://kittenlabs.de/blog/2024/09/01/extreme-pi-boot-optimization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420597",
    "commentBody": "",
    "originSummary": [
      "Proyek SolarCamPi mengoptimalkan waktu boot Raspberry Pi Zero 2 W menjadi 3,5 detik untuk meningkatkan efisiensi energi dalam sistem kamera bertenaga surya.",
      "Optimasi utama termasuk menonaktifkan fitur perangkat keras yang tidak perlu, mengatur ulang pengaturan CPU, dan menggunakan kernel khusus yang telah dipangkas.",
      "Perubahan ini menghasilkan pengurangan konsumsi energi hingga lima kali lipat, menunjukkan peningkatan signifikan dalam waktu boot dan efisiensi daya."
    ],
    "commentSummary": [
      "Optimasi Boot Extreme Pi melibatkan penggabungan aplikasi dalam initramfs yang terhubung ke kernel, menghindari pemasangan filesystem, dan berpotensi menggantikan BusyBox init dengan skrip bash sederhana.",
      "Teknik yang dibahas meliputi menonaktifkan modul kernel yang tidak diperlukan, menggunakan kompresi zstd, dan menguji dengan chroot untuk mengoptimalkan waktu boot.",
      "Konsultasi tersebut menyoroti masalah konsumsi daya pada perangkat keras Raspberry Pi dibandingkan dengan alternatif seperti Google Coral dan ESP32, menekankan perlunya strategi manajemen daya dan boot yang efisien."
    ],
    "points": 472,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1725226615
  },
  {
    "id": 41421846,
    "title": "OrbStack: Cara cepat, ringan, dan mudah untuk menjalankan kontainer Docker dan Linux",
    "originLink": "https://orbstack.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421846",
    "commentBody": "",
    "originSummary": [
      "OrbStack memperkenalkan alternatif yang ringan dan efisien untuk Docker Desktop, yang dirancang untuk meminimalkan penggunaan memori dan CPU sambil menyediakan kemampuan yang kuat untuk menjalankan kontainer Docker dan Linux.",
      "Fitur utama termasuk waktu startup yang cepat, konsumsi sumber daya yang rendah, integrasi mulus dengan CLI dan berbagi file, serta dukungan untuk menjalankan kontainer x86 pada Apple Silicon menggunakan Rosetta.",
      "Produk ini telah mendapatkan umpan balik positif dari para pengembang karena peningkatan kinerjanya, terutama pada Mac M1/M2, menjadikannya pilihan menarik bagi mereka yang mencari solusi manajemen kontainer yang lebih efisien."
    ],
    "commentSummary": [
      "OrbStack adalah alat baru untuk menjalankan kontainer Docker dan Linux di macOS, menawarkan peningkatan kinerja yang signifikan dibandingkan Docker Desktop.",
      "Pengguna melaporkan bahwa OrbStack secara dramatis mengurangi waktu kompilasi dan memberikan pengalaman seperti WSL2 di macOS, menjadikannya pilihan menarik bagi para pengembang.",
      "Meskipun ada beberapa masalah dengan perangkat lunak cadangan dan gambar disk yang jarang, umpan balik pengguna secara keseluruhan menyoroti UI OrbStack yang halus, integrasi yang lebih baik, dan kinerja yang lebih cepat dibandingkan dengan alternatif seperti Colima dan Docker Desktop."
    ],
    "points": 251,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1725240956
  },
  {
    "id": 41424371,
    "title": "Defrag the Game",
    "originLink": "https://defrag-game.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41424371",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Game baru berjudul 'Defrag the Game' telah dirilis, terinspirasi oleh konsep defragmentasi hard drive tetapi tidak dimaksudkan untuk menjadi simulasi yang realistis.",
      "Para pemain merasa bingung dengan permainan ini karena kurangnya petunjuk dan perbedaan dari proses defragmentasi disk yang sebenarnya, yang mengakibatkan umpan balik yang beragam.",
      "Permainan ini dibangun menggunakan React, dan meskipun beberapa pengguna menikmatinya, yang lain melaporkan masalah kinerja dan mekanisme penilaian yang tidak jelas."
    ],
    "points": 217,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1725275302
  },
  {
    "id": 41422126,
    "title": "Pembuat Kuil Jepang Kongō Gumi, Telah Bertahan Hampir 1.500 Tahun",
    "originLink": "https://www.openculture.com/2024/08/how-the-oldest-company-in-the-world-has-survived-nearly-1500-years.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422126",
    "commentBody": "",
    "originSummary": [
      "Kongō Gumi, perusahaan tertua di dunia yang terus beroperasi, telah berbisnis selama hampir 1.500 tahun, awalnya didirikan pada tahun 578 untuk membangun kuil Buddha pertama di Jepang, Shitennō-ji.",
      "Keluarga Kongō telah mengelola perusahaan ini selama 40 generasi dan telah beradaptasi dengan berbagai tantangan dengan mendiversifikasi bisnisnya, termasuk pembuatan peti mati.",
      "Kongō Gumi menjadi anak perusahaan Takamatsu Construction Group pada tahun 2006 tetapi tetap melanjutkan keahlian tradisionalnya dalam konstruksi kuil dengan menggunakan teknik modern."
    ],
    "commentSummary": [
      "Perusahaan pembangun kuil Jepang, Kongō Gumi, beroperasi selama hampir 1.500 tahun sebelum diakuisisi dan menyatakan bangkrut pada tahun 2006 karena tantangan keuangan.",
      "Penurunan perusahaan dipengaruhi oleh rekayasa keuangan, persaingan, dan struktur unik ekonomi Jepang.",
      "Kajian ini menyoroti implikasi yang lebih luas bagi perusahaan yang bertahan lama, bisnis keluarga, dan dampak faktor budaya serta ekonomi terhadap keberlangsungan bisnis."
    ],
    "points": 202,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725243919
  },
  {
    "id": 41421650,
    "title": "Tsbp – bahasa pemrosesan sumber berbasis treesitter",
    "originLink": "https://git.peppe.rs/languages/tbsp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421650",
    "commentBody": "",
    "originSummary": [
      "Cabang master dari bahasa pemrosesan sumber berbasis pohon (tbsp) telah melihat beberapa komitmen terbaru oleh Akshay, menunjukkan pengembangan yang aktif.",
      "Perubahan penting termasuk penambahan daftar dan ekspresi indeks, penyimpanan node sebagai `usize` (tipe bilangan bulat tanpa tanda dalam Rust), dan pengenalan fungsi `string::substr`.",
      "Perbaikan signifikan pada dokumentasi dan kegunaan telah dilakukan, seperti menambahkan peta jalan penggunaan ke README dan mengganti nama proyek dari \"trawk\" menjadi \"tbsp\"."
    ],
    "commentSummary": [
      "Tbsp adalah bahasa pemrosesan sumber daya yang didasarkan pada Treesitter, sebuah alat untuk mengurai dan menganalisis kode.",
      "Pengguna sedang mendiskusikan kebutuhan akan API tingkat tinggi untuk kasus penggunaan non-editor dan ketiadaan struktur tata bahasa standar.",
      "Alat seperti tree-sitter-graph, ast-grep, dan proyek terkait seperti Semgrep disarankan untuk penanganan dan visualisasi tata bahasa yang lebih baik."
    ],
    "points": 191,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1725239056
  },
  {
    "id": 41423303,
    "title": "Saluran Telepon Tanaman Luar Pedesaan",
    "originLink": "http://cityinfrastructure.com/single.php?d=RuralOutsidePlant&t=Rural%20Outside%20Plant",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423303",
    "commentBody": "",
    "originSummary": [
      "Tanaman luar pedesaan melibatkan kabel dan peralatan perusahaan telepon yang menghubungkan rumah ke Kantor Pusat, dengan perbedaan mencolok seperti Kantor Pusat yang lebih kecil dan jarak kabel yang lebih panjang.",
      "Komponen utama meliputi Antarmuka Kabel yang Dihubungkan (JWI) untuk membagi kabel dengan jumlah pasangan tinggi, kabel feeder, tiang utilitas, dan penutup sambungan untuk mendistribusikan kabel.",
      "Peralatan canggih seperti pengulang T1 dan penutup HRE-458 HiGain Remote Therm-O-Nator digunakan untuk memperkuat sinyal digital dan mengelola pelepasan panas."
    ],
    "commentSummary": [
      "Diskusi ini menyoroti transisi dari sistem telepon berbasis tembaga tradisional ke serat optik modern, menekankan manfaat serat optik dalam hal kecepatan dan keandalan.",
      "Pengguna berbagi pengalaman pribadi dan wawasan tentang berbagai teknologi telekomunikasi, termasuk ISDN, DSL, dan serat optik, serta dampaknya terhadap konektivitas dan kualitas layanan.",
      "Percakapan tersebut juga menyentuh tantangan dan keunikan infrastruktur telekomunikasi pedesaan dan perkotaan, seperti penggunaan kumparan pemuatan, pemberian tekanan pada kabel, dan penggantian tembaga dengan serat optik untuk mencegah pencurian."
    ],
    "points": 148,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1725261688
  },
  {
    "id": 41423577,
    "title": "Kenaikan versi Firmware HDD NAS Toshiba di Linux",
    "originLink": "https://syscall.eu/blog/2024/08/28/toshiba_hdd_firmware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423577",
    "commentBody": "",
    "originSummary": [
      "Seorang pengguna berhasil melakukan rekayasa balik pada pembaruan firmware HDD Toshiba agar dapat berfungsi di Linux, yang awalnya hanya tersedia untuk Windows.",
      "Proses yang terlibat meliputi mengekstraksi file pembaruan, memahami proses flashing, dan menggunakan perintah Linux tertentu untuk memperbarui firmware.",
      "Prestasi ini memungkinkan pengguna Linux untuk memperbarui firmware Toshiba NAS HDD mereka tanpa bergantung pada alat Windows."
    ],
    "commentSummary": [
      "Diskusi berpusat pada pentingnya dan risiko memperbarui firmware Toshiba NAS HDD di Linux.",
      "Pembaruan firmware dapat menyelesaikan masalah tertentu tetapi juga dapat memperkenalkan bug baru, sehingga penting untuk meninjau changelog dan memperbarui hanya jika diperlukan.",
      "Percakapan tersebut menyoroti berbagai pengalaman dan pendapat tentang pembaruan firmware, menekankan perlunya kehati-hatian dan potensi konsekuensi baik dari memperbarui maupun tidak memperbarui firmware."
    ],
    "points": 127,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1725265246
  },
  {
    "id": 41425563,
    "title": "Tidur dulu: Bagaimana otak memproses banyak pengalaman – bahkan ketika 'offline'",
    "originLink": "https://news.yale.edu/2024/08/14/sleep-it-how-brain-processes-many-experiences-even-when-offline",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425563",
    "commentBody": "",
    "originSummary": [
      "Kemudian peneliti dari Yale menemukan bahwa hippocampus memutar ulang dan menggabungkan pengalaman saat bangun menjadi ingatan selama tidur, meningkatkan pengkodean dan pengingatan memori.",
      "Studi yang diterbitkan di Nature Neuroscience menunjukkan bahwa otak dapat mengompresi hingga 15 pengalaman yang tidak terkait ke dalam bingkai sub-detik, meningkatkan kapasitas dan efisiensi jaringan.",
      "Temuan mengungkapkan adanya efek posisi serial, di mana pengalaman pertama dan terbaru memiliki representasi terkuat, memberikan wawasan tentang pembentukan memori dan proses kognitif."
    ],
    "commentSummary": [
      "Selama tidur, otak memproses pengalaman melalui pemutaran ulang hipokampus, yang membantu dalam konsolidasi memori dan pemecahan masalah.",
      "Kelelahan kognitif memicu otak untuk memutar ulang ingatan, menunjukkan bahwa istirahat sangat penting untuk pembelajaran dan fungsi kognitif.",
      "Teknik seperti mengambil istirahat, berjalan, atau meditasi dibahas sebagai strategi untuk mengoptimalkan pembelajaran dan pemecahan masalah."
    ],
    "points": 116,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725286628
  },
  {
    "id": 41425259,
    "title": "DOjS – Kanvas JavaScript DOS dengan Suara",
    "originLink": "https://github.com/SuperIlu/DOjS",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425259",
    "commentBody": "",
    "originSummary": [
      "DOjS adalah lingkungan pemrograman JavaScript yang dirancang untuk MS-DOS, FreeDOS, atau Windows berbasis DOS, yang menampilkan editor terintegrasi, grafik, output suara, dan dukungan input untuk mouse, keyboard, dan joystick.",
      "Itu menawarkan kompatibilitas dengan p5js, memungkinkan skrip ditulis dan dijalankan dari prompt perintah DOS, dan mendukung berbagai fungsi multimedia dan jaringan, termasuk grafik 2D/3D, pengambilan sampel audio, dan jaringan IPX/TCP/IP.",
      "DOjS dapat dijalankan di DOSBox, perangkat keras asli, atau mesin virtual, membutuhkan setidaknya 386 dengan RAM 4MB, meskipun mesin kelas Pentium dengan RAM 32MB direkomendasikan untuk kinerja optimal."
    ],
    "commentSummary": [
      "KERANGKA DOjS adalah sebuah kerangka kerja JavaScript yang memungkinkan pengembang untuk membuat aplikasi untuk DOS, termasuk suara dan grafis, menggunakan elemen kanvas.",
      "Itu memerlukan setidaknya Intel 80386 dengan 4MB RAM, tetapi mesin kelas Pentium dengan 32MB RAM direkomendasikan untuk kinerja yang lebih baik.",
      "Pengembang dapat mengemas skrip dan aset ke dalam file ZIP dan mengirimkannya dengan DOJS.EXE, memungkinkan pembuatan aplikasi nyata seperti DOStodon, sebuah klien Mastodon untuk MS-DOS."
    ],
    "points": 113,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1725283989
  },
  {
    "id": 41425383,
    "title": "Mereka tidak membuatnya seperti itu lagi: soket jack headphone 3,5mm",
    "originLink": "https://kevinboone.me/headphonejack.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425383",
    "commentBody": "",
    "originSummary": [
      "Konektor headphone 3.5mm menawarkan kualitas suara yang lebih baik, kompatibilitas dengan berbagai perangkat, dan kemampuan untuk mengisi daya ponsel sambil mendengarkan, menjadikannya lebih andal dan nyaman dibandingkan alternatif nirkabel.",
      "Produsen besar seperti Apple, Samsung, dan Google telah menghilangkan jack headphone untuk mendorong teknologi audio nirkabel, yang menguntungkan secara finansial dengan mengorbankan kenyamanan konsumen.",
      "Konsumen masih dapat menemukan ponsel dengan jack 3.5mm dari merek seperti Motorola, Asus, dan Sony, atau memilih model lama dari Apple, Samsung, dan Google."
    ],
    "commentSummary": [
      "Penghapusan jack headphone 3.5mm dari sebagian besar ponsel modern telah membuat berbagi audio dan menghubungkan ke perangkat lain menjadi lebih merepotkan.",
      "Headphone Bluetooth, meskipun populer, menghadapi masalah seperti masa pakai baterai yang terbatas, masalah konektivitas, dan kualitas mikrofon yang lebih rendah dibandingkan dengan headphone berkabel.",
      "Banyak pengguna masih lebih memilih ponsel dengan jack headphone karena kesederhanaannya, keandalannya, dan kualitas suara yang superior."
    ],
    "points": 107,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1725285097
  },
  {
    "id": 41420112,
    "title": "Chip AMD Ryzen 7 7800X3D palsu yang 'mengejutkan' sedang diselidiki – pembeli waspada",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/mindblowing-fake-amd-ryzen-7-7800x3d-chip-investigated-buyers-beware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420112",
    "commentBody": "",
    "originSummary": [
      "TechTuber Der8auer mengungkapkan sebuah CPU AMD Ryzen 7 7800X3D palsu yang dibeli oleh seorang penggemar dari OLX, sebuah pasar di Rumania, menyoroti risiko membeli teknologi dari sumber yang tidak terverifikasi.",
      "Kompiler palsu memiliki beberapa tanda yang mencolok, seperti warna substrat yang salah, tidak adanya resin pelindung pada kapasitor, dan PCB yang lebih tipis, tanpa silikon yang sebenarnya saat dibuka.",
      "Der8auer memuji kualitas barang palsu tersebut tetapi memperingatkan pembeli untuk berhati-hati, menekankan pentingnya membeli dari sumber yang terpercaya untuk menghindari penipuan semacam itu."
    ],
    "commentSummary": [
      "Kepalsuan chip AMD Ryzen 7 7800X3D, yang pada dasarnya adalah sepotong logam/plastik yang tidak berfungsi, sedang diselidiki, meningkatkan kewaspadaan pembeli.",
      "Penipuan tersebut telah memicu diskusi tentang potensi penggunaannya untuk penipuan garansi dan sifat tidak berkelanjutan dari model bisnis curang semacam itu.",
      "Prevalensi produk palsu di platform seperti Aliexpress dan OLX, serta kesulitan yang dihadapi pembeli dalam memperdebatkan transaksi penipuan, juga disoroti."
    ],
    "points": 98,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1725222670
  },
  {
    "id": 41421591,
    "title": "Induktif atau Deduktif? Memikirkan Kembali Kemampuan Penalaran Fundamental LLM",
    "originLink": "https://arxiv.org/abs/2408.00114",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421591",
    "commentBody": "",
    "originSummary": [
      "Studi ini mengeksplorasi perbedaan antara penalaran deduktif dan induktif dalam Model Bahasa Besar (LLM), sebuah topik yang belum pernah diperiksa secara mendalam sebelumnya.",
      "Para peneliti memperkenalkan kerangka kerja SolverLearner untuk mengevaluasi penalaran induktif LLM, menemukan bahwa LLM berkinerja sangat baik dalam tugas induktif tetapi kesulitan dengan penalaran deduktif, terutama dalam skenario kontrafaktual.",
      "Penelitian ini penting karena menyoroti kekuatan dan kelemahan LLM dalam berbagai jenis penalaran, memberikan wawasan untuk perbaikan di masa depan pada model AI."
    ],
    "commentSummary": [
      "Kami berdebat tentang apakah Model Bahasa Besar (LLM) seperti GPT benar-benar melakukan penalaran atau hanya mengulang pola yang dipelajari dari data pelatihan mereka.",
      "Beberapa orang berpendapat bahwa LLM adalah generator teks statistik dan tidak mampu melakukan penalaran sejati, sementara yang lain membahas kemampuan mereka untuk melakukan penalaran induktif atau deduktif.",
      "Percakapan tersebut juga menyoroti keterbatasan LLM dan area potensial untuk perbaikan."
    ],
    "points": 89,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1725238146
  },
  {
    "id": 41422283,
    "title": "Memparsing Awk Itu Rumit",
    "originLink": "https://www.raygard.net/awkdoc/pages/awk_parsing_is_tricky.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422283",
    "commentBody": "",
    "originSummary": [
      "Memparsing bahasa pemrograman awk itu rumit, dengan tata bahasa dan maknanya yang menimbulkan tantangan bahkan bagi para ahli yacc.",
      "Berbagai versi awk menunjukkan ketidakkonsistenan dalam parsing, yang mengarah pada hasil yang berbeda untuk kode yang sama, menyoroti ambiguitas dalam tata bahasa awk asli.",
      "Tokoh-tokoh terkenal seperti Arnold Robbins (pemelihara gawk) dan Ben Hoyt (goawk) mengakui ketidakkonsistenan ini, mengaitkannya dengan sifat deterministik dari parsing yacc dan resolusi konflik."
    ],
    "commentSummary": [
      "Diskusi tersebut menyoroti pentingnya mempelajari Awk bagi para pemrogram dan administrator sistem, dengan menekankan kesederhanaan dan efisiensinya untuk tugas manipulasi teks.",
      "Perbandingan dibuat antara Awk dan bahasa skrip lainnya seperti Perl dan Python, mencatat bahwa sintaks Awk yang ringkas dan ketersediaannya yang sudah terpasang di sistem mirip Unix membuatnya sangat berguna untuk operasi cepat satu baris.",
      "Kami juga membahas tantangan dalam mem-parsing bahasa, dengan beberapa pengguna mendukung penggunaan parser buatan tangan dibandingkan generator parser seperti yacc, dengan alasan kemudahan pemahaman dan pemeliharaan."
    ],
    "points": 88,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1725246276
  },
  {
    "id": 41421325,
    "title": "Dublin Core, untuk apa itu berguna?",
    "originLink": "https://www.thisdaysportion.com/posts/dublin-core-what-is-it-good-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421325",
    "commentBody": "",
    "originSummary": [
      "Skema meta seperti Open Graph, Schema.org, microformats, dan Dublin Core menyematkan informasi terstruktur di halaman web, membuat data mudah ditemukan oleh komputer.",
      "Open Graph banyak diadopsi oleh media sosial, sementara Schema.org lebih disukai untuk cuplikan pencarian Google; menggunakan beberapa skema mungkin diperlukan tergantung pada layanan.",
      "Skema meta digunakan dalam layanan baca-nanti, cuplikan media sosial, dan layanan akademik, dengan tingkat dukungan yang bervariasi di berbagai platform."
    ],
    "commentSummary": [
      "Dublin Core (DC) sangat penting pada tahun 90-an untuk metadata dan skema di museum, dengan tujuan untuk aset yang dapat dicari lintas situs, tetapi portal global tidak pernah terwujud.",
      "Hari ini, ada perdebatan antara menggunakan standar yang kompleks dan mikroformat yang lebih sederhana, dengan mesin pencari yang baik dan AI mengurangi kebutuhan akan metadata yang terperinci.",
      "DC tetap relevan dalam proyek-proyek seperti Museums Data Service dan TANC, dan digunakan di platform seperti Omeka-S dan DSpace, meskipun penerapannya dalam praktik terbatas."
    ],
    "points": 88,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1725234904
  }
]
