[
  {
    "id": 41422311,
    "title": "1M Gebruikers",
    "originLink": "https://blog.spacehey.com/entry?id=1245177",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422311",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Een middelbare scholier ontwikkelde SpaceHey, een sociale mediasite die doet denken aan MySpace, met behulp van basistechnologieën zoals vanilla PHP, HTML en MySQL, en het heeft 1 miljoen gebruikers bereikt.",
      "SpaceHey vermijdt moderne sociale media-problemen zoals advertenties en algoritmen, en biedt eenvoud en aanpassing, wat gebruikers aantrekkelijk vinden.",
      "Discussies op Hacker News richten zich op de tech stack van de site, de gebruikerservaring en de bredere implicaties voor het ontwerp van sociale media, met debatten over nostalgie en de verdiensten van het platform."
    ],
    "points": 668,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725246788
  },
  {
    "id": 41420597,
    "title": "Extreme Pi Boot Optimalisatie",
    "originLink": "https://kittenlabs.de/blog/2024/09/01/extreme-pi-boot-optimization/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420597",
    "commentBody": "",
    "originSummary": [
      "Het SolarCamPi-project optimaliseerde de opstarttijd van de Raspberry Pi Zero 2 W tot 3,5 seconden om de energie-efficiëntie in een door zonne-energie aangedreven camerasysteem te verbeteren.",
      "Belangrijke optimalisaties omvatten het uitschakelen van onnodige hardwarefuncties, het aanpassen van CPU-instellingen en het gebruik van een aangepaste uitgeklede kernel.",
      "Deze veranderingen resulteerden in een vijfvoudige vermindering van het energieverbruik, wat aanzienlijke verbeteringen in zowel de opstarttijd als de energie-efficiëntie aantoont."
    ],
    "commentSummary": [
      "Extreme Pi Boot Optimization houdt in dat applicaties worden gebundeld in een initramfs dat aan de kernel is gekoppeld, waardoor bestandssysteem-mounts worden vermeden, en mogelijk BusyBox init wordt vervangen door een eenvoudig bash-script.",
      "Technieken die worden besproken omvatten het uitschakelen van onnodige kernelmodules, het gebruik van zstd-compressie en het testen met chroot om de opstarttijden te optimaliseren.",
      "Het gesprek benadrukt problemen met het stroomverbruik van Raspberry Pi-hardware in vergelijking met alternatieven zoals Google Coral en ESP32, waarbij de nadruk ligt op de noodzaak van efficiënte opstart- en stroombeheerstrategieën."
    ],
    "points": 472,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1725226615
  },
  {
    "id": 41421846,
    "title": "OrbStack: De snelle, lichte en gemakkelijke manier om Docker-containers en Linux uit te voeren",
    "originLink": "https://orbstack.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421846",
    "commentBody": "",
    "originSummary": [
      "OrbStack introduceert een lichtgewicht en efficiënt alternatief voor Docker Desktop, ontworpen om het geheugen- en CPU-gebruik te minimaliseren en tegelijkertijd robuuste mogelijkheden te bieden voor het draaien van Docker-containers en Linux.",
      "Belangrijke kenmerken zijn onder andere snelle opstarttijden, laag hulpbronnenverbruik, naadloze integratie met CLI en bestandsdeling, en ondersteuning voor het uitvoeren van x86-containers op Apple Silicon met behulp van Rosetta.",
      "Het product heeft positieve feedback gekregen van ontwikkelaars vanwege de prestatieverbeteringen, vooral op M1/M2 Macs, waardoor het een aantrekkelijke optie is voor degenen die op zoek zijn naar een efficiëntere containerbeheeroplossing."
    ],
    "commentSummary": [
      "OrbStack is een nieuw hulpmiddel voor het uitvoeren van Docker-containers en Linux op macOS, met aanzienlijke prestatieverbeteringen ten opzichte van Docker Desktop.",
      "Gebruikers melden dat OrbStack de compileertijden drastisch vermindert en een WSL2-achtige ervaring biedt op macOS, waardoor het een aantrekkelijke optie is voor ontwikkelaars.",
      "Ondanks enkele problemen met back-upsoftware en schaarse schijfkopieringen, benadrukt de algemene gebruikersfeedback OrbStack's gepolijste UI, betere integratie en snellere prestaties in vergelijking met alternatieven zoals Colima en Docker Desktop."
    ],
    "points": 251,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1725240956
  },
  {
    "id": 41424371,
    "title": "Defrag the Game",
    "originLink": "https://defrag-game.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41424371",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Er is een nieuw spel uitgebracht genaamd 'Defrag the Game', geïnspireerd door het concept van harde schijf defragmentatie, maar niet bedoeld als een realistische simulatie.",
      "Spelers hebben het spel verwarrend gevonden vanwege een gebrek aan instructies en verschillen met de daadwerkelijke schijfdefragmentatieprocessen, wat heeft geleid tot gemengde feedback.",
      "Het spel is gebouwd met React, en hoewel sommige gebruikers ervan genieten, hebben anderen prestatieproblemen en onduidelijke scoremechanismen gemeld."
    ],
    "points": 217,
    "commentCount": 88,
    "retryCount": 0,
    "time": 1725275302
  },
  {
    "id": 41422126,
    "title": "Japan's Temple-Builder Kongō Gumi, heeft bijna 1.500 jaar overleefd",
    "originLink": "https://www.openculture.com/2024/08/how-the-oldest-company-in-the-world-has-survived-nearly-1500-years.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422126",
    "commentBody": "",
    "originSummary": [
      "Kongō Gumi, het oudste continu opererende bedrijf ter wereld, is al bijna 1.500 jaar actief en werd oorspronkelijk opgericht in 578 om de eerste boeddhistische tempel van Japan, Shitennō-ji, te bouwen.",
      "Het bedrijf is beheerd door 40 generaties van de Kongō-familie en heeft zich aangepast aan verschillende uitdagingen door zijn activiteiten te diversifiëren, waaronder het maken van doodskisten.",
      "In 2006 werd Kongō Gumi een dochteronderneming van Takamatsu Construction Group, maar het blijft zijn traditionele vakmanschap in tempelbouw voortzetten met moderne technieken."
    ],
    "commentSummary": [
      "Japan's Kongō Gumi, een tempelbouwbedrijf, was bijna 1.500 jaar actief voordat het in 2006 werd overgenomen en failliet ging vanwege financiële uitdagingen.",
      "De achteruitgang van het bedrijf werd beïnvloed door financiële engineering, concurrentie en de unieke structuur van de Japanse economie.",
      "De discussie benadrukt de bredere implicaties voor langlevende bedrijven, familiebedrijven en de invloed van culturele en economische factoren op de levensduur van bedrijven."
    ],
    "points": 202,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1725243919
  },
  {
    "id": 41421650,
    "title": "Tbsp – op bomen gebaseerde bronverwerkingstaal",
    "originLink": "https://git.peppe.rs/languages/tbsp/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421650",
    "commentBody": "",
    "originSummary": [
      "De masterbranch van de boomgebaseerde bronverwerkingstaal (tbsp) heeft de laatste tijd verschillende commits van Akshay gezien, wat wijst op actieve ontwikkeling.",
      "Opmerkelijke updates omvatten de toevoeging van lijsten en indexuitdrukkingen, het opslaan van knooppunten als `usize` (een unsigned integer type in Rust), en de introductie van een `string::substr`-functie.",
      "Er werden aanzienlijke verbeteringen aangebracht in de documentatie en bruikbaarheid, zoals het toevoegen van een gebruiksroutekaart aan de README en het hernoemen van het project van 'trawk' naar 'tbsp'."
    ],
    "commentSummary": [
      "Tbsp is een bronverwerkingstaal gebaseerd op Treesitter, een hulpmiddel voor het parsen en analyseren van code.",
      "Gebruikers bespreken de behoefte aan een hoger niveau API voor niet-editor gebruiksscenario's en de afwezigheid van standaard grammaticale structuren.",
      "Tools zoals tree-sitter-graph, ast-grep en gerelateerde projecten zoals Semgrep worden voorgesteld voor een betere verwerking en visualisatie van grammatica's."
    ],
    "points": 191,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1725239056
  },
  {
    "id": 41423303,
    "title": "Telefoonlijn Landelijk Buiteninstallatie",
    "originLink": "http://cityinfrastructure.com/single.php?d=RuralOutsidePlant&t=Rural%20Outside%20Plant",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423303",
    "commentBody": "",
    "originSummary": [
      "Het landelijke buitenplant omvat de bekabeling en apparatuur van het telefoonbedrijf die huizen verbindt met het centrale kantoor, met opmerkelijke verschillen zoals kleinere centrale kantoren en langere kabelafstanden.",
      "Belangrijke componenten zijn onder andere Jumpered Wire Interfaces (JWI) voor het splitsen van kabels met een hoog aantal paren, voedingskabels, nutsmasten en lasbehuizingen voor het distribueren van kabels.",
      "Geavanceerde apparatuur zoals T1-repeaters en HRE-458 HiGain Remote Therm-O-Nator-behuizingen worden gebruikt om digitale signalen te versterken en warmteafvoer te beheren."
    ],
    "commentSummary": [
      "De discussie benadrukt de overgang van traditionele koperen telefoonsystemen naar moderne glasvezel, waarbij de voordelen van glasvezel op het gebied van snelheid en betrouwbaarheid worden benadrukt.",
      "Gebruikers delen persoonlijke ervaringen en inzichten over verschillende telecommunicatietechnologieën, waaronder ISDN, DSL en glasvezel, en hun impact op connectiviteit en servicekwaliteit.",
      "Het gesprek gaat ook over de uitdagingen en eigenaardigheden van de telecominfrastructuur op het platteland en in de stad, zoals het gebruik van laadspoelen, het onder druk zetten van kabels en het vervangen van koper door glasvezel om diefstal te voorkomen."
    ],
    "points": 148,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1725261688
  },
  {
    "id": 41423577,
    "title": "Het upgraden van de firmware van een Toshiba NAS HDD op Linux",
    "originLink": "https://syscall.eu/blog/2024/08/28/toshiba_hdd_firmware/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41423577",
    "commentBody": "",
    "originSummary": [
      "Een gebruiker heeft met succes een Toshiba HDD-firmware-updater omgekeerd ontworpen om op Linux te werken, oorspronkelijk alleen beschikbaar voor Windows.",
      "Het proces omvatte het extraheren van updatebestanden, het begrijpen van het flashproces en het gebruik van specifieke Linux-opdrachten om de firmware bij te werken.",
      "Deze prestatie stelt Linux-gebruikers in staat om de firmware van hun Toshiba NAS HDD bij te werken zonder afhankelijk te zijn van Windows-tools."
    ],
    "commentSummary": [
      "De discussie draait om het belang en de risico's van het updaten van Toshiba NAS HDD-firmware op Linux.",
      "Firmware-updates kunnen specifieke problemen oplossen, maar kunnen ook nieuwe bugs introduceren, waardoor het cruciaal is om changelogs te bekijken en alleen bij te werken wanneer dat nodig is.",
      "Het gesprek benadrukt verschillende ervaringen en meningen over firmware-updates, waarbij de noodzaak van voorzichtigheid en de mogelijke gevolgen van zowel het updaten als het niet updaten van firmware worden benadrukt."
    ],
    "points": 127,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1725265246
  },
  {
    "id": 41425563,
    "title": "Slaap er een nachtje over: Hoe de hersenen veel ervaringen verwerken – zelfs wanneer ze 'offline' zijn",
    "originLink": "https://news.yale.edu/2024/08/14/sleep-it-how-brain-processes-many-experiences-even-when-offline",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425563",
    "commentBody": "",
    "originSummary": [
      "Yale-onderzoekers ontdekten dat de hippocampus tijdens de slaap wakkere ervaringen herhaalt en bundelt tot herinneringen, waardoor het geheugen beter wordt gecodeerd en herinnerd.",
      "De studie, gepubliceerd in Nature Neuroscience, toonde aan dat de hersenen tot 15 niet-gerelateerde ervaringen kunnen comprimeren in sub-seconde frames, waardoor de netwerkcapaciteit en efficiëntie worden verbeterd.",
      "Bevindingen onthulden een seriële positie-effect, waarbij de eerste en meest recente ervaringen de sterkste representaties hadden, wat inzichten biedt in geheugenformatie en cognitieve processen."
    ],
    "commentSummary": [
      "De hersenen verwerken ervaringen tijdens de slaap door middel van hippocampale herhaling, wat helpt bij geheugenconsolidatie en probleemoplossing.",
      "Cognitieve vermoeidheid triggert de hersenen om herinneringen af te spelen, wat suggereert dat rust cruciaal is voor leren en cognitieve functies.",
      "Technieken zoals pauzes nemen, wandelen of mediteren worden besproken als strategieën om leren en probleemoplossing te optimaliseren."
    ],
    "points": 116,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1725286628
  },
  {
    "id": 41425259,
    "title": "DOjS – Een DOS JavaScript Canvas met Geluid",
    "originLink": "https://github.com/SuperIlu/DOjS",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425259",
    "commentBody": "",
    "originSummary": [
      "DOjS is een JavaScript-programmeeromgeving ontworpen voor MS-DOS, FreeDOS of DOS-gebaseerde Windows, met een geïntegreerde editor, grafische weergave, geluidsuitvoer en invoerondersteuning voor muis, toetsenbord en joystick.",
      "Het biedt compatibiliteit met p5js, waardoor scripts kunnen worden geschreven en uitgevoerd vanuit een DOS-opdrachtprompt, en ondersteunt verschillende multimedia- en netwerkfunctionaliteiten, waaronder 2D/3D-graphics, audiosampling en IPX/TCP/IP-netwerken.",
      "DOjS kan kjøre i DOSBox, ekte maskinvare eller virtuelle maskiner, og krever minst en 386 med 4MB RAM, selv om en Pentium-klasse maskin med 32MB RAM anbefales for optimal ytelse."
    ],
    "commentSummary": [
      "DOjS is een JavaScript-framework waarmee ontwikkelaars applicaties voor DOS kunnen maken, inclusief geluid en grafische elementen, met behulp van een canvas-element.",
      "Het vereist ten minste een Intel 80386 met 4MB RAM, maar een Pentium-klasse machine met 32MB RAM wordt aanbevolen voor betere prestaties.",
      "Ontwikkelaars kunnen scripts en middelen in een ZIP-bestand verpakken en het verzenden met DOJS.EXE, waardoor de creatie van echte toepassingen zoals DOStodon, een Mastodon-client voor MS-DOS, mogelijk wordt."
    ],
    "points": 113,
    "commentCount": 12,
    "retryCount": 0,
    "time": 1725283989
  },
  {
    "id": 41425383,
    "title": "Ze maken ze niet meer zoals vroeger: de 3,5 mm koptelefoonaansluiting",
    "originLink": "https://kevinboone.me/headphonejack.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41425383",
    "commentBody": "",
    "originSummary": [
      "De 3,5 mm koptelefoonaansluiting biedt betere geluidskwaliteit, compatibiliteit met verschillende apparaten en de mogelijkheid om de telefoon op te laden tijdens het luisteren, waardoor het betrouwbaarder en handiger is dan draadloze alternatieven.",
      "Belangrijke fabrikanten zoals Apple, Samsung en Google hebben de koptelefoonaansluiting verwijderd om draadloze audiotechnologie te promoten, wat hen financieel ten goede komt ten koste van het gemak voor de consument.",
      "Consumenten kunnen nog steeds telefoons met 3,5 mm-aansluitingen vinden van merken zoals Motorola, Asus en Sony, of kiezen voor oudere modellen van Apple, Samsung en Google."
    ],
    "commentSummary": [
      "Het verwijderen van 3,5 mm koptelefoonaansluitingen van de meeste moderne telefoons heeft het delen van audio en het verbinden met andere apparaten omslachtiger gemaakt.",
      "Bluetooth-koptelefoons, hoewel populair, hebben problemen zoals beperkte batterijlevensduur, verbindingsproblemen en inferieure microfoonkwaliteit vergeleken met bedrade koptelefoons.",
      "Veel gebruikers geven nog steeds de voorkeur aan telefoons met koptelefoonaansluitingen vanwege hun eenvoud, betrouwbaarheid en superieure geluidskwaliteit."
    ],
    "points": 107,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1725285097
  },
  {
    "id": 41420112,
    "title": "‘Mindblowing’ neppe AMD Ryzen 7 7800X3D-brikke undersøkt – kjøpere vær oppmerksomme",
    "originLink": "https://www.tomshardware.com/pc-components/cpus/mindblowing-fake-amd-ryzen-7-7800x3d-chip-investigated-buyers-beware",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41420112",
    "commentBody": "",
    "originSummary": [
      "TechTuber Der8auer onthulde een vervalste AMD Ryzen 7 7800X3D CPU die door een fan was gekocht via OLX, een Roemeense marktplaats, en benadrukte de risico's van het kopen van technologie van niet-geverifieerde bronnen.",
      "De nep-CPU had verschillende duidelijke tekenen, zoals onjuiste substraatkleur, gebrek aan beschermende hars op condensatoren, en een dunnere PCB, zonder daadwerkelijk silicium aanwezig bij het verwijderen van de deksel.",
      "Der8auer prees de kwaliteit van de vervalsing maar waarschuwde kopers om voorzichtig te zijn, waarbij hij het belang benadrukte van kopen bij gerenommeerde bronnen om dergelijke oplichting te vermijden."
    ],
    "commentSummary": [
      "Een vervalste AMD Ryzen 7 7800X3D-chip, in wezen een niet-functioneel stuk metaal/plastic, wordt onderzocht, wat de voorzichtigheid van kopers verhoogt.",
      "De oplichting heeft discussies aangewakkerd over het mogelijke gebruik ervan voor garantiefraude en de onhoudbare aard van dergelijke frauduleuze bedrijfsmodellen.",
      "De prevalentie van namaakproducten op platforms zoals Aliexpress en OLX, en de moeilijkheden die kopers ondervinden bij het betwisten van frauduleuze transacties, worden ook benadrukt."
    ],
    "points": 98,
    "commentCount": 43,
    "retryCount": 0,
    "time": 1725222670
  },
  {
    "id": 41421591,
    "title": "Inductief of Deductief? Heroverweging van de Fundamentele Redeneervaardigheden van LLM's",
    "originLink": "https://arxiv.org/abs/2408.00114",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421591",
    "commentBody": "",
    "originSummary": [
      "De studie onderzoekt het onderscheid tussen deductief en inductief redeneren in Grote Taalmodellen (LLM's), een onderwerp dat niet eerder grondig is onderzocht.",
      "Onderzoekers introduceerden het SolverLearner-raamwerk om de inductieve redenering van LLM's te evalueren, waarbij ze ontdekten dat LLM's uitzonderlijk goed presteren in inductieve taken, maar moeite hebben met deductieve redenering, vooral in contrafeitelijke scenario's.",
      "Dit onderzoek is significant omdat het de sterke en zwakke punten van LLM's in verschillende soorten redeneringen benadrukt, wat inzichten biedt voor toekomstige verbeteringen in AI-modellen."
    ],
    "commentSummary": [
      "De discussie draait om de vraag of Grote Taalmodellen (LLM's) zoals GPT echt redeneren of slechts geleerde patronen uit hun trainingsgegevens herhalen.",
      "Sommigen beweren dat LLM's statistische tekstgeneratoren zijn en niet in staat tot echt redeneren, terwijl anderen hun vermogen om inductief of deductief te redeneren bespreken.",
      "Het gesprek benadrukt ook de beperkingen van LLM's en mogelijke verbeteringsgebieden."
    ],
    "points": 89,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1725238146
  },
  {
    "id": 41422283,
    "title": "Awk parseren is lastig",
    "originLink": "https://www.raygard.net/awkdoc/pages/awk_parsing_is_tricky.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41422283",
    "commentBody": "",
    "originSummary": [
      "Het ontleden van de awk-programmeertaal is complex, met zijn grammatica en betekenis die zelfs voor yacc-experts uitdagingen vormen.",
      "Verschillende versies van awk vertonen inconsistenties in het parsen, wat leidt tot verschillende resultaten voor dezelfde code, wat de ambiguïteiten in de oorspronkelijke awk-grammatica benadrukt.",
      "Opmerkelijke figuren zoals Arnold Robbins (gawk-onderhouder) en Ben Hoyt (goawk) erkennen deze inconsistenties en schrijven ze toe aan de deterministische aard van yacc-parsing en conflictoplossing."
    ],
    "commentSummary": [
      "De discussie benadrukt het belang van het leren van Awk voor programmeurs en systeembeheerders, waarbij de nadruk ligt op de eenvoud en efficiëntie voor tekstmanipulatietaken.",
      "Er worden vergelijkingen gemaakt tussen Awk en andere scripttalen zoals Perl en Python, waarbij wordt opgemerkt dat Awk's beknopte syntaxis en ingebouwde beschikbaarheid op Unix-achtige systemen het bijzonder nuttig maken voor snelle, eenregelige bewerkingen.",
      "Het gesprek gaat ook over de uitdagingen van het ontleden van talen, waarbij sommige gebruikers pleiten voor handgemaakte parsers boven parsergenerators zoals yacc, met als argument dat ze gemakkelijker te begrijpen en te onderhouden zijn."
    ],
    "points": 88,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1725246276
  },
  {
    "id": 41421325,
    "title": "Dublin Core, waar is het goed voor?",
    "originLink": "https://www.thisdaysportion.com/posts/dublin-core-what-is-it-good-for",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41421325",
    "commentBody": "",
    "originSummary": [
      "Meta-schema's zoals Open Graph, Schema.org, microformats en Dublin Core integreren gestructureerde informatie in webpagina's, waardoor gegevens gemakkelijk vindbaar zijn voor computers.",
      "Open Graph wordt veel gebruikt door sociale media, terwijl Schema.org de voorkeur heeft voor Google-zoekfragmenten; het gebruik van meerdere schema's kan nodig zijn, afhankelijk van de dienst.",
      "Meta-schema's worden gebruikt in lees-het-later-diensten, sociale mediafragmenten en academische diensten, met verschillende niveaus van ondersteuning op verschillende platforms."
    ],
    "commentSummary": [
      "Dublin Core (DC) was cruciaal in de jaren 90 voor metadata en schema's in musea, met als doel doorzoekbare middelen over verschillende sites, maar een wereldwijd portaal kwam er nooit.",
      "Vandaag is er een debat tussen het gebruik van complexe standaarden en eenvoudigere microformaten, waarbij goede zoekmachines en AI de behoefte aan gedetailleerde metadata verminderen.",
      "DC blijft relevant in projecten zoals de Museums Data Service en TANC, en wordt gebruikt in platforms zoals Omeka-S en DSpace, ondanks dat de praktische implementatie ervan beperkt is."
    ],
    "points": 88,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1725234904
  }
]
