[
  {
    "id": 41640845,
    "title": "गूगल कैश पूरी तरह से समाप्त हो गया है",
    "originLink": "https://www.seroundtable.com/google-cache-dead-38112.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640845",
    "commentBody": "",
    "originSummary": [
      "Google ने पूरी तरह से Google Cache को निष्क्रिय कर दिया है, जो पहले उन पृष्ठों को एक्सेस करने के लिए उपयोग किया जाता था जब वे लोड होने में विफल रहते थे।",
      "अब उपयोगकर्ताओं को विकल्प के रूप में वेबैक मशीन या गूगल सर्च कंसोल में URL निरीक्षण उपकरण का उपयोग करने के लिए निर्देशित किया गया है।",
      "गूगल के सर्च लायजन, डैनी सुलिवन ने इस हटाने की पुष्टि की और इस बदलाव को दर्शाने के लिए दस्तावेज़ को अपडेट किया।"
    ],
    "commentSummary": [
      "गूगल कैश को पूरी तरह से बंद कर दिया गया है, जिससे पुराने या बदले हुए वेब सामग्री तक पहुंचने के बारे में चिंताएं बढ़ गई हैं।",
      "उपयोगकर्ता आशा करते हैं कि गूगल इंटरनेट आर्काइव का समर्थन करेगा, जो अब एक समान उद्देश्य की पूर्ति करता है।",
      "यह बंदी गूगल द्वारा सेवाओं को समाप्त करने की व्यापक प्रवृत्ति को दर्शाती है, जिससे उपयोगकर्ता विश्वास में गिरावट आ रही है।"
    ],
    "points": 372,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1727211593
  },
  {
    "id": 41642151,
    "title": "मेरे C वेब सर्वर का उपयोग करके मेरी वेबसाइट होस्ट करना",
    "originLink": "https://github.com/cozis/blogtech",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642151",
    "commentBody": "",
    "originSummary": [
      "सार्वजनिक इंटरनेट के लिए मजबूत होने के उद्देश्य से एक न्यूनतम वेब सर्वर को बिना रिवर्स प्रॉक्सी का उपयोग किए खरोंच से बनाया गया, जिससे निर्माता के कस्टम टूल्स विकसित करने और पारंपरिक ज्ञान को चुनौती देने के आनंद को प्रदर्शित किया गया।",
      "सर्वर HTTP/1.1, पाइपलाइनिंग, कीप-अलाइव कनेक्शन्स, और HTTPS (BearSSL का उपयोग करके TLS 1.2 तक) को सपोर्ट करता है, जिसमें न्यूनतम निर्भरताएँ और कॉन्फ़िगर करने योग्य सेटिंग्स हैं।",
      "बेंचमार्क्स से संकेत मिलता है कि सर्वर प्रतिस्पर्धात्मक रूप से प्रदर्शन करता है, 76974.24 अनुरोध/सेकंड को संभालता है जबकि nginx के 44227.78 अनुरोध/सेकंड की तुलना में, हालांकि इसमें कुछ विशेषताएँ जैसे स्थिर फ़ाइल कैशिंग और ट्रांसफर-एन्कोडिंग: चंकेड की कमी है।"
    ],
    "commentSummary": [
      "एक उपयोगकर्ता ने कस्टम C वेब सर्वर का उपयोग करके वेबसाइट होस्ट करने का अपना अनुभव साझा किया, जिससे रिवर्स प्रॉक्सी की आवश्यकता और लाभों पर चर्चा शुरू हो गई।",
      "बहस के मुख्य बिंदुओं में शामिल है कि क्या रिवर्स प्रॉक्सी सुरक्षा, प्रदर्शन, और संचालन की लचीलापन के लिए आवश्यक हैं, कुछ लोग तर्क देते हैं कि इन्हें अक्सर स्पष्ट औचित्य के बिना उपयोग किया जाता है।",
      "पोस्ट में रिवर्स प्रॉक्सी के विभिन्न दृष्टिकोणों को उजागर किया गया है, जिसमें उनके TLS टर्मिनेशन, लोड बैलेंसिंग, URL पुनर्लेखन, और मूल सर्वर को सीधे इंटरनेट एक्सपोजर से अलग करने में उनकी भूमिकाएँ शामिल हैं।"
    ],
    "points": 273,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1727221170
  },
  {
    "id": 41641522,
    "title": "हैकर ने चैटजीपीटी में झूठी यादें डालकर उपयोगकर्ता डेटा को हमेशा के लिए चुराने की योजना बनाई",
    "originLink": "https://arstechnica.com/security/2024/09/false-memories-planted-in-chatgpt-give-hacker-persistent-exfiltration-channel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641522",
    "commentBody": "",
    "originSummary": [
      "सुरक्षा शोधकर्ता जोहान रेहबर्गर ने ChatGPT की दीर्घकालिक स्मृति सुविधा में एक कमजोरी की खोज की, जिससे हमलावरों को झूठी जानकारी और दुर्भावनापूर्ण निर्देश डालने की अनुमति मिलती है।",
      "रेहबर्गर के प्रूफ-ऑफ-कॉन्सेप्ट एक्सप्लॉइट ने निरंतर डेटा निकासी का प्रदर्शन किया, जिससे ओपनएआई को मेमोरी के दुरुपयोग को रोकने के लिए एक आंशिक सुधार जारी करने के लिए प्रेरित किया।",
      "उपयोगकर्ताओं को सलाह दी जाती है कि वे संग्रहीत यादों की नियमित रूप से निगरानी और समीक्षा करें, क्योंकि त्वरित इंजेक्शन के बावजूद, दीर्घकालिक हानिकारक जानकारी अभी भी संग्रहीत हो सकती है।"
    ],
    "commentSummary": [
      "एक हैकर ने ChatGPT में झूठी यादें डालने में सफलता प्राप्त की है, जिससे लंबे समय तक उपयोगकर्ता डेटा की चोरी संभव हो गई है।",
      "यह घटना बड़े भाषा मॉडलों (LLMs) जैसे कि ChatGPT की कमजोरियों को उजागर करती है, जिन्हें भ्रामक जानकारी प्रदर्शित करने, व्यक्तियों की निंदा करने, या झूठे उद्धरणों को बढ़ावा देने के लिए शोषित किया जा सकता है।",
      "यह चर्चा इस व्यापक मुद्दे को रेखांकित करती है कि जनता सटीक जानकारी के लिए LLMs पर अत्यधिक निर्भर हो रही है, जबकि वे संभावित रूप से सही लेकिन गलत या हानिकारक परिणाम उत्पन्न करने की प्रवृत्ति रखते हैं।"
    ],
    "points": 243,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1727215983
  },
  {
    "id": 41643700,
    "title": "एनआईएसटी विशिष्ट पासवर्ड वर्ण संरचना की आवश्यकता को प्रतिबंधित करेगा",
    "originLink": "https://mastodon.social/@LukaszOlejnik/113193089731407165",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643700",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "एनआईएसटी (नेशनल इंस्टीट्यूट ऑफ स्टैंडर्ड्स एंड टेक्नोलॉजी) ने अपने दिशानिर्देशों को अपडेट किया है ताकि विशेष पासवर्ड संरचना आवश्यकताओं को स्पष्ट रूप से निषिद्ध किया जा सके, जैसे कि विभिन्न प्रकार के वर्णों के मिश्रण की आवश्यकता या लगातार दोहराए गए वर्णों को प्रतिबंधित करना।",
      "अपडेटेड दिशानिर्देश अब यह कहते हैं कि सत्यापनकर्ता और सीएसपी (क्रेडेंशियल सेवा प्रदाता) इन संरचना नियमों को \"लागू नहीं करेंगे\", जो पहले की सलाह से एक सख्त आवश्यकता में परिवर्तन है।",
      "यह परिवर्तन महत्वपूर्ण है क्योंकि इसका उद्देश्य पासवर्ड नीतियों को सरल बनाना और उपयोगकर्ताओं पर बोझ को कम करना है, हालांकि NIST के दिशानिर्देश अनिवार्य नहीं हैं और सीधे नीति निर्धारित नहीं करते।"
    ],
    "points": 240,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1727238636
  },
  {
    "id": 41640812,
    "title": "प्रभावशाली एआई अनुसंधान पर",
    "originLink": "https://github.com/okhat/blog/blob/main/2024.09.impact.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640812",
    "commentBody": "",
    "originSummary": [
      "स्नातक छात्रों को दीर्घकालिक परियोजनाओं और प्रभावशाली शोध कृतियों जैसे मॉडल या बेंचमार्क पर ध्यान केंद्रित करने के लिए प्रोत्साहित किया जाता है, न कि केवल पेपर की संख्या बढ़ाने के लिए।",
      "महत्वपूर्ण प्रभाव की संभावना वाले समयोचित समस्याओं का चयन करना और कठिन समस्याओं को हल करने के लिए तेजी से पुनरावृत्ति करना प्रभावशाली एआई अनुसंधान के लिए प्रमुख रणनीतियाँ हैं।",
      "समुदाय के साथ जुड़ना, ओपन-सोर्स रिलीज़ को उपयोगी बनाना, और नए शोध को चल रहे परियोजनाओं के साथ एकीकृत करना प्रभावशाली एआई अनुसंधान के निर्माण और रखरखाव के लिए आवश्यक हैं।"
    ],
    "commentSummary": [
      "वरिष्ठ शोधकर्ता प्रभावशाली परियोजनाओं पर ध्यान केंद्रित करने की सलाह देते हैं बजाय बार-बार प्रकाशन के, लेकिन कनिष्ठ शोधकर्ता अक्सर अपने करियर को आगे बढ़ाने के लिए प्रकाशन का दबाव महसूस करते हैं।",
      "वर्तमान शैक्षणिक प्रणाली गुणवत्ता की तुलना में मात्रा को प्राथमिकता देती है, जिसके परिणामस्वरूप कई तुच्छ शोध पत्र होते हैं, जो महत्वपूर्ण कार्य की पहचान में बाधा डाल सकते हैं।",
      "सहयोग और प्रभावी संचार एक सफल शोध करियर के लिए आवश्यक हैं, हालांकि प्रारंभिक करियर के शोधकर्ताओं को प्रभावशाली परियोजनाओं को बार-बार प्रकाशनों की आवश्यकता के साथ संतुलित करना चुनौतीपूर्ण लग सकता है।"
    ],
    "points": 238,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727211389
  },
  {
    "id": 41646531,
    "title": "मैं 15 साल बाद भी ब्लॉग क्यों करता हूँ",
    "originLink": "https://www.jonashietala.se/blog/2024/09/25/why_i_still_blog_after_15_years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41646531",
    "commentBody": "",
    "originSummary": [
      "लेखक 15 वर्षों तक एक ब्लॉग बनाए रखने पर विचार करते हैं, जिसे प्रारंभ में गेम प्रोटोटाइप विकास को दस्तावेज़ करने के लिए शुरू किया गया था और जो एक व्यापक प्रोग्रामिंग और व्यक्तिगत परियोजना पत्रिका में विकसित हो गया।",
      "निरंतर ब्लॉगिंग के प्रमुख प्रेरणाओं में लेखन का आनंद, विचारों की स्पष्टता, जवाबदेही, दस्तावेजीकरण, आत्म-सुधार, और कौशल विकास शामिल हैं।",
      "ब्लॉग की तकनीकी संरचना ने महत्वपूर्ण रूप से विकास किया है, जो PHP से शुरू होकर Perl, Jekyll, Hakyll, और Rust के माध्यम से परिवर्तित हुई है, जो लेखक की प्रोग्रामिंग में यात्रा और विकास को दर्शाती है।"
    ],
    "commentSummary": [
      "जोन्स हिएटाला 15 साल बाद भी ब्लॉगिंग जारी रखते हैं, मुख्य रूप से व्यक्तिगत संतुष्टि के लिए, न कि दर्शकों के लिए।",
      "यह नई पीढ़ी के सामग्री को मुद्रीकृत करने पर ध्यान केंद्रित करने के विपरीत है, जो ब्लॉगिंग के प्रति दृष्टिकोण में विभाजन को उजागर करता है।",
      "टिप्पणीकार व्यक्तिगत आनंद, कौशल सुधार, और ज्ञान संरक्षण के लिए ब्लॉगिंग के लाभों पर जोर देते हैं, भले ही व्यावसायिक सामग्री का उदय हो रहा हो।"
    ],
    "points": 236,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1727266769
  },
  {
    "id": 41650047,
    "title": "ओरियन, हमारे पहले सच्चे संवर्धित वास्तविकता चश्मे",
    "originLink": "https://about.fb.com/news/2024/09/introducing-orion-our-first-true-augmented-reality-glasses/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41650047",
    "commentBody": "",
    "originSummary": [
      "ओरियन, नवीनतम एआर चश्मा, बड़े होलोग्राफिक डिस्प्ले, संदर्भात्मक एआई, और दैनिक उपयोग के लिए हल्के डिज़ाइन को एकीकृत करता है, जो भौतिक और आभासी दुनियाओं के बीच पुल का काम करता है।",
      "यह सबसे छोटे आकार में सबसे बड़े दृश्य क्षेत्र की विशेषता रखता है, जो हाथ-मुक्त सहायता और संचार के लिए मेटा एआई का समर्थन करता है, हालांकि यह अभी भी विकासाधीन प्रोटोटाइप है।",
      "ओरियन का उद्देश्य डिजिटल लाभों का उपयोग करते हुए उपयोगकर्ता की भौतिक दुनिया में उपस्थिति को बढ़ाना है, जिसमें भविष्य के संस्करणों में अधिक स्पष्ट दृश्य, छोटे आकार और किफायती मूल्य पर ध्यान केंद्रित किया जाएगा।"
    ],
    "commentSummary": [
      "मेटा ने ओरियन का अनावरण किया है, जो उनके पहले सच्चे संवर्धित वास्तविकता (एआर) चश्मे हैं, जो अभी बिक्री के लिए उपलब्ध नहीं हैं।",
      "ओरियन में उन्नत तकनीक शामिल है, जिसमें एक वायरलेस कंप्यूट पुक, 70-डिग्री फील्ड ऑफ व्यू (FoV), और इतना उच्च रिज़ॉल्यूशन है कि पाठ को पढ़ा जा सके, साथ ही एक कलाईबैंड जो हाथ के इशारों का पता लगाता है।",
      "उत्पादन की उच्च लागत, विशेष रूप से सिलिकॉन कार्बाइड लेंसों के कारण, एक महत्वपूर्ण चुनौती है, क्योंकि प्रत्येक इकाई का उत्पादन लगभग $10,000 में होता है।"
    ],
    "points": 233,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1727287013
  },
  {
    "id": 41641274,
    "title": "क्यों अधिकांश प्रकाशित शोध निष्कर्ष गलत होते हैं (2005)",
    "originLink": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641274",
    "commentBody": "",
    "originSummary": [
      "जॉन पी. ए. इओनिडिस का निबंध 'क्यों अधिकांश प्रकाशित शोध निष्कर्ष गलत हैं' तर्क देता है कि प्रकाशित शोध निष्कर्षों का एक महत्वपूर्ण हिस्सा विभिन्न कारकों जैसे अध्ययन की शक्ति, पूर्वाग्रह, और अध्ययन डिजाइन की लचीलापन के कारण गलत है।",
      "छोटे अध्ययन, छोटे प्रभाव आकार, वित्तीय हित, और कई शोध टीमों की उपस्थिति झूठे निष्कर्षों की संभावना को बढ़ाते हैं, जिससे बेहतर-सक्षम अध्ययन और उन्नत शोध मानकों की आवश्यकता को उजागर किया जाता है।",
      "इओनिडिस अनुसंधान परिणामों की व्याख्या में महत्वपूर्ण सोच और पूर्वाग्रहों को पहचानने के महत्व पर जोर देते हैं ताकि वैज्ञानिक निष्कर्षों की विश्वसनीयता में सुधार हो सके।"
    ],
    "commentSummary": [
      "2005 में प्रकाशित जॉन इओनिडिस के पेपर \"Why Most Published Research Findings Are False\" में यह तर्क दिया गया है कि कई शोध निष्कर्ष पूर्वाग्रहों, छोटे नमूना आकारों और अन्य समस्याओं के कारण संभवतः गलत होते हैं।",
      "चर्चा विभिन्न क्षेत्रों में पेपर के प्रभाव, सहकर्मी समीक्षा के प्रभाव, और शोधकर्ताओं पर प्रकाशन के दबाव को उजागर करती है।",
      "बहस इस बात पर जोर देती है कि बेहतर अनुसंधान प्रथाओं और एकल अध्ययनों के प्रति संदेह की आवश्यकता है, विशेष रूप से COVID-19 महामारी के दौरान Ioannidis के विवादास्पद रुख को ध्यान में रखते हुए।"
    ],
    "points": 214,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1727214350
  },
  {
    "id": 41642487,
    "title": "GPON हैक करें – फाइबर ONTs तक कैसे पहुंचें, बदलें और संपादित करें",
    "originLink": "https://hack-gpon.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642487",
    "commentBody": "",
    "originSummary": [
      "यह पोस्ट ऑप्टिकल नेटवर्क टर्मिनल्स (ONTs) तक पहुंचने, उन्हें संशोधित करने और उनकी समस्याओं का समाधान करने के लिए एक व्यापक मार्गदर्शिका प्रदान करती है, जो फाइबर-ऑप्टिक नेटवर्क में उपयोग किए जाने वाले उपकरण हैं।",
      "यह विक्रेता और आईएसपी-विशिष्ट फर्मवेयर और सेटिंग्स के कारण बाहरी ओएनटी और छोटे फॉर्म-फैक्टर प्लग करने योग्य (एसएफपी) मॉड्यूल के बीच स्विच करने की चुनौतियों को उजागर करता है।",
      "पोस्ट में संभावित जोखिमों के बारे में चेतावनियाँ शामिल हैं, जैसे कि डिवाइस को नुकसान और सेवा प्रतिबंध, और यह जोर दिया गया है कि जानकारी उत्साही समुदाय द्वारा बनाए रखी जाती है, न कि आधिकारिक विक्रेताओं द्वारा।"
    ],
    "commentSummary": [
      "चर्चा आईएसपी द्वारा प्रदान किए गए ऑप्टिकल नेटवर्क टर्मिनल्स (ONTs) और ग्राहक के स्वामित्व वाले उपकरणों के उपयोग के फायदे और नुकसान पर केंद्रित है, जिसमें अपग्रेड की आसानी और अनुकूलन के बीच के समझौतों को उजागर किया गया है।",
      "विभिन्न देशों के उदाहरण विभिन्न नियामक दृष्टिकोणों और ग्राहक अनुभवों को दर्शाते हैं, जो इस बहस की वैश्विक प्रकृति को उजागर करते हैं।",
      "तकनीकी पहलुओं जैसे कि राउटर्स के साथ ONT एकीकरण, नेटवर्क प्रभाव, और सुरक्षा चिंताओं पर भी चर्चा की जाती है, जिसमें उपयोगकर्ता बेहतर प्रदर्शन के लिए ONTs को संशोधित करने के व्यक्तिगत अनुभव साझा करते हैं।"
    ],
    "points": 210,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727224865
  },
  {
    "id": 41640005,
    "title": "रूट से परे: ग्रैन्युलर MTA बस गति डेटा का परिचय",
    "originLink": "https://new.mta.info/article/beyond-route-introducing-granular-mta-bus-speed-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640005",
    "commentBody": "",
    "originSummary": [
      "एमटीए ने ओपन डेटा पर बस रूट सेगमेंट स्पीड्स डेटासेट लॉन्च किया है, जो अपने नेटवर्क में बस की गति के बारे में विस्तृत जानकारी प्रदान करता है।",
      "यह डेटा सेट, जो जीपीएस सिस्टम से प्राप्त होता है, में स्टॉप और ट्रैफिक जैसे कारक शामिल हैं, जो बस सेवाओं में सुधार के लिए धीमे क्षेत्रों का विश्लेषण और पहचान करने में मदद करते हैं।",
      "डेटा मासिक रूप से अपडेट किया जाता है और NYS ओपन डेटा पोर्टल पर उपलब्ध है, जिसमें MTA जनता को अन्वेषण और प्रतिक्रिया देने के लिए प्रोत्साहित करता है।"
    ],
    "commentSummary": [
      "न्यूयॉर्क सिटी की बस मार्ग अक्सर पुराने स्ट्रीटकार लाइनों का अनुसरण करते हैं, जिनमें से कई ट्रैक अभी भी फुटपाथ के नीचे मौजूद हैं।",
      "चर्चाओं से पता चलता है कि यदि स्ट्रीटकारों को यातायात से अलग कर दिया जाए, तो वे बसों की तुलना में अधिक कुशल हो सकते हैं, भले ही उनकी लागत अधिक हो और राजनीतिक चुनौतियाँ हों।",
      "एमटीए के नए विस्तृत बस गति डेटा और न्यूयॉर्क सिटी की ओपन डेटा पहलों की प्रशंसा की जा रही है, इस उम्मीद के साथ कि डेटा विश्लेषण से बेहतर परिवहन समाधान मिलेंगे।"
    ],
    "points": 207,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1727205963
  },
  {
    "id": 41642313,
    "title": "कर्नेल में रस्ट के प्रति प्रतिबद्धता",
    "originLink": "https://lwn.net/SubscriberLink/991062/b0df468b40b21f5d/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642313",
    "commentBody": "",
    "originSummary": [
      "2024 के मेंटेनर्स समिट में, मिगुएल ओजेदा ने लिनक्स कर्नेल में रस्ट को एकीकृत करने की प्रगति और भविष्य पर चर्चा की, और सबसिस्टम मेंटेनर्स से लचीलापन की आवश्यकता पर जोर दिया।",
      "मुख्य चर्चाओं में बेहतर टूलिंग समर्थन, स्थिर कंपाइलर, और रस्ट में फाइल सिस्टम कोड लिखने के लिए व्यापक दस्तावेज़ीकरण की आवश्यकता शामिल थी।",
      "लिनुस टॉर्वाल्ड्स ने डेवलपर्स को रस्ट को एकीकृत करना जारी रखने के लिए प्रोत्साहित किया, यह बताते हुए कि पहला वास्तविक ड्राइवर मर्ज एक महत्वपूर्ण मील का पत्थर होगा, और शिखर सम्मेलन में सहयोगात्मक माहौल को उजागर किया।"
    ],
    "commentSummary": [
      "लिनुस टॉर्वाल्ड्स ने उल्लेख किया कि रस्ट को समझना आवश्यक नहीं है ताकि इसे एक सबसिस्टम में एकीकृत किया जा सके, जैसे कि हर कोई मेमोरी-मैनेजमेंट सबसिस्टम को नहीं समझता है लेकिन फिर भी इसके साथ काम कर सकता है।",
      "रस्ट को लिनक्स कर्नेल में एकीकृत किया जा रहा है, विशेष रूप से ड्राइवर्स में, गूगल जैसी प्रमुख कंपनियों के समर्थन के साथ, जिसका उद्देश्य सुरक्षा और विश्वसनीयता में सुधार करना है।",
      "रस्ट और सी के बीच संगतता और सुरक्षा को लेकर चिंताएँ हैं, जिसके लिए महत्वपूर्ण रस्ट ज्ञान की आवश्यकता होती है, और कुछ कर्नेल डेवलपर्स ने एपीआई सिमेंटिक्स और बेहतर दस्तावेज़ीकरण की आवश्यकता के कारण संदेह व्यक्त किया है।"
    ],
    "points": 194,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1727222881
  },
  {
    "id": 41645173,
    "title": "पुनः संरचना: रेडिस से एसक्यूएलाइट",
    "originLink": "https://wafris.org/blog/rearchitecting-for-sqlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41645173",
    "commentBody": "",
    "originSummary": [
      "वाफ्रिस, एक ओपन-सोर्स वेब एप्लिकेशन फायरवॉल कंपनी, तैनाती समस्याओं को हल करने और प्रदर्शन में सुधार के लिए अपने रेल्स मिडलवेयर क्लाइंट को रेडिस से SQLite में स्थानांतरित कर रही है।",
      "SQLite को इसके कम नेटवर्क विलंबता और पढ़ाई-प्रधान संचालन में बेहतर प्रदर्शन के लिए चुना गया, जिससे स्थानीय बेंचमार्क में Redis की तुलना में 3 गुना गति सुधार दिखा।",
      "नई वास्तुकला तैनाती को सरल बनाती है, उपयोगकर्ता अनुभव को बढ़ाती है, और प्रत्येक कंप्यूट इंस्टेंस के साथ डेटाबेस को सिंक करके बेहतर स्केल करती है, जबकि SQLite की सीमाओं को कम करने के लिए लिखने के कार्यों को असिंक्रोनस रूप से संभालती है।"
    ],
    "commentSummary": [
      "RailsWorld 2023 में, Rails अनुप्रयोगों के लिए Redis की आवश्यकता के बारे में चर्चा हुई, जिसमें कुछ लोगों ने लाइसेंस परिवर्तनों के कारण इसकी अनिवार्यता पर सवाल उठाया या इसे 'आपको इसकी आवश्यकता नहीं होगी' (YAGNI) स्थिति माना।",
      "यह पोस्ट कुछ उपयोग मामलों के लिए Redis के बजाय SQLite का उपयोग करने के विचार का अन्वेषण करती है, जैसे कि असिंक्रोनस जॉब्स और फीचर फ्लैग कॉन्फ़िगरेशन, SQLite की दक्षता और सरलता को उजागर करते हुए।",
      "विभिन्न योगदानकर्ताओं ने अपने अनुभव और मॉडल साझा किए, जिसमें वेब एप्लिकेशन फ़ायरवॉल नियमों, फीचर फ्लैग्स और कॉन्फ़िगरेशन डेटा के लिए SQLite का उपयोग शामिल था, और पारंपरिक डेटाबेस जैसे Redis की तुलना में इसके प्रदर्शन और उपयोग में आसानी पर जोर दिया।"
    ],
    "points": 189,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1727253468
  },
  {
    "id": 41643651,
    "title": "SQL टिप्स और ट्रिक्स",
    "originLink": "https://github.com/ben-n93/SQL-tips-and-tricks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643651",
    "commentBody": "",
    "originSummary": [
      "यह पोस्ट डेटा विश्लेषकों के लिए SQL टिप्स और ट्रिक्स की एक व्यापक सूची प्रदान करती है, यह बताते हुए कि कुछ टिप्स सभी रिलेशनल डेटाबेस मैनेजमेंट सिस्टम्स (RDBMS) पर लागू नहीं हो सकते हैं।",
      "मुख्य क्षेत्रों में स्वरूपण/पठनीयता, उपयोगी विशेषताएँ, और सामान्य गलतियों से बचाव शामिल हैं, जो उपयोगकर्ताओं को अधिक कुशल, पठनीय, और बनाए रखने योग्य SQL क्वेरी लिखने में मदद करते हैं।",
      "मुख्य बिंदुओं में पठनीयता के लिए अग्रणी कॉमा का उपयोग करना, जटिल क्वेरी के लिए सामान्य टेबल एक्सप्रेशंस (CTEs) का उपयोग करना, और NULL मानों के साथ `NOT IN` के व्यवहार को समझना शामिल है।"
    ],
    "commentSummary": [
      "यह पोस्ट विभिन्न SQL टिप्स और ट्रिक्स साझा करती है, जिसमें प्रदर्शन अनुकूलन और कुशल क्वेरी लिखने के सर्वोत्तम अभ्यासों पर जोर दिया गया है।",
      "मुख्य सुझावों में EXISTS का उपयोग IN की बजाय करना, GROUP BY क्लॉज के लिए इंडेक्स जोड़ना, और बेहतर प्रदर्शन के लिए सबक्वेरी का लाभ उठाना शामिल है।",
      "चर्चा विभिन्न डेटाबेस प्रबंधन प्रणालियों (DBMS) जैसे पोस्टग्रेस और SQL सर्वर की विशिष्ट विशेषताओं और विचित्रताओं को समझने के महत्व को उजागर करती है।"
    ],
    "points": 184,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1727238048
  },
  {
    "id": 41642969,
    "title": "11 वर्षों के बाद Datomic के साथ अंतर्दृष्टि [वीडियो]",
    "originLink": "https://www.youtube.com/watch?v=YSgTQzHYeLU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642969",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Datomic, एक डेटाबेस जो अपनी अपरिवर्तनीयता और समय-यात्रा क्वेरी के लिए जाना जाता है, अब मुफ्त हो गया है लेकिन अभी भी स्वामित्व में है, जिससे तकनीकी समुदाय में फिर से रुचि और बहस छिड़ गई है।",
      "अपने नवाचारी विशेषताओं के बावजूद, डेटोमिक को इसके जटिल सेटअप, गैर-JVM भाषाओं के साथ सीमित एकीकरण, और समर्थन के लिए एक छोटे कंपनी पर निर्भरता के कारण आलोचना का सामना करना पड़ता है।",
      "PostgreSQL और XTDB जैसे अन्य डेटाबेस के साथ तुलना करने पर, अपरिचित क्वेरी भाषाओं और प्रदर्शन संबंधी चिंताओं जैसे समझौते सामने आते हैं, जिससे Datomic विशिष्ट उपयोग मामलों के लिए एक विशेष विकल्प बन जाता है।"
    ],
    "points": 181,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1727229912
  },
  {
    "id": 41640789,
    "title": "कैरोलीन एलिसन को 2 साल की जेल की सजा सुनाई गई",
    "originLink": "https://www.nytimes.com/2024/09/24/technology/caroline-ellison-ftx-sentence.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640789",
    "commentBody": "",
    "originSummary": [
      "कैरोलीन एलिसन, जो FTX के संस्थापक सैम बैंकमैन-फ्राइड की पूर्व सलाहकार थीं, को FTX के पतन का कारण बने $8 बिलियन के धोखाधड़ी में उनकी संलिप्तता के लिए दो साल की जेल की सजा सुनाई गई।",
      "बैंकमैन-फ्राइड के खिलाफ अभियोजकों के साथ सहयोग करने और गवाही देने के बावजूद, जो 25 साल की सजा काट रहा है, न्यायाधीश लुईस ए. कैपलान ने धोखाधड़ी की गंभीरता को उजागर किया।",
      "एलिसन, जिन्होंने गहरी पश्चाताप व्यक्त की, 7 नवंबर तक बोस्टन में एक न्यूनतम-सुरक्षा जेल में रिपोर्ट करेंगी और अपनी दोषी याचिका के बाद से काम खोजने में संघर्ष कर रही हैं।"
    ],
    "commentSummary": [
      "कैरोलीन एलिसन को FTX धोखाधड़ी में उनकी संलिप्तता के लिए 2 साल की जेल की सजा मिली, जिससे कथित नरमी को लेकर जनता में आक्रोश फैल गया।",
      "सैम बैंकमैन-फ्राइड के खिलाफ मामले में अभियोजकों के साथ उनका सहयोग उनकी कम सजा का एक प्रमुख कारण था।",
      "इस मामले ने अमेरिकी न्याय प्रणाली में निष्पक्षता के बारे में बहस को फिर से जीवित कर दिया है, विशेष रूप से श्वेतपोश अपराधों और मामूली अपराधों के बीच सजा में असमानता, जो अक्सर हाशिए पर रहने वाले समुदायों को प्रभावित करती है।"
    ],
    "points": 173,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1727211237
  }
]
