[
  {
    "id": 41640845,
    "title": "구글 캐시는 완전히 죽었다",
    "originLink": "https://www.seroundtable.com/google-cache-dead-38112.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640845",
    "commentBody": "",
    "originSummary": [
      "구글은 이전에 페이지가 로드되지 않을 때 접근할 수 있도록 사용되었던 기능인 구글 캐시를 완전히 비활성화했습니다.",
      "사용자들은 이제 대안으로 Wayback Machine 또는 Google Search Console의 URL 검사 도구를 사용하도록 안내됩니다.",
      "Google의 검색 담당자 Danny Sullivan은 이 제거를 확인하고 이 변경 사항을 반영하기 위해 문서를 업데이트했습니다."
    ],
    "commentSummary": [
      "구글 캐시는 완전히 중단되어 오래되거나 변경된 웹 콘텐츠에 접근하는 것에 대한 우려를 불러일으키고 있습니다.",
      "사용자들은 구글이 현재 유사한 목적을 수행하고 있는 인터넷 아카이브를 지원해주기를 희망합니다.",
      "이 중단은 구글이 서비스를 종료하는 더 넓은 추세를 반영하며, 이는 사용자 신뢰의 하락으로 이어지고 있다."
    ],
    "points": 372,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1727211593
  },
  {
    "id": 41642151,
    "title": "내 C 웹 서버를 사용하여 내 웹사이트 호스팅하기",
    "originLink": "https://github.com/cozis/blogtech",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642151",
    "commentBody": "",
    "originSummary": [
      "역방향 프록시를 사용하지 않고 공용 인터넷에 견고하도록 처음부터 직접 구축된 최소한의 웹 서버는 창작자가 맞춤형 도구를 개발하고 기존의 지혜에 도전하는 것을 즐긴다는 것을 보여줍니다.",
      "서버는 HTTP/1.1, 파이프라이닝, 유지 연결, 그리고 HTTPS(TLS 1.2까지 BearSSL 사용)를 지원하며, 최소한의 종속성과 구성 가능한 설정을 제공합니다.",
      "벤치마크에 따르면 서버는 정적 파일 캐싱 및 Transfer-Encoding: Chunked와 같은 일부 기능이 부족함에도 불구하고, nginx의 44227.78 요청/초에 비해 76974.24 요청/초를 처리하며 경쟁력 있는 성능을 보입니다."
    ],
    "commentSummary": [
      "한 사용자가 맞춤형 C 웹 서버를 사용하여 웹사이트를 호스팅한 경험을 공유하면서 리버스 프록시의 필요성과 이점에 대한 논의가 촉발되었습니다.",
      "논쟁의 주요 쟁점은 리버스 프록시가 보안, 성능 및 운영 유연성에 필수적인지 여부이며, 일부는 명확한 정당성 없이 자주 사용된다고 주장합니다.",
      "이 게시물은 TLS 종료, 로드 밸런싱, URL 재작성, 그리고 원본 서버를 직접적인 인터넷 노출로부터 격리하는 역할을 포함하여 리버스 프록시에 대한 다양한 관점을 강조합니다."
    ],
    "points": 273,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1727221170
  },
  {
    "id": 41641522,
    "title": "해커가 ChatGPT에 거짓 기억을 심어 사용자 데이터를 영구적으로 훔친다",
    "originLink": "https://arstechnica.com/security/2024/09/false-memories-planted-in-chatgpt-give-hacker-persistent-exfiltration-channel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641522",
    "commentBody": "",
    "originSummary": [
      "보안 연구원 요한 레버거는 ChatGPT의 장기 기억 기능에서 취약점을 발견하여 공격자가 허위 정보와 악성 지시를 심을 수 있게 한다고 밝혔습니다.",
      "레버거의 개념 증명 익스플로잇은 지속적인 데이터 유출을 시연하여 OpenAI가 메모리 남용을 방지하기 위한 부분적인 수정 조치를 취하도록 촉구했습니다.",
      "사용자들은 저장된 기억을 정기적으로 모니터링하고 검토할 것을 권장합니다. 수정이 이루어졌음에도 불구하고 신속한 주입이 여전히 장기적인 악성 정보를 저장할 수 있기 때문입니다."
    ],
    "commentSummary": [
      "한 해커가 ChatGPT에 거짓 기억을 심어 오랜 기간 동안 사용자 데이터를 탈취하는 데 성공했습니다.",
      "이 사건은 ChatGPT와 같은 대형 언어 모델(LLM)의 취약성을 부각시키며, 이는 오도된 정보를 표시하거나, 개인을 비방하거나, 거짓 인용을 홍보하는 데 악용될 수 있습니다.",
      "이 논의는 LLMs가 그럴듯하지만 부정확하거나 해로운 출력을 생성하는 경향이 있음에도 불구하고, 대중이 정확한 정보를 위해 LLMs에 과도하게 의존하는 더 넓은 문제를 강조합니다."
    ],
    "points": 243,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1727215983
  },
  {
    "id": 41643700,
    "title": "미국 국립표준기술연구소(NIST), 특정 비밀번호 문자 구성 요구 금지 예정",
    "originLink": "https://mastodon.social/@LukaszOlejnik/113193089731407165",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643700",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "NIST(미국 국립 표준 기술 연구소)는 특정 비밀번호 구성 요구 사항을 명시적으로 금지하도록 지침을 업데이트했습니다. 여기에는 다양한 문자 유형의 혼합을 요구하거나 연속적으로 반복되는 문자를 금지하는 것이 포함됩니다.",
      "업데이트된 지침에 따르면, 검증자와 CSP(자격 증명 서비스 제공자)는 이제 이러한 구성 규칙을 '적용해서는 안 된다'고 명시하고 있으며, 이는 이전의 권고에서 확고한 요구 사항으로 전환된 것입니다.",
      "이 변경은 비밀번호 정책을 단순화하고 사용자에게 가해지는 부담을 줄이려는 목표를 가지고 있기 때문에 중요합니다. 그러나 NIST의 지침은 의무 사항이 아니며 직접적인 정책을 설정하지 않습니다."
    ],
    "points": 240,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1727238636
  },
  {
    "id": 41640812,
    "title": "영향력 있는 AI 연구에 대하여",
    "originLink": "https://github.com/okhat/blog/blob/main/2024.09.impact.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640812",
    "commentBody": "",
    "originSummary": [
      "대학원생들은 단순히 논문 수를 늘리는 것보다는 모델이나 벤치마크와 같은 장기 프로젝트와 영향력 있는 연구 산출물에 집중할 것을 권장합니다.",
      "중요한 잠재적 영향을 미칠 수 있는 시의적절한 문제를 선택하고 어려운 문제를 해결하기 위해 신속하게 반복하는 것은 영향력 있는 AI 연구를 위한 핵심 전략입니다.",
      "커뮤니티와의 소통, 오픈 소스 릴리스의 사용 가능성 확보, 그리고 새로운 연구를 진행 중인 프로젝트와 통합하는 것은 영향력 있는 AI 연구를 구축하고 유지하는 데 필수적입니다."
    ],
    "commentSummary": [
      "선임 연구원들은 빈번한 출판보다는 영향력 있는 프로젝트에 집중할 것을 권장하지만, 주니어 연구원들은 경력을 발전시키기 위해 출판 압박을 자주 느낀다.",
      "현재의 학문 시스템은 질보다 양을 우선시하여 많은 사소한 논문들이 나오게 되며, 이는 중요한 연구의 인정을 방해할 수 있습니다.",
      "협업과 효과적인 의사소통은 성공적인 연구 경력을 위해 필수적이지만, 초기 경력 연구자들은 영향력 있는 프로젝트와 빈번한 출판의 필요성을 균형 있게 맞추는 데 어려움을 겪을 수 있습니다."
    ],
    "points": 238,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727211389
  },
  {
    "id": 41646531,
    "title": "내가 15년이 지나도 여전히 블로그를 하는 이유",
    "originLink": "https://www.jonashietala.se/blog/2024/09/25/why_i_still_blog_after_15_years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41646531",
    "commentBody": "",
    "originSummary": [
      "저자는 게임 프로토타입 개발을 기록하기 위해 시작한 블로그를 15년 동안 유지해 오면서, 점차 더 넓은 프로그래밍 및 개인 프로젝트 일지로 발전시킨 경험을 회고합니다.",
      "계속해서 블로그를 운영하는 주요 동기는 글쓰기에 대한 즐거움, 사고의 명확성, 책임감, 문서화, 자기 개선, 그리고 기술 개발입니다.",
      "블로그의 기술 스택은 PHP로 시작하여 Perl, Jekyll, Hakyll, Rust를 거치며 크게 발전하였으며, 이는 저자의 프로그래밍 여정과 성장을 보여줍니다."
    ],
    "commentSummary": [
      "요나스 히에탈라는 15년이 지난 후에도 계속 블로그를 운영하고 있으며, 주로 청중보다는 개인적인 만족을 위해서입니다.",
      "이는 콘텐츠를 수익화하는 데 중점을 둔 신세대와의 대조를 이루며, 블로깅에 대한 태도 차이를 부각시킵니다.",
      "댓글 작성자들은 상업화된 콘텐츠의 증가에도 불구하고 개인적인 즐거움, 기술 향상, 지식 보존을 위해 블로깅의 이점을 강조합니다."
    ],
    "points": 236,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1727266769
  },
  {
    "id": 41650047,
    "title": "오리온, 우리의 첫 번째 진정한 증강 현실 안경",
    "originLink": "https://about.fb.com/news/2024/09/introducing-orion-our-first-true-augmented-reality-glasses/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41650047",
    "commentBody": "",
    "originSummary": [
      "오리온, 최신 AR 안경은 대형 홀로그램 디스플레이, 상황 인식 AI, 그리고 일상 사용을 위한 경량 디자인을 통합하여 물리적 세계와 가상 세계를 연결합니다.",
      "가장 작은 형태에서 가장 넓은 시야를 제공하며, Meta AI를 지원하여 핸즈프리 지원 및 통신이 가능하지만 여전히 개발 중인 프로토타입입니다.",
      "오리온은 디지털 혜택을 이용하면서도 물리적 세계에서 사용자의 존재감을 강화하는 것을 목표로 하며, 향후 버전에서는 더 선명한 시각, 더 작은 크기, 그리고 경제성을 중점으로 할 것입니다."
    ],
    "commentSummary": [
      "메타가 첫 번째 진정한 증강 현실(AR) 안경인 오리온을 공개했으나, 아직 판매는 시작되지 않았습니다.",
      "오리온은 무선 컴퓨트 퍼크, 70도 시야각(FoV), 텍스트를 읽을 수 있을 만큼 높은 해상도, 그리고 손 제스처를 감지하는 손목밴드를 포함한 첨단 기술을 특징으로 합니다.",
      "제조 비용이 높다는 점, 특히 실리콘 카바이드 렌즈로 인해, 큰 도전 과제입니다. 각 유닛을 생산하는 데 약 $10,000가 소요됩니다."
    ],
    "points": 233,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1727287013
  },
  {
    "id": 41641274,
    "title": "왜 대부분의 발표된 연구 결과는 거짓인가 (2005)",
    "originLink": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641274",
    "commentBody": "",
    "originSummary": [
      "존 P. A. 이오아니디스의 에세이 '왜 대부분의 출판된 연구 결과는 거짓인가'는 연구의 힘, 편향, 연구 설계의 유연성 등 다양한 요인으로 인해 출판된 연구 결과의 상당 부분이 거짓임을 주장한다.",
      "더 작은 연구, 더 작은 효과 크기, 재정적 이익, 그리고 여러 연구 팀은 잘못된 결과의 확률을 증가시켜, 더 강력한 연구와 향상된 연구 기준의 필요성을 강조합니다.",
      "이오안니디스는 연구 결과를 해석할 때 비판적 사고와 편견 인식의 중요성을 강조하여 과학적 발견의 신뢰성을 향상시켜야 한다고 주장합니다."
    ],
    "commentSummary": [
      "2005년 존 이오아니디스의 논문 '왜 대부분의 발표된 연구 결과는 거짓인가'는 편향, 작은 표본 크기 및 기타 문제들로 인해 많은 연구 결과가 거짓일 가능성이 높다고 주장합니다.",
      "이 논의는 다양한 분야에 걸친 논문의 함의, 동료 평가의 영향, 그리고 연구자들이 출판해야 하는 압박에 대해 강조하고 있습니다.",
      "이 논쟁은 더 나은 연구 관행과 단일 연구에 대한 회의론의 필요성을 강조하며, 특히 COVID-19 팬데믹 동안 Ioannidis의 논란이 된 입장을 고려할 때 더욱 그렇다."
    ],
    "points": 214,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1727214350
  },
  {
    "id": 41642487,
    "title": "GPON 해킹 – 광섬유 ONT에 접근하고 변경 및 편집하는 방법",
    "originLink": "https://hack-gpon.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642487",
    "commentBody": "",
    "originSummary": [
      "이 게시물은 광섬유 네트워크에서 사용되는 장치인 광 네트워크 단말기(ONT)에 대한 접근, 수정 및 문제 해결에 관한 포괄적인 가이드를 제공합니다.",
      "이는 공급업체 및 ISP 특정 펌웨어와 설정으로 인해 외부 ONT와 소형 폼 팩터 플러그형(SFP) 모듈 간 전환의 어려움을 강조합니다.",
      "이 게시물에는 기기 손상 및 서비스 금지와 같은 잠재적 위험에 대한 경고가 포함되어 있으며, 정보는 공식 공급업체가 아닌 열성적인 커뮤니티에 의해 유지된다는 점을 강조하고 있습니다."
    ],
    "commentSummary": [
      "논의는 ISP가 제공하는 광 네트워크 단말기(ONT)와 고객 소유 장치를 사용하는 것의 장단점에 중점을 두며, 업그레이드의 용이성과 맞춤화 사이의 균형을 강조합니다.",
      "여러 국가의 사례는 다양한 규제 접근 방식과 고객 경험을 보여주며, 이 논쟁이 전 세계적임을 강조합니다.",
      "ONT 통합과 라우터, 네트워크 영향, 보안 문제와 같은 기술적 측면도 논의되며, 사용자들은 더 나은 성능을 위해 ONT를 수정한 개인 경험을 공유합니다."
    ],
    "points": 210,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727224865
  },
  {
    "id": 41640005,
    "title": "경로를 넘어서: 세분화된 MTA 버스 속도 데이터 소개",
    "originLink": "https://new.mta.info/article/beyond-route-introducing-granular-mta-bus-speed-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640005",
    "commentBody": "",
    "originSummary": [
      "교통국(MTA)은 오픈 데이터에 버스 노선 구간 속도 데이터셋을 출시하여 네트워크 전반에 걸친 버스 속도에 대한 자세한 정보를 제공합니다.",
      "이 데이터셋은 GPS 시스템에서 파생된 것으로, 정차 및 교통과 같은 요소를 포함하여 버스 서비스 개선을 위해 느린 구역을 분석하고 식별하는 데 도움을 줍니다.",
      "데이터는 매월 업데이트되며 NYS 오픈 데이터 포털에서 이용할 수 있으며, MTA는 대중의 탐색과 피드백을 권장합니다."
    ],
    "commentSummary": [
      "뉴욕시의 버스 노선은 종종 오래된 전차 노선을 따르며, 많은 트랙이 여전히 포장 아래에 존재합니다.",
      "논의에 따르면, 트램이 교통에서 분리될 경우, 더 높은 비용과 정치적 도전에도 불구하고 버스보다 더 효율적일 수 있습니다.",
      "뉴욕시 교통국(MTA)의 새로운 세분화된 버스 속도 데이터와 뉴욕시의 오픈 데이터 이니셔티브가 칭찬받고 있으며, 데이터 분석이 향상된 교통 솔루션으로 이어지기를 기대하고 있다."
    ],
    "points": 207,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1727205963
  },
  {
    "id": 41642313,
    "title": "커널에서 Rust에 전념하기",
    "originLink": "https://lwn.net/SubscriberLink/991062/b0df468b40b21f5d/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642313",
    "commentBody": "",
    "originSummary": [
      "2024 유지보수자 정상 회담에서 미겔 오헤다는 Rust를 리눅스 커널에 통합하는 진전과 미래에 대해 논의하며, 서브시스템 유지보수자들의 유연성 필요성을 강조했습니다.",
      "주요 논의 사항에는 더 나은 도구 지원, 안정적인 컴파일러, 그리고 Rust로 파일 시스템 코드를 작성하기 위한 포괄적인 문서화의 필요성이 포함되었습니다.",
      "리누스 토발즈는 개발자들에게 Rust 통합을 계속할 것을 권장하며, 첫 번째 실제 드라이버 병합이 중요한 이정표가 될 것이라고 언급했고, 정상 회담에서의 협력적인 분위기를 강조했습니다."
    ],
    "commentSummary": [
      "리누스 토르발스는 메모리 관리 서브시스템을 모두가 이해하지 못해도 작업할 수 있는 것처럼, 러스트를 이해하지 않아도 서브시스템에 통합할 수 있다고 언급했습니다.",
      "Rust는 특히 드라이버에서 Linux 커널에 통합되고 있으며, Google과 같은 주요 기업의 지원을 받아 안전성과 신뢰성을 향상시키는 것을 목표로 하고 있습니다.",
      "Rust와 C 간의 호환성과 안전성에 대한 우려가 있으며, 상당한 Rust 지식이 필요합니다. 일부 커널 개발자들은 API 의미론 문제와 더 나은 문서화 필요성 때문에 회의적인 입장을 표명했습니다."
    ],
    "points": 194,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1727222881
  },
  {
    "id": 41645173,
    "title": "재설계: Redis에서 SQLite로",
    "originLink": "https://wafris.org/blog/rearchitecting-for-sqlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41645173",
    "commentBody": "",
    "originSummary": [
      "오픈 소스 웹 애플리케이션 방화벽 회사인 Wafris는 배포 문제를 해결하고 성능을 향상시키기 위해 Rails 미들웨어 클라이언트를 Redis에서 SQLite로 전환하고 있습니다.",
      "SQLite는 네트워크 지연 시간이 줄어들고 읽기 중심 작업에서 더 나은 성능을 보여주기 때문에 선택되었으며, 로컬 벤치마크에서 Redis보다 3배 빠른 속도 향상을 나타냈습니다.",
      "새로운 아키텍처는 배포를 간소화하고 사용자 경험을 향상시키며, 각 컴퓨팅 인스턴스에 데이터베이스를 동기화하여 더 나은 확장성을 제공합니다. 또한, 쓰기 작업이 많은 경우 SQLite의 한계를 완화하기 위해 비동기적으로 쓰기 작업을 처리합니다."
    ],
    "commentSummary": [
      "RailsWorld 2023에서 레일스 애플리케이션에 Redis가 필요한지에 대한 논의가 있었으며, 일부는 라이선스 변경으로 인해 여전히 필수적인지 또는 '당신은 그것이 필요하지 않을 것이다' (YAGNI) 상황인지에 대해 의문을 제기했습니다.",
      "이 게시물은 비동기 작업 및 기능 플래그 구성과 같은 특정 사용 사례에 대해 Redis 대신 SQLite를 사용하는 아이디어를 탐구하며, SQLite의 효율성과 단순성을 강조합니다.",
      "여러 기고자들이 웹 애플리케이션 방화벽 규칙, 기능 플래그 및 구성 데이터를 위해 SQLite를 사용하는 경험과 모델을 공유하며, Redis와 같은 전통적인 데이터베이스와 비교했을 때 성능과 사용의 용이성을 강조했습니다."
    ],
    "points": 189,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1727253468
  },
  {
    "id": 41643651,
    "title": "SQL 팁과 요령",
    "originLink": "https://github.com/ben-n93/SQL-tips-and-tricks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643651",
    "commentBody": "",
    "originSummary": [
      "이 게시물은 데이터 분석가를 위한 SQL 팁과 요령의 포괄적인 목록을 제공하며, 일부 팁은 모든 관계형 데이터베이스 관리 시스템(RDBMS)에 적용되지 않을 수 있음을 강조합니다.",
      "주요 영역에는 형식/가독성, 유용한 기능, 그리고 피해야 할 일반적인 함정이 포함되어 있으며, 사용자가 더 효율적이고, 가독성이 높으며, 유지 관리가 용이한 SQL 쿼리를 작성할 수 있도록 돕습니다.",
      "하이라이트에는 가독성을 위해 선행 쉼표를 사용하는 것, 복잡한 쿼리에 공통 테이블 표현식(CTE)을 사용하는 것, 그리고 NULL 값과 함께 `NOT IN`의 동작을 이해하는 것이 포함됩니다."
    ],
    "commentSummary": [
      "이 게시물은 성능 최적화와 효율적인 쿼리 작성을 위한 모범 사례를 강조하며 다양한 SQL 팁과 요령을 공유합니다.",
      "주요 제안 사항으로는 IN 대신 EXISTS를 사용하고, GROUP BY 절에 인덱스를 추가하며, 더 나은 성능을 위해 서브쿼리를 활용하는 것이 포함됩니다.",
      "이 논의는 Postgres와 SQL Server와 같은 다양한 데이터베이스 관리 시스템(DBMS)의 특정 특성과 기능을 이해하는 것의 중요성을 강조합니다."
    ],
    "points": 184,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1727238048
  },
  {
    "id": 41642969,
    "title": "11년간 Datomic과 함께한 통찰 [비디오]",
    "originLink": "https://www.youtube.com/watch?v=YSgTQzHYeLU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642969",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Datomic, 불변성과 시간 여행 쿼리로 알려진 데이터베이스가 무료로 전환되었지만 여전히 독점적이어서 기술 커뮤니티에서 새로운 관심과 논쟁을 불러일으키고 있습니다.",
      "혁신적인 기능에도 불구하고, Datomic은 복잡한 설정, 비 JVM 언어와의 제한된 통합, 그리고 소규모 회사에 대한 지원 의존성으로 비판을 받고 있습니다.",
      "PostgreSQL 및 XTDB와 같은 다른 데이터베이스와의 비교는 익숙하지 않은 쿼리 언어와 성능 문제와 같은 트레이드오프를 강조하며, Datomic을 특정 사용 사례에 적합한 틈새 선택으로 만듭니다."
    ],
    "points": 181,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1727229912
  },
  {
    "id": 41640789,
    "title": "캐롤라인 엘리슨, 징역 2년 선고",
    "originLink": "https://www.nytimes.com/2024/09/24/technology/caroline-ellison-ftx-sentence.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640789",
    "commentBody": "",
    "originSummary": [
      "캐롤라인 엘리슨, FTX 창립자 샘 뱅크먼-프리드의 전 고문, FTX 붕괴를 초래한 80억 달러 사기 사건에 연루되어 2년의 징역형을 선고받았다.",
      "그녀가 검사들과 협력하고 25년 형을 선고받은 뱅크먼-프리드에 대해 증언했음에도 불구하고, 루이스 A. 카플란 판사는 사기의 중대성을 강조했다.",
      "깊은 후회를 표명한 엘리슨은 11월 7일까지 보스턴의 최소 보안 교도소에 자진 출두할 예정이며, 유죄를 인정한 이후로 일자리를 찾는 데 어려움을 겪고 있다."
    ],
    "commentSummary": [
      "캐롤라인 엘리슨은 FTX 사기 사건에 연루되어 2년의 징역형을 선고받았으며, 이는 관대한 처벌이라는 인식으로 인해 대중의 분노를 불러일으켰다.",
      "그녀가 샘 뱅크먼-프리드에 대한 사건에서 검찰과 협력한 것이 그녀의 감형에 중요한 요인이 되었다.",
      "이 사건은 미국 사법 시스템의 공정성에 대한 논쟁을 다시 불러일으켰으며, 특히 화이트칼라 범죄와 경미한 범죄 간의 형량 차이가 종종 소외된 커뮤니티에 영향을 미친다는 점에서 논란이 되고 있습니다."
    ],
    "points": 173,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1727211237
  }
]
