[
  {
    "id": 41640845,
    "title": "ذاكرة التخزين المؤقت من جوجل ميتة تمامًا",
    "originLink": "https://www.seroundtable.com/google-cache-dead-38112.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640845",
    "commentBody": "",
    "originSummary": [
      "قامت جوجل بتعطيل ميزة Google Cache بشكل كامل، وهي ميزة كانت تُستخدم سابقًا للوصول إلى الصفحات عندما تفشل في التحميل.",
      "يتم الآن توجيه المستخدمين لاستخدام آلة Wayback أو أداة فحص الروابط في Google Search Console كبدائل.",
      "أكد داني سوليفان، مسؤول الاتصال في محرك البحث جوجل، عملية الإزالة وقام بتحديث الوثائق لتعكس هذا التغيير."
    ],
    "commentSummary": [
      "تم إيقاف خدمة Google Cache بالكامل، مما أثار مخاوف بشأن الوصول إلى المحتوى القديم أو المتغير على الويب.",
      "يأمل المستخدمون أن تدعم جوجل أرشيف الإنترنت، الذي يخدم الآن غرضًا مشابهًا.",
      "يعكس الإيقاف اتجاهًا أوسع لدى جوجل في إنهاء الخدمات، مما يؤدي إلى تراجع ثقة المستخدمين."
    ],
    "points": 372,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1727211593
  },
  {
    "id": 41642151,
    "title": "استضافة موقعي باستخدام خادم الويب C الخاص بي",
    "originLink": "https://github.com/cozis/blogtech",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642151",
    "commentBody": "",
    "originSummary": [
      "تم بناء خادم ويب بسيط من الصفر ليكون قويًا للاستخدام على الإنترنت العام دون استخدام البروكسيات العكسية، مما يعرض استمتاع المبدع بتطوير الأدوات المخصصة وتحدي الحكمة التقليدية.",
      "يدعم الخادم HTTP/1.1، التوصيل المتسلسل، الاتصالات المستمرة، وHTTPS (حتى TLS 1.2 باستخدام BearSSL)، مع الحد الأدنى من التبعيات وإعدادات قابلة للتكوين.",
      "تشير المعايير إلى أن الخادم يعمل بشكل تنافسي، حيث يتعامل مع 76974.24 طلبًا في الثانية مقارنة بـ 44227.78 طلبًا في الثانية لـ nginx، على الرغم من افتقاره لبعض الميزات مثل تخزين الملفات الثابتة مؤقتًا وTransfer-Encoding: Chunked."
    ],
    "commentSummary": [
      "شارك أحد المستخدمين تجربته في استضافة موقع باستخدام خادم ويب مخصص بلغة C، مما أثار نقاشًا حول ضرورة وفوائد الوكلاء العكسيين.",
      "تشمل النقاط الرئيسية للنقاش ما إذا كانت البروكسيات العكسية ضرورية للأمان والأداء والمرونة التشغيلية، حيث يجادل البعض بأنها تُستخدم غالبًا دون مبرر واضح.",
      "تسلط المقالة الضوء على وجهات نظر مختلفة حول البروكسي العكسي، بما في ذلك أدواره في إنهاء TLS، وتوزيع الأحمال، وإعادة كتابة عناوين URL، وعزل الخادم الأصلي عن التعرض المباشر للإنترنت."
    ],
    "points": 273,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1727221170
  },
  {
    "id": 41641522,
    "title": "هاكر يزرع ذكريات زائفة في ChatGPT لسرقة بيانات المستخدمين بشكل دائم",
    "originLink": "https://arstechnica.com/security/2024/09/false-memories-planted-in-chatgpt-give-hacker-persistent-exfiltration-channel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641522",
    "commentBody": "",
    "originSummary": [
      "اكتشف الباحث الأمني يوهان ريبرغر ثغرة في ميزة الذاكرة طويلة الأمد في ChatGPT، مما يسمح للمهاجمين بزرع معلومات كاذبة وتعليمات ضارة.",
      "أظهر استغلال إثبات المفهوم الذي قدمه ريبرجر استخراج البيانات بشكل مستمر، مما دفع OpenAI إلى إصدار إصلاح جزئي لمنع إساءة استخدام الذاكرة.",
      "يُنصح المستخدمون بمراقبة ومراجعة الذكريات المخزنة بانتظام، حيث يمكن للحقن السريع أن يخزن معلومات ضارة طويلة الأمد على الرغم من الإصلاح."
    ],
    "commentSummary": [
      "تمكن مخترق من زرع ذكريات زائفة في ChatGPT، مما أتاح سرقة بيانات المستخدمين على مدى فترة طويلة.",
      "تسلط هذه الحادثة الضوء على نقاط الضعف في نماذج اللغة الكبيرة (LLMs) مثل ChatGPT، والتي يمكن استغلالها لعرض معلومات مضللة، أو تشويه سمعة الأفراد، أو الترويج لاستشهادات زائفة.",
      "تؤكد المناقشة على القضية الأوسع المتمثلة في اعتماد الجمهور المفرط على نماذج اللغة الكبيرة للحصول على معلومات دقيقة، على الرغم من ميلها إلى إنتاج مخرجات تبدو معقولة لكنها غير صحيحة أو ضارة."
    ],
    "points": 243,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1727215983
  },
  {
    "id": 41643700,
    "title": "المعهد الوطني للمعايير والتكنولوجيا (NIST) سيمنع اشتراط تكوين كلمات مرور محددة من حيث الأحرف",
    "originLink": "https://mastodon.social/@LukaszOlejnik/113193089731407165",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643700",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قام المعهد الوطني للمعايير والتكنولوجيا (NIST) بتحديث إرشاداته ليمنع بشكل صريح متطلبات تكوين كلمات المرور المحددة، مثل اشتراط خلط أنواع مختلفة من الأحرف أو حظر تكرار الأحرف بشكل متتالٍ.",
      "تذكر الإرشادات المحدثة الآن أن المدققين ومقدمي خدمات الاعتماد (CSPs) \"يجب ألا\" يفرضوا هذه القواعد التكوينية، منتقلة من النصيحة السابقة إلى متطلب صارم.",
      "هذا التغيير مهم لأنه يهدف إلى تبسيط سياسات كلمات المرور وتقليل العبء على المستخدمين، على الرغم من أن إرشادات NIST ليست إلزامية ولا تضع السياسات بشكل مباشر."
    ],
    "points": 240,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1727238636
  },
  {
    "id": 41640812,
    "title": "حول أبحاث الذكاء الاصطناعي المؤثرة",
    "originLink": "https://github.com/okhat/blog/blob/main/2024.09.impact.md",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640812",
    "commentBody": "",
    "originSummary": [
      "يُشجَّع طلاب الدراسات العليا على التركيز على المشاريع طويلة الأمد والآثار البحثية المؤثرة مثل النماذج أو المعايير، بدلاً من مجرد زيادة عدد الأوراق البحثية.",
      "اختيار المشكلات في الوقت المناسب والتي لها تأثير كبير محتمل والتكرار بسرعة لحل المشكلات الصعبة هي استراتيجيات رئيسية لأبحاث الذكاء الاصطناعي المؤثرة.",
      "التفاعل مع المجتمع، وجعل الإصدارات مفتوحة المصدر قابلة للاستخدام، ودمج الأبحاث الجديدة مع المشاريع الجارية هي أمور أساسية لبناء والحفاظ على أبحاث الذكاء الاصطناعي المؤثرة."
    ],
    "commentSummary": [
      "ينصح الباحثون الكبار بالتركيز على المشاريع ذات التأثير الكبير بدلاً من النشر المتكرر، لكن الباحثين الصغار غالباً ما يشعرون بالضغط للنشر من أجل التقدم في مسيرتهم المهنية.",
      "النظام الأكاديمي الحالي يعطي الأولوية للكم على الجودة، مما يؤدي إلى وجود العديد من الأوراق التافهة، والتي يمكن أن تعيق الاعتراف بالأعمال الهامة.",
      "التعاون والتواصل الفعّال ضروريان لمسيرة بحثية ناجحة، على الرغم من أن الباحثين في بداية مسيرتهم قد يجدون صعوبة في تحقيق التوازن بين المشاريع المؤثرة والحاجة إلى النشر المتكرر."
    ],
    "points": 238,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1727211389
  },
  {
    "id": 41646531,
    "title": "لماذا ما زلت أدوّن بعد 15 عامًا",
    "originLink": "https://www.jonashietala.se/blog/2024/09/25/why_i_still_blog_after_15_years/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41646531",
    "commentBody": "",
    "originSummary": [
      "يتأمل الكاتب في الحفاظ على مدونة لمدة 15 عامًا، بدأت في البداية لتوثيق تطوير نماذج الألعاب الأولية وتطورت لتصبح مجلة أوسع للبرمجة والمشاريع الشخصية.",
      "الدوافع الرئيسية لمواصلة التدوين تشمل الاستمتاع بالكتابة، وضوح الفكر، المساءلة، التوثيق، التحسين الذاتي، وتطوير المهارات.",
      "لقد تطورت البنية التقنية للمدونة بشكل كبير، بدءًا من PHP والانتقال عبر Perl وJekyll وHakyll وRust، مما يعكس رحلة الكاتب ونموه في البرمجة."
    ],
    "commentSummary": [
      "يواصل يوناس هيتالا التدوين بعد 15 عامًا، بشكل أساسي من أجل الرضا الشخصي بدلاً من الجمهور.",
      "يتناقض هذا مع تركيز الجيل الجديد على تحقيق الدخل من المحتوى، مما يبرز انقسامًا في المواقف تجاه التدوين.",
      "يؤكد المعلقون على فوائد التدوين من أجل الاستمتاع الشخصي، وتحسين المهارات، والحفاظ على المعرفة، على الرغم من زيادة المحتوى التجاري."
    ],
    "points": 236,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1727266769
  },
  {
    "id": 41650047,
    "title": "أوريون، أول نظارات واقع معزز حقيقية لدينا",
    "originLink": "https://about.fb.com/news/2024/09/introducing-orion-our-first-true-augmented-reality-glasses/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41650047",
    "commentBody": "",
    "originSummary": [
      "أوريون، أحدث نظارات الواقع المعزز، تدمج شاشات هولوغرافية كبيرة، وذكاء اصطناعي سياقي، وتصميم خفيف الوزن للاستخدام اليومي، مما يجسر بين العوالم المادية والافتراضية.",
      "يتميز بأكبر مجال رؤية في أصغر شكل، ويدعم Meta AI للمساعدة والتواصل بدون استخدام اليدين، على الرغم من أنه لا يزال نموذجًا أوليًا قيد التطوير.",
      "يهدف أوريون إلى تعزيز وجود المستخدم في العالم المادي أثناء الوصول إلى الفوائد الرقمية، مع التركيز في الإصدارات المستقبلية على تحسين جودة الصور، وتقليل الحجم، وجعلها أكثر تكلفة."
    ],
    "commentSummary": [
      "كشفت شركة ميتا عن نظارتها الأولى للواقع المعزز (AR) والتي تحمل اسم أوريون، لكنها لم تُطرح للبيع بعد.",
      "يتميز جهاز أوريون بتقنية متقدمة، بما في ذلك وحدة حوسبة لاسلكية، ومجال رؤية بزاوية 70 درجة، ودقة عالية تكفي لقراءة النصوص، بالإضافة إلى سوار معصم يكتشف حركات اليد.",
      "التكلفة العالية للتصنيع، خاصة بسبب عدسات كربيد السيليكون، تشكل تحديًا كبيرًا، حيث تكلف كل وحدة حوالي 10,000 دولار لإنتاجها."
    ],
    "points": 233,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1727287013
  },
  {
    "id": 41641274,
    "title": "لماذا تكون معظم نتائج الأبحاث المنشورة خاطئة (2005)",
    "originLink": "https://journals.plos.org/plosmedicine/article?id=10.1371/journal.pmed.0020124",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41641274",
    "commentBody": "",
    "originSummary": [
      "يجادل مقال جون ب. أ. إيوانيديس \"لماذا تكون معظم نتائج الأبحاث المنشورة خاطئة\" بأن جزءًا كبيرًا من نتائج الأبحاث المنشورة خاطئة بسبب عوامل مختلفة مثل قوة الدراسة، والتحيز، ومرونة تصميم الدراسة.",
      "الدراسات الأصغر، وأحجام التأثير الأصغر، والمصالح المالية، والفرق البحثية المتعددة تزيد من احتمال النتائج الخاطئة، مما يبرز الحاجة إلى دراسات ذات قوة أفضل ومعايير بحث محسنة.",
      "يؤكد إيوانيديس على أهمية التفكير النقدي والتعرف على التحيزات عند تفسير نتائج الأبحاث لتحسين موثوقية النتائج العلمية."
    ],
    "commentSummary": [
      "تجادل ورقة عام 2005 بعنوان \"لماذا تكون معظم النتائج البحثية المنشورة خاطئة\" لجون إيوانيديس بأن العديد من النتائج البحثية من المحتمل أن تكون خاطئة بسبب التحيزات، وحجم العينات الصغيرة، وقضايا أخرى.",
      "تسلط المناقشة الضوء على تأثيرات الورقة البحثية عبر مختلف المجالات، وتأثير مراجعة الأقران، والضغوط التي يتعرض لها الباحثون للنشر.",
      "يؤكد النقاش على الحاجة إلى ممارسات بحثية أفضل والتشكيك في الدراسات الفردية، خاصةً بالنظر إلى موقف إيوانيديس المثير للجدل خلال جائحة كوفيد-19."
    ],
    "points": 214,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1727214350
  },
  {
    "id": 41642487,
    "title": "اختراق GPON – كيفية الوصول وتغيير وتحرير وحدات الألياف الضوئية (ONTs)",
    "originLink": "https://hack-gpon.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642487",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة دليلًا شاملاً حول كيفية الوصول إلى وحدات الشبكة البصرية (ONTs) وتعديلها واستكشاف مشكلاتها، وهي أجهزة تُستخدم في شبكات الألياف البصرية.",
      "يسلط الضوء على التحديات المتعلقة بالتبديل بين وحدات الشبكة الضوئية الخارجية (ONTs) ووحدات الإدخال القابلة للتوصيل صغيرة الحجم (SFP) بسبب البرامج الثابتة والإعدادات الخاصة بالبائع ومزود خدمة الإنترنت.",
      "تتضمن المشاركة تحذيرات بشأن المخاطر المحتملة، مثل تلف الجهاز وحظر الخدمة، وتؤكد أن المعلومات يتم الحفاظ عليها من قبل مجتمع من الهواة، وليس من قبل البائعين الرسميين."
    ],
    "commentSummary": [
      "تتمحور المناقشة حول إيجابيات وسلبيات استخدام محطات الشبكة البصرية (ONTs) التي يوفرها مزود خدمة الإنترنت مقابل الأجهزة التي يمتلكها العميل، مع تسليط الضوء على الموازنة بين سهولة الترقية والتخصيص.",
      "أمثلة من دول مختلفة توضح نهجًا تنظيميًا وتجارب عملاء متنوعة، مما يؤكد على الطابع العالمي للنقاش.",
      "يتم أيضًا مناقشة الجوانب التقنية مثل تكامل ONT مع أجهزة التوجيه، وتأثير الشبكة، والمخاوف الأمنية، حيث يشارك المستخدمون تجاربهم الشخصية في تعديل ONTs لتحسين الأداء."
    ],
    "points": 210,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1727224865
  },
  {
    "id": 41640005,
    "title": "ما وراء المسار: تقديم بيانات سرعة حافلات MTA التفصيلية",
    "originLink": "https://new.mta.info/article/beyond-route-introducing-granular-mta-bus-speed-data",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640005",
    "commentBody": "",
    "originSummary": [
      "أطلقت هيئة النقل الحضرية (MTA) مجموعة بيانات سرعات مقاطع خطوط الحافلات على منصة البيانات المفتوحة، مما يوفر معلومات مفصلة عن سرعات الحافلات عبر شبكتها.",
      "تتضمن مجموعة البيانات هذه، المستمدة من أنظمة GPS، عوامل مثل التوقفات وحركة المرور، مما يساعد في تحليل وتحديد المناطق البطيئة لتحسين خدمات الحافلات.",
      "يتم تحديث البيانات شهريًا وهي متاحة على بوابة البيانات المفتوحة لولاية نيويورك، حيث تشجع هيئة النقل الحضرية العامة الجمهور على الاستكشاف وتقديم الملاحظات."
    ],
    "commentSummary": [
      "غالبًا ما تتبع خطوط الحافلات في مدينة نيويورك مسارات الترام القديمة، حيث لا تزال العديد من القضبان موجودة تحت الرصيف.",
      "تشير المناقشات إلى أن عربات الترام، إذا تم فصلها عن حركة المرور، يمكن أن تكون أكثر كفاءة من الحافلات، على الرغم من التكاليف الأعلى والتحديات السياسية.",
      "تمت الإشادة ببيانات سرعة الحافلات التفصيلية الجديدة لهيئة النقل الحضرية ومبادرات البيانات المفتوحة في مدينة نيويورك، مع الآمال بأن يؤدي تحليل البيانات إلى تحسين حلول النقل."
    ],
    "points": 207,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1727205963
  },
  {
    "id": 41642313,
    "title": "الالتزام باستخدام لغة Rust في نواة النظام",
    "originLink": "https://lwn.net/SubscriberLink/991062/b0df468b40b21f5d/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642313",
    "commentBody": "",
    "originSummary": [
      "في قمة Maintainers لعام 2024، ناقش ميغيل أوجيدا تقدم ومستقبل دمج لغة Rust في نواة لينكس، مشددًا على الحاجة إلى المرونة من قبل مديري الأنظمة الفرعية.",
      "شملت المناقشات الرئيسية الحاجة إلى دعم أفضل للأدوات، ومجمعات مستقرة، وتوثيق شامل لكتابة كود نظام الملفات بلغة Rust.",
      "شجع لينوس تورفالدس المطورين على الاستمرار في دمج لغة Rust، مشيرًا إلى أن دمج أول برنامج تشغيل حقيقي سيكون علامة فارقة مهمة، وأبرز الأجواء التعاونية في القمة."
    ],
    "commentSummary": [
      "ذكر لينوس تورفالدس أن فهم لغة Rust ليس ضروريًا لدمجها في نظام فرعي، تمامًا كما أن ليس الجميع يفهم نظام إدارة الذاكرة ولكن يمكنهم العمل معه.",
      "يتم دمج لغة Rust في نواة نظام التشغيل لينكس، خاصة في برامج التشغيل، بدعم من شركات كبرى مثل جوجل، بهدف تحسين الأمان والموثوقية.",
      "هناك مخاوف بشأن التوافق والسلامة بين Rust وC، مما يتطلب معرفة كبيرة بـRust، وقد أعرب بعض مطوري النواة عن شكوكهم بسبب مشاكل في دلالات API والحاجة إلى توثيق أفضل."
    ],
    "points": 194,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1727222881
  },
  {
    "id": 41645173,
    "title": "إعادة هيكلة: من Redis إلى SQLite",
    "originLink": "https://wafris.org/blog/rearchitecting-for-sqlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41645173",
    "commentBody": "",
    "originSummary": [
      "تقوم شركة Wafris، وهي شركة جدار حماية لتطبيقات الويب مفتوحة المصدر، بنقل عميل الوسيط الخاص بها في Rails من Redis إلى SQLite لمعالجة مشكلات النشر وتحسين الأداء.",
      "تم اختيار SQLite بسبب تقليل زمن الانتقال في الشبكة وأدائه الأفضل في العمليات التي تعتمد بشكل كبير على القراءة، حيث أظهر تحسنًا في السرعة بمقدار 3 مرات مقارنة بـ Redis في الاختبارات المحلية.",
      "تبسط الهندسة الجديدة عملية النشر، وتعزز تجربة المستخدم، وتزيد من قابلية التوسع من خلال مزامنة قواعد البيانات مع كل وحدة حسابية، مع معالجة الكتابات بشكل غير متزامن للتخفيف من قيود SQLite في المهام التي تتطلب كتابة مكثفة."
    ],
    "commentSummary": [
      "في مؤتمر RailsWorld 2023، كان هناك نقاش حول ضرورة استخدام Redis لتطبيقات Rails، حيث تساءل البعض عما إذا كان لا يزال ضروريًا بسبب تغييرات الترخيص أو إذا كان الوضع يتطلب تطبيق مبدأ \"أنت لن تحتاجه\" (YAGNI).",
      "تستكشف المقالة فكرة استخدام SQLite بدلاً من Redis لبعض حالات الاستخدام، مثل الوظائف غير المتزامنة وتكوينات أعلام الميزات، مسلطة الضوء على كفاءة SQLite وبساطتها.",
      "شارك العديد من المساهمين تجاربهم ونماذجهم، بما في ذلك استخدام SQLite لقواعد جدار الحماية لتطبيقات الويب، وأعلام الميزات، وبيانات التكوين، مؤكدين على أدائها وسهولة استخدامها مقارنةً بقواعد البيانات التقليدية مثل Redis."
    ],
    "points": 189,
    "commentCount": 60,
    "retryCount": 0,
    "time": 1727253468
  },
  {
    "id": 41643651,
    "title": "نصائح وحيل SQL",
    "originLink": "https://github.com/ben-n93/SQL-tips-and-tricks",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41643651",
    "commentBody": "",
    "originSummary": [
      "تقدم المقالة قائمة شاملة من النصائح والحيل في SQL موجهة لمحللي البيانات، مع التأكيد على أن بعض النصائح قد لا تنطبق على جميع أنظمة إدارة قواعد البيانات العلائقية (RDBMS).",
      "تشمل المجالات الرئيسية التي يتم تغطيتها التنسيق/سهولة القراءة، الميزات المفيدة، والأخطاء الشائعة التي يجب تجنبها، مما يساعد المستخدمين على كتابة استعلامات SQL أكثر كفاءة وقابلية للقراءة والصيانة.",
      "تشمل النقاط البارزة استخدام الفواصل الرائدة لتحسين القراءة، واستخدام تعبيرات الجدول الشائعة (CTEs) للاستعلامات المعقدة، وفهم سلوك `NOT IN` مع القيم NULL."
    ],
    "commentSummary": [
      "تشارك المنشور نصائح وحيل متنوعة في SQL، مع التركيز على تحسين الأداء وأفضل الممارسات لكتابة استعلامات فعالة.",
      "تشمل الاقتراحات الرئيسية استخدام EXISTS بدلاً من IN، وإضافة الفهارس لعبارات GROUP BY، والاستفادة من الاستعلامات الفرعية لتحسين الأداء.",
      "تسلط المناقشة الضوء على أهمية فهم الخصائص والمزايا المحددة لأنظمة إدارة قواعد البيانات المختلفة مثل بوستجريس وSQL Server."
    ],
    "points": 184,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1727238048
  },
  {
    "id": 41642969,
    "title": "رؤى بعد 11 عامًا مع Datomic [فيديو]",
    "originLink": "https://www.youtube.com/watch?v=YSgTQzHYeLU",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41642969",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تحولت قاعدة البيانات داتوميك، المعروفة بثباتها واستعلاماتها الزمنية، إلى مجانية لكنها لا تزال ملكية، مما أثار اهتمامًا ونقاشًا متجددًا في مجتمع التكنولوجيا.",
      "على الرغم من ميزاته المبتكرة، يواجه Datomic انتقادات بسبب تعقيد إعداده، وقلة التكامل مع اللغات غير المعتمدة على JVM، واعتماده على شركة صغيرة للدعم.",
      "تُبرز المقارنات مع قواعد بيانات أخرى مثل PostgreSQL وXTDB التنازلات، مثل لغات الاستعلام غير المألوفة ومخاوف الأداء، مما يجعل Datomic خيارًا متخصصًا لحالات استخدام معينة."
    ],
    "points": 181,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1727229912
  },
  {
    "id": 41640789,
    "title": "كارولين إليسون حُكم عليها بالسجن لمدة سنتين",
    "originLink": "https://www.nytimes.com/2024/09/24/technology/caroline-ellison-ftx-sentence.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41640789",
    "commentBody": "",
    "originSummary": [
      "تم الحكم على كارولين إليسون، المستشارة السابقة لمؤسس FTX سام بانكمان-فرايد، بالسجن لمدة عامين لدورها في عملية الاحتيال التي بلغت قيمتها 8 مليارات دولار والتي أدت إلى انهيار FTX.",
      "على الرغم من تعاونها مع المدعين وشهادتها ضد بانكمان-فريد، الذي يقضي عقوبة بالسجن لمدة 25 عامًا، أشار القاضي لويس أ. كابلان إلى خطورة الاحتيال.",
      "إليسون، التي أعربت عن ندم عميق، ستتوجه إلى سجن ذو حد أدنى من الحراسة في بوسطن بحلول 7 نوفمبر وقد واجهت صعوبة في العثور على عمل منذ اعترافها بالذنب."
    ],
    "commentSummary": [
      "تلقت كارولين إليسون حكمًا بالسجن لمدة عامين بسبب تورطها في احتيال FTX، مما أثار غضبًا عامًا بسبب ما يُعتبر تساهلًا.",
      "كان تعاونها مع المدعين في القضية ضد سام بانكمان-فريد عاملاً رئيسياً في تخفيف عقوبتها.",
      "أعاد هذا القضية إشعال النقاشات حول العدالة في النظام القضائي الأمريكي، لا سيما التفاوت في الأحكام بين الجرائم المالية والجرائم البسيطة، التي تؤثر غالبًا على المجتمعات المهمشة."
    ],
    "points": 173,
    "commentCount": 221,
    "retryCount": 0,
    "time": 1727211237
  }
]
