[
  {
    "id": 41585156,
    "title": "காமிக் மோனோ",
    "originLink": "https://dtinth.github.io/comic-mono-font/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585156",
    "commentBody": "",
    "originSummary": [
      "Comic Mono என்பது Shannon Miwa உருவாக்கிய Comic Shanns (பதிப்பு 1) இலிருந்து பெறப்பட்ட புதிய ஒரே அகல எழுத்துரு ஆகும், இதில் அனைத்து எழுத்துக்களும் ஒரே அகலத்துடன் காணப்படுகின்றன மற்றும் சிறந்த காட்சிக்காக அளவுருக்கள் சரிசெய்யப்பட்டுள்ளன.",
      "எழுத்துரு ஒரு பைதான் ஸ்கிரிப்ட் மற்றும் ஃபாண்ட் ஃபோர்ஜ் பயன்படுத்தி உருவாக்கப்பட்டது, மேலும் ஃபாண்ட் ஃபோர்ஜின் எம்போல்டன் செயல்முறையின் மூலம் ஒரு தடித்த பதிப்பு உருவாக்கப்பட்டது.",
      "Comic Mono MIT உரிமத்தின் கீழ் பதிவிறக்கம் மற்றும் பயன்பாட்டிற்கு கிடைக்கிறது, மேலும் CDN, npm, மற்றும் லினக்ஸ் தொகுப்புகள் மூலம் கூடுதல் விநியோக விருப்பங்களும் உள்ளன."
    ],
    "commentSummary": [
      "காமிக் மோனோ, காமிக் சான்ஸால் ஈர்க்கப்பட்ட ஒரு ஒரே இடைவெளி கொண்ட எழுத்துரு, குறியீட்டு எழுதுவதை மேலும் மகிழ்ச்சிகரமாகவும் கண்களுக்கு எளிதாகவும் மாற்றுவதற்காக கவனம் பெற்றுள்ளது.",
      "பயனர்கள் காமிக் மோனோவை காமிக் கோடு போன்ற பிற எழுத்துருக்களுடன் ஒப்பிடுகின்றனர், வாசிப்புத் திறன் மற்றும் அழகியல் வேறுபாடுகளை கவனித்து, சிலர் அதன் மெருகூட்டப்பட்ட தோற்றத்திற்காக காமிக் கோடை விரும்புகின்றனர்.",
      "இந்த விவாதம் காமிக் சான்ஸ்-பாணி எழுத்துருக்களை கண் சோர்வை குறைக்கவும், வாசிப்பு சிரமத்திற்கு உதவவும் பயன்படுத்துவதைக் குறிப்பிடுகிறது, இவ்வெழுத்துருக்களின் நடைமுறையான பக்கத்தை வெளிப்படுத்துகிறது."
    ],
    "points": 404,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1726691788
  },
  {
    "id": 41584486,
    "title": "LinkedIn இப்போது அனைவரின் உள்ளடக்கத்தையும் தங்களின் AI கருவியை பயிற்சி செய்ய பயன்படுத்துகிறது",
    "originLink": "https://twitter.com/RachelTobac/status/1836471586624540705",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41584486",
    "commentBody": "",
    "originSummary": [
      "LinkedIn தானாகவே அதன் AI கருவியை பயிற்சி செய்ய பயனர் உருவாக்கிய உள்ளடக்கத்தை பயன்படுத்தி வருகிறது, இது தனியுரிமை குறித்த கவலைகளை எழுப்புகிறது.",
      "பயனர்கள் அமைப்புகள் மற்றும் தனியுரிமை > தரவுத் தனியுரிமை > உருவாக்கும் AI மேம்பாட்டிற்கான தரவுகள் என்ற இடத்திற்கு சென்று அதை அணைக்குமாறு அறிவுறுத்தப்படுகிறார்கள்.",
      "பயனர் தரவுப் தனியுரிமையை பாதுகாக்க அமைப்புகள் தானாகவே சேர்க்கப்படுவதை நிறுத்த வேண்டும் என்ற பரிந்துரை விரிவடைகிறது."
    ],
    "commentSummary": [
      "LinkedIn தனது AI கருவியைப் பயிற்றுவிக்க பயனர் உள்ளடக்கத்தைப் பயன்படுத்துகிறது, இது உள்ளடக்கத்தின் தரம் மற்றும் உண்மைத்தன்மை குறித்து கலவையான எதிர்வினைகளை ஏற்படுத்துகிறது.",
      "தனியுரிமை குறித்த கவலைகள் எழுந்துள்ளன, ஏனெனில் பயனர்கள் வெளிப்படையான சம்மதம் இல்லாமல் தானாகவே பதிவு செய்யப்பட்டுள்ளனர், ஆனால் ஜிடிபிஆர் விதிமுறைகளால் ஐரோப்பிய ஒன்றிய பயனர்கள் விலக்கப்பட்டுள்ளனர்.",
      "விமர்சகர்கள், லிங்க்ட்இன் தனது முக்கிய அம்சங்களை மேம்படுத்துவதற்கு முன்னுரிமை கொடுக்க வேண்டும் என்று வாதிடுகின்றனர், சில பயனர்கள் பிளாட்ஃபார்மை விட்டு வெளியேற அல்லது விலக விரும்புகின்றனர்."
    ],
    "points": 398,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1726688248
  },
  {
    "id": 41588200,
    "title": "என் மகன் குருடாக இருக்கலாம் – சிறந்த ஆதரவை எவ்வாறு வழங்குவது",
    "originLink": "https://news.ycombinator.com/item?id=41588200",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588200",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "பெற்றோர்கள் தங்கள் குழந்தையின் பார்வை இழப்பை பற்றிய கவலையுடன் ஆதரவு மற்றும் ஆலோசனைகளைத் தேடுகின்றனர்.",
      "சுயாதீனத்தை ஊக்குவித்தல், சமவயதினருடன் ஒருங்கிணைத்தல், மற்றும் பிரெயில் நிறுவனம் மற்றும் அமெரிக்க குருடர் அறக்கட்டளை போன்ற அமைப்புகளின் வளங்களைப் பயன்படுத்துதல் ஆகியவை பரிந்துரைகளில் அடங்கும்.",
      "தனிப்பட்ட கதைகள் எக்கோலோக்கேஷன் மற்றும் குருட்டு குழந்தைகளை வழக்கமான செயல்பாடுகளில் ஒருங்கிணைப்பது போன்ற வெற்றிகரமான உத்திகளை வெளிப்படுத்துகின்றன."
    ],
    "points": 286,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1726716463
  },
  {
    "id": 41587214,
    "title": "நிண்டெண்டோ, பாக்கெட்பேர், இங்கிற்கு எதிராக காப்புரிமை மீறல் வழக்கை தொடர்கிறது",
    "originLink": "https://www.nintendo.co.jp/corporate/release/en/2024/240919.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41587214",
    "commentBody": "",
    "originSummary": [
      "நின்டெண்டோ மற்றும் தி போகிமான் கம்பெனி, பாக்கெட்பேர், இன்க். க்கு எதிராக டோக்கியோ மாவட்ட நீதிமன்றத்தில் காப்புரிமை மீறல் வழக்கை தொடர்ந்துள்ளனர்.",
      "Pocketpair இன் Palworld என்ற விளையாட்டு பல காப்புரிமை உரிமைகளை மீறுகிறது என்று வழக்கு கூறுகிறது, தடையுத்தரவு மற்றும் இழப்பீடு நஷ்டஈடு கோருகிறது.",
      "நிண்டெண்டோ, நிண்டெண்டோ பிராண்ட் உட்பட தனது அறிவுசார் சொத்து உரிமைகளை பாதுகாக்கும் தனது உறுதிப்பாட்டை, தேவையான சட்ட நடவடிக்கைகள் மூலம் வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "நின்டெண்டோ, Pocketpair, Inc. நிறுவனத்திற்கு எதிராக அவர்களின் Palworld என்ற விளையாட்டை மையமாகக் கொண்டு, கேம் மெக்கானிக்ஸ்களை மையமாகக் கொண்டு, காப்புரிமை மீறல் வழக்கை தொடங்கியுள்ளது.",
      "Pocketpair சட்ட பிரதிநிதித்துவத்தை ஈடுபடுத்தி, கேமிங் துறையில் மென்பொருள் காப்புரிமைகளின் சிக்கல்கள் மற்றும் சர்ச்சைகளை வலியுறுத்தி, குற்றச்சாட்டுகளை எதிர்க்கிறது.",
      "இந்த வழக்கு, விளையாட்டு மேம்பாடு மற்றும் புதுமை மீது மென்பொருள் காப்புரிமைகளின் பரிமாணம் மற்றும் தாக்கம் குறித்த தொடர்ச்சியான விவாதத்தை கவனத்திற்கு கொண்டு வருகிறது."
    ],
    "points": 283,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1726706266
  },
  {
    "id": 41591622,
    "title": "பிவோட்டல் டிராக்கர் மூடப்படும்",
    "originLink": "https://www.pivotaltracker.com/blog/2024-09-18-end-of-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591622",
    "commentBody": "",
    "originSummary": [
      "VMware Tanzu, Pivotal Tracker இன் வாழ்க்கை முடிவை (EOL) ஏப்ரல் 30, 2025 முதல் அறிவித்துள்ளது, அதுவரை ஆதரவு வழங்கப்படும்.",
      "அனைத்து கணக்குகளும் (இலவசம், அனுசரிக்கப்பட்டது, கட்டண, நிறுவன) பாதிக்கப்படுகின்றன, மற்றும் பயனர்கள் சேவை முடிவதற்கு முன் தங்கள் தரவுகளை ஏற்றுமதி செய்ய வேண்டும்; உதவி மையத்தில் வழிமுறைகள் கிடைக்கின்றன.",
      "புதிய பதிவு செய்ய முடியாது, ஆனால் உள்ள கணக்குகள் இன்னும் புதிய பயனர்களை கூட்டாளி வரம்புகளுக்குள் அழைக்க முடியும்."
    ],
    "commentSummary": [
      "Pivotal Tracker மூடப்பட உள்ளது, இதனால் நவீன தொழில்நுட்பங்களைப் பயன்படுத்தி விரும்பப்படும் தயாரிப்பை டெவலப்பர்கள் குளோன் செய்ய ஒரு வாய்ப்பு உருவாகிறது.",
      "VMware இன் பரந்த அளவிலான உத்தியோகபூர்வ திட்டத்தின் ஒரு பகுதியாக, Broadcom க்கு வாங்கப்பட்ட பிறகு, இந்த சேவை நிறுத்தப்படுகிறது, மற்றும் பயனர்கள் தங்கள் தரவுகளை சேவை முடிவதற்கு முன் மாற்றுமாறு அறிவுறுத்தப்படுகிறார்கள்.",
      "மாற்று வழிகள், லினியர் மற்றும் ஷார்ட்கட் போன்றவை உள்ளன, ஆனால் பிவோட்டல் டிராக்கரின் எளிமை மற்றும் கவனம் அதன் பயனர்களால் மிகவும் மதிக்கப்படுகிறது."
    ],
    "points": 221,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1726752315
  },
  {
    "id": 41585249,
    "title": "Cloudflare Hetzner ஐபிகளை ஈரானில் இருப்பதாக தவறாக அடையாளம் காண்கிறது",
    "originLink": "https://gitlab.com/gitlab-com/gl-infra/production/-/issues/8121#note_1237201726",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585249",
    "commentBody": "",
    "originSummary": [
      "GitLab இல் CI (தொடர்ச்சியான ஒருங்கிணைப்பு) கட்டுமான வேலைகளில் அதிக தோல்வி விகிதங்கள் பதிவாகின்றன, குறிப்பாக registry.gitlab.com இல் இருந்து Docker படங்களை இழுக்கும் போது Hetzner.de VPSes இல் இருந்து இடைக்கிடை நேரம் முடிவதனால்.",
      "பிழை செய்தி தலைப்புகளை காத்திருக்கும் போது ஒரு கிளையன்ட் நேரம் முடிவடைந்ததை குறிக்கிறது, மற்றும் சில நேரங்களில் பைப்லைனை மறுதொடக்கம் செய்வது உதவுகிறது, பல முறை முயற்சித்தும் சமீபத்தில் பிரச்சினையை தீர்க்க முடியவில்லை.",
      "பிரச்சனை registry.gitlab.com க்கு குறிப்பாகத் தோன்றுகிறது, ஏனெனில் பல GitLab களஞ்சியங்களிலிருந்து git clones இல் இதே போன்ற தோல்விகள் ஏற்படவில்லை, இது Docker படிம களஞ்சிய சேவையுடன் ஒரு பிரச்சனை இருப்பதை示ிக்கிறது."
    ],
    "commentSummary": [
      "கிளவுட்ஃப்ளேர் ஹெட்ஸ்னர் ஐபி முகவரிகளை ஈரானில் உள்ளதாக தவறாக அடையாளம் காண்கிறது, இதனால் பயனர் அணுகல் சிக்கல்கள் ஏற்படுகின்றன.",
      "இந்த தவறான அடையாளம் காணும் பிரச்சனை Cloudflare க்கு மட்டும் அல்ல; Google இதே போன்ற சிக்கல்களை சந்தித்துள்ளது.",
      "இந்த விவாதம், ஒரு நாட்டு குடியுரிமை மற்றும் அந்த நாட்டின் புகழ், சேவைகள், பயணம் மற்றும் வாய்ப்புகளுக்கு எப்படி பாதிப்பை ஏற்படுத்துகிறது என்பதையும், அரசாங்க அதிகாரிகளுக்கு விடுதலை அளிக்கும் பொருட்டு, சாதாரண குடிமக்களுக்கு அதிகமாக தண்டனைகள் பாதிப்பை ஏற்படுத்தும் என்பதையும் விளக்குகிறது."
    ],
    "points": 198,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1726692368
  },
  {
    "id": 41592552,
    "title": "கண்ணாடி அன்டெனா ஜன்னல்களை 5G அடிப்படை நிலையங்களாக மாற்றுகிறது",
    "originLink": "https://spectrum.ieee.org/5g-antenna-transparent-window",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41592552",
    "commentBody": "",
    "originSummary": [
      "ஆராய்ச்சியாளர்கள் ஜன்னல்களை 5G அடிப்படை நிலையங்களாக மாற்றக்கூடிய கண்ணாடி ஆண்டெனாக்களை உருவாக்கியுள்ளனர், இது செல்ஃபோன் கவரேஜை மேம்படுத்துவதோடு, கண்கொள்ளாதவாறு இருக்கும்.",
      "இந்த ஆண்டெனாக்கள் வெளிப்படையான மின்கடத்தும் அடுக்குகளைப் பயன்படுத்துகின்றன, இதனால் ஜன்னல்கள் தங்கள் வெளிப்படைத்தன்மையை பராமரிக்கும்போது 5G செல்யுலார் ஆண்டெனாக்களாக செயல்பட முடியும்.",
      "இந்த புதுமை நகர்ப்புற பகுதிகளில் 5G நெட்வொர்க் கவரேஜை குறிப்பிடத்தக்க அளவில் மேம்படுத்தக்கூடும், ஏற்கனவே உள்ள ஜன்னல் மேற்பரப்புகளை பயன்படுத்துவதன் மூலம்."
    ],
    "commentSummary": [
      "கண்ணாடி ஆண்டினாக்கள் ஜன்னல்களை 5G அடிப்படை நிலையங்களாக மாற்றி, நிறுவல் செலவுகளை குறைத்து, கவரேஜை மேம்படுத்தக்கூடும்.",
      "தொழில்நுட்பம் 5G சிக்னல்களை குறைந்த ஈ கண்ணாடி வழியாக பரிமாறுவதற்கு வெளிப்படையான ஆண்டெனாக்களை பயன்படுத்துகிறது, இது பொதுவாக இந்த அதிர்வெண்களை தடுக்கிறது, உட்புற ஆண்டெனா அமைப்பை அனுமதிக்கிறது.",
      "இந்த கண்டுபிடிப்பின் பரவலான ஏற்றுக்கொள்ளுதலின் தெளிவுத்தன்மை, தோற்றம், பாதுகாப்பு, சக்தி நிலைகள் மற்றும் மொத்த சாத்தியக்கூறுகள் குறித்து கவலைகள் உள்ளன."
    ],
    "points": 186,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1726757612
  },
  {
    "id": 41591018,
    "title": "நான் உருவாக்கிய ஒரு CLI கருவி, இரண்டு கட்டளைகளுடன் ஒரு VPS இல் எந்தவொரு பயன்பாட்டையும் சுயமாக ஹோஸ்ட் செய்ய.",
    "originLink": "https://github.com/MightyMoud/sidekick",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591018",
    "commentBody": "",
    "originSummary": [
      "Sidekick VPS (மெய்நிகர் தனிப்பட்ட சர்வர்) ஹோஸ்டிங்கை எளிமைப்படுத்துகிறது, ஒரு கட்டளையுடன் அமைப்பு, பூஜ்ய இடைவெளி பிரசாரம், மற்றும் உயர் கிடைக்கும் தன்மை போன்ற அம்சங்களுடன்.",
      "இது ஹோஸ்டிங்கை எளிமையாகவும் மலிவாகவும் மாற்றுவதைக் குறிக்கிறது, பக்கத் திட்டங்களுக்கான சிக்கலான அமைப்புகளால் சோர்ந்துபோன பயனர்களை இலக்காகக் கொண்டுள்ளது.",
      "முக்கிய செயல்பாடுகளில் Dockerfiles-இல் இருந்து பயன்பாடுகளைப் பரப்புதல், சூழல் ரகசியங்களை பாதுகாப்பாக நிர்வகித்தல், மற்றும் பல டொமைன்களை சுழற்சி இல்லாத SSL சான்றிதழ்களுடன் இணைத்தல் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "ஒரு புதிய CLI கருவி Sidekick வெளியிடப்பட்டுள்ளது, இது பயனர்களுக்கு வெறும் இரண்டு கட்டளைகளில் VPS இல் எந்தவொரு பயன்பாட்டையும் சுயமாக ஹோஸ்ட் செய்ய அனுமதிக்கிறது.",
      "இந்த கருவி TLS/SSL சான்றிதழ்களை அமைத்தல் மற்றும் Docker கண்டெய்னர்களை நிர்வகித்தல் போன்ற பணிகளை எளிதாக்குவதற்காக வடிவமைக்கப்பட்டுள்ளது.",
      "எதிர்கால புதுப்பிப்புகளில் தரவுத்தொகுப்பு ஹோஸ்டிங் மற்றும் டாக்கர்-கம்போஸ் ஆதரவு சேர்க்கப்படும் என்று எதிர்பார்க்கப்படுகிறது, இது எளிதான பிரயோக தீர்வைத் தேடும் டெவலப்பர்களுக்கு பல்துறை விருப்பமாக இருக்கும்."
    ],
    "points": 174,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1726748225
  },
  {
    "id": 41588667,
    "title": "Mozilla அவர்கள் புற்றுநோய் கண்டறியப்பட்ட பிறகு அவர்களின் தலைமை தயாரிப்பு அதிகாரியை நீக்கிவிட்டனர்",
    "originLink": "https://mastodon.social/@stevetex/113162099798398758",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588667",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "மொசில்லா, புற்றுநோய் கண்டறியப்பட்டதைத் தொடர்ந்து, அவர்களின் தலைமை தயாரிப்பு அதிகாரியை நீக்கியுள்ளது, இது பரவலான சர்ச்சை மற்றும் விமர்சனத்தை ஏற்படுத்தியுள்ளது.",
      "பயனர்கள் மொசில்லாவை ஒழுங்கற்ற ஸ்டார்ட்அப்கள் மற்றும் ஹெட்ஜ் ஃபண்ட்களுடன் ஒப்பிட்டு, ஏமாற்றத்தை வெளிப்படுத்தி, சிலர் லேடிபர்டு, லிப்ரேவுல்ஃப் அல்லது பிரேவ் போன்ற மாற்று உலாவிகளை பரிந்துரைக்கின்றனர்.",
      "இந்த சம்பவம் வேலைக்கழக நெறிமுறைகள், DEI (பல்வேறு, சமநிலை, மற்றும் உட்சேர்க்கை) கொள்கைகள், மற்றும் மொசில்லா இல்லாமல் ஃபயர்பாக்ஸின் எதிர்காலம் பற்றிய விவாதங்களை தூண்டியுள்ளது."
    ],
    "points": 169,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1726722013
  },
  {
    "id": 41591449,
    "title": "சிலி. மசாலாவின் ரஸ்ட் போர்ட், குறைந்த மேலதிக செலவுடைய இணைநிலை நூலகம்",
    "originLink": "https://github.com/dragostis/chili",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591449",
    "commentBody": "",
    "originSummary": [
      "Chili என்பது Spice என்ற குறைந்த செலவிலான இணைபயன்பாட்டு நூலகத்தின் Rust போர்ட் ஆகும், இது எந்த கணக்கீட்டு கிளை புள்ளியிலும் இரண்டு மூடல்களை இணையாக இயக்க வடிவமைக்கப்பட்டுள்ளது, இது rayon::join போன்றது.",
      "இது சிறிய கணக்கீடுகளுக்கு சிறப்பாக செயல்படுகிறது, ஏனெனில் மீதமுள்ள பணிகளை மதிப்பீடு செய்வது செலவானதாகும், இது ஒரு இருமம் மரத்தில் மொத்தக் கணக்கீடுகளைச் செய்வதில் அதன் செயல்திறனை மூலம் நிரூபிக்கப்பட்டுள்ளது.",
      "பரிசோதனைகள் பெரிய தரவுத்தொகுப்புகளுடன் குறிப்பிடத்தக்க செயல்திறன் மேம்பாடுகளை காட்டுகின்றன, குறிப்பாக AMD Ryzen 7 4800HS மற்றும் ஆப்பிள் M1 செயலிகளின் மீது, இது இணை செயலாக்கத்தில் அதன் திறனை வெளிப்படுத்துகிறது."
    ],
    "commentSummary": [
      "Chili என்பது Spice என்ற குறைந்த செலவிலான இணைநிலை நூலகத்தின் Rust மொழி மாற்றம் ஆகும், இது சிறிய செயல்பாடுகளில் அதன் திறமைக்காக Rayon-ஐ விட விரும்பப்படுகிறது.",
      "சர்ச்சைகள் OpenMP போன்ற பிற இணைபாட்டுக் குத்தகை நூலகங்களுடன் ஒப்பீடுகள் மற்றும் உடன் தொடர்புடைய மேலதிகச் செலவுகளை உள்ளடக்கியவையாகும்.",
      "விரிவான செயலாக்க தகவலுக்காக, பயனர்கள் GitHub இல் உள்ள Spice README க்கு வழிமாற்றப்படுகிறார்கள்."
    ],
    "points": 159,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1726751061
  },
  {
    "id": 41586031,
    "title": "Ruby-SAML XML கையொப்பத்தை சுற்றி தாக்குதல்களால் கைப்பற்றப்பட்டது",
    "originLink": "https://ssoready.com/blog/engineering/ruby-saml-pwned-by-xml-signature-wrapping-attacks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41586031",
    "commentBody": "",
    "originSummary": [
      "Ruby-SAML XML கையொப்பம் மடிப்பு தாக்குதல்களால் பாதிக்கப்பட்டுள்ளது, இது GitLab போன்ற தளங்களை பாதிக்கிறது.",
      "CVE-2024-45409, 2024 செப்டம்பர் 10 அன்று வெளியிடப்பட்டது, இந்த பாதிப்பை வெளிப்படுத்துகிறது, இது தாக்குதலாளர்களை எந்த பயனராகவும் உள்நுழைய அனுமதிக்கிறது.",
      "மூலப் பிரச்சினை SAML மற்றும் XML கையொப்பங்களின் விவரக்குறிப்புகளில் உள்ளது, மேலும் பொறியாளர்கள் குறைபாடுள்ள விவரக்குறிப்புகளைத் தாண்டி பாதுகாப்பான நடைமுறைகளை ஏற்க அறிவுறுத்தப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "Ruby-SAML XML கையொப்பத்தை சுற்றி தாக்குதல்களுக்கு பாதிக்கப்படக்கூடியது, அதன் செயல்பாட்டில் பாதுகாப்பு கவலைகளை வெளிப்படுத்துகிறது.",
      "SAML, அதன் சிக்கல்களும் செயல்படுத்தும் சவால்களும் இருந்தபோதிலும், நிறுவன மற்றும் கல்வி அமைப்புகளில் பரவலாக பயன்படுத்தப்படுகிறது.",
      "OpenID Connect (OIDC) போன்ற எளிய மாற்றுகளை ஏற்கும் நோக்கத்தில் அதிகரிக்கும் முயற்சி உள்ளது."
    ],
    "points": 157,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1726696782
  },
  {
    "id": 41585468,
    "title": "நான் ஒரு கணக்கியல் அமைப்பை உருவாக்கியுள்ளேன்",
    "originLink": "https://github.com/denys-olleik/accounting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585468",
    "commentBody": "",
    "originSummary": [
      "கருவி விலைப்பட்டியல் உருவாக்கி, கட்டணங்களை செயலாக்க முடியும், ஆனால் இது இன்னும் உற்பத்தி பயன்பாட்டிற்கு தயாராக இல்லை.",
      "தற்போது, இது செயல்பட PostgreSQL ஐ தேவைப்படுகிறது, இது SQLite ஆதரவைச் சேர்க்கும் திட்டங்களுடன், அது புவியியல் வகைகளை இயல்பாக ஆதரிக்கும் போது."
    ],
    "commentSummary": [
      "ஒரு கணக்கியல் அமைப்பு உருவாக்கப்பட்டுள்ளது, இது விலைப்பட்டியல் உருவாக்கவும், கட்டணங்களை பெறவும் முடியும், ஆனால் இது இன்னும் உற்பத்திக்கு தயாராக இல்லை மற்றும் தற்போது PostgreSQL தேவைப்படுகிறது.",
      "பின்னூட்டம், QuickBooks உடன் ஒப்பிடுகையில், கொள்முதல் ஆணை மேலாண்மை, மூலதனச் செலவுகள், அனுமதி வேலைப்பாடுகள் மற்றும் பல நிறுவனங்கள்/நாணயங்கள் ஆதரவு போன்ற கூடுதல் அம்சங்களின் தேவையை குறிப்பிடுகிறது.",
      "திட்டம் நம்பிக்கையை அளிக்கிறது ஆனால் மேலும் அம்சங்கள், சோதனை மற்றும் தொடர்ச்சியான புதுப்பிப்புகளை தேவைப்படுத்துகிறது, குறிப்பாக பெரிய நிறுவனங்களின் தேவைகளை பூர்த்தி செய்ய மற்றும் தொடர்புடையதாக இருக்க."
    ],
    "points": 153,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1726693495
  },
  {
    "id": 41588717,
    "title": "அமெரிக்க சுகாதார அமைப்பு இணையான நாடுகளுடன் ஒப்பிடுகையில் கடைசியாக உள்ளது – அறிக்கை",
    "originLink": "https://www.theguardian.com/us-news/2024/sep/18/american-health-system-ranks-last",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588717",
    "commentBody": "",
    "originSummary": [
      "அமெரிக்கர்கள் சுகாதாரத்திற்காக இரட்டிப்பு செலவழித்தாலும், 10 இணை நாடுகளில் அமெரிக்க சுகாதார அமைப்பு கடைசியாக உள்ளது என்று காமன்வெல்த் ஃபண்ட் அறிக்கை தெரிவிக்கிறது.",
      "அமைப்பு சுகாதார சமத்துவம், பராமரிப்பு அணுகல் மற்றும் முடிவுகளில் மோசமாக செயல்பட்டது, காப்பீட்டு கவரேஜை விரிவுபடுத்துதல் மற்றும் நோயாளி செலவுகளை குறைத்தல் உள்ளிட்ட பரிந்துரைகளை உள்ளடக்கியது.",
      "இரு முக்கிய ஜனாதிபதி வேட்பாளர்களும் முக்கியமான சுகாதார சீர்திருத்தங்களை முன்மொழியவில்லை, வாக்காளர்கள் சுகாதார செலவுகளை முன்னுரிமையாகக் கொண்டிருந்தாலும், அமெரிக்கர்கள் ஆண்டுக்கு $4.5 டிரில்லியன் செலவழிக்கின்றனர்."
    ],
    "commentSummary": [
      "ஒரு அறிக்கை அமெரிக்க சுகாதார அமைப்பு சமமான நாடுகளின் மத்தியில் கடைசியாக உள்ளது என்று குறிப்பிடுகிறது, இது உலகளாவிய சுகாதார அனுபவங்களைப் பற்றிய ஒரு கருத்தரங்கில் விவாதங்களைத் தூண்டுகிறது.",
      "பயனர்கள், இந்தியா போன்ற நாடுகளில் வேகமான, மலிவான மருத்துவ சேவைகளுடன் அமெரிக்க முறைமையின் மந்தத்தன்மை மற்றும் செயல்திறனின்மையை ஒப்பிட்டு, எஸ்டோனியாவில் உள்ள டிஜிட்டல் சுகாதார பதிவுகளின் நன்மைகளைப் பற்றி விவாதித்தனர்.",
      "அமெரிக்காவில் அதிக செலவுகள் மற்றும் செயல்திறனின்மை பற்றிய பேச்சுவார்த்தையும், நல்ல காப்பீடு இருந்தாலும் நீண்ட நேரம் காத்திருப்பது மற்றும் தகுந்த நேரத்தில் பராமரிப்பு இல்லாதது பற்றிய ஏமாற்றங்களையும் வெளிப்படுத்தியது."
    ],
    "points": 131,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1726722536
  },
  {
    "id": 41586579,
    "title": "லிசெஸ்: எங்கள் நீண்ட நேர தடை பற்றிய பிந்தைய ஆய்வு",
    "originLink": "https://lichess.org/@/Lichess/blog/post-mortem-of-our-longest-downtime/XAgG7jbd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41586579",
    "commentBody": "",
    "originSummary": [
      "Lichess தனது வரலாற்றிலேயே மிக நீண்ட நேரம் செயலிழந்தது, செப்டம்பர் 12 முதல் 13 வரை 10 மணி நேரம் நீடித்தது, இது OVH இன் தரவுத்தொகுப்பு மையத்தில் ஏற்பட்ட ஒரு ஹார்ட்வேர் பிரச்சினையால் ஏற்பட்டது.",
      "இடைநிறுத்தம் இருந்தபோதிலும், லிச்செஸ் உள்ளடக்கக் குழு தங்கள் செஸ் ஒலிம்பியாட் கருத்துரையை தனிப்பட்ட சாண்ட்பாக்ஸ் பதிப்பைப் பயன்படுத்தி தொடர்ந்தது.",
      "Lichess இந்த பிரச்சினையை மேலும் விசாரிக்கவும், கூடுதல் பாதுகாப்பு நடவடிக்கைகளை செயல்படுத்தவும் திட்டமிட்டுள்ளது, ஆனால் இந்த நடவடிக்கைகள் நேரம் பிடிக்கும் மற்றும் வளங்களை அதிகமாக பயன்படுத்தும்."
    ],
    "commentSummary": [
      "Lichess தனது முக்கிய சேவையகத்தில் ஏற்பட்ட வன்பொருள் பிரச்சினையால் அதன் மிக நீண்ட நேரம் செயலிழப்பை அனுபவித்தது, இது தினமும் சுமார் 5 மில்லியன் விளையாட்டுகளை கையாளுகிறது.",
      "இந்த சம்பவம், Lichess இன் மாதாந்திர செலவுகள் சுமார் $40k ஆக இருந்தாலும், அவர்கள் ஒரே ஒரு பௌர்ணமி சேவையகத்தை நம்புவதும், அவர்களின் மாற்று திட்டங்களும் பற்றிய கவலைகளை எழுப்பியது.",
      "பிந்தைய ஆய்வு அதன் வெளிப்படைத்தன்மைக்காக பாராட்டப்பட்டது, நிறுவனர் திபால்ட் டுபிளெசிஸ் அவர்களின் அர்ப்பணிப்பை வெளிப்படுத்தியது மற்றும் சேவையை ஆதரிக்க பயனர்களை நன்கொடை அளிக்க ஊக்குவித்தது."
    ],
    "points": 130,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1726700561
  },
  {
    "id": 41590466,
    "title": "போர்ப்ஸ் மார்க்கெட்பிளேஸ்: தன் ஹோஸ்டை விழுங்க முயலும் பராசைட் எஸ்இஓ நிறுவனம்",
    "originLink": "https://larslofgren.com/forbes-marketplace/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41590466",
    "commentBody": "",
    "originSummary": [
      "Forbes Marketplace, Forbes இல் இருந்து தனி நிறுவனமாக, ஆரோக்கியம், வீட்டு மேம்பாடு, மற்றும் விளையாட்டு பந்தயம் போன்ற பல பிரிவுகளில் தேடல் முடிவுகளை ஆதிக்க ஆக்கிரமிப்பு SEO உத்திகளை பயன்படுத்துகிறது.",
      "இந்த அணுகுமுறை, மாதத்திற்கு 27 மில்லியனுக்கும் மேற்பட்ட வருகைகளைப் பெறுவதற்கும், ஆண்டுக்கு நூற்றுக்கணக்கான மில்லியன்கள் வருமானத்தை உருவாக்குவதற்கும், ஃபோர்ப்ஸுக்கு உதவியுள்ளது.",
      "முக்கிய பிரச்சினை Google's அல்காரிதம் ஆகும், இது சிறிய, குறிப்பிட்ட வெளியீட்டாளர்களை விட Forbes இன் உள்ளடக்கத்தை முன்னுரிமை அளிக்கிறது, தேடல் முடிவு தரவரிசையின் நியாயம் மற்றும் துல்லியத்தைப் பற்றிய கவலைகளை எழுப்புகிறது."
    ],
    "commentSummary": [
      "கட்டுரை 'பராசைட் எஸ்இஓ' நிறுவனங்களின் பரவலையைப் பற்றி விவரிக்கிறது, அவை Forbes போன்ற நம்பகமான டொமைன்களைப் பயன்படுத்தி, குறைந்த தரமான உள்ளடக்கத்துடன் இருந்தாலும் தேடல் முடிவுகளில் உயர்ந்த இடத்தைப் பெறுகின்றன.",
      "Google இந்த நடைமுறைகளை அனுமதிப்பதற்காக விமர்சிக்கப்படுகிறது, ஏனெனில் இது விளம்பர வருவாய் மற்றும் நம்பகமான டொமைன்களை உள்ளடக்கத்தின் தரத்திற்கு மேல் முன்னுரிமை அளிக்கிறது, இந்த பிரச்சினையை தீர்க்க கையேடு தலையீட்டை தேவைப்படுத்துகிறது.",
      "இந்த நிகழ்வு புதியதல்ல மற்றும் HowStuffWorks மற்றும் LiveStrong போன்ற பிற தளங்களிலும் கவனிக்கப்பட்டுள்ளது, இது தேடுபொறி மேம்பாடு மற்றும் உள்ளடக்கத்தின் பொருத்தம் தொடர்பான பரந்த பிரச்சினையை வெளிப்படுத்துகிறது."
    ],
    "points": 125,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1726742648
  }
]
