[
  {
    "id": 41585156,
    "title": "كوميك مونو",
    "originLink": "https://dtinth.github.io/comic-mono-font/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585156",
    "commentBody": "",
    "originSummary": [
      "كوميك مونو هو خط جديد أحادي المسافة مشتق من خط كوميك شانز (الإصدار 1) لشانون ميوا، حيث تتمتع جميع الرموز بنفس العرض وتم تعديل المقاييس لعرض أفضل.",
      "تم إنشاء الخط باستخدام برنامج بايثون وFontForge، مع إصدار عريض تم توليده من خلال عملية Embolden في FontForge.",
      "يتوفر خط Comic Mono للتنزيل والاستخدام بموجب ترخيص MIT، مع خيارات توزيع إضافية عبر CDN، npm، وحزم Linux."
    ],
    "commentSummary": [
      "كوميك مونو، خط ذو عرض ثابت مستوحى من كوميك سانس، قد حظي بالاهتمام لجعل البرمجة أكثر متعة وأسهل على العينين.",
      "يقارن المستخدمون بين خط Comic Mono وخطوط أخرى مثل Comic Code، مشيرين إلى الفروقات في القابلية للقراءة والجماليات، حيث يفضل البعض Comic Code لمظهره المصقول.",
      "تسلط المناقشة الضوء على استخدام الخطوط بأسلوب Comic Sans لتقليل إجهاد العين ومساعدة المصابين بعسر القراءة، مما يظهر جانبًا عمليًا لهذه الخطوط التي غالبًا ما تُسخر."
    ],
    "points": 404,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1726691788
  },
  {
    "id": 41584486,
    "title": "يستخدم LinkedIn الآن محتوى الجميع لتدريب أداة الذكاء الاصطناعي الخاصة به",
    "originLink": "https://twitter.com/RachelTobac/status/1836471586624540705",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41584486",
    "commentBody": "",
    "originSummary": [
      "يستخدم LinkedIn المحتوى الذي ينشئه المستخدمون لتدريب أداة الذكاء الاصطناعي الخاصة به بشكل افتراضي، مما يثير مخاوف بشأن الخصوصية.",
      "يُنصح المستخدمون بإلغاء الاشتراك من خلال الانتقال إلى الإعدادات والخصوصية > خصوصية البيانات > بيانات تحسين الذكاء الاصطناعي التوليدي وإيقاف تشغيلها.",
      "التوصية تمتد إلى المنظمات لوقف الاشتراكات التلقائية لحماية خصوصية بيانات المستخدم."
    ],
    "commentSummary": [
      "يستخدم LinkedIn محتوى المستخدمين لتدريب أداة الذكاء الاصطناعي الخاصة به، مما يؤدي إلى ردود فعل متباينة بشأن جودة وأصالة المحتوى.",
      "أثارت مخاوف الخصوصية بعد أن تم تسجيل المستخدمين تلقائيًا دون موافقة صريحة، على الرغم من أن المستخدمين في الاتحاد الأوروبي مستثنون بسبب لوائح GDPR.",
      "يجادل النقاد بأن على LinkedIn أن تعطي الأولوية لتحسين الميزات الأساسية بدلاً من تطوير الذكاء الاصطناعي، حيث يفكر بعض المستخدمين في الانسحاب أو مغادرة المنصة."
    ],
    "points": 398,
    "commentCount": 226,
    "retryCount": 0,
    "time": 1726688248
  },
  {
    "id": 41588200,
    "title": "قد يكون ابني أعمى - كيفية تقديم الدعم الأفضل",
    "originLink": "https://news.ycombinator.com/item?id=41588200",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588200",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "الآباء القلقون بشأن احتمال إصابة طفلهم بالعمى يبحثون عن موارد ونصائح للحصول على الدعم.",
      "تشمل الاقتراحات تعزيز الاستقلالية، الاندماج مع الأقران، واستخدام الموارد من منظمات مثل معهد برايل والمؤسسة الأمريكية للمكفوفين.",
      "تسلط القصص الشخصية الضوء على استراتيجيات ناجحة مثل تحديد الموقع بالصدى ودمج الأطفال المكفوفين في الأنشطة العادية."
    ],
    "points": 286,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1726716463
  },
  {
    "id": 41587214,
    "title": "نينتندو ترفع دعوى لانتهاك حقوق براءات الاختراع ضد شركة Pocketpair, Inc",
    "originLink": "https://www.nintendo.co.jp/corporate/release/en/2024/240919.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41587214",
    "commentBody": "",
    "originSummary": [
      "رفعت شركة نينتندو وشركة البوكيمون دعوى قضائية لانتهاك براءة اختراع ضد شركة Pocketpair, Inc. في محكمة منطقة طوكيو.",
      "تزعم الدعوى القضائية أن لعبة Pocketpair، Palworld، تنتهك حقوق براءات اختراع متعددة، وتسعى للحصول على أمر قضائي وتعويض عن الأضرار.",
      "تؤكد نينتندو التزامها بحماية حقوق الملكية الفكرية الخاصة بها، بما في ذلك علامة نينتندو التجارية، من خلال اتخاذ الإجراءات القانونية اللازمة."
    ],
    "commentSummary": [
      "رفعت شركة نينتندو دعوى قضائية لانتهاك براءة اختراع ضد شركة Pocketpair, Inc. تتعلق بلعبتهم Palworld، مركزة على آليات اللعبة بدلاً من تشابه الشخصيات.",
      "تعاقدت شركة Pocketpair مع تمثيل قانوني للطعن في الادعاءات، مما يبرز التعقيدات والجدل حول براءات اختراع البرمجيات في صناعة الألعاب.",
      "تسلط هذه القضية الضوء على الجدل المستمر حول نطاق وتأثير براءات اختراع البرمجيات على تطوير الألعاب والابتكار."
    ],
    "points": 283,
    "commentCount": 238,
    "retryCount": 0,
    "time": 1726706266
  },
  {
    "id": 41591622,
    "title": "سيتوقف Pivotal Tracker عن العمل",
    "originLink": "https://www.pivotaltracker.com/blog/2024-09-18-end-of-life",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591622",
    "commentBody": "",
    "originSummary": [
      "أعلنت شركة VMware Tanzu عن انتهاء العمر الافتراضي (EOL) لبرنامج Pivotal Tracker، وذلك اعتبارًا من 30 أبريل 2025، مع تقديم الدعم حتى ذلك التاريخ.",
      "تتأثر جميع الحسابات (المجانية، المدعومة، المدفوعة، المؤسساتية)، ويجب على المستخدمين تصدير بياناتهم قبل انتهاء الخدمة؛ التعليمات متاحة في مركز المساعدة.",
      "التسجيلات الجديدة غير ممكنة، ولكن الحسابات الحالية لا تزال قادرة على دعوة مستخدمين جدد ضمن حدود المتعاونين."
    ],
    "commentSummary": [
      "بيفوتال تراكر يغلق أبوابه، مما يخلق فرصة للمطورين لاستنساخ المنتج المحبوب باستخدام التقنيات الحديثة.",
      "يعد الإغلاق جزءًا من استراتيجية VMware الأوسع بعد استحواذ Broadcom عليها، وينصح المستخدمون بنقل بياناتهم قبل انتهاء الخدمة.",
      "توجد بدائل مثل Linear وShortcut، لكن بساطة وتركيز Pivotal Tracker محل تقدير كبير من قبل مستخدميه."
    ],
    "points": 221,
    "commentCount": 164,
    "retryCount": 0,
    "time": 1726752315
  },
  {
    "id": 41585249,
    "title": "تخطئ Cloudflare في تحديد عناوين IP الخاصة بـ Hetzner على أنها تقع في إيران",
    "originLink": "https://gitlab.com/gitlab-com/gl-infra/production/-/issues/8121#note_1237201726",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585249",
    "commentBody": "",
    "originSummary": [
      "يتم الإبلاغ عن معدلات فشل عالية في وظائف البناء في CI (التكامل المستمر) على GitLab، خاصة بسبب الانقطاعات المتقطعة من خوادم Hetzner.de VPSes عند سحب صور Docker من registry.gitlab.com.",
      "تشير رسالة الخطأ إلى انتهاء مهلة العميل أثناء انتظار الرؤوس، وعلى الرغم من أن إعادة تشغيل خط الأنابيب تساعد أحيانًا، إلا أن المحاولات المتعددة مؤخرًا فشلت في حل المشكلة.",
      "تبدو المشكلة محددة في registry.gitlab.com، حيث أن استنساخ المستودعات من GitLab لا يواجه نفس الفشل، مما يشير إلى وجود مشكلة في خدمة سجل صور Docker."
    ],
    "commentSummary": [
      "تقوم Cloudflare بتحديد عناوين IP الخاصة بـ Hetzner بشكل غير صحيح على أنها تقع في إيران، مما يؤدي إلى مشاكل في وصول المستخدمين.",
      "هذه مشكلة التعرف الخاطئ ليست حصرية لشركة Cloudflare؛ فقد واجهت Google مشكلات مماثلة.",
      "تسلط المناقشة الضوء على كيفية تأثير الجنسية وسمعة البلد على الوصول إلى الخدمات والسفر والفرص، مع تداعيات أوسع للعقوبات التي تؤثر على المواطنين العاديين أكثر من المسؤولين الحكوميين."
    ],
    "points": 198,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1726692368
  },
  {
    "id": 41592552,
    "title": "هوائي زجاجي يحول النوافذ إلى محطات قاعدة 5G",
    "originLink": "https://spectrum.ieee.org/5g-antenna-transparent-window",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41592552",
    "commentBody": "",
    "originSummary": [
      "طور الباحثون هوائيات زجاجية يمكنها تحويل النوافذ إلى محطات قاعدة لشبكات الجيل الخامس، مما يعزز تغطية الهواتف المحمولة دون أن تكون ملحوظة.",
      "تستخدم هذه الهوائيات طبقات موصلة شفافة، مما يسمح للنوافذ بالعمل كهوائيات خلوية لشبكة 5G مع الحفاظ على شفافيتها.",
      "يمكن أن تُحسن هذه الابتكار بشكل كبير تغطية شبكات الجيل الخامس في المناطق الحضرية من خلال استخدام الأسطح الزجاجية الموجودة."
    ],
    "commentSummary": [
      "يمكن للهوائيات الزجاجية تحويل النوافذ إلى محطات قاعدة لشبكات الجيل الخامس، مما قد يقلل من تكاليف التركيب ويعزز التغطية.",
      "تستخدم التقنية هوائيات شفافة لنقل إشارات الجيل الخامس عبر زجاج منخفض الانبعاثية، والذي عادةً ما يحجب هذه الترددات، مما يسمح بوضع الهوائيات داخل المباني.",
      "توجد مخاوف بشأن الشفافية، والمظهر، والسلامة، ومستويات الطاقة، وإمكانية التبني الواسع لهذا الابتكار بشكل عام."
    ],
    "points": 186,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1726757612
  },
  {
    "id": 41591018,
    "title": "أداة CLI التي صنعتها لاستضافة أي تطبيق ذاتيًا باستخدام أمرين فقط على VPS",
    "originLink": "https://github.com/MightyMoud/sidekick",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591018",
    "commentBody": "",
    "originSummary": [
      "يُبسط سايدكيك استضافة الخوادم الافتراضية الخاصة (VPS) بميزات مثل الإعداد بأمر واحد، والنشر بدون توقف، والتوافر العالي.",
      "يهدف إلى جعل الاستضافة بسيطة وميسورة التكلفة، مستهدفًا المستخدمين الذين سئموا من الإعدادات المعقدة للمشاريع الجانبية.",
      "تشمل الوظائف الرئيسية نشر التطبيقات من ملفات Docker، وإدارة أسرار البيئة بشكل آمن، وربط عدة نطاقات بشهادات SSL بدون تكوين."
    ],
    "commentSummary": [
      "تم إصدار أداة CLI جديدة تسمى Sidekick، تتيح للمستخدمين استضافة أي تطبيق ذاتيًا على VPS باستخدام أمرين فقط.",
      "تم تصميم الأداة لتبسيط عملية النشر، والتعامل مع مهام مثل إعداد شهادات TLS/SSL وإدارة حاويات Docker.",
      "من المتوقع أن تتضمن التحديثات المستقبلية استضافة قواعد البيانات ودعم docker-compose، مما يجعلها خيارًا متعدد الاستخدامات للمطورين الذين يبحثون عن حل سهل للنشر."
    ],
    "points": 174,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1726748225
  },
  {
    "id": 41588667,
    "title": "قامت موزيلا بفصل رئيس قسم المنتجات لديها بعد تشخيصه بالسرطان",
    "originLink": "https://mastodon.social/@stevetex/113162099798398758",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588667",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "قامت موزيلا بإنهاء عمل رئيس قسم المنتجات لديها بعد تشخيصه بالسرطان، مما أدى إلى جدل واسع وانتقادات.",
      "يعبر المستخدمون عن خيبة أملهم ويقارنون موزيلا بالشركات الناشئة وصناديق التحوط غير الأخلاقية، مع اقتراح البعض متصفحات بديلة مثل Ladybird وLibreWolf وBrave.",
      "لقد أثار الحادث مناقشات حول أخلاقيات مكان العمل، وسياسات التنوع والمساواة والشمول (DEI)، ومستقبل فايرفوكس بدون موزيلا."
    ],
    "points": 169,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1726722013
  },
  {
    "id": 41591449,
    "title": "تشيلّي. منفذ رست لمكتبة سبايس، وهي مكتبة للتوازي منخفضة التكلفة",
    "originLink": "https://github.com/dragostis/chili",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41591449",
    "commentBody": "",
    "originSummary": [
      "Chili هو نسخة مكتوبة بلغة Rust من مكتبة Spice، وهي مكتبة للتوازي منخفضة التكلفة، مصممة لتشغيل إغلاقين بالتوازي عند أي نقطة تفرع في الحساب، مشابهة لـ rayon::join.",
      "إنه فعال بشكل خاص في الحسابات الصغيرة حيث يكون تقدير المهام المتبقية مكلفًا، كما يتضح من أدائه في جمع العقد في شجرة ثنائية.",
      "تُظهر المعايير تحسنًا كبيرًا في الأداء مع مجموعات البيانات الأكبر، خاصة على معالجات AMD Ryzen 7 4800HS و Apple M1، مما يبرز كفاءتها في المعالجة المتوازية."
    ],
    "commentSummary": [
      "Chili هو نسخة مكتوبة بلغة Rust من مكتبة Spice، وهي مكتبة للتوازي منخفضة التكلفة، مفضلة لكفاءتها في العمليات الصغيرة مقارنة بمكتبة Rayon.",
      "تشمل المناقشات مقارنات مع مكتبات التوازي الأخرى مثل OpenMP والنفقات العامة المتضمنة.",
      "للحصول على معلومات تفصيلية حول التنفيذ، يتم توجيه المستخدمين إلى ملف README الخاص بـ Spice على GitHub."
    ],
    "points": 159,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1726751061
  },
  {
    "id": 41586031,
    "title": "تم اختراق Ruby-SAML بواسطة هجمات تغليف توقيع XML",
    "originLink": "https://ssoready.com/blog/engineering/ruby-saml-pwned-by-xml-signature-wrapping-attacks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41586031",
    "commentBody": "",
    "originSummary": [
      "تم اختراق Ruby-SAML بواسطة هجمات تغليف التوقيع XML، مما أثر على منصات مثل GitLab.",
      "تم الكشف عن CVE-2024-45409 في 10 سبتمبر 2024، ويكشف عن هذه الثغرة التي تمكن المهاجمين من تسجيل الدخول كأي مستخدم.",
      "تكمن المشكلة الأساسية في مواصفات SAML وتوقيعات XML، وينصح المهندسون بتبني ممارسات آمنة تتجاوز المواصفات المعيبة."
    ],
    "commentSummary": [
      "روبي-SAML عرضة لهجمات تغليف التوقيع XML، مما يبرز مخاوف أمنية في تنفيذه.",
      "على الرغم من تعقيد SAML وتحديات تنفيذه، فإنه لا يزال مستخدمًا على نطاق واسع في البيئات المؤسسية والأكاديمية.",
      "هناك توجه متزايد نحو اعتماد بدائل أبسط مثل OpenID Connect (OIDC)."
    ],
    "points": 157,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1726696782
  },
  {
    "id": 41585468,
    "title": "لقد أنشأت نظام محاسبة",
    "originLink": "https://github.com/denys-olleik/accounting",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41585468",
    "commentBody": "",
    "originSummary": [
      "يمكن للأداة توليد الفواتير ومعالجة المدفوعات، لكنها ليست جاهزة بعد للاستخدام في الإنتاج.",
      "حاليًا، يتطلب PostgreSQL للعمل، مع خطط لإضافة دعم SQLite بمجرد أن يدعم أنواع الجغرافيا بشكل أصلي."
    ],
    "commentSummary": [
      "تم تطوير نظام محاسبة يمكنه إنشاء الفواتير واستلام المدفوعات، ولكنه ليس جاهزًا للإنتاج بعد ويتطلب حاليًا PostgreSQL.",
      "تسلط التعليقات الضوء على الحاجة إلى ميزات إضافية مثل إدارة أوامر الشراء، والنفقات الرأسمالية، وسير العمل للموافقة، ودعم الشركات/العملات المتعددة، مقارنةً ببرنامج QuickBooks.",
      "يبدو أن المشروع واعد ولكنه يتطلب المزيد من الميزات والاختبارات والتحديثات المستمرة ليظل ذو صلة ويلبي احتياجات الشركات، خاصة المنظمات الكبيرة."
    ],
    "points": 153,
    "commentCount": 38,
    "retryCount": 0,
    "time": 1726693495
  },
  {
    "id": 41588717,
    "title": "النظام الصحي الأمريكي يحتل المرتبة الأخيرة مقارنة بالدول النظيرة – تقرير",
    "originLink": "https://www.theguardian.com/us-news/2024/sep/18/american-health-system-ranks-last",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41588717",
    "commentBody": "",
    "originSummary": [
      "يحتل نظام الصحة الأمريكي المرتبة الأخيرة بين 10 دول نظيرة، على الرغم من أن الأمريكيين يدفعون تقريبًا ضعف تكلفة الرعاية الصحية، وفقًا لتقرير مؤسسة الكومنولث.",
      "أداء النظام كان ضعيفًا في مجالات العدالة الصحية، والوصول إلى الرعاية، والنتائج، مع توصيات تشمل توسيع نطاق التغطية التأمينية وتقليل نفقات المرضى.",
      "لم يقترح أي من المرشحين الرئاسيين الرئيسيين إصلاحات كبيرة في مجال الرعاية الصحية، على الرغم من أن الناخبين يعطون الأولوية لتكاليف الرعاية الصحية، حيث ينفق الأمريكيون 4.5 تريليون دولار سنويًا."
    ],
    "commentSummary": [
      "يشير تقرير إلى أن نظام الصحة الأمريكي يحتل المرتبة الأخيرة بين الدول النظيرة، مما أثار مناقشات في منتدى حول تجارب الرعاية الصحية العالمية.",
      "قارن المستخدمون بطء وعدم كفاءة النظام الأمريكي بالخدمات الطبية الأسرع والأرخص في دول مثل الهند وفوائد السجلات الصحية الرقمية في إستونيا.",
      "كما أبرزت المحادثة التكاليف العالية وعدم الكفاءة في الولايات المتحدة، مع الإحباطات بسبب فترات الانتظار الطويلة ونقص الرعاية في الوقت المناسب على الرغم من وجود تأمين جيد."
    ],
    "points": 131,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1726722536
  },
  {
    "id": 41586579,
    "title": "ليتشيس: تحليل لأطول فترة توقف لدينا",
    "originLink": "https://lichess.org/@/Lichess/blog/post-mortem-of-our-longest-downtime/XAgG7jbd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41586579",
    "commentBody": "",
    "originSummary": [
      "تعرض موقع Lichess لأطول فترة توقف له على الإطلاق، حيث استمرت لمدة 10 ساعات من 12 إلى 13 سبتمبر، بسبب مشكلة في الأجهزة في مركز بيانات OVH.",
      "على الرغم من فترة التوقف، واصل فريق محتوى Lichess تعليقهم على أولمبياد الشطرنج باستخدام نسخة تجريبية خاصة من الموقع.",
      "تخطط Lichess للتحقيق في المشكلة بشكل أعمق وتنفيذ إجراءات أمان إضافية، على الرغم من أن هذه التدابير تستغرق وقتًا طويلاً وتتطلب موارد كبيرة."
    ],
    "commentSummary": [
      "تعرض موقع Lichess لأطول فترة توقف له بسبب مشكلة في الأجهزة على الخادم الرئيسي، الذي يتعامل مع حوالي 5 ملايين لعبة يوميًا.",
      "أثار الحادث مخاوف بشأن اعتماد موقع Lichess على خادم مادي واحد وخططهم للتعامل مع الأعطال، على الرغم من تكاليف التشغيل الشهرية الكبيرة التي تبلغ حوالي 40 ألف دولار.",
      "تم الإشادة بالتشريح بعد الوفاة لشفافيته، مما أبرز تفاني المؤسس تيبو دوبليسيس وشجع المستخدمين على التبرع لدعم الخدمة."
    ],
    "points": 130,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1726700561
  },
  {
    "id": 41590466,
    "title": "سوق فوربس: شركة تحسين محركات البحث الطفيلية التي تحاول التهام مضيفها",
    "originLink": "https://larslofgren.com/forbes-marketplace/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41590466",
    "commentBody": "",
    "originSummary": [
      "يستخدم Forbes Marketplace، وهو كيان منفصل عن Forbes، استراتيجيات تحسين محركات البحث العدوانية للسيطرة على نتائج البحث في فئات مختلفة، بما في ذلك الصحة وتحسين المنزل والمراهنات الرياضية.",
      "أدى هذا النهج إلى حصول فوربس على أكثر من 27 مليون زيارة شهريًا وتحقيق إيرادات كبيرة تُقدر بمئات الملايين سنويًا.",
      "المشكلة الأساسية هي خوارزمية جوجل، التي تعطي الأولوية لمحتوى فوربس على حساب الناشرين الأصغر والأكثر تخصصًا، مما يثير مخاوف بشأن عدالة ودقة تصنيفات نتائج البحث."
    ],
    "commentSummary": [
      "تناقش المقالة انتشار شركات \"SEO الطفيلية\"، التي تستغل النطاقات الموثوقة مثل فوربس لتحتل مرتبة عالية في نتائج البحث رغم المحتوى منخفض الجودة.",
      "تتعرض جوجل للانتقاد بسبب السماح بهذه الممارسات، حيث تعطي الأولوية لعائدات الإعلانات والمواقع الموثوقة على حساب جودة المحتوى، مما يتطلب تدخلًا يدويًا لمعالجة المشكلة.",
      "الظاهرة ليست جديدة وقد تم ملاحظتها مع مواقع أخرى مثل HowStuffWorks وLiveStrong، مما يسلط الضوء على مشكلة أوسع تتعلق بتحسين محركات البحث وملاءمة المحتوى."
    ],
    "points": 125,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1726742648
  }
]
