[
  {
    "title": "롤렉스·파텍필립도 못 피한 ‘불황 그늘’... 중고價 2년 만에 최저",
    "originLink": "https://biz.chosun.com/international/international_economy/2023/11/15/HZ3VM5BGBVHVVISDODNYMJIMZY/",
    "originBody": "",
    "originSummary": [
      "The prices of luxury watches, such as Rolex and Patek Philippe, in the second-hand market have reached their lowest levels in two years due to decreased demand and increased supply.",
      "The Subdial Watch Index, which monitors the prices of the 50 most traded watches in the second-hand market, has also dropped to its lowest point since 2021.",
      "Patek Philippe has seen a larger decrease in prices compared to other top watch brands, and experts predict that prices may continue to weaken in the future due to the increased supply."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  },
  {
    "title": "LG트윈스 우승…'신문 4부 20만원' 당근서 웃돈 거래' - LG Twins Win Championship...Laughter and Money Transactions for 'Newspaper for 200,000 KRW",
    "originLink": "https://m.edaily.co.kr/news/newspath.asp?newsid=E03339046635806048",
    "originBody": "",
    "originSummary": [
      "LG Twins, a South Korean baseball team, has won their first championship in 29 years.",
      "Newspapers commemorating the team's victory are being sold on online marketplaces at prices ranging from 20,000 to 200,000 KRW.",
      "Various LG Twins-related merchandise, including clothing and goods, are also available for sale on these platforms."
    ],
    "commentBody": "",
    "commentSummary": [
      "해당 포스트에 대한 요약 내용이 없습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  },
  {
    "title": "분유와 기저귀값 상승으로 인해 중고거래나 배달음식을 중단하는 산모들이 늘어나고 있다.",
    "originLink": "https://news.mt.co.kr/mtview.php?no=2023111413491696444",
    "originBody": "",
    "originSummary": [
      "대한민국은 인공지능 분야에 대한 정부 지원을 강화하고자 한다",
      "인공지능 산업에 대한 투자, 인력 양성, 연구 개발 활동 등 다양한 정책을 통해 인공지능 분야를 선도하고자 한다",
      "이러한 정책의 목표는 국가 경제 발전, 산업 혁신, 사회 변화를 이루는 것이다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  },
  {
    "title": "60개 이상의 국가들이 지구 온난화를 1.5°C로 제한하기 위해 다음 10년 동안 재생에너지를 늘리는 합의안을 지지했다. 또한, 새로운 위성은 개별 시설로부터 CO2 데이터를 감지하고 공유할 것이며, 유럽 연합은 논란이 있던 자연 복원 법안에 대한 협의에 도달했다. 브라질 아마존의 산림 벌채 비율은 2018년 이후로 최저 수준으로 감소했으며, 덴마크는 손실과 피해 기금에 대한 상당한 약속을 할 계획이다. 게다가, 콜롬비아는 올해 산림 벌채가 70% 감소한 것으로 나타났으며, 미시간은 어떤 전투지역보다 좋은 기후 정책을 가질 예정이다. 케냐는 나무를 심기 위해 깜짝 공휴일을 선언했고, 환경 단체들은 녹색 직업의 다양성을 높이기 위한 약속에 합류했다. 마지막으로, 기후 위기의 가장 큰 영향을 받는 국가들을 돕기 위해 손실과 피해 협정이 성사되었다.",
    "originLink": "https://biz.heraldcorp.com/view.php?ud=20231115000705",
    "originBody": "",
    "originSummary": [
      "Over 60 countries have committed to tripling renewable energy in the next decade to limit global warming.",
      "A new satellite will be used to monitor and share CO2 data from individual facilities.",
      "Deforestation rates in Brazil's Amazon have dropped to their lowest level since 2018, and Colombia has experienced a 70% decrease in deforestation this year."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  },
  {
    "title": "은행의 실적은 사상 최고치를 기록하였지만 중고 시장에서 판매되는 달력의 수는 줄어들었다.",
    "originLink": "http://www.bizhankook.com/bk/article/26600",
    "originBody": "",
    "originSummary": [
      "은행의 업적이 사상 최고치를 기록하고 있지만, 중고 시장에서 판매되는 달력의 수는 감소하였습니다.",
      "이번에는 특별한 이유로 사용된 달력 시장이 전년에 비해 축소되었습니다.",
      "달력의 감소 판매량은 은행의 성과와 연관이 있을 수 있지만 정확한 원인을 찾기 위해서는 더 깊이 연구가 필요합니다."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  },
  {
    "title": "롤드컵 열기 '후끈'…중고마켓서 결승전 직관 티켓은 \"부르는 게 값\"",
    "originLink": "https://www.ekn.kr/web/view.php?key=20231115010004527",
    "originBody": "",
    "originSummary": [
      "미국 10월 CPI는 예상보다 낮은 3.2% 증가로 발표됨.",
      "이로 인해 나스닥 선물은 상승하고 채권 수익률은 급격히 하락함.",
      "미국 경제 지표의 변화로 시장에 긍정적인 영향을 미치고 있음."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700053965535
  }
]
