[
  {
    "id": 41726197,
    "title": "Dosya: WP Engine Inc. v Automattic Inc. ve Matthew Charles Mullenweg [pdf]",
    "originLink": "https://wpengine.com/wp-content/uploads/2024/10/Complaint-WP-Engine-v-Automattic-et-al-with-Exhibit.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41726197",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "WP Engine Inc., Automattic Inc. ve kurucusu Matthew Charles Mullenweg'e karşı bir dava açtı ve bu durum tartışmalara ve incelemelere yol açtı.",
      "Mullenweg'in Heather Brunner'ın Automattic'teki iş görüşmesi hakkındaki açıklaması ve WordPress kullanıcıları için eklenti güncellemelerini durdurma kararı, 1.5 milyon siteyi etkileyerek WordPress altyapısına olan güven konusunda endişeleri artırdı.",
      "Eleştirmenler, davadaki daha fazla karmaşıklığı önlemek için Mullenweg'e yasal işlemler sırasında kamuya açık yorumlardan kaçınmasını tavsiye ettiler."
    ],
    "points": 524,
    "commentCount": 547,
    "retryCount": 0,
    "time": 1727915345
  },
  {
    "id": 41730415,
    "title": "Patent trolü Sable ödeme yapıyor, tüm patentlerini kamuya adıyor",
    "originLink": "https://blog.cloudflare.com/patent-troll-sable-pays-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41730415",
    "commentBody": "",
    "originSummary": [
      "Sable IP, Cloudflare ile olan davasını 225.000 dolar ödemeyi kabul ederek ve patentlerini kamuya açarak çözdü, böylece üç yıllık asılsız patent iddialarıyla ilgili yasal mücadele sona erdi.",
      "Cloudflare'ın patent trolleriyle mücadele etmek için önceden var olan sanatı kitle kaynaklı hale getiren Proje Jengo'su, bu zaferde önemli bir rol oynadı ve katılımcılara 125.000 dolardan fazla ödül verdi.",
      "Sable'nin patentlerini kamuya adama kararı, bu patentleri kullanan diğer şirketlere karşı gelecekteki davaları önler."
    ],
    "commentSummary": [
      "Sable, bir patent trolü, Cloudflare'a 225.000 dolar ödemeyi ve patentlerini kamuya açıklamayı kabul etti, bu da ihlal nedeniyle dava açma yeteneğini sona erdirdi.",
      "Bu karar, Cloudflare'ın patent trolleriyle mücadele ederken karşılaşılan yüksek maliyetleri ve zorlukları vurgulayan başarılı hukuk mücadelesinin ardından geldi.",
      "Cloudflare'ın zaferi, genellikle ürün geliştirmeden patentleri elinde bulunduran ve bunları şirketlerden anlaşmalar koparmak için kullanan patent trollerine karşı bir kazanımı temsil ettiği için önemlidir."
    ],
    "points": 508,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727960716
  },
  {
    "id": 41727971,
    "title": "Terminal renkleri zordur",
    "originLink": "https://jvns.ca/blog/2024/10/01/terminal-colours/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727971",
    "commentBody": "",
    "originSummary": [
      "Terminal renklerini yapılandırmak, okunabilirlik sorunları ve 16 ANSI renginin tonlarındaki standart eksikliği nedeniyle zor olabilir. Kullanıcılar, terminal emülatörü ayarları veya kabuk betikleri aracılığıyla terminal renklerini ayarlayabilir ve iTerm2 gibi araçlar, okunabilirliği artırmak için 'minimum kontrast' gibi özellikler sunar. Terminal ve Vim temalarını senkronize etmek, renk uyumsuzluklarını önleyebilir; Base16-shell ve base16-vim gibi çözümler popülerdir, ancak evrensel olarak mükemmel değildir."
    ],
    "commentSummary": [
      "Terminal renklerini yönetmek, ekran kurulumlarındaki farklılıklar ve bazı konsollarda sınırlı destek nedeniyle zor olabilir, açık temalar karanlık temalardan daha fazla etkilenir.- `fd` veya `exa` gibi araçları kullanırken temel konsollarla uyumluluğu sağlamak için yedek temalar kullanın ve daha iyi okunabilirlik için terminal emülatörü renk şemalarını özelleştirin.- Kullanıcı renk tercihlerini 8bit veya 24bit renklerle geçersiz kılan komut satırı arayüzü (CLI) araçlarından kaçının; bunun yerine, tutarlılık için ANSI renklerini kullanın ve renk kontrastı için erişilebilirlik yönergelerine uyun."
    ],
    "points": 277,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727938683
  },
  {
    "id": 41728001,
    "title": "Fazla ekran süresinin yetişkin beynine etkileri",
    "originLink": "https://longevity.stanford.edu/lifestyle/2024/05/30/what-excessive-screen-time-does-to-the-adult-brain/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41728001",
    "commentBody": "",
    "originSummary": [
      "İş dışında günde iki saatten fazla olarak tanımlanan aşırı ekran süresi, yetişkin beyin sağlığını olumsuz etkileyebilir ve göz yorgunluğu, boyun ağrısı ve ruh sağlığı sorunları gibi problemlere yol açabilir.- Araştırmalar, bunun beyin korteksinin incelmesine, gri madde hacminin azalmasına, uyku bozukluklarına ve demans gibi beyinle ilgili hastalıkların artan riskine neden olabileceğini göstermektedir.- Uzmanlar, özellikle sabahları ekran süresini en aza indirgemeyi ve beyin sağlığını teşvik etmek için egzersiz, sosyal etkileşim ve stres yönetimi gibi aktivitelerle meşgul olmayı önermektedir."
    ],
    "commentSummary": [
      "Aşırı ekran süresinin, özellikle sabahları, yetişkin beyin fonksiyonlarını olumsuz etkilediği öne sürülmektedir, ancak bu iddia tartışmalıdır.",
      "İzlenen içeriğin mi yoksa ekranların kendisinin mi daha zararlı olduğu konusunda devam eden bir tartışma var ve ekran kullanımını dengelemek için önerilerde bulunuluyor.",
      "Genel kanı, odaklanmayı, üretkenliği ve zihinsel sağlığı potansiyel olarak artırmak için ekran süresine dikkat edilmesi gerektiğini vurgulamaktadır."
    ],
    "points": 240,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1727939041
  },
  {
    "id": 41732634,
    "title": "Canvas, ChatGPT ile yazı yazmanın ve kodlamanın yeni bir yoludur.",
    "originLink": "https://openai.com/index/introducing-canvas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41732634",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Canvas, ChatGPT'de yazma ve kodlama için tasarlanmış yeni bir özelliktir ve Claude'un yeteneklerine rakip olmayı hedefleyerek kod ve metinle dinamik etkileşim sunar.",
      "Kullanıcılar, arayüz iyileştirmeleri konusunda heyecan duyarken, OpenAI'nin etik uygulamaları ve tüketici ürünlerine odaklanması konusunda endişeler taşıyor.",
      "Canvas'ın kademeli olarak kullanıma sunulması, mevcut araçlara entegrasyonu ve kod yeniden yapılandırma gibi görevler için potansiyeli üzerine tartışmalar başlattı."
    ],
    "points": 225,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1727975243
  },
  {
    "id": 41729526,
    "title": "\".io\" TLD, Birleşik Krallık'ın Chagos Adaları'nı geri vermesinden sonra ne olacak?",
    "originLink": "https://news.ycombinator.com/item?id=41729526",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729526",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      ".io\" üst düzey alan adının (TLD) geleceği, İngiltere'nin Chagos Adaları'nı Mauritius'a geri verme kararı sonrasında belirsiz, çünkü Britanya Hint Okyanusu Toprakları artık var olmayacak. Buna rağmen, \".io\" alan adı, SSCB'nin dağılmasından sonra \".su\" alan adının devam etmesine benzer şekilde, popülerliği nedeniyle devam edebilir. \".io\" alan adlarına sahip kullanıcılar, alan adının işletiminin Mauritius'a devredilmesi veya yeniden sınıflandırılması gibi potansiyel değişiklikler hakkında bilgi sahibi olmalıdır, ICANN'ın politikası olası bir aşamalı kaldırmayı öngörse de istisnalara izin vermektedir."
    ],
    "points": 199,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1727954297
  },
  {
    "id": 41729891,
    "title": "Gauss Dağılımı ile Görüntü Düzenleme",
    "originLink": "https://www.unite.ai/image-editing-with-gaussian-splatting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729891",
    "commentBody": "",
    "originSummary": [
      "Polonya ve Birleşik Krallık'tan araştırmacılar, 2D görüntü parçalarını manipülasyon için 3D alana dönüştürmek amacıyla Gaussian Splatting kullanan MiraGe adlı yeni bir görüntü düzenleme sistemi geliştirdiler.",
      "Adobe'nin Firefly gibi üretken yapay zeka modellerinin aksine, MiraGe, Latent Diffusion Modelleri yerine Gaussian Mesh Splatting (GaMeS) kullanır ve görüntüleri CGI ağları olarak yorumlayarak ayrıntılı ve esnek düzenlemeler yapılmasına olanak tanır.",
      "MiraGe, Blender ile entegre olur ve gerçekçi dönüşümler için harici fizik motorları kullanır, görüntü kalitesi testlerinde önceki yöntemleri geride bırakır ve tam kodu GitHub'da erişilebilir durumdadır."
    ],
    "commentSummary": [
      "Gauss sıçratma, yaratıcı fotoğrafçılık ve fotogrametri alanında potansiyeli araştırılan, gerçek 3D modeller oluşturmadan kendine özgü bir görsel stil sunan bir tekniktir. - Teknik, ek veriler ekleyerek tek bir bakış açısıyla çalışabilir, yenilikçi 2D görüntü manipülasyonlarına olanak tanır ve muhtemelen kamera teknolojisinde ana akım bir araç haline gelebilir. - Jeneratif yapay zeka ile karşılaştırıldığında rolü hakkında devam eden bir tartışma vardır; bazıları, sanatçıları değiştirmek yerine sanatsal yaratıcılığı artırmak için bir araç olarak kullanılmasını savunmaktadır."
    ],
    "points": 186,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1727957111
  },
  {
    "id": 41727933,
    "title": "Uygulamalarım neden yakında Google Play Store'dan kaldırılacak?",
    "originLink": "https://frozenfractal.com/blog/2024/9/6/why-my-apps-will-soon-be-gone-from-google-play/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727933",
    "commentBody": "",
    "originSummary": [
      "Geliştiricinin uygulamaları, D-U-N-S numarası ve resmi belgeler gibi daha sıkı yayınlama gereksinimleri nedeniyle Google Play Store'dan kaldırılacak.",
      "Bu yeni gereksinimler, bağımsız geliştiriciler için zorluklar yaratıyor ve geliştiricinin Play Store hesabının süresinin dolmasına neden oluyor.",
      "Geliştirici, özellikle bir web uygulaması olarak yeniden ele almayı umdukları Papageno projesinin kaldırılmasından dolayı hayal kırıklığına uğradı."
    ],
    "commentSummary": [
      "Yazar, Google'ın katı güncelleme ve API uyumluluk gereksinimleri nedeniyle geliştiricilerin Google Play Store'da uygulamalarını tutma konusunda karşılaştıkları zorlukları vurguluyor. Gereksinimlerin karşılanmaması durumunda uygulamanın kaldırılması riski ve sürekli güncelleme ihtiyacı nedeniyle özellikle bağımsız geliştiriciler arasında bir hayal kırıklığı var. Tartışma, iOS ve Windows gibi diğer platformlarla karşılaştırmaları içeriyor ve F-Droid veya web uygulamaları gibi alternatif dağıtım yöntemlerini öneriyor, uygulama mağazası politikalarının geliştiriciler üzerindeki daha geniş etkisini vurguluyor."
    ],
    "points": 180,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1727938235
  },
  {
    "id": 41724747,
    "title": "Meksika'nın su altı mağaralarında, eserler, fosiller ve insan kalıntılarına bir bakış",
    "originLink": "https://www.smithsonianmag.com/travel/divers-in-mexicos-underwater-caves-get-a-glimpse-of-rarely-seen-artifacts-fossils-and-human-remains-180985159/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41724747",
    "commentBody": "",
    "originSummary": [
      "Yucatán Yarımadası'nın su altı mağaraları, cenoteler aracılığıyla erişilebilen, Maya eserleri ve soyu tükenmiş megafauna fosilleri de dahil olmak üzere arkeolojik ve paleontolojik kalıntılarıyla önemlidir.",
      "Bu mağaralar, erken insan yaşamı, Büyük Amerikan Biyotik Değişimi hakkında bilgiler sunar ve büyük memelilerin yok oluşuyla ilgili gizemleri çözmeye yardımcı olabilir.",
      "Mağara kaşifleri ve bilim insanları arasındaki işbirliği, bu mağaralarda korunan tarihi ve bilimsel sırların ortaya çıkarılması için esastır."
    ],
    "commentSummary": [
      "Meksika'nın Yucatan yarımadasındaki su altı mağaraları, eski insan türleri ve dev yer tembelleri gibi nesli tükenmiş hayvanlar hakkında bilgiler sunan eserler, fosiller ve insan kalıntıları içermektedir.",
      "Cenotelerde mağara dalışı popülerdir ancak uygun eğitim olmadan tehlikelidir, bu da arkeolojide eğitimli mağara kaşiflerinin eksikliğini vurgulamaktadır.",
      "Su altı arkeolojisinin gelişimi ve küçük mağara keşif robotlarının potansiyel kullanımı, bu ulaşılması zor alanların keşfedilmesine yardımcı olabilir. Bu alanlar, Mayaların cenoteleri yeraltı dünyasına açılan kapılar olarak görmeleri nedeniyle kültürel öneme de sahiptir."
    ],
    "points": 176,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1727901401
  },
  {
    "id": 41727621,
    "title": "Flyon UI – Tailwind Bileşenleri Kütüphanesi",
    "originLink": "https://flyonui.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727621",
    "commentBody": "",
    "originSummary": [
      "FlyonUI, geliştirme iş akışlarını kolaylaştırmak için tasarlanmış, 78'den fazla ücretsiz Tailwind CSS bileşeni, şablonları ve örnekleri sunan açık kaynaklı bir kütüphanedir. React ve Vue gibi popüler framework'lerle uyumludur, karanlık mod dahil sınırsız temaları destekler ve DaisyUI ve PrelineJS'den özellikler entegre eder. FlyonUI, süresiz olarak ücretsiz kullanılabilir, topluluk katkılarını teşvik eder ve `npm i -D flyonui@latest` komutuyla npm üzerinden kurulabilir."
    ],
    "commentSummary": [
      "Flyon UI, işlevselliğini artıran fullcalendar ve WYSIWYG (Gördüğünüz Şey Aldığınız Şeydir) editörleri gibi üçüncü taraf eklentileri entegre etmesiyle bilinen bir Tailwind Bileşenleri Kütüphanesidir.",
      "Preline'in çift lisanslama konusundaki endişelerine rağmen, başsız, stil verilmemiş bileşenler sağlayarak Preline'ın JavaScript eklentilerini dahil ederek DaisyUI üzerine inşa eder.",
      "Kullanıcılar, yapılandırma için JSON içinde hantal HTML, yetersiz renk kontrastı ve geliştirilmiş Svelte desteği ihtiyacı gibi bazı dezavantajları belirtmişlerdir, ancak yenilikçi tasarımı nedeniyle övgü almaya devam etmektedir."
    ],
    "points": 166,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1727933438
  },
  {
    "id": 41724881,
    "title": "Bir internet tartışmasının anatomisi",
    "originLink": "https://defenderofthebasic.substack.com/p/anatomy-of-an-internet-argument",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41724881",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Makale, internet tartışmalarında en önemli etkinin genellikle doğrudan katılımcılardan ziyade, tartışmaya dahil olmayan gözlemciler üzerinde olduğunu vurguluyor.",
      "Bu, Twitter gibi platformların, iyi niyetli tartışmaları karmaşıklaştırarak çatışma yoluyla etkileşimi rasyonel söylemin önüne koyabileceğini öne sürüyor.",
      "Bu tartışma, birçok çevrimiçi tartışmanın gerçeği aramaktan ziyade güç dinamiklerine veya inanç pekiştirmeye odaklandığını vurgulamaktadır."
    ],
    "points": 157,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1727902427
  },
  {
    "id": 41728829,
    "title": "Fransa'nın en eski hazine avı çözüldü",
    "originLink": "https://goldenowlhunt.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41728829",
    "commentBody": "",
    "originSummary": [
      "Altın Baykuş, \"Sur la trace de la Chouette d'Or\" kitabıyla başlatılan 31 yıllık bir avın hazinesi, 10 Mart 2024 itibarıyla bulunmuştur.",
      "1993 yılında Max Valentin ve Michel Becker tarafından başlatılan av, gömülü bir baykuş heykelciğini bulmak için 11 ipucunu çözmeyi içeriyordu.",
      "Site, hazine avcılarına yardımcı olmak için forumlar, haritalar ve teoriler gibi kaynaklar sunmanın yanı sıra, Michel Becker'den ek ipuçları ve tartışmalar da sağlamaktadır."
    ],
    "commentSummary": [
      "Fransa'nın en eski hazine avı \"Altın Baykuşun İzinde\" çözüldü ve Michel Becker, hazinenin bulunduğu yerde orijinal bronz baykuş yerine paslı bir demir kuş buldu.",
      "Altın baykuş, temizliğini korumak ve bulmacayı çözen kişinin başarısını duyurmasını sağlamak amacıyla kasıtlı olarak asla gömülmedi.",
      "2021'den beri Michel Becker'in yönetimi etrafında dönen tartışmalara rağmen, av devam etti ve Masquerade ve Forrest Fenn hazinesi gibi diğer ünlü hazine avlarıyla paralellikler çizdi."
    ],
    "points": 149,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1727946985
  },
  {
    "id": 41729278,
    "title": "AB: \"Potansiyel teröristler\" tanımının geniş bilgi paylaşımına kapı açması",
    "originLink": "https://www.statewatch.org/news/2024/october/eu-definition-of-potential-terrorists-opens-door-to-broad-information-sharing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729278",
    "commentBody": "",
    "originSummary": [
      "Avrupa'da sivil özgürlükleri izleyen bir kuruluş olan Statewatch, daha geniş bilgi paylaşımına izin veren AB'nin yeni \"potansiyel teröristler\" tanımı konusundaki endişeleri vurguluyor.",
      "Bu genişletilmiş tanım, sığınmacıları, mültecileri ve iklim aktivistlerini güvenlik tehditleri olarak etiketleyebilir, bu da gizlilik ve demokratik denetim endişelerini artırabilir.",
      "AB'nin artan istihbarat paylaşımı ve gözetim çabaları, insan hakları ve demokrasi üzerinde önemli etkiler yaratabilir."
    ],
    "commentSummary": [
      "AB'nin \"potansiyel teröristler\" tanımı, geniş bilgi paylaşımının siyasi muhalefet ve gizlilik üzerindeki etkileri nedeniyle endişe yaratıyor.",
      "Eleştirmenler, bu tanımın siyasi rakipleri hedef almak için kötüye kullanılabileceğinden endişe ediyor, bu da otoriterlik ve güvenlik ile özgürlük arasındaki hassas dengenin bozulması korkularını artırıyor.",
      "Bu tartışma, tehditleri belirleme kriterlerini sorgulayarak ve hükümetin aşırı müdahalesi ile demokratik süreçlerin aşınmasına dair daha geniş endişeleri yansıtarak, ABD'nin uçuş yasağı listesi ile paralellikler kuruyor."
    ],
    "points": 148,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1727951770
  },
  {
    "id": 41730983,
    "title": "70B Ölçekli LLM'leri Düşük Kaynaklı Uç Cihazlarda Verimli Bir Şekilde Sunma [pdf]",
    "originLink": "https://arxiv.org/abs/2410.00531",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41730983",
    "commentBody": "",
    "originSummary": [
      "TPI-LLM\" başlıklı makale, düşük kaynaklı uç cihazlarda büyük dil modellerini (LLM'ler) çalıştırma zorluğunu ele alıyor ve gizlilik ile verimliliğe odaklanıyor. TPI-LLM, bir tensör paralel çıkarım sistemi olarak, verileri yerel tutarak ve bellek kullanımını azaltan ve gecikmeyi iyileştiren bir kaydırma penceresi bellek zamanlayıcısı kullanarak performansı artırmayı öneriyor. Sistem, ilk token süresi ve token gecikmesinde önemli iyileştirmeler gösteriyor ve kod, daha fazla keşif için çevrimiçi olarak mevcut."
    ],
    "commentSummary": [
      "Makale, yenilikçi zamanlama teknikleri aracılığıyla belleği ve bant genişliğini optimize ederek düşük kaynaklı uç cihazlarda 70 milyar parametre ölçeğinde Büyük Dil Modellerini (LLM'ler) çalıştırmayı araştırıyor.",
      "Bu, birden fazla uç cihaz arasında dağıtılmış çıkarım olasılığını öneriyor, ancak mevcut donanım kısıtlamaları, yavaş işlem süreleriyle sonuçlanıyor (her birim için 26-29 saniye).",
      "Büyük modellerin daha küçük GPU'larda çalışmasını sağlayabilecek bu yaklaşım, güçlü modellere erişimi potansiyel olarak demokratikleştirebilir, ancak optimal performans için hala önemli donanım ve bant genişliği gereklidir."
    ],
    "points": 143,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1727964680
  },
  {
    "id": 41726698,
    "title": "Gama radyasyonu, büyük tropikal fırtınalarda üretilir.",
    "originLink": "https://phys.org/news/2024-10-amount-variety-gamma-large-tropical.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41726698",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Gamma radyasyonu, yüklü parçacıkların hareketi sonucu güçlü elektrik alanları oluşturması nedeniyle, bir vakumda bant açıldığında üretilen x-ışınlarına benzer şekilde, büyük tropikal fırtınalarda üretilir.",
      "Medya karşılaştırmaları, bu elektrik alanlarını AA pillerine benzetmek gibi, yanıltıcı olabilir ve bilimsel fenomenleri aşırı basitleştirebilir.",
      "Metin, gama radyasyonunun biyolojik çeşitlilik üzerindeki potansiyel etkisini ve bilimsel iletişimde standart olmayan birimlerin kullanılmasının yarattığı zorlukları vurgulamaktadır."
    ],
    "points": 133,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1727921822
  }
]
