[
  {
    "id": 41726197,
    "title": "נרשם: WP Engine Inc. נגד Automattic Inc. ומת'יו צ'ארלס מולנווג [pdf]",
    "originLink": "https://wpengine.com/wp-content/uploads/2024/10/Complaint-WP-Engine-v-Automattic-et-al-with-Exhibit.pdf",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41726197",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "וורדפרס אנג'ין בע\"מ הגישה תביעה נגד אוטומטיק בע\"מ ומייסדה, מת'יו צ'ארלס מולנווג, מה שהוביל למחלוקת ובחינה מדוקדקת.",
      "מולנווג חשף את פרטי ראיון העבודה של הת'ר ברונר באוטומטיק והחלטתו להפסיק עדכוני תוספים למשתמשי וורדפרס, מה שמשפיע על 1.5 מיליון אתרים, העלו חששות לגבי האמון בתשתית וורדפרס.",
      "מבקרים יעצו למולנווג להימנע מהערות פומביות במהלך ההליכים המשפטיים כדי למנוע סיבוכים נוספים בתיק."
    ],
    "points": 524,
    "commentCount": 547,
    "retryCount": 0,
    "time": 1727915345
  },
  {
    "id": 41730415,
    "title": "טרול הפטנטים סייבל משלם, מקדיש את כל הפטנטים שלו לציבור",
    "originLink": "https://blog.cloudflare.com/patent-troll-sable-pays-up/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41730415",
    "commentBody": "",
    "originSummary": [
      "סייבל IP הסדירה את התביעה שלה עם Cloudflare, והסכימה לשלם 225,000 דולר ולהפוך את הפטנטים שלה לציבוריים, ובכך סיימה מאבק משפטי של שלוש שנים על תביעות פטנט חסרות בסיס.",
      "פרויקט ג'נגו של Cloudflare, שמסתמך על מיקור המונים של אמנות קודמת כדי להילחם בטרולי פטנטים, היה מכריע בניצחון זה, והעניק למשתתפים מעל 125,000 דולר.",
      "ההחלטה של סייבל להקדיש את הפטנטים שלה לציבור מונעת תביעות משפטיות עתידיות נגד חברות אחרות המשתמשות בפטנטים אלו."
    ],
    "commentSummary": [
      "סייבל, טרול פטנטים, הסכים לשלם ל-Cloudflare 225,000 דולר ולהפוך את הפטנטים שלו לציבוריים, ובכך לסיים את יכולתו לתבוע על הפרה.",
      "ההחלטה הזו מגיעה בעקבות המאבק המשפטי המוצלח של Cloudflare, שמדגיש את העלויות הגבוהות והאתגרים שעומדות בפני חברות כאשר הן נלחמות בטרולים פטנטיים.",
      "ניצחונה של Cloudflare הוא משמעותי שכן הוא מייצג ניצחון נגד טרולי פטנטים, אשר לעיתים קרובות מחזיקים בפטנטים מבלי לפתח מוצרים, ומשתמשים בהם כדי להוציא הסדרים מחברות."
    ],
    "points": 508,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1727960716
  },
  {
    "id": 41727971,
    "title": "צבעי הטרמינל הם מסובכים",
    "originLink": "https://jvns.ca/blog/2024/10/01/terminal-colours/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727971",
    "commentBody": "",
    "originSummary": [
      "ניתן להגדיר צבעי מסוף, אך זה עשוי להיות קשה בשל בעיות קריאות והיעדר תקנון בגוונים של 16 צבעי ANSI. משתמשים יכולים להתאים את צבעי המסוף דרך הגדרות אמולטור המסוף או סקריפטים של מעטפת, וכלים כמו iTerm2 מציעים תכונות כמו \"ניגוד מינימלי\" לשיפור הקריאות. סנכרון נושאי מסוף ו-Vim יכול למנוע חוסר התאמה בצבעים, עם פתרונות כמו Base16-shell ו-base16-vim הפופולריים, אם כי לא מושלמים באופן אוניברסלי."
    ],
    "commentSummary": [
      "צבעי טרמינל יכולים להיות קשים לניהול בשל הבדלים בהגדרות מסך ותמיכה מוגבלת בחלק מהקונסולות, כאשר נושאים בהירים מושפעים יותר מאשר נושאים כהים. כדי להבטיח תאימות עם קונסולות בסיסיות, השתמש בנושאי גיבוי בעת שימוש בכלים כמו `fd` או `exa`, והתאם אישית את סכמות הצבעים של אמולטור הטרמינל לשיפור הקריאות. הימנע מכלי ממשק שורת פקודה (CLI) שמחליפים את העדפות הצבע של המשתמש עם צבעים של 8bit או 24bit; במקום זאת, השתמש בצבעי ANSI לשמירה על עקביות והיצמד להנחיות נגישות לניגודיות צבעים."
    ],
    "points": 277,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1727938683
  },
  {
    "id": 41728001,
    "title": "מה עושה זמן מסך מופרז למוח של מבוגרים",
    "originLink": "https://longevity.stanford.edu/lifestyle/2024/05/30/what-excessive-screen-time-does-to-the-adult-brain/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41728001",
    "commentBody": "",
    "originSummary": [
      "זמן מסך מופרז, המוגדר כיותר משעתיים ביום מחוץ לעבודה, יכול להשפיע לרעה על בריאות המוח של מבוגרים, ולגרום לבעיות כמו מאמץ עיניים, כאבי צוואר ובעיות בריאות נפשית. מחקרים מצביעים על כך שהוא עשוי להוביל לדילול קליפת המוח, ירידה בנפח החומר האפור, הפרעות בשינה וסיכון מוגבר למחלות הקשורות למוח כמו דמנציה. מומחים ממליצים לצמצם את זמן המסך, במיוחד בבוקר, ומציעים לעסוק בפעילויות כמו פעילות גופנית, אינטראקציה חברתית וניהול מתחים כדי לקדם את בריאות המוח."
    ],
    "commentSummary": [
      "נטען כי זמן מסך מופרז, במיוחד בבוקר, עשוי להשפיע לרעה על תפקוד המוח אצל מבוגרים, אם כי טענה זו נתונה לדיון.",
      "ישנה דיון מתמשך לגבי האם התוכן הנצפה או המדיום של המסכים מזיק יותר, עם המלצות לאזן את השימוש במסכים.",
      "הקונצנזוס הכללי מדגיש את החשיבות של להיות מודעים לזמן המסך כדי לשפר את הריכוז, הפרודוקטיביות והבריאות הנפשית."
    ],
    "points": 240,
    "commentCount": 173,
    "retryCount": 0,
    "time": 1727939041
  },
  {
    "id": 41732634,
    "title": "Canvas הוא דרך חדשה לכתוב ולתכנת עם ChatGPT",
    "originLink": "https://openai.com/index/introducing-canvas/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41732634",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Canvas הוא תכונה חדשה ב-ChatGPT המיועדת לכתיבה ותכנות, במטרה להתחרות ביכולות של Claude, ומציעה אינטראקציה דינמית עם קוד וטקסט.",
      "משתמשים מגיבים בתגובות מעורבות, עם התלהבות משיפורי הממשק ודאגות לגבי הפרקטיקות האתיות של OpenAI וההתמקדות במוצרי צריכה.",
      "ההפצה ההדרגתית של Canvas עוררה דיונים על שילובו בכלים קיימים ועל הפוטנציאל שלו למשימות כמו שינוי מבנה קוד."
    ],
    "points": 225,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1727975243
  },
  {
    "id": 41729526,
    "title": "מה יקרה לסיומת \".io\" לאחר שהממלכה המאוחדת תחזיר את איי צ'אגוס?",
    "originLink": "https://news.ycombinator.com/item?id=41729526",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729526",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "העתיד של סיומת הדומיין העליונה \".io\" אינו ודאי בעקבות החלטת בריטניה להחזיר את איי צ'אגוס למאוריציוס, שכן הטריטוריות הבריטיות באוקיינוס ההודי לא יתקיימו יותר. למרות זאת, ייתכן שהדומיין \".io\" ימשיך להתקיים בשל הפופולריות שלו, בדומה להמשך קיומו של הדומיין \".su\" לאחר התפרקות ברית המועצות. משתמשים עם דומיינים \".io\" צריכים להישאר מעודכנים לגבי שינויים פוטנציאליים, שכן ייתכן שהפעלת הדומיין תעבור למאוריציוס או תסווג מחדש, עם מדיניות ICANN שמציעה אפשרות של סיום הדרגתי אך מאפשרת חריגות."
    ],
    "points": 199,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1727954297
  },
  {
    "id": 41729891,
    "title": "עריכת תמונה עם פיזור גאוסי",
    "originLink": "https://www.unite.ai/image-editing-with-gaussian-splatting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729891",
    "commentBody": "",
    "originSummary": [
      "חוקרים מפולין ובריטניה פיתחו את MiraGe, מערכת עריכת תמונות חדשנית המשתמשת בטכניקת Gaussian Splatting כדי להמיר חלקי תמונה דו-ממדיים למרחב תלת-ממדי לצורך מניפולציה.",
      "בניגוד למודלים של בינה מלאכותית גנרטיבית כמו Firefly של Adobe, MiraGe משתמשת בטכניקת Gaussian Mesh Splatting (GaMeS) במקום במודלים של פיזור לטנטי, מה שמאפשר עריכות מפורטות וגמישות על ידי פירוש תמונות כרשתות CGI.",
      "מירהג' משתלבת עם בלנדר ומשתמשת במנועי פיזיקה חיצוניים לשם טרנספורמציות מציאותיות, ומבצעת טוב יותר משיטות קודמות במבחני איכות תמונה, והקוד המלא שלה נגיש ב-GitHub."
    ],
    "commentSummary": [
      "נבחנת האפשרות של שימוש בטכניקת Gaussian splatting בצילום יצירתי ופוטוגרמטריה, תוך מתן סגנון ויזואלי ייחודי ללא יצירת מודלים תלת-ממדיים אמיתיים. הטכניקה יכולה לפעול מנקודת מבט יחידה על ידי שילוב נתונים נוספים, מה שמאפשר מניפולציות חדשניות של תמונות דו-ממדיות ואולי להפוך לכלי מרכזי בטכנולוגיית מצלמות. יש ויכוח מתמשך על תפקידה בהשוואה ל-AI גנרטיבי, כאשר יש הממליצים על השימוש בה ככלי להעצמת היצירתיות האמנותית ולא להחלפת אמנים."
    ],
    "points": 186,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1727957111
  },
  {
    "id": 41727933,
    "title": "מדוע האפליקציות שלי ייעלמו בקרוב מחנות Google Play",
    "originLink": "https://frozenfractal.com/blog/2024/9/6/why-my-apps-will-soon-be-gone-from-google-play/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727933",
    "commentBody": "",
    "originSummary": [
      "האפליקציות של המפתח יוסרו מחנות Google Play עקב דרישות פרסום מחמירות יותר, כמו הצורך במספר D-U-N-S ומסמכים רשמיים.",
      "דרישות חדשות אלו מהוות אתגר למפתחים עצמאיים, מה שמוביל את המפתח לתת לחשבון ה-Play Store שלו לפוג.",
      "המפתח מאוכזב במיוחד מהסרת פרויקט פפגנו, פרויקט שהם מקווים לחזור אליו כאפליקציית רשת."
    ],
    "commentSummary": [
      "המחבר מדגיש את האתגרים שעומדים בפני מפתחים בשמירה על אפליקציות בחנות Google Play בשל דרישות העדכון והציות ל-API המחמירות של גוגל. ישנה תסכול מתמיד מהצורך בעדכונים ומהסיכון להסרת האפליקציה אם הדרישות לא מתקיימות, במיוחד משפיע על מפתחים עצמאיים. הדיון כולל השוואות עם פלטפורמות אחרות כמו iOS ו-Windows, ומציע שיטות הפצה חלופיות כמו F-Droid או אפליקציות רשת, תוך הדגשת ההשפעה הרחבה יותר של מדיניות חנויות האפליקציות על מפתחים."
    ],
    "points": 180,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1727938235
  },
  {
    "id": 41724747,
    "title": "במערות התת-ימיות של מקסיקו, הצצה לממצאים ארכיאולוגיים, מאובנים ושרידי אדם",
    "originLink": "https://www.smithsonianmag.com/travel/divers-in-mexicos-underwater-caves-get-a-glimpse-of-rarely-seen-artifacts-fossils-and-human-remains-180985159/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41724747",
    "commentBody": "",
    "originSummary": [
      "המערות התת-ימיות של חצי האי יוקטן, הנגישות דרך סנוטות, הן בעלות חשיבות בשל הממצאים הארכיאולוגיים והפלאונטולוגיים שלהן, כולל חפצי מאיה ומאובנים של מגפאונה שנכחדה.",
      "מערות אלו מציעות תובנות על חיי האדם הקדומים, חילופי הביוטה הגדולים של אמריקה, ועשויות לעזור בפתרון תעלומות הנוגעות להכחדת יונקים גדולים.",
      "שיתוף פעולה בין חוקרי מערות למדענים הוא חיוני לחשיפת הסודות ההיסטוריים והמדעיים השמורים בתוך מערות אלו."
    ],
    "commentSummary": [
      "מערות תת-ימיות במקסיקו בחצי האי יוקטן מכילות חפצים, מאובנים ושרידי אדם, ומספקות תובנות על מינים אנושיים עתיקים ובעלי חיים שנכחדו כמו עצלנים קרקעיים ענקיים.",
      "צלילה במערות בסנוטות אלו פופולרית אך מסוכנת ללא הכשרה מתאימה, מה שמדגיש מחסור בחוקרי מערות מיומנים בארכיאולוגיה.",
      "התפתחות הארכיאולוגיה התת-ימית והשימוש הפוטנציאלי ברובוטים קטנים לחקר מערות עשויים לסייע בחקר אתרים שקשה להגיע אליהם, אשר גם נושאים משמעות תרבותית שכן המאיה ראו בסנוטות שערים לעולם התחתון."
    ],
    "points": 176,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1727901401
  },
  {
    "id": 41727621,
    "title": "Flyon UI – ספריית רכיבים של Tailwind",
    "originLink": "https://flyonui.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41727621",
    "commentBody": "",
    "originSummary": [
      "FlyonUI היא ספריית קוד פתוח המספקת מעל 78 רכיבי Tailwind CSS חינמיים, תבניות ודוגמאות, שנועדה לייעל את תהליכי הפיתוח. היא תואמת למסגרות פופולריות כמו React ו-Vue, תומכת בנושאים בלתי מוגבלים כולל מצב כהה, ומשלבת תכונות מ-DaisyUI ו-PrelineJS. FlyonUI חינמית לשימוש ללא הגבלת זמן, מעודדת תרומות מהקהילה, וניתן להתקינה באמצעות npm עם הפקודה `npm i -D flyonui@latest`."
    ],
    "commentSummary": [
      "Flyon UI היא ספריית רכיבים של Tailwind הידועה בשילוב תוספים של צד שלישי כמו fullcalendar ועורכי WYSIWYG (מה שאתה רואה זה מה שאתה מקבל), מה שמשפר את הפונקציונליות שלה.",
      "זה מתבסס על DaisyUI על ידי שילוב של תוספי JavaScript של Preline, ומספק רכיבים ללא עיצוב וללא ראש, אם כי יש חששות לגבי הרישוי הכפול של Preline.",
      "משתמשים ציינו כמה חסרונות, כולל HTML מסורבל בתוך JSON לצורך תצורה, ניגודיות צבעים לא מספקת וצורך בשיפור התמיכה ב-Svelte, אך עדיין זוכה לשבחים על עיצובו החדשני."
    ],
    "points": 166,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1727933438
  },
  {
    "id": 41724881,
    "title": "האנטומיה של ויכוח באינטרנט",
    "originLink": "https://defenderofthebasic.substack.com/p/anatomy-of-an-internet-argument",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41724881",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המאמר מדגיש שבוויכוחים באינטרנט, ההשפעה המשמעותית ביותר היא לעיתים קרובות על הצופים הלא מעורבים ולא על המשתתפים הישירים.",
      "זה מציע שפלטפורמות כמו טוויטר עשויות להעדיף מעורבות דרך קונפליקט על פני שיח רציונלי, מה שמסבך דיונים בתום לב.",
      "הדיון מדגיש שרבים מהוויכוחים המקוונים מתמקדים בדינמיקות כוח או בחיזוק אמונות במקום בחיפוש אחר האמת."
    ],
    "points": 157,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1727902427
  },
  {
    "id": 41728829,
    "title": "ציד האוצרות הוותיק ביותר בצרפת נפתר",
    "originLink": "https://goldenowlhunt.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41728829",
    "commentBody": "",
    "originSummary": [
      "הינשוף המוזהב, אוצר מציד שנמשך 31 שנים שהחל בעקבות הספר 'בעקבות הינשוף המוזהב', נמצא נכון ל-10 במרץ 2024.",
      "הציד, שהחל בשנת 1993 על ידי מקס ולנטין ומישל בקר, כלל פתרון של 11 רמזים כדי לאתר פסלון ינשוף קבור.",
      "האתר מספק משאבים כגון פורומים, מפות ותיאוריות, יחד עם רמזים נוספים ומחלוקות ממישל בקר, כדי לסייע לציידי אוצרות."
    ],
    "commentSummary": [
      "ציד האוצרות הוותיק ביותר בצרפת, \"בעקבות הינשוף המוזהב\", נפתר, כאשר מישל בקר גילה ציפור ברזל חלודה במקום הינשוף הברונזה המקורי במיקום האוצר.",
      "הינשוף המוזהב מעולם לא נקבר בכוונה כדי לשמור על ניקיונו ולהבטיח שהפותרים יכריזו על הצלחתם.",
      "על אף המחלוקות סביב הניהול של מישל בקר מאז 2021, החיפוש נמשך, תוך השוואה לציד אוצרות מפורסמים אחרים כמו מסקרייד ואוצר פורסט פן."
    ],
    "points": 149,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1727946985
  },
  {
    "id": 41729278,
    "title": "האיחוד האירופי: הגדרת \"טרוריסטים פוטנציאליים\" פותחת דלת לשיתוף מידע נרחב",
    "originLink": "https://www.statewatch.org/news/2024/october/eu-definition-of-potential-terrorists-opens-door-to-broad-information-sharing/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41729278",
    "commentBody": "",
    "originSummary": [
      "סטייטווטש, ארגון המפקח על זכויות האזרח באירופה, מדגיש חששות מההגדרה החדשה של האיחוד האירופי ל\"טרוריסטים פוטנציאליים\", המאפשרת שיתוף מידע רחב יותר.",
      "ניתן להגדיר מבקשי מקלט, פליטים ופעילי אקלים כאיומי ביטחון, מה שמעלה חששות לגבי פרטיות ופיקוח דמוקרטי.",
      "המאמצים המוגברים של האיחוד האירופי לשיתוף מודיעין ומעקב עשויים להיות השלכות משמעותיות על זכויות האדם והדמוקרטיה."
    ],
    "commentSummary": [
      "ההגדרה של האיחוד האירופי ל\"טרוריסטים פוטנציאליים\" מעוררת דאגה בשל השלכותיה על שיתוף מידע נרחב, שעשוי להשפיע על התנגדות פוליטית ופרטיות.",
      "מבקרים חוששים שהגדרה זו עלולה להיות מנוצלת לרעה כדי למקד יריבים פוליטיים, מה שמעלה חששות לגבי סמכותנות והאיזון העדין בין ביטחון לחירות.",
      "הדיון מעלה הקבלות עם רשימת האיסור לטיסה של ארה\"ב, תוך שהוא מעלה שאלות לגבי הקריטריונים לזיהוי איומים ומשקף חששות רחבים יותר לגבי התערבות יתר של הממשלה ושחיקת תהליכים דמוקרטיים."
    ],
    "points": 148,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1727951770
  },
  {
    "id": 41730983,
    "title": "להפעיל מודלים בקנה מידה של 70 מיליארד פרמטרים ביעילות על מכשירי קצה עם משאבים מוגבלים [pdf]",
    "originLink": "https://arxiv.org/abs/2410.00531",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41730983",
    "commentBody": "",
    "originSummary": [
      "המאמר \"TPI-LLM\" עוסק באתגר של הפעלת מודלים לשוניים גדולים (LLMs) על מכשירי קצה עם משאבים מוגבלים, תוך התמקדות בפרטיות ויעילות. TPI-LLM, מערכת חיזוי מקבילית של טנסורים, מוצעת לשיפור הביצועים על ידי שמירת הנתונים מקומית ושימוש במתזמן זיכרון חלון הזזה, שמפחית את השימוש בזיכרון ומשפר את ההשהיה. המערכת מציגה שיפורים משמעותיים בזמן עד לאסימון הראשון ובהשהיית אסימון, עם קוד זמין באינטרנט להמשך חקירה."
    ],
    "commentSummary": [
      "המאמר חוקר את הפעלת מודלים לשוניים גדולים בקנה מידה של 70 מיליארד פרמטרים על מכשירי קצה בעלי משאבים נמוכים על ידי אופטימיזציה של זיכרון ורוחב פס באמצעות טכניקות תזמון חדשניות.",
      "זה מציע את האפשרות של הסקה מבוזרת על פני מספר מכשירי קצה, אם כי מגבלות החומרה הנוכחיות גורמות לזמני עיבוד איטיים (26-29 שניות לכל אסימון).",
      "הגישה עשויה לאפשר להריץ מודלים גדולים על גבי GPUs קטנים יותר, ובכך אולי להנגיש את השימוש במודלים חזקים, אך עדיין נדרשים חומרה ורוחב פס משמעותיים לביצועים מיטביים."
    ],
    "points": 143,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1727964680
  },
  {
    "id": 41726698,
    "title": "קרינת גמא נוצרת בסופות רעמים טרופיות גדולות.",
    "originLink": "https://phys.org/news/2024-10-amount-variety-gamma-large-tropical.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41726698",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "קרינת גמא נוצרת בסופות רעמים טרופיות גדולות, בדומה לקרני רנטגן המיוצרות על ידי פריסת סרט דבק בוואקום, בשל תנועת חלקיקים טעונים היוצרת שדות חשמליים חזקים.",
      "השוואות בתקשורת, כמו השוואת השדות החשמליים הללו לסוללות AA, עלולות להטעות ולפשט יתר על המידה את התופעות המדעיות.",
      "הדיון מדגיש את ההשפעה הפוטנציאלית של קרינת גמא על המגוון הביולוגי ואת הקשיים הנובעים משימוש ביחידות לא סטנדרטיות בתקשורת מדעית."
    ],
    "points": 133,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1727921822
  }
]
