[
  {
    "id": 38647484,
    "title": "Mitchell Hashimoto jättää jäähyväiset HashiCorpille 11 vuoden jälkeen ja pohtii yrityksen vaikutusta.",
    "originLink": "https://www.hashicorp.com/blog/mitchell-reflects-as-he-departs-hashicorp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38647484",
    "commentBody": "",
    "originSummary": [
      "Mitchell Hashimoto, HashiCorpin toinen perustaja, on ilmoittanut jättävänsä yrityksen 11 vuoden jälkeen ja esittänyt sydämellisen kirjeen, jossa hän ilmaisee kiitollisuutensa HashiCorpin vaikutuksesta.",
      "Hashimoto kertoo päätöksestään lähteä etsimään uusia haasteita pilviautomaation ja infrastruktuurityökalujen lisäksi.",
      "Hän korostaa HashiCorpin kasvua ja saavutuksia, kuten ohjelmistojen laajaa käyttöönottoa ja tunnustusta avoimen lähdekoodin projekteissa, ja toivottaa yritykselle menestystä tulevaisuudessa."
    ],
    "commentSummary": [
      "Mitchell Hashimoto, HashiCorpin toinen perustaja, jättää yrityksen 14 vuoden jälkeen ja kerää onnittelut ja kiitokset yhteisöltä hänen panoksestaan ohjelmistokehitysalalle.",
      "Keskusteluissa käsitellään HashiCorpin projekteja, viimeaikaisia lisenssimuutoksia ja monipilvikäyttöä Terraformin avulla.",
      "Mitchellin tulevista hankkeista ja mahdollisista vaihtoehdoista HashiCorpin projekteille sekä toiminnan ja Infrastructure as Code (IaC) -työn merkityksestä avoimen lähdekoodin yhteisössä spekuloidaan paljon."
    ],
    "points": 555,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1702589237
  },
  {
    "id": 38644608,
    "title": "Mozilla laajentaa Firefoxin laajennustukea Androidissa yli 450 uudella lisäosalla.",
    "originLink": "https://blog.mozilla.org/en/mozilla/new-extensions-youll-love-now-available-on-firefox-for-android/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38644608",
    "commentBody": "",
    "originSummary": [
      "Mozilla on ottanut käyttöön yli 450 uutta laajennusta Firefoxin Android-käyttöjärjestelmään ja luonut näin avoimen laajennusten ekosysteemin mobiililaitteille.",
      "Käyttäjät voivat nyt mukauttaa ja parantaa verkkokokemustaan Firefox for Androidissa asentamalla nämä laajennukset helposti.",
      "Suositut työpöytälaajennukset, kuten uBlock Origin ja Dark Reader, ovat nyt saatavilla mobiililaitteissa, ja lisää laajennuksia lisätään tulevina kuukausina."
    ],
    "commentSummary": [
      "Mozilla on laajentanut Firefox for Androidin laajennustukea, jolloin käyttäjät voivat asentaa minkä tahansa laajennuksen osoitteesta addons.mozilla.org (AMO).",
      "Laajennustuen laajentamisen viivästyminen johtui laajasta työstä, jota Firefox for Androidin käyttöliittymän uudelleenkirjoittaminen vaati.",
      "Aiheeseen liittyvissä keskusteluissa on spekuloitu Mozillan päätöksestä, esitetty huolia yksityisyydestä, kritisoitu AMO-tilin käyttöä ja ehdotettu käyttäjien varoittamista testaamattomista laajennuksista."
    ],
    "points": 460,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1702576728
  },
  {
    "id": 38645856,
    "title": "QA-tiimien lakkauttamisen seuraukset ohjelmistokehityksessä",
    "originLink": "https://davidkcaudill.medium.com/maybe-getting-rid-of-your-qa-team-was-bad-actually-52c408bd048b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38645856",
    "commentBody": "",
    "originSummary": [
      "Laadunvarmistusryhmistä (QA) eroon pääsemisellä ohjelmistokehityksessä voi olla kielteisiä seurauksia.",
      "Tehtävien automatisointi ja prosessien optimointi voi johtaa siihen, että testauksen merkitys unohtuu.",
      "QA-toiminnot ovat ratkaisevan tärkeitä ohjelmistojen laadun tehokkaassa hallinnassa, mukaan lukien vikojen seuranta, vikojen käsittely, vikojen tutkinta, keskittyminen laatuun ja kokonaisvaltainen testaus. Näiden toimintojen huomiotta jättämisellä voi olla haitallisia vaikutuksia.",
      "Laatua ohjelmistokehitysorganisaatioissa priorisoivien henkilöiden tunnustaminen ja tukeminen on välttämätöntä."
    ],
    "commentSummary": [
      "Laadunvarmistusryhmät ovat ratkaisevassa asemassa ohjelmistokehityksessä, ja testauksessa pelkästään kehittäjien varassa on haittapuolensa.",
      "Keskustelussa tarkastellaan erilaisia testaustapoja, kuten vikakartoituksia ja fuzz-testejä.",
      "Laadunvarmistusryhmien kohtaamat rajoitukset ja haasteet, kuten aliarviointi sekä koulutuksen ja yhteistyön puute, tuodaan esiin ja korostetaan tarvetta asettaa laadunvarmistus ja perusteellinen testaus etusijalle ohjelmistokehityksessä."
    ],
    "points": 395,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1702581358
  },
  {
    "id": 38640406,
    "title": "Barcelonan supertietokonekeskus esittelee Sargantanan: Uusi avoimen lähdekoodin RISC-V-siru",
    "originLink": "https://www.bsc.es/news/bsc-news/bsc-presents-sargantana-the-new-generation-the-first-open-source-chips-designed-spain",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38640406",
    "commentBody": "",
    "originSummary": [
      "Barcelonan supertietokonekeskus (BSC) on esitellyt kolmannen sukupolven Lagarto-prosessorit, Sargantana, jotka perustuvat avoimen lähdekoodin RISC-V-teknologiaan.",
      "Sargantana-prosessoreiden tavoitteena on edistää Euroopan teknologista riippumattomuutta ja vähentää riippuvuutta monikansallisista yrityksistä.",
      "Piirin suorituskyky on parantunut, ja se on Lagarto-tuoteperheen ensimmäinen piiri, joka toimii yli gigahertsin taajuusrajan, mikä vahvistaa BSC:n asemaa RISC-V-laskentatutkimuksen johtajana Euroopassa."
    ],
    "commentSummary": [
      "Barcelonan supertietokonekeskus on luonut avoimen lähdekoodin RISC-V-sirun nimeltä Sargantana, jossa tietoturva ja paikallinen sirutuotanto ovat etusijalla.",
      "GlobalFoundries on kehittänyt uuden 22 nm:n tasoprosessin vanhemmille siruille, mikä on herättänyt keskustelua pienempien solmujen valmistuksen haasteista, kustannuksista ja toteutettavuudesta.",
      "Keskusteluissa käsitellään eri aiheita, kuten vanhempien sirujen tuottamista harrastajatasolla, vanhempien tehtaiden tuottajien rajallista määrää, puolijohdeteollisuuden kannattavuutta, luotettavan sirutoimitusten merkitystä, EU:n näkymiä puolijohdevalmistuksessa, suorittimen suunnittelun suorituskykyä, kielikehitystä ja tietoja Sargantana-sirusta."
    ],
    "points": 357,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1702554937
  },
  {
    "id": 38645159,
    "title": "Mainframe COBOL -ohjelmoijan haastattelu: Haastattelu: Vanhentuneen teknologian haasteet ja siirtyminen uuteen tietokantaan",
    "originLink": "https://ezali.substack.com/p/interviewing-my-mother-a-mainframe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38645159",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa haastatellaan kirjoittajan äitiä, joka työskenteli COBOL-ohjelmoijana eräässä EU:n pankissa.",
      "Haastattelussa tuodaan esiin hänen roolinsa merkitys, vanhentuneen teknologian haasteet ja pankin suunnitelma siirtyä käyttämään uudempaa tietokantaa.",
      "Siinä käsitellään myös pankin vaikeuksia hallita suuria tietomääriä, ohjelmoijien ikääntymistä ja pankkijärjestelmien monimutkaisuutta."
    ],
    "commentSummary": [
      "Foorumilla käydyissä keskusteluissa korostetaan nuorten ohjelmoijien kohtaamia haasteita ja pankkialan institutionaalisen tietämyksen arvoa COBOL-ohjelmoinnissa.",
      "Lisäksi käsitellään vanhojen ja uusien järjestelmien integrointia, ammattitaitoisten COBOL-ohjelmoijien löytämisen vaikeutta ja henkilökohtaisia anekdootteja teknologiateollisuudessa työskentelystä.",
      "Lisäksi aiheina ovat aiempien sukupolvien viisauden säilyttäminen, naisten väheneminen ohjelmoinnissa ja siirtyminen uusiin käyttöjärjestelmiin pankkialalla."
    ],
    "points": 356,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1702578861
  },
  {
    "id": 38643076,
    "title": "FunSearch: LLM:n käyttäminen uusien matemaattisten oivallusten löytämiseen: LLM:n käyttäminen uusien matemaattisten oivallusten löytämiseen",
    "originLink": "https://deepmind.google/discover/blog/funsearch-making-new-discoveries-in-mathematical-sciences-using-large-language-models/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38643076",
    "commentBody": "",
    "originSummary": [
      "FunSearch on menetelmä, jossa hyödynnetään suuria kielimalleja (LLM) uusien löytöjen tekemiseksi matemaattisissa tieteissä.",
      "Se yhdistää valmiiksi koulutetun LLM:n ja automaattisen arvioijan etsimään tietokonekoodiin kirjoitettuja funktioita ja tuottamaan uutta tietoa.",
      "Tutkijat käyttivät FunSearchia ratkaisemaan cap set -ongelman ja löytämään tehokkaampia algoritmeja roskakorien pakkausongelmaan, ja ne päihittivät nykyaikaiset laskennalliset ratkaisut.",
      "FunSearch tuottaa ohjelmia, jotka selittävät, miten ratkaisuihin on päädytty, mikä tekee siitä tehokkaan tieteellisen työkalun.",
      "Tutkimus osoittaa LLM-lähestymistapojen potentiaalin uusille keksinnöille matematiikassa ja reaalimaailman sovelluksissa."
    ],
    "commentSummary": [
      "Kielimallipohjainen geneettinen ohjelmointi (LLM) on keskustelun aihe matemaattisten tieteiden piirissä.",
      "Osallistujat keskustelevat LLM:n eduista uskottavien ohjelmien luomisessa ja järjettömien ohjelmien välttämisessä.",
      "LLM:ien mahdollisuuksia kylmäkäynnistysongelman ratkaisemisessa korostetaan.",
      "LLM:n kustannukset ja soveltuvuus verrattuna muihin geneettisiin ohjelmointitekniikoihin on kyseenalaistettu.",
      "Keskustelussa tarkastellaan myös tekoälyn laajempia vaikutuksia, kuten neuroverkkojen mahdollisuuksia tuottaa uutta tietoa ja vaikutuksia varallisuuseroihin.",
      "Kaiken kaikkiaan LLM:n tuomasta arvosta ja edistyksestä koodin kehityksessä ja ongelmanratkaisussa on erilaisia näkemyksiä."
    ],
    "points": 323,
    "commentCount": 78,
    "retryCount": 0,
    "time": 1702571052
  },
  {
    "id": 38643046,
    "title": "Piilotettu valintaruutu: Dropboxin tekoälyominaisuudet kipinöivät luottamuskriisin.",
    "originLink": "https://simonwillison.net/2023/Dec/14/ai-trust-crisis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38643046",
    "commentBody": "",
    "originSummary": [
      "Dropboxin uudet tekoälyominaisuudet ovat saaneet osakseen kritiikkiä ja herättäneet luottamusta koskevia huolenaiheita, jotka liittyvät yksityisten tiedostojen käyttöön OpenAI-mallien harjoitusdatana.",
      "Vaikka Dropbox kiistää käyttävänsä asiakastietoja ilman suostumusta, sen asetuksiin piilotettu valintaruutu on aiheuttanut hämmennystä ja herättänyt vertauksia Facebookin mikrofonien vakoilua koskevaan kiistaan.",
      "Luottamuksen puute tekoälyyn ja teknologiayrityksiin heikentää yksityisyyden suojaa ja tietosuojaa, mikä korostaa selkeiden selitysten ja avoimuuden merkitystä luottamuksen palauttamiseksi. Lisäksi yksityisyyden suojaan liittyvistä syistä suositaan yhä enemmän paikallisia malleja henkilökohtaisissa laitteissa. Luottamus on ansaittava avoimuudella ja rehellisyydellä tietojen käsittelyssä."
    ],
    "commentSummary": [
      "Artikkelissa ja keskustelussa keskitytään tekoälyn luottamuskriisiin ja suostumuksen merkitykseen verkkosivujen yksityisyyden suojaamisessa.",
      "Siinä korostetaan, että suostumuksen oikeudellinen määritelmä on tarpeen petollisten käytäntöjen estämiseksi.",
      "Keskusteluissa käsitellään huolenaiheita, jotka liittyvät petoksiin ja vastuuvelvollisuuteen suostumuksen myöntämisessä, digitaalisten sopimusten suostumuksen täytäntöönpanoon liittyviin haasteisiin, tietosuojaan, mainontakäytäntöihin ja teknologiayritysten luotettavuuteen."
    ],
    "points": 301,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1702570956
  },
  {
    "id": 38645021,
    "title": "Intelin toimitusjohtaja lupaa poistaa CUDA-markkinat tekoälyn valta-aseman tavoittelemiseksi",
    "originLink": "https://www.tomshardware.com/tech-industry/artificial-intelligence/intel-ceo-attacks-nvidia-on-ai-the-entire-industry-is-motivated-to-eliminate-the-cuda-market",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38645021",
    "commentBody": "",
    "originSummary": [
      "Intelin toimitusjohtaja Pat Gelsinger kritisoi Nvidian CUDA-teknologiaa ja väittää, että teollisuus pyrkii poistamaan sen.",
      "Gelsinger uskoo, että tekoälyn päättelytekniikka on tärkeämpää kuin koulutus ja että Intel keskittyy siihen.",
      "Intel pyrkii kilpailemaan Nvidian kanssa tekoälymarkkinoilla ja korostaa avointen standardien tukemista sekä kumppanuuksien muodostamista Nvidian ja AMD:n kanssa."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään erilaisia teknologiateollisuuden aiheita, kuten ohjelmistoja, laitteistoja ja kilpailua.",
      "Intelin toimitusjohtaja Pat Gelsinger pyrkii haastamaan NVIDIAn CUDA:n valta-aseman ja tutkimaan vaihtoehtoisia kehyksiä, kuten PyTorchia.",
      "Muita aiheita ovat satunnaislukujen tuottaminen, salaustekniikat ja näytönohjainten rajoitukset koneoppimistehtävissä. Artikkelissa korostetaan ohjelmistojen osaamisen merkitystä ja Intelin kaltaisten yritysten haasteita näytönohjainmarkkinoilla."
    ],
    "points": 266,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1702578277
  },
  {
    "id": 38646903,
    "title": "Apple pysäyttää osittain Beeperin iMessage-sovelluksen turhautumisen ja epävarmuuden keskellä",
    "originLink": "https://arstechnica.com/gadgets/2023/12/apple-partly-halts-beepers-imessage-app-again-suggesting-a-long-fight-ahead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38646903",
    "commentBody": "",
    "originSummary": [
      "Apple on osittain estänyt Beeperin iMessage-sovelluksen Android-käyttäjille, mikä aiheuttaa käyttäjille haittaa ja epävarmuutta.",
      "Beeperin toinen perustaja ja käyttäjät ovat turhautuneita ja kehottavat Applea myöntämään pääsyn iMessageen.",
      "Apple perustelee Beeperin estämistä yksityisyyteen, turvallisuuteen ja roskapostiin liittyvillä huolenaiheilla, mutta Beeper kiistää vaarantavansa iMessagen turvallisuuden. Lopputulos riippuu lehdistön ja yhteisön painostuksesta."
    ],
    "commentSummary": [
      "Apple on osittain estänyt Beeperin iMessage-sovelluksen, mikä saattaa viitata ristiriitaan.",
      "Esto vaikuttaa pieneen osaan käyttäjistä, eikä se välttämättä ole tarkoituksellinen.",
      "Keskustelua käydään iMessagen roskapostista, alustojen välisen viestinnän eduista ja mahdollisista protokollan muutoksista.",
      "Käyttäjät keskustelevat iMessagen luotettavuudesta ja käyttökokemuksesta, integroitumisesta muihin viestipalveluihin ja Applen yksinoikeudesta.",
      "Huolta herättävät kadonneet tai väärin suunnatut viestit, Applen turvatoimet ja mahdottomien sarjanumeroiden käyttö.",
      "Keskustelua käydään iPhonen yleisyydestä, viestisovellusten rajoituksista ja iMessagen vaikutuksesta sosiaaliseen dynamiikkaan.",
      "Beeper on korostettu Android- ja iOS-käyttäjien yhdistävänä viestipalveluna, joka vastaa yhteentoimivuuden vaatimuksiin.",
      "Artikkelissa mainitaan Apple Music, Spotify ja alueelliset viestialustojen mieltymykset.",
      "Keskustelussa käsitellään kilpailuongelmia ja Applen ekosysteemin hallintaa."
    ],
    "points": 234,
    "commentCount": 475,
    "retryCount": 0,
    "time": 1702586221
  },
  {
    "id": 38641211,
    "title": "Ledgerin NPM-tili hakkeroitu, käyttäjiä kehotetaan varovaisuuteen",
    "originLink": "https://github.com/LedgerHQ/connect-kit/issues/29",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38641211",
    "commentBody": "",
    "originSummary": [
      "Kiireellinen asia: npm-paketin @ledgerhq/connect-kit haitallista versiota, joka saattaa vaarantaa käyttäjän tiedot.",
      "Käyttäjiä kehotetaan olemaan liittämättä Ledger-lompakkoa arkistoon, kunnes ongelma on ratkaistu, koska raporttien mukaan käyttäjät ovat menettäneet kolikoita klikattuaan epäilyttävää linkkiä.",
      "@ledgerhq/connect-kit-loaderissa havaittu tietoturva-aukko, joka vaikuttaa jatkojalostushankkeisiin kuten Wagmi ja MetaMask SDK. Ehdotuksia on tehty pull requestin yhdistämiseksi, riippuvuuksien jäädyttämiseksi, kolmansien osapuolten riippuvuuksien tarkastelemiseksi ja resurssien tarkistamiseksi ennen niiden lataamista."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään erilaisia haavoittuvuuksia ja huolenaiheita, jotka liittyvät NPM:ään, GitHubiin, Ledgeriin, Ethereumiin ja kryptovaluutta-alaan yleensä.",
      "Aiheita ovat muun muassa valinnaisen allekirjoitustuen puuttuminen NPM:stä, NPM:n kritisointi siitä, ettei se hyväksy yhteisön tarjoamaa allekirjoitustukea, ja \"integrity\"-kentän puuttuminen package-lock.json-tiedostosta.",
      "Muita käsiteltyjä aiheita ovat PGP-avainten käyttö koodin allekirjoittamiseen, toimitusketjun hyökkäykset, phishing-hyökkäykset, Ledger-laitteiden turvallisuusongelmat, stablecoin-riskit, automaation rooli julkaisuprosesseissa, CDN:ien haavoittuvuudet ja tehostettujen turvatoimien tarve."
    ],
    "points": 234,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1702561361
  },
  {
    "id": 38643369,
    "title": "Lakiehdotus S-210: Lasten suojelu vai Internetin vapauksien loukkaaminen?",
    "originLink": "https://www.michaelgeist.ca/2023/12/the-most-dangerous-canadian-internet-bill-youve-never-heard-of-is-a-step-closer-to-becoming-law/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38643369",
    "commentBody": "",
    "originSummary": [
      "Lakiehdotus S-210, joka tunnetaan myös nimellä \"Protecting Young Persons from Exposure to Pornography Act\" (laki nuorten suojelemisesta pornografialle altistumiselta), on läpäissyt senaatin, ja se on parhaillaan yleisen turvallisuuden valiokunnan tarkasteltavana.",
      "Lakiehdotuksen tavoitteena on suojella lapsia verkossa esiintyviltä haitoilta, mutta sitä on arvosteltu siitä, että se saattaa loukata henkilökohtaisia valintoja ja internetin vapauksia.",
      "Hallitus harkitsee ikävarmennusjärjestelmien käyttöä kasvontunnistusteknologian avulla, mikä on herättänyt huolta yksityisyyden suojasta.",
      "Lakiehdotukseen sisältyy myös säännöksiä verkkosivustojen estämisestä.",
      "Artikkelissa vastustetaan lakiehdotusta ja korostetaan, että on tärkeää suojella lapsia turvautumatta hallituksen tukemaan sensuuriin.",
      "Kommenttiosassa tarkastellaan vaihtoehtoisia ratkaisuja ja verkkosivujen estämisen tai sensuroinnin haasteita verkkoteknologian kehittymisen vuoksi.",
      "Artikkelin on kirjoittanut Michael Geist, joka kertoo huolenaiheistaan lakiehdotuksesta C-11 ja muista aiheista, jotka liittyvät Broadcast and Telecom Legislative Review Panel Report -raporttiin."
    ],
    "commentSummary": [
      "Kanadan Internet-lakiehdotuksen S-210 tarkoituksena on rajoittaa pääsyä seksuaalisesti ilmeiseen sisältöön ja suojella lapsia.",
      "Kriitikot esittävät huolenaiheita demokraattisen vastarinnan puutteesta, yksityisyyden suojasta, sensuurista ja vallan väärinkäytöstä.",
      "Keskustelussa käsitellään muun muassa CSAM:n vastaisten toimenpiteiden lobbaamista, Trudeaun vastaista vetoomusta, ikävarmennusjärjestelmien tehokkuutta, ylisulkemista, vanhempien valvontaa, hallituksen valvontaa, suodatusjärjestelmien rajoituksia, sääntöjen noudattamisen valvontaa, sosiaalisen median vaikutusta nuorten mielenterveyteen sekä vanhempien ohjauksen ja koulutuksen merkitystä."
    ],
    "points": 220,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1702572216
  },
  {
    "id": 38641198,
    "title": "Poliisilaitokset epäonnistuvat avoimuuden ylläpitämisessä kehokameramateriaalin avulla",
    "originLink": "https://www.propublica.org/article/how-police-undermined-promise-body-cameras",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38641198",
    "commentBody": "",
    "originSummary": [
      "Jotkin poliisilaitokset kieltäytyvät julkaisemasta kehokameran kuvamateriaalia, kuten esimerkiksi Miguel Richardsin tapauksessa, jossa New Yorkin poliisi ampui häntä.",
      "Kehon kameroiden tehokkuus rikosoikeusjärjestelmän avoimuuden ja vastuullisuuden edistämisessä on kyseenalaistettu.",
      "Tarvitaan asianmukaista sääntelyä, valvontaa ja vastuuvelvollisuutta, jotta näihin huolenaiheisiin voidaan puuttua ja varmistaa, että poliisien käyttäytymiseen kohdistuu toivottu pelotevaikutus."
    ],
    "commentSummary": [
      "Keskustelun pääaiheena on poliisin kehokamerakuvien käyttö ja saatavuus vastuuvelvollisuutta varten.",
      "Todisteiden salaaminen, kuvamateriaalin luotettavuus ja ylläpito sekä todisteiden tahallinen salaaminen herättävät huolta.",
      "Ehdotuksia ovat muun muassa kuvamateriaalin säännöllinen tarkistaminen, kameroiden asianmukainen huolto ja virkamiesten pitäminen vastuullisina kameroiden käytöstä yleisön kanssa tapahtuvassa vuorovaikutuksessa."
    ],
    "points": 207,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1702561235
  }
]
