[
  {
    "id": 39217149,
    "title": "قوة رسالة التزام Git التفصيلية: توثيق قواعد التعليمات البرمجية وتحسينها",
    "originLink": "https://dhwthompson.com/2019/my-favourite-git-commit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39217149",
    "commentBody": "",
    "originSummary": [
      "يجب أن توفر رسالة التزام Git الجيدة معلومات مفصلة حول المشكلة التي تم إصلاحها ، مما يجعلها قابلة للبحث وقيمة للرجوع إليها في المستقبل.",
      "يجب أن تحكي قصة التحقيق وعملية الحل ، مما يسمح للآخرين بالتعلم منها.",
      "يؤدي تضمين الأوامر المستخدمة في رسالة الالتزام إلى نشر المعرفة بين الفريق وإضافة سياق بشري ، وتعزيز الثقة والتفاهم."
    ],
    "commentSummary": [
      "تعد رسائل الالتزام التفصيلية في Git ضرورية للرجوع إليها والتعاون في المستقبل.",
      "تستكشف المناقشة تحديات فهم تغييرات التعليمات البرمجية وأهمية التوثيق.",
      "تختلف وجهات النظر حول إمكانية الوصول وضرورة رسائل الالتزام المصممة جيدا في سيناريوهات معينة."
    ],
    "points": 610,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1706802375
  },
  {
    "id": 39220528,
    "title": "Cloudflare يحبط هجوم الدولة القومية على خادم Atlassian",
    "originLink": "https://blog.cloudflare.com/thanksgiving-2023-security-incident",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39220528",
    "commentBody": "",
    "originSummary": [
      "اكتشفت Cloudflare ممثل تهديد على خادم Atlassian المستضاف ذاتيا ، ولكن لم تتأثر أي بيانات أو أنظمة للعملاء.",
      "حصل المهاجم على دخول باستخدام بيانات اعتماد مسروقة ووصل إلى الويكي الداخلي وقاعدة بيانات الأخطاء ونظام إدارة شفرة المصدر.",
      "أنهت Cloudflare جميع عمليات الوصول ، وأجرت تحقيقا ، وتعتقد أن الهجوم ربما تم تنظيمه من قبل دولة قومية.",
      "أجرت CrowdStrike تقييما مستقلا يدعم نتائج Cloudflare.",
      "اتخذت Cloudflare خطوات لتعزيز التدابير الأمنية ومؤشرات التسوية المشتركة لمساعدة الآخرين على تحديد ما إذا كانوا قد تأثروا.",
      "تقدم Cloudflare خدمات متنوعة لحماية الشبكات والدفاع ضد الهجمات الإلكترونية."
    ],
    "commentSummary": [
      "تعرضت Cloudflare لحادث أمني في عيد الشكر 2023 واستجابت على الفور لاكتشاف الخرق والاستجابة له والتحقيق فيه."
    ],
    "points": 534,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1706817564
  },
  {
    "id": 39215846,
    "title": "لعنة لينكس الصغيرة 2024: توزيع Linux خفيف الوزن لأجهزة الكمبيوتر منخفضة المواصفات",
    "originLink": "https://www.damnsmalllinux.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39215846",
    "commentBody": "",
    "originSummary": [
      "لعنة Linux الصغيرة 2024 هي توزيعة Linux مدمجة مصممة لأجهزة الكمبيوتر x86 منخفضة المواصفات ، بهدف توسيع فائدة الأجهزة القديمة.",
      "يتضمن مجموعة متنوعة من التطبيقات الصغيرة الحجم ذات التبعيات المنخفضة ، مثل مديري النوافذ ومتصفحات الويب وتطبيقات المكاتب والوسائط المتعددة وأدوات الأدوات المساعدة والألعاب.",
      "استنادا إلى antiX 23 i386 والمبني على دبيان، يعرب DSL 2024 عن امتنانه لدبيان وantiX والمجتمع على دعمهم."
    ],
    "commentSummary": [
      "يركز موضوع المناقشة على لعنة لينكس الصغيرة (DSL) ، وهي توزيعة Linux خفيفة الوزن ، وتغطي العديد من الموضوعات المتعلقة باستخدامها وتوافقها مع الأجهزة والبرامج المختلفة.",
      "يشارك المشاركون تجاربهم في استخدام DSL على الأجهزة الصغيرة ويناقشون مزايا التعلم وتخصيص أنظمة التشغيل.",
      "تستكشف المحادثة أيضا الحنين المرتبط ب DSL ودوره في تعريف المستخدمين بنظام Linux ، بالإضافة إلى نقاش حول التأثير البيئي لإعادة تدوير الأجهزة القديمة مقابل شراء أجهزة جديدة."
    ],
    "points": 376,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1706795268
  },
  {
    "id": 39217310,
    "title": "الباحثون عن الفرص: الوظائف عن بعد والمتدرب والتأشيرة المتاحة - فبراير 2024",
    "originLink": "https://news.ycombinator.com/item?id=39217310",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39217310",
    "commentBody": "",
    "originSummary": [
      "هذا المنشور عبارة عن طلب لقوائم الوظائف في منتدى ، يستهدف على وجه التحديد المرشحين عن بعد أو المتدربين أو التأشيرة.",
      "يتم توضيح إدراج \"في الموقع\" للحالات التي يتعذر فيها العمل عن بعد.",
      "يوفر المنشور مواقع ويب محددة للقراء والباحثين لاستخدامها في بحثهم عن وظيفة ويوجه عدم الشكوى من إعلانات الوظائف."
    ],
    "commentSummary": [
      "تجمع هذه المقالة فرص العمل في صناعة التكنولوجيا من شركات متعددة ، بما في ذلك Rockstar Games و Automattic و Stripe و Lunaris و Dedefine Systems والمزيد.",
      "تشمل الوظائف المتاحة مجموعة واسعة ، من هندسة البرمجيات إلى الأدوار المتعلقة ب الذكاء الاصطناعي.",
      "يسلط المقال الضوء على فرص العمل عن بعد والرواتب التنافسية ، لكن متطلبات وتقنيات الوظيفة المحددة تختلف لكل منصب."
    ],
    "points": 358,
    "commentCount": 331,
    "retryCount": 0,
    "time": 1706803208
  },
  {
    "id": 39225004,
    "title": "جونو: عميل YouTube ل Apple Vision Pro مع ميزات محسنة",
    "originLink": "https://christianselig.com/2024/02/introducing-juno/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39225004",
    "commentBody": "",
    "originSummary": [
      "طور المؤلف عميل YouTube يسمى Juno خصيصا ل Apple Vision Pro.",
      "تمكن Juno المستخدمين من مشاهدة مقاطع فيديو YouTube على visionOS مع ميزات مثل الكشف التلقائي عن نسبة العرض إلى الارتفاع وعناصر التحكم في تشغيل الفيديو الأصلي.",
      "يتيح التطبيق أيضا للمستخدمين عرض التوصيات والاشتراكات ويضمن تضمين الإعلانات من خلال استخدام واجهة برمجة تطبيقات التضمين في YouTube."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة من الموضوعات حول YouTube ، بما في ذلك الشكاوى حول التطبيق الرسمي ، وتأثيرات حظر الإعلانات ، وتطوير تطبيق عارض جديد يسمى Juno.",
      "كما تمت مناقشة عدالة التطبيقات المجانية على أجهزة iPhone ، إلى جانب تطبيقات Reddit البديلة وميزات الأجهزة المختلفة.",
      "تستكشف المحادثة استدامة النماذج الخالية من الإعلانات وتطوير واجهة برمجة تطبيقات Reddit + imgur لتطبيق iOS يسمى VisionOS ، مع تسليط الضوء على الآراء المختلفة حول تجربة المستخدم وتحقيق الدخل وقيود النظام الأساسي."
    ],
    "points": 324,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1706847933
  },
  {
    "id": 39214743,
    "title": "تطوير تطبيق ML-KEM-768 موثوق به لتبادل المفاتيح الآمنة في نظام Go البيئي",
    "originLink": "https://words.filippo.io/dispatches/mlkem768/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39214743",
    "commentBody": "",
    "originSummary": [
      "تمت مناقشة تنفيذ Pure-Go ل ML-KEM-768 ، وهي آلية تبادل مفاتيح ما بعد الكم ، في هذا الملخص.",
      "يعطي التنفيذ الأولوية للصحة وسهولة القراءة والاختبار الشامل لضمان ضمان أمان عالي.",
      "تؤكد المقالة على أهمية سهولة القراءة والمراجعة في حزم التشفير والحاجة إلى الاختبار ضد متجهات الاختبار المختلفة.",
      "تم ذكر الجهود المبذولة لتحسين أنماط البرمجة وحزمة sha3 ، إلى جانب إمكانية استخدام تطبيق ML-KEM لبروتوكول Kyber v3.",
      "يتم شرح عملية توليد الأسرار المشتركة والقضايا المحتملة.",
      "يتم إعطاء شكر وتقدير لمصادر التمويل وعمل مختلف العملاء في مجال التشفير.",
      "تتضمن التحسينات المقترحة استخدام مصفوفة مشفرة بدلا من اشتقاقها من البذور واقتراح ملف تعريف محدد لعمليات نشر معينة."
    ],
    "commentSummary": [],
    "points": 306,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1706785858
  },
  {
    "id": 39223766,
    "title": "عمال التكنولوجيا يدينون التشدق المثير للجدل للرئيس التنفيذي لشركة Y Combinator",
    "originLink": "https://missionlocal.org/2024/01/stupid-shameful-say-tech-workers-of-y-combinator-ceo-garry-tans-rant/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39223766",
    "commentBody": "",
    "originSummary": [
      "يواجه غاري تان ، الرئيس التنفيذي لشركة Y Combinator ، انتقادات من العاملين في مجال التكنولوجيا في سان فرانسيسكو بسبب صخب وسائل التواصل الاجتماعي الذي يغذيه الكحول حيث تمنى الموت للمشرفين التقدميين في سان فرانسيسكو.",
      "يجادل النقاد بأن سلوك تان مخجل وأنه لا ينبغي اعتباره ممثلا لصناعة التكنولوجيا.",
      "يعتقد بعض العاملين في مجال التكنولوجيا أن الحادث مبالغ فيه لأسباب سياسية ، بينما يشكك آخرون في حكم تان.",
      "وقد أدى الحادث إلى تهديدات ضد المشرفين المذكورين في صخب تان.",
      "اعتذر تان لكنه لم يرد على رسائل التهديد.",
      "على الرغم من رد الفعل العنيف ، يتفق بعض الناس مع آراء تان السياسية ويعتقدون أنه يهتم حقا بسان فرانسيسكو ، لكنه قد يفتقر إلى الخبرة في الساحة السياسية."
    ],
    "commentSummary": [
      "واجه الرئيس التنفيذي لشركة Y Combinator غاري تان رد فعل عنيف بسبب تغريدة مسيئة ، مما أثار جدلا ومناقشة مكثفة.",
      "يجادل المؤيدون لنوايا تان ويستشهدون بكلمات توباك شاكور ، بينما يدين آخرون سلوكه.",
      "يسلط الحادث الضوء على المخاوف بشأن السلوك السام ، وقوة الكلمات على وسائل التواصل الاجتماعي ، والتحديات في تفسير الرموز والاقتباسات."
    ],
    "points": 255,
    "commentCount": 244,
    "retryCount": 0,
    "time": 1706836668
  },
  {
    "id": 39218638,
    "title": "مشروع التشغيل المتداخل: تعزيز قابلية التشغيل البيني للويب في عام 2024",
    "originLink": "https://webkit.org/blog/14955/the-web-just-gets-better-with-interop/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39218638",
    "commentBody": "",
    "originSummary": [
      "مشروع Interop هو تعاون بين Apple و Bocoup و Google و Igalia و Microsoft و Mozilla لتعزيز قابلية التشغيل البيني في متصفحات الويب.",
      "يهدف المشروع إلى ضمان التنفيذ المتسق لتقنيات الويب عبر المتصفحات ومعالجة الأخطاء في التقنيات الحالية مع تعزيز قابلية التشغيل البيني للتقنيات الجديدة.",
      "يركز المشروع على مجالات مختلفة مثل إمكانية الوصول وتداخل CSS والخصائص المخصصة والمزيد ، ويتضمن تحديثات وتحسينات على ميزات مثل عناوين URL HTTP (S) في WebSocket API و IndexedDB وتصميم شريط التمرير.",
      "يمكن تتبع تقدم المشروع على لوحة القيادة ، ويتم التأكيد على الالتزام بقابلية التشغيل البيني."
    ],
    "commentSummary": [
      "تم تقديم Interop 2024 ، مما أدى إلى إدخال تحسينات على CSS ووظائف الويب.",
      "تنشأ خلافات بشأن اعتماد ميزات مثل SVG favicons وتطبيقات الويب التقدمية (PWAs) ، مع بعض المتصفحات التي تواجه قيودا.",
      "يتم انتقاد إعطاء Apple الأولوية ل CSS وعدم الاهتمام بطلبات المطورين ، بينما يتم النظر في بروتوكولات بديلة لتطوير ويب أبسط."
    ],
    "points": 243,
    "commentCount": 162,
    "retryCount": 0,
    "time": 1706808813
  },
  {
    "id": 39223982,
    "title": "أجهزة توقف التنفس أثناء النوم التي تم استدعاؤها من Philips مرتبطة ب 561 حالة وفاة: إدارة الغذاء والدواء الأمريكية",
    "originLink": "https://www.cbsnews.com/news/fda-sleep-apnea-philips-recall-cpap/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39223982",
    "commentBody": "",
    "originSummary": [
      "أفادت إدارة الغذاء والدواء الأمريكية (FDA) أنه تم ربط 561 حالة وفاة بأجهزة توقف التنفس أثناء النوم التي تم استدعاؤها من Philips بسبب انهيار الرغوة.",
      "توصلت شركة Philips إلى تسوية تبلغ حوالي 400 مليون دولار مع إدارة الغذاء والدواء ووزارة العدل.",
      "قد يكون مستخدمو الآلات التي تم استدعاؤها مؤهلين للحصول على تعويض، مع تحديد موعد نهائي لتقديم المطالبات في 9 أغسطس 2024."
    ],
    "commentSummary": [
      "أبلغت إدارة الغذاء والدواء الأمريكية عن 561 حالة وفاة مرتبطة بأجهزة توقف التنفس أثناء النوم التي تم استدعاؤها من Philips ، مما أثار مخاوف بشأن التعامل مع الاستدعاء.",
      "يستكشف الأفراد طرقا بديلة لتقليل الأعراض ، بما في ذلك التمارين والعمليات الجراحية والأدوية وطب الأسنان الشامل.",
      "يوجد إحباط تجاه Philips لعدم معالجتها للمشكلات ، والمناقشات جارية بشأن سلامة وفعالية أجهزة CPAP والأجهزة الفموية."
    ],
    "points": 226,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1706838793
  },
  {
    "id": 39217046,
    "title": "بارد يوسع الوصول العالمي مع ميزات Gemini Pro وتوليد الصور",
    "originLink": "https://blog.google/products/bard/google-bard-gemini-pro-image-generation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39217046",
    "commentBody": "",
    "originSummary": [
      "أصدر نموذج اللغة الذكاء الاصطناعي من Google ، Bard ، تحديثات جديدة توفر وظائف محسنة بأكثر من 40 لغة و 230 دولة وإقليم.",
      "يمكن للمستخدمين الآن إنشاء صور واستخدام ميزة Gemini Pro داخل Bard ، مما يوسع قدراتها.",
      "يتم تنفيذ تدابير السلامة لمنع إنشاء محتوى صريح أو مسيء ، مما يجعل Bard أداة الذكاء الاصطناعي أكثر سهولة وتنوعا."
    ],
    "commentSummary": [
      "أصدرت Google تحديثات بما في ذلك Bard و Gemini Pro ، لكن المستخدمين يجدون أن Bard يتخلف عن GPT-4 من OpenAI ، خاصة لمهام الترميز.",
      "يثير النقاد مخاوف بشأن ممارسات الرقابة في Google ويشككون في قدرتها على التنافس مع OpenAI.",
      "تدور المناقشات حول القيود والتحيزات لنماذج الذكاء الاصطناعي المختلفة ، والحاجة إلى لوائح في صناعة الذكاء الاصطناعي ، والإحباطات من محدودية توفر عروض الذكاء الاصطناعي من Google في بلدان معينة."
    ],
    "points": 216,
    "commentCount": 254,
    "retryCount": 0,
    "time": 1706801811
  },
  {
    "id": 39222196,
    "title": "ريفرز كومو: مطور برامج موهوب وقائد Weezer ، نشط على GitHub",
    "originLink": "https://github.com/riverscuomo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39222196",
    "commentBody": "",
    "originSummary": [
      "Riverscuomo هو مطور برامج ماهر في Flutter و Python و Google Apps Script و Flask ، مع ملف تعريف GitHub يعرض خبراتهم.",
      "لديهم متابعون من 2.1k ويرتبطون بفرقة Weezer ، المقيمين في لوس أنجلوس.",
      "يسلط الملف الشخصي الضوء على مستودعاتهم ومشاريعهم وحزمهم ونجومهم ، إلى جانب 1,801 مساهمة تم تقديمها في العام الماضي. هناك أيضا ذكر لخادم Discord ومستودع مثبت لروبوت قاموا بإنشائه."
    ],
    "commentSummary": [
      "ريفرز كومو ، المغني الرئيسي في Weezer ، هو مطور نشط على GitHub ، ويعمل في مشاريع مثل تطبيق Weezify للجوال لبث أغاني Weezer وروبوت Discord لتعليم الترميز.",
      "يؤكد المقطع على استخدام روبوتات الدردشة كمشاريع ترميز للمبتدئين ، مستشهدا بروبوتات Discord كمثال ويسلط الضوء على فوائدها.",
      "يذكر بإيجاز استخدام ميزات الشبكات واللاعبين المتعددين والوسائط المتعددة في البرامج ، والجانب الاجتماعي لمشاركة العمل ، وقيمة بناء مشاريع البرمجيات."
    ],
    "points": 202,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1706825692
  },
  {
    "id": 39221309,
    "title": "التحالف يقاوم ضد الشركة الهندية المزعومة ، Appin Technology ، وسط رد فعل عنيف من الرقابة",
    "originLink": "https://www.wired.com/story/appin-training-centers-lawsuits-censorship/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39221309",
    "commentBody": "",
    "originSummary": [
      "يهدف ائتلاف من المدافعين عن مكافحة الرقابة إلى تسليط الضوء على أنشطة القرصنة المبلغ عنها لشركة Appin Technology الهندية من خلال التهديدات القانونية والدعاوى القضائية لإسكات التقارير.",
      "تتحدى مؤسسة الحدود الإلكترونية (EFF) والمؤسسات الإعلامية هذه التهديدات القانونية وتدافع عن حرية الصحافة.",
      "ترفض وسائل الإعلام الامتثال لجهود الرقابة ، وتعمل مجموعات الحقوق الرقمية بنشاط للكشف عن إجراءات Appin Technology وزيادة الوعي بها."
    ],
    "commentSummary": [
      "تم توجيه اتهامات ضد Appin ، وهي شركة هندية ، بزعم تقديم خدمات القرصنة تحت ستار التدريب على الأمن السيبراني.",
      "تمت إزالة المقال الذي يناقش هذه الاتهامات، مما أدى إلى مزاعم بالرقابة.",
      "ويجري التشكيك في تورط راجات كهاري، صاحب صندوق رأس المال المغامر، إلى جانب التأثير الاقتصادي المحتمل على الهند وقوة المال والمحامين في إسكات المعلومات."
    ],
    "points": 168,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1706820803
  },
  {
    "id": 39219761,
    "title": "CyberChef: أداتك الإلكترونية الكل في واحد",
    "originLink": "https://gchq.github.io/CyberChef/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39219761",
    "commentBody": "",
    "originSummary": [
      "CyberChef هي أداة متعددة الاستخدامات يمكنها إجراء عمليات مختلفة مثل تحويل البيانات والتشفير / فك التشفير والتشفير / فك التشفير ومهام الشبكات.",
      "وهو يدعم خوارزميات وتنسيقات متعددة ويقدم أكثر من 300 عملية ، مما يجعله أداة مفيدة للأمن السيبراني وشركات مكافحة الفيروسات والأكاديميين والأفراد الذين يقومون بتحليل البيانات الرقمية.",
      "يوفر وظيفة السحب والإفلات ، ويمكنه التعامل مع الملفات الكبيرة ، ويسمح للمستخدمين بتحليل البيانات وفك تشفيرها دون الحاجة إلى أدوات معقدة."
    ],
    "commentSummary": [
      "CyberChef هي أداة متعددة الاستخدامات تم تطويرها بواسطة GCHQ للمهام المتعلقة بالإنترنت مثل معالجة النص والتشفير وفك التشفير والعمل مع البيانات الثنائية.",
      "يجد المستخدمون أنه مفيد لأعمال الهندسة العكسية واستخراج المعلومات المهمة.",
      "تقترح المقالة تجربة Easy Data Transform كبديل ل CyberChef ، حيث لم يكن لديها تحديثات أو استجابات حديثة لتقارير الأخطاء وطلبات الميزات."
    ],
    "points": 164,
    "commentCount": 49,
    "retryCount": 0,
    "time": 1706814105
  }
]
