[
  {
    "id": 37642335,
    "title": "Alamme ottaa käyttöön uusia ääni- ja kuvaominaisuuksia ChatGPT:ssä.",
    "originLink": "https://openai.com/blog/chatgpt-can-now-see-hear-and-speak",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37642335",
    "commentBody": "",
    "originSummary": [
      "OpenAI lisää ChatGPT- tekoälyjärjestelmäänsä ääni- ja kuvaominaisuuksia, mikä mahdollistaa interaktiivisemman käyttöliittymän, jossa käyttäjät voivat keskustella kuvista ja käydä äänikeskusteluja.",
      "Näillä ominaisuuksilla on monia sovelluksia, kuten matkakuvista keskusteleminen, ruoka-aineiden tunnistaminen ja matemaattisten ongelmien ratkaiseminen.",
      "Päivitykset tulevat Plus- ja Enterprise-käyttäjien saataville kahden seuraavan viikon aikana, ja ne ovat ääniyhteensopivia sekä iOS- että Android-käyttöjärjestelmissä, ja kuvat ovat yhteensopivia kaikilla alustoilla. OpenAI vastaa näihin uusiin ominaisuuksiin liittyviin huoliin henkilöitymisestä ja yksityisyydestä ja vakuuttaa, että se on ryhtynyt toimiin näiden riskien vähentämiseksi."
    ],
    "commentSummary": [
      "OpenAI:n tavoitteena on parantaa ChatGPT:n ääni- ja kuvaominaisuuksia, mikä perustuu käyttäjien palautteeseen matalan viiveen äänitilauksista ja pyyntöihin nopeammista äänivastauksista ja järjestelmän keskeytettävyydestä.",
      "Huolimatta nopeuteen, tarkkuuteen ja ekologisiin vaikutuksiin liittyvistä huolenaiheista, ChatGPT:n mahdollista käyttöä robotiikan suunnittelussa ja tehtävissä pidetään lupaavana. Tekoälyn tuottaman tiedon luotettavuudesta ja arvosta käydään jatkuvaa keskustelua.",
      "OpenAI aikoo tuoda markkinoille uuden kuvantuotantomallin, DALLE-3:n, keskellä keskusteluja tekoälyn liiketoimintamalleista, vaikutuksesta internetin hakuun ja tekoälyalustan web-selailuominaisuuden vetämisestä pois."
    ],
    "points": 1082,
    "commentCount": 829,
    "retryCount": 0,
    "time": 1695643048
  },
  {
    "id": 37648068,
    "title": "Unityn vanhin yhteisö ilmoittaa lakkauttamisestaan",
    "originLink": "http://farewell.bostonunitygroup.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37648068",
    "commentBody": "",
    "originSummary": [
      "Boston Unity Group (BUG), ensimmäinen virallinen Unity-käyttäjäryhmä maailmanlaajuisesti, on ilmoittanut viimeisestä tapahtumastaan 27. syyskuuta vedoten pettymykseen yhtiön viimeaikaiseen suuntaan ja tuen puutteeseen kehittäjäyhteisöille.",
      "Järjestäjät uskovat, että heidän panoksensa on parempi suunnata mahdollisuuksien luomiseen laajemmassa paikallisessa kehitysyhteisössä.",
      "BUG:n jäsenet voivat liittyä Boston Game Dev -tapaamisryhmään ja jatkaa verkostoitumista muiden alan ammattilaisten kanssa. Viimeinen BUG-kokous on sosiaalinen tapahtuma Zoomissa."
    ],
    "commentSummary": [
      "Unityn pitkäaikainen yhteisö, Boston Unity Group (BUG), on hajonnut Unityn viimeaikaisten hinnoittelumuutosten vuoksi, mikä on merkki luottamuksen menettämisestä yritystä kohtaan.",
      "On käyty laajaa keskustelua siitä, että luottamus moniin tunnettuihin tuotemerkkeihin, kuten Unityyn ja Craftsmaniin, on vähentynyt, koska ne ovat kokeneet kielteisiä liiketoimintatapoja, kuten sensuuria, lyhyen aikavälin voittoihin keskittymistä ja tuotteiden luotettavuuden heikkenemistä.",
      "Avoimen lähdekoodin pelikehitykseen liittyviä ongelmia, kuten Godotin kaltaisten pelimoottoreiden rajoitukset, henkilöstövaihdokset, viestintäpuutteet ja Unityn kyseenalainen tuki riippumattomille kehittäjille, on myös tuotu esiin."
    ],
    "points": 585,
    "commentCount": 364,
    "retryCount": 0,
    "time": 1695665107
  },
  {
    "id": 37646964,
    "title": "Ianin kengännauhasivusto",
    "originLink": "https://www.fieggen.com/shoelace/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37646964",
    "commentBody": "",
    "originSummary": [
      "Ianin kengännauhasivusto tarjoaa yksityiskohtaista tietoa ja resursseja kengännauhoista, mukaan lukien ohjeita kenkien nauhoittamiseen, solmujen solmimiseen ja kengännauhojen rakenteen ymmärtämiseen.",
      "Verkkosivusto tunnetaan \"Ian Knotista\", nopeasta ja turvallisesta kengännauhasolmusta, ja siellä esitellään erilaisia kuvia kengännauhoista.",
      "Se tarjoaa hakutoiminnon helppoa navigointia varten ja päivittää sisältöään säännöllisesti kävijöiden palautteen perusteella, mikä tekee siitä perusteellisen resurssin kaikkiin kengänkenkiin liittyviin tiedusteluihin."
    ],
    "commentSummary": [
      "Ianin kengännauhasivusto saa käyttäjiltä kiitosta siitä, että se esittelee erilaisia kengännauhojen sidontatekniikoita ja solmuja, jotka ovat heidän mielestään opettavaisia ja hyödyllisiä.",
      "Ian Knot, jota mainostetaan nopeimpana kengännauhasolmuna, on kerännyt myönteisiä arvioita, ja käyttäjät ovat myös kertoneet omista suosituimmista sidontamenetelmistään.",
      "Käyttäjät ovat ehdottaneet YouTube-videoiden luomista verkkosivuston sisällön pohjalta, mikä viittaa siihen, että Ian's Shoelace Site voisi laajentua uudelle alustalle."
    ],
    "points": 468,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1695660954
  },
  {
    "id": 37641706,
    "title": "Fantilator-sivu",
    "originLink": "https://onlyfans.web.cern.ch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37641706",
    "commentBody": "",
    "originSummary": [
      "Fantilator on hanke, jossa yhdistetään useita tuulettimia toisiinsa suuremman laitteen kehittämiseksi; sen suunnittelua on ajan mittaan parannettu paksuuden vähentämiseksi ja virransyötön parantamiseksi.",
      "Fantilator-malliin tehdään myöhemmin vaiheittainen päivitys, jossa parannetaan kaapelinhallintaa ja Fanbasea. Tässä vaiheessa se käyttää 64 tuuletinta ja ottaa käyttöön yksittäisen tuulettimen ohjauksen PWM:n (Pulse Width Modulation) avulla Arduinon avulla.",
      "Lopulta Fantilator-projekti onnistui, ja kaikkia tuulettimia ohjattiin Arduinolla, jossa oli erityinen käyttöjärjestelmä, FantilatorOS."
    ],
    "commentSummary": [
      "CERNin verkkosivuille on luotu humoristisesti \"Fantilator Page\" -niminen aladomain, joka on herättänyt keskustelua ja huumoria sivuston kommenttiosastolla.",
      "Käyttäjät ovat jakaneet linkkejä aiheeseen liittyville sivustoille ja keksineet puhaltimia ja ilmanvaihtojärjestelmiä koskevia sanaleikkejä vastauksena tähän vitsi-aladomeeniin.",
      "Reaktiot tähän vitsiin ovat vaihtelevia: jotkut käyttäjät arvostavat huumoria, kun taas toiset kyseenalaistavat sen tarkoituksenmukaisuuden tai sopivuuden."
    ],
    "points": 400,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1695638491
  },
  {
    "id": 37642610,
    "title": "Rytmi 0",
    "originLink": "https://en.wikipedia.org/wiki/Rhythm_0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37642610",
    "commentBody": "",
    "originSummary": [
      "\"Rhythm 0\" oli taiteilija Marina Abramovićin vuonna 1974 toteuttama kuusituntinen performanssi, jossa hän antoi yleisön olla vuorovaikutuksessa hänen kanssaan käyttäen tarjolla olevia esineitä ja testasi yleisön käyttäytymisen laajuutta.",
      "Esityksen edetessä yleisön toiminta kiihtyi lempeästä vuorovaikutuksesta äärimmäiseen väkivaltaan, johon kuului hänen vaatteidensa viiltelyä, kurkun viiltelyä ja uhkailua ladatulla aseella.",
      "Teosta, joka huipentuu Abramovićin nousuun ja yleisön pakenemiseen, pidetään performanssitaiteen historian merkkiteoksena."
    ],
    "commentSummary": [
      "Keskeinen teema pyörii Marina Abramovićin performanssitaiteen \"Rhythm 0\" tulkinnan ympärillä, ja siinä keskustellaan yleisön käyttäytymisen yleistämisestä ja taiteen kyvystä kuvata ihmiskunnan näkökulmia, joihin tiede ei pysty.",
      "Keskusteluissa tarkastellaan myös markkinoinnin ja kontekstin vaikutusta yleisön käyttäytymiseen ja pohditaan esityksen mahdollisia oikeudellisia vaikutuksia, moraalia ja teoksen taustalla olevaa agendaa.",
      "Keskustelussa käsitellään myös kristillistä etiikkaa, taiteen ja lain toisiinsa kietoutuvia rooleja sekä taideteoksen aitoutta ja tehokkuutta ajatusten herättämisessä ja väkivaltaisen käyttäytymisen synnyttämisessä."
    ],
    "points": 363,
    "commentCount": 247,
    "retryCount": 0,
    "time": 1695644784
  },
  {
    "id": 37644047,
    "title": "Minecraft Wiki on haarautunut Fandomista",
    "originLink": "https://minecraft.wiki/w/Minecraft_Wiki:Moving_from_Fandom",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37644047",
    "commentBody": "",
    "originSummary": [
      "Minecraft Wiki on siirtynyt Fandomista uudelle sivustolle, minecraft.wiki, jossa on parannettuja ominaisuuksia, kuten uusi ulkoasu, nopeampi sivulataus, vähemmän mainoksia, paremmat hakuominaisuudet ja anonyymi muokkaus.",
      "Käyttäjiä kehotetaan jakamaan uutisia, käyttämään minecraft.wiki-linkkejä Fandom-linkkien sijaan ja osallistumaan uuden wikin parantamiseen. He voivat myös siirtää Gamepedia/Fandom-tilinsä uudelle sivustolle.",
      "Uutta Minecraft-wikiä isännöi Weird Gloop, ja tällä hetkellä vain englanninkielinen versio on siirtynyt. Muut kuin englanninkieliset versiot voivat mahdollisesti siirtyä tulevaisuudessa."
    ],
    "commentSummary": [
      "Minecraft Wiki, joka oli aiemmin osa Fandomia, on nyt itsenäinen kokonaisuus.",
      "Tämä erottaminen tapahtui 20 tuntia sitten, ja se on herättänyt keskustelua esimerkiksi Hacker News -foorumilla.",
      "Se merkitsee siirtymää tämän resurssin hallinnoinnissa, mikä saattaa vaikuttaa sen rakenteeseen ja sisältöön."
    ],
    "points": 326,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1695651015
  },
  {
    "id": 37649448,
    "title": "DJI Mini 4 Pro",
    "originLink": "https://www.dji.com/mini-4-pro",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37649448",
    "commentBody": "",
    "originSummary": [
      "DJI Mini 4 Pro -kameradroni, kevyt ja edistyksellinen drone, jossa on laadukkaat kuvausominaisuudet ja pitkä akun kesto, tarjoaa ilmaisen pikatoimituksen rajoitetun ajan.",
      "Lennokissa on älykkäitä ominaisuuksia, kuten reittipistelento ja kehittynyt kotiinpaluu-toiminto, ja se tarjoaa useita kuvaustiloja monipuolista valokuvausta ja videokuvausta varten.",
      "Käyttäjille tarjotaan helppoja muokkausominaisuuksia ja heillä on pääsy yhteisöön, josta he voivat saada inspiraatiota ja vinkkejä. Droneen liittyviä lisävarusteita voi ostaa erikseen."
    ],
    "commentSummary": [
      "Keskustelu käsittää DJI:n lennokkeihin liittyviä eri näkökohtia, kuten käyttäjäkokemuksen, huolen niiden kestävyydestä ja geofencingistä sekä sen, että Yhdysvaltain puolustusministeriö on leimannut DJI:n kotimaiseksi turvallisuusuhaksi.",
      "Keskustelussa käsitellään myös kiinalaisten ja länsimaisten lennokkiyritysten välistä kilpailua, DJI:n lennokkien pätevyyttä, vaihtoehtoisia lennokkivaihtoehtoja ja kiistaa DJI:n ohjelmistoista, jotka ovat yhteydessä Kiinan politiikkaan.",
      "Lisäksi käsiteltiin sellaisia aiheita kuin langaton siirtoetäisyys, melutaso, lainmukaisuus, yksityisyys ja DJI:n lennokkien kelpoisuus."
    ],
    "points": 315,
    "commentCount": 346,
    "retryCount": 0,
    "time": 1695670854
  },
  {
    "id": 37645160,
    "title": "Apache Open Office ylläpitämättömänä projektina?",
    "originLink": "https://rocket9labs.com/post/its-time-to-let-go-apache-software-foundation/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37645160",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja antaa yleiskatsauksen Apache Open Officesta, Apache Software Foundationin toimistotuottavuusohjelmistosta, ja korostaa, ettei siihen ole tehty merkittäviä päivityksiä vuoden 2014 jälkeen.",
      "He kyseenalaistavat projektin aktiivisen aseman ja vetoavat lukuisiin ohjelmiston arkistoon tehtyihin kommitointeihin, jotka sisältävät vain välilyöntien muutoksia.",
      "Kirjoittaja kehottaa käyttäjiä ilmaisemaan huolensa Apache Software Foundationille ja ehdottaa linkkiä toiseen, paremmin ylläpidettyyn toimisto-ohjelmistoon."
    ],
    "commentSummary": [
      "Keskeisiä keskustelunaiheita ovat muun muassa käsitys Apache OpenOfficesta alihuollettuna projektina, Apache Software Foundationin rooli ja tehokkuus sekä OpenOfficen ja LibreOfficen vertailu.",
      "Avoimen lähdekoodin ohjelmistojen haasteita korostetaan, kuten avoimen lähdekoodin sitoutumisen ja kannattavuuden tasapainottamista sekä OpenOfficen rakentamisprosessin ja monimutkaisuuden käsittelyä.",
      "Teknologiateollisuuden ikärasismista nousee esiin yleinen teema, jonka taustalla on maininta Mark Zuckerbergin lausunnosta, jonka mukaan hän suosii nuoria työntekijöitä."
    ],
    "points": 303,
    "commentCount": 248,
    "retryCount": 0,
    "time": 1695654746
  },
  {
    "id": 37651171,
    "title": "SR-71 Blackbirdin Astro-Nav-järjestelmä toimi tähtien seuraamisen avulla.",
    "originLink": "https://theaviationgeekclub.com/the-sr-71-blackbird-astro-nav-system-aka-r2-d2-worked-by-tracking-the-stars-and-was-so-powerful-that-it-could-see-the-stars-even-in-daylight/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37651171",
    "commentBody": "",
    "originSummary": [
      "SR-71 Blackbird, kylmän sodan strateginen tiedustelulentokone, käytti Astro-Nav-järjestelmää (tunnetaan nimellä \"R2-D2\"), joka käytti tähtihavaintoja navigointiohjeiden antamiseen.",
      "Astro-Nav-järjestelmän, joka muistutti 1960-luvun GPS-muunnosta, avulla Blackbird pystyi päivittämään inertianavigointijärjestelmänsä ja antamaan kurssineuvoja.",
      "Blackbirdin lentäjät ja tiedustelujärjestelmäupseerit (Reconnaissance Systems Officers, RSO) hallitsivat tätä järjestelmää sekä muuta valvonta- ja puolustustekniikkaa."
    ],
    "commentSummary": [
      "Tekstissä käsitellään useita navigointijärjestelmiin liittyviä näkökohtia, mukaan lukien SR-71 Blackbirdin Astro-Nav-järjestelmän tehokkuus ja taivaallisen navigoinnin yksityiskohdat.",
      "Siinä korostetaan kartoitusohjelmistojen, tutkien ja navigoinnin viitejärjestelmien rajoituksia sekä toisen maailmansodan aikaisen yhteistyön merkitystä ilmailuteknologiassa.",
      "Lisäksi siinä mainitaan tähtiseurantalaitteiden käyttö ja lyhyt huomautus edullisesta suorittimesta ja sovellusmahdollisuuksista Y Combinatorin (YC) Winter 2024 -kiihdyttämöohjelmassa."
    ],
    "points": 275,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1695678462
  },
  {
    "id": 37641583,
    "title": "New Yorkin työnantajien on uuden osavaltiolain mukaan mainittava palkat työpaikkailmoituksissaan",
    "originLink": "https://english.elpais.com/economy-and-business/2023-09-17/new-york-employers-must-include-pay-rates-in-job-ads-under-new-state-law.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37641583",
    "commentBody": "",
    "originSummary": [
      "New Yorkissa hiljattain säädetty laki velvoittaa työnantajat ilmoittamaan palkkatiedot työpaikkailmoituksissa, millä pyritään edistämään palkkojen avoimuutta ja torjumaan ikään, sukupuoleen ja rotuun liittyviä palkkaeroja.",
      "Lakia sovelletaan yrityksiin, joissa on vähintään neljä työntekijää, mukaan lukien etätyöntekijät, jotka raportoivat newyorkilaisille johtajille.",
      "Arvostelijoiden mukaan lainsäädännön noudattaminen saattaa olla vaikeaa pienille työnantajille ja laki aiheuttaa yrityksille ylimääräistä hallinnollista taakkaa. Kaliforniassa ja Coloradossa on voimassa vastaavat palkkojen avoimuutta koskevat lait."
    ],
    "commentSummary": [
      "New Yorkissa hiljattain käyttöön otettu laki velvoittaa työnantajat ilmoittamaan palkkatiedot kaikissa työpaikkailmoituksissa.",
      "Keskusteluissa on esitetty erilaisia näkemyksiä: jotkut kyseenalaistavat lain tehokkuuden ja toiset väittävät, että se voisi auttaa työnhakijoita välttämään alipalkattuja työpaikkoja ja edistää samalla palkkojen vastaavuutta.",
      "Keskustelu ulottuu palkkaluokkien määrittelyyn, jossa otetaan huomioon esimerkiksi ohjelmistosuunnittelijoiden arvo ja suorituskyky, seksismin ja rasismin vaikutus palkkaukseen sekä palkkatietojen julkistamisen edut ja haasteet."
    ],
    "points": 274,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1695637180
  },
  {
    "id": 37644952,
    "title": "KSP2 roskapostittaa Windows-rekisteriä, kunnes peli lakkaa toimimasta",
    "originLink": "https://forum.kerbalspaceprogram.com/topic/219607-ksp2-is-spamming-the-windows-registry-over-weeksmonths-until-the-game-will-stop-working-permanently/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37644952",
    "commentBody": "",
    "originSummary": [
      "Kerbal Space Program 2:n käyttäjät ovat törmänneet bugiin, joka aiheuttaa sen, että peli täyttää Windowsin rekisterin tarpeettomilla tiedoilla, mikä aiheuttaa toimintahäiriön pelissä.",
      "Kehittäjät ovat tietoisia tästä ongelmasta ja testaavat parhaillaan ratkaisua hotfix-julkaisua varten.",
      "Käyttäjien ehdottama väliaikainen ratkaisu on poistaa rekisterimerkinnät, mutta varovaisuutta suositellaan mahdollisten riskien vuoksi. Kehitystiimin kyvykkyyttä ja henkilökohtaisten tietokoneiden turvallisuutta on arvosteltu."
    ],
    "commentSummary": [
      "Keskusteluissa käsitellään erilaisia Kerbal Space Program 2:een (KSP2) liittyviä aiheita, kuten teknisiä ongelmia Windowsin rekisterin kanssa, jotka aiheuttavat peliongelmia, ja kritiikkiä rekisteriä kohtaan konfiguraationhallintajärjestelmänä.",
      "Muita aiheita ovat muun muassa keskustelut KSP2:n kehityksestä ja suorituskyvystä, Take-Two Interactiven yritysostoon liittyvät huolenaiheet, Windows-rekisterin ja Unix-tiedostojärjestelmien vertailu sekä pettymys pelin ominaisuuksiin ja sen kehitystiimiin.",
      "Yleisesti ottaen KSP2:sta ja sen meneillään olevasta kehitysprosessista on esitetty monenlaisia näkemyksiä ja kritiikkiä."
    ],
    "points": 258,
    "commentCount": 272,
    "retryCount": 0,
    "time": 1695654033
  },
  {
    "id": 37642671,
    "title": "E-Ink Dayn aikataulu",
    "originLink": "https://github.com/davidhampgonsalves/life-dashboard",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37642671",
    "commentBody": "",
    "originSummary": [
      "Life-dashboard-hankkeessa käytetään käytettyjä Kindle-laitteita ja hyödynnetään niiden suuria e-ink-näyttöjä, wlan-yhteyttä ja ARM-prosessoreita, jotta niistä saataisiin pienitehoinen heads-up-näyttö jokapäiväiseen elämään.",
      "Projektin toinen versio, joka on kirjoitettu uudelleen kuvien luomiseen ja näyttämiseen liittyvien komplikaatioiden vuoksi, käyttää nyt FBInk:tä kuvien esittämiseen API Gateway/Lambda-taustapalvelusta, ja se voidaan ottaa käyttöön Terraformin avulla. Se sisältää myös ohjeet jailbreakiin, SSH:n määrittämiseen ja riippuvuuksien asentamiseen.",
      "GitHubissa yli 1,1 000 tähteä ja 19 haaraa kerännyt hanke pyrkii pidentämään Kindlen käyttöikää yli 5 vuodella ja hyödyntämään 3D-tulostettuja runkoja, joissa käytetään puulla täytettyä filamenttia."
    ],
    "commentSummary": [
      "Keskusteluissa keskitytään Amazon Kindlen hakkerointiin ja muokkaamiseen, vanhojen e-lukulaitteiden uudelleenkäyttöön ja e-mustekynänäyttöjen käyttöön eri toiminnoissa.",
      "Osallistujat jakavat aktiivisesti kokemuksiaan, antavat neuvoja ja pohtivat e-ink-tekniikan rajoitteita.",
      "On myös mainittu erityisiä tuotteita, kuten \"Invisible Calendar\", ja vaihtoehtoisia vaihtoehtoja, kuten ESP32:n e-ink-näytöt."
    ],
    "points": 256,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1695645067
  },
  {
    "id": 37650040,
    "title": "PostScriptin äkillinen kuolema Sonomassa",
    "originLink": "https://eclecticlight.co/2023/09/25/postscripts-sudden-death-in-sonoma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37650040",
    "commentBody": "",
    "originSummary": [
      "Apple on poistanut tuen PostScript- ja EPS-tiedostoille macOS Sonoma -käyttöjärjestelmästään tietoturvaongelmiin vedoten.",
      "Käyttäjät ovat reagoineet tähän poistoon eri tavoin; jotkut ymmärtävät, että turvallisuuden parantaminen on välttämätöntä, toiset taas ovat nostalgisia ja korostavat PostScriptin merkittävää roolia.",
      "Tämän muutoksen vuoksi käyttäjät tarvitsevat vaihtoehtoisia ohjelmistoja näiden tiedostojen muuntamiseen tai he voivat edelleen käyttää PostScriptiä virtuaalikoneen kautta."
    ],
    "commentSummary": [
      "PostScript, julkaisumuoto, on poistumassa WebKit/Safarista ja Microsoft Officesta siihen liittyvien tietoturvariskien vuoksi. Samanlainen suuntaus on havaittavissa EPS-tiedostojen kohdalla, ja Ghostscript saattaa tulla niiden korvaajaksi.",
      "Apple ottaa etäisyyttä erilaisiin skriptiympäristöihin, kuten Perliin, ja siirtyy Swiftin käyttöön koodipohjassaan, mikä on herättänyt käyttäjien kiihtymystä muutosten vuoksi.",
      "Käyttäjät ovat erittäin turhautuneita Applen päätökseen poistaa PostScript- ja EPS-tuki macOS:stä, mikä on johtanut keskusteluihin mahdollisista vaihtoehdoista ja vaikutuksista käyttökokemukseen."
    ],
    "points": 248,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1695673255
  },
  {
    "id": 37643608,
    "title": "Mikä oli syynä siihen, että Microsoft irtisanoi viime vuonna yli 20 000 työntekijää?",
    "originLink": "https://twitter.com/TeamBlind/status/1706266044871086271",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37643608",
    "commentBody": "",
    "originSummary": [
      "Microsoftin edustaja vahvistaa yhtiön päätöksen irtisanoa yli 20 000 työntekijää viime vuoden aikana ja kertoo, mitkä tekijät vaikuttivat tähän siirtoon.",
      "Tämä päätös johtui osittain COVID-19-pandemian vaikutuksesta, joka vaikutti merkittävästi yhtiön toimintaan ja tulovirtoihin.",
      "Edustaja tarjoaa katsauksen kulissien takaiseen päätöksentekoprosessiin, joka liittyy näihin joukkoirtisanomisiin, ja valottaa sitä, miten suuryritykset selviytyvät tällaisista laajamittaisista muutoksista."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään lukemattomiin aiheisiin, kuten Microsoftin työpaikkojen vähentämiseen, luokkataisteluihin, Twitterin vihapuheeseen, insinöörien viestintätaitoihin, Googlen työllistämispöytäkirjoihin, sijoittajien rooliin ja teknologia-alan ulkoistamiseen.",
      "Keskeiset huolenaiheet, jotka liittyvät työntekijöiden oikeuksiin ja suojaan, tuloeroihin ja työpaikkojen irtisanomisten vaikutuksiin, tuodaan esiin.",
      "Keskustelu korostaa pelkoja varallisuuden uudelleenjaosta, eriarvoisuudesta ja työntekijöiden kohtelusta teknologiateollisuudessa."
    ],
    "points": 210,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1695649110
  },
  {
    "id": 37642538,
    "title": "Kasino taskussasi",
    "originLink": "https://blog.curtii.com/blog/posts/wordscapes-the-casino-in-your-pocket/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37642538",
    "commentBody": "",
    "originSummary": [
      "Blogikirjoituksessa tarkastellaan \"Wordscapesin\" rahaksi muuttamisen taktiikkaa ja keskitytään erityisesti sen minipeliin \"Mt. Fortune\".",
      "Kirjoittaja havaitsi 28 päivän analyysin jälkeen, että pelin esteet (kivet) eivät ole satunnaisia, vaan ne on suunniteltu painostamaan pelaajia käyttämään pelin sisäistä valuuttaa, mikä viittaa siihen, että peli manipuloi oikean rahan saamiseksi.",
      "Erityisesti kaikille ikäryhmille suunnattujen, oikealla rahalla ostamisen mahdollistavien pelien eettisyys herättää huolta tällaisten mahdollisesti hyväksikäyttökäytäntöjen vuoksi."
    ],
    "commentSummary": [
      "Artikkelissa tarkastellaan mobiilikasinopelien haitallisia vaikutuksia ja epäeettisiä käytäntöjä erityisesti nuorempiin käyttäjiin, ja korostetaan tiukempien säännösten ja ikään sopivien verkkokauppojen tarpeellisuutta.",
      "Siinä tuodaan esiin yleisiä kysymyksiä, kuten rahaksi muuttaminen, loot crates (virtuaaliset esineet, joissa on satunnaistettuja palkintoja), sovelluksen sisäiset ostot ja yritysten vastuuvelvollisuus, ja keskustellaan myös todennäköisyyksien manipuloinnista sekä laajamittaisen tietoisuuden ja tiukan sääntelyn kiireellisestä tarpeesta.",
      "Keskustelu laajenee kritisoimaan mobiilipelaamisen laatua ja rahaksi muuttamisen esteitä, Apple Arcaden rajallista valikoimaa ja siihen liittyviä huolenaiheita, kuten NFT:tä (non-fungible tokens) ja nuorille aiheutuvaa taloudellista riskiä."
    ],
    "points": 209,
    "commentCount": 118,
    "retryCount": 0,
    "time": 1695644372
  },
  {
    "id": 37645945,
    "title": "Saint Helenan saaren viestintä",
    "originLink": "http://sainthelenaisland.info/communications.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37645945",
    "commentBody": "",
    "originSummary": [
      "Tiivistelmässä käsitellään viestintää Saint Helenassa ja käsitellään muun muassa posti-, rahti-, puhelin-, Internet- ja sähköpostipalveluja sekä viestintäyrityksiä ja niiden rajoituksia ja korkeita kustannuksia.",
      "Hallituksen aloitteet internetin parantamiseksi, kuten satelliittipalvelujen (Starlink, OneWeb) ja pian tulevan Equiano Cable -kaapelin käyttö, tuodaan esiin, mikä mahdollisesti parantaa saaren verkkopalveluja.",
      "Siinä tuodaan lyhyesti esiin St Helena Radion rooli radioviestinnässä, Suren rajalliset televisiopalvelut ja Maestro Technologiesin sitoutuminen uusiin data- ja ääniverkkoihin. Lisäksi selostetaan St Helenan historiaa lennätinlaitteiden kehittämisessä ja sen yhteyttä Equianon merenalaiseen kaapeliin."
    ],
    "commentSummary": [
      "Pyhän Helenan saari parantaa internet-yhteyksiään asentamalla merenalaisen valokuitukaapelin, jonka ansiosta siitä voi tulla viestintäkeskus.",
      "Saaren hallitus suunnittelee satelliittiyhteysasemien ja uuden pilvialueen perustamista huolimatta huolista, jotka koskevat luotettavia julkisia palveluja ja sijainnin syrjäistä sijaintia.",
      "Keskusteluja käydään Internet-palveluntarjoajan monopolistisesta luonteesta ja hallituksen yksinoikeudellisesta televiestintäsopimuksesta, mutta toimenpiteitä on käynnistetty pienyritysten varustamiseksi valokuitu-internetillä sekä viimeaikaisista Internet-palveluntarjoajien päätöksistä tarjota rajoittamatonta dataa."
    ],
    "points": 207,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1695657344
  },
  {
    "id": 37653831,
    "title": "Costco tarjoaa nyt virtuaalista lääkärinhoitoa 29 dollarilla",
    "originLink": "https://www.cbsnews.com/news/costco-virtual-medical-checkups-for-29/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37653831",
    "commentBody": "",
    "originSummary": [
      "Costco on tehnyt yhteistyötä verkkokauppa Sesamen kanssa tarjotakseen jäsenilleen 29 dollarin hintaan virtuaalisia perusterveydenhuoltopalveluja, kuten virtuaalisia tarkastuksia ja mielenterveyskäyntejä.",
      "Palvelu on suunnattu vakuuttamattomille ja henkilöille, joilla on suuret omavastuut.",
      "Costcon siirto on samansuuntainen kuin muiden suurten vähittäiskauppiaiden, kuten Amazonin ja Walmartin, jotka ovat myös laajentaneet toimintaansa terveydenhuoltopalveluihin."
    ],
    "commentSummary": [
      "Keskustelussa keskitytään useisiin terveydenhuoltoalan tekijöihin, kuten Costcon ja Sesamen kaltaisten kumppanuuksien hyötyihin edullisen sairaanhoidon tarjoamisessa.",
      "Puutteina on käsitelty sairausvakuutuksen riittämättömyyttä, terveydenhuollon hinnoittelun vaikeaselkoisuutta, terveydenhuollon jakamiseen liittyviä haasteita sekä lääketieteellisiin toimenpiteisiin ja koulutukseen liittyviä korkeita kustannuksia.",
      "Terveydenhuollon uudistamiseen ja edullisempiin vaihtoehtoihin vetoaminen on pakottavaa, ja se heijastaa turhautumista Yhdysvaltojen terveydenhuoltojärjestelmään ja tunnustaa muiden järjestelmien, kuten Israelin järjestelmän, tehokkuuden."
    ],
    "points": 187,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1695697645
  },
  {
    "id": 37655477,
    "title": "macOS Containers v0.0.1",
    "originLink": "https://macoscontainers.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37655477",
    "commentBody": "",
    "originSummary": [
      "Uusi versio mahdollistaa macOS-natiivien konttien luomisen, jolloin käyttäjät voivat käyttää macOS:ää macOS:ssä ja rakentaa ja jakaa kuvia Dockerin avulla.",
      "Tämä ohjelmisto voidaan asentaa Homebrew-paketinhallintajärjestelmällä, joka helpottaa ohjelmistojen asentamista macOS:ään.",
      "On tärkeää huomata, että tämä aloite on riippumaton, eli Apple Inc. ei ole hyväksynyt tai tukenut sitä."
    ],
    "commentSummary": [
      "Keskustelu keskittyy macOS-konttien käyttöön ja vaikutuksiin, ja siinä tarkastellaan muun muassa tietoturvaongelmia sekä macOS:n ja Homebrew:n käytön etuja.",
      "Eräs esiin tuotu haaste on Linuxin käyttäminen Apple Siliconilla, mikä osoittaa macOS-säiliöiden käytön tekniset esteet.",
      "Lisäksi painotetaan macOS:n jakeluun konteissa liittyviä teknisiä ja lisensointinäkökohtia sekä prosessiin liittyviä lainsäädännöllisiä esteitä."
    ],
    "points": 180,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1695711705
  },
  {
    "id": 37649594,
    "title": "John Romero kirjastaan \"Doom Guy\" ja pelien kehittämisestä pienessä mittakaavassa",
    "originLink": "https://howtomarketagame.com/2023/09/25/john-romero-on-his-book-doom-guy-and-developing-games-at-a-small-scale/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37649594",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa tarkastellaan syitä indie-pelien epäonnistumisille ja suositellaan aloittamaan pienemmillä projekteilla ennen suurempiin siirtymistä.",
      "John Romero, id Softwaren toinen perustaja, kertoi näkemyksiään suunnittelun tärkeydestä, kurinalaisuudesta pelikehityksessä, taloudellisesta vakaudesta ja varovaisesta rahankäytöstä.",
      "Romero pohtii pelien nopeaa tuotantoa 90-luvulla, korostaa menneistä kokemuksista oppimisen arvoa ja antaa neuvoja aloitteleville kehittäjille."
    ],
    "commentSummary": [
      "Keskusteluketjussa tarkastellaan erilaisia pelinkehitykseen liittyviä kysymyksiä, kuten alan jatkuvasti kehittyvää maisemaa ja kehittäjien kohtaamia esteitä.",
      "Esillä ovat alan tunnetut vaikuttajat John Romero ja John Carmack, ja aiheina ovat muun muassa indie-pelikehityksen menestys, retrotyylisen grafiikan viehätysvoima ja teknologian vaikutus pelinkehitykseen.",
      "Keskustelu sisältää näkemyksiä John Romeron kokemuksista Doomin ja Daikatanan kaltaisten pelien luomisessa sekä hyödyllisiä suosituksia pelinkehitystä käsittelevästä jatkolukemisesta ja dokumenttielokuvista."
    ],
    "points": 173,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1695671403
  },
  {
    "id": 37644506,
    "title": "MDMA ja yhteyden etsiminen hajanaisessa maailmassa",
    "originLink": "https://undark.org/2023/09/22/book-review-the-long-strange-history-of-mdma/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37644506",
    "commentBody": "",
    "originSummary": [
      "\"I Feel Love: MDMA and the Quest for Connection in a Fractured World\" (MDMA ja yhteyden etsintä rikkinäisessä maailmassa), jonka on kirjoittanut Rachel Nuwer, perehtyy MDMA:n historiaan ja mahdollisiin lääkinnällisiin sovelluksiin, lähinnä PTSD:n hoitoon.",
      "Nuwer esittää tasapainoisen näkemyksen, jossa käsitellään sekä MDMA:n hyötyjä että haittoja ja korostetaan sen kykyä kasvattaa yhteyden tunteita.",
      "Kirjassa esitetään, että MDMA voi auttaa lievittämään yksinäisyyden ja yhteydestä irtautumisen tunteita nykymaailmassa, mikä viittaa sen mahdolliseen merkitykseen mielenterveyshoitojen kannalta."
    ],
    "commentSummary": [
      "Hacker Newsin keskustelussa keskitytään MDMA:n (ekstaasin) terapeuttiseen ja virkistyskäyttöön ja korostetaan sen myönteisiä vaikutuksia henkiseen hyvinvointiin ja ihmissuhteisiin, mutta myös mahdollisia kielteisiä vaikutuksia.",
      "Mahdollista riippuvuutta, pitkäaikaisvaikutuksia ja vastuullista käyttöä käsitellään ja MDMA:ta verrataan alkoholiin. Yhteisön tukea ja oikeaa ympäristöä korostetaan MDMA-kokemukseen vaikuttavina tekijöinä.",
      "Keskustelussa syvennytään myös itsehoitoon liittyviin kiistoihin ja lääkeyhtiöiden rooliin mielenterveyshoidossa. Siinä korostetaan, että MDMA:n ja muiden psykedeelisten aineiden terapeuttista potentiaalia on tutkittava lisää."
    ],
    "points": 158,
    "commentCount": 129,
    "retryCount": 0,
    "time": 1695652571
  }
]
