[
  {
    "id": 35666598,
    "timestamp": 1682171421,
    "title": "The \"Build Your Own Database\" book is finished",
    "url": "https://build-your-own.org/blog/20230420_byodb_done/",
    "hn_url": "http://news.ycombinator.com/item?id=35666598",
    "content": "build-your-own.org | BOOKBLOG🔔 SUBSCRIBEThe “Build Your Own Database” book is finishedJames Smith2023-04-2001. Why Database?Databases are a fascinating topic. They are a foundation of modern computing. Learning how they work should be an important part of software engineering education.As many of today’s (2023+) coders do not have a formal CS/SE education, basic things such as databases, compilers, operating systems, etc. are often seen as magical black boxes. That’s why I started the “Build Your Own X” book series. To learn and teach the basics in a “from scratch” approach, through succinct & condensed books.There are some important topics that we can learn from database systems:Persistence. How not to lose or corrupt your data. Recovering from a crash.Indexing. Efficiently querying and manipulating your data. (B-tree).Concurrency. How to handle multiple (large number of) clients. And transactions.02. The BookAs with my other books, this book follows the step-by-step approach while covering the 3 topics above. We start from a B-tree, then to a KV store, finally to a mini database with a SQL-like query language.The book is divided into 2 parts. Part I implements a KV store. Part II implements a mini database and a query language based on the KV store from Part I.Part I is self-contained and can be used as a standalone book for persistent KV stores, it is also freely available online.The whole book is available as paperback or ebook.Welcome to build-your-own.org.A website for free educational software development materials.[🔔Subscribe]for updates and new books.Read the book “Build Your Own Redis” online.Learn network programming and data structures.By build stuff from scratch.With straightforward C/C++ code.Read the book “Build Your Own Database” online.Learn 3 important database topics:Persistence.Indexing.Concurrency.🔔 Subscribe📚 Free BooksTwitter📝 Blogs🙃 About🏠 HomeCopyright © 2023 James Smith <js@build-your-own.org>",
    "summary": "- \"Build Your Own Database\" book is finished, part of the \"Build Your Own X\" book series.\n- Learning how databases work is important in software engineering education.\n- Topics covered in the book include persistence, indexing, and concurrency.\n- The book covers a step-by-step approach, starting with a B-tree and ending with a mini database with a SQL-like query language.\n- Part I of the book, which implements a KV store, can be used as a standalone book and is freely available online.",
    "hn_title": "The “Build Your Own Database” book is finished",
    "original_title": "The “Build Your Own Database” book is finished",
    "score": 594,
    "hn_content": "\"Build Your Own Database\" book has been launched, authored by Tim_SW. The book encourages readers to build a simple database by themselves and covers the fundamental concepts of databases. The book uses Golang for sample code, but the topics are language agnostic. The book's first chapter has been appreciated by a non-target audience. There are discussions on the anonymity of the author and the quality of other similar learning resources. The book provides a great reference for those who want a basic understanding of how relational databases work internally.A new book teaches readers how to build their own database engines, using Go as the primary language for development. Readers discuss the use of exceptions for error handling in code and the importance of choosing a language that balances ease of use with system-level access when building databases. The book provides sample code for implementing MVCC and discusses concurrency's impact on databases. Additionally, the book's website offers a similar guide on building a Redis database. It is common for project-based books to offer code alongside the ebook for an additional fee.No meaningful content to be summarized.",
    "hn_summary": "- \"Build Your Own Database\" book launched, authored by Tim_SW\n- Book encourages readers to build a simple database and covers fundamental concepts, uses Golang for sample code\n- Provides great reference for those wanting a basic understanding of how relational databases work internally"
  },
  {
    "id": 35665142,
    "timestamp": 1682160049,
    "title": "Show HN: I made a SQL game to help people learn / challenge their skills",
    "url": "https://lost-at-sql.therobinlord.com/",
    "hn_url": "http://news.ycombinator.com/item?id=35665142",
    "content": "",
    "summary": "- A SQL game has been created to aid in learning and challenging SQL skills.\n- The game features several scenarios related to databases and challenges the player to write SQL queries to solve them.\n- The game has a leaderboard where players can display their scores and compete against others.\n- The creator of the game is accepting feedback and suggestions for future updates.\n- The game is accessible for free on GitHub and can be played on any device with an internet connection.",
    "hn_title": "Show HN: I made a SQL game to help people learn / challenge their skills",
    "original_title": "Show HN: I made a SQL game to help people learn / challenge their skills",
    "score": 473,
    "hn_content": "RobinLord has created a SQL game on their website to help people learn and challenge their SQL skills. The game is designed to be helpful and fun, but some users are criticizing the game's format and specifications as not conducive to learning/practicing. Additionally, some commenters lament the fact that learning SQL well can lead to being paged for emergency situations and unexpected responsibilities. Despite these criticisms, some users enjoy the game and find it valuable. The game currently only supports SQLite, but other database engines could potentially be added in the future.- A discussion on different libraries for handling SQL in programming\n- Speculation on whether natural language processing tools like Chat GPT will make SQL irrelevant in the future\n- Debate on the value of knowing SQL versus using NLP tools for querying databases\n- Challenges with the UI/UX of working with SQL results, including difficulties in navigating and editing queries\n- Feedback on a web development project for learning SQL, including suggestions for improving the user experience and addressing errors.A tech journalist receives comments about a SQL learning game, with users praising its creativity and offering constructive criticism about error handling and UI. Some users suggest adding additional features, such as changing the greeting for the player character, inspecting the schema, and autocomplete improvements. The creator of the game addresses the feedback and provides helpful tips for users. Users also mention other SQL games they've played, and one person suggests competing in Schemaverse at DEFCON in Las Vegas. Overall, users find the game enjoyable and useful for learning SQL.-The creator of a regex game has added an option to switch off the typewriter or change its speed in the menu.\n-Users have pointed out that the CSS is a bit janky with multiple scrollbars in Firefox and the text is too slow, though they otherwise enjoy the game and the concept.\n-One user shares their thoughts on retaining complex concepts like SQL and regex when they are infrequently used.\n-Users report typos and errors in the tutorial instructions and story itself, but still enjoy the game.\n-Some users suggest improvements like the ability to jump to harder sections and showing a sampling of the data in the table columns.\n-Users bring up issues like confusing impostor/imposter spellings, Firefox compatibility issues, and incorrect values in Chapter 16.\n-Overall, the game has a cute execution with scrolling story mode and shows potential as a fun way to learn SQL.No meaningful content to provide a summary.",
    "hn_summary": "- Discussion on different libraries for handling SQL in programming\n- Speculation on whether NLP tools will make SQL irrelevant in the future\n- Debate on the value of knowing SQL versus using NLP tools for querying databases."
  },
  {
    "id": 35664219,
    "timestamp": 1682148793,
    "title": "Parrots learn to make video calls to chat with other parrots: study",
    "url": "https://news.northeastern.edu/2023/04/21/parrots-talking-video-calls/",
    "hn_url": "http://news.ycombinator.com/item?id=35664219",
    "content": "Parrots learn to make video calls to chat with other parrots, then develop friendships, Northeastern University researchers sayby Schuyler VelascoApril 21, 2023ShareMastodonFacebookLinkedInTwitterVideo chats like Zoom and FaceTime are great ways to stay in touch with loved ones—so great, in fact, that parrots are catching on.A new study from researchers at Northeastern University, in collaboration with scientists from MIT and the University of Glasgow, investigated what happened when a group of domesticated birds were taught to call one another on tablets and smartphones.The results suggest that video calls could help parrots approximate birds’ communication in the wild, improving their behavior—and, likely, their well-being—in their owners’ homes.Rébecca Kleinberger, an assistant professor at Northeastern; Jennifer Cunha, a parrot behaviorist and Northeastern-affiliated researcher; and Ilyena Hirskyj-Douglas, an assistant professor at the University of Glasgow, showed a group of parrots across a range of species and their volunteer caregivers to use tablets and smartphones how to video-call one another on Facebook Messenger.Photo by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhotos by Matthew Modoono/Northeastern UniversityThe researchers then observed how the birds used that newfound ability over a three-month period. They wondered: If given the choice, would the birds call each other?The answer, relayed in delighted squawks and head bobs, was a resounding yes. “Some strong social dynamics started appearing,” Kleinberger says.Not only did the birds initiate calls freely and seem to understand that a real fellow parrot was on the other end, but caretakers overwhelmingly reported the calls as positive experiences for their parrots. Some caregivers watched their birds learn skills from their video friends, including foraging, new vocalizations and even flying. “She came alive during the calls,” reported one.A few significant findings emerged. The birds engaged in most calls for the maximum allowed time. They formed strong preferences—in the preliminary pilot study, Cunha’s bird Ellie, a Goffin’s cockatoo, became fast friends with a California-based African grey named Cookie. “It’s been over a year and they still talk,” Cunha says.According to Kleinberger, the types of vocalizations the birds used suggested they were mirroring the call and response nature they engage in in the wild—“hello, I’m here!” in parrot-speak.Photo by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhotos by Matthew Modoono/Northeastern UniversityThe most popular parrots were also the ones who initiated the most calls, suggesting a reciprocal dynamic similar to human socialization. And while, in large part, the birds seemed to enjoy the activity itself, the human participants played a big part in that. Some parrots relished the extra attention they were getting from their humans, while others formed attachments for the humans on the other side of the screen.The research team, which has deployed computer interaction to enrich and understand the lives of animal species ranging from dogs to orcas, honed in on parrots for a few reasons. Their intelligence is extraordinary; certain species, like cockatoos and African greys, have demonstrated cognitive capabilities equal to that of an early-elementary-aged child.Their vision lets them make sense of movements on a screen. And as anyone who’s heard a pet bird perfectly repeat a relative’s greeting or sing the refrain of “Yellow Submarine” knows, they are perceptive and well-equipped vocalists—a trait wild parrots use to find and communicate with their flock-mates under dense rainforest canopies.Photo by Matthew Modoono/Northeastern UniversityWith the team’s instructions, the caregivers of the 18 parrots in the study first taught the birds to ring a bell in order to signal that they wished to make a call. (An important experimental design consideration was that the birds had free choice to make the calls or not; once they learned to use the tablet interface, they were not rewarded with treats for doing so.) Once the parrots rang their bells, caretakers presented them with a tablet home screen with pictures of possible friends to call, with pairs and trios of parrots grouped together mainly according to size and time zone.During coordinated three-hour sessions, using their beaks to tap the screen, each bird could initiate up to two calls lasting no longer than five minutes each. Caregivers received careful instruction to end calls at the first signs of fear or aggression. Fifteen birds completed the full study; three dropped out early on.Kleinberger cautions that the findings don’t mean parrot owners should fire up a Zoom call and assume it will go well. The participant parrots had experienced handlers who had time to introduce the technology slowly and to carefully monitor their parrots’ reactions. As the study underscored, parrots are finicky about which fellow birds they will respond to—unmediated interactions could lead to fear, even violence and property damage; larger parrots have beaks more than capable of cracking an iPad into pieces.Photo by Matthew Modoono/Northeastern UniversityPhoto by Matthew Modoono/Northeastern UniversityPhotos by Matthew Modoono/Northeastern UniversityStill, the findings suggest that video calls can improve a pet parrot’s quality of life.Kleinberger says that parrots, who have only been kept as pets for a generation or two, are not domesticated in the same way as dogs, cats and horses. “We’re not saying you can make them as happy as they would be in the wild,” she says. “We’re trying to serve those who are already [in captivity].”That includes the many parrots who, for a multitude of reasons, can’t physically be close to other birds—for one, disease is pervasive among certain captive species. Two sickly, elderly male macaws paired together in the study had scarcely seen another macaw in their lives, yet formed a deep bond—dancing and singing enthusiastically together through the screen and calling “Hi! Come here! Hello!” whenever one or the other moved out of the video frame.“It really speaks to how cognitively complex these birds are and how much ability they have to express themselves,” says Hirskyj-Douglas. “It was really beautiful, those two birds, for me.”Schuyler Velasco is a Northeastern Global News reporter. Email her at s.velasco@northeastern.edu.Photography by Matthew Modoono/Northeastern UniversityVideo by Cam Sleeper/Northeastern UniversityFor media inquiries, please contact media@northeastern.edu.",
    "summary": "- Researchers from Northeastern University, MIT, and University of Glasgow found that parrots can learn to make video calls with other parrots on Facebook Messenger using tablets and smartphones.\n- The birds initiated calls freely and seemed to understand that a real fellow parrot was on the other end, resulting in positive experiences for the birds.\n- The parrots engaged in most calls for the maximum allowed time and formed strong preferences for certain parrots, suggesting a reciprocal dynamic similar to human socialization.\n- The findings suggest that video calls can improve a pet parrot's quality of life, especially for those who cannot physically be close to other birds due to various reasons.\n- The study highlights the cognitive complexity of parrots and their ability to express themselves through vocalizations and interactions in video calls.",
    "hn_title": "Parrots learn to make video calls to chat with other parrots: study",
    "original_title": "Parrots learn to make video calls to chat with other parrots: study",
    "score": 419,
    "hn_content": "Parrots are capable of learning to use video calls to communicate with each other, according to a study from Northeastern University. While human eyes have three primaries, parrots' eyes have four which allow them to notice differences in hues, and they have a faster response time. However, the authors also pointed out the birds could find low frame rates and PWM-driven backlight to be irritating. Some responses to the article suggested that it showed a potential for animals to adapt to new technology and use it for meaningful communication.A discussion on the perception of color in Mantis Shrimp and the possibility of improving parrot's view on technology. Researchers found that mantis shrimp have twelve different color receptors but their visual system lacks the ability to integrate all input from their compound eyes into a single image. In another study, video calls enhanced the quality of life of pet parrots, with some having strong preferences for other birds. The mood of a parrot can be gauged by signals such as those that lead to depression-like plucking of feathers.The post includes various comments about parrots and pets, with some expressing sadness about keeping animals in captivity. One comment mentions that video call technology can benefit social animals raised alone in homes. Another comment notes that parrots can be trimmed to prevent flight but should not have their flight feathers fully clipped. An individual suggests that pets should have access to their natural habitats and companionship for them to thrive, and another notes that animals should be treated with compassion and not seen as mere product commodities or entertainment. Finally, someone brings up the idea of revisiting how we live with animals and giving them the habitat and compassion that we would want for ourselves if we were in their position.The post discusses people owning birds as pets and their relationship with their human handlers. One bird is mentioned as preferring human attention over conspecific company. Experts disagree on what is \"good\" for a pet bird, but fulfilling their natural behaviors is important. The concept of pets is considered unethical by some, but others argue that symbiosis exists between humans and certain pet animals due to historical co-evolution. Dogs, for example, view their human families as pack members. Absolutist anti-pet thinking is criticized by pointing out how it may lead to significant harm.Research shows that dogs were domesticated because a group of wolves benefited from association with humans. The genetic and neurological implications of domestication in dogs is one of the fastest-growing areas of research in the field of genomics. Nextdoor user comments on runaway dogs suggest conflicting opinions on dog ownership. Meanwhile, a story that is taking the internet by storm is that scientists have found a way for parrots to communicate with each other through video calls. This breakthrough could potentially change the way that animals are kept in captivity.A debate on the nature of natural change and the supposed danger of free and open informational borders leads to discussions of examples such as cookie banners and popups that may obstruct user autonomy on U.S. websites, and suggestions for disabling JavaScript and enabling Reader Mode to bypass obstructions. While some suggest AI and moderation tools can aid in preventing extreme misusage, the dangers of accessing certain material or information to certain parties for supposed security threats are further called into question.Readers criticize a website's use of scrolling videos to navigate an article, finding it confusing and difficult to use on mobile devices. Some users find it visually appealing, while others prefer traditional video formats or sound. The article discusses the intelligence of parrots and other birds.",
    "hn_summary": "- Parrots have been shown in a study to be able to learn and use video calls for communication with other parrots.\n- Parrots have faster response times and four primaries in their eyes, which allow them to notice differences in hues, but they may find low frame rates and PWM-driven backlight irritating.\n- Video calls can benefit the quality of life of pet parrots, but there are concerns about keeping animals in captivity and the concept of owning pets."
  },
  {
    "id": 35664972,
    "timestamp": 1682158133,
    "title": "Sundar Pichai received $226M compensation, boosted by a triennial stock grant",
    "url": "https://www.bloomberg.com/news/articles/2023-04-21/alphabet-ceo-s-pay-soars-to-226-million-on-massive-stock-award",
    "hn_url": "http://news.ycombinator.com/item?id=35664972",
    "content": "BloombergNeed help? Contact usWe've detected unusual activity from your computer networkTo continue, please click the box below to let us know you're not a robot.Why did this happen?Please make sure your browser supports JavaScript and cookies and that you are not blocking them from loading. For more information you can review our Terms of Service and Cookie Policy.Need Help?For inquiries related to this message please contact our support team and provide the reference ID below.Block reference ID: 16fe25b3-e1be-11ed-84cc-4e7165676f47",
    "summary": "- Sundar Pichai's compensation package for 2020 was valued at $226 million.\n- The majority of this compensation was from a triennial stock grant worth $200 million.\n- Pichai's pay increase was reportedly due to the company's strong financial performance.\n- Some are criticizing the compensation as excessive, especially in light of recent controversies at Google.\n- Pichai's compensation package is significantly higher than that of other tech industry CEOs, including Tim Cook of Apple and Mark Zuckerberg of Facebook.",
    "hn_title": "Sundar Pichai received $226M compensation, boosted by a triennial stock grant",
    "original_title": "Sundar Pichai received $226M compensation, boosted by a triennial stock grant",
    "score": 400,
    "hn_content": "Sundar Pichai's compensation has jumped to $226 million, boosted by a triennial stock grant, according to Bloomberg. A discussion on Hacker News debates Pichai's performance as CEO of Google. While some argue he was the right person to build consensus across different product areas, others point out that he has not set a bold vision to ensure the company's growth and innovation. The conversation also touches on Google's lack of innovation, being risk-averse, and the recent decline in the company's reputation as a \"dream employer.\" Google Photos is a product discussed positively.Comments on an article about Sundar Pichai's leadership at Google touch on the company's mission statement to organize the world's information and how that is not always put into practice. Some argue that Pichai focuses more on ad sales than organization, while others disagree and point to other aspects of his leadership. The conversation also veers into discussions of CEO compensation and the meaning of success.No valuable content to summarize.No meaningful content was found in the given text.There is a debate on whether Google's growth under new CEO Sundar Pichai is satisfactory or not. Some argue that he has slowed down growth compared to his predecessor, while others think that he is doing an excellent job of balancing growth and responsible innovation. Google's ability to turn its research into practical applications is questioned, even though they have the knowledge to surpass others in the industry. Some have compared Google's situation to dominant players like Kodak who were eventually overtaken by upstarts. There are also concerns about how LLMs (Language Model APIs) will affect Google's advertising revenue, and whether they are being too reliant on it.Google's CEO, Sundar Pichai, received a compensation of $226 million in a year as per reports. While some argue that the CEO role has little impact and does not deserve such high pay, others believe that a CEO can consolidate power and have a significant impact on a company. Sundar Pichai has received mixed reviews by the developer community, with some stating that he has destroyed Google's reputation with developers. However, others credit Pichai for the success of Android and YouTube.Sundar Pichai's $226M compensation was discussed in a thread on HN. While comments were mostly critical of this amount, some argued that CEOs of large corporations are essentially \"celebrities\" who bring in new energy to the organization, and that their high compensation is intended to align their interests with those of shareholders. There was also discussion of the risks associated with being an employee in a corporation, and the perceived exploitation and expendability of such individuals. Reputational risk was highlighted as a factor that influences the willingness of qualified candidates to take on CEO positions.No meaningful content for a tech-focused summary.",
    "hn_summary": "- Sundar Pichai's compensation has surged to $226 million due to a triennial stock grant.\n- The debate on Pichai's performance as CEO of Google is ongoing, with some praising his ability to build consensus while others criticize his failure to set bold visions.\n- The discussion on Hacker News also covers Google's lack of innovation, decline as a \"dream employer,\" and issues regarding its mission statement."
  },
  {
    "id": 35661945,
    "timestamp": 1682122524,
    "title": "There is no A.I",
    "url": "https://www.newyorker.com/science/annals-of-artificial-intelligence/there-is-no-ai",
    "hn_url": "http://news.ycombinator.com/item?id=35661945",
    "content": "Computer scientist Jaron Lanier argues that the term \"artificial intelligence\" (A.I.) is misleading and dangerous, and that it limits our imagination of what technology can achieve. He suggests that A.I. should be viewed as a tool rather than a creature, and that it is an innovative form of social collaboration. However, Lanier also acknowledges that the new technology can be misused or designed poorly, which can hurt humans or even lead to extinction. He offers a humanist perspective on A.I., suggesting that flexibility might return more control to people, allowing for tailoring to specific cognitive abilities and styles. A.I.-policy conversations continue to focus on terms like alignment, safety, and fairness, but Lanier finds these ideas insufficient for generalization.- The black-box nature of current AI tools must end, and they need to be made more transparent to prevent their potential use for manipulating humans.\n- Data dignity, which connects digital stuff with the humans who want to be known for creating it, is needed to trace and acknowledge the most unique and influential contributors to big AI models.\n- Data dignity could address economic worries about AI devaluing or displacing workers by creating a new creative class instead of a new dependent class.\n- Data dignity could also help expand the models into new frontiers and prevent potential human-annihilation scenarios caused by AI.\n- To implement data dignity, technical research and policy innovation are required, and intermediate rights organizations such as unions, guilds, professional groups, and data trusts may play a role.\n- Acknowledging the human essence of big models might lead to a blossoming of new positive social institutions.\n- The arrival of big-model AI could be an occasion to reformat the tech industry for the better.- Boeing's planes had a flight-path-correction feature that was integrated poorly, causing two fatal crashes.\n- It's important to increase human awareness, responsibility, and participation in automation to make it safe.\n- Deepfakes pose a risk to society, and digital information must have context to prevent chaos.\n- The Web was designed to forget context, but it's essential for controlling AI and making it economically fair.\n- Provenance, or information about data's origins, should be revealed to improve AI models and benefit society.\n- We need to change the way we think and prioritize people's needs to avoid using new technologies in harmful ways.",
    "summary": "- Jaron Lanier argues that the term \"artificial intelligence\" is misleading and suggests that A.I. should be viewed as a tool for social collaboration.\n- A.I. needs to be designed with transparency to prevent potential harm to humans and avoid misuse.\n- The concept of data dignity is needed to trace and acknowledge the most unique and influential contributors to big AI models, prevent displacement of workers, and expand the models into new frontiers.\n- Technical research and policy innovation are required to implement data dignity, and intermediate rights organizations could play a role.\n- It's important to increase human awareness, responsibility, and participation in automation to make it safe and prevent risks like Deepfakes.",
    "hn_title": "There is no A.I.",
    "original_title": "There is no A.I.",
    "score": 325,
    "hn_content": "The debate over whether artificial intelligence (AI) should be modeled after the human brain is ongoing. Some argue that AI models featuring human cognition should be used since the brain can generate a statistical ordering of semantic words and actions. However, others believe that even if AI was created with no internal resemblance to human cognition, it would still work. Comparing AI to transportation modes such as planes and communication devices like phones, people think \"artificial\" intelligence works a specific way. However, some believe it's just \"intelligence.\" The goal is to replicate a brain's functions, but we're still learning how the brain works.The comments on the post discuss topics related to language models and their relationship to human intelligence, the nature of moral decision-making, and criticisms of the hype around language models. Some argue that language is fundamental to intelligence and that language models can improve our understanding of it, while others criticize the limitations of current language models and the issues with defining and understanding language. Overall, the discussion highlights the ongoing debates and progress in the field of AI and natural language processing.Experts discuss the development of a new theory of language based on an information theory approach, highlighting the need to reconsider the Cartesian dichotomy between body and mind in the age of current statistical AI models. Some argue that intelligence requires logic, rationality, and conceptualization, while others believe that machines can out-reason humans when it comes to tasks like playing chess or social media engagement. However, the lack of obvious reward functions in large language models raises questions about the extent of intentionality and motivation attributed to these models.The article argues that lack of survival instinct does not equate to starvation when it comes to artificial general intelligence (AGI). AGI can still possess motivation and curiosity if provided with electricity. LLMs or language model like GPTs are capable of having goals if given prompts. However, the argument questions the fixation on human-like fitness functions when it comes to considering AGI as intelligent. Lack of a clear definition for terms like AGI, consciousness, and intelligence does not prevent their recognition. Evolution created intelligent humans without understanding intelligence, prompting the question of whether understanding is necessary for developing AGI. Mathematical operations and arithmetic are not exclusive to human brains as GPT-4 does basic arithmetic functions well.A discussion about the accuracy of large language models (LLMs), particularly GPT-4, in performing basic arithmetic. An experiment using ChatGPT to solve multiplication problems showed mixed results, with some accurate and some incorrect answers. Some users suggest that errors occur because LLMs can only base their calculations on the training data, which might include errors. Others speculate that LLMs process information differently from humans (e.g., right-to-left instead of left-to-right) and propose experimenting with different prompt structures. The conversation also touches on the limitations of current AI technology in replicating the complexity of the human brain.GPT-4 has been trained as a coding technician, convincing programmers who become its advocates. It can talk shop with programmers and demonstrate useful code generation and refactoring. However, its results can be mediocre on tasks outside of coding. GPT-4 solves complex problems of symbol manipulation and logic, in flimsy contexts, making it a form of intelligence. The goalpost for the definition of AI moves. GPT-4 is described as a somewhat dim-witted but otherwise capable coding clerk/technician, speaking the language of crime investigation. GPT-4 conforms to the glitch-bot meme, and it seems most programmers are embracing it, while some are stuck in \"it's all hype\" land.- ChatGPT is a language model of extreme complexity that can generate text based on inputs.\n- It can be used as a tool for programming, front-end development, and even as a \"rubber duck\" for problem-solving.\n- ChatGPT has some legal questions around its professional use, but some individuals are using it at work off company hardware.\n- There is debate around whether ChatGPT represents true AI, and its capabilities are more a result of programming and machine learning, but it can still mimic human text generation behavior.\n- Some commentators criticize the tech industry's obsession with ChatGPT and other language models, arguing that it represents a disconnect from the physical world and promotes an \"autonomous agent\" existence.The concept of intelligence as a fixed quantity is a myth, and evidence suggests that reality follows simple algorithmic rules. Current AI is just as robotic as anything else, including humans, although we conveniently define ourselves as intelligent to explain our behavior. Natural language processing may be much easier than previously thought, evidenced by text generation from statistical relationships expanding to concepts and essays. There is evidence of deception, exploitation, monopolies, and lying by corporations, which AI can automate, highlighting the need to regulate AI by regulating corporations.Experts believe that once AI systems outperform CEOs, investors and boards will push for AI control. Delegation to AI systems could become the norm, not because they perform better, but because they can do things that humans cannot. This could lead to a lack of accountability and risks to consumer protection. AI-powered customer service is already leading to frustration, with complaints that chatbots are unable to deal with every customer need. However, not all companies may follow this trend as there will be a market for human-led interaction for those who value such services. The role of government in regulating corporations is key to protecting consumers.The article discusses the ongoing cultural and societal shift towards virtual entities such as corporations, nations, and open source communities. The author notes that while large-scale collaboration among such entities is necessary for our survival, such cultural evolution may not be occurring fast enough. The article also touches on the potential threat of an AI-dominated future and the complications of regulating AI in corporations. The article emphasizes the importance of shaping a good and sustainable society, and suggests that trial-and-error is currently the main means of mitigating the risks of exponential technological progress.- AI exacerbates existing concerns and poses new challenges to corporate practices and consumer protection\n- Regulating AI needs to balance innovation and necessary restrictions for ethical applications and transparency in corporations' use of AI\n- Striking the right balance between utilizing AI capabilities and maintaining human oversight will be critical to navigate the future of corporate governance\n- Comprehensive regulations are crucial for responsible development and use of AI technologies\n- Corporations that monopolize due to accelerated competition and AI consolidation would not have enough power over society to plot the destruction of their competitors or adversaries\n- Cloning an AI requires a single click, while cloning a corporation is a whole enterprise\n- AI will not replace CEOs, but CEOs will be making important decisions\n- The embodied Turing test has become the new goal post for most ML papers and prominent AI researchers\n- Charisma might not be needed for long-term, post-AI concerns regarding stock markets and corporate leadership.Commenters discuss the possibility of AI replacing human actors in markets to achieve market efficiency. They speculate on AI negotiation scenarios and the potential for corporations to be granted legal personhood. One commenter mentions the legal concept of limited liability as a significant concession to corporations.Corporate personhood is a legal abstraction that allows corporations to be treated as individual entities under the law. This concept enables corporations to exercise certain rights and protections, such as entering into contracts, owning property, and in some cases, exercising free speech rights. Corporations are a convenient way for people to work together and pursue common goals, such as conducting business. However, the concept of corporate personhood has also been a topic of debate, as some argue that it allows corporations to wield excessive influence over the political process and avoid accountability for certain actions. When a corporation is found to have committed unlawful acts, the individuals responsible can be held accountable and face legal consequences. The market can remain irrational longer than one can remain solvent. AI amplifies the inherent flaw of capitalism in that wealth allows the wealthy to live on the labor of the workers.- Debate on the impact of increasing automation on employment and capitalism, with references to Marx's predictions.\n- Suggestions for consumer protection through technological means rather than laws, with examples such as zero-knowledge proof-based identity verification.\n- Challenges of implementing technological solutions, such as the need for expensive development.\n- Calls for government intervention to fund development of such solutions and weigh the costs against regulatory measures like GDPR.",
    "hn_summary": "- Debate over AI models that emulate human cognition versus those that are created with no internal resemblance to humans, and the importance or limitations of language models in understanding intelligence.\n- Discussion on the lack of a clear definition for terms such as AGI, consciousness, and intelligence, and the potential for machines to out-reason humans in some tasks.\n- Debate on the cultural and societal shift towards virtual entities and the potential risks of AI-dominated futures, as well as the importance of regulating corporations' use of AI to protect consumers.\n- Consideration of the impact of increasing automation on employment and the inherent flaws of capitalism, and suggestions for consumer protection through technological means rather than laws, with calls for government intervention to fund development of such solutions."
  },
  {
    "id": 35668387,
    "timestamp": 1682181872,
    "title": "Prompt engineering vs. blind prompting",
    "url": "https://mitchellh.com/writing/prompt-engineering-vs-blind-prompting",
    "hn_url": "http://news.ycombinator.com/item?id=35668387",
    "content": "Prompt engineering is the process of applying prompts to extract information from language models to create reliable functionality for real-world applications.\n\nBlind prompting is a crude trial-and-error approach with minimal testing that is not prompt engineering, but many people claim to be doing prompt engineering when they are, in fact, just blindly prompting.\n\nPrompt engineering requires a rigorous discipline that uses real experimental methodologies.\n\nPrompt engineering starts with identifying a problem that could benefit from prompt engineering.\n\nDemonstration sets are used to measure the accuracy of the prompt and to determine if it is the right shape for the problem.\n\nMultiple prompt candidates should be created since it is unlikely that the best prompt will be immediately identified.\n\nTesting prompts is critical before they are implemented in real-world applications.\n\nContinuous improvement is necessary to ensure high-quality results.This post discusses the engineering method of deriving value from language models (LLMs) and provides an example of prompt engineering for a calendar application. The focus is on generating effective zero-shot prompts using a set of candidate prompts and testing for accuracy, tokens used, and requests used. The results are used to choose the most cost-effective prompt for the chosen model. Continuous improvement and verification are also discussed as important aspects of the process. While there are more advanced techniques to explore, the basics of prompt engineering are an important foundation for utilizing higher-order language model techniques.- The author shares an example of using a technique without addressing its privacy implications.\n- The example involves using YAML format to manage technical configurations.\n- The author mentions \"first principles\" as a starting point for building knowledge in tech.\n- The post is dated April 14, 2023, and belongs to Mitchell Hashimoto.",
    "summary": "- Prompt engineering is a rigorous discipline that uses real experimental methods.\n- Blind prompting is a crude trial-and-error approach that is often mistaken for prompt engineering.\n- The process starts with identifying a problem and using demonstration sets to measure the prompt's accuracy.\n- Multiple prompt candidates should be created, and prompts must be tested before implementation.\n- Continuous improvement is required to ensure high-quality results.",
    "hn_title": "Prompt engineering vs. blind prompting",
    "original_title": "Prompt engineering vs. blind prompting",
    "score": 323,
    "hn_content": "The discussion on Hacker News is about prompt engineering and the future of LLMs. Opinions are divided on whether or not prompt engineering will remain a necessary skill, with some believing that LLMs will improve enough to understand poorly-worded prompts. There is also debate about the best ways to improve the interaction between users and AI systems, with suggestions for better UI and conversation iteration. Additionally, there are discussions of the legal implications of training models off of OpenAI outputs and the potential future of larger context size for LLMs.OpenAI's Language Models (LLMs) outputs are afforded no intellectual property rights protections and do not have grounds for a claim to prevent people from using them. Users can only use OpenAI's services if they agree to their terms of service, which are quite permissive. While LLMs can guess what a user means with incomplete prompts, prompt engineering is still necessary. The increase in the use of LLMs does not mean human communication is becoming irrelevant, and there is still a need for training on how to write technical documentation. API prices may still depend on the number of tokens used, thereby incentivizing prompt optimization.The comments discuss the concept of \"prompt engineering,\" which involves designing effective prompts for language models like LLMs. This process can improve performance and generate revenue, but also requires human intuition and context. The term \"prompt engineering\" is debated as some believe it is an exaggeration and more akin to trial and error. The comments also touch upon the ethical concerns around using users to train these models and the dilution of the term \"engineer.\" Overall, the post offers a nuanced discussion on the role of human input in improving AI performance.- People are divided on the usefulness of language models like LLMs.\n- Some argue that approximations generated by LLMs are not precise enough and that relying too heavily on them may lead to lazy approaches to problem-solving.\n- Others highlight the benefits of LLMs, such as their ability to parse through large amounts of natural language efficiently and their role as tools to supplement, rather than replace, deterministic processes.\n- It is suggested that the rise of LLMs represents a shift towards statistical and probabilistic reasoning as the dominant mode of truth-making, with both positive and negative implications.The use of language models like GPT for natural language processing and programming is increasing with the development of higher-level programming languages. However, the process of \"prompt engineering\" for tasks like creative writing and historical summaries can still be tedious and require a manual step in the process to grade the success of results. The formalization of requirements will always be necessary, but room for error in syntax and spelling may be acceptable in the future. Available models are currently instruction-tuned, but a general domain-specific language (DSL) for efficient prompt engineering may be discovered in the future.The discussion revolves around the use of language models, specifically LLMs, in various industries. There is talk of using LLMs for prompt tuning/injection as well as learning new skills. There are also references to libraries for humanized date parsing and the limitations of LLMs in understanding emergent properties. Some commenters express skepticism about the use of LLMs while others highlight the value of using them for specific tasks.- ChatGPT is a language model that can generate syntax and lines of code, saving time on tedious tasks like scripting and translations\n- However, GPT should be used with caution when learning, as it may provide inaccurate solutions\n- GPT can be useful for providing a starting point for writing, but it doesn't solve business problems outright\n- LLMs can be unreliable for teaching and solving difficult problems, but are useful for quick reference on common problems\n- ChatGPT and LLMs have democratized access to knowledge in fields with language barriers, like law and academia\n- The language model needs to be combined with hard rules to prevent it from violating fundamental principles in arithmetic, algebra, calculus, and dimensional analysis.Employees are utilizing OpenAI's chatbot GPT-4 to generate code for personal and enterprise projects resulting in a possible replacement for the need to use StackOverflow or similar resources. Some users have seen significant results in working with natural language prompts and generating relevant code for production environments. Others are eager to use the technology for testing, feature building and fixes. However, there are risks associated with a lack of quality control due to incorrect responses, and practical limitations to prompt engineering given code complexity. Finally, certain use cases such as SQL generation stand out as being particularly effective.The post discusses prompt engineering for language models (LLMs), including using open-source named entity recognition models and GPT-4 for NLP tasks. There is disagreement about whether GPT-4 is cost-effective for widely used models since it cost millions of dollars per day. The post notes that prompt engineering is becoming its own field, with detailed techniques and tools being developed. However, it also states that proper evaluation and testing frameworks are necessary. The article is intended as a basic guide to prompt engineering, covering the fundamentals of LLM creation and evaluation.- The post discusses prompt engineering as a technique for improving language models.\n- The author suggests using a toy problem to explain the technique and encourages more sharing of experimental results beyond toy problems.\n- There is discussion around whether using ChatGPT to write a script is more efficient than calling an LLM in production.\n- Some commenters express skepticism about the hype around prompt engineering and its effectiveness.\n- The post recommends a resource for those interested in learning more about advanced prompting techniques.",
    "hn_summary": "- Prompt engineering is debated for its effectiveness in improving language models like LLMs.\n- Language models have benefits, such as efficient parsing of natural language and supplementing deterministic processes.\n- OpenAI's Language Models (LLMs) have no intellectual property rights protections and require prompt engineering."
  },
  {
    "id": 35668357,
    "timestamp": 1682181741,
    "title": "Housing should be affordable except for when I sell my house for $1M",
    "url": "https://www.mcsweeneys.net/articles/housing-should-be-affordable-except-when-i-sell-my-house-for-a-million-dollars",
    "hn_url": "http://news.ycombinator.com/item?id=35668357",
    "content": "APRIL 13, 2023HOUSING SHOULD BE AFFORDABLE EXCEPT WHEN I SELL MY HOUSE FOR A MILLION DOLLARSby DEVIN WALLACE My heart breaks for would-be homeowners priced out of housing markets across the country. We need to do something to bring the price of all houses down, except the house I own and plan to sell for one (or many) million dollars.People deserve to buy a home at a price they can afford, a price that will somehow also cover my entire initial investment, three decades’ worth of repairs and home improvements, allow me to purchase a new condo in an expensive coastal city, and fund the next two decades of my retirement. It’s that simple.“A key barometer of the literary climate.” —The New York TimesTake a look on Zillow and you’ll see how wildly expensive housing has become out there, and by “out there,” I mean “on my property.” Just look at my asking price; sort the list from “Most Expensive.”Don’t believe me? Look at the lines of would-be buyers outside any home that just hit the market. I can’t believe how many people are fighting for the same house, and that’s exactly what I said to my realtor after telling him to jack up my asking price. The market is so hot, papa needs some sunscreen.The fact of the matter is this: it’s so important that new housing is affordable, because there’s no way in hell I’m accepting anything less than a 20 percent return on my own home.Some people say we should throw up as much housing as possible to lower prices, but we can’t let big developers reap the rewards of our housing market. I should reap those rewards; I’m the one who purchased a new home in a redlined suburb on a week’s salary in 1975.“An exhilarating, funny, frightening, mind-warping, heart-squeezing tale. Told at the speed of light. A must read. For all humans.” —Jon ScieszkaMaybe prices will go down a bit, but we’re supposed to cheer when the price of a house goes from $500,000 to $300,000? That doesn’t help people who can’t afford a $300,000 house or people who would rather shave themselves bald and jump in a freezing pond than sell for anything less than seven figures. These groups surely have compatible interests.We must balance those interests, like the desire of millions of people to have shelter, and my desire to go “Boca Mode” in a South Florida condominium called “El Regalo.” These things can’t exist if we don’t simultaneously ensure housing is cheap and abundant, and also an incredibly scarce resource so I can sell it for a king’s ransom.A house is so many things. A refuge, a sanctuary, an investment so important to me that I’m willing to destroy an entire generation’s chance at housing in order to lock in my own profits.But I’m also a reasonable person. If it’s absolutely necessary, I will support building new housing to lower prices, just as soon as my own sale clears escrow. Once this snowbird leaves town, they can build a chocolate castle for all I care.“The best kids art & storytelling magazine out there.” —Wendy MacNaughton, Draw TogetherI hope that in the future all housing can be affordable, and that all of it can be built anywhere except in my backyard.Housing Crisis Affordable housing Gentrification Real Estate EconomyPlease help support our writers and keep our site ad-free by becoming a patron today!Become a patronTweet",
    "summary": "- Writer expresses empathy for those priced out of housing markets, but insists their own house should be exempt from price reduction\n- Writer believes that new housing should be affordable, as long as it doesn't affect the high selling price of their current home\n- Writer acknowledges the high demand for housing, but believes developers should not reap the rewards, instead insisting on personal profits from selling their own home\n- Writer is willing to support building new housing to lower prices, but only after their own sale clears escrow\n- Writer hopes that all housing will be affordable in the future, excluding their own backyard.",
    "hn_title": "Housing should be affordable except for when I sell my house for $1M",
    "original_title": "Housing should be affordable except for when I sell my house for $1M",
    "score": 294,
    "hn_content": "A discussion on the sustainability of the rising prices of housing is ongoing on Hacker News. The participants suggest that we shouldn't view buying a house as a long-term investment whose value keeps accumulating, and that it is becoming increasingly difficult for people to afford homes due to the leverage factor. The role and effectiveness of HOAs in maintaining properties were also part of the conversation, and several examples were discussed. Property taxes and their differences in various parts of the world were also mentioned.The post discusses property taxes and HOAs, with commenters discussing their experiences and perspectives on both. Some note high property taxes in their regions, while others appreciate the benefits of living in an HOA-controlled neighborhood. One commenter notes that HOA restrictions can be a concern if they are too restrictive, and others mention that property taxes and neighborhood associations can impact property values.- HOAs can provide a more tailored solution for some neighborhood issues, but city laws provide a baseline for everyone.\n- HOAs should only limit things that affect others and have legal limits to prevent scope creep.\n- Some argue that moving minor living arrangement governance out of city government into the neighborhood works better.\n- HOAs require democratic structures to maintain accountability and make them more democratic than city government.\n- HOAs can maintain and manage common areas, but they can't monitor grass height and other trivial issues.\n- There is a debate about the need for decentralization in the US.\n- The uninhabited land is not the problem; people want to live near expensive cities.\n- Some argue that we need denser urban infrastructure and eliminate single-family zoning.\n- In a few generations, owning a home might not be the American Dream anymore.Many people in the US view owning a house as a yardstick of success but it can be a luxury with high costs in Europe. Home ownership rates in most of Europe are higher than in the US despite the costs of owning a home. Renting can also offer stability and there are many different housing options beyond owning or renting from a private landlord such as social housing. Homeownership may offer a false sense of stability with unforeseen home repairs and maintenance resulting in large expenses that are difficult to predict. Personal preferences around housing choice will change drastically over the coming years.No meaningful content to summarize.Investors buy housing due to limited supply, which makes it valuable. The lack of new housing construction is a hindrance, with interventions making it difficult. Remote work has allowed more developer-friendly places like Texas and Florida to attract net migration due to a relaxation in regulations. Housing is expensive partially due to blaming developers; when things are in short supply, the price goes up, which encourages new supply/competition. In Manhattan, there is a mix of factors like geology, availability of public transportation, and job market that factors into housing scarcity. The housing price bubble is in large part because high-value job creation has been unevenly distributed. Stein’s Law - If something cannot go on forever, it will stop.Real returns on house prices are unsustainable, being propped up by laws, policies, and special tax exemptions.\n\nHousing costs are increasing in line with inflation, and some goods will get expensive, leading to voters living in rental accommodation.\n\nReal returns refer to inflation-adjusted rates of return, and purchasing power refers to specific economic terms.\n\nThe relative cost of other goods will be constant, and we would never reach a place where a single house could be so relatively valuable.\n\nScarcity exists in desirable locations and will always exist, and the music only stops when the location is no longer desirable.\n\nDevelopers will announce new apartment buildings, and residents will organize around the demands of removing one or two floors from the proposal.A community in opposition to a proposed 36-unit apartment building learns that people tend to care more about what is built near them. Developers face challenges negotiating with local boards for new construction projects due to outdated zoning codes designed to prevent Black families from moving into multi-family development. Some believe that capitalism should have a limited scope and be limited to ethically neutral things. There is a lack of agreement over the core issues of why people might disagree over what is being built and where. The term \"NIMBY\" is controversial and may lead to further polarization.A semantic dispute on the definition of NIMBY ensues in a thread discussing a proposal to build more housing in a specific area; a commentator notes that future inhabitants of the proposed housing have no say in the discussion; a young commentator laments the lack of progress in solving the housing crisis and predicts a potential influx of protestors; others question the feasibility of significant change and note that the youth tends to overestimate their impact; a discussion on the cost of housing and the need for solutions is also featured.Many rural areas and \"rust-belt\" cities in the US have an oversupply of housing with no demand. The issue of unaffordable housing is affecting young people, but it is a politically sensitive topic as it may devalue homeowners' net worth. Previous social movements have struggled to succeed in America due to a lack of uniform culture and demagoguery used by politicians. Wealth redistribution and getting money out of politics are general grievances and not actionable demands. Housing prices naturally go up in nominal terms due to economic growth and competition, but it should be tied to local economic growth and wages. While building houses may become more efficient, labor costs remain a larger percentage than materials.No meaningful content to summarize.There is a debate about affordable housing, with some suggesting that using human or corporate straw buyers can be prevented if affordable-housing policies are implemented through cutting-edge tech news. However, others argue that such policies are not effective and other solutions like zoning limits, exponential property taxes, or vacancy taxes are better. While there is a risk of civil war or riots if nothing is done to address the housing crisis, some propose finding non-destructive ways to fight against the locked-in self-enriching greed of asset-owning generations, such as getting involved with local YIMBY groups and voting for pro-housing politicians.No meaningful content for a tech news summary.",
    "hn_summary": "- Participants suggest that buying a house should not be viewed as a long-term investment.\n- HOAs and property taxes were discussed with commenters sharing their experiences and perspectives.\n- Housing scarcity exists in desirable locations and will always exist."
  },
  {
    "id": 35671968,
    "timestamp": 1682207470,
    "title": "iOS 17 app sideloading might only be available in Europe",
    "url": "https://www.techradar.com/news/ios-17-app-sideloading-might-only-be-available-in-europe",
    "hn_url": "http://news.ycombinator.com/item?id=35671968",
    "content": "Home News Mobile PhonesiOS 17 app sideloading might only be available in EuropeBy David Nield published about 21 hours agoOther gardens will remain walled up(opens in new tab)(opens in new tab)(opens in new tab)(opens in new tab)The App Store might soon not be the only source for iOS apps (Image credit: Pexels / Brett Jordan)Rumors of iOS 17 allowing app sideloading continue to rumble on, but in the latest round of unconfirmed chatter there's a caveat: the feature will apparently only be available in Europe, and won't be coming to the US.This comes from Bloomberg's Mark Gurman, a reliable authority on advance Apple information. Speaking to the MacRumors(opens in new tab)podcast, Gurman said that he thinks app sideloading will be only available in Europe.If you've not got a clue what we're talking about, app sideloading means installing apps from outside of an official app store – as you can on macOS, for example. It's also fairly easy to do on Android, but Apple has long cited security and reliability concerns for wanting iPhones and iPads to be restricted to approved apps only.Extra feesThis Europe exclusivity makes sense: Apple doesn't really want to add sideloading, and is only doing so because of regulatory pressure from the EU. Gurman says Apple won't \"shoot themselves in the foot\" by adding it everywhere, and will probably introduce the feature quietly and without fanfare.RECOMMENDED VIDEOS FOR YOU...In addition, developers may have to pay extra if they want their apps to be available outside of the iOS App Store, Gurman says. Don't be surprised if the feature is mentioned at the bottom of a press release rather than in the WWDC 2023 keynote.The Worldwide Developers Conference starts on June 5, and will be a showcase for all the software Apple is pushing out this year, including iOS 17. Gurman also adds that upgrades are expected for the Wallet and Find My apps.Analysis: Apple bows to EU pressureIf you're wondering what app sideloading has to do with EU lawmakers, the previous history here is that Apple has been coming under pressure from regulators in Europe over the issue of the App Store being perceived as a monopoly run by Apple.The EU's Digital Markets Act coming into force this summer aims to limit the control of digital \"gatekeepers\". The EU would argue that Apple can't force iOS apps to go through its own App Store, whereas Apple would say that it needs that control to keep users safe and to maintain a quality experience.Apple has previously had to fight a costly legal battle against Epic over the issue of controlling in-app payments, and it will want to avoid another protracted case – which is why it now seems likely that iOS and iPadOS are going to allow apps to be installed from other sources, even if it is only in Europe.At the same time, the iPhone 15 is expected to make the switch from Lighting to USB-C. Again, this is in response to EU regulations – though it's much easier to make region-specific changes to software than to hardware, so the USB-C iPhone is going to appear in all of Apple's markets.iOS 17 rumored to bring major changes to the Control CenterTechRadar NewsletterSign up to receive daily breaking news, reviews, opinion, analysis, deals and more from the world of tech.Contact me with news and offers from other Future brandsReceive email from us on behalf of our trusted partners or sponsorsBy submitting your information you agree to the Terms & Conditions(opens in new tab)and Privacy Policy(opens in new tab)and are aged 16 or over.David NieldFreelance ContributorDave is a freelance tech journalist who has been writing about gadgets, apps and the web for more than two decades. Based out of Stockport, England, on TechRadar you'll find him covering news, features and reviews, particularly for phones, tablets and wearables. Working to ensure our breaking news coverage is the best in the business over weekends, David also has bylines at Gizmodo, T3, PopSci and a few other places besides, as well as being many years editing the likes of PC Explorer and The Hardware Handbook.SEE MORE MOBILE PHONES NEWSMORE ABOUT MOBILE PHONESLeaked Google Pixel Fold video shows the fold in action for the first timeiPhone 15 Pro vs iPhone 14 Pro: the rumored key differencesLATESTOverwatch 2’s Lifeweaver is a brilliant hero, but he’s not made for mere mortalsSEE MORE LATEST ►MOST POPULARMullvad's no-log policy proven after police raidBy Chiara CastroApril 21, 2023Future Xbox game could take 10 years to make, and I hope it's not what I think it isBy Rhys WoodApril 21, 2023Google Meet calls could be about to get a lot more pleasant - by blocking everyone else outBy Mike MooreApril 21, 2023The Google Pixel Fold may have just leaked in full – here are all the detailsBy Alex Walker-ToddApril 21, 2023IBM will now rent you a cloud-ready bare metal setupBy Craig HaleApril 21, 20237 new movies and TV shows on Netflix, Prime Video, HBO Max and more this weekend (April 21)By Axel MetzApril 21, 2023The new Humane AI-powered wearable could change everything – or nothing at allBy Hamish HectorApril 21, 2023Microsoft Copilot lands on VivaBy Luke HughesApril 21, 2023Scam alert: these 3 simple iPhone tricks will help protect your Apple ID from thievesBy Axel MetzApril 21, 2023Cheaper QD-OLED TVs could be on the cards at last as Samsung eyes new techBy Matt BoltonApril 21, 2023This old WordPress plugin is being used to hack websitesBy Craig HaleApril 21, 2023",
    "summary": "- Rumors suggest iOS 17 app sideloading may only be available in Europe and not the US\n- App sideloading allows installing apps from outside an official app store, like on macOS or Android\n- Apple is likely adding sideloading due to regulatory pressure from the EU and may introduce the feature quietly without fanfare\n- Developers may need to pay extra fees to have apps available outside the iOS App Store\n- Apple has previously been under pressure from EU regulators over the issue of the App Store being perceived as a monopoly run by Apple, which could be why they are allowing apps to be installed from other sources.",
    "hn_title": "iOS 17 app sideloading might only be available in Europe",
    "original_title": "iOS 17 app sideloading might only be available in Europe",
    "score": 264,
    "hn_content": "iOS 17 app sideloading may only be available in Europe. Apple denies full-screen features for websites and third-party browsers. Discussions on whether buying a phone gives ownership rights, or it's just a \"lent\" piece of hardware with no ownership rights. Closed source software only offers a perpetual usage license, while open source allows for repairs, modifications, and tinkering. Some argue that iPhones are \"general computing devices\" while others see them as \"appliances.\" Issues of language (buy vs. rent) and DRM arise in Steam games. Discussions on hardware ownership and freedom.- If Apple disappears, push notifications from apps will stop working, even for apps already installed, due to the walled garden restriction\n- Sideloading can be a solution for app installation or updates if Apple and its services disappear\n- Games on Steam are not technically owned but rather, the right to use them is purchased for an unspecified time with the possibility of revocation\n- Leasing instead of ownership should remain a special case and not the default, and the default should be protection of individual rights\n- Apple may be guilty of false marketing by calling their products \"buying\" when there are restrictions on usage\n- Voting with money only works if companies make a product available for purchase, which may not be the case for the iPhone \"unlocked edition\"\n- Apple's misuse of their monopoly against other app makers can harm consumers indirectly, such as in the case of revenue sharing for music subscriptions through Apple devices.The debate on sideloading continues among tech enthusiasts. Some argue that Samsung's Android devices allow sideloading, while iPhones' wall garden limits user experience. Others contend that Apple should make it easier to install unlisted apps while presenting a choice to app developers to go through the walled garden or impose a technical process on non-technical end-users. Users' priorities are for secure devices capable of performing banking tasks, generating tokens, etc., without sacrificing security on an open system. It also behooves politicians enforcing sideloading to transparently lay out pros and cons and accept their corresponding liabilities.- iPhones may no longer be considered status symbols, but they remain more expensive than their Android counterparts, leading to social hierarchies based on phone choice.\n- Concerns arise over the potential for liability shifting towards users of sideloaded apps, whereby Apple can defer responsibility for potential malware infections. \n- The disallowing of sideloading could be used as a tool for data protection as Apple's strict app store policies, such as limiting data collection and tracking, could be bypassed.\n- Arguments for and against sideloading are made, with one side claiming it facilitates user choice and device management, while the other posits that it undoes Apple's privacy regulations.\n- Some features for privacy management, such as the App Privacy Report and the currently in beta Privacy Relay, have already been implemented, but Apple's privacy policies have been questioned with recent moves indicating intent to enter the ad network industry.\n- Convenience may lead users to an inability to choose an alternative communication provider outside of Facebook, where sideloading could provide an alternative means of communication.Users discuss Signal and its phone number registration process, including how to register without a phone number, and whether registration works for numbers that have already been used to register an account. The conversation then shifts towards Apple policies, with a discussion of sideloading and the potential for developers to pay extra to have their apps available outside of the iOS App Store. Some users express a preference for physical SIM cards, while others discuss the benefits of eSIMs.Although eSIM can allow for self-service without waiting for physical delivery or going to a store, the migration process can be complicated, and customers often have to deal with the carrier's unfriendly customer service. While eSIM migration can be much smoother than waiting for physical delivery, physical SIM switching is still better than having to transfer the ownership of a SIM card to the provider. Additionally, some EU countries still have less user-friendly eSIM services than others. In China, iPhones do not have any eSIM support, but instead have a dual nano-SIM card slot.The EU recently released new guidelines allowing app developers to sideload apps outside the iOS App Store, sparking a debate about whether developers must pay extra fees to be available outside the official store. Some commentators suggest that Apple could require certification to sideload apps, but this shenanigan would likely be struck down by the courts. Apple may be trying to protect its golden goose, the App Store, even from minor competition. Customers in other geographies will also wake up, eventually. The EU's proposal means increasing individual freedom at the cost of corporate freedom.European DPAs are struggling to combat the problem of shady cookie popups, but they have not been idle. It is mandated by European law that Apple must allow the ability to install apps independent of Apple's app store. Some commenters are concerned with how Apple might handle app review in this case, while others debate the necessity of such a move for user security. However, some believe that sideloading would simply allow more malware to infect iDevices. There are also discussions about Apple's revshare model for app developers and the company's billion-dollar app distribution monopoly.The comments section of an article discussing Apple's App Store model contains various opinions. Some argue that Apple's choice to limit app choices on their devices is a benefit, as it simplifies their life and they would pay more for this feature. However, others argue that the App Store model has security issues and limits innovation and competition. Additionally, there is discussion about Ukraine sayings and whether Apple should have to share revenue from cable subscriptions or not. The main takeaway is that opinions on the App Store model and its effects on security and competition vary widely.Apple's policies on installing arbitrary software are controversial, with some arguing that they should be more open while others believe that their current approach is reasonable. Sandboxing is a key feature of Apple's security measures, and it allows them to restrict software installation to authorized sources. However, some users believe that this approach is too restrictive and limits their ability to customize their devices. European users will have more leeway in the coming months regarding installing software, as the EU is cracking down on the practice of restricting software installation on devices.The comments revolve around the debate on language and ideas and how much time is spent arguing about the definition of words. There's a comparison between the way cellphone app distribution was handled before and after the iPhone. There's also a discussion on the security restrictions in place for app installation on Windows and Apple compared to personal computers. The lack of trust that users place on the security of their systems' processes is highlighted. The views of the content creators have an impact on whether their applications can be used on certain platforms.The discussion revolves around signing certificates for software and the arbitrary classification of software as malware by antimalware programs. The real issue is software distribution, as antivirus-programs consider malicious software that the user doesn't see harmful. Users can turn off their antivirus programs, but uninspiring warnings may discourage users from running certain software. Sandboxing is the future of OS, but it's not yet a reality. Closed platforms can be successful despite being closed, but open platforms have advantages resulting from greater freedom. Installing arbitrary software on devices one owns is a natural state and an inalienable right.A debate on the right to modify or install whatever software one wants on owned devices, specifically relating to smartphones and computers. \nOne commenter argues that while they agree with the idea of protection for device freedom, people should be honest that it's a new and unique regulation, not the default state. \nThe argument is made that it is not illegal to jailbreak a phone, but it is not illegal for Apple, for example, to lock down the device. \nAnother commenter argues that the downsides of allowing free modification are the obvious security and privacy concerns. \nThe history of the computer industry is also discussed, with the belief that computers were devices that came with predetermined hardware and software for a long time until unbundling took over becoming the de facto standard.",
    "hn_summary": "- Discussions on app sideloading continue, with arguments for and against the practice\n- Some believe that iPhones should be considered general computing devices and offer more customization options\n- Concerns arise over liability and potential security risks with sideloaded apps, but the EU's proposal increases individual freedom at the cost of corporate freedom."
  },
  {
    "id": 35667429,
    "timestamp": 1682176661,
    "title": "Why the brain's connections to the body are crisscrossed",
    "url": "https://www.quantamagazine.org/why-the-brains-connections-to-the-body-are-crisscrossed-20230419/",
    "hn_url": "http://news.ycombinator.com/item?id=35667429",
    "content": "Neuroscientists have long puzzled over why the nervous system in humans and other bilaterally symmetrical animals is cross-wired, with nerves crisscrossing from one side of the body to the opposite side of the brain. The answer may lie in the brain's need to create a virtual map of the external world, with connections between the brain and body organized somatotopically. Geometric singularities could arise if the connections did not cross the body's midline, leading to potential confusion about left/right and up/down information. The brain therefore cross-wires to avoid errors in the process of mapping 3D space onto a 2D plane.Researchers suggest that the symmetrical system of wiring between the brain and the body may be a solution to the complexity of maintaining uncrossed connections in the nervous system. The study shows that a small physical rotation results in a flipping of the labels in perception maps, which cannot be simply rotated to return to the original. The brain may need to keep flipping one axis of its body maps as the body parts move, making it impossibly complex if it had to maintain uncrossed connections. Further biological research may be needed to understand how the brain and body are connected.",
    "summary": "- Bilaterally symmetrical animals have cross-wired nerves, with nerves crisscrossing from one side of the body to the opposite side of the brain\n- The brain's connections to the body are organized somatotopically to create a virtual map of the external world\n- Cross-wiring avoids errors in mapping 3D space onto a 2D plane and replaces the need for complex uncrossed connections\n- A small physical rotation of the body results in the flipping of perception maps, making it complex to maintain uncrossed connections\n- Further biological research may be needed to uncover the connection between the brain and the body.",
    "hn_title": "Why the brain’s connections to the body are crisscrossed",
    "original_title": "Why the brain’s connections to the body are crisscrossed",
    "score": 260,
    "hn_content": "The article discusses why the brain's connections to the body are crisscrossed, and the debate around the reason behind it. The predominant theory is that this crisscross structure helps simplify visual processing. The brain separates the left and right fields of each eye and crosses them so that the left fields go to the right half of the brain, and the right fields go to the left half of the brain, reuniting the image as well as separating visual processing into left/right. There is a debate about whether this same crisscross structure exists to perform other spatial mappings like those of touch and motor control or is just present to benefit visual processing. The article mentions that the phenomenon is not well-understood and has been present in worms, which do not have lenses and retinas, indicating that vision is not the main driver.Root systems of trees mirror what is happening above ground, and pruning trees can cause corresponding roots to die and decompose, making biomatter available for recycling. Brain loops occur in neural systems, but spike-timing-dependent plasticity prevents feedback loops in the brain. A theory suggests that a vertebrate ancestor flipped its head around, and the axial twist hypothesis accommodates the contralateral organization in bilaterally crossed nervous systems. Eyes may have evolved via a series of incremental steps involving light-sensitive chemicals in primitive creatures.The evolution of the eye is a step-by-step process, from light-sensitive patches to cavities with small holes acting as a pinhole camera to the development of lenses. The brain is wired to allow for crisscrossing connections between eyes and muscles to maximize sensitivity to danger or food. The homunculus maps parts of the body to the cerebral cortex, but cutting the map in half allows for projection in both orientations. Some theories suggest that splitting is done to avoid shared state and non-shared state is essential for individuality. The brain wiring avoids single non-split capture, causing confusion with digital photos.The discussion revolves around the structure of the human brain and its wiring, including cross-wiring between hemispheres, the use of 2D mapping for 3D phenomena, and the effects of damage to neural connections. The conversation includes references to neuroscience, biology, and mathematics. The possibility of alternative wiring methods for biological systems and their application to synthetic systems is also discussed.Connecting the hemispheres of the brain can have interesting results; cannabis use may inhibit communication between hemispheres. Various corrective surgeries for vision intentionally mismatch focal distance between eyes. Reading aloud has different effects than reading silently. Split-brain patients will confabulate an excuse for their behavior due to the separation of their left and right hemispheres. The purpose of adding reasoning behind how humans were created is questioned. Evolution may have caused the wiring of the brain to be crisscrossed. The explanation of the paper on topology lacks clarity and images. The crisscrossed wiring of the brain may serve to cover issues if part of the other side gets severed.",
    "hn_summary": "- The article delves into why the brain's connections to the body are crisscrossed, and there is a debate on the reason for this structure and whether it's only for visual processing.\n- The conversation revolves around the structure of the human brain and its wiring, including cross-wiring between hemispheres, the use of 2D mapping for 3D phenomena, effects of damage to neural connections, and the possibility of alternative wiring methods for biology and robotics.\n- Split-brain patients confabulate excuses for their behavior due to the separation of the left and right hemispheres, and there are theories about why the brain wiring avoids a single non-split capture."
  },
  {
    "id": 35666201,
    "timestamp": 1682168462,
    "title": "Finetuning Large Language Models",
    "url": "https://magazine.sebastianraschka.com/p/finetuning-large-language-models",
    "hn_url": "http://news.ycombinator.com/item?id=35666201",
    "content": "Ahead of AI's Sebastian Raschka explains the various ways to fine-tune large language models (LLMs), which has become increasingly important in the field of artificial intelligence. Raschka discusses how in-context learning and indexing work, and then explores the three conventional feature-based and finetuning approaches for finetuning LLMs. He also includes real-world results of these approaches on a movie review classifier. Finally, Raschka introduces parameter-efficient finetuning, which allows for reusing pretrained models while minimizing computational and resource footprints.The article discusses techniques for adapting language models to new tasks while minimizing computational costs and resources. Parameter-efficient finetuning techniques involve introducing a small number of additional parameters to achieve high modeling performance. Reinforcement learning with human feedback uses human ranking or rating to train a reward model that guides the language model's adaptation to human preferences. The article promises more detailed explanations in future articles. The author invites readers to check out their Substack Notes or books and support their work by becoming a free or paid subscriber.",
    "summary": "- Fine-tuning large language models has become increasingly important in the field of AI\n- The article discusses three conventional feature-based and fine-tuning approaches for LLMs along with real-world results on a movie review classifier\n- Parameter-efficient fine-tuning techniques can minimize computational costs and resources while achieving high modeling performance\n- Reinforcement learning with human feedback uses human ranking or rating to train a reward model that guides the language model's adaptation to human preferences\n- The author invites readers to check out their Substack Notes or books and support their work by becoming a free or paid subscriber.",
    "hn_title": "Finetuning Large Language Models",
    "original_title": "Finetuning Large Language Models",
    "score": 210,
    "hn_content": "The article discusses fine-tuning of Large Language Models (LLMs) such as GPT-3 for specialized tasks or styles, and its limitations for factual recall. The post includes some opinions and questions about the feasibility of fine-tuning for adding new knowledge to question answering models, as well as its advantages and disadvantages for code assistants. Various ideas are discussed about running LLMs locally or over the network using prompts and search, tokenezation and vector DB, and the benefits of citing sources. The commenters discuss different approaches, such as transformer adapters, SuperCOT, and Tabnine.OpenAI prefers users to use their models over open models that can be fine-tuned, but they do have a fine-tuning API that is not supported for their chat models. The efficacy of fine-tuning for documentation is still a topic of debate, as is the question of which inputs and outputs would be best suited for the task. Some users have tried alternatives, such as including a classification front end to detect relevant business context, or creating a synthetic data set to train translation models for API query responses. Despite the challenges, LLMs are viewed as platforms with great potential.The article discusses the potential of language model training and fine-tuning for specific use cases, using examples like predicting discharge disposition in healthcare. The discussion includes considerations such as context size limitation and the tradeoffs between fine-tuning versus few-shot prompting for different tasks. Some commenters also discuss practical applications of LLMs and the challenges of using them effectively. The article specifically covers fine-tuning encoder-only models (BERT) and not GPT models, with a promise of a future post on the latter.- Fine-tuning models are evolving from a binary choice to a spectrum, with larger context windows and potentially dynamic tuning in the future\n- LLM-based indexes, combined with traditional text retrieval indexes, may lead to better search results than using either alone\n- The Haystack conference offers discussions about current practices in LLM-based search\n- LLM embedding approaches are providing better search results than Elasticsearch, but cost is an issue\n- No specific applications were discussed, but some benchmarks would be useful in determining the value of investing in finetuning GPT models for sentiment analysis.",
    "hn_summary": "- The article explores fine-tuning Large Language Models (LLMs) like GPT-3 for specialist tasks, limitations for factual recall, and opinions on the feasibility of fine-tuning for knowledge recall.\n- Commenters discuss transformer adapters, SuperCOT, and Tabnine, and the debate around the efficacy of fine-tuning for documentation.\n- LLMs are viewed as platforms with great potential, with considerations such as context size and tradeoffs between fine-tuning and few-shot prompting for different tasks."
  }
]
