[
  {
    "id": 42167633,
    "title": "iOS 18 Etkin Olmama Yeniden Başlatmasını Tersine Mühendislik",
    "originLink": "https://naehrdine.blogspot.com/2024/11/reverse-engineering-ios-18-inactivity.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42167633",
    "commentBody": "",
    "originSummary": [
      "iOS 18, güvenliği artırmak amacıyla 3 gün boyunca kullanılmayan iPhone'ları otomatik olarak yeniden başlatan bir hareketsizlik yeniden başlatma özelliği tanıttı.- Bu özellik, cihazları daha savunmasız olan İlk Kilit Açıldıktan Sonra (AFU) durumundan daha güvenli olan İlk Kilit Açılmadan Önce (BFU) durumuna geçirerek kullanıcı verilerini korur.- Güvenli Bölge İşlemcisi (SEP), son kilit açma zamanını izler ve cihaz 3 günden fazla hareketsiz kaldığında bir yeniden başlatma tetikler, bu da hırsızlık ve yetkisiz erişim riskini etkili bir şekilde azaltır, ancak kolluk kuvvetleri için veri çıkarma konusunda zorluklar yaratır."
    ],
    "commentSummary": [
      "iOS 18, veri korumasını artırmak amacıyla, üç gün boyunca kullanılmayan cihazları yeniden başlatarak onları \"İlk Kilit Açılmadan Önce\" (BFU) durumuna döndüren bir güvenlik özelliği sunuyor.",
      "Bu özellik, yetkisiz veri erişimini önlemeyi amaçlayarak, hassas verilerin yalnızca aktif kullanıcı kilidini açtıktan sonra erişilebilir olmasını sağlar, kolluk kuvvetlerinin veri çıkarımını etkiler ve potansiyel olarak kullanıcıları rahatsız edebilir.",
      "Yazı, güvenlik önlemleri ile kullanıcı deneyimi arasındaki dengeyi araştırarak bu yeni özelliğin zorluklarını ve etkilerini vurguluyor."
    ],
    "points": 457,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1731880226
  },
  {
    "id": 42169998,
    "title": "Ondsel'i kapatıyoruz",
    "originLink": "https://ondsel.com/blog/goodbye/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169998",
    "commentBody": "",
    "originSummary": [
      "Ondsel, topluluk desteğine rağmen ticari başarı veya sürdürülebilir bir iş modeli elde edememesi nedeniyle 30 Ekim 2024'te kapanıyor.",
      "FreeCAD'e yapılan önemli katkılar arasında yeni bir montaj çalışma tezgahı, bir 3D kısıtlar çözücü ve Sketcher ile TechDraw'a yapılan iyileştirmeler yer almakta olup, bunların tümü açık kaynaklı kalacaktır.",
      "Ondsel ES v2024.3'ü yayınlamayacak olsa da, eski ekip üyeleri FreeCAD'e katkıda bulunmaya devam edecek ve kullanıcılar sunucu kapanmadan önce verilerini indirmek için zamana sahip olacaklar."
    ],
    "commentSummary": [
      "Ondsel, FreeCAD'e katkıda bulunan bir kuruluş, kapanıyor ancak yazılımın gelişimi üzerinde olumlu bir etki bıraktı.",
      "Açık kaynaklı CAD araçlarının ticari yazılımlarla rekabet etme konusunda karşılaştığı zorluklar üzerinde duran tartışma, uygun fiyatlılık ve kullanıcı dostu arayüzlere duyulan ihtiyacı vurgulamaktadır.",
      "Ondsel'in kapanmasına rağmen, topluluk katkılarını değerli buluyor ve açık kaynaklı CAD çözümlerinde devam eden gelişmeler için umutlu kalıyor."
    ],
    "points": 291,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1731908458
  },
  {
    "id": 42166606,
    "title": "Windows 95 kurulumu neden üç işletim sistemi kullandı?",
    "originLink": "https://devblogs.microsoft.com/oldnewthing/20241112-00/?p=110507",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42166606",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Windows 95 kurulumu, uyumluluğu ve kurulum kolaylığını sağlamak için üç işletim sistemi kullandı: DOS, Windows 3.1'in minimal bir versiyonu ve Windows 95.- Kurulum süreci, daha eski sistemlerden yükseltmelere izin vererek Windows 95'in kurulumunu kolaylaştırmak için temel bir Windows 3.1 ortamını başlatan DOS ile başladı.- Bu tartışma, Windows'un evrimini ve yeni özelliklerin tanıtımıyla uyumluluğu dengelemenin zorluklarını vurguluyor."
    ],
    "points": 288,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1731873264
  },
  {
    "id": 42171164,
    "title": "2023 yılında kör olmadığım için hCaptcha erişilebilirlik hesabından yasaklandım.",
    "originLink": "https://michaels.world/2023/11/i-was-banned-from-the-hcaptcha-accessibility-account-for-not-being-blind/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42171164",
    "commentBody": "",
    "originSummary": [
      "Bir kullanıcı, kör olmasına rağmen hCaptcha erişilebilirlik hesabından yasaklandı ve bu durum hCaptcha'nın erişilebilirlik önlemlerindeki potansiyel kusurları vurguladı.- Olay, ürünlerini kasıtlı olarak erişilemez hale getirebilecek şirketlere güvenmenin risklerini ve güvenilmez geçici çözümleri gözler önüne seriyor.- Kullanıcı, bu tür hizmetlere bağımlı olanlar için dikkatli olunmasını tavsiye ediyor ve özellikle hCaptcha kullanan web yöneticileriyle bu uyarının paylaşılmasını öneriyor."
    ],
    "commentSummary": [
      "Bir görme engelli kullanıcı, hCaptcha erişilebilirlik hesabından yasaklandı ve bu durum, hCaptcha'nın erişilebilirlik iddiaları ve sistemiyle ilgili sorunları vurguladı.- Görme yeteneğinden bağımsız olarak birçok kullanıcı, hCaptcha'nın zorluklarını zorlayıcı ve ayrımcı buluyor, bu da etkinliği ve kapsayıcılığı hakkında endişeler doğuruyor.- Daha geniş bir sorun, captcha'ların genel erişilemezliği ve etkisizliği olup, kullanıcı deneyimini ve gizliliği artıran geliştirilmiş çözümler için bir çağrı yapılıyor."
    ],
    "points": 254,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1731924808
  },
  {
    "id": 42170740,
    "title": "Reaktif HTML Defterleri",
    "originLink": "https://maxbo.me/a-html-file-is-all-you-need.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42170740",
    "commentBody": "",
    "originSummary": [
      "Makale, bilimsel yayıncılık için HTML'yi birleştirilmiş bir platform olarak kullanmayı, Jupyter veya LaTeX gibi birden fazla araca olan ihtiyacı ortadan kaldırmayı tartışıyor.- Observable, Pyodide ve WebR gibi kütüphaneler kullanılarak etkileşimli unsurlara sahip reaktif HTML defterlerinin oluşturulmasını sergiliyor.- HTML'nin yayın sürecini basitleştirme potansiyeli vurgulanıyor ve daha fazla geliştirme için @celine/celine kütüphanesinden bahsediliyor."
    ],
    "commentSummary": [
      "Bu tartışma, hesaplama defterleri için bir temel olarak HTML kullanımına odaklanmakta, mevcut uygulamalara eleştiriler ve Heximal adlı daha deklaratif bir sistem için öneriler içermektedir.",
      "Karşılaştırmalar, kalıcılık ve ergonomi konularındaki zorlukları vurgulayarak Jupyter, Pluto ve Raku gibi mevcut araçlarla yapılmaktadır.",
      "Keşifsel veri analizi ve yayıncılığın potansiyeli hakkında bir heyecan var, ancak web teknolojilerinin getirdiği karmaşıklıkla ilgili endişeler de dile getiriliyor."
    ],
    "points": 227,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1731918812
  },
  {
    "id": 42168166,
    "title": "Nova JavaScript Motoru",
    "originLink": "https://github.com/trynova/nova",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168166",
    "commentBody": "",
    "originSummary": [
      "Veri odaklı tasarım kullanılarak yeni bir JavaScript motoru geliştiriliyor, bu da veri depolama ve erişimini optimize ediyor.- Ana özellikler arasında verilerin türüne özgü vektörlerde depolanması ve yığın referansları için tür ayrımlı indekslerin kullanılması yer alıyor, bu da performansı artırıyor.- Nesneler, türüne özgü vektörlere bölünerek ve kullanılmayan kısımların okunmasını önlemek için ayrılarak verimlilik artırılıyor."
    ],
    "commentSummary": [
      "Nova, verimliliği ve performansı artırmak için verileri türüne özgü vektörler halinde düzenleyen veri odaklı bir tasarım kullanan deneysel bir JavaScript motorudur.",
      "Nova, V8 gibi geleneksel motorların aksine, kompakt veri depolamaya odaklanır ve hizalama boşluklarından kaçınır, ancak şu anda Anında Derleme (JIT) derleyicisine sahip değildir ve bir bayt kodu yorumlayıcı kullanır.",
      "Proje, tam ECMAScript spesifikasyonunu uygulamayı amaçlamakta olup, devam eden geliştirme ve gelecekteki kıyaslamalar ve performans karşılaştırmaları için planlar içermektedir."
    ],
    "points": 195,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1731884845
  },
  {
    "id": 42166948,
    "title": "En son teknoloji konumsal kodlama tasarlamış olabilirdiniz",
    "originLink": "https://fleetwood.dev/posts/you-could-have-designed-SOTA-positional-encoding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42166948",
    "commentBody": "",
    "originSummary": [
      "Yazı, transformer modellerinde konumsal kodlamanın gelişimini inceleyerek, LLama 3.2 gibi ileri modellerde kullanılan Döner Konumsal Kodlama'yı (RoPE) vurguluyor. Kendi kendine dikkat mekanizmalarında konumsal bilginin gerekliliğini, token ilişkilerini anlamak için çeşitli kodlama yöntemlerini ve bunların sınırlamalarını karşılaştırarak tartışıyor. RoPE, göreceli konumları döndürmeler yoluyla kodlayan, anlamsal bilgiyi değiştirmeden performansı artıran ve çok boyutlu verilere potansiyel uzantılar sunan bir yöntem olarak tanıtılıyor."
    ],
    "commentSummary": [
      "Bu tartışma, transformerlarda konumsal kodlamaya odaklanarak, modellerin token sırasını anlamalarına yardımcı olma rolünü vurguluyor; bu, Sorgu, Anahtar, Değer (QKV) mekanizmasında dikkat puanlarını hesaplamak için gereklidir.- RoPE gibi çeşitli kodlama şemaları, modeli yeniden eğitmeye gerek kalmadan esnek token konumlandırmasına izin verme yetenekleri nedeniyle bahsedilmektedir.- Katılımcılar, bu kodlamaların uygulanmasıyla ilgili deneyimlerini ve zorluklarını paylaşmakta ve sağlanan açıklamalar için takdirlerini ifade etmektedirler; bağlam kodlaması ve kodlama yöntemi verimliliği gibi ilgili konular üzerine ek kaynaklar ve tartışmalar da dahil edilmiştir."
    ],
    "points": 195,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1731875486
  },
  {
    "id": 42168652,
    "title": "Yüzlerce sahte ihbar saldırısının arkasındaki genç, federal suçlamaları kabul etti",
    "originLink": "https://www.wired.com/story/alan-filion-torswats-guilty-plea-federal-charges-swatting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168652",
    "commentBody": "",
    "originSummary": [
      "Alan Filion, Kaliforniya'dan 18 yaşında bir genç, okulları, dini kurumları ve ABD'li politikacıları hedef alan 375'ten fazla swatting saldırısı düzenlemekten federal suçlamaları kabul etti.- \"Torswats\" takma adı altında faaliyet gösteren Filion, ABD genelinde yaygın korku ve kaosa neden olan uluslararası bir swatting grubunun parçasıydı.- Her biri eyaletler arası tehdit oluşturma suçundan beş yıla kadar hapis cezasıyla karşı karşıya olan Filion'un ceza tarihi henüz belirlenmedi."
    ],
    "commentSummary": [
      "Bir genç, silahlı polis müdahalelerini tetiklemek için sahte acil durum çağrıları yapmayı içeren 375'ten fazla swatting olayını organize etmekten federal suçlamaları kabul etti.",
      "Genç, çevrimiçi takma adlar kullandı ve Telegram'da bu hizmetler için ücret aldı, bu da arama sahtekarlığının kolaylığını ve şiddetli çatışmalara yol açabilecek swatting tehlikelerini vurguluyor.",
      "Bu vaka, iyileştirilmiş polis müdahale protokollerine ve hesap verebilirliğe olan ihtiyacı vurgulamakta, ayrıca 20 yıllık bir ceza potansiyelini göstermekte, ancak fiili süre, gençlik durumu nedeniyle azaltılabilir."
    ],
    "points": 184,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1731890374
  },
  {
    "id": 42168997,
    "title": "Veri merkezinde TCP'yi değiştirme zamanı (2023)",
    "originLink": "https://arxiv.org/abs/2210.00714",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168997",
    "commentBody": "",
    "originSummary": [
      "Makale, modern veri merkezleri için TCP'yi (İletim Kontrol Protokolü) modası geçmiş olarak eleştiriyor ve akış yönelimi ile sıralı paket teslimi gibi sorunları dile getiriyor. Bu TCP sınırlamalarını ele alan ancak TCP ile API uyumlu olmayan Homa'yı bir alternatif olarak öneriyor. Homa'nın benimsenmesi, yaygın kullanım için daha erişilebilir hale getirilerek RPC (Uzaktan Yordam Çağrısı) çerçeveleri ile entegrasyon yoluyla kolaylaştırılabilir."
    ],
    "commentSummary": [
      "Veri merkezlerinde TCP'yi (İletim Kontrol Protokolü) değiştirmek, kapsamlı donanım desteği ve uzmanlık gereksinimi nedeniyle zordur. QUIC (Hızlı UDP İnternet Bağlantıları) ve InfiniBand gibi alternatifler mevcut olsa da, entegrasyon karmaşıklığı ve mevcut sistemlerle uyumluluk sorunları nedeniyle benimsenmeleri sınırlıdır. Sınırlamalarına rağmen, TCP'nin yerleşik varlığı ve yeni protokollere geçişin yüksek maliyeti, önümüzdeki dönemde veri merkezlerinde baskın olmaya devam edeceğini göstermektedir."
    ],
    "points": 172,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1731894161
  },
  {
    "id": 42168491,
    "title": "Şeker Hastalığımı Yönetmeme Yardımcı Olmak İçin Yaptığım Uygulama",
    "originLink": "https://apps.apple.com/gb/app/islet-diabetes/id6453168642",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168491",
    "commentBody": "",
    "originSummary": [
      "Joshua, bir öğrenci, şimdi App Store'da mevcut olan GPT-4o-mini destekli bir diyabet yönetim uygulaması olan Islet'i geliştirdi.",
      "Uygulama başlangıçta bir yaz projesiydi ve insülin yönetimi, karbonhidrat sayımı, kan şekeri takibi, kişiselleştirilmiş yemek önerileri ve aktivite takibi gibi özellikler sunuyor.",
      "Islet, özellikle Tip 1 diyabetli bireyler için, gerçek dünya sağlık sorunlarını ele almada yapay zekanın potansiyelini göstermektedir."
    ],
    "commentSummary": [
      "Joshua, bir öğrenci, insülin, karbonhidrat sayımları ve kan şekeri yönetimine yardımcı olmak için GPT-4o-mini kullanarak Islet adında bir diyabet yönetim uygulaması geliştirdi ve bu uygulama artık App Store'da mevcut. Uygulama, yemek önerileri sunar, aktiviteleri izler ve içgörüler sağlar, ancak hala erken aşamalarındadır ve iyileştirme için geri bildirimler memnuniyetle karşılanmaktadır. Uygulamanın tıbbi cihaz statüsü ve veri gizliliği konularında endişeler dile getirilmiş olup, bu tür sağlık yönetimi uygulamalarında bu sorunların ele alınmasının önemi vurgulanmaktadır."
    ],
    "points": 171,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1731888475
  },
  {
    "id": 42169615,
    "title": "Japon kara şirketlerinin işçileri nasıl ezdiği (2014)",
    "originLink": "https://www.tofugu.com/japan/japanese-black-companies/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169615",
    "commentBody": "",
    "originSummary": [
      "“Kara şirket” terimi, özellikle beyaz yakalı sektörlerde sömürücü iş yerlerini tanımlar ve Japonya'dan köken alarak 2000'lerin başında önem kazanmıştır. “Kara Şirketler Ödülü” 2012 yılında en kötü suçluları öne çıkarmak için oluşturulmuş olup, Watami Foodservice Co. sık sık kötü çalışan muamelesi nedeniyle tanınmıştır. Avukat Yoshiyuki Iwasa tarafından hazırlanan bir kontrol listesi, ödenmemiş fazla mesai ve kötü çalışma ortamları gibi kriterlerle kara şirketleri tanımlamaya yardımcı olurken, Japonya Sağlık, Çalışma ve Refah Bakanlığı bu sorunları ele almak için çalışmaktadır."
    ],
    "commentSummary": [
      "Japonya'daki \"kara şirketler\", çalışanları istifa etmeye çalıştıklarında yasal işlem tehdidiyle sömürerek zorlu bir çalışma ortamı yaratıyor.",
      "Sözleşmeli işçiler Japonya'da sözleşmeleri bitmeden önce işi bırakma konusunda yasal kısıtlamalarla karşı karşıya kalıyor, bu da daha geniş bir baskıcı iş kültürü sorununu gözler önüne seriyor.",
      "Amerikan \"isteğe bağlı\" istihdam modeli, çalışanların bildirimde bulunmadan ayrılmalarına izin verirken iş güvencesinin olmamasıyla tezat oluşturur ve istihdam ile sağlık hizmetleri arasındaki bağlantı nedeniyle daha da karmaşık hale gelir."
    ],
    "points": 170,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1731902533
  },
  {
    "id": 42169027,
    "title": "Japon işçiler istifa ajanslarına yöneliyor",
    "originLink": "https://metropolisjapan.com/resignation-agencies/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169027",
    "commentBody": "",
    "originSummary": [
      "Mynavi Corp. tarafından yapılan bir anket, Japonya'da istifa ajanslarının kullanımında bir artış olduğunu ve 20'li yaşlarındaki çalışanların %20'sinin işlerinden ayrılmak için bu hizmetleri kullandığını gösteriyor.",
      "İstifa ajansları, Momuri gibi, genç çalışanların zihinsel sağlıklarını olumsuz etkileyen işlerden ayrılmalarına yardımcı olur ve bir ücret karşılığında istifa sürecini yönetir.",
      "Bu eğilim, zihinsel sağlığı değerli bulma ve geleneksel Japon iş normlarını sorgulama yönünde nesiller arası bir değişimi ifade ediyor ve potansiyel olarak daha dengeli bir iş kültürüne yol açabilir."
    ],
    "commentSummary": [
      "Japon çalışanlar, bazı şirketlerin istifa etmek isteyen çalışanlar için engeller oluşturması nedeniyle işlerinden ayrılmalarına yardımcı olması için istifa ajanslarına başvuruyor.",
      "Bu eğilim, Japonya'nın iş ortamındaki kültürel zorlukların altını çizmektedir; burada çalışanlar, bir işten ayrılmaya çalıştıklarında sıklıkla suçluluk ve baskı hissetmektedirler.",
      "İstifa ajansları, çalışanların doğrudan yüzleşmeden kaçınmalarını sağlayarak istifa sürecini kolaylaştırır ve Japonya'nın iş kültürü ve bunun çalışanlar üzerindeki etkileri hakkında daha geniş tartışmalara katkıda bulunur."
    ],
    "points": 163,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1731894593
  },
  {
    "id": 42172281,
    "title": "Mutluluğu önceliklendirdikten sonra Bhutan, şimdi varoluşsal bir krizle karşı karşıya",
    "originLink": "https://www.cbsnews.com/news/bhutan-emigration-crisis-60-minutes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42172281",
    "commentBody": "",
    "originSummary": [
      "Bhutan, ücretsiz sağlık hizmetleri, eğitim ve büyüyen bir ekonomi sunmasına rağmen, özellikle Avustralya'da daha iyi iş fırsatları arayan gençlerin önemli bir göçüyle karşı karşıya.",
      "Bhutan Kralı, Danimarkalı mimar Bjarke Ingels tarafından tasarlanan Gelephu Farkındalık Şehri'ni geliştirerek, iş yaratmak ve gençleri geri çekmek amacıyla Bhutan değerlerine ve sürdürülebilir kalkınmaya odaklanmayı planlıyor.",
      "Bu projenin başarısı, Bhutan'ın geleceği için hayati önemde kabul ediliyor ve gazeteci Namgay Zam gibi bazı vatandaşlar, girişimi desteklemek ve ülkede kalmak için ilham alıyor."
    ],
    "commentSummary": [
      "Bhutan, materyalizm ve diğer kültürlere maruz kalmanın etkisiyle, daha iyi fırsatlar için yurt dışına giden gençlerin oluşturduğu bir trend yaşıyor.",
      "Brüt Ulusal Mutluluk odaklı olmasına rağmen, Bhutan ekonomik büyüme ve küreselleşmeden kaynaklanan zorluklarla karşı karşıya kalıyor, bu da eğitimli bireylerin daha yüksek kazançlar aramak için başka yerlere gitmesiyle beyin göçüne yol açıyor.",
      "Ülke, benzersiz kültürü, enerji kaynakları ve yeni bir şehir planları aracılığıyla gelecekteki gelişim için potansiyele sahip, ancak aynı zamanda etnik gerilimler ve ekonomik baskılar gibi önemli sorunlarla da karşı karşıya."
    ],
    "points": 161,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1731937987
  },
  {
    "id": 42168503,
    "title": "Müze Kötü Sanat",
    "originLink": "https://museumofbadart.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168503",
    "commentBody": "",
    "originSummary": [
      "Müze Kötü Sanat (MOBA), Boston'da bulunan ve mizahi bir şekilde kusurlu olan ve genellikle geleneksel müzelerde sergilenmeyen sanatı sergilemeye adanmış benzersiz bir müzedir.",
      "MOBA, Dorchester Brewing Co'nun içinde yer almakta olup, ziyaretçilerin hem sanatı hem de M&M Barbecue'dan gelen el yapımı biralar ve yiyecekler gibi bira fabrikasının sunduklarını ücretsiz olarak keyifle deneyimlemelerine olanak tanır.",
      "MOBA, WSBE RI PBS tarafından YouTube'da yayınlanan 7 dakikalık bir videoda yer alıyor ve kar amacı gütmeyen bir kuruluş olarak, misyonunu desteklemek için vergi indirimine tabi bağışlar kabul ediyor."
    ],
    "commentSummary": [
      "Müze Kötü Sanat (MOBA) Boston'da, geleneksel müzelerin reddedebileceği sanatı sergilemeye adanmıştır, hem yaratıcılığı hem de başarısızlığı kutlar.- MOBA hakkındaki görüşler karışıktır; bazıları onun benzersiz yaklaşımını takdir ederken, diğerleri amatör sanatçılarla alay edebileceği için eleştiriyor.- MOBA'nın koleksiyonu mizahı ve samimiyeti ile dikkat çeker ve Dorchester Brewing Co. içindeki konumunda ücretsiz giriş sunar."
    ],
    "points": 146,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1731888560
  },
  {
    "id": 42169418,
    "title": "Linux çekirdeği 6.12 yayınlandı",
    "originLink": "https://lwn.net/Articles/997958/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169418",
    "commentBody": "",
    "originSummary": [
      "6.12 çekirdeği, Linus Torvalds tarafından düzenli sürüm takvimine uygun olarak yayınlandı ve 2024 Uzun Vadeli Destek (LTS) sürümü olarak önem taşıyor. - Ana özellikler arasında Arm izin kaplama uzantısı desteği, geliştirilmiş Spectre hafifletmeleri ve sistem performansı ve güvenliğini artıran gerçek zamanlı önceliklendirme desteğinin tamamlanması yer alıyor. - Bu sürüm, dağıtımların Rust'ı etkinleştirmesini etkileyebilir ve Debian 13 ve türevlerinde kullanılmasının yanı sıra XFS dosya sisteminde daha büyük blok boyutlarının işlenmesi ve perf gibi performans araçlarında iyileştirmeler bekleniyor."
    ],
    "commentSummary": [
      "Linux çekirdeği 6.12, Uzun Vadeli Destek (LTS) sürümü olarak yayınlandı, bu da genişletilmiş bakım ve güncellemeler alacağı anlamına geliyor.",
      "Bu sürümün temel özellikleri arasında gerçek zamanlı destek, SCHED_EXT (yeni bir zamanlama sınıfı) ve Raspberry Pi 5 ile uyumluluk yer alıyor, bu da onu çeşitli donanımlar için daha kullanışlı hale getiriyor.",
      "Yayın, AM5 tabanlı iş istasyonları için faydalı olan X870E Taichi anakartlardaki ağ yongasını da destekliyor ve Linux çekirdeğinin her 8 haftada bir büyük sürümler şeklindeki tipik sürümleme şemasını takip ediyor."
    ],
    "points": 144,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1731899564
  }
]
