[
  {
    "id": 42167633,
    "title": "Rekayasa Balik Reboot Ketidakaktifan iOS 18",
    "originLink": "https://naehrdine.blogspot.com/2024/11/reverse-engineering-ios-18-inactivity.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42167633",
    "commentBody": "",
    "originSummary": [
      "iOS 18 telah memperkenalkan fitur reboot ketidakaktifan yang secara otomatis me-reboot iPhone setelah 3 hari tidak aktif untuk meningkatkan keamanan. Fitur ini mengubah perangkat dari keadaan After First Unlock (AFU) yang lebih rentan ke keadaan Before First Unlock (BFU) yang lebih aman, melindungi data pengguna. Secure Enclave Processor (SEP) memantau waktu buka kunci terakhir dan memicu reboot jika perangkat tidak aktif selama lebih dari 3 hari, secara efektif mengurangi risiko pencurian dan akses tidak sah, meskipun ini menimbulkan tantangan bagi penegak hukum dalam ekstraksi data."
    ],
    "commentSummary": [
      "iOS 18 memperkenalkan fitur keamanan yang me-reboot perangkat setelah tiga hari tidak aktif, mengembalikannya ke keadaan \"Sebelum Pembukaan Pertama\" (BFU) untuk meningkatkan perlindungan data.",
      "Fitur ini bertujuan untuk mencegah akses data yang tidak sah, memastikan data sensitif hanya dapat diakses setelah pengguna secara aktif membuka kunci, yang berdampak pada ekstraksi data oleh penegak hukum dan berpotensi menyulitkan pengguna.",
      "Tulisan tersebut mengeksplorasi keseimbangan antara langkah-langkah keamanan dan pengalaman pengguna, menyoroti tantangan dan implikasi dari fitur baru ini."
    ],
    "points": 457,
    "commentCount": 142,
    "retryCount": 0,
    "time": 1731880226
  },
  {
    "id": 42169998,
    "title": "Kami menutup Ondsel",
    "originLink": "https://ondsel.com/blog/goodbye/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169998",
    "commentBody": "",
    "originSummary": [
      "Ondsel akan ditutup pada 30 Oktober 2024, karena ketidakmampuan untuk mencapai kesuksesan komersial atau model bisnis yang berkelanjutan, meskipun ada dukungan dari komunitas.",
      "Kontribusi signifikan untuk FreeCAD meliputi meja kerja perakitan baru, pemecah batasan 3D, dan peningkatan pada Sketcher dan TechDraw, yang semuanya akan tetap bersifat open-source.",
      "Meskipun Ondsel ES tidak akan merilis v2024.3, mantan anggota tim akan terus berkontribusi pada FreeCAD, dan pengguna akan memiliki waktu untuk mengunduh data mereka sebelum server ditutup."
    ],
    "commentSummary": [
      "Ondsel, seorang kontributor untuk FreeCAD, sedang ditutup tetapi telah meninggalkan dampak positif pada pengembangan perangkat lunak tersebut.",
      "Diskusi menekankan tantangan yang dihadapi alat CAD sumber terbuka dalam bersaing dengan perangkat lunak komersial, menyoroti kebutuhan akan keterjangkauan dan antarmuka yang ramah pengguna.",
      "Meskipun Ondsel ditutup, komunitas menghargai kontribusinya dan tetap berharap untuk kemajuan berkelanjutan dalam solusi CAD sumber terbuka."
    ],
    "points": 291,
    "commentCount": 152,
    "retryCount": 0,
    "time": 1731908458
  },
  {
    "id": 42166606,
    "title": "Kenapa pengaturan Windows 95 menggunakan tiga sistem operasi?",
    "originLink": "https://devblogs.microsoft.com/oldnewthing/20241112-00/?p=110507",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42166606",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Pengaturan Windows 95 menggunakan tiga sistem operasi: DOS, versi minimal dari Windows 3.1, dan Windows 95, untuk memastikan kompatibilitas dan kemudahan instalasi. Proses instalasi dimulai dengan DOS, yang kemudian memulai lingkungan dasar Windows 3.1 untuk memfasilitasi instalasi Windows 95, memungkinkan peningkatan dari sistem yang lebih lama. Diskusi ini menyoroti evolusi Windows dan tantangan dalam menyeimbangkan kompatibilitas dengan pengenalan fitur-fitur baru."
    ],
    "points": 288,
    "commentCount": 159,
    "retryCount": 0,
    "time": 1731873264
  },
  {
    "id": 42171164,
    "title": "Saya dilarang dari akun aksesibilitas hCaptcha karena tidak buta (2023)",
    "originLink": "https://michaels.world/2023/11/i-was-banned-from-the-hcaptcha-accessibility-account-for-not-being-blind/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42171164",
    "commentBody": "",
    "originSummary": [
      "Seorang pengguna dilarang dari akun aksesibilitas hCaptcha meskipun ia buta, menyoroti potensi kekurangan dalam langkah-langkah aksesibilitas hCaptcha. Insiden ini menekankan risiko mengandalkan perusahaan yang mungkin dengan sengaja membuat produk mereka tidak dapat diakses, dengan solusi sementara yang tidak dapat diandalkan. Pengguna tersebut menyarankan kehati-hatian bagi mereka yang bergantung pada layanan semacam itu dan menyarankan untuk membagikan peringatan ini, terutama kepada webmaster yang menggunakan hCaptcha."
    ],
    "commentSummary": [
      "Seorang pengguna tunanetra dilarang dari akun aksesibilitas hCaptcha, menyoroti masalah dengan klaim dan sistem aksesibilitas hCaptcha.- Banyak pengguna, terlepas dari kemampuan visual, menemukan tantangan hCaptcha sulit dan diskriminatif, menimbulkan kekhawatiran tentang efektivitas dan inklusivitasnya.- Masalah yang lebih luas adalah ketidakmampuan akses dan ketidakefektifan captcha secara umum, dengan seruan untuk solusi yang lebih baik yang meningkatkan pengalaman pengguna dan privasi."
    ],
    "points": 254,
    "commentCount": 167,
    "retryCount": 0,
    "time": 1731924808
  },
  {
    "id": 42170740,
    "title": "Notebook HTML Reaktif",
    "originLink": "https://maxbo.me/a-html-file-is-all-you-need.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42170740",
    "commentBody": "",
    "originSummary": [
      "Artikel tersebut membahas penggunaan HTML sebagai platform terpadu untuk penerbitan ilmiah, menghilangkan kebutuhan akan berbagai alat seperti Jupyter atau LaTeX. Artikel ini menampilkan pembuatan notebook HTML reaktif dengan elemen interaktif menggunakan pustaka seperti Observable, Pyodide, dan WebR. Potensi HTML untuk menyederhanakan proses penerbitan disorot, dengan menyebutkan pustaka @celine/celine untuk pengembangan lebih lanjut."
    ],
    "commentSummary": [
      "Diskusi berpusat pada penggunaan HTML sebagai dasar untuk buku catatan komputasi, dengan kritik terhadap implementasi saat ini dan saran untuk sistem yang lebih deklaratif yang disebut Heximal.",
      "Perbandingan dilakukan dengan alat yang ada seperti Jupyter, Pluto, dan Raku, menyoroti tantangan dalam hal persistensi dan ergonomi.",
      "Terdapat antusiasme terhadap potensi analisis data eksploratif dan penerbitan, tetapi kekhawatiran tentang kompleksitas yang diperkenalkan oleh teknologi web juga diangkat."
    ],
    "points": 227,
    "commentCount": 36,
    "retryCount": 0,
    "time": 1731918812
  },
  {
    "id": 42168166,
    "title": "Mesin JavaScript Nova",
    "originLink": "https://github.com/trynova/nova",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168166",
    "commentBody": "",
    "originSummary": [
      "Sebuah mesin JavaScript baru sedang dikembangkan menggunakan desain berorientasi data, yang mengoptimalkan penyimpanan dan akses data. Fitur utama termasuk penyimpanan data dalam vektor khusus tipe dan penggunaan indeks yang dibedakan berdasarkan tipe untuk referensi heap, meningkatkan kinerja. Objek dibagi menjadi vektor khusus jenis dan dipecah untuk menghindari pembacaan bagian yang tidak digunakan, meningkatkan efisiensi."
    ],
    "commentSummary": [
      "Nova adalah mesin JavaScript eksperimental yang menggunakan desain berorientasi data, mengorganisir data ke dalam vektor spesifik tipe untuk meningkatkan efisiensi dan kinerja.",
      "Berbeda dengan mesin tradisional seperti V8, Nova berfokus pada penyimpanan data yang kompak dan menghindari celah penyelarasan, meskipun saat ini tidak memiliki kompilator Just-In-Time (JIT) dan menggunakan interpreter bytecode.",
      "Tugas proyek ini adalah untuk menerapkan spesifikasi ECMAScript secara lengkap, dengan pengembangan yang sedang berlangsung dan rencana masa depan untuk tolok ukur dan perbandingan kinerja."
    ],
    "points": 195,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1731884845
  },
  {
    "id": 42166948,
    "title": "Anda bisa saja merancang pengkodean posisi yang mutakhir",
    "originLink": "https://fleetwood.dev/posts/you-could-have-designed-SOTA-positional-encoding",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42166948",
    "commentBody": "",
    "originSummary": [
      "The post examines the development of positional encoding in transformer models, emphasizing Rotary Positional Encoding (RoPE) used in advanced models like LLama 3.2. Ini membahas pentingnya informasi posisi dalam mekanisme self-attention untuk memahami hubungan token, membandingkan berbagai metode encoding dan keterbatasannya. RoPE diperkenalkan sebagai metode yang mengkodekan posisi relatif melalui rotasi, meningkatkan kinerja tanpa mengubah informasi semantik, dengan potensi perluasan ke data multi-dimensi."
    ],
    "commentSummary": [
      "Teks ini membahas tentang pengkodean posisi dalam transformer, menyoroti perannya dalam membantu model memahami urutan token, yang penting untuk menghitung skor perhatian dalam mekanisme Query, Key, Value (QKV). Berbagai skema pengkodean, seperti RoPE, disebutkan karena kemampuannya untuk memungkinkan posisi token yang fleksibel tanpa perlu melatih ulang model. Para peserta berbagi pengalaman dan tantangan dalam mengimplementasikan pengkodean ini dan menyatakan apresiasi atas klarifikasi yang diberikan, dengan sumber daya tambahan dan diskusi tentang topik terkait seperti pengkodean konteks dan efisiensi metode pengkodean yang disertakan."
    ],
    "points": 195,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1731875486
  },
  {
    "id": 42168652,
    "title": "Remaja di balik ratusan serangan swatting mengaku bersalah atas tuduhan federal",
    "originLink": "https://www.wired.com/story/alan-filion-torswats-guilty-plea-federal-charges-swatting/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168652",
    "commentBody": "",
    "originSummary": [
      "Alan Filion, seorang pemuda berusia 18 tahun dari California, mengaku bersalah atas tuduhan federal karena melakukan lebih dari 375 serangan swatting, yang menargetkan sekolah, institusi keagamaan, dan politisi AS. Beroperasi dengan nama samaran \"Torswats,\" Filion adalah bagian dari kelompok swatting internasional, yang menyebabkan ketakutan dan kekacauan luas di seluruh AS. Dia menghadapi hukuman hingga lima tahun penjara untuk masing-masing dari empat tuduhan membuat ancaman antarnegara bagian, dengan tanggal penjatuhan hukuman yang belum ditentukan."
    ],
    "commentSummary": [
      "Seorang remaja telah mengaku bersalah atas tuduhan federal karena mengatur lebih dari 375 insiden swatting, yang melibatkan membuat panggilan darurat palsu untuk memicu respons polisi bersenjata.",
      "Remaja tersebut menggunakan alias online dan mengenakan biaya untuk layanan ini di Telegram, menyoroti kemudahan pemalsuan panggilan dan bahaya swatting, yang dapat menyebabkan konfrontasi kekerasan.",
      "Kasus ini menekankan perlunya peningkatan protokol respons polisi dan akuntabilitas, serta potensi hukuman 20 tahun, meskipun waktu sebenarnya mungkin dikurangi karena status remaja."
    ],
    "points": 184,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1731890374
  },
  {
    "id": 42168997,
    "title": "Sudah saatnya mengganti TCP di pusat data (2023)",
    "originLink": "https://arxiv.org/abs/2210.00714",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168997",
    "commentBody": "",
    "originSummary": [
      "Tulisan ini mengkritik TCP (Transmission Control Protocol) sebagai usang untuk pusat data modern, dengan menyebutkan masalah seperti orientasi aliran dan pengiriman paket berurutan. - Ini mengusulkan Homa sebagai pengganti, yang mengatasi keterbatasan TCP ini tetapi tidak kompatibel dengan API TCP. - Adopsi Homa dapat difasilitasi melalui integrasi dengan kerangka kerja RPC (Remote Procedure Call), membuatnya lebih mudah diakses untuk penggunaan yang luas."
    ],
    "commentSummary": [
      "Menggantikan TCP (Transmission Control Protocol) di pusat data sulit dilakukan karena memerlukan dukungan perangkat keras yang luas dan keahlian khusus. Meskipun ada alternatif seperti QUIC (Quick UDP Internet Connections) dan InfiniBand, adopsi mereka terbatas karena kompleksitas integrasi dan masalah kompatibilitas dengan sistem yang ada. Meskipun memiliki keterbatasan, keberadaan TCP yang sudah mapan dan tingginya biaya untuk beralih ke protokol baru menunjukkan bahwa TCP akan terus mendominasi pusat data di masa mendatang."
    ],
    "points": 172,
    "commentCount": 126,
    "retryCount": 0,
    "time": 1731894161
  },
  {
    "id": 42168491,
    "title": "Terapkan yang Saya Bangun untuk Membantu Mengelola Diabetes Saya",
    "originLink": "https://apps.apple.com/gb/app/islet-diabetes/id6453168642",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168491",
    "commentBody": "",
    "originSummary": [
      "Joshua, seorang pelajar, telah mengembangkan Islet, sebuah aplikasi manajemen diabetes yang didukung oleh GPT-4o-mini, yang sekarang tersedia di App Store.",
      "App ini awalnya merupakan proyek musim panas dan menawarkan fitur-fitur seperti manajemen insulin, penghitungan karbohidrat, pelacakan gula darah, saran makanan yang dipersonalisasi, dan pelacakan aktivitas.",
      "Islet menunjukkan potensi AI dalam menangani masalah kesehatan dunia nyata, terutama bagi individu dengan diabetes Tipe 1."
    ],
    "commentSummary": [
      "Joshua, seorang pelajar, mengembangkan Islet, sebuah aplikasi manajemen diabetes menggunakan GPT-4o-mini, yang kini tersedia di App Store, untuk membantu mengelola insulin, hitungan karbohidrat, dan kadar gula darah. Aplikasi ini memberikan saran makanan, melacak aktivitas, dan menawarkan wawasan, namun masih dalam tahap awal, dengan umpan balik diterima untuk perbaikan. Kekhawatiran telah muncul mengenai statusnya sebagai perangkat medis dan privasi data, menyoroti pentingnya menangani masalah ini dalam aplikasi manajemen kesehatan."
    ],
    "points": 171,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1731888475
  },
  {
    "id": 42169615,
    "title": "Bagaimana perusahaan hitam Jepang menindas pekerja (2014)",
    "originLink": "https://www.tofugu.com/japan/japanese-black-companies/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169615",
    "commentBody": "",
    "originSummary": [
      "Teks tersebut menjelaskan istilah \"perusahaan hitam\" yang menggambarkan tempat kerja yang eksploitatif, terutama di industri kerah putih, yang berasal dari Jepang dan menjadi terkenal pada awal 2000-an. \"Penghargaan Perusahaan Hitam\" dibuat pada tahun 2012 untuk menyoroti pelanggar terburuk, dengan Watami Foodservice Co. sering diakui karena perlakuan buruk terhadap karyawan. Daftar periksa oleh pengacara Yoshiyuki Iwasa membantu mengidentifikasi perusahaan hitam, dengan kriteria seperti lembur yang tidak dibayar dan lingkungan kerja yang abusif, sementara Kementerian Kesehatan, Tenaga Kerja, dan Kesejahteraan Jepang sedang berupaya mengatasi masalah ini."
    ],
    "commentSummary": [
      "Perusahaan 'hitam' Jepang mengeksploitasi pekerja dengan mengancam tindakan hukum jika mereka mencoba untuk berhenti, menciptakan lingkungan kerja yang menantang.",
      "Para pekerja kontrak di Jepang menghadapi pembatasan hukum untuk berhenti sebelum kontrak mereka berakhir, yang menyoroti masalah yang lebih luas dari budaya kerja yang menekan.",
      "Model ketenagakerjaan \"at-will\" di Amerika Serikat dikontraskan, memungkinkan karyawan untuk pergi tanpa pemberitahuan tetapi kurangnya keamanan kerja, dan semakin rumit dengan adanya kaitan antara pekerjaan dan layanan kesehatan."
    ],
    "points": 170,
    "commentCount": 209,
    "retryCount": 0,
    "time": 1731902533
  },
  {
    "id": 42169027,
    "title": "Para pekerja Jepang beralih ke agen pengunduran diri",
    "originLink": "https://metropolisjapan.com/resignation-agencies/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169027",
    "commentBody": "",
    "originSummary": [
      "Sebuah survei oleh Mynavi Corp. menunjukkan peningkatan penggunaan agen pengunduran diri di Jepang, dengan 20% pekerja berusia 20-an menggunakan layanan ini untuk berhenti dari pekerjaan mereka.",
      "Agensi pengunduran diri, seperti Momuri, membantu pekerja muda untuk meninggalkan pekerjaan yang berdampak negatif pada kesehatan mental mereka, dengan mengelola proses pengunduran diri dengan biaya tertentu.",
      "Tren ini menandakan pergeseran generasi menuju penghargaan terhadap kesejahteraan mental dan menantang norma kerja tradisional Jepang, yang berpotensi mengarah pada budaya kerja yang lebih seimbang."
    ],
    "commentSummary": [
      "Para pekerja Jepang beralih ke agen pengunduran diri untuk membantu mereka berhenti dari pekerjaan, karena beberapa perusahaan menciptakan hambatan bagi karyawan yang ingin mengundurkan diri.",
      "Tren ini menyoroti tantangan budaya dalam lingkungan kerja di Jepang, di mana karyawan sering mengalami rasa bersalah dan tekanan ketika mencoba untuk meninggalkan pekerjaan.",
      "Agensi pengunduran diri memfasilitasi proses pengunduran diri, memungkinkan karyawan untuk menghindari konfrontasi langsung, dan berkontribusi pada diskusi yang lebih luas tentang budaya kerja di Jepang dan dampaknya terhadap karyawan."
    ],
    "points": 163,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1731894593
  },
  {
    "id": 42172281,
    "title": "Bhutan, setelah memprioritaskan kebahagiaan, kini menghadapi krisis eksistensial",
    "originLink": "https://www.cbsnews.com/news/bhutan-emigration-crisis-60-minutes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42172281",
    "commentBody": "",
    "originSummary": [
      "Bhutan mengalami emigrasi yang signifikan dari kaum muda, meskipun menawarkan layanan kesehatan gratis, pendidikan, dan ekonomi yang berkembang, karena mereka mencari peluang kerja yang lebih baik di luar negeri, terutama di Australia.",
      "Dalam menanggapi hal tersebut, raja Bhutan berencana untuk mengembangkan Gelephu Mindfulness City, yang dirancang oleh arsitek Denmark Bjarke Ingels, untuk menciptakan lapangan kerja dan menarik kembali kaum muda, dengan fokus pada pembangunan berkelanjutan dan nilai-nilai Bhutan.",
      "Keberhasilan proyek ini dianggap penting untuk masa depan Bhutan, dengan beberapa warga, seperti jurnalis Namgay Zam, terinspirasi untuk mendukung inisiatif tersebut dan tetap tinggal di negara itu."
    ],
    "commentSummary": [
      "Bhutan sedang mengalami tren di mana kaum muda meninggalkan negara tersebut untuk mencari peluang yang lebih baik di luar negeri, didorong oleh materialisme dan paparan terhadap budaya lain.",
      "Terlepas dari fokusnya pada Kebahagiaan Nasional Bruto, Bhutan menghadapi tantangan dari pertumbuhan ekonomi dan globalisasi, yang mengakibatkan terjadinya brain drain karena individu terdidik mencari penghasilan lebih tinggi di tempat lain.",
      "Negara ini memiliki potensi untuk pengembangan di masa depan melalui budaya uniknya, sumber daya energi, dan rencana untuk kota baru, tetapi juga menghadapi masalah signifikan seperti ketegangan etnis dan tekanan ekonomi."
    ],
    "points": 161,
    "commentCount": 174,
    "retryCount": 0,
    "time": 1731937987
  },
  {
    "id": 42168503,
    "title": "Museum Seni Buruk",
    "originLink": "https://museumofbadart.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42168503",
    "commentBody": "",
    "originSummary": [
      "The Museum Of Bad Art (MOBA) adalah museum unik di Boston yang didedikasikan untuk memamerkan seni yang memiliki cacat secara humoris dan biasanya tidak akan dipajang di museum tradisional.",
      "Terletak di dalam Dorchester Brewing Co, MOBA menawarkan masuk gratis, memungkinkan pengunjung untuk menikmati seni dan penawaran dari pabrik bir tersebut, seperti bir kerajinan dan makanan dari M&M Barbecue.",
      "MOBA ditampilkan dalam video berdurasi 7 menit oleh WSBE RI PBS di YouTube, dan sebagai organisasi nirlaba, MOBA menerima donasi yang dapat dikurangkan dari pajak untuk mendukung misinya."
    ],
    "commentSummary": [
      "The Museum of Bad Art (MOBA) di Boston didedikasikan untuk menampilkan seni yang mungkin ditolak oleh museum tradisional, merayakan baik kreativitas maupun kegagalan. Pendapat tentang MOBA beragam; beberapa orang menghargai pendekatannya yang unik, sementara yang lain mengkritiknya karena berpotensi mengejek seniman amatir. Koleksi MOBA dikenal karena humornya dan ketulusannya, dan menawarkan masuk gratis di lokasinya di dalam Dorchester Brewing Co."
    ],
    "points": 146,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1731888560
  },
  {
    "id": 42169418,
    "title": "Kernel Linux 6.12 telah dirilis",
    "originLink": "https://lwn.net/Articles/997958/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42169418",
    "commentBody": "",
    "originSummary": [
      "Teks: Kernel 6.12 telah dirilis oleh Linus Torvalds, sesuai dengan jadwal rilis reguler, dan signifikan sebagai versi Long-Term Support (LTS) tahun 2024. Fitur utama termasuk dukungan untuk ekstensi overlay izin Arm, peningkatan mitigasi Spectre, dan penyelesaian dukungan preemption realtime, yang meningkatkan kinerja dan keamanan sistem. Rilis ini mungkin mempengaruhi distribusi untuk mengaktifkan Rust dan diharapkan akan digunakan dalam Debian 13 dan turunannya, dengan peningkatan dalam menangani ukuran blok yang lebih besar dalam sistem file XFS dan alat kinerja seperti perf."
    ],
    "commentSummary": [
      "Kernel Linux 6.12 telah dirilis sebagai versi Dukungan Jangka Panjang (LTS), yang berarti akan menerima pemeliharaan dan pembaruan yang diperpanjang.",
      "Fitur utama dari rilis ini mencakup dukungan waktu nyata, SCHED_EXT (kelas penjadwalan baru), dan kompatibilitas dengan Raspberry Pi 5, yang meningkatkan kegunaannya untuk berbagai perangkat keras.",
      "Tampilan ini juga mendukung chip jaringan di motherboard X870E Taichi, yang bermanfaat untuk workstation berbasis AM5, dan mengikuti skema penomoran versi kernel Linux yang biasanya merilis versi utama setiap 8 minggu."
    ],
    "points": 144,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1731899564
  }
]
