[
  {
    "id": 37224042,
    "title": "İlk uyumlu M1 GPU sürücüsü",
    "originLink": "https://rosenzweig.io/blog/first-conformant-m1-gpu-driver.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224042",
    "commentBody": "",
    "originSummary": [
      "Asahi Linux, M1 ve M2 ailesi GPU'lar için Linux üzerindeki tüm OpenGL ES 3.1 uygulamalarıyla uyumluluk sağlayan uyumlu OpenGL ES 3.1 sürücülerini yayınladı.",
      "Bu sürücüler, endüstri standardı testlerden geçtikten sonra standartlar kuruluşu Khronos tarafından tanınmıştır.",
      "Asahi Linux'un uygulaması, M1 GPU'da görüntü atomikleri için donanım talimatları olmamasına rağmen, görüntüler üzerinde hesaplama gölgelendiricileri ve atomikler için destek içerir."
    ],
    "commentSummary": [
      "Tartışma, Adobe'nin ürünlerine yönelik eleştiriler de dahil olmak üzere Apple'ın standartlara bağlılığını ele alıyor.",
      "Apple'ın protokoller ve formatlar üzerindeki kontrolü ile Vulkan ve Metal grafik API'leri arasındaki farklar da ele alınıyor.",
      "Konuşmada ayrıca Apple'ın çiplerinin tersine mühendisliği, Apple Silicon için sürücülerin geliştirilmesi, Apple'ın ekosistemiyle ilgili hayal kırıklıkları ve alternatif arayışları gibi konular da ele alınıyor."
    ],
    "points": 1330,
    "commentCount": 554,
    "retryCount": 0,
    "time": 1692717789
  },
  {
    "id": 37222191,
    "title": "Microsoft Python'u Excel'e getiriyor",
    "originLink": "https://www.theverge.com/2023/8/22/23841167/microsoft-excel-python-integration-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222191",
    "commentBody": "",
    "originSummary": [
      "Microsoft, veri analizi ve görselleştirme yeteneklerini geliştirmek için Python'u Excel'e entegre ediyor.",
      "Kullanıcılar artık Python verilerini formüller, grafikler ve PivotTable'lar kullanarak doğrudan Excel'de işleyebilir ve analiz edebilir.",
      "Entegrasyon Microsoft 365 Insiders Beta Kanalında mevcuttur ve gelecekte diğer platformlara da sunulacaktır."
    ],
    "commentSummary": [
      "Microsoft, Python desteğini Excel'e entegre ederek kullanıcıların elektronik tablo yazılımı içinde Python işlevlerinden yararlanmasını sağlıyor.",
      "Kullanıcılar karışık tepkiler verirken, bazıları yeni yeteneklerden heyecan duydu, bazıları ise endişelerini dile getirdi.",
      "Endişeler arasında başlangıç zorluğu, sınırlı erişilebilir örnekler ve potansiyel veri güvenliği sorunları yer almaktadır.",
      "Bazı kullanıcılar Excel'de daha gelişmiş veri analizi özellikleri isterken, diğerleri belirli görevler için Excel kullanmanın sınırlamalarını ve hayal kırıklıklarını tartışıyor.",
      "Bulut tabanlı yaklaşım ve Python'un Excel'de çalıştırılmasıyla ilgili potansiyel uyumluluk sorunları ve güvenlik endişeleri de gündeme getirilmiştir.",
      "Genel olarak, özellik Excel'in yeteneklerini geliştirmeyi ve işlevselliğini genişletmeyi amaçlıyor, ancak etkileri hakkında görüşler bölünmüş durumda."
    ],
    "points": 780,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1692709809
  },
  {
    "id": 37222672,
    "title": "Hackerlar kredi bürolarını kullanarak Amerika'daki neredeyse herkesi ifşa edebilir",
    "originLink": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222672",
    "commentBody": "",
    "originSummary": [
      "Bilgisayar korsanları kredi bürolarına sızıyor ve adresler, telefon numaraları, e-posta adresleri ve Sosyal Güvenlik numaraları dahil olmak üzere kişisel bilgileri satıyor.",
      "Bu verilere erişmek için kullanılan araç, Bitcoin'de 15 $ gibi düşük bir fiyata mevcut ve bu da onu suçlular için erişilebilir kılıyor.",
      "Çalınan veriler, swatting, SIM swapping ve fiziksel şiddet gibi çeşitli suçlar için kullanılabilir.",
      "TLOxp, Data-Trac, SearchBug ve USinfoSearch gibi kredi büroları ve veri simsarları, kişisel verilerin satışına karıştıkları için inceleme altına alındı.",
      "Kanun yapıcılar bu uygulamanın önlenmesi için harekete geçilmesi çağrısında bulunuyor ve Tüketici Finansal Koruma Bürosu, kredi başlık verilerinin ticaretini düzenlemek için yeni kurallar önerdi.",
      "Bu değişikliklerin sorunu ele almadaki etkinliği belirsizliğini korumaktadır."
    ],
    "commentSummary": [
      "Tartışma, Amerika Birleşik Devletleri'ndeki kredi bürolarının gevşek veri koruma önlemlerine ilişkin endişeleri vurgulamaktadır.",
      "Rapor, kredilerin dondurulmasının önündeki zorluklara ve daha iyi güvenlik önlemleri ve düzenlemelere duyulan ihtiyaca değinmektedir.",
      "Kimlik hırsızlığının zorlukları, dolandırıcılığın sonuçlarına ilişkin sorumluluk ve mevcut güvenlik önlemlerinin sınırlılıkları hakkında bir konuşma yapıldı."
    ],
    "points": 536,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1692712121
  },
  {
    "id": 37220667,
    "title": "Rakamların sağduyunun yerini almadığı iyi bir ölçüm kültürü",
    "originLink": "https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37220667",
    "commentBody": "",
    "originSummary": [
      "KPI (anahtar performans göstergesi) psikozu, kararların yalnızca verilere dayandırıldığı ve gerçeklikten kopuk olduğu teknoloji şirketlerinde yaygın bir sorundur.",
      "Şirketler, insani önyargıların üstesinden gelmek için büyük ölçüde verilere güvenmektedir, ancak karar vermenin tek temeli olarak KPI'ları kullanmanın sınırlamaları vardır.",
      "Makale, sezgi ve verileri birleştiren, KPI'ların güvenilirliği üzerinde sürekli düşünen ve sadece KPI'nın kendisine değil asıl hedefe odaklanan bir çözüm önermektedir."
    ],
    "commentSummary": [
      "Kuruluşlarda başarı ve performansı ölçmek için yalnızca metriklere ve KPI'lara güvenmenin sınırlamaları vardır.",
      "Performansı değerlendirirken ölçütler ve sağduyu arasında bir denge sağlamak önemlidir.",
      "Ölçümlere ek olarak düzenli iletişim ve geri bildirim gibi alternatif yöntemler de etkili olabilir."
    ],
    "points": 472,
    "commentCount": 424,
    "retryCount": 0,
    "time": 1692698989
  },
  {
    "id": 37227139,
    "title": "GPT-3.5 Turbo ince ayarı ve API güncellemeleri",
    "originLink": "https://openai.com/blog/gpt-3-5-turbo-fine-tuning-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227139",
    "commentBody": "",
    "originSummary": [
      "OpenAI, GPT-3.5 Turbo modeli için ince ayar adı verilen ve geliştiricilerin belirli kullanım durumları için özelleştirmesine olanak tanıyan yeni bir özellik sundu.",
      "İlk testler, GPT-3.5 Turbo'nun ince ayarlı bir versiyonunun belirli görevlerde temel GPT-4 modelinden daha iyi performans gösterebileceğini göstermiştir.",
      "İnce ayar, daha fazla yönlendirilebilirlik, güvenilir çıktı biçimlendirme ve tonu özelleştirme yeteneği gibi avantajlar sunar. Güncellenmiş model ayrıca 4k jetonların işlenmesini destekler ve hızlı boyut küçültme yoluyla maliyet tasarrufu sağlar.",
      "OpenAI, ince ayar için fiyatlandırma ayrıntılarını yayınladı ve güncellenmiş GPT-3 modellerinin kullanılabilirliğini duyurdu.",
      "OpenAI, ince ayarlı modellerin güvenli bir şekilde konuşlandırılmasını sağlamak için moderasyon sistemleri uyguladı ve yakında bir ince ayar kullanıcı arayüzü başlatmayı planlıyor."
    ],
    "commentSummary": [
      "OpenAI, GPT-3.5 Turbo modeli ince ayarı ve API'sinde güncellemeler yaparak modelin belirli stilleri ve bilgileri öğrenmesini sağladı.",
      "İnce ayarın sınırlamaları ve potansiyel önyargıları vardır, bu nedenle OpenAI bunun yerine belirli görevler için geri çağırmayı kullanmayı önerir.",
      "İnce ayar geleneksel yöntemlerden daha az güçlü ancak daha ucuz olabilir, ancak her zaman daha iyi sonuçlar vermeyebilir ve önyargılara yol açabilir. OpenAI gelecekte GPT4 ince ayarını yayınlamayı planlamaktadır."
    ],
    "points": 363,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1692730957
  },
  {
    "id": 37230619,
    "title": "ZFS sayesinde sadece 10 dakikalık veri kaybettim",
    "originLink": "https://mastodon.social/@chromakode/110936177254839251",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37230619",
    "commentBody": "",
    "originSummary": [
      "Yazar, dizüstü bilgisayarındaki bir SSD arızası ile ilgili deneyimlerini ve ZFS artımlı çoğaltma kullanarak verilerini nasıl başarıyla kurtardıklarını paylaşıyor.",
      "Yazıda AMD CPU'ların onarılabilirliği ve güç verimliliğinin yanı sıra farklı depolama genişletme ve yedekleme stratejileri ele alınıyor.",
      "Sohbet, sürücüleri çoğaltmanın ve donanım sorunlarını gidermenin faydalarını ve zorluklarını araştırırken, alternatif araçlardan ve btrfs gibi diğer dosya sistemleriyle ilgili endişelerden de bahsediyor."
    ],
    "commentSummary": [
      "Tartışma, NAS kurulumları için özellikle ZFS'ye odaklanarak farklı dosya sistemlerinin kullanımı hakkındadır.",
      "Kullanıcılar veri kaybı ve bozulmasıyla ilgili kişisel deneyimlerini paylaşıyor, çeşitli dosya sistemleri ve yedekleme stratejilerinin artılarını ve eksilerini tartışıyor.",
      "Sürücü sağlığını izlemenin ve yedekleri düzenli olarak test etmenin önemi vurgulanmakta ve ZFS ile ECC RAM ihtiyacı tartışılmaktadır."
    ],
    "points": 318,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692752433
  },
  {
    "id": 37222393,
    "title": "Federaller TikTok'tan çok sayıda yerel casusluk özelliği istedi",
    "originLink": "https://gizmodo.com/tiktok-cfius-draft-agreement-shows-spying-requests-1850759715",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222393",
    "commentBody": "",
    "originSummary": [
      "Forbes tarafından ele geçirilen sızdırılmış bir anlaşma taslağına göre, ABD hükümeti TikTok ile kendilerine uygulamanın operasyonları üzerinde önemli kontrol ve erişim sağlayacak bir anlaşma yapmak istedi.",
      "Anlaşma, ABD kurumlarına TikTok'un kayıtlarını ve sunucularını inceleme, yönetici atamalarını veto etme ve uygulamanın hizmet şartlarında değişiklik talep etme gibi geniş yetkiler verecekti.",
      "Hükümetin talepleri, genellikle Çin ile ilişkilendirilen gözetleme taktiklerini andırdığı için eleştirilere neden oldu. TikTok ve Amerika Birleşik Devletleri Yabancı Yatırım Komitesi (CFIUS) taslak anlaşma hakkında yorum yapmayı reddetti."
    ],
    "commentSummary": [
      "TikTok'un Amerika Birleşik Devletleri'nde yasaklanması, gözetim, veri gizliliği ve Çin hükümetinin etkisi hakkında bir tartışma başlattı.",
      "Bazıları yasağın rekabetten kaynaklandığını savunurken, diğerleri ulusal güvenlikle ilgili endişelerini dile getiriyor.",
      "Amerikan istihbarat servislerinin güvenilirliği ve sosyal medya platformlarının kamuoyu üzerindeki etkisi konusunda tartışmalar var."
    ],
    "points": 310,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1692710807
  },
  {
    "id": 37222823,
    "title": "Prettymapp - Streamlit web uygulamasında OpenStreetMap verilerinden haritalar oluşturun",
    "originLink": "https://github.com/chrieke/prettymapp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222823",
    "commentBody": "",
    "originSummary": [
      "Prettymapp, OpenStreetMap verilerini kullanarak çarpıcı haritalar üreten bir web uygulaması ve Python paketidir.",
      "prettymaps projesinin daha hızlı ve kullanıcı dostu bir versiyonudur.",
      "Paket, kişiselleştirilmiş özelleştirme ve geliştirme amaçları için Python uygulamalarına entegre edilebilir."
    ],
    "commentSummary": [
      "Prettymapp, kullanıcıların OpenStreetMap verilerini kullanarak haritalar oluşturmasını sağlayan bir web uygulamasıdır.",
      "Uygulama, Hacker News'te bahsedildikten sonra dikkat çekmiş ve olumlu geri bildirimler almıştır.",
      "Bazı kullanıcılar uygulamayı yerel olarak çalıştırırken teknik zorluklarla karşılaştı, bu da tartışmalara ve alternatif harita özelleştirme araçlarının paylaşılmasına neden oldu.",
      "Kullanıcıların uygulamanın lisansı hakkında soruları vardı.",
      "Hacker News'ten gelen trafikteki artış, uygulamanın geçici olarak çökmesine neden oldu."
    ],
    "points": 287,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1692712738
  },
  {
    "id": 37227172,
    "title": "Experian, devre dışı bırakma seçeneği olmayan spam e-postalar nedeniyle FTC ve DOJ tarafından 650 bin dolar para cezasına çarptırıldı",
    "originLink": "https://www.theverge.com/2023/8/22/23841646/experian-fined-spam-emails-ftc-doj",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227172",
    "commentBody": "",
    "originSummary": [
      "Bir kredi raporlama kuruluşu olan Experian, spam yasalarını ihlal ettiği ve pazarlama e-postaları için devre dışı bırakma seçeneği sunmadığı için ABD hükümeti tarafından 650.000 dolar para cezasına çarptırıldı.",
      "Federal Ticaret Komisyonu (FTC), Experian'ın müşterilerine ücretsiz kredi izleme üyelikleri ile aldatıcı pazarlama e-postaları gönderdiğini, açık bir bildirim ve vazgeçme mekanizması olmadığını keşfetti.",
      "Sonuç olarak, Adalet Bakanlığı (DOJ) Experian'a karşı belirli mesaj türlerini yasaklayan ve pazarlama e-postalarında açık devre dışı bırakma seçenekleri gerektiren kalıcı bir ihtiyati tedbir kararı aldı."
    ],
    "commentSummary": [
      "Bir kredi raporlama şirketi olan Experian, vazgeçme seçeneği olmayan spam e-postalar gönderdiği için FTC ve DOJ tarafından 650.000 $ para cezasına çarptırıldı.",
      "Eleştirmenler, para cezasının Experian'ın gelirine kıyasla çok küçük olduğuna inanıyor ve diğer şirketlerin benzer davranışlarını caydırmak için daha büyük cezaların gerekli olduğunu öne sürüyor.",
      "Spam e-postalarda devre dışı bırakma seçeneğinin bulunmaması yönetmeliklerin ihlali anlamına gelmekte ve düzenleyici makamlar tarafından para cezası uygulanmasına yol açmaktadır."
    ],
    "points": 261,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692731064
  },
  {
    "id": 37224651,
    "title": "Slog ile yapılandırılmış günlük kaydı",
    "originLink": "https://go.dev/blog/slog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224651",
    "commentBody": "",
    "originSummary": [
      "Go 1.21'deki yeni log/slog paketi, standart kütüphaneye yapılandırılmış günlük kaydı özelliğini getirmektedir.",
      "Yapılandırılmış günlükler, kolay ayrıştırma, filtreleme, arama ve analiz için anahtar-değer çiftlerini kullanır.",
      "Paket, Go ekosisteminde yapılandırılmış günlük kaydı için farklı günlük seviyeleri ve özelleştirilebilir çıktı formatı seçenekleriyle standartlaştırılmış bir çerçeve oluşturmayı amaçlamaktadır."
    ],
    "commentSummary": [
      "Bu tartışma Go'da yapılandırılmış günlük tutma ve günlük tutma kütüphaneleri tarafından kullanılan çeşitli yaklaşımlara odaklanmaktadır.",
      "Yapılandırılmış günlük kaydının faydaları ve standartlaştırılmış günlük formatları ile API'lerin önemi vurgulanmaktadır.",
      "Katılımcılar hata işleme ve çağrı yığınlarının önemi hakkındaki görüşlerini paylaşmaktadır. Günlük görselleştirme için bazı mevcut araçlardan bahsedilmiş ve günlük verimliliğini artırmaya yönelik öneriler sunulmuştur."
    ],
    "points": 260,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692720123
  }
]
