[
  {
    "id": 37224042,
    "title": "Driver GPU M1 pertama yang sesuai",
    "originLink": "https://rosenzweig.io/blog/first-conformant-m1-gpu-driver.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224042",
    "commentBody": "",
    "originSummary": [
      "Asahi Linux telah merilis driver OpenGL ES 3.1 yang sesuai untuk GPU keluarga M1 dan M2, yang memungkinkan kompatibilitas dengan aplikasi OpenGL ES 3.1 di Linux.",
      "Driver ini telah diakui oleh badan standar, Khronos, setelah lulus tes standar industri.",
      "Implementasi Asahi Linux mencakup dukungan untuk menghitung shader dan atomik pada gambar, meskipun tidak ada instruksi perangkat keras untuk atomik gambar pada GPU M1."
    ],
    "commentSummary": [
      "Diskusi ini membahas tentang kepatuhan Apple terhadap standar, termasuk kritik terhadap produk Adobe.",
      "Kontrol Apple atas protokol dan format serta perbedaan antara API grafis Vulkan dan Metal juga dibahas.",
      "Percakapan ini juga mencakup topik-topik seperti rekayasa balik chip Apple, pengembangan driver untuk Apple Silicon, rasa frustrasi dengan ekosistem Apple, dan pencarian alternatif."
    ],
    "points": 1330,
    "commentCount": 554,
    "retryCount": 0,
    "time": 1692717789
  },
  {
    "id": 37222191,
    "title": "Microsoft membawa Python ke Excel",
    "originLink": "https://www.theverge.com/2023/8/22/23841167/microsoft-excel-python-integration-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222191",
    "commentBody": "",
    "originSummary": [
      "Microsoft mengintegrasikan Python ke dalam Excel untuk meningkatkan kemampuan analisis dan visualisasi data.",
      "Pengguna sekarang dapat memanipulasi dan menganalisis data Python secara langsung di Excel menggunakan formula, bagan, dan PivotTable.",
      "Integrasi ini tersedia di Microsoft 365 Insiders Beta Channel dan akan diluncurkan ke platform lain di masa mendatang."
    ],
    "commentSummary": [
      "Microsoft mengintegrasikan dukungan Python ke dalam Excel, sehingga pengguna dapat memanfaatkan fungsi Python di dalam perangkat lunak spreadsheet.",
      "Para pengguna telah mengungkapkan reaksi yang beragam, dengan sebagian bersemangat tentang kemampuan baru ini dan sebagian lagi menyampaikan kekhawatirannya.",
      "Kekhawatiran termasuk kesulitan untuk memulai, terbatasnya contoh yang dapat diakses, dan potensi masalah keamanan data.",
      "Beberapa pengguna menginginkan fitur analisis data yang lebih canggih di Excel, sementara yang lain mendiskusikan keterbatasan dan frustrasi dalam menggunakan Excel untuk tugas-tugas tertentu.",
      "Pendekatan berbasis cloud dan potensi masalah kompatibilitas serta masalah keamanan dalam menjalankan Python di Excel juga dibahas.",
      "Secara keseluruhan, fitur ini bertujuan untuk meningkatkan kemampuan Excel dan memperluas fungsionalitasnya, tetapi ada beberapa pendapat yang berbeda tentang implikasinya."
    ],
    "points": 780,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1692709809
  },
  {
    "id": 37222672,
    "title": "Peretas dapat menggunakan biro kredit untuk melakukan dox pada hampir semua orang di Amerika",
    "originLink": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222672",
    "commentBody": "",
    "originSummary": [
      "Para peretas menyusup ke biro kredit dan menjual informasi pribadi, termasuk alamat, nomor telepon, alamat email, dan nomor Jaminan Sosial.",
      "Alat yang digunakan untuk mengakses data ini tersedia hanya dengan $15 dalam bentuk Bitcoin, membuatnya dapat diakses oleh para penjahat.",
      "Data yang dicuri dapat digunakan untuk berbagai kejahatan, seperti pemukulan, penukaran SIM, dan kekerasan fisik.",
      "Biro kredit dan pialang data seperti TLOxp, Data-Trac, SearchBug, dan USinfoSearch telah mendapat sorotan atas keterlibatan mereka dalam menjual data pribadi.",
      "Anggota parlemen mendesak tindakan untuk mencegah praktik ini, dan Biro Perlindungan Keuangan Konsumen telah mengusulkan aturan baru untuk mengatur perdagangan data tajuk kredit.",
      "Efektivitas perubahan ini dalam mengatasi masalah masih belum pasti."
    ],
    "commentSummary": [
      "Diskusi ini menyoroti kekhawatiran tentang lemahnya langkah-langkah perlindungan data oleh biro kredit di Amerika Serikat.",
      "Ini membahas kesulitan dalam mencairkan kredit dan kebutuhan akan langkah-langkah keamanan dan regulasi yang lebih baik.",
      "Ada percakapan tentang tantangan pencurian identitas, tanggung jawab atas konsekuensi penipuan, dan keterbatasan langkah-langkah keamanan saat ini."
    ],
    "points": 536,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1692712121
  },
  {
    "id": 37220667,
    "title": "Budaya pengukuran yang baik di mana angka tidak menggantikan akal sehat",
    "originLink": "https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37220667",
    "commentBody": "",
    "originSummary": [
      "KPI (key performance indicator) psychosis adalah masalah yang lazim terjadi di perusahaan teknologi, di mana keputusan hanya didasarkan pada data dan terputus dari kenyataan.",
      "Perusahaan sangat mengandalkan data untuk mengatasi bias manusia, namun menggunakan KPI sebagai satu-satunya dasar pengambilan keputusan memiliki keterbatasan.",
      "Artikel ini menyarankan solusi yang menggabungkan intuisi dan data, terus menerus merefleksikan keandalan KPI, dan berfokus pada tujuan yang sebenarnya, bukan hanya pada KPI itu sendiri."
    ],
    "commentSummary": [
      "Mengandalkan metrik dan KPI untuk mengukur kesuksesan dan kinerja organisasi memiliki keterbatasan.",
      "Penting untuk menjaga keseimbangan antara metrik dan akal sehat dalam mengevaluasi kinerja.",
      "Metode alternatif, seperti komunikasi dan umpan balik secara teratur, dapat menjadi metode yang efektif selain metrik."
    ],
    "points": 472,
    "commentCount": 424,
    "retryCount": 0,
    "time": 1692698989
  },
  {
    "id": 37227139,
    "title": "Penyempurnaan GPT-3.5 Turbo dan pembaruan API",
    "originLink": "https://openai.com/blog/gpt-3-5-turbo-fine-tuning-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227139",
    "commentBody": "",
    "originSummary": [
      "OpenAI telah memperkenalkan fitur baru yang disebut fine-tuning untuk model GPT-3.5 Turbo mereka, yang memungkinkan pengembang untuk menyesuaikannya untuk kasus penggunaan tertentu.",
      "Pengujian awal telah menunjukkan bahwa versi GPT-3.5 Turbo yang telah disetel dengan baik dapat mengungguli model dasar GPT-4 dalam tugas-tugas tertentu, yang mengindikasikan peningkatan performa.",
      "Penyempurnaan menawarkan manfaat seperti peningkatan kemudi, pemformatan output yang andal, dan kemampuan untuk menyesuaikan nada. Model yang diperbarui juga mendukung penanganan token 4k dan menawarkan penghematan biaya melalui pengurangan ukuran yang cepat.",
      "OpenAI telah merilis detail harga untuk penyempurnaan dan mengumumkan ketersediaan model GPT-3 yang telah diperbarui.",
      "OpenAI telah menerapkan sistem moderasi untuk memastikan penyebaran model yang telah disetel dengan aman dan berencana untuk segera meluncurkan antarmuka pengguna yang telah disetel dengan baik."
    ],
    "commentSummary": [
      "OpenAI telah melakukan pembaruan pada penyempurnaan model GPT-3.5 Turbo dan API mereka, yang memungkinkan model tersebut untuk mempelajari gaya dan informasi tertentu.",
      "Fine-tuning memiliki keterbatasan dan potensi bias, jadi OpenAI menyarankan untuk menggunakan retrieval untuk tugas-tugas tertentu saja.",
      "Penyempurnaan bisa jadi kurang kuat tetapi lebih murah daripada metode tradisional, tetapi mungkin tidak selalu memberikan hasil yang lebih baik dan dapat menimbulkan bias. OpenAI berencana untuk merilis penyempurnaan GPT4 di masa mendatang."
    ],
    "points": 363,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1692730957
  },
  {
    "id": 37230619,
    "title": "Saya hanya kehilangan data selama 10 menit, terima kasih kepada ZFS",
    "originLink": "https://mastodon.social/@chromakode/110936177254839251",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37230619",
    "commentBody": "",
    "originSummary": [
      "Penulis berbagi pengalaman mereka dengan kegagalan SSD pada laptop mereka dan bagaimana mereka berhasil memulihkan data mereka menggunakan replikasi bertahap ZFS.",
      "Artikel ini membahas tentang kemampuan perbaikan dan efisiensi daya CPU AMD, bersama dengan berbagai strategi ekspansi penyimpanan dan pencadangan.",
      "Percakapan ini membahas manfaat dan tantangan dari replikasi drive dan pemecahan masalah perangkat keras, serta menyebutkan alat bantu alternatif dan kekhawatiran tentang sistem file lain seperti btrfs."
    ],
    "commentSummary": [
      "Pembahasannya adalah tentang penggunaan sistem file yang berbeda, dengan fokus khusus pada ZFS untuk pengaturan NAS.",
      "Para pengguna berbagi pengalaman pribadi mereka tentang kehilangan dan kerusakan data, mendiskusikan pro dan kontra dari berbagai sistem file dan strategi pencadangan.",
      "Pentingnya memantau kesehatan drive dan menguji cadangan secara teratur disorot, dan kebutuhan akan RAM ECC dengan ZFS masih diperdebatkan."
    ],
    "points": 318,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692752433
  },
  {
    "id": 37222393,
    "title": "FBI meminta TikTok untuk banyak fitur mata-mata dalam negeri",
    "originLink": "https://gizmodo.com/tiktok-cfius-draft-agreement-shows-spying-requests-1850759715",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222393",
    "commentBody": "",
    "originSummary": [
      "Pemerintah AS mengupayakan kesepakatan dengan TikTok yang akan memberi mereka kontrol dan akses signifikan terhadap operasi aplikasi, menurut bocoran draf perjanjian yang diperoleh Forbes.",
      "Perjanjian tersebut akan memberikan badan-badan AS kekuasaan yang luas, seperti kemampuan untuk memeriksa catatan dan server TikTok, memveto penunjukan eksekutif, dan menuntut perubahan pada persyaratan layanan aplikasi.",
      "Tuntutan pemerintah menuai kritik karena menyerupai taktik pengawasan yang umumnya dikaitkan dengan Cina. TikTok dan Komite Investasi Asing di Amerika Serikat (CFIUS) menolak berkomentar tentang rancangan perjanjian tersebut."
    ],
    "commentSummary": [
      "Larangan terhadap TikTok di Amerika Serikat telah memicu diskusi tentang pengawasan, privasi data, dan pengaruh pemerintah Cina.",
      "Beberapa pihak berpendapat bahwa larangan tersebut dimotivasi oleh persaingan, sementara pihak lain menyuarakan kekhawatiran tentang keamanan nasional.",
      "Ada perdebatan tentang keandalan badan intelijen Amerika dan dampak platform media sosial terhadap opini publik."
    ],
    "points": 310,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1692710807
  },
  {
    "id": 37222823,
    "title": "Prettymapp - Membuat peta dari data OpenStreetMap di aplikasi web Streamlit",
    "originLink": "https://github.com/chrieke/prettymapp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222823",
    "commentBody": "",
    "originSummary": [
      "Prettymapp adalah aplikasi web dan paket Python yang menghasilkan peta menakjubkan menggunakan data OpenStreetMap.",
      "Ini adalah versi yang lebih cepat dan lebih ramah pengguna dari proyek prettymaps.",
      "Paket ini dapat diintegrasikan ke dalam aplikasi Python untuk kustomisasi dan tujuan pengembangan yang dipersonalisasi."
    ],
    "commentSummary": [
      "Prettymapp adalah aplikasi web yang memungkinkan pengguna untuk membuat peta menggunakan data OpenStreetMap.",
      "Aplikasi ini mendapatkan perhatian dan umpan balik positif setelah disebutkan di Hacker News.",
      "Beberapa pengguna menghadapi kesulitan teknis ketika menjalankan aplikasi secara lokal, sehingga mendorong diskusi dan berbagi alat kustomisasi peta alternatif.",
      "Pengguna memiliki pertanyaan tentang lisensi aplikasi.",
      "Lonjakan lalu lintas dari Hacker News untuk sementara waktu menyebabkan aplikasi ini macet."
    ],
    "points": 287,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1692712738
  },
  {
    "id": 37227172,
    "title": "Experian didenda $650 ribu oleh FTC dan DOJ untuk email spam tanpa opt out",
    "originLink": "https://www.theverge.com/2023/8/22/23841646/experian-fined-spam-emails-ftc-doj",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227172",
    "commentBody": "",
    "originSummary": [
      "Experian, sebuah agen pelaporan kredit, telah didenda $650.000 oleh pemerintah AS karena melanggar undang-undang spam dan tidak menyediakan opsi opt-out untuk email pemasaran.",
      "Federal Trade Commission (FTC) menemukan bahwa Experian mengirimkan email pemasaran yang menipu kepada pelanggan yang memiliki keanggotaan pemantauan kredit gratis, tanpa pemberitahuan yang jelas dan mekanisme penyetopan keanggotaan.",
      "Akibatnya, Departemen Kehakiman (DOJ) memperoleh perintah permanen terhadap Experian, melarang jenis pesan tertentu dan mewajibkan opsi opt-out eksplisit dalam email pemasaran."
    ],
    "commentSummary": [
      "Experian, sebuah perusahaan pelaporan kredit, telah didenda sebesar $650.000 oleh FTC dan DOJ karena mengirimkan email spam yang tidak memiliki opsi untuk tidak ikut serta.",
      "Para kritikus percaya bahwa denda tersebut terlalu kecil jika dibandingkan dengan pendapatan Experian, dan menyarankan bahwa hukuman yang lebih besar diperlukan untuk mencegah perilaku serupa oleh perusahaan lain.",
      "Tidak adanya opsi untuk memilih keluar dari email spam merupakan pelanggaran peraturan, yang menyebabkan pengenaan denda oleh pihak berwenang."
    ],
    "points": 261,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692731064
  },
  {
    "id": 37224651,
    "title": "Penebangan terstruktur dengan slog",
    "originLink": "https://go.dev/blog/slog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224651",
    "commentBody": "",
    "originSummary": [
      "Paket log/slog baru di Go 1.21 memperkenalkan pencatatan terstruktur ke pustaka standar.",
      "Log terstruktur menggunakan pasangan kunci-nilai untuk memudahkan penguraian, pemfilteran, pencarian, dan analisis.",
      "Paket ini bertujuan untuk menciptakan kerangka kerja standar untuk logging terstruktur dalam ekosistem Go, dengan level log yang berbeda dan opsi format output yang dapat disesuaikan."
    ],
    "commentSummary": [
      "Diskusi ini berfokus pada pencatatan terstruktur di Go dan berbagai pendekatan yang digunakan untuk mencatat pustaka.",
      "Manfaat dari pencatatan terstruktur dan pentingnya format pencatatan terstandardisasi dan API disoroti.",
      "Para peserta berbagi pandangan mereka tentang penanganan kesalahan dan pentingnya call stack. Beberapa alat bantu yang ada untuk visualisasi log disebutkan, bersama dengan saran untuk meningkatkan efisiensi logging."
    ],
    "points": 260,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692720123
  }
]
