[
  {
    "id": 37224042,
    "title": "முதல் இணக்கமான M1 GPU இயக்கி",
    "originLink": "https://rosenzweig.io/blog/first-conformant-m1-gpu-driver.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224042",
    "commentBody": "",
    "originSummary": [
      "அசாஹி லினக்ஸ் எம் 1 மற்றும் எம் 2 குடும்ப ஜிபியூக்களுக்கான இணக்கமான ஓபன்ஜிஎல் ஈஎஸ் 3.1 இயக்கிகளை வெளியிட்டுள்ளது, இது லினக்ஸில் உள்ள எந்தவொரு ஓபன்ஜிஎல் ஈஎஸ் 3.1 பயன்பாட்டுடன் பொருந்தக்கூடிய தன்மையை அனுமதிக்கிறது.",
      "தொழில்துறை-நிலையான சோதனைகளில் தேர்ச்சி பெற்ற பின்னர் இந்த ஓட்டுநர்கள் தரநிலை அமைப்பான குரோனோஸால் அங்கீகரிக்கப்பட்டுள்ளனர்.",
      "எம் 1 ஜிபியுவில் பட அணுக்களுக்கான வன்பொருள் வழிமுறைகள் இல்லாத போதிலும், அசாஹி லினக்ஸின் செயல்படுத்தலில் படங்களில் கணினி நிழல்கள் மற்றும் அணுக்களுக்கான ஆதரவு அடங்கும்."
    ],
    "commentSummary": [
      "அடோப்பின் தயாரிப்புகள் மீதான விமர்சனங்கள் உட்பட, ஆப்பிள் தரநிலைகளை கடைபிடிப்பது குறித்து இந்த விவாதம் ஆராய்கிறது.",
      "நெறிமுறைகள் மற்றும் வடிவங்களில் ஆப்பிளின் கட்டுப்பாடு மற்றும் வல்கன் மற்றும் மெட்டல் கிராபிக்ஸ் ஏபிஐக்களுக்கு இடையிலான வேறுபாடுகளும் விவாதிக்கப்படுகின்றன.",
      "இந்த உரையாடலில் ஆப்பிளின் சிப்களின் தலைகீழ் பொறியியல், ஆப்பிள் சிலிக்கனுக்கான இயக்கிகளின் வளர்ச்சி, ஆப்பிளின் சுற்றுச்சூழல் அமைப்புடனான விரக்திகள் மற்றும் மாற்று வழிகளைத் தேடுதல் போன்ற தலைப்புகளும் அடங்கும்."
    ],
    "points": 1330,
    "commentCount": 554,
    "retryCount": 0,
    "time": 1692717789
  },
  {
    "id": 37222191,
    "title": "மைக்ரோசாப்ட் பைத்தானை எக்செல் கொண்டு வருகிறது",
    "originLink": "https://www.theverge.com/2023/8/22/23841167/microsoft-excel-python-integration-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222191",
    "commentBody": "",
    "originSummary": [
      "தரவு பகுப்பாய்வு மற்றும் காட்சிப்படுத்தல் திறன்களை மேம்படுத்த மைக்ரோசாப்ட் பைத்தானை எக்செல் உடன் ஒருங்கிணைக்கிறது.",
      "பயனர்கள் இப்போது சூத்திரங்கள், விளக்கப்படங்கள் மற்றும் பிவோட்டேபிள்களைப் பயன்படுத்தி எக்செலில் பைத்தான் தரவை நேரடியாகக் கையாளலாம் மற்றும் பகுப்பாய்வு செய்யலாம்.",
      "இந்த ஒருங்கிணைப்பு மைக்ரோசாப்ட் 365 இன்சைடர்ஸ் பீட்டா சேனலில் கிடைக்கிறது மற்றும் எதிர்காலத்தில் மற்ற தளங்களுக்கும் வெளியிடப்படும்."
    ],
    "commentSummary": [
      "மைக்ரோசாப்ட் பைத்தான் ஆதரவை எக்செலில் ஒருங்கிணைக்கிறது, இது பயனர்கள் விரிதாள் மென்பொருளுக்குள் பைத்தான் செயல்பாடுகளைப் பயன்படுத்த உதவுகிறது.",
      "பயனர்கள் கலவையான எதிர்வினைகளை வெளிப்படுத்தியுள்ளனர், சிலர் புதிய திறன்களைப் பற்றி உற்சாகமாக உள்ளனர், மற்றவர்கள் கவலைகளை எழுப்புகின்றனர்.",
      "தொடங்குவதில் சிரமம், வரையறுக்கப்பட்ட அணுகக்கூடிய எடுத்துக்காட்டுகள் மற்றும் சாத்தியமான தரவு பாதுகாப்பு சிக்கல்கள் ஆகியவை கவலைகளில் அடங்கும்.",
      "சில பயனர்கள் எக்செலில் மிகவும் மேம்பட்ட தரவு பகுப்பாய்வு அம்சங்களை விரும்புகிறார்கள், மற்றவர்கள் சில பணிகளுக்கு எக்செல் பயன்படுத்துவதன் வரம்புகள் மற்றும் ஏமாற்றங்களைப் பற்றி விவாதிக்கின்றனர்.",
      "கிளவுட் அடிப்படையிலான அணுகுமுறை மற்றும் எக்செலில் பைத்தானை இயக்குவதில் சாத்தியமான பொருந்தக்கூடிய சிக்கல்கள் மற்றும் பாதுகாப்பு கவலைகளும் கொண்டு வரப்படுகின்றன.",
      "ஒட்டுமொத்தமாக, இந்த அம்சம் எக்செலின் திறன்களை மேம்படுத்துவதையும் அதன் செயல்பாட்டை விரிவுபடுத்துவதையும் நோக்கமாகக் கொண்டுள்ளது, ஆனால் அதன் தாக்கங்கள் குறித்து கருத்துக்கள் பிரிக்கப்பட்டுள்ளன."
    ],
    "points": 780,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1692709809
  },
  {
    "id": 37222672,
    "title": "ஹேக்கர்கள் கிரெடிட் பீரோக்களைப் பயன்படுத்தி அமெரிக்காவில் கிட்டத்தட்ட எவரையும் பாதிக்கலாம்",
    "originLink": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222672",
    "commentBody": "",
    "originSummary": [
      "ஹேக்கர்கள் கிரெடிட் பீரோக்களில் ஊடுருவி முகவரிகள், தொலைபேசி எண்கள், மின்னஞ்சல் முகவரிகள் மற்றும் சமூக பாதுகாப்பு எண்கள் உள்ளிட்ட தனிப்பட்ட தகவல்களை விற்பனை செய்கிறார்கள்.",
      "இந்த தரவை அணுகப் பயன்படுத்தப்படும் கருவி பிட்காயினில் $ 15 க்கு கிடைக்கிறது, இது குற்றவாளிகளுக்கு அணுகக்கூடியதாக அமைகிறது.",
      "திருடப்பட்ட தரவு ஸ்வாட்டிங், சிம் பரிமாற்றம் மற்றும் உடல் ரீதியான வன்முறை போன்ற பல்வேறு குற்றங்களுக்கு பயன்படுத்தப்படலாம்.",
      "கடன் பணியகங்கள் மற்றும் தரவு தரகர்களான TLOxp, Data-Trac, SearchBug மற்றும் USinfoSearch ஆகியவை தனிப்பட்ட தரவை விற்பனை செய்வதில் ஈடுபட்டதற்காக ஆய்வுக்கு உட்படுத்தப்பட்டுள்ளன.",
      "இந்த நடைமுறையைத் தடுக்க நடவடிக்கை எடுக்க வேண்டும் என்று சட்டமன்ற உறுப்பினர்கள் வலியுறுத்தி வருகின்றனர், மேலும் நுகர்வோர் நிதி பாதுகாப்பு பணியகம் கிரெடிட் ஹெடர் தரவுகளின் வர்த்தகத்தை ஒழுங்குபடுத்த புதிய விதிகளை முன்மொழிந்துள்ளது.",
      "சிக்கலை நிவர்த்தி செய்வதில் இந்த மாற்றங்களின் செயல்திறன் நிச்சயமற்றதாகவே உள்ளது."
    ],
    "commentSummary": [
      "இந்த விவாதம் அமெரிக்காவில் உள்ள கடன் பணியகங்களின் தளர்வான தரவு பாதுகாப்பு நடவடிக்கைகள் குறித்த கவலைகளை எடுத்துக்காட்டுகிறது.",
      "இது கடனை விடுவிப்பதில் உள்ள சிரமங்களையும், சிறந்த பாதுகாப்பு நடவடிக்கைகள் மற்றும் ஒழுங்குமுறையின் தேவையையும் நிவர்த்தி செய்கிறது.",
      "அடையாளத் திருட்டு சவால்கள், மோசடி விளைவுகளுக்கான பொறுப்பு மற்றும் தற்போதைய பாதுகாப்பு நடவடிக்கைகளின் வரம்புகள் குறித்து ஒரு உரையாடல் உள்ளது."
    ],
    "points": 536,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1692712121
  },
  {
    "id": 37220667,
    "title": "எண்கள் பொது அறிவை மாற்றாத ஒரு நல்ல அளவீட்டு கலாச்சாரம்",
    "originLink": "https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37220667",
    "commentBody": "",
    "originSummary": [
      "கேபிஐ (முக்கிய செயல்திறன் குறிகாட்டி) மனநோய் என்பது தொழில்நுட்ப நிறுவனங்களில் ஒரு பொதுவான பிரச்சினையாகும், அங்கு முடிவுகள் தரவை மட்டுமே அடிப்படையாகக் கொண்டவை மற்றும் யதார்த்தத்திலிருந்து துண்டிக்கப்படுகின்றன.",
      "மனித சார்புகளை சமாளிக்க நிறுவனங்கள் தரவை பெரிதும் நம்பியுள்ளன, ஆனால் முடிவுகளை எடுப்பதற்கான ஒரே அடிப்படையாக கேபிஐகளைப் பயன்படுத்துவது அதன் வரம்புகளைக் கொண்டுள்ளது.",
      "இந்த கட்டுரை உள்ளுணர்வு மற்றும் தரவை ஒருங்கிணைக்கும், கேபிஐக்களின் நம்பகத்தன்மையை தொடர்ந்து பிரதிபலிக்கும் ஒரு தீர்வை பரிந்துரைக்கிறது, மேலும் கேபிஐயை விட உண்மையான நோக்கத்தில் கவனம் செலுத்துகிறது."
    ],
    "commentSummary": [
      "நிறுவனங்களில் வெற்றி மற்றும் செயல்திறனை அளவிட அளவீடுகள் மற்றும் கேபிஐக்களை மட்டுமே நம்புவது வரம்புகளைக் கொண்டுள்ளது.",
      "செயல்திறனை மதிப்பிடுவதில் அளவீடுகளுக்கும் பொது அறிவுக்கும் இடையில் சமநிலையை பராமரிப்பது முக்கியம்.",
      "வழக்கமான தகவல்தொடர்பு மற்றும் பின்னூட்டம் போன்ற மாற்று முறைகள் அளவீடுகளுக்கு கூடுதலாக பயனுள்ளதாக இருக்கும்."
    ],
    "points": 472,
    "commentCount": 424,
    "retryCount": 0,
    "time": 1692698989
  },
  {
    "id": 37227139,
    "title": "ஜிபிடி-3.5 டர்போ ஃபைன்-ட்யூனிங் மற்றும் ஏபிஐ புதுப்பிப்புகள்",
    "originLink": "https://openai.com/blog/gpt-3-5-turbo-fine-tuning-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227139",
    "commentBody": "",
    "originSummary": [
      "ஓபன்ஏஐ தங்கள் ஜிபிடி -3.5 டர்போ மாடலுக்கு ஃபைன்-டியூனிங் எனப்படும் புதிய அம்சத்தை அறிமுகப்படுத்தியுள்ளது, இது டெவலப்பர்களை குறிப்பிட்ட பயன்பாட்டு நிகழ்வுகளுக்கு தனிப்பயனாக்க அனுமதிக்கிறது.",
      "ஜிபிடி -3.5 டர்போவின் நன்கு வடிவமைக்கப்பட்ட பதிப்பு சில பணிகளில் அடிப்படை ஜிபிடி -4 மாடலை விட சிறப்பாக இருக்கும் என்று ஆரம்ப சோதனைகள் காட்டுகின்றன, இது மேம்பட்ட செயல்திறனைக் குறிக்கிறது.",
      "ஃபைன்-டியூனிங் அதிகரித்த ஸ்டீயரபிலிட்டி, நம்பகமான வெளியீடு வடிவமைப்பு மற்றும் தொனியைத் தனிப்பயனாக்கும் திறன் போன்ற நன்மைகளை வழங்குகிறது. புதுப்பிக்கப்பட்ட மாடல் 4 கே டோக்கன்களைக் கையாளுவதை ஆதரிக்கிறது மற்றும் உடனடி அளவு குறைப்பு மூலம் செலவு சேமிப்பை வழங்குகிறது.",
      "ஓபன்ஏஐ ஃபைன் டியூனிங்கிற்கான விலை விவரங்களை வெளியிட்டுள்ளது மற்றும் புதுப்பிக்கப்பட்ட ஜிபிடி -3 மாடல்கள் கிடைக்கும் என்று அறிவித்துள்ளது.",
      "நன்கு வடிவமைக்கப்பட்ட மாடல்களை பாதுகாப்பாக நிலைநிறுத்துவதை உறுதி செய்வதற்காக ஓபன்ஏஐ மிதமான அமைப்புகளை செயல்படுத்தியுள்ளது மற்றும் விரைவில் ஒரு நேர்த்தியான பயனர் இடைமுகத்தை தொடங்க திட்டமிட்டுள்ளது."
    ],
    "commentSummary": [
      "ஓபன்ஏஐ அதன் ஜிபிடி -3.5 டர்போ மாடல் ஃபைன்-டியூனிங் மற்றும் ஏபிஐ ஆகியவற்றில் புதுப்பிப்புகளைச் செய்துள்ளது, இது மாதிரியை குறிப்பிட்ட பாணிகள் மற்றும் தகவல்களைக் கற்றுக்கொள்ள அனுமதிக்கிறது.",
      "ஃபைன்-டியூனிங் வரம்புகள் மற்றும் சாத்தியமான சார்புகளைக் கொண்டுள்ளது, எனவே அதற்கு பதிலாக சில பணிகளுக்கு மீட்டெடுப்பைப் பயன்படுத்த ஓபன்ஏஐ பரிந்துரைக்கிறது.",
      "நேர்த்தியான ட்யூனிங் குறைந்த சக்திவாய்ந்ததாக இருக்கலாம், ஆனால் பாரம்பரிய முறைகளை விட மலிவானது, ஆனால் இது எப்போதும் சிறந்த முடிவுகளைத் தராது மற்றும் சார்புகளை அறிமுகப்படுத்தக்கூடும். எதிர்காலத்தில் ஜிபிடி 4 ஃபைன் டியூனிங்கை வெளியிட ஓபன்ஏஐ திட்டமிட்டுள்ளது."
    ],
    "points": 363,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1692730957
  },
  {
    "id": 37230619,
    "title": "நான் 10 நிமிட தரவை மட்டுமே இழந்தேன், ZFS க்கு நன்றி",
    "originLink": "https://mastodon.social/@chromakode/110936177254839251",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37230619",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் தங்கள் மடிக்கணினியில் ஒரு எஸ்.எஸ்.டி தோல்வி மற்றும் இசட்.எஃப்.எஸ் அதிகரிப்பு நகலெடுப்பைப் பயன்படுத்தி தங்கள் தரவை எவ்வாறு வெற்றிகரமாக மீட்டெடுத்தனர் என்பதைப் பகிர்ந்து கொள்கிறார்.",
      "இந்த இடுகை பல்வேறு சேமிப்பக விரிவாக்கம் மற்றும் காப்பு உத்திகளுடன் ஏஎம்டி சிபியூக்களின் பழுதுபார்த்தல் மற்றும் சக்தி செயல்திறனைப் பற்றி விவாதிக்கிறது.",
      "இந்த உரையாடல் இயக்ககங்களை நகலெடுப்பதன் நன்மைகள் மற்றும் சவால்களை ஆராய்கிறது மற்றும் வன்பொருள் சிக்கல்களை சரிசெய்கிறது, அதே நேரத்தில் மாற்று கருவிகள் மற்றும் பி.டி.ஆர்.எஃப் போன்ற பிற கோப்பு அமைப்புகள் பற்றிய கவலைகளையும் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "விவாதம் வெவ்வேறு கோப்பு அமைப்புகளின் பயன்பாட்டைப் பற்றியது, குறிப்பாக என்ஏஎஸ் அமைப்புகளுக்கான இசட்எஃப்எஸ் மீது கவனம் செலுத்துகிறது.",
      "பயனர்கள் தரவு இழப்பு மற்றும் ஊழலுடன் தங்கள் தனிப்பட்ட அனுபவங்களைப் பகிர்ந்து கொள்கிறார்கள், பல்வேறு கோப்பு அமைப்புகள் மற்றும் காப்புப்பிரதி உத்திகளின் நன்மை தீமைகளைப் பற்றி விவாதிக்கின்றனர்.",
      "டிரைவ் ஆரோக்கியத்தை கண்காணிப்பதன் முக்கியத்துவம் மற்றும் காப்புப்பிரதிகளை தவறாமல் பரிசோதிப்பதன் முக்கியத்துவம் எடுத்துரைக்கப்படுகிறது, மேலும் இசட்எஃப்எஸ் உடன் ஈசிசி ரேமின் தேவை விவாதிக்கப்படுகிறது."
    ],
    "points": 318,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692752433
  },
  {
    "id": 37222393,
    "title": "டிக் டாக்கிடம் பல உள்நாட்டு உளவு அம்சங்களைக் கேட்டனர்",
    "originLink": "https://gizmodo.com/tiktok-cfius-draft-agreement-shows-spying-requests-1850759715",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222393",
    "commentBody": "",
    "originSummary": [
      "ஃபோர்ப்ஸ் பெற்ற கசிந்த வரைவு ஒப்பந்தத்தின்படி, அமெரிக்க அரசாங்கம் டிக்டாக்குடன் ஒரு ஒப்பந்தத்தை நாடியது, இது பயன்பாட்டின் செயல்பாடுகளுக்கு குறிப்பிடத்தக்க கட்டுப்பாட்டையும் அணுகலையும் வழங்கியிருக்கும்.",
      "இந்த ஒப்பந்தம் டிக்டாக்கின் பதிவுகள் மற்றும் சேவையகங்களை ஆய்வு செய்யும் திறன், வீட்டோ நிர்வாக நியமனங்கள் மற்றும் பயன்பாட்டின் சேவை விதிமுறைகளில் மாற்றங்களைக் கோருவது போன்ற விரிவான அதிகாரங்களை அமெரிக்க நிறுவனங்களுக்கு வழங்கியிருக்கும்.",
      "அரசாங்கத்தின் கோரிக்கைகள் பொதுவாக சீனாவுடன் தொடர்புடைய கண்காணிப்பு தந்திரோபாயங்களை ஒத்திருப்பதால் விமர்சனங்களை எதிர்கொண்டன. டிக்டாக் மற்றும் அமெரிக்காவில் வெளிநாட்டு முதலீட்டுக் குழு (சி.எஃப்.ஐ.யூ.எஸ்) வரைவு ஒப்பந்தம் குறித்து கருத்து தெரிவிக்க மறுத்துவிட்டன."
    ],
    "commentSummary": [
      "அமெரிக்காவில் டிக்டாக் மீதான தடை கண்காணிப்பு, தரவு தனியுரிமை மற்றும் சீன அரசாங்கத்தின் செல்வாக்கு குறித்த விவாதத்தைத் தூண்டியுள்ளது.",
      "சிலர் இந்த தடை போட்டியால் தூண்டப்பட்டது என்று வாதிடுகின்றனர், மற்றவர்கள் தேசிய பாதுகாப்பு குறித்த கவலைகளை எழுப்புகிறார்கள்.",
      "அமெரிக்க உளவுத்துறை சேவைகளின் நம்பகத்தன்மை மற்றும் பொதுமக்களின் கருத்து மீது சமூக ஊடக தளங்களின் தாக்கம் குறித்து விவாதம் உள்ளது."
    ],
    "points": 310,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1692710807
  },
  {
    "id": 37222823,
    "title": "Prettymapp – Streamlit webapp இல் OpenStreetMap தரவிலிருந்து வரைபடங்களை உருவாக்கவும்",
    "originLink": "https://github.com/chrieke/prettymapp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222823",
    "commentBody": "",
    "originSummary": [
      "ப்ரெட்டிமாப் என்பது ஒரு வலை பயன்பாடு மற்றும் பைத்தான் தொகுப்பு ஆகும், இது ஓபன்ஸ்ட்ரீட்மேப் தரவைப் பயன்படுத்தி அதிர்ச்சியூட்டும் வரைபடங்களை உருவாக்குகிறது.",
      "இது ப்ரெட்டிமேப்ஸ் திட்டத்தின் வேகமான மற்றும் அதிக பயனர் நட்பு பதிப்பாகும்.",
      "தனிப்பயனாக்கப்பட்ட தனிப்பயனாக்கம் மற்றும் மேம்பாட்டு நோக்கங்களுக்காக தொகுப்பு பைத்தான் பயன்பாடுகளில் ஒருங்கிணைக்கப்படலாம்."
    ],
    "commentSummary": [
      "ப்ரெட்டிமாப் என்பது ஒரு வலை பயன்பாடாகும், இது ஓபன்ஸ்ட்ரீட்மேப் தரவைப் பயன்படுத்தி வரைபடங்களை உருவாக்க பயனர்களுக்கு உதவுகிறது.",
      "ஹேக்கர் நியூஸில் குறிப்பிடப்பட்ட பின்னர் இந்த பயன்பாடு கவனத்தையும் நேர்மறையான கருத்துக்களையும் பெற்றது.",
      "சில பயனர்கள் பயன்பாட்டை உள்நாட்டில் இயக்கும்போது தொழில்நுட்ப சிக்கல்களை எதிர்கொண்டனர், இது விவாதங்களைத் தூண்டியது மற்றும் மாற்று வரைபட தனிப்பயனாக்கல் கருவிகளைப் பகிர்ந்து கொண்டது.",
      "பயன்பாட்டின் உரிமம் குறித்து பயனர்களுக்கு கேள்விகள் இருந்தன.",
      "ஹேக்கர் நியூஸின் டிராஃபிக் அதிகரிப்பு தற்காலிகமாக பயன்பாட்டை செயலிழக்கச் செய்தது."
    ],
    "points": 287,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1692712738
  },
  {
    "id": 37227172,
    "title": "ஸ்பேம் மின்னஞ்சல்களுக்காக எக்ஸ்பீரியனுக்கு எஃப்.டி.சி மற்றும் டி.ஓ.ஜே $650,000 அபராதம் விதித்தது",
    "originLink": "https://www.theverge.com/2023/8/22/23841646/experian-fined-spam-emails-ftc-doj",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227172",
    "commentBody": "",
    "originSummary": [
      "ஸ்பேம் சட்டங்களை மீறியதற்காகவும், மின்னஞ்சல்களை சந்தைப்படுத்துவதற்கான விருப்பத்தை வழங்காததற்காகவும் கடன் அறிக்கை நிறுவனமான எக்ஸ்பீரியனுக்கு அமெரிக்க அரசாங்கம் 650,000 டாலர் அபராதம் விதித்துள்ளது.",
      "ஃபெடரல் டிரேட் கமிஷன் (எஃப்.டி.சி) எக்ஸ்பீரியன் இலவச கடன் கண்காணிப்பு உறுப்பினர்களைக் கொண்ட வாடிக்கையாளர்களுக்கு ஏமாற்றும் சந்தைப்படுத்தல் மின்னஞ்சல்களை அனுப்பியது, தெளிவான அறிவிப்பு மற்றும் வெளியேறும் வழிமுறை இல்லை என்பதைக் கண்டறிந்தது.",
      "இதன் விளைவாக, நீதித் துறை (டிஓஜே) எக்ஸ்பீரியனுக்கு எதிராக ஒரு நிரந்தர தடையுத்தரவைப் பெற்றது, சில வகையான செய்திகளைத் தடைசெய்தது மற்றும் சந்தைப்படுத்தல் மின்னஞ்சல்களில் வெளிப்படையான விலகல் விருப்பங்கள் தேவை."
    ],
    "commentSummary": [
      "எக்ஸ்பீரியன் என்ற கிரெடிட் ரிப்போர்ட்டிங் நிறுவனத்திற்கு எஃப்.டி.சி மற்றும் டி.ஓ.ஜே 650,000 டாலர் அபராதம் விதித்துள்ளன.",
      "விமர்சகர்கள் எக்ஸ்பீரியனின் வருவாயுடன் ஒப்பிடும்போது அபராதம் மிகக் குறைவு என்று நம்புகிறார்கள், மற்ற நிறுவனங்களின் இதேபோன்ற நடத்தையை ஊக்கப்படுத்த பெரிய அபராதங்கள் அவசியம் என்று பரிந்துரைக்கின்றனர்.",
      "ஸ்பேம் மின்னஞ்சல்களில் வெளியேறும் விருப்பம் இல்லாதது விதிமுறைகளை மீறுவதாகும், இது ஒழுங்குமுறை அதிகாரிகளால் அபராதம் விதிக்க வழிவகுக்கிறது."
    ],
    "points": 261,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692731064
  },
  {
    "id": 37224651,
    "title": "ஸ்லாக் மூலம் கட்டமைக்கப்பட்ட பதிவு",
    "originLink": "https://go.dev/blog/slog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224651",
    "commentBody": "",
    "originSummary": [
      "கோ 1.21 இல் உள்ள புதிய பதிவு / ஸ்லாக் தொகுப்பு நிலையான நூலகத்தில் கட்டமைக்கப்பட்ட உள்நுழைவை அறிமுகப்படுத்துகிறது.",
      "கட்டமைக்கப்பட்ட பதிவுகள் எளிதான பார்சிங், வடிகட்டுதல், தேடல் மற்றும் பகுப்பாய்வுக்கு விசை மதிப்பு ஜோடிகளைப் பயன்படுத்துகின்றன.",
      "வெவ்வேறு பதிவு நிலைகள் மற்றும் தனிப்பயனாக்கக்கூடிய வெளியீட்டு வடிவமைப்பு விருப்பங்களுடன், கோ சுற்றுச்சூழல் அமைப்பில் கட்டமைக்கப்பட்ட உள்நுழைவுக்கான தரப்படுத்தப்பட்ட கட்டமைப்பை உருவாக்குவதை தொகுப்பு நோக்கமாகக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "விவாதம் கோவில் கட்டமைக்கப்பட்ட உள்நுழைவு மற்றும் உள்நுழைவு நூலகங்களால் பயன்படுத்தப்படும் பல்வேறு அணுகுமுறைகளில் கவனம் செலுத்துகிறது.",
      "கட்டமைக்கப்பட்ட உள்நுழைவின் நன்மைகள் மற்றும் தரப்படுத்தப்பட்ட பதிவு வடிவங்கள் மற்றும் ஏபிஐக்களின் முக்கியத்துவம் ஆகியவை முன்னிலைப்படுத்தப்படுகின்றன.",
      "பங்கேற்பாளர்கள் பிழை கையாளுதல் மற்றும் அழைப்பு அடுக்குகளின் முக்கியத்துவம் குறித்து தங்கள் கருத்துக்களைப் பகிர்ந்து கொள்கிறார்கள். பதிவு காட்சிப்படுத்தலுக்கான தற்போதுள்ள சில கருவிகள், பதிவு செயல்திறனை மேம்படுத்துவதற்கான பரிந்துரைகளுடன் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 260,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692720123
  }
]
