[
  {
    "id": 37224042,
    "title": "Den første kompatible M1 GPU-driveren",
    "originLink": "https://rosenzweig.io/blog/first-conformant-m1-gpu-driver.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224042",
    "commentBody": "",
    "originSummary": [
      "Asahi Linux har lansert kompatible OpenGL ES 3.1-drivere for GPU-er i M1- og M2-familien, noe som gjør dem kompatible med alle OpenGL ES 3.1-programmer på Linux.",
      "Disse driverne er godkjent av standardiseringsorganet Khronos etter å ha bestått bransjestandardiserte tester.",
      "Asahi Linux-implementeringen inkluderer støtte for compute shaders og atomics på bilder, til tross for mangelen på maskinvareinstruksjoner for atomics på M1 GPU."
    ],
    "commentSummary": [
      "Diskusjonen tar for seg Apples overholdelse av standarder, inkludert kritikk av Adobes produkter.",
      "Apples kontroll over protokoller og formater og forskjellene mellom Vulkan- og Metal-grafikk-API-ene diskuteres også.",
      "Samtalen dekker også temaer som reverse engineering av Apples brikker, utvikling av drivere for Apple Silicon, frustrasjon over Apples økosystem og søken etter alternativer."
    ],
    "points": 1330,
    "commentCount": 554,
    "retryCount": 0,
    "time": 1692717789
  },
  {
    "id": 37222191,
    "title": "Microsoft bringer Python til Excel",
    "originLink": "https://www.theverge.com/2023/8/22/23841167/microsoft-excel-python-integration-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222191",
    "commentBody": "",
    "originSummary": [
      "Microsoft integrerer Python i Excel for å forbedre mulighetene for dataanalyse og visualisering.",
      "Brukerne kan nå manipulere og analysere Python-data direkte i Excel ved hjelp av formler, diagrammer og pivottabeller.",
      "Integrasjonen er tilgjengelig i Microsoft 365 Insiders Beta Channel og vil bli rullet ut på andre plattformer i fremtiden."
    ],
    "commentSummary": [
      "Microsoft integrerer Python-støtte i Excel, slik at brukerne kan bruke Python-funksjoner i regnearkprogrammet.",
      "Brukerne har uttrykt blandede reaksjoner, noen er begeistret for de nye funksjonene, mens andre er bekymret.",
      "Bekymringene omfatter blant annet at det er vanskelig å komme i gang, få tilgjengelige eksempler og potensielle datasikkerhetsproblemer.",
      "Noen brukere ønsker mer avanserte dataanalysefunksjoner i Excel, mens andre diskuterer begrensningene og frustrasjonene ved å bruke Excel til visse oppgaver.",
      "Den skybaserte tilnærmingen og potensielle kompatibilitetsproblemer og sikkerhetsproblemer med å kjøre Python i Excel blir også tatt opp.",
      "Overordnet sett er målet med funksjonen å forbedre Excels muligheter og utvide funksjonaliteten, men det er delte meninger om hva den innebærer."
    ],
    "points": 780,
    "commentCount": 409,
    "retryCount": 0,
    "time": 1692709809
  },
  {
    "id": 37222672,
    "title": "Hackere kan bruke kredittbyråer til å utlevere informasjon om nesten hvem som helst i USA.",
    "originLink": "https://www.404media.co/the-secret-weapon-hackers-can-use-to-dox-nearly-anyone-in-america-for-15-tlo-usinfosearch-transunion/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222672",
    "commentBody": "",
    "originSummary": [
      "Hackere infiltrerer kredittbyråer og selger personopplysninger, inkludert adresser, telefonnumre, e-postadresser og personnummer.",
      "Verktøyet som brukes til å få tilgang til disse dataene, er tilgjengelig for så lite som 15 dollar i Bitcoin, noe som gjør det tilgjengelig for kriminelle.",
      "De stjålne dataene kan brukes til ulike forbrytelser, for eksempel swatting, SIM-bytte og fysisk vold.",
      "Kredittbyråer og datameglere som TLOxp, Data-Trac, SearchBug og USinfoSearch har vært i søkelyset for å selge personopplysninger.",
      "Lovgivere oppfordrer til tiltak for å forhindre denne praksisen, og Consumer Financial Protection Bureau har foreslått nye regler for å regulere handel med kredittopplysninger.",
      "Det er fortsatt usikkert hvor effektive disse endringene er når det gjelder å løse problemet."
    ],
    "commentSummary": [
      "Diskusjonen setter søkelyset på bekymringen for at kredittopplysningsbyråene i USA er for slappe når det gjelder databeskyttelse.",
      "Den tar opp vanskeligheter med å frigjøre kreditt og behovet for bedre sikkerhetstiltak og regulering.",
      "Det er en samtale om utfordringene ved identitetstyveri, ansvaret for konsekvensene av svindel og begrensningene ved dagens sikkerhetstiltak."
    ],
    "points": 536,
    "commentCount": 368,
    "retryCount": 0,
    "time": 1692712121
  },
  {
    "id": 37220667,
    "title": "En god målekultur der tall ikke erstatter sunn fornuft.",
    "originLink": "https://blog.promaton.com/how-to-avoid-kpi-psychosis-in-your-organization-5ffc83967f2b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37220667",
    "commentBody": "",
    "originSummary": [
      "KPI-psykose (Key Performance Indicators) er et utbredt problem i teknologibedrifter, der beslutninger utelukkende baseres på data og ikke har noe med virkeligheten å gjøre.",
      "Bedrifter er i stor grad avhengige av data for å overvinne menneskelige skjevheter, men å bruke nøkkeltall som eneste beslutningsgrunnlag har sine begrensninger.",
      "Artikkelen foreslår en løsning som kombinerer intuisjon og data, kontinuerlig reflekterer over KPI-enes pålitelighet og fokuserer på det faktiske målet i stedet for bare selve KPI-en."
    ],
    "commentSummary": [
      "Det har sine begrensninger å basere seg utelukkende på måltall og KPI-er for å måle suksess og prestasjoner i organisasjoner.",
      "Det er viktig å opprettholde en balanse mellom beregninger og sunn fornuft i evalueringen av prestasjoner.",
      "Alternative metoder, som jevnlig kommunikasjon og tilbakemeldinger, kan være effektive i tillegg til målemetoder."
    ],
    "points": 472,
    "commentCount": 424,
    "retryCount": 0,
    "time": 1692698989
  },
  {
    "id": 37227139,
    "title": "GPT-3.5 Turbo finjustering og API-oppdateringer",
    "originLink": "https://openai.com/blog/gpt-3-5-turbo-fine-tuning-and-api-updates",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227139",
    "commentBody": "",
    "originSummary": [
      "OpenAI har introdusert en ny funksjon kalt finjustering for GPT-3.5 Turbo-modellen, slik at utviklere kan tilpasse den til spesifikke bruksområder.",
      "Tidlige tester har vist at en finjustert versjon av GPT-3.5 Turbo kan overgå basismodellen GPT-4 i visse oppgaver, noe som tyder på bedre ytelse.",
      "Finjusteringen gir fordeler som økt styrbarhet, pålitelig utdataformatering og muligheten til å tilpasse tonen. Den oppdaterte modellen støtter også håndtering av 4k-brikker og gir kostnadsbesparelser ved at størrelsen reduseres raskt.",
      "OpenAI har offentliggjort prisinformasjon for finjustering og kunngjort tilgjengeligheten av oppdaterte GPT-3-modeller.",
      "OpenAI har implementert modereringssystemer for å sikre trygg distribusjon av finjusterte modeller og planlegger å lansere et brukergrensesnitt for finjustering innen kort tid."
    ],
    "commentSummary": [
      "OpenAI har gjort oppdateringer av GPT-3.5 Turbo-modellens finjustering og API, slik at modellen kan lære seg spesifikke stiler og informasjon.",
      "Finjustering har begrensninger og potensielle skjevheter, så OpenAI foreslår å bruke gjenfinning til visse oppgaver i stedet.",
      "Finjustering kan være mindre kraftig, men billigere enn tradisjonelle metoder, men det er ikke sikkert at det alltid gir bedre resultater og kan føre til skjevheter. OpenAI planlegger å lansere GPT4 finjustering i fremtiden."
    ],
    "points": 363,
    "commentCount": 205,
    "retryCount": 0,
    "time": 1692730957
  },
  {
    "id": 37230619,
    "title": "Jeg mistet bare 10 minutter med data, takket være ZFS.",
    "originLink": "https://mastodon.social/@chromakode/110936177254839251",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37230619",
    "commentBody": "",
    "originSummary": [
      "Forfatteren deler sine erfaringer med en SSD-feil på den bærbare datamaskinen og hvordan de klarte å gjenopprette dataene ved hjelp av ZFS inkrementell replikering.",
      "Innlegget tar for seg AMD-prosessorenes reparasjonsmuligheter og energieffektivitet, samt ulike strategier for lagringsutvidelse og sikkerhetskopiering.",
      "Samtalen utforsker fordelene og utfordringene ved å replikere stasjoner og feilsøke maskinvareproblemer, samtidig som alternative verktøy og problemer med andre filsystemer som btrfs nevnes."
    ],
    "commentSummary": [
      "Diskusjonen handler om bruk av ulike filsystemer, med spesielt fokus på ZFS for NAS-oppsett.",
      "Brukerne deler sine personlige erfaringer med tap og ødeleggelse av data, og diskuterer fordeler og ulemper ved ulike filsystemer og sikkerhetskopieringsstrategier.",
      "Viktigheten av å overvåke stasjonenes tilstand og regelmessig teste sikkerhetskopier understrekes, og behovet for ECC-RAM med ZFS diskuteres."
    ],
    "points": 318,
    "commentCount": 189,
    "retryCount": 0,
    "time": 1692752433
  },
  {
    "id": 37222393,
    "title": "FBI ba TikTok om mange funksjoner for spionasje i hjemmet",
    "originLink": "https://gizmodo.com/tiktok-cfius-draft-agreement-shows-spying-requests-1850759715",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222393",
    "commentBody": "",
    "originSummary": [
      "Amerikanske myndigheter ønsket å inngå en avtale med TikTok som ville gitt dem betydelig kontroll og tilgang til appens virksomhet, ifølge et lekket avtaleutkast som Forbes har fått tilgang til.",
      "Avtalen ville ha gitt amerikanske myndigheter omfattende fullmakter, som muligheten til å undersøke TikToks arkiver og servere, nedlegge veto mot utnevnelser og kreve endringer i appens tjenestevilkår.",
      "Myndighetenes krav ble kritisert fordi de lignet på overvåkningstaktikker som vanligvis forbindes med Kina. TikTok og Committee on Foreign Investment in the United States (CFIUS) nektet å kommentere avtaleutkastet."
    ],
    "commentSummary": [
      "Forbudet mot TikTok i USA har utløst en diskusjon om overvåking, personvern og kinesiske myndigheters innflytelse.",
      "Noen hevder at forbudet er motivert av konkurransehensyn, mens andre er bekymret for den nasjonale sikkerheten.",
      "Det diskuteres hvor pålitelige amerikanske etterretningstjenester er, og hvilken innvirkning sosiale medier har på opinionen."
    ],
    "points": 310,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1692710807
  },
  {
    "id": 37222823,
    "title": "Prettymapp - Lag kart fra OpenStreetMap-data i en Streamlit-webapplikasjon",
    "originLink": "https://github.com/chrieke/prettymapp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37222823",
    "commentBody": "",
    "originSummary": [
      "Prettymapp er en webapp og Python-pakke som genererer flotte kart ved hjelp av OpenStreetMap-data.",
      "Det er en raskere og mer brukervennlig versjon av prettymaps-prosjektet.",
      "Pakken kan integreres i Python-applikasjoner for personlig tilpasning og utvikling."
    ],
    "commentSummary": [
      "Prettymapp er en webapplikasjon som gjør det mulig for brukere å lage kart ved hjelp av OpenStreetMap-data.",
      "Appen fikk oppmerksomhet og positive tilbakemeldinger etter å ha blitt omtalt på Hacker News.",
      "Noen brukere hadde tekniske problemer med å kjøre appen lokalt, noe som førte til diskusjoner og deling av alternative karttilpasningsverktøy.",
      "Brukerne hadde spørsmål om lisensen til appen.",
      "Den store trafikkøkningen fra Hacker News førte til at appen midlertidig krasjet."
    ],
    "points": 287,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1692712738
  },
  {
    "id": 37227172,
    "title": "Experian bøtelagt med 650 000 dollar av FTC og DOJ for spam-e-post uten opt out-mulighet",
    "originLink": "https://www.theverge.com/2023/8/22/23841646/experian-fined-spam-emails-ftc-doj",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37227172",
    "commentBody": "",
    "originSummary": [
      "Kredittopplysningsbyrået Experian har blitt ilagt en bot på 650 000 dollar av amerikanske myndigheter for å ha brutt spam-lovene og for ikke å ha gjort det mulig å reservere seg mot e-postmarkedsføring.",
      "Federal Trade Commission (FTC) oppdaget at Experian sendte villedende markedsførings-e-poster til kunder med gratis medlemskap i kredittovervåkningsselskapet, og at det manglet tydelig informasjon og en avmeldingsmekanisme.",
      "Som et resultat av dette fikk justisdepartementet (DOJ) et permanent påbud mot Experian, som forbyr visse typer meldinger og krever eksplisitte fravalgsmuligheter i e-postmarkedsføring."
    ],
    "commentSummary": [
      "Kredittopplysningsselskapet Experian har blitt ilagt en bot på 650 000 dollar av FTC og DOJ for å ha sendt ut spam-e-post uten mulighet for å melde seg av.",
      "Kritikerne mener at boten er for liten i forhold til Experians omsetning, og at det er nødvendig med større bøter for å avskrekke andre selskaper fra å gjøre det samme.",
      "Fraværet av en opt-out-mulighet i spam-e-postene er et brudd på regelverket, noe som har ført til at tilsynsmyndighetene har ilagt boten."
    ],
    "points": 261,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692731064
  },
  {
    "id": 37224651,
    "title": "Strukturert logging med slog",
    "originLink": "https://go.dev/blog/slog",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37224651",
    "commentBody": "",
    "originSummary": [
      "Den nye log/slog-pakken i Go 1.21 introduserer strukturert logging i standardbiblioteket.",
      "Strukturerte logger bruker nøkkelverdipar for enkel parsing, filtrering, søk og analyse.",
      "Pakken har som mål å skape et standardisert rammeverk for strukturert logging i Go-økosystemet, med ulike loggnivåer og tilpassbare alternativer for utdataformat."
    ],
    "commentSummary": [
      "Diskusjonen fokuserer på strukturert logging i Go og de ulike tilnærmingene som loggebibliotekene bruker.",
      "Fordelene med strukturert logging og viktigheten av standardiserte loggformater og API-er fremheves.",
      "Deltakerne deler sine synspunkter på feilhåndtering og betydningen av call stacks. Noen eksisterende verktøy for loggvisualisering nevnes, sammen med forslag til effektivisering av loggingen."
    ],
    "points": 260,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1692720123
  }
]
