[
  {
    "id": 40247604,
    "title": "كشف تسريبات DNS على Android: مخاوف خطيرة تتعلق بالخصوصية",
    "originLink": "https://mullvad.net/en/blog/dns-traffic-can-leak-outside-the-vpn-tunnel-on-android",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40247604",
    "commentBody": "",
    "originSummary": [
      "يمكن أن تتسبب الأخطاء في نظام التشغيل Android في تسرب DNS على الأجهزة ، مما قد يعرض الخصوصية للخطر عند استخدام تطبيقات معينة مع VPN نشط.",
      "قد تحدث تسريبات DNS أثناء إعادة تكوين نفق VPN ، أو إذا كانت التطبيقات تفتقر إلى خادم DNS تم تكوينه أو تستخدم طرقا محددة لحل أسماء النطاقات.",
      "يقوم تطبيق الخصوصية بتطوير حلول مؤقتة لمعالجة التسريبات ، وينصح المستخدمين بتحديث التطبيق للحماية حتى تحل Google المشكلات الأساسية."
    ],
    "commentSummary": [
      "تتناول المناقشة الخصوصية والأمان والشفافية فيما يتعلق بخدمات VPN مثل Mullvad والخيارات البديلة مثل GrapheneOS.",
      "يثني المستخدمون على Mullvad لتفانيها في الخصوصية والشفافية ولكنهم يثيرون مخاوف بشأن التسريبات ومشاكل إعادة توجيه المنافذ.",
      "تمتد المحادثة إلى استخدام جهاز التوجيه ، وأمن تطبيقات الخدمات المصرفية عبر الهاتف المحمول ، والمخاطر المرتبطة بعمل روت للأجهزة ، مع التأكيد على أهمية تحقيق التوازن بين الأمان والخصوصية والوظائف في الأنشطة عبر الإنترنت واستخدام الجهاز."
    ],
    "points": 697,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1714744001
  },
  {
    "id": 40248627,
    "title": "Natron Energy تطلق بطاريات الصوديوم في الولايات المتحدة",
    "originLink": "https://newatlas.com/energy/natron-sodium-ion-battery-production-startt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40248627",
    "commentBody": "",
    "originSummary": [
      "بدأت Natron Energy في تصنيع بطاريات الصوديوم الخالية من الليثيوم في الولايات المتحدة ، مما يوفر بديلا صديقا للبيئة ومتاحا على نطاق واسع لبطاريات الليثيوم أيون.",
      "تتميز بطاريات الصوديوم بمعدلات شحن أسرع ، ومتانة ممتدة ، وهي مصنوعة من مكونات يسهل الوصول إليها ، وتلبي في المقام الأول استخدامات الطاقة الاحتياطية الصناعية.",
      "تتضمن الاستراتيجيات المستقبلية توسيع نطاق تطبيق البطاريات خارج القطاعات الصناعية إلى أسواق إضافية."
    ],
    "commentSummary": [
      "يناقش النقاش بطاريات الصوديوم كبديل لبطاريات الليثيوم أيون للأجهزة المحمولة والمركبات الكهربائية ، مع التركيز على المزايا وإمكانات المصادر المحلية.",
      "يتم استكشاف الآثار الجيوسياسية لإنتاج الليثيوم أيون ، والاعتماد على بلدان محددة للبطاريات ، والتقدم في تكنولوجيا البطاريات مثل فوسفات الحديد الليثيوم والمركبات الهجينة.",
      "تؤكد المحادثة على أهمية كفاءة البطارية والسلامة والاستدامة والإمكانات التحويلية للتقنيات الناشئة في تخزين الطاقة."
    ],
    "points": 432,
    "commentCount": 342,
    "retryCount": 0,
    "time": 1714749256
  },
  {
    "id": 40250056,
    "title": "تؤثر سيطرة الأسهم الخاصة على أوقات إصلاح الكراسي المتحركة",
    "originLink": "https://www.statnews.com/2024/05/01/wheelchair-repair-delay-numotion-national-seating-mobility/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40250056",
    "commentBody": "",
    "originSummary": [
      "تسببت شركات الأسهم الخاصة التي تشتري مصنعي الكراسي المتحركة في تأخيرات كبيرة في الإصلاحات للمستخدمين مثل مورين أميرولت ، مما أثر على حركتهم.",
      "يدعو المدافعون عن الإعاقة إلى تحسين خدمات الكراسي المتحركة لمعالجة مشكلة وقت الإصلاح.",
      "أدى الاستحواذ من قبل شركات الأسهم الخاصة إلى فترات إصلاح طويلة ، مما دفع الدعوة إلى تحسين خدمات الكراسي المتحركة."
    ],
    "commentSummary": [
      "تؤدي هيمنة الأسهم الخاصة في سوق الكراسي المتحركة إلى أوقات انتظار طويلة للإصلاح وارتفاع التكاليف للمستخدمين بسبب مشكلات مثل عمليات المشتريات الحكومية ونقص المنافسة.",
      "يتم اقتراح حلول بديلة مثل قوانين الحق في الإصلاح والمبادرات المجتمعية لمواجهة تحديات الصناعة الناجمة عن الحواجز التنظيمية والأعمال الورقية المفرطة ، بهدف تعزيز الوصول إلى أجهزة التنقل عالية الجودة وبأسعار معقولة.",
      "تتمحور الانتقادات الموجهة إلى الأسهم الخاصة حول خلق أوجه القصور وتعريض رفاهية المستهلك للخطر من خلال استغلال الأسواق ، مما أثار مناقشات حول دور الرأسمالية واللوائح الحكومية والأنظمة الاقتصادية المتنوعة في حماية حقوق المستهلك في السوق."
    ],
    "points": 415,
    "commentCount": 280,
    "retryCount": 0,
    "time": 1714757126
  },
  {
    "id": 40250557,
    "title": "BandMatch: ربط الموسيقيين لتشكيل الفرق الموسيقية",
    "originLink": "https://bandmatch.app",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40250557",
    "commentBody": "",
    "originSummary": [
      "BandMatch عبارة عن منصة تسهل اتصالات الموسيقيين مع الفنانين القريبين لإنشاء فرق موسيقية أو العمل في مشاريع تعاونية.",
      "يمكن للمستخدمين اكتشاف تفاصيل حول الحفلات الموسيقية القادمة في المنطقة المجاورة لهم من خلال المنصة."
    ],
    "commentSummary": [
      "يشارك المستخدمون في مناقشة حول تطبيق يركز على الموسيقى مصمم للموسيقيين للاتصال وتشكيل الفرق الموسيقية ، وتسليط الضوء على القيود في واجهة التمرير واقتراح ميزات جديدة مثل الفلاتر وإنشاء القوائم.",
      "كما تتم مناقشة مخاوف الخصوصية والمخاوف بشأن الآثار السلبية للتلاعب في إنشاء الموسيقى ، إلى جانب توسع التطبيق إلى المملكة المتحدة والمحادثات حول الصور النمطية لعازفي الطبول والتحديات في العثور على الموسيقيين الموهوبين.",
      "تمتد المحادثة إلى انتقادات الواجهات القائمة على التمرير السريع ، واقتراحات لتحسين خوارزميات التوفيق ، وأوجه التشابه مع تطور تطبيقات المواعدة مثل OkCupid."
    ],
    "points": 355,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1714759885
  },
  {
    "id": 40247421,
    "title": "اكتشاف مجلدات حكاية خرافية نادرة للأخوة جريم في بولندا",
    "originLink": "https://english.nv.ua/life/27-unique-volumes-of-grimm-brothers-fairy-tales-were-found-in-poland-50415035.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40247421",
    "commentBody": "",
    "originSummary": [
      "عثر الباحثون في بولندا على 27 مجلدا أصليا من حكايات الأخوان جريم الخيالية في جامعة آدم ميكيفيتش في بوزنان ، بما في ذلك مطبوعات نادرة مع حواشي المؤلف ، مما جذب اهتمام خبراء الأدب والفولكلور.",
      "يمهد هذا الاكتشاف الطريق لمزيد من الدراسة المتعمقة حول تأثير الأخوين جريم على الأدب العالمي.",
      "تشير هذه الكتب ، التي ربما تم الحصول عليها بعد الحرب العالمية 2 ، إلى إمكانية احتفاظ مكتبات أخرى بأعمال من المجموعة الشخصية للأخوين جريم."
    ],
    "commentSummary": [
      "تم العثور على حكايات Brothers Grimm الخيالية الأصلية ذات المحتوى الفريد في بولندا ، حيث كشفت النقاب عن روايات الوحشية وتحديات البقاء والمعايير المجتمعية.",
      "تدور المحادثات حول تحليل الاستعارات السياسية في القصص ، وتقنيات البحث التي استخدمها الأخوان جريم ، وتأثير الصراعات على الإرث الثقافي.",
      "التاريخ المتشابك للدول الأوروبية ، وتأثير زمن الحرب على سعة الاطلاع الثقافية ، وتعقيد الهويات الوطنية هي أيضا نقاط رئيسية للمناقشة."
    ],
    "points": 335,
    "commentCount": 106,
    "retryCount": 0,
    "time": 1714742798
  },
  {
    "id": 40250226,
    "title": "تواطؤ صناعة النفط: التأثير على أسعار الغاز",
    "originLink": "https://www.thebignewsletter.com/p/an-oil-price-fixing-conspiracy-caused",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40250226",
    "commentBody": "",
    "originSummary": [
      "في عام 2021 ، كشفت لجنة التجارة الفيدرالية عن مخطط لتحديد أسعار النفط يشمل شركات النفط الأمريكية والحكومة السعودية ، مما أدى إلى تضخم أسعار الغاز وإثقال كاهل العائلات بمتوسط تكلفة 3000 دولار.",
      "تعاونت شركات النفط الأمريكية مع أوبك للحد من إمدادات النفط ، وتعزيز الأسعار وإثارة عواقب مالية على المستهلكين ، مما أدى إلى مناقشات حول الإجراءات القانونية لمكافحة الاحتكار والتدخل الحكومي.",
      "وقد شرع التحقيق الذي أجرته لجنة الممارسات التجارية المنصفة في إجراء مناقشات ودراسات بشأن أثر هيمنة السوق والتلاعب بالأسعار على معدلات التضخم وأرباح الشركات."
    ],
    "commentSummary": [
      "يدور النقاش حول اتهامات بالتلاعب بالأسعار في قطاع النفط، ويغطي جوانب مثل الإفراط في الإنتاج، والتواطؤ مع أوبك، وتأثير السياسات الحكومية.",
      "يناقش المشاركون السلوكيات الاحتكارية والاستقرار الاقتصادي والآثار البيئية ، ويعرضون العلاقة المعقدة بين إنتاج الطاقة وإجراءات المستهلك والتدخل الحكومي.",
      "علاوة على ذلك ، تسلط المحادثة الضوء على تحديات الصناعة ، والانتقال إلى الطاقة المتجددة ، والنتائج المحتملة لعدم معالجة تغير المناخ."
    ],
    "points": 234,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1714757999
  },
  {
    "id": 40247871,
    "title": "تحسين الطباعة باستخدام CSS Text Box Trim",
    "originLink": "https://github.com/jantimon/text-box-trim-examples",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40247871",
    "commentBody": "",
    "originSummary": [
      "تعمل خاصية CSS Text Box Trim على إزالة المسافات البيضاء البادئة من النص، مما يساعد في محاذاة النص بدقة مع الحاويات والعناصر.",
      "تدعم معاينة تقنية Safari هذه الخاصية حصريا ، وهي مفيدة لتوسيط النص في الأزرار ومحاذاة الرموز والحفاظ على استمرارية التصميم.",
      "على الرغم من تحديات التنفيذ في المتصفحات الرئيسية ، فإن هذه الميزة تنطوي على إمكانية تعزيز الدقة المطبعية واتساق التصميم."
    ],
    "commentSummary": [
      "تسلط مناقشات GitHub الضوء على أهمية خصائص CSS مثل Text-Box-Trim و Margin-Trim لتحسين طباعة الويب ، مع ذكر أدوات مثل Capsize.",
      "تتعمق المحادثة في قدرات متصفح Safari التي تؤثر على تصميم الويب ، مع التركيز على أهمية المستخدمين والمطورين وبائعي المتصفحات في تطوير الويب.",
      "يهتم المطورون ب Safari لعناصر التحكم المطبعية الجديدة لنظام iOS ، مثل ميزة \"Leading-Trim\" في CSS ، مما يعبر عن مزيج من الإثارة والشكوك حول مزاياها."
    ],
    "points": 208,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1714745509
  },
  {
    "id": 40252569,
    "title": "تقديم Mistral 7B: روبوت محادثة لاما 3 قائم على المتصفح مدعوم من WebGPU",
    "originLink": "https://github.com/abi/secret-llama",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40252569",
    "commentBody": "",
    "originSummary": [
      "أنشأ المؤلف Mistral 7B و Llama 3 ، واجهات قائمة على الويب تشبه ChatGPT ، مما يعزز إمكانية الوصول إلى مشروع WebLLM دون الحاجة إلى عمليات تثبيت أو تبعيات.",
      "يركز Mistral 7B و Llama 3 على العلاج والتدريب ، مع إعطاء الأولوية لخصوصية المستخدم من خلال الاحتفاظ بالبيانات الشخصية المخزنة محليا على كمبيوتر المستخدم.",
      "الأنسب لمتصفح Chrome أو Edge على أجهزة سطح المكتب ، قد يقوم Mistral 7B و Llama 3 بتوسيع دعم المتصفح ليشمل WebGPU ، مما يتيح عمليات تحميل لاحقة أسرع حيث يتم تخزين النموذج مؤقتا بعد التنزيل الأولي."
    ],
    "commentSummary": [
      "طور المستخدمون روبوت محادثة Llama 3 مجاني في المتصفح باستخدام WebGPU للعلاج والتدريب ، وهو متاح على Github لمستخدمي Chrome و Edge.",
      "تتضمن المناقشات تحسينات محتملة ، وإصدارات نماذج متعددة ، وتعليقات سجل الدردشة ، وتشغيل برنامج LLM المحلي ، ومنصات الألعاب المستندة إلى المتصفح ، وإعدادات النموذج الأساسي المختلفة ، ومشاكل GPU في المتصفحات ، وتكامل WebGPU في Firefox.",
      "بالإضافة إلى ذلك ، يستكشف المستخدمون Llamafile ، وهي أداة لاستخدام نماذج اللغات الكبيرة في المتصفح مع تسريع GPU."
    ],
    "points": 201,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1714771606
  },
  {
    "id": 40250519,
    "title": "تحسين الأعداد الأولية 1024 بت باستخدام الصدأ: اختراق في الأداء",
    "originLink": "https://glitchcomet.com/articles/1024-bit-primes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40250519",
    "commentBody": "",
    "originSummary": [
      "يستكشف المؤلف الأعداد الأولية من خلال إنشاء أعداد أولية 1024 بت لخوارزمية RSA في Rust ، وتنفيذ نظرية فيرما الصغيرة ، واختبار أولية ميلر-رابين ، وبنية بيانات BigInt مخصصة.",
      "من خلال الاستفادة من المعالجة المتوازية والخوارزميات المحسنة ، يحقق المؤلف العثور على عدد أولي 1024 بت في حوالي 40 مللي ثانية في المتوسط ، مما يدل على تحسينات كبيرة في الأداء.",
      "على الرغم من أن المشروع ليس آمنا من الناحية المشفرة ، إلا أنه يوفر رؤى قيمة وفرصا تعليمية في مجال توليد الأرقام الأولية وتحسين الخوارزمية."
    ],
    "commentSummary": [
      "تستكشف المقالة إنشاء أعداد أولية 1024 بت ، واختبارات أولية سريعة ، وضرب مونتغمري ، وتعدين العملات المشفرة.",
      "ويغطي تشفير RSA ، ودعم الأجهزة ، و bignums في برمجة C ، باستخدام الخوارزميات الحتمية للاكتشاف الأولي ، وفرضية ريمان.",
      "تستلزم المناقشات تحسين الكود لاكتشاف الأعداد الأولية ، وإنشاء أعداد أولية آمنة للتشفير ، وتحقيق التوازن بين الكفاءة والأمان ، بما في ذلك توليد المفاتيح ، والانتروبيا ، وتوليد مفاتيح PGP ، والجدل المتعلق ب Elon Musk."
    ],
    "points": 181,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1714759613
  },
  {
    "id": 40252525,
    "title": "إلغاء الاشتراك في تحكيم Discord: الموعد النهائي في 30 يوما",
    "originLink": "https://bsky.app/profile/silverwuffamute.bsky.social/post/3kqbd476nvk2i",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40252525",
    "commentBody": "",
    "originSummary": [
      "يناقش المنشور كود CSS لتصميم تطبيقات الويب ، ويغطي التخطيط ، وسمات الألوان ، وتعديلات العناصر المحددة.",
      "كما يوفر تفاصيل حول إلغاء الاشتراك في التحكيم على Discord في غضون 30 يوما عبر البريد الإلكتروني."
    ],
    "commentSummary": [
      "تقدم Discord التحكيم القسري دون موافقة جمعية التحكيم الأمريكية ، مما يدفع المستخدمين إلى إلغاء الاشتراك على الفور لتجنب العواقب المحتملة.",
      "يركز النقاش على تأثير التحكيم القسري على حماية المستهلك ومسؤولية الشركات وضرورة اتخاذ إجراءات تشريعية لضمان الوصول إلى العدالة ومكافحة شروط العقد غير العادلة.",
      "تشمل المخاوف التي أثيرت انتهاكات الخصوصية ، وحقوق المستخدم ، والنضال من أجل التنقل في شروط الخدمة المتعددة ، وتحقيق الدخل المحتمل من بيانات المستخدم ، ووجود محتوى صريح على المنصة."
    ],
    "points": 168,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1714771257
  },
  {
    "id": 40252619,
    "title": "مايكروسوفت تربط الدفع التنفيذي بتحسينات الأمان",
    "originLink": "https://arstechnica.com/information-technology/2024/05/microsoft-ties-executive-pay-to-security-following-multiple-failures-and-breaches/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40252619",
    "commentBody": "",
    "originSummary": [
      "تعرضت Microsoft لانتقادات بسبب الانتهاكات الأمنية ، مما أثر على ثقة مختلف أصحاب المصلحة في السنوات الأخيرة.",
      "وردا على ذلك، أطلقت مايكروسوفت \"مبادرة المستقبل الآمن\" لإعطاء الأولوية للأمن من خلال ربط أجور المديرين التنفيذيين بتحقيق الأهداف الأمنية.",
      "تتضمن المبادرة خططا لتحسين الممارسات الأمنية مثل المصادقة متعددة العوامل ، والوصول الأقل امتيازا ، وتعزيز مراقبة الشبكة ، مع تأكيد الرئيس التنفيذي ساتيا ناديلا على أهمية الأمان على الميزات الجديدة."
    ],
    "commentSummary": [
      "تقوم Microsoft بربط تعويضات المديرين التنفيذيين بالجهود الأمنية بعد الحوادث والانتهاكات الأمنية الأخيرة.",
      "هناك نقاش حول أهمية تحميل المديرين التنفيذيين مسؤولية الأمن وتنفيذ حصص التنوع.",
      "تناقش صناعة التكنولوجيا تحديات تحديد الجدارة في التوظيف وتعزيز الشفافية وتحفيز أولويات الأمان في Microsoft."
    ],
    "points": 167,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1714771952
  },
  {
    "id": 40254602,
    "title": "تستهدف Nintendo مستودعات GitHub 8k لعمليات إزالة محاكي Yuzu Switch",
    "originLink": "https://www.engadget.com/nintendo-blitzes-github-with-over-8000-emulator-related-dmca-takedowns-200021877.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40254602",
    "commentBody": "",
    "originSummary": [
      "أرسلت Nintendo أكثر من 8000 إشعار إزالة بموجب قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية إلى مستودعات GitHub تحتوي على رمز من محاكي Yuzu Switch ، المتهم بالترويج للقرصنة.",
      "قام محاكي Yuzu مؤخرا بتسوية دعوى قضائية بقيمة 2.4 مليون دولار مع Nintendo قبل فيضان إشعارات الإزالة على GitHub.",
      "يمكن أن تؤثر الإجراءات القانونية التي تتخذها Nintendo ضد المحاكيات ، مثل Yuzu ، على المساعي التي تهدف إلى الحفاظ على الألعاب."
    ],
    "commentSummary": [
      "أصدرت Nintendo طلبات إزالة DMCA على GitHub للمحتوى المرتبط بالمحاكي ، مشيرة إلى انتهاكات القسم 1201 من قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية ، مما أثار مناقشات حول شرعية قوانين المحاكاة والهندسة العكسية وحقوق النشر.",
      "تتضمن المناقشات استكشاف الخيارات اللامركزية مثل Radicle و BitTorrent لاستضافة مستودعات git وتأثيرات قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية على توزيع المحتوى الرقمي.",
      "- تستهدف نينتندو مطوري المحاكيات، مما يغذي المناقشات حول شرعية المحاكاة، وقواعد قانون الألفية الجديدة لحقوق طبع ونشر المواد الرقمية، ودور الشركات في حماية الملكية الفكرية، إلى جانب دعوات للمقاطعة والإصلاح القانوني لمنصات الاستضافة اللامركزية."
    ],
    "points": 165,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1714793877
  },
  {
    "id": 40255209,
    "title": "رحلة اكتشاف: من تطوير الويب إلى إصلاح الدراجات",
    "originLink": "https://tegowerk.eu/posts/bicycle-repair/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40255209",
    "commentBody": "",
    "originSummary": [
      "في عام 2020 ، وجد الراوي شغفا بإصلاح الدراجات من خلال العمل على دراجتين قديمتين ، والتعلم من خلال التجربة والخطأ والموارد عبر الإنترنت.",
      "غيرت هذه الهواية وجهة نظرهم حول العمل والأشياء الملموسة والوفاء مقارنة بعملهم اليومي لتطوير الويب.",
      "جلب تبني العمل العملي ارتياحا جديدا وتقديرا أعمق للحرفية وتأثيرها على كل من الأشياء والأفراد."
    ],
    "commentSummary": [
      "تدور المناقشة حول حب ركوب الدراجات وكره الصيانة ، واستكشاف تقنيات الصيانة المختلفة مثل النقل الإلكتروني وتشحيم الشمع لصيانة منخفضة.",
      "يزن المشاركون تكلفة وفوائد الدراجات مقابل السيارات ، ويجدون قيمة علاجية في صيانة الدراجات ، ويستمدون الرضا من تخصيص الدراجات وإصلاحها.",
      "تسلط المحادثة الضوء على التحديات في صيانة الدراجات المختلفة ، والحاجة إلى خيارات إصلاح مريحة ، والتوازن بين البساطة والأداء في صيانة الدراجات ، حيث يعبر البعض عن الإحباط بينما يجد البعض الآخر المتعة في هذه العملية."
    ],
    "points": 154,
    "commentCount": 100,
    "retryCount": 0,
    "time": 1714801816
  }
]
