[
  {
    "id": 39702604,
    "title": "Oregon säätää korjausoikeuslain Applen vastustuksesta huolimatta",
    "originLink": "https://www.techdirt.com/2024/03/13/oregon-passes-right-to-repair-law-apple-lobbied-to-kill/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39702604",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Oregon on Applen vastustuksesta huolimatta hyväksynyt korjauksiin oikeuttavan lain, jossa asetetaan sertifiointistandardit riippumattomille korjauspalveluiden tarjoajille.",
      "Keskustelua käydään siitä, miten tämä laki vaikuttaa korjausteollisuuteen, kun ollaan huolissaan siitä, että valmistajat valvovat sertifiointia ja analysoivat lain sanamuotoa.",
      "Keskusteluissa käsitellään myös Applen kantaa, tietoturvaominaisuuksia, sähköisen jätteen vaikutuksia sekä eettisiä pulmia teknologian korjauspolitiikassa ja lobbausstrategioissa."
    ],
    "points": 547,
    "commentCount": 140,
    "retryCount": 0,
    "time": 1710416556
  },
  {
    "id": 39706968,
    "title": "Menestyksen skaalautuminen: Figman Postgres Sharding -vallankumous",
    "originLink": "https://www.figma.com/blog/how-figmas-databases-team-lived-to-tell-the-scale/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39706968",
    "commentBody": "",
    "originSummary": [
      "Figman tietokantatiimi toteutti onnistuneesti horisontaalisen jakamisen Postgres-pinossaan lähes äärettömän skaalautuvuuden saavuttamiseksi ja valitsi RDS Postgresin NoSQL-tietokantojen sijasta asiantuntemuksen vuoksi, mikä parantaa skaalautuvuutta ja luotettavuutta ja vaikuttaa mahdollisimman vähän tuotelogiikkaan.",
      "Sharding-avaimet ja hash-funktiot olivat avainasemassa tietojen tehokkaassa reitittämisessä, ja uuden golang-palvelun, DBProxyn, ja sharded-näkymien luominen sharded-tietokantoihin tehostaakseen toimintoja ja vastatakseen haasteisiin, kuten skeemapäivityksiin ja cross-shard-tapahtumiin.",
      "Ryhmä aikoo arvioida nykyistä ratkaisuaan ja tutkia vaihtoehtoisia lähestymistapoja järjestelmän parantamiseksi tulevaisuudessa."
    ],
    "commentSummary": [
      "Figma valitsi horisontaalisen jakamisen sen sijaan, että olisi siirtynyt YugabyteDB:hen taulukoidensa skaalaamiseksi, ja perusteli RDS:n käyttöä kustannuksilla ja siirtymisriskeillä.",
      "Keskustelussa käsitellään erilaisia tietokantojen hallintastrategioita, mukaan lukien monimiehitys, yksi tietokanta asiakasta kohti ja Citusin käyttö skaalautumiseen, ja korostetaan kunkin lähestymistavan monimutkaisuutta ja etuja.",
      "Keskustelussa tarkastellaan myös hajautettuihin tietokantoihin tukeutuvien startup-yritysten näkökohtia ja toimittajan sitoutumisen riskejä, kuten Google Cloud Spannerin tapauksessa."
    ],
    "points": 516,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1710438690
  },
  {
    "id": 39702568,
    "title": "SpaceX toimittaa innovatiivisen tehtävän kansainväliselle avaruusasemalle",
    "originLink": "https://www.spacex.com/launches/mission/?missionId=starship-flight-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39702568",
    "commentBody": "",
    "originSummary": [
      "Tiivistelmässä selitetään SpaceX:n lento kansainväliselle avaruusasemalle Falcon 9 -raketin ja Dragon-avaruusaluksen avulla, ja siinä käsitellään lentoonlähtöä, kiertoradan aktivointia, vaiheistuspolttoja, telakointia ja paineistusvaiheita.",
      "SpaceX suorittaa huolelliset paikannuspoltot ja telakointimanööverit miehistön saapumista varten lähestyttyään asemaa.",
      "Lisäksi siinä korostetaan SpaceX:n muita hankkeita, kuten Starlink ja Starship, ja korostetaan niiden sitoutumista yksityisyyteen ja yhteistyötä toimittajien kanssa."
    ],
    "commentSummary": [
      "Keskustelussa syvennytään SpaceX:n Starship-ohjelmaan ja käsitellään onnistuneita lentokokeita, paluuseen liittyviä haasteita, kiertoradan nopeutta ja tulevia lähetysmahdollisuuksia.",
      "Lisäksi käsitellään SpaceX:nä esiintyviä väärennettyjä sosiaalisen median tilejä, raketin lentoradan yksityiskohtia ja polttoaineen siirron merkitystä avaruudessa.",
      "Eri rakettialoitteiden ja SpaceX:n Starship-aluksen kautta tapahtuvan ihmisen kuuhun laskeutumisen mahdollisuuksien vertailua tutkitaan."
    ],
    "points": 476,
    "commentCount": 374,
    "retryCount": 0,
    "time": 1710416252
  },
  {
    "id": 39708957,
    "title": "FCC nostaa laajakaistan vähimmäisnopeuden 100 Mbps:iin",
    "originLink": "https://www.pcmag.com/news/fcc-officially-raises-minimum-broadband-metric-from-25mbps-to-100mbps",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39708957",
    "commentBody": "",
    "originSummary": [
      "FCC nosti laajakaistan vähimmäisnopeuden 25 Mbps:stä 100 Mbps:iin latausten osalta ja 20 Mbps:iin latausten osalta, jotta alipalvelualueet voitaisiin tunnistaa paremmin ja jotta valtion varoja voitaisiin kohdentaa paremmin.",
      "Tulevaisuuden suunnitelmissa on nostaa laajakaistamittari 1 000 Mbps:iin latausten osalta ja 500 Mbps:iin latausten osalta.",
      "Republikaanikomissaarit olivat eri mieltä ja ehdottivat, että SpaceX:n Starlinkin kaltaiset satelliitti-internetpalvelut, jotka tarjoavat nopeita yhteyksiä, olisi otettava huomioon nopeusvertailuarvoissa."
    ],
    "commentSummary": [
      "FCC on nostanut laajakaistan vähimmäisnopeusvaatimuksen 100 Mbps:iin, mikä on herättänyt keskustelua suurempien latausnopeuksien tarpeellisuudesta ja internet-teknologian kehityksestä.",
      "Käyttäjät panevat merkille palveluntarjoajien tekemät parannukset, korostavat symmetristen yhteyksien merkitystä ja FCC:n säännösten vaikutusta laajakaistanopeuksiin.",
      "Keskusteluissa korostetaan nopeampien nopeuksien, luotettavan infrastruktuurin ja kaikkien käyttäjien tasapuolisen internetin käyttömahdollisuuden merkitystä, kun otetaan huomioon huoli mahdollisista kustannusten nousuista ja käyttömahdollisuuksien haasteista."
    ],
    "points": 449,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1710450254
  },
  {
    "id": 39709089,
    "title": "Onerep.comin toimitusjohtaja liittyy useisiin henkilöhakuyrityksiin",
    "originLink": "https://krebsonsecurity.com/2024/03/ceo-of-data-privacy-company-onerep-com-founded-dozens-of-people-search-firms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39709089",
    "commentBody": "",
    "originSummary": [
      "Onerep.com, tietosuojaa tarjoava yritys, on tarkastelun kohteena, koska se toimii Valko-Venäjältä ja Kyprokselta käsin, ja sen perustaja on käynnistänyt useita henkilöhakupalveluja.",
      "Vaikka Onerep on kiistänyt yhteyden, se on epäillyt yhteyksiä Nuwber.com-ihmistenhakusivustoon, mikä herättää eettisiä huolenaiheita henkilötietojen myymisestä ja niiden poistamisesta veloittamisesta.",
      "Perustaja Dimitri Shelest, joka tunnetaan aiemmasta aggressiivisesta sähköpostimarkkinoinnista ja roskapostin kumppanuusohjelmista, on ristiriidassa yrityksen sitoutumisen kanssa verkkoturvallisuuteen, minkä vuoksi KrebsOnSecurity on tutkinut tiedonvälittäjiä ja henkilöhakupalvelujen tarjoajia."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään tietosuojaa, maineenhallintaa ja poliittisten tuotteiden myynnin eettisyyttä sekä käsitellään henkilökohtaisten tietojen poistamiseen verkossa liittyviä haasteita ja tietosuoja-alan yritysten roolia.",
      "Aiheita ovat muun muassa tekoälyteknologian käyttö, teknologiajättien vaikutus yksityisyyteen, keskustelut \"poista minut\" -palvelujen tehokkuudesta ja tiedonkeruukäytäntöjen eettisistä vaikutuksista.",
      "Siinä korostetaan yksityisyyden suojan ylläpitämisen monimutkaisuutta verkossa ja vaaditaan tiukempaa sääntelyä digitaalisella alalla."
    ],
    "points": 438,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1710451053
  },
  {
    "id": 39706330,
    "title": "Miksi modernit sohvat jäävät vajaiksi: kertakäyttöhuonekalukulttuurin nousu",
    "originLink": "https://www.dwell.com/article/dtc-sofa-crisis-32304b9e",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39706330",
    "commentBody": "",
    "originSummary": [
      "Artikkelissa huomautetaan, että nykyaikaisten sohvien laatu on heikentynyt, mikä johtuu halvemmista materiaaleista ja tuotantomenetelmistä, jotka edistävät kertakäyttökalusteiden kulttuuria.",
      "Se suosittelee, että tämän trendin torjumiseksi valitaan vanhoja, laadukkaita vaatekappaleita trendikkäiden mutta huonosti valmistettujen vaihtoehtojen sijaan.",
      "Amerikkalaisen huonekaluteollisuuden siirtyminen ulkomaantuotantoon, erityisesti Pohjois-Carolinassa, on johtanut paikallisten työpaikkojen vähenemiseen, mikä on saanut kuluttajat kääntymään vintage-sohvien puoleen paremman laadun ja ainutlaatuisuuden vuoksi."
    ],
    "commentSummary": [
      "Käyttäjien mielipiteet IKEA-huonekalujen laadusta ja kestävyydestä vaihtelevat: jotkut kehuvat niiden pitkäikäisyyttä, kun taas toisilla on ongelmia esimerkiksi lastulevyn kaltaisten materiaalien kanssa.",
      "IKEA-huonekalujen kestävyyttä parantavia suosituksia ovat massiivipuun valinta ja huolellinen kokoonpano.",
      "Jotkin käyttäjät suosivat antiikki- tai huippumerkkejä paremman kestävyyden vuoksi, ja lisäksi he antoivat ehdotuksia IKEA-tavarataloissa liikkumiseen ja huonekalujen tehokkaaseen kokoamiseen."
    ],
    "points": 423,
    "commentCount": 430,
    "retryCount": 0,
    "time": 1710435420
  },
  {
    "id": 39712618,
    "title": "Entinen Boeingin ilmiantaja ennusti kuoleman; perheen ystävä epäilee vilpillistä peliä",
    "originLink": "https://abcnews4.com/news/local/if-anything-happens-its-not-suicide-boeing-whistleblowers-prediction-before-death-south-carolina-abc-news-4-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39712618",
    "commentBody": "",
    "originSummary": [
      "Entinen Boeingin ilmiantaja John Barnett ennusti kuolemansa ennen kuolemaansa, ja hänen perheensä ystävä epäilee, ettei kyseessä ollut itsemurha.",
      "Barnett oli aiemmin ilmaissut huolensa Boeingin vaarallisista käytännöistä ja pelännyt kostotoimia puhumisestaan.",
      "Juttu Boeingia vastaan jatkuu Barnettin kuolemasta huolimatta, ja Boeing on ilmaissut surunsa tilanteesta."
    ],
    "commentSummary": [
      "Keskustelussa käsitellään epäilyttäviä kuolemantapauksia, salaliittoteorioita ja kiistoja, jotka liittyvät ilmiantajiin, Boeingin kaltaisiin yrityksiin ja Jeffrey Epsteinin kaltaisiin julkisuuden henkilöihin.",
      "Se kattaa huolenaiheet, jotka liittyvät rikoksiin, turvallisuuteen, etiikkaan, virallisten tarinoiden epäilyyn sekä tutkimusten ja vaikutusvaltaisia tahoja paljastavien henkilöiden suojelun tärkeyteen.",
      "Lisäksi keskusteluissa tarkastellaan yhteiskunnallisia normeja, pahan tavanomaisuuden käsitettä ja vaikeuksia, joita ilmiantajat kohtaavat paljastaessaan väärinkäytöksiä."
    ],
    "points": 391,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1710484359
  },
  {
    "id": 39706004,
    "title": "Automatisoi selaimen tehtäviä Skyvernin LLM:n ja Computer Visionin avulla.",
    "originLink": "https://github.com/Skyvern-AI/skyvern",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39706004",
    "commentBody": "",
    "originSummary": [
      "Skyvern on avoimen lähdekoodin työkalu, jossa hyödynnetään LLM:ää ja tietokonenäköä selainpohjaisten työnkulkujen automatisoimiseksi luonnollisen kielen API:lla back-office-tehtäviä varten.",
      "Se ratkaisee työnkulun skaalautuvuushaasteita hyödyntämällä LLM:iä analysoimaan verkkosivustojen ulkoasuja ja mukauttamaan niitä ilman XPatheja, ja se tukee tällä hetkellä esimerkiksi hankintoja ja viranomaisten vuorovaikutusta.",
      "Työkalu aikoo ryhtyä automatisoimaan lääketieteellisten EHR-tietojen syöttöä ja asiakastutkimusta, mutta se on vielä varhaisessa kehitysvaiheessa ja etsii käyttäjien mielipiteitä."
    ],
    "commentSummary": [
      "Skyvern on avoimen lähdekoodin työkalu, joka hyödyntää suuria kielimalleja (LLM) ja tietokonenäköä selainpohjaisten työnkulkujen automatisointiin ja tarjoaa luonnollisen kielen API:n back-office-tehtäviin, kuten hankintoihin ja työhakemuksiin.",
      "Keskusteluissa käsitellään LLM:ien hyödyntämistä verkkokaapimiseen, automaation haasteita, kuten kustannuksia ja roskapostin torjuntaa, sekä CAPTCHA-palveluiden mahdollisia haavoittuvuuksia.",
      "Tulevaisuuden suunnitelmiin kuuluu laajentaminen lääketieteelliseen tietojen syöttöön, LLM-reitittimen käyttöönotto käyttäjän avuksi ja itsepalvelun käyttöliittymän luominen asiakastietokannan saatavuuden parantamiseksi."
    ],
    "points": 345,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1710433894
  },
  {
    "id": 39702479,
    "title": "Švejkin perintö: humoristinen satiiri sodasta",
    "originLink": "https://blogs.loc.gov/international-collections/2018/03/the-good-soldier-vejk/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39702479",
    "commentBody": "",
    "originSummary": [
      "\"Hyvä sotilas Švejk\" on tšekkiläisen kirjailijan Jaroslav Hašekin satiirinen romaani, joka kuvaa antisankari Josef Švejkiä ensimmäisessä maailmansodassa ja pilkkaa byrokratiaa, armeijaa ja sotaa.",
      "Romaani on käännetty useille kielille, ja se on toiminut inspiraationa erilaisille sovituksille, kuten näytelmille, elokuville ja sarjakuville.",
      "Huolimatta siitä, että Hašek kuoli ennenaikaisesti ennen kuin hän sai suunnitellut kuusi osaa valmiiksi, Švejkin perintö vaikuttaa ja inspiroi edelleen sukupolvia."
    ],
    "commentSummary": [
      "Keskustelussa syvennytään klassikkokirjoihin, kuten \"Hyvä sotilas Švejk\", \"Pieni prinssi\" ja \"Catch-22\", ja korostetaan huumoria ja yhteiskuntakritiikkiä niiden tarinoissa.",
      "Lukijat tutkivat ajan myötä muuttuvia näkökulmia lapsuuden suosikkeihin ja pohtivat tarinoiden teemoja ja subtekstejä.",
      "Oivallukset käsittelevät Švejkin kestävää vetovoimaa, sen huumoria, kuvitusta ja ihmishengen tarkastelua sekä keskustelua sotilaselämästä, yhteiskunnasta, Tšekkoslovakiasta toisessa maailmansodassa, kulttuuri-identiteetistä ja kielellisistä eroista sekä kirjailija Jaroslav Hašekin poliittisia näkemyksiä ja siirtotyöläisten työtä Venäjällä."
    ],
    "points": 307,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1710415393
  },
  {
    "id": 39710454,
    "title": "Getty Museum ja Smithsonian tarjoavat 88k ilmaista taidekuvaa",
    "originLink": "https://www.openculture.com/2024/03/the-getty-makes-nearly-88000-art-images-free-to-use-however-you-like.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39710454",
    "commentBody": "",
    "originSummary": [
      "Getty Museum ja Smithsonian Museum tarjoavat korkearesoluutioisia kuvia ja taidekirjoja julkiseen käyttöön Creative Commons Zero -lisenssillä.",
      "Open Culture tarjoaa ilmaista opetusmateriaalia, kuten äänikirjoja, verkkokursseja ja elokuvia, joissa on esillä taiteen, kirjallisuuden, elokuvan ja filosofian merkkihenkilöitä.",
      "Dan Colmanin johtama Open Culture on puolustanut vapaita opetusresursseja vuodesta 2006 lähtien."
    ],
    "commentSummary": [
      "Getty-museo on avannut julkiseen käyttöön lähes 88 000 taidekuvaa, joista osa on julkista omaisuutta.",
      "Keskusteluissa käsitellään tekijänoikeussäännöksiä, korkealaatuisten kuvien käyttöä sekä museokuvien hyödyntämisen laillisuutta ja käytännöllisyyttä internetissä.",
      "Keskusteluissa käsitellään myös taiteilijoiden lisensointia tekoälymalleille, pelkoja siitä, että tekoäly korvaa ihmisartistit, sekä tekoälyyn liittyviä eettisiä ongelmia taiteen alalla."
    ],
    "points": 284,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1710460395
  },
  {
    "id": 39704914,
    "title": "Voyager 1:n viestintäongelman ratkaisemisessa edistytty",
    "originLink": "https://www.theregister.com/2024/03/14/voyager_1_not_dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39704914",
    "commentBody": "",
    "originSummary": [
      "Voyager 1 -avaruusalus on saattanut ratkaista viestintäongelmansa saatuaan korjaavan komennon, joka purki onnistuneen muistitiedoston Flight Data System -järjestelmästä.",
      "Insinöörit analysoivat nyt tietoja ja vertaavat niitä aiempiin lähetyksiin vianmäärityksen jatkamiseksi.",
      "Haasteita ovat muun muassa huomattavat viestintäviiveet ja sellaisten insinöörien löytäminen, joilla on tarvittava asiantuntemus ongelman ratkaisemiseksi."
    ],
    "commentSummary": [
      "Voyager-avaruusaluksen kaltaisten vanhojen projektien parissa työskentelevät insinöörit kohtaavat haasteita, kuten puutteellinen dokumentaatio, ohjelmistojen ylläpitoon liittyvät ongelmat ja rahoitusrajoitukset.",
      "Tekstissä keskustellaan mahdollisesta tulevasta vuorovaikutuksesta Voyager 1:n kanssa ja ajatuksesta lähettää aluksia tutkimaan avaruutta sekä koodauskäytännöistä ja vanhentuneen teknologian ymmärtämisestä.",
      "Siinä tarkastellaan myös kapitalismin vaikutusta ohjelmistokehitykseen vanhojen hankkeiden yhteydessä."
    ],
    "points": 279,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1710428549
  },
  {
    "id": 39710455,
    "title": "NY sulkee tekijänoikeustrollin markkinoilta epäeettisten käytäntöjen vuoksi",
    "originLink": "https://abovethelaw.com/2024/03/new-york-disbars-infamous-copyright-troll/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39710455",
    "commentBody": "",
    "originSummary": [
      "New Yorkissa toimiva tekijänoikeustrolli Richard Liebowitz on menettänyt toimilupansa epäeettisen käytöksen, kuten valehtelun, viivyttelyn ja oikeuden määräysten noudattamatta jättämisen vuoksi.",
      "Liebowitzin kaltaiset tekijänoikeustrollit lähettävät yrityksille pelottelevia kirjeitä, joissa he väittävät tekijänoikeusrikkomuksia ja vaativat muhkeita korvauksia.",
      "Tämä oikeudenmenetys korostaa vaaroja, joita liittyy saalistavien tekijänoikeuskäytäntöjen harjoittamiseen ilman tarvittavia oikeudellisia valmiuksia, ja osoittaa epärehellisyyden ja kiertämisen seuraukset oikeudenkäynneissä."
    ],
    "commentSummary": [
      "Tekijänoikeuslakimies Richard Liebowitzilta on New Yorkissa evätty asianajajan lupa epäeettisen käytöksen, muun muassa epärehellisyyden vuoksi tekijänoikeustapauksissa, mikä on herättänyt keskustelua asianajajien vastuuvelvollisuudesta.",
      "Tekijänoikeuslakien väärinkäyttö ja epäeettiset käytännöt, kuten uhkauskirjeiden lähettäminen yrityksille, herättävät huolta ja herättävät kysymyksiä oikeudellisesta etiikasta.",
      "Tapauksessa korostetaan perusteellisen tutkimuksen ja eettisen toiminnan merkitystä tekijänoikeus- ja patenttiasioissa ja korostetaan oikeudellisten päätösten vaikutusta näissä asioissa."
    ],
    "points": 251,
    "commentCount": 56,
    "retryCount": 0,
    "time": 1710460400
  },
  {
    "id": 39704304,
    "title": "Opiskelijat voittavat hackathonin innovatiivisella ruokailutottumusten yhteenvetoprojektilla",
    "originLink": "https://jero.zone/posts/meal-plan-wrapped",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39704304",
    "commentBody": "",
    "originSummary": [
      "Kirjoittaja ja ystävä Ben voittivat Tuftsin yliopistossa järjestetyn hackathonin projektilla, joka tekee yhteenvedon opiskelijoiden ruokailutottumuksista ja houkutteli satoja käyttäjiä älykkäiden mainosstrategioiden avulla.",
      "He havaitsivat heikkouksia yliopiston ateriasuunnitelmaportaalissa, jossa he käyttivät vieraiden pääsyä tietojen keräämiseen huolimatta teknisistä esteistä kirjautumisessa ja tietojen hakemisessa.",
      "Haasteiden voittamisen jälkeen he saivat kiitosta projektin suunnittelusta, mikä teki kokemuksesta antoisan ja tyydyttävän sekä kirjoittajalle että Benille."
    ],
    "commentSummary": [
      "Kirjoittaja pohtii kypsyyden ja empatian merkitystä insinöörityössä voitettuaan hackathonin, ja hän keskustelee vanhoista järjestelmistä, tietoturvaongelmista sekä tuoreiden ideoiden ja alan vakauden tasapainottamisesta.",
      "Keskustelussa käsitellään myös sellaisia aiheita kuin koodin uudelleenmuokkaus, vanhentuneiden käytäntöjen päivittäminen, eettinen hakkerointi ja yliopistojen järjestelmien löyhä tietoturva.",
      "Kirjoituksessa tarkastellaan hackathonien etuja ja haittoja verrattuna perinteisiin tutkimusapurahoihin ja kerrotaan kokemuksia prototyyppejä esittelevistä tiimeistä, joiden käyttäjät kokivat haasteet väsyttäviksi hauskuudesta ja innovatiivisuudesta huolimatta."
    ],
    "points": 239,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1710425703
  }
]
