[
  {
    "id": 40077533,
    "title": "Predstavujeme Meta Llama 3: model umelej inteligencie pre responzívny dizajn",
    "originLink": "https://llama.meta.com/llama3/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40077533",
    "commentBody": "",
    "originSummary": [
      "V texte sú prezentované mediálne dotazy CSS pre responzívny dizajn v rôznych veľkostiach obrazovky, ktoré podporujú model Meta Llama 3 AI.",
      "Upozorňuje na výkon, škálovateľnosť a integráciu Meta Llama 3 v rámci Meta AI spolu s usmerneniami Trust & Safety, aktualizáciami a nástrojmi na zodpovedný vývoj.",
      "Úryvok kódu obsahuje atribúty štýlovania pre rôzne šírky obrazovky a predstavuje Meta Llama 3 ako existujúci LLM najvyššej úrovne."
    ],
    "commentSummary": [
      "V texte sa skúma model Meta Llama 3 AI, porovnáva sa jeho výkonnosť s inými modelmi a zdôrazňuje sa jeho status otvorenej váhy.",
      "Diskutuje sa o jeho integrácii s produktmi Meta, dôsledkoch otvorenej váhy, licenciách, nariadeniach EÚ, problémoch s dodržiavaním predpisov a vplyve na podniky.",
      "Rozhovor sa venuje modelom umelej inteligencie, štýlu vedenia technologických riaditeľov, metaverse, príspevkom do open-source, konkurenčným stratégiám, dravým cenám, trendom v oblasti platov softvérových inžinierov a dôsledkom otvoreného poskytovania modelov umelej inteligencie."
    ],
    "points": 1863,
    "commentCount": 780,
    "retryCount": 0,
    "time": 1713455842
  },
  {
    "id": 40078106,
    "title": "Dokumentácia pozorovaní tímu: Budovanie reputácie prostredníctvom strategického riešenia problémov",
    "originLink": "https://www.simplermachines.com/why-you-need-a-wtf-notebook/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40078106",
    "commentBody": "",
    "originSummary": [
      "Koncept \"zápisníka WTF\" zahŕňa dokumentovanie zvláštnych alebo znepokojujúcich postrehov pri nástupe do nového tímu s cieľom systematicky riešiť problémy a určiť ich priority na riešenie.",
      "Uprednostňovanie menších problémov na začiatku pred väčšími pomáha v tíme vybudovať si povesť aktívneho riešiteľa problémov.",
      "Zdôrazňovanie strategického riešenia problémov, aby ste sa vyhli nálepke večného sťažovateľa, môže viesť k výrazným zmenám a dôveryhodnosti v tíme."
    ],
    "commentSummary": [
      "Zdôrazňuje význam začlenenia nových pohľadov na použiteľnosť produktov a hodnotu nových členov tímu pri identifikácii a riešení problémov s cieľom zlepšiť spoluprácu.",
      "Rozoberá výzvy spojené s riešením problémov, stanovovaním hraníc a udržiavaním vzťahov na pracovisku, pričom zdôrazňuje úlohu taktického vedenia a pochopenia tímovej dynamiky.",
      "Zaoberá sa dôležitosťou dokumentovania počiatočných reakcií, zdieľania poznatkov, pozorovania interakcií používateľov a premietania problémov do merateľných ukazovateľov pre efektívne stratégie komunikácie a produktivity."
    ],
    "points": 481,
    "commentCount": 112,
    "retryCount": 0,
    "time": 1713458524
  },
  {
    "id": 40076345,
    "title": "Oživenie hry Halo 2: HD aktualizácia posúva Xbox na hranicu možností",
    "originLink": "https://icode4.coffee/?p=738",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40076345",
    "commentBody": "",
    "originSummary": [
      "Autor a jeho priateľ vylepšili pôvodnú Xbox verziu hry Halo 2 pridaním podpory HD rozlíšenia prostredníctvom úprav hardvéru a vlastných patchov.",
      "Pri vytváraní úspešnej záplaty s vysokým rozlíšením sme museli čeliť výzvam, ako je alokácia pamäte, optimalizácia kódu a vyskakovanie textúr, ktoré sa však podarilo prekonať.",
      "Vďaka využitiu väčšiny pamäte RAM konzoly sa zvýšil výkon a autor bol s výsledkami spokojný a otvorený ďalším vylepšeniam."
    ],
    "commentSummary": [
      "Článok sa zaoberá hraním hry Halo 2 v HD rozlíšení na pôvodnom Xboxe, porovnávaním rozlíšení a úpravou konzol pre vyššie rozlíšenie.",
      "Diskutuje sa v ňom o kódovaní videa, nostalgii za érou Xbox/Halo 2, výzvach v oblasti softvéru a vývoji herných technológií.",
      "Účastníci sa podelia o anekdoty týkajúce sa úpravy konzol, rodičovských obáv, kontroverzie o horúcej káve a schopností Halo 2 pre Windows Vista, pričom zdôraznia možnosti neustáleho vývoja v technologickom priemysle."
    ],
    "points": 398,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1713448866
  },
  {
    "id": 40081541,
    "title": "Uľahčenie vstupu do kalkulačky: Vychádzanie z kalkulačnej gramotnosti: zvládnutie základov",
    "originLink": "https://calculusmadeeasy.org/prologue.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40081541",
    "commentBody": "",
    "originSummary": [
      "Napriek tomu, že sa autor označuje za neinteligentného, tvrdí, že počty nie sú také náročné, ako sa všeobecne predpokladá, a zdôrazňuje, že je dôležité zvládnuť jednoduché výpočty, aby sme pochopili zložitejšie."
    ],
    "commentSummary": [
      "Pochopenie základných matematických pojmov, ako je algebra, je kľúčové pred riešením pokročilých tém, ako je kalkulus, so zameraním na praktické aplikácie a holistické učenie.",
      "Uvádzajú sa odporúčania na zdroje, knihy a doučovanie, ktoré sa zaoberajú výzvami a prínosmi štúdia matematiky, pričom sa zdôrazňuje význam rozvoja matematickej intuície a zručností pri riešení problémov.",
      "V diskusii sú zahrnuté diskusie o rôznych vyučovacích metódach a využívaní infinitezimálnych súčtov v matematike, pričom sa zdôrazňuje dôležitosť všestranného prístupu k matematickému vzdelávaniu."
    ],
    "points": 368,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1713480292
  },
  {
    "id": 40075402,
    "title": "Posádka Ocean Link: Prekonávanie výziev, aby sa internet udržal na hladine",
    "originLink": "https://www.theverge.com/c/24070570/internet-cables-undersea-deep-repair-ships",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40075402",
    "commentBody": "",
    "originSummary": [
      "Článok sa venuje rozhodujúcej úlohe posádky Ocean Link pri opravách podmorských internetových káblov pod vedením bývalého hlavného inžiniera Mitsuyoshiho Hiraia a zdôrazňuje výzvy, ktorým čelia, ako sú prírodné katastrofy, jadrové havárie a potreba prilákať nové talenty.",
      "Zdôrazňuje význam odvetvia podmorských káblov, ťažkosti spojené s údržbou starnúcej infraštruktúry a rastúce požiadavky spôsobené technologickým pokrokom a globálnym napätím, pričom záujem o arktickú káblovú trasu rastie.",
      "Napriek utajovaniu tohto odvetvia sa vyvíja úsilie o zapojenie mladších generácií, pričom úspešné nasadenie 100-kilometrového káblového systému dokazuje ich odolnosť a zručnosť."
    ],
    "commentSummary": [
      "V článku sa zdôrazňuje zásadná úloha námorného priemyslu pri udržiavaní podmorských káblov, ktoré sú kľúčové pre internetové pripojenie.",
      "Technickí potápači opisujú svoje skúsenosti s podvodnými výťahmi a diskutujú o nadmernej ponuke optických káblov na začiatku roka 2000 a optických zosilňovačoch.",
      "Čitatelia diskutujú o význame podmorských optických káblov v čase ich prerušenia a uvažujú o alternatívnych riešeniach, ako je satelitný internet."
    ],
    "points": 258,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1713442590
  },
  {
    "id": 40075598,
    "title": "Prezident Reagan reaguje na žiadosť chlapca o vyčistenie spálne",
    "originLink": "https://news.lettersofnote.com/p/my-mother-declared-my-bedroom-a-disaster",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40075598",
    "commentBody": "",
    "originSummary": [
      "V roku 1984 napísal 13-ročný chlapec Andy Smith z Južnej Karolíny prezidentovi Reaganovi žiadosť o poskytnutie federálnych prostriedkov na upratanie svojej špinavej spálne.",
      "Prezident Reagan reagoval, spomenul nedostatok dostupných finančných prostriedkov a navrhol Andymu, aby namiesto toho začal dobrovoľnícky program upratovania svojej izby.",
      "Táto historická anekdota zobrazuje bezstarostnú interakciu medzi malým chlapcom a prezidentom a zdôrazňuje význam osobnej zodpovednosti a humoru vo verejnej funkcii."
    ],
    "commentSummary": [
      "Diskusia sa zameriava na deti, ktoré si posielajú chladné e-maily s neznámymi ľuďmi, pričom sa zdôrazňuje potreba naučiť ich rozlišovať medzi bezpečnými a nebezpečnými osobami a diskutuje sa o potenciálnych rizikách a výhodách komunikácie s autormi a hudobníkmi.",
      "Témy zahŕňajú proces písania, produktivitu autorov a zábavné reakcie na listy, ako napríklad jeden spojený s prezidentom Reaganom, pričom sa zachováva odľahčený tón.",
      "Diskusia zdôrazňuje význam starostlivého dohľadu nad deťmi, ktoré prichádzajú do kontaktu s neznámymi ľuďmi."
    ],
    "points": 235,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1713444187
  },
  {
    "id": 40081314,
    "title": "Optimalizácia konvencie volania Rustu pre lepší výkon",
    "originLink": "https://mcyoung.xyz/2024/04/17/calling-convention/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40081314",
    "commentBody": "",
    "originSummary": [
      "Miguel Young de la Sota kritizuje konvenciu volania Rustu a navrhuje efektívnejšiu alternatívu, ktorá by bola v súlade so štandardmi ABI Linuxu C pre lepší výkon.",
      "Odporúča využiť ABI registrov Go na zvýšenie výkonu optimalizáciou konvencií volania funkcií Rust pomocou nového príznaku -Zcallconv, ktorý priamo špecifikuje LLVM.",
      "Miguel sa zameriava na zlepšenie generovania kódu Rustu, optimalizáciu používania registrov a vylepšenie aplikačných binárnych rozhraní s cieľom zvýšiť výkon a minimalizovať prevádzku pamäte, pričom preukáže odborné znalosti v LLVM."
    ],
    "commentSummary": [
      "V diskusii sa zdôrazňuje dôležitosť merania výkonu pri optimalizácii konvencií volania jazyka Rust so zameraním na rýchlosť a nie na vzhľad.",
      "Témy zahŕňajú stabilitu volacej konvencie jazyka Rust, optimalizáciu logických operácií na procesoroch x64, problémy so zmiešaním spravovaného a nespravovaného kódu a úvahy o návratových hodnotách funkcií v jazykoch C a C++.",
      "Rozhovor sa zaoberá aj vzájomnou spoluprácou medzi jazykmi, používaním volacích konvencií LLVM pre architektúru x86 a vplyvom volacích konvencií na výkon a kontrolu vývojárov s cieľom zvýšiť efektívnosť vykonávania kódu."
    ],
    "points": 215,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1713478393
  },
  {
    "id": 40077233,
    "title": "Zlepšenie front úloh systému Postgres pomocou deterministického radenia do okrúhlych front",
    "originLink": "https://docs.hatchet.run/blog/multi-tenant-queues",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40077233",
    "commentBody": "",
    "originSummary": [
      "V blogu sa skúmajú ťažkosti so spravodlivým radením do frontov úloh podporovaných systémom Postgres a ako riešenie sa navrhuje deterministické kruhové radenie do frontov.",
      "Podrobne popisuje nastavenie tabuľky úloh, odstraňovanie úloh z frontu, logiku dotazovania a zabránenie duplicitnému vyhľadávaniu úloh, pričom sa zmieňuje o problémoch s výkonom a navrhuje stav preplnenia a algoritmus sekvencovania na zlepšenie dotazov.",
      "Dotýka sa aj obmedzení súbežnosti, deterministického kruhového radenia a naznačuje pripravované pokrytie zabezpečenia spravodlivosti, pričom vyzýva na spätnú väzbu a upozorňuje na svoju spravovanú službu Hatchet Cloud."
    ],
    "commentSummary": [
      "Optimalizácia viacúčelových frontov v systéme Postgres zahŕňa zvýšenie výkonu dotazu pridaním indexu, odstránením filtra a úpravou štruktúry dotazu.",
      "Používanie tokenov na riadenie vlákien a databázových frontov pomáha pri efektívnom riadení vysokého zaťaženia spolu so stratégiami na zjednodušené spracovanie úloh.",
      "Diskutuje o nástrojoch, ako je deficitný round-robin v RabbitMQ, sharding shuffle, animácie jitter.video a Postgres RBAC na riadenie prístupu na základe riadkov v kontexte vážených úloh v systéme plánovania round-robin."
    ],
    "points": 180,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1713454017
  },
  {
    "id": 40083807,
    "title": "Spoločnosť Supabase Storage zavádza podporu protokolu S3",
    "originLink": "https://supabase.com/blog/s3-compatible-storage",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40083807",
    "commentBody": "",
    "originSummary": [
      "Úložisko Supabase teraz oficiálne podporuje kompatibilitu so službou S3 pre širšie možnosti integrácie.",
      "Odosielanie s možnosťou predĺženia sa presúva z beta verzie na verziu Všeobecne dostupné, ktorá je podporovaná protokolom TUS.",
      "Aktualizácie v nástroji Storage Engine zahŕňajú nahrávanie viacerých častí prostredníctvom S3, prenosy medzi jednotlivými kyblíkmi, štandardizované chybové kódy, migráciu viacerých používateľov a oddelené závislosti na zlepšenie funkčnosti."
    ],
    "commentSummary": [
      "Úložisko Supabase teraz podporuje protokol S3, čím sa zvyšuje kompatibilita s rôznymi nástrojmi na ukladanie a analýzu údajov.",
      "Používatelia sú spokojní s funkciami databázy Supabase, ako sú vopred podpísané adresy URL, zabezpečenie na úrovni riadkov, transformácie obrázkov, ukladanie do vyrovnávacej pamäte a overovanie pomocou SessionToken.",
      "Diskutuje sa o migrácii z Firebase na Supabase, pričom používatelia zdôrazňujú potrebu migračných pluginov a vyzdvihujú cenovú dostupnosť, potenciál a nedávnu podporu poskytovateľov CDN v Supabase."
    ],
    "points": 172,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1713505892
  },
  {
    "id": 40076848,
    "title": "Pustovník: Deterministické vykonávanie programov v reprodukovateľnom pieskovisku",
    "originLink": "https://github.com/facebookexperimental/hermit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40076848",
    "commentBody": "",
    "originSummary": [
      "Hermit je reprodukovateľný kontajner, ktorý zabezpečuje deterministické vykonávanie programov tým, že ich izoluje od nedeterministických zdrojov, ako je čas a generovanie náhodných čísel.",
      "Na dosiahnutie determinizmu zachytáva systémové volania, čo je vhodné na záťažové testovanie, záznam/prehrávanie, reprodukovateľné zostavenia a ladenie chýb súbežnosti.",
      "Hoci neizoluje programy od zmien súborového systému alebo externých sietí, už sa aktívne nevyvíja, ale môže bežať prostredníctvom nástroja Rust cargo, licencovaného pod BSD-3, podporujúceho x86_64 Linux s pokračujúcou podporou Aarch64."
    ],
    "commentSummary": [
      "Hermit je sandboxový nástroj určený na hermetické a reprodukovateľné spúšťanie programov zachytávaním syscallov, podobne ako rr, ale chýba mu podpora niektorých systémových volaní a nie je pravidelne aktualizovaný.",
      "Napriek snahe o determinizmus nemusí Hermit dosiahnuť úplný determinizmus kvôli faktorom, ako sú inštrukcie CPU a zachytávanie systémových volaní, obmedzovanie programov na beh na jednom CPU na účely analýzy a ladenia, a nie všeobecný sandboxing."
    ],
    "points": 156,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1713451610
  },
  {
    "id": 40077793,
    "title": "Projekt Dnsmasq získal prestížnu cenu BlueHats",
    "originLink": "https://nlnet.nl/news/2024/20240418-BlueHatsPrize1.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40077793",
    "commentBody": "",
    "originSummary": [
      "Cenu BlueHats, ktorú udeľuje francúzske Medziministerské riaditeľstvo pre digitálne technológie, získal Simon Kelley za svoju prácu na projekte dnsmasq, dôležitom nástroji s otvoreným zdrojovým kódom na adresovanie sietí.",
      "V roku 2024 bolo štyrom víťazom udelených 10 000 EUR, čím boli ocenení správcovia dôležitých projektov s otvoreným zdrojovým kódom, ako je Kelleyho široko používaný dnsmasq v smerovačoch, zariadeniach internetu vecí a operačnom systéme Android.",
      "V budúcnosti sa budú prijímať nominácie na cenu BlueHats s cieľom podporiť podporu a financovanie údržby kritického softvéru s otvoreným zdrojovým kódom."
    ],
    "commentSummary": [
      "Dnsmasq získal prvú cenu BlueHats od nlnet.nl za svoju všestrannosť a spoľahlivosť v rôznych sieťových prostrediach, ako sú domáce/SMB routery, operačné systémy Linux a osobné projekty.",
      "Toto ocenenie vyzdvihuje zásadnú úlohu spoločnosti Dnsmasq v oblasti IKT v rámci vládneho sektora, pričom cena je financovaná francúzskou vládou a organizovaná v spolupráci so spoločnosťou NLnet.",
      "Členovia komunity chválili Dnsmasq za jeho jednoduchosť a efektívnosť a zdôraznili dôležitosť uznania a podpory iniciatív s otvoreným zdrojovým kódom, ako je Dnsmasq."
    ],
    "points": 155,
    "commentCount": 28,
    "retryCount": 0,
    "time": 1713457200
  },
  {
    "id": 40082372,
    "title": "SeaMonkey 2.53.18.2: Prehľadávanie webu, e-mail, chat",
    "originLink": "https://www.seamonkey-project.org",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40082372",
    "commentBody": "",
    "originSummary": [
      "SeaMonkey je komplexný internetový balík s webovým prehliadačom, e-mailovým klientom, chatovým klientom a editorom HTML, ktorý vyvinul projekt SeaMonkey v spolupráci so spoločnosťou NordVPN.",
      "Najnovšia verzia SeaMonkey 2.53.18.2 obsahuje opravy chýb a vylepšenia, je založená na zdrojovom kóde prehliadača Mozilla Firefox a dostupná v rôznych jazykoch pre systémy Windows, MacOS x64 a Linux.",
      "Používatelia sú vyzývaní, aby sa zapájali do diskusií, nahlasovali chyby a vylepšovali produkt, pričom majú možnosť pridávať ďalšie funkcie prostredníctvom doplnkov SeaMonkey."
    ],
    "commentSummary": [
      "Používatelia balíka SeaMonkey All-in-One Internet Application Suite diskutujú o funkciách, ako sú chýbajúce témy, zastaraný editor HTML a kompatibilita s doplnkami Firefoxu, a vyjadrujú potrebu modernizácie.",
      "Používatelia majú zmiešané pocity; niektorí sa tešia z jeho nostalgie a jedinečných funkcií, zatiaľ čo iní si myslia, že si vyžaduje zásadné aktualizácie, aby zostal relevantný v súčasnom webovom prostredí.",
      "Viacerí používatelia tiež uprednostňujú používateľské rozhranie SeaMonkey pred inými prehliadačmi, čo prispieva k rôznym názorom na túto platformu."
    ],
    "points": 145,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1713488111
  },
  {
    "id": 40079647,
    "title": "Za hranicami jedla: Príbeh o prežití a zmyslových zážitkoch",
    "originLink": "https://longreads.com/2024/04/18/crohns-life-without-eating/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40079647",
    "commentBody": "",
    "originSummary": [
      "Príbeh sa zameriava na muža s Crohnovou chorobou, ktorý je odkázaný na enterálnu výživu a celkovú parenterálnu výživu (TPN), a skúma, ako choroba ovplyvňuje jeho vzťah k jedlu a duševnú pohodu.",
      "Skúma priekopnícku prácu Dr. Stanleyho Dudricka v oblasti vývoja TPN a psychologických vplyvov potravinovej deprivácie, pričom zdôrazňuje význam zmyslových aspektov pri zážitkoch z jedla.",
      "Rozprávanie sa zamýšľa nad kultúrnym a spoločenským významom jedla, pričom poukazuje na výzvy netradičného stravovania a na zložité prepojenie medzi jedlom, ľudskými skúsenosťami a lekárskou starostlivosťou."
    ],
    "commentSummary": [
      "V článku sa skúmajú psychologické dôsledky nedostatku jedla vrátane osobných anekdot o prejedaní sa a skúsenostiach z minulosti, ktoré ovplyvňujú súčasné stravovacie správanie.",
      "Poukazuje na problémy jednotlivcov s hladom, preferenciami potravín a zdravotnými problémami, ako je Crohnova choroba, pričom zdôrazňuje zložitosť riešenia chronických ochorení a skepticizmus voči potenciálnym liekom.",
      "Niektoré diskusie zahŕňajú experimentálne terapie, rôzne názory na pôžitok z jedla a používanie liekov na potlačenie chuti do jedla počas silných epizód hladu."
    ],
    "points": 137,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1713467202
  },
  {
    "id": 40079516,
    "title": "Virtuálna prehliadka múzea El Prado: Preskúmajte majstrovské diela a 3D sochy",
    "originLink": "https://www.museodelprado.es/visita-virtual-coleccion-2023",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40079516",
    "commentBody": "",
    "originSummary": [
      "Virtuálna prehliadka zbierky múzea umožňuje návštevníkom pohybovať sa po prízemí, prvom a druhom poschodí s 360° panorámou, ktorá predstavuje umelecké diela vo vysokom rozlíšení a 3D sochy.",
      "Boli vytvorené tematické prehliadky s umeleckými dielami vo vysokom rozlíšení a vysvetľujúcimi audiosprievodcami, hoci nie sú zahrnuté všetky oblasti, ako napríklad podzemné podlažie a poklad delfínov.",
      "Cieľom projektu digitalizácie financovaného z Plánu obnovy Španielska je poskytnúť inkluzívny zážitok z výstavy prostredníctvom virtuálnych návštev a rozšírenej reality."
    ],
    "commentSummary": [
      "Fórum sa zaoberá odporúčaním Madridu a Valencie ako cestovných destinácií, pričom vyzdvihuje atrakcie Madridu, čistotu a pešiu dostupnosť a zároveň diskutuje o podceňovaní tohto mesta v porovnaní s Barcelonou.",
      "V rozhovore sa diskutuje o rôznych názoroch na platy technických pracovníkov a na prax siesty v Španielsku.",
      "V diskusii sa zdôrazňuje význam otvorených údajov a rozhraní API pre múzeá s cieľom zlepšiť ich dostupnosť, pričom sa pozornosť sústreďuje na virtuálne prehliadky múzeí, tipy na návštevu múzea Prado a verejný prístup k rozsiahlym zbierkam múzea The Depot v Rotterdame."
    ],
    "points": 134,
    "commentCount": 61,
    "retryCount": 0,
    "time": 1713466486
  }
]
