[
  {
    "id": 37021160,
    "title": "תנאי זום מאפשרים כעת לאמן AI על תוכן משתמשים ללא ביטול הסכמה",
    "originLink": "https://explore.zoom.us/en/terms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37021160",
    "commentBody": "",
    "originSummary": [
      "המעבר הינו הסכם תנאי שירות בין זום תקשורת וידאו לבין משתמשיה.",
      "הוא מכסה היבטים שונים כגון זכויות המשתמש, בעלות על שירותים ותוכנות, חובות תשלום, דרישות מס, יישוב סכסוכים ומדיניות והנחיות משפטיות אחרות.",
      "המשתמשים נדרשים לציית לתנאים אלה לאחר קבלת ההסכם."
    ],
    "commentSummary": [
      "התנאים וההגבלות המעודכנים של זום מאפשרים לחברה להשתמש בתוכן משתמשים לאימון AI ללא אפשרות ביטול הסכמה, מה שמעורר חששות לגבי פרטיות ואמינות.",
      "משתמשים משווים את התנאים של זום ל-Jitsi Meet, חלופה לשיחות ועידה בווידאו, ומתעוררים ויכוחים לגבי היכולת של Jitsi Meet להתמודד עם שיחות ועידה גדולות, כמו גם חששות פרטיות ואמינות עם זום.",
      "הדיונים נוגעים גם בבעיות ביצועים והתרוקנות סוללה עם שירותי וידאו צ'אט, בעיות פרטיות פוטנציאליות הקשורות לשימוש בזום לשירותי בריאות מרחוק, וההשלכות של שימוש בנתוני לקוחות של זום לפיתוח מודלים של בינה מלאכותית. דעות מעורבות עולות לגבי משמעות התנאים המעודכנים של זום."
    ],
    "points": 1471,
    "commentCount": 458,
    "retryCount": 0,
    "time": 1691324151
  },
  {
    "id": 37026592,
    "title": "מים",
    "originLink": "https://oimo.io/works/water/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37026592",
    "commentBody": "",
    "originSummary": [
      "התוכן אינטראקטיבי ומנצל את יכולות התנועה של המכשיר.",
      "משתמשים יכולים לבחור מבין רמות עוצמה שונות, כולל נמוכה, בינונית, גבוהה וסופר.",
      "אפשרויות האופי והעוצמה האינטראקטיביות מספקות חוויית משתמש הניתנת להתאמה אישית ומרתקת."
    ],
    "commentSummary": [
      "השרשור של Hacker News בוחן אתר אינטרנט הכולל סימולציית מים תלת-ממדית שמקבלת משוב חיובי על התכונות המרשימות והביצועים החלקים שלה.",
      "משתמשים מציעים להוסיף אלמנטים חדשים ולדון יישומים פוטנציאליים שונים עבור הסימולציה.",
      "השרשור כולל גם דיונים סביב דיוק הסימולציה, פרויקטים מרשימים שנוצרו באמצעותה ומשוב משתמשים. משתמש אחד משתף אנקדוטה אישית על סימולציה של רפש דלק והאפשרות להיפטר מסכמות קשורות."
    ],
    "points": 950,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1691355125
  },
  {
    "id": 37020610,
    "title": "שרת שפה Postgres",
    "originLink": "https://github.com/supabase/postgres_lsp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37020610",
    "commentBody": "",
    "originSummary": [
      "שרת שפה זה מיועד ל- PostgreSQL ומוסיף תכונות כמו השלמה אוטומטית ו- go-to-definition לעורכי קוד.",
      "הוא משתמש בפועל PostgreSQL parser באמצעות libg_query, מתן מפתחים עם יותר ביטחון ואת היכולת לשמור על קשר עם הפיתוח המהיר של PostgreSQL.",
      "הוא נמצא בפיתוח מוקדם אך פתוח לתרומות מהקהילה, עם קרדיט שניתן ל- pganalyze ו- psteinroe על עבודתם על libpg_query ושרת השפה."
    ],
    "commentSummary": [
      "שרת השפה Postgres הוא כלי חדש המשפר עורכי קוד על ידי הוספת תכונות כמו השלמה אוטומטית ותיעוד עבור Postgres באמצעות מנתח Postgres בפועל.",
      "מטרתו לשפר את כלי SQL ומסד הנתונים, אשר לעתים קרובות חסרים בכלים קיימים.",
      "משתמשים מביעים עניין בתכונות נוספות ודנים במגבלות של הכלים הנוכחיים.",
      "פרויקט נוסף בשם \"pg_langserver\" נועד לספק תכונות שרת שפה דומות עבור PostgreSQL והוא פתוח לתרומות.",
      "שיתוף פעולה עם צוותים אחרים בתחום Postgres סייע לפיתוח שרת השפה Postgres.",
      "הצוות מוגבל בזמן וכרגע אין באפשרותו לטפל בבעיות תאימות עם Windows.",
      "הם פתוחים לסיוע ומציעים להשתמש באפשרויות חלופיות כמו Remote ssh או לקבל את העובדה ש- Windows הוא אזרח סוג ב'."
    ],
    "points": 875,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1691317614
  },
  {
    "id": 37022911,
    "title": "הלכתי ל-50 רופאי שיניים שונים: כמעט כולם נתנו אבחנה שונה (2022)",
    "originLink": "https://www.rd.com/article/how-honest-are-dentists/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37022911",
    "commentBody": "",
    "originSummary": [
      "האתר rd.com מעסיק את Cloudflare כשירות אבטחה להגנה מפני התקפות מקוונות.",
      "למשתמש הוגבלה הגישה לאתר ומומלץ להפעיל עוגיות ולפנות לבעל האתר לקבלת פתרון.",
      "לא נמסר הקשר או מידע נוסף."
    ],
    "commentSummary": [
      "הסיכום מכסה דיונים שונים בתחום הבריאות, כולל אבחנות סותרות, ספקנות כלפי מקצועות הרפואה ואתגרים בשילוב בינה מלאכותית ברפואה.",
      "כמו כן, הוא דן בהשוואה בין מערכות בריאות במדינות שונות ובקשיים בגישה לשירותי בריאות.",
      "הדיונים מדגישים את הצורך בשיפור מערכת הבריאות ואת החשיבות של הסברה עצמית לקבלת טיפול איכותי."
    ],
    "points": 754,
    "commentCount": 489,
    "retryCount": 0,
    "time": 1691335248
  },
  {
    "id": 37021264,
    "title": "החלפת ביקורת עמיתים ב\"שכפול עמיתים\" (2021)",
    "originLink": "https://blog.everydayscientist.com/replace-peer-review-with-peer-replication/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37021264",
    "commentBody": "",
    "originSummary": [
      "המחבר מבקר את תהליך ביקורת העמיתים הנוכחי בהוצאה לאור מדעית כפגום ומציע גישה חדשה בשם \"שכפול עמיתים\".",
      "המערכת המוצעת תכלול שליחת תדפיסים מוקדמים למעבדות אחרות לצורך שכפול לפני קבלתם ופרסומם.",
      "המחבר מציע כי גישה זו תעודד שכפול ותשפר את היושרה המדעית, אך מכיר באתגרים כגון זמן מוגבר וקריאות שיפוט כאשר שכפולים נכשלים. הם מציעים להתחיל בניסוי שנערך על ידי ארגון כמו Review Commons."
    ],
    "commentSummary": [
      "הדיון בחדשות Hacker מתמקד באתגרים ובפתרונות האפשריים של שכפול המחקר המדעי.",
      "יש הטוענים לחשיבות השכפול כדי להבטיח את תקפות הממצאים, בעוד אחרים מדגישים מגבלות מעשיות ופיננסיות.",
      "קיימת ספקנות לגבי יעילותה של ביקורת עמיתים בהבטחת תוקף המחקר, ומועלים חששות לגבי אמינות הפרסום המדעי, כולל שכיחות ההונאה.",
      "קיימת הכרה בצורך בהגברת האחריות באקדמיה ובשיפורים במערכת הנוכחית של מחקר מדעי והוצאה לאור."
    ],
    "points": 509,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1691325204
  },
  {
    "id": 37025621,
    "title": "כולנו חיות בלילה",
    "originLink": "https://hazlitt.net/feature/we-are-all-animals-night",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37025621",
    "commentBody": "",
    "originSummary": [
      "המחברת משתפת בחוויותיה בעבודה במשמרות לילה במכון עיסוי ומהרהרת בקהל הלקוחות הממתין והמגוון שהם פוגשים.",
      "הם משווים את דרישות עבודתם לדממת הלילה, ומדגישים את דינמיקת הכוח ואי השוויון בסחר המין ובמגזר העסקי.",
      "המחבר מדגיש את הערך של משמרות לילה ועבודות בעלות מיומנויות נמוכות, מפריך תפיסות של עליונות, ודן בסכנות האפשריות ובהשפעות השליליות של עבודה במשמרות לילה לטווח ארוך."
    ],
    "commentSummary": [
      "המאמר בוחן נושאים שונים כגון נקודת מבטו של המחבר כעובד מין, זכאות במערכות יחסים, ציפיות חברתיות מגברים וערכם של סוגים שונים של עבודה.",
      "יש דגש על חשיבות הפרטים בהעברת מסר ודינמיקת כוח בין גברים לנשים.",
      "ההערות משקפות מגוון דעות, כאשר חלקן משבחות את סגנון הכתיבה ואחרות מבקרות אותו כפסאודו-אינטלקטואלי.",
      "הדיון מתעמק גם בפתרונות אפשריים לבעיות כמו אלימות כלפי עובדי תעשיית השירותים והיעדר הזדמנויות עבודה."
    ],
    "points": 488,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1691349999
  },
  {
    "id": 37026780,
    "title": "מבנה פס אלקטרונים בגרמניום, התחת שלי (2000)",
    "originLink": "https://pages.cs.wisc.edu/~kovar/hall.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37026780",
    "commentBody": "",
    "originSummary": [
      "המחבר מבקר את ההבנה הקיימת של מבנה פס אלקטרונים בגרמניום ומאתגר את הקשר המעריכי הצפוי בין התנגדות לטמפרטורה.",
      "תוצאות הניסוי המתקבלות על ידי המחבר אינן מתיישרות עם ההתנהגות הצפויה, מה שמוביל לתסכול והטלת ספק במרדף אחר הפיזיקה.",
      "הקשיים בהם נתקלו במהלך הניסוי תורמים למסקנתו של המחבר כי החלטתו ללמוד פיזיקה הייתה טעות."
    ],
    "commentSummary": [
      "המאמר באתר Hacker News בוחן פוסט משנת 2000 המתייחס לקשיים ולתסכולים הכרוכים בביצוע ניסוי במבנה פס אלקטרונים בגרמניום.",
      "משתמשים באתר דנים בחוויותיהם שלהם בעבודת מעבדה ומספקים תובנות לגבי המשמעות של הוראת פיזיקה ניסויית.",
      "הדיון מדגיש את הערך של מיומנויות פתרון בעיות, ניסיון מעשי ואת האופי הבלתי צפוי של ניסויים תוך התעמקות בחוויות שליליות עם פיזיקה ונתיבי קריירה חלופיים פוטנציאליים."
    ],
    "points": 370,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1691356040
  },
  {
    "id": 37023089,
    "title": "'שער 3 של בלדור' מוכן ל-100 אלף שחקנים במקביל, הם קיבלו 700 אלף",
    "originLink": "https://www.forbes.com/sites/paultassi/2023/08/06/baldurs-gate-3-prepared-for-100000-concurrent-players-theyve-gotten-700000/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37023089",
    "commentBody": "",
    "originSummary": [
      "Baldur's Gate 3, משחק RPG לשחקן יחיד, השיג ציון דרך בכך שהגיע ל-500,000 שחקנים בו זמנית ב-Steam, מה שהופך אותו למשחק השלישי המשוחק ביותר בפלטפורמה.",
      "המשחק קרא תיגר על מגמות התעשייה בכך שלכד את העניין של הציבור הרחב, למרות היותו RPG מבוסס תורות.",
      "שער 3 של בלדור נכנס גם ל-10 שחקני השיא בהיסטוריה של Steam, ומיצב את עצמו כמתמודד חזק על תואר משחק השנה."
    ],
    "commentSummary": [
      "\"Baldur's Gate 3\" עלה על הציפיות עם 700,000 שחקנים, לעומת 100,000 השחקנים הצפויים במקביל, הודות לגורמים כמו הפופולריות של קודמו וכוח המותג של מבוכים ודרקונים.",
      "גרסת הגישה המוקדמת של המשחק הייתה פופולרית מאוד, והוא זכה לשבחים על הלחימה מבוססת התורות, הכתיבה והמוזיקה הסוחפת שלו.",
      "ההערות בשיחה משקפות נקודות מבט שונות על המשחק, כולל דיונים על רמת הקושי שלו, זמינות של הדרכות וסרטוני בניית דמויות, היעדר מיקרו-טרנזקציות, וחששות לגבי פיתוח וקיבולת שרתים."
    ],
    "points": 366,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691336302
  },
  {
    "id": 37025233,
    "title": "מטא חוסמת קישורי חדשות בקנדה",
    "originLink": "https://www.michaelgeist.ca/2023/08/metablockslinks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37025233",
    "commentBody": "",
    "originSummary": [
      "מטא, חברת האם של פייסבוק ואינסטגרם, חוסמת קישורי חדשות ושיתוף בפלטפורמות שלה בקנדה בשל ביל C-18, מה שגורם להפסדים במגזר המדיה.",
      "תומכי החוק התעלמו מאזהרותיה של מטא, מה שהוביל לביקורת על הממשלה.",
      "המאמר בוחן את פוטנציאל הפיתוח של יכולות סינון תוכן על ידי חברות חיפוש ומדיה חברתית, ומשווה את הגישות של אוסטרליה וקנדה במשא ומתן על עסקאות עם חברות אלה."
    ],
    "commentSummary": [
      "החלטתה של פייסבוק לחסום קישורי חדשות בקנדה עוררה דיון בנוגע לתפקידה של הפלטפורמה כמקור חדשותי.",
      "יש הטוענים כי פייסבוק צריכה לתעדף חיבור בין אנשים במקום לשמש פלטפורמת חדשות.",
      "נקודות דיון אחרות כוללות את השפעת המדיה החברתית על החברה, חששות מפני חדשות מזויפות, העדפות טכנולוגיות הקשורות לגיל והשפעת כלי התקשורת הקנדיים."
    ],
    "points": 348,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1691347628
  },
  {
    "id": 37023117,
    "title": "משפט ההגבלים העסקיים נגד גוגל מתחיל בספטמבר",
    "originLink": "https://www.thebignewsletter.com/p/the-first-big-antitrust-trial-of",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37023117",
    "commentBody": "",
    "originSummary": [
      "גוגל עומדת בימים אלה בפני משפט הגבלים עסקיים שבו הממשלה טוענת כי היא מחזיקה במונופול על פרסום כללי בחיפוש ובחיפוש עם נתח שוק של 90%-95%.",
      "לתוצאות הניסוי עשויות להיות השלכות משמעותיות על התחרות בתעשיית הטכנולוגיה.",
      "גוגל טוענת כי המונופול שלה חוקי מכיוון שהצרכנים מעדיפים את מנוע החיפוש שלה, אך המבקרים טוענים כי איכות מנוע החיפוש שלה ירדה.",
      "המשפט צפוי להימשך חודשיים וגוגל מתמודדת גם עם תביעות הגבלים עסקיים אחרות הקשורות למונופול בחנות האפליקציות שלה ולמונופול של תוכנות פרסום מקוונות.",
      "המאמר מדגיש את הרלוונטיות של פעולות העבר של YouTube ואת ההשפעה של AT&T על עלייתם של ספקים חדשים וסטארט-אפים."
    ],
    "commentSummary": [
      "משפט ההגבלים העסקיים נגד גוגל נמצא בדיון, עם דעות שונות בשאלה האם התנהגותה של גוגל היא אנטי-תחרותית ואם יש מספיק ראיות להוכחת מונופול.",
      "הדומיננטיות של חברות טכנולוגיה גדולות כמו אפל ומיקרוסופט מוזכרת גם היא, מה שמעלה חששות לגבי אופטימיזציה למנועי חיפוש, אוטומציה של אלגוריתמים וחוסר יכולת פעולה הדדית בין אפל לגוגל.",
      "הוויכוחים נסובים סביב הצורך ברגולציה, ההשפעות על חדשנות ותחרות, וההשלכות האפשריות של פירוק חברות גדולות. בדיון עולות גם נוהלי פרטיות ופרסום של נתונים."
    ],
    "points": 301,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1691336465
  }
]
