[
  {
    "id": 37021160,
    "title": "ขณะนี้เงื่อนไข Zoom อนุญาตให้ฝึกอบรม AI เกี่ยวกับเนื้อหาของผู้ใช้โดยไม่ต้องเลือกไม่รับ",
    "originLink": "https://explore.zoom.us/en/terms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37021160",
    "commentBody": "",
    "originSummary": [
      "ข้อความนี้เป็นข้อตกลงในการให้บริการระหว่าง Zoom Video Communications และผู้ใช้",
      "ครอบคลุมด้านต่างๆเช่นสิทธิ์ของผู้ใช้ความเป็นเจ้าของบริการและซอฟต์แวร์ภาระผูกพันในการชําระเงินข้อกําหนดด้านภาษีการระงับข้อพิพาทและนโยบายและแนวทางทางกฎหมายอื่น ๆ",
      "ผู้ใช้จะต้องปฏิบัติตามข้อกําหนดเหล่านี้เมื่อพวกเขายอมรับข้อตกลง"
    ],
    "commentSummary": [
      "ข้อกําหนดและเงื่อนไขที่อัปเดตของ Zoom ช่วยให้ บริษัท สามารถใช้เนื้อหาผู้ใช้สําหรับการฝึกอบรม AI ได้โดยไม่ต้องเลือกไม่ใช้ทําให้เกิดความกังวลเกี่ยวกับความเป็นส่วนตัวและความน่าเชื่อถือ",
      "ผู้ใช้เปรียบเทียบข้อกําหนดของ Zoom กับ Jitsi Meet ซึ่งเป็นทางเลือกในการประชุมทางวิดีโอ และมีการถกเถียงกันเกี่ยวกับความสามารถของ Jitsi Meet ในการจัดการการประชุมทางโทรศัพท์ขนาดใหญ่ รวมถึงข้อกังวลด้านความเป็นส่วนตัวและความน่าเชื่อถือกับ Zoom",
      "การอภิปรายยังกล่าวถึงปัญหาด้านประสิทธิภาพและแบตเตอรี่หมดกับบริการวิดีโอแชทปัญหาความเป็นส่วนตัวที่อาจเกิดขึ้นจากการใช้ Zoom สําหรับบริการ telehealth และผลกระทบของ Zoom โดยใช้ข้อมูลลูกค้าในการพัฒนาโมเดล AI ความคิดเห็นที่หลากหลายเกิดขึ้นเกี่ยวกับความสําคัญของคําศัพท์ที่อัปเดตของ Zoom"
    ],
    "points": 1471,
    "commentCount": 458,
    "retryCount": 0,
    "time": 1691324151
  },
  {
    "id": 37026592,
    "title": "น้ำ",
    "originLink": "https://oimo.io/works/water/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37026592",
    "commentBody": "",
    "originSummary": [
      "เนื้อหาเป็นแบบโต้ตอบและใช้ประโยชน์จากความสามารถในการเคลื่อนที่ของอุปกรณ์",
      "ผู้ใช้สามารถเลือกจากระดับความเข้มที่แตกต่างกันรวมถึงต่ําปานกลางสูงและซุปเปอร์",
      "ตัวเลือกลักษณะและความเข้มแบบโต้ตอบมอบประสบการณ์การใช้งานที่ปรับแต่งได้และมีส่วนร่วม"
    ],
    "commentSummary": [
      "เธรด Hacker News สํารวจเว็บไซต์ที่มีการจําลองน้ํา 3 มิติที่ได้รับการตอบรับเชิงบวกสําหรับคุณสมบัติที่น่าประทับใจและประสิทธิภาพที่ราบรื่น",
      "ผู้ใช้เสนอให้เพิ่มองค์ประกอบใหม่และหารือเกี่ยวกับแอปพลิเคชันที่เป็นไปได้ต่างๆสําหรับการจําลอง",
      "เธรดยังรวมถึงการอภิปรายเกี่ยวกับความแม่นยําของการจําลองโครงการที่น่าประทับใจที่สร้างขึ้นโดยใช้มันและความคิดเห็นของผู้ใช้ ผู้ใช้รายหนึ่งแบ่งปันเกร็ดเล็กเกร็ดน้อยส่วนตัวเกี่ยวกับการจําลองการลื่นไถลของเชื้อเพลิงและความเป็นไปได้ในการกําจัดแผนผังที่เกี่ยวข้อง"
    ],
    "points": 950,
    "commentCount": 113,
    "retryCount": 0,
    "time": 1691355125
  },
  {
    "id": 37020610,
    "title": "เซิร์ฟเวอร์ภาษา Postgres",
    "originLink": "https://github.com/supabase/postgres_lsp",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37020610",
    "commentBody": "",
    "originSummary": [
      "เซิร์ฟเวอร์ภาษานี้ออกแบบมาสําหรับ PostgreSQL และเพิ่มคุณสมบัติต่างๆเช่นการเติมข้อความอัตโนมัติและคําจํากัดความให้กับโปรแกรมแก้ไขโค้ด",
      "ใช้ตัวแยกวิเคราะห์ PostgreSQL จริงผ่าน libg_query ทําให้นักพัฒนามีความมั่นใจมากขึ้นและความสามารถในการติดตามการพัฒนาอย่างรวดเร็วของ PostgreSQL",
      "มันอยู่ในการพัฒนาในช่วงต้น แต่เปิดรับการมีส่วนร่วมจากชุมชนโดยให้เครดิตกับ pganalyze และ psteinroe สําหรับการทํางานของพวกเขาใน libpg_query และเซิร์ฟเวอร์ภาษา"
    ],
    "commentSummary": [
      "Postgres Language Server เป็นเครื่องมือใหม่ที่ปรับปรุงโปรแกรมแก้ไขโค้ดโดยการเพิ่มคุณสมบัติเช่นการเติมข้อความอัตโนมัติและเอกสารประกอบสําหรับ Postgres โดยใช้ตัวแยกวิเคราะห์ Postgres จริง",
      "มีจุดมุ่งหมายเพื่อปรับปรุง SQL และเครื่องมือฐานข้อมูลซึ่งมักจะขาดเครื่องมือที่มีอยู่",
      "ผู้ใช้แสดงความสนใจในคุณสมบัติเพิ่มเติมและหารือเกี่ยวกับข้อ จํากัด ของเครื่องมือปัจจุบัน",
      "อีกโครงการหนึ่งที่เรียกว่า \"pg_langserver\" มีจุดมุ่งหมายเพื่อให้คุณสมบัติเซิร์ฟเวอร์ภาษาที่คล้ายกันสําหรับ PostgreSQL และเปิดรับการมีส่วนร่วม",
      "การทํางานร่วมกันกับทีมอื่น ๆ ในพื้นที่ Postgres มีประโยชน์สําหรับการพัฒนาเซิร์ฟเวอร์ภาษา Postgres",
      "ทีมมีเวลาจํากัดและขณะนี้ยังไม่สามารถแก้ไขปัญหาความเข้ากันได้กับ Windows ได้",
      "พวกเขาเปิดรับความช่วยเหลือและแนะนําให้ใช้ตัวเลือกอื่น ๆ เช่น Remote ssh หรือยอมรับว่า Windows เป็นพลเมืองชั้นสอง"
    ],
    "points": 875,
    "commentCount": 109,
    "retryCount": 0,
    "time": 1691317614
  },
  {
    "id": 37022911,
    "title": "ฉันไปหาทันตแพทย์ 50 คน: เกือบทั้งหมดให้การวินิจฉัยที่แตกต่างกัน (2022)",
    "originLink": "https://www.rd.com/article/how-honest-are-dentists/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37022911",
    "commentBody": "",
    "originSummary": [
      "เว็บไซต์ rd.com ใช้ Cloudflare เป็นบริการรักษาความปลอดภัยเพื่อป้องกันการโจมตีออนไลน์",
      "ผู้ใช้ถูก จํากัด ไม่ให้เข้าถึงเว็บไซต์และแนะนําให้เปิดใช้งานคุกกี้และติดต่อเจ้าของไซต์เพื่อขอวิธีแก้ปัญหา",
      "ไม่มีบริบทหรือข้อมูลเพิ่มเติม"
    ],
    "commentSummary": [
      "บทสรุปครอบคลุมการอภิปรายต่างๆเกี่ยวกับการดูแลสุขภาพรวมถึงการวินิจฉัยที่ขัดแย้งกันความสงสัยต่อวิชาชีพแพทย์และความท้าทายในการบูรณาการ AI เข้ากับการแพทย์",
      "นอกจากนี้ยังกล่าวถึงการเปรียบเทียบระบบการดูแลสุขภาพในประเทศต่างๆและความยากลําบากในการเข้าถึงการดูแลสุขภาพ",
      "การอภิปรายเน้นย้ําถึงความจําเป็นในการปรับปรุงระบบการดูแลสุขภาพและความสําคัญของการสนับสนุนให้ตัวเองได้รับการดูแลที่มีคุณภาพ"
    ],
    "points": 754,
    "commentCount": 489,
    "retryCount": 0,
    "time": 1691335248
  },
  {
    "id": 37021264,
    "title": "แทนที่การตรวจสอบโดยเพื่อนด้วย \"การจําลองแบบเพียร์\" (2021)",
    "originLink": "https://blog.everydayscientist.com/replace-peer-review-with-peer-replication/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37021264",
    "commentBody": "",
    "originSummary": [
      "ผู้เขียนวิพากษ์วิจารณ์กระบวนการตรวจสอบโดยเพื่อนในปัจจุบันในการเผยแพร่ทางวิทยาศาสตร์ว่ามีข้อบกพร่องและเสนอแนวทางใหม่ที่เรียกว่า \"การจําลองแบบเพียร์\"",
      "ระบบที่เสนอจะเกี่ยวข้องกับการส่งการพิมพ์ล่วงหน้าไปยังห้องปฏิบัติการอื่น ๆ เพื่อจําลองแบบก่อนที่จะยอมรับและเผยแพร่",
      "ผู้เขียนแนะนําว่าวิธีการนี้จะส่งเสริมการจําลองแบบและเพิ่มความสมบูรณ์ทางวิทยาศาสตร์ แต่ยอมรับความท้าทายเช่นเวลาที่เพิ่มขึ้นและการเรียกการตัดสินเมื่อการจําลองแบบล้มเหลว พวกเขาแนะนําให้เริ่มต้นด้วยการทดลองที่ดําเนินการโดยองค์กรเช่น Review Commons"
    ],
    "commentSummary": [
      "การอภิปรายเกี่ยวกับ Hacker News มุ่งเน้นไปที่ความท้าทายและวิธีแก้ปัญหาที่เป็นไปได้ของการจําลองการวิจัยทางวิทยาศาสตร์",
      "บางคนโต้แย้งถึงความสําคัญของการจําลองแบบเพื่อให้แน่ใจว่าการค้นพบมีความถูกต้องในขณะที่คนอื่น ๆ เน้นข้อ จํากัด ในทางปฏิบัติและทางการเงิน",
      "มีความสงสัยเกี่ยวกับประสิทธิภาพของการตรวจสอบโดยเพื่อนในการรับรองความถูกต้องของการวิจัยและความกังวลเกี่ยวกับความน่าเชื่อถือของการเผยแพร่ทางวิทยาศาสตร์รวมถึงความชุกของการฉ้อโกง",
      "มีการรับรู้ถึงความจําเป็นในการเพิ่มความรับผิดชอบในสถาบันการศึกษาและการปรับปรุงระบบการวิจัยและการเผยแพร่ทางวิทยาศาสตร์ในปัจจุบัน"
    ],
    "points": 509,
    "commentCount": 294,
    "retryCount": 0,
    "time": 1691325204
  },
  {
    "id": 37025621,
    "title": "เราทุกคนเป็นสัตว์ในเวลากลางคืน",
    "originLink": "https://hazlitt.net/feature/we-are-all-animals-night",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37025621",
    "commentBody": "",
    "originSummary": [
      "ผู้เขียนแบ่งปันประสบการณ์การทํางานกะกลางคืนที่อาบอบนวดและสะท้อนให้เห็นถึงลูกค้าที่รอคอยและหลากหลายที่พวกเขาพบ",
      "พวกเขาเปรียบเทียบความต้องการของงานกับความสงบนิ่งของกลางคืนโดยเน้นถึงพลวัตทางอํานาจและความไม่เท่าเทียมกันในภาคการค้าประเวณีและภาคธุรกิจ",
      "ผู้เขียนเน้นคุณค่าของกะกลางคืนและงานที่มีทักษะต่ําหักล้างแนวคิดของความเหนือกว่าและกล่าวถึงอันตรายที่อาจเกิดขึ้นและผลกระทบด้านลบของงานกะกลางคืนระยะยาว"
    ],
    "commentSummary": [
      "บทความนี้สํารวจหัวข้อต่าง ๆ เช่นมุมมองของผู้เขียนในฐานะผู้ให้บริการทางเพศสิทธิในความสัมพันธ์ความคาดหวังทางสังคมสําหรับผู้ชายและคุณค่าของงานประเภทต่างๆ",
      "มีการมุ่งเน้นไปที่ความสําคัญของรายละเอียดในการถ่ายทอดข้อความและพลวัตทางอํานาจระหว่างชายและหญิง",
      "ความคิดเห็นสะท้อนความคิดเห็นที่หลากหลายโดยบางคนยกย่องสไตล์การเขียนและคนอื่น ๆ วิพากษ์วิจารณ์ว่าเป็นปัญญาชนหลอก",
      "การอภิปรายยังเจาะลึกถึงแนวทางแก้ไขปัญหาที่เป็นไปได้เช่นความรุนแรงต่อคนงานในอุตสาหกรรมบริการและการขาดโอกาสในการทํางาน"
    ],
    "points": 488,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1691349999
  },
  {
    "id": 37026780,
    "title": "โครงสร้างแถบอิเล็กตรอนในเจอร์เมเนียมตูดของฉัน (2000)",
    "originLink": "https://pages.cs.wisc.edu/~kovar/hall.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37026780",
    "commentBody": "",
    "originSummary": [
      "ผู้เขียนวิพากษ์วิจารณ์ความเข้าใจที่มีอยู่ของโครงสร้างแถบอิเล็กตรอนในเจอร์เมเนียมและท้าทายความสัมพันธ์แบบเอ็กซ์โพเนนเชียลที่คาดหวังระหว่างความต้านทานและอุณหภูมิ",
      "ผลการทดลองที่ผู้เขียนได้รับไม่สอดคล้องกับพฤติกรรมที่คาดการณ์ไว้ซึ่งนําไปสู่ความหงุดหงิดและตั้งคําถามต่อการแสวงหาฟิสิกส์",
      "ความยากลําบากที่พบในระหว่างการทดลองมีส่วนทําให้ผู้เขียนสรุปว่าการตัดสินใจเรียนฟิสิกส์เป็นความผิดพลาด"
    ],
    "commentSummary": [
      "บทความเกี่ยวกับ Hacker News สํารวจโพสต์จากปี 2000 ที่กล่าวถึงความยากลําบากและความผิดหวังในการทําการทดลองโครงสร้างแถบอิเล็กตรอนในเจอร์เมเนียม",
      "ผู้ใช้ในเว็บไซต์พูดคุยเกี่ยวกับประสบการณ์ของตนเองกับงานในห้องปฏิบัติการและให้ข้อมูลเชิงลึกเกี่ยวกับความสําคัญของการศึกษาฟิสิกส์ทดลอง",
      "การอภิปรายเน้นถึงคุณค่าของทักษะการแก้ไขปัญหาประสบการณ์ตรงและลักษณะที่คาดเดาไม่ได้ของการทดลองในขณะเดียวกันก็เจาะลึกประสบการณ์เชิงลบกับฟิสิกส์และเส้นทางอาชีพทางเลือกที่มีศักยภาพ"
    ],
    "points": 370,
    "commentCount": 65,
    "retryCount": 0,
    "time": 1691356040
  },
  {
    "id": 37023089,
    "title": "'Baldur's Gate 3' เตรียมพร้อมสําหรับผู้เล่นพร้อมกัน 100k พวกเขาได้รับ 700K",
    "originLink": "https://www.forbes.com/sites/paultassi/2023/08/06/baldurs-gate-3-prepared-for-100000-concurrent-players-theyve-gotten-700000/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37023089",
    "commentBody": "",
    "originSummary": [
      "Baldur's Gate 3 เกม RPG แบบผู้เล่นคนเดียวประสบความสําเร็จอย่างมากด้วยการเข้าถึงผู้เล่นพร้อมกัน 500,000 คนบน Steam ทําให้เป็นเกมที่เล่นมากที่สุดเป็นอันดับสามบนแพลตฟอร์ม",
      "เกมดังกล่าวได้ท้าทายแนวโน้มของอุตสาหกรรมโดยดึงดูดความสนใจของสาธารณชนทั่วไปแม้จะเป็น RPG แบบผลัดกันเล่น",
      "Baldur's Gate 3 ยังเข้าสู่จํานวนผู้เล่นสูงสุด 10 อันดับแรกในประวัติศาสตร์ Steam โดยวางตําแหน่งตัวเองเป็นคู่แข่งที่แข็งแกร่งสําหรับ Game of the Year"
    ],
    "commentSummary": [
      "\"Baldur's Gate 3\" เกินความคาดหมายด้วยผู้เล่น 700,000 คนเมื่อเทียบกับผู้เล่นพร้อมกัน 100,000 คนที่คาดการณ์ไว้เนื่องจากปัจจัยต่างๆเช่นความนิยมของรุ่นก่อนและพลังของแบรนด์ของ Dungeons & Dragons",
      "เกมเล่นระหว่างพัฒนาได้รับความนิยมอย่างสูง และได้รับการยกย่องในเรื่องการต่อสู้แบบผลัดกันเล่น การเขียน และเพลงที่สมจริง",
      "ความคิดเห็นในการสนทนาสะท้อนมุมมองที่หลากหลายเกี่ยวกับเกมรวมถึงการอภิปรายเกี่ยวกับระดับความยากความพร้อมของคําแนะนําและวิดีโอการสร้างตัวละครการขาดไมโครทรานส์แอคชั่นและความกังวลเกี่ยวกับการพัฒนาและความจุของเซิร์ฟเวอร์"
    ],
    "points": 366,
    "commentCount": 301,
    "retryCount": 0,
    "time": 1691336302
  },
  {
    "id": 37025233,
    "title": "Meta บล็อกลิงก์ข่าวในแคนาดา",
    "originLink": "https://www.michaelgeist.ca/2023/08/metablockslinks/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37025233",
    "commentBody": "",
    "originSummary": [
      "Meta ซึ่งเป็นบริษัทแม่ของ Facebook และ Instagram กําลังบล็อกลิงก์ข่าวและแชร์บนแพลตฟอร์มในแคนาดา เนื่องจาก Bill C-18 ส่งผลให้ภาคสื่อสูญเสีย",
      "ผู้สนับสนุนร่างกฎหมายนี้เพิกเฉยต่อคําเตือนของเมตา ซึ่งนําไปสู่การวิพากษ์วิจารณ์รัฐบาล",
      "บทความนี้สํารวจการพัฒนาศักยภาพของความสามารถในการกรองเนื้อหาโดย บริษัท ค้นหาและโซเชียลมีเดียเปรียบเทียบแนวทางของออสเตรเลียและแคนาดาในการเจรจาข้อตกลงกับ บริษัท เหล่านี้"
    ],
    "commentSummary": [
      "การตัดสินใจของ Facebook ในการบล็อกลิงก์ข่าวในแคนาดาได้จุดประกายการถกเถียงเกี่ยวกับบทบาทของแพลตฟอร์มในฐานะแหล่งข่าว",
      "บางคนแย้งว่า Facebook ควรให้ความสําคัญกับการเชื่อมต่อผู้คนมากกว่าทําหน้าที่เป็นแพลตฟอร์มข่าว",
      "ประเด็นอื่น ๆ ของการอภิปราย ได้แก่ ผลกระทบของโซเชียลมีเดียต่อสังคมความกังวลเกี่ยวกับข่าวปลอมการตั้งค่าเทคโนโลยีที่เกี่ยวข้องกับอายุและอิทธิพลของสื่อของแคนาดา"
    ],
    "points": 348,
    "commentCount": 337,
    "retryCount": 0,
    "time": 1691347628
  },
  {
    "id": 37023117,
    "title": "การพิจารณาคดีต่อต้านการผูกขาดกับ Google จะเริ่มขึ้นในเดือนกันยายน",
    "originLink": "https://www.thebignewsletter.com/p/the-first-big-antitrust-trial-of",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37023117",
    "commentBody": "",
    "originSummary": [
      "ขณะนี้ Google กําลังเผชิญกับการพิจารณาคดีต่อต้านการผูกขาดซึ่งรัฐบาลให้เหตุผลว่ามีการผูกขาดการโฆษณาการค้นหาและการค้นหาทั่วไปที่มีส่วนแบ่งการตลาด 90-95%",
      "ผลของการทดลองนี้อาจมีนัยสําคัญต่อการแข่งขันในอุตสาหกรรมเทคโนโลยี",
      "Google อ้างว่าการผูกขาดนั้นถูกกฎหมายเนื่องจากผู้บริโภคชอบเครื่องมือค้นหา แต่นักวิจารณ์โต้แย้งว่าคุณภาพของเครื่องมือค้นหาลดลง",
      "การพิจารณาคดีนี้คาดว่าจะใช้เวลาสองเดือนและ Google ยังเผชิญกับคดีต่อต้านการผูกขาดอื่น ๆ ที่เกี่ยวข้องกับการผูกขาดแอพสโตร์และการผูกขาดซอฟต์แวร์โฆษณาออนไลน์",
      "บทความนี้เน้นถึงความเกี่ยวข้องของการกระทําที่ผ่านมาโดย YouTube และอิทธิพลของ AT&T ในการเพิ่มขึ้นของผู้ให้บริการรายใหม่และสตาร์ทอัพ"
    ],
    "commentSummary": [
      "การพิจารณาคดีต่อต้านการผูกขาดกับ Google กําลังถูกกล่าวถึง โดยมีความคิดเห็นที่แตกต่างกันว่าพฤติกรรมของ Google เป็นการต่อต้านการแข่งขันหรือไม่ และมีหลักฐานเพียงพอที่จะพิสูจน์การผูกขาดหรือไม่",
      "นอกจากนี้ยังมีการกล่าวถึงการครอบงําของ บริษัท เทคโนโลยีขนาดใหญ่เช่น Apple และ Microsoft ทําให้เกิดความกังวลเกี่ยวกับการเพิ่มประสิทธิภาพกลไกค้นหาระบบอัตโนมัติของอัลกอริทึมและการขาดการทํางานร่วมกันระหว่าง Apple และ Google",
      "การถกเถียงล้อมรอบความต้องการกฎระเบียบผลกระทบต่อนวัตกรรมและการแข่งขันและผลกระทบที่อาจเกิดขึ้นจากการเลิกบริษัทขนาดใหญ่ ความเป็นส่วนตัวของข้อมูลและแนวทางปฏิบัติในการโฆษณายังถูกนํามาอภิปราย"
    ],
    "points": 301,
    "commentCount": 329,
    "retryCount": 0,
    "time": 1691336465
  }
]
