[
  {
    "title": "Tech Community Divided on AI Regulation: VCs Release Guidelines While Others, Including Marc Andreessen, Oppose",
    "originLink": "https://www.theinformation.com/articles/vcs-and-tech-companies-at-big-odds-over-ai-regulation",
    "originBody": "ai VCs and Tech Companies at Odds Over AI Regulation By Jessica E. Lessin jessica@theinformation.c­om Profile and archive → Follow Jessica on Twitter and Stephanie Palazzolo stephanie@theinformation.c­om Profile and archive →Nov. 15, 2023 1:26 PM PST Photo: Hemant Taneja, left, and Marc Andreessen. Photos by Getty Regulating artificial intelligence was always going to be a thorny issue. But a few months into Washington’s push to do so, the question of how to oversee powerful large language models and other AI is sharply dividing the tech community. On Tuesday, a venture capital industry group released a set of guidelines on “responsible AI,” calling on companies to promote measures such as AI safety checks, and “fostering trust through transparency.” VC firms including Mayfield, SoftBank, General Catalyst, Felicis, Bain Capital and IVP endorsed the guidelines. But another group of investors and prominent tech leaders, including Marc Andreessen, Kleiner Perkins partner Bucky Moore and Meta Platforms’ AI research chief Yann LeCun came out in opposition.",
    "originSummary": [
      "The tech community is divided over the issue of regulating artificial intelligence (AI).",
      "A venture capital industry group has issued guidelines on responsible AI, which include safety checks and transparency.",
      "However, some investors and tech leaders, like Marc Andreessen, are opposing these regulations."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "Ecobot Joins MRV Collective to Advance Nature Tech Solutions for Climate Change and Biodiversity Loss",
    "originLink": "https://www.newswire.com/news/ecobot-joins-mrv-collective-a-coalition-of-nature-tech-companies-22172815",
    "originBody": "Ecobot Joins MRV Collective, a Coalition of Nature Tech Companies Press Release • Nov 16, 2023 07:45 EST Ecobot is the Newest Member of the Industry Coalition That is Advancing Strategic Applications of Measurement, Reporting and Verification Technologies to Address Climate Change, Nature and Biodiversity Loss ASHEVILLE, N.C. & SEBASTOPOL, Calif., November 16, 2023 (Newswire.com) - Ecobot, the company driving the digitization of environmental permitting, is proud to announce that it has joined MRV Collective as a new member. MRV Collective is a non-profit, member-supported industry coalition advancing strategic applications of Measurement, Reporting, and Verification (MRV) technologies to address climate change, biodiversity loss, and close the $700 billion annual nature-finance gap. “As an industry alliance with strong collaboration foundations and execution capability, the MRV Collective identifies and embraces common challenges like data sharing across the public and private sector. The biodiversity data collected within Ecobot has enormous potential to support new and increasingly valuable data pipelines,” said Daniel Swid, Head of Ecosystem at MRV Collective. “Ecobot is a tremendous addition to the Collective and understands the value of rolling up data collection from environmental permitting activities to accelerate nature-based decision-making in key political, economic, cultural, and social sectors. The challenge of data sharing is often too expensive and complex for public and private actors to tackle, and we believe Ecobot can help transform what many see as routine compliance activities into valuable collective benefit. This key collaboration challenge has long been understood by international organizations such as the Global Biodiversity Information Facility (GBIF), and has recently been highlighted by the Taskforce for Nature-related Financial Disclosures (TNFD).” “Ecobot was founded on the principle that information about the natural world collected during environmental permitting is grossly underutilized,” said Ecobot CEO and co-founder Lee Lance. “Our membership in the MRV Collective will facilitate our mission of normalizing, aggregating, anonymizing and applying the five million-plus biodiversity and data waterpoints currently hosted in Ecobot as an expert network learning layer that can accelerate critical climate initiatives.” This relationship was formalized following GreenBiz Bloom / VERGE 23, a Climate Tech Event, in San Jose, California, where Ecobot was one of five startups selected to pitch at the Bloom Accelerate contest. About Ecobot Ecobot modernizes environmental permitting, unlocking typically discarded or siloed field data to gain insight to biodiversity impact, connecting natural capital accounting with ecosystem services. See how Ecobot can transform your environmental permitting processes and help you achieve nature-positive targets at ecobot.com. About MRV Collective MRV Collective is a nonprofit community, intelligence unit, and corporate venture studio on a mission to fast track the adoption of nature tech solutions. The core members of MRV Collective represent the world’s leading nature tech solution providers, nature-focused academics, and mission-aligned NGOs. With a new anchor membership tier to be introduced in 2024, we welcome leaders in the corporate and nature finance community to join our effort, leveraging our bespoke research and matchmaking services to achieve their nature-related goals. MRV Collective exists to close the nature-finance gap. Learn more at mrvcollective.org. Source: Ecobot, Inc. Tags biodiversity tracking climatetech environmental permitting nature finance naturetech",
    "originSummary": [
      "Ecobot, a company specializing in environmental permitting digitization, has joined MRV Collective, a non-profit coalition focused on the use of MRV technologies for addressing climate change, biodiversity loss, and the nature-finance gap.",
      "Ecobot's biodiversity data has the potential to support valuable data pipelines and accelerate nature-based decision-making.",
      "This collaboration aims to transform routine compliance activities into collective benefits and help Ecobot normalize and apply their extensive biodiversity and water data to critical climate initiatives."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "TikTok Joins Meta in Challenging EU Gatekeeper Status",
    "originLink": "https://www.reuters.com/technology/tiktok-joins-meta-appealing-against-eu-gatekeeper-status-2023-11-16/",
    "originBody": "Boards, Policy & Regulation Regulatory Oversight TikTok joins Meta in appealing against EU gatekeeper status By Supantha Mukherjee November 16, 20235:02 AM UTCUpdated 4 hours ago [1/2]EU flag and TikTok logo are seen in this illustration taken, June 2, 2023. REUTERS/Dado Ruvic/Illustration/File Photo Acquire Licensing Rights Companies Alphabet Inc Follow Amazon.com Inc Follow Apple Inc Follow Show more companies STOCKHOLM, Nov 16 (Reuters) - TikTok on Thursday joined Meta (META.O) in appealing against the \"gatekeeper\" status under the Digital Markets Act (DMA), an EU law that brings in tougher rules for tech companies and makes it easier for users to move between competing services. Meta on Wednesday challenged the \"gatekeeper\" designations for its Messenger and Marketplace platforms, but did not appeal against the status for Facebook, Instagram and WhatsApp. Advertisement · Scroll to continue The European Union in September picked 22 \"gatekeeper\" services, run by six tech companies - Microsoft (MSFT.O), Apple (AAPL.O), Alphabet's (GOOGL.O) Google, Amazon (AMZN.O), Meta and ByteDance's TikTok. While Microsoft, Google and Amazon did not challenge their designations, Apple is yet to comment on its plan. Nov. 16 is the last date to appeal. \"Our appeal is based on the belief that our designation risks undermining the DMA's own stated goal by protecting actual gatekeepers from newer competitors like TikTok,\" it said. Advertisement · Scroll to continue \"Far from being a gatekeeper, our platform, which has been operating in Europe for just over five years, is arguably the most capable challenger to more entrenched platform businesses.\" The video sharing app said it does not meet the law's threshold for revenues generated in the European Economic Area of 7.5 billion euros ($8.13 billion) per annum. Under the DMA, companies with more than 45 million monthly active users and a market capitalisation of 75 billion euros are considered gatekeepers providing a core platform service. Advertisement · Scroll to continue The company said it was designated a gatekeeper based on its parent company, ByteDance's, global market capitalisation that us based primarily on the performance of business lines that do not even operate in Europe. Last month, China's ByteDance bought back shares from U.S. employees in a deal that valued the company at $223.5 billion. TikTok, which has over 134 million monthly users, said it is a challenger, not an incumbent, in digital advertising and no market investigation was conducted in relation to its designation by the European Commission. ($1 = 0.9223 euros) Reporting by Supantha Mukherjee in Stockholm Editing by Nick Zieminski Our Standards: The Thomson Reuters Trust Principles. Acquire Licensing Rights , opens new tab Supantha Mukherjee Thomson Reuters Supantha leads the European Technology and Telecoms coverage, with a special focus on emerging technologies such as AI and 5G. He has been a journalist for about 18 years. He joined Reuters in 2006 and has covered a variety of beats ranging from financial sector to technology. He is based in Stockholm, Sweden. Read Next World category Britain's bulk annuity providers should limit reinsurance exposure-BoE British life insurance companies which provide insurance for defined benefit or final salary pension schemes - known as bulk annuities - should limit exposure to reinsurers because of possible counterparty risk, the Bank of England's Prudential Regulation Authority said on Thursday. Markets category Global watchdog FSB to tackle funds' liquidity mismatch - Knot The Financial Stability Board, a global risk watchdog, plans to issue new liquidity recommendations for some investments funds after bouts of stress in recent years risked spreading over to the broader financial sector, the head of the FSB said on Thursday. ESG Regulation category Many retail funds fall short in sustainability labelling, UK watchdog says Many retail investment funds fall short when it comes to accurate labelling of their sustainability features, Britain's Financial Conduct Authority (FCA) said on Thursday. Business category Italian antitrust agency investigates Sicily and Sardinia air fares Italy's antitrust agency has launched an investigation into the pricing of flights on routes to the islands of Sicily and Sardinia, it said on Thursday. World category China regulator steps up risk management of trust companies China's National Financial Regulatory Administration on Thursday issued interim measures for the supervisory rating of trust companies to step up risk management of the firms, according to a statement released on its website. Business category Europe's grids become green power growth bottleneck, industry warns Europe's electricity grids cannot keep up with the continent's rapid expansion of renewable energy, and are becoming the main bottleneck to getting more clean energy into the network, the continent's power lobby has warned.",
    "originSummary": [
      "TikTok has joined Meta in challenging the \"gatekeeper\" status under the EU's Digital Markets Act (DMA), which imposes stricter regulations on tech companies.",
      "TikTok argues that it is a challenger, not a dominant player, in the digital advertising space and does not meet the law's revenue threshold in the European Economic Area.",
      "The company is concerned that being labeled as a gatekeeper can potentially protect existing gatekeepers and hinder competition from newer players."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "Consumer Tech Companies Brace for Challenging Holiday Season",
    "originLink": "https://www.morningstar.com/news/marketwatch/20231115464/the-grinch-may-steal-holiday-cheer-from-these-consumer-tech-companies",
    "originBody": "MarketWatch The Grinch may steal holiday cheer from these consumer tech companies Provided by Dow Jones Nov 15, 2023 9:25 PM UTC By Therese Poletti The Grinch is expected to steal some holiday cheer for several consumer-focused tech companies, in what is normally their strongest quarter. This earnings season, investors were surprised by some grim forecasts of slower growth from a range of tech companies with big consumer businesses: Apple Inc. (AAPL), Etsy Inc. (ETSY), Airbnb Inc. (ABNB), eBay Inc. (EBAY) and Amazon.com Inc. (AMZN). Each of these companies, with the exception of Airbnb, usually posts their biggest revenue of the year in the December quarter, fueled largely by the holiday shopping season. But this year, consumers have continued to be more more nervous about spending, as inflation and higher interest rates are taking a toll on their wallets. Even with Tuesday's positive news of flat inflation data for October and hopes that rate hikes are at an end, the interest rates that consumers will face for holiday purchases on credit cards are still high. Read also: The Magnificent Seven add more than $200 billion to their market caps. \"From a customer-behavior standpoint, we still see customers remaining cautious about price, trading down where they can and seeking out deals, coupled with lower spending on discretionary items,\" Amazon Chief Financial Officer Brian Olsavsky told analysts late last month. Amazon's fourth-quarter revenue forecast came in lighter than Wall Street expected. Other online retailers, such as eBay and Etsy, also see slowing sales, with eBay pointing to emerging softness in some European markets, such as Germany and the U.K., and Etsy calling the macroeconomy \"volatile.\" \"There's no doubt that this is an incredibly challenging environment for spending on consumer discretionary items,\" said Etsy CEO Josh Silverman. \"It's therefore important to acknowledge that the volatile macro climate is going to make it challenging for us to grow this quarter.\" In general, consumer demand or spending issues were the dominant disappointment of the quarter, while many enterprise-focused tech companies were buoyed by spending on artificial intelligence and building out their data centers to handle more processing of AI. \"It was a better-than-expected earnings season, not if you consider top-line beats, lots of the tech names surpassed on the top and bottom line,\" said Christine Short, vice president of strategy at Wall Street Horizons. \"It was the commentary that threw me off.\" Apple surprised Wall Street with its lackluster forecast for the December quarter, guiding for a fiscal first quarter \"similar\" to its October quarter, in which revenue fell less than 1%. And that was for a quarter that included some new iPhone 15 sales. Its revenue could even potentially fall in the December quarter. Bernstein Research analyst Toni Sacconaghi said in a recent note that he is expecting a \"muted iPhone cycle\" this year, and is forecasting iPhone sales will be down 3.5% for the fiscal 2024 full year. This year's holiday spending is expected to come close to last year's results, according to a forecast issued by Circana, formerly the NPD Group, late last month. But the research firm added that overall spending may fall short by as much as 2.5% in the November-December timeframe. Additionally, a survey of 1,000 U.S. consumers by McKinsey & Co. showed 79% are changing behaviors, buying lower-cost items or foregoing purchases entirely. \"General consumer sentiment about the U.S. economy is one of uncertainty,\" the market-research firm said. Some credit-card companies are giving mixed signals. Last month, Mastercard (MA), while highlighting \"continued resilience in consumer spending\" in the third quarter, also reported a sequential growth slowdown in October, rattling investors. The ongoing Israel-Hamas war is also fueling uncertainties. For advertisers on consumer internet platforms, such as Meta's (META) Facebook, Instagram and Snap Inc. (SNAP), the conflict is causing \"greater uncertainties\" and \"volatility.\" Meta warned of softer ad spending in the fourth quarter. As the large retailers report third-quarter results this week, investors will continue to focus on their forecasts, especially after Home Depot Inc. (HD) had a mixed call on Tuesday. Executives said that while the \"worst of the inflationary environment may be behind us,\" they still pointed to consumers staying away from certain \"big-ticket items,\" and working on smaller home projects, rather than taking on bigger costly ones. Electric-vehicle maker Tesla Inc. (TSLA) Chief Executive Elon Musk was uncharacteristically gloomy on the company's most recent earnings call, talking about how he was worried about how the high-interest-rate environment would affect the car-buying public. Are all the cautious CEOs just sandbagging, and hoping to blow out their fourth quarters? Or at least exceed their \"meh\" expectations? \"They are all trying to mange expectations, under-promise and over-deliver,\" said Short of Wall Street Horizons. \"You are seeing analysts draw down expectations for the fourth quarter.\" She pointed out that in October, estimates came down 4%, versus the typical 1% to 2%. \"This quarter, Q3, we have had the highest number of CEOs who were more uncertain than they have been since they were in the middle of the pandemic.\" So while next year should look brighter -- especially if the Fed begins to lower rates, as some are now predicting -- this holiday season could be a bleak one for many consumer-focused tech companies. -Therese Poletti This content was created by MarketWatch, which is operated by Dow Jones & Co. MarketWatch is published independently from Dow Jones Newswires and The Wall Street Journal. (END) Dow Jones Newswires 11-15-23 1625ET Copyright (c) 2023 Dow Jones & Company, Inc. Evaluate the market like an analyst. Subscribe to Morningstar Investor today. Start Free Trial Market Updates More Market Updates October CPI Report Cements End to Fed Rate Hikes With Inflation Easing Sarah Hansen 1 days ago October CPI Report Shows Inflation at a 3.2% Annual Rate, Better Than Expected Sarah Hansen 2 days ago 5 Undervalued Stocks to Buy After They’ve Sold Off David Sekera 2 days ago Markets Brief: These Funds Fared the Worst In the Bond Market Selloff Katherine Lynch 5 days ago What’s Happening In the Markets This Week Tom Lauricella 118 days ago Higher Bond Yields and Interest Rates Are Here to Stay Ivanna Hampton 6 days ago October CPI Report Forecast to Show Overall Inflation Moderating Sarah Hansen 5 days ago When Will the Fed Start Cutting Interest Rates? Preston Caldwell 405 days ago Stock Picks More Stock Picks Target Earnings: Strong Gross Margin Recovery Helps Offset Softening Consumer Demand Noah Rohr 8 days ago Is Groupon Stock a Buy, a Sell, or Fairly Valued After Earnings? Ali Mogharabi 21 hours ago A Cheap Dividend Stock That’s 30% Undervalued and Yields Above 4% Erin Lash 21 hours ago Top 10 Tax-Loss Swaps to Make Before Year-End David Sekera 2 days ago Buffett’s Berkshire Hathaway Sells Out of GM, P&G, Johnson & Johnson, and Other Longtime Holdings Greggory Warren 1 days ago 3 Warren Buffett Stocks to Buy Susan Dziubinski 723 days ago Home Depot Earnings: Unsettled Macro Pinches Demand, Posing Near-Term Pressures Jaime M Katz 8 days ago Why Market-Timing Fails John Rekenthaler 2 days ago",
    "originSummary": [
      "Consumer-focused tech companies like Apple, Etsy, Airbnb, eBay, and Amazon are expected to experience slower growth and potentially lower revenue in the December quarter.",
      "Cautious consumer spending influenced by inflation and high interest rates is impacting consumer demand for discretionary items.",
      "Retailers are forecasting lower holiday spending and credit card companies are giving mixed signals, adding to concerns about ad spending on consumer internet platforms."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "Summit on AI Regulation Falls Short: Tech Giants Continue to Exploit Lack of Oversight",
    "originLink": "https://www.theguardian.com/commentisfree/2023/nov/16/rishi-sunak-ai-plan-big-tech-control-protect",
    "originBody": "Rishi Sunak with Tesla and SpaceX CEO Elon Musk in London, 2 November 2023. Photograph: Reuters Opinion Artificial intelligence (AI) Rishi Sunak’s AI plan has no teeth – and once again, big tech is ready to exploit that Georg Riekeles and Max von Thun Tech companies are pushing the idea that the only way to make AI safe is to leave them in control. Trusting them could lead to disaster Thu 16 Nov 2023 02.00 EST T his month, the British prime minister, Rishi Sunak, convened government representatives, AI companies and experts at Bletchley Park – the historic home of Allied code-breaking during the second world war – to discuss how the much-hyped technology can be deployed safely. The summit has been rightly criticised on a number of grounds, including prioritising input from big tech over civil society voices, and fixating on far-fetched existential risks over tangible everyday harms. But the summit’s biggest failure – itself a direct result of those biases – was that it had nothing meaningful to say about reining in the dominant corporations that pose the biggest threat to our safety. The summit’s key “achievements” consisted of a vague joint communique warning of the risks from so-called frontier AI models and calling for “inclusive global dialogue” plus an (entirely voluntary) agreement between governments and large AI companies on safety testing. Yet neither of these measures have any real teeth, and what’s worse, they give powerful corporations a privileged seat at the table when it comes to shaping the debate on AI regulation. Big tech is currently promoting the idea that its exclusive control over AI models is the only path to protecting society from major harms. In the words of an open letter signed by 1,500 civil society actors, accepting this premise is “naive at best, dangerous at worst”. Governments truly serious about ensuring that AI is used in the public interest would pursue a very different approach. Instead of noble-sounding statements of intent and backroom deals with industry, what is really needed are tough measures targeting that corporate power itself. Aggressive enforcement of competition policy and tough regulatory obligations for dominant gatekeepers are key. As it stands, a handful of tech giants have used their collective monopoly over computing power, data and technical expertise to seize the advantage when it comes to large-scale AI foundation models. These are models trained on large swathes of data that can be adapted to a wide range of tasks, as opposed to AI applications designed with a specific purpose in mind. Smaller companies without access to these scarce resources find themselves signing one-sided deals with (or being acquired by) larger players to gain access to them. Google’s takeover of Deepmind and OpenAI’s $13bn “partnership” with Microsoft are the best-known examples, but not the only ones. The tech giants are also dominant in many other markets (including search engines, cloud computing and browsers), which they can exploit to lock users into their own AI models and services. As ever more people gravitate and provide data to a handful of AI models and services, network effects and economies of scale are set to magnify this considerable initial advantage further. In the jargon of economists, this a market that is prone to tipping. A concentrated market for foundation models would allow a handful of dominant corporations to steer the direction and speed of AI innovation, and enable them to exploit, extort and manipulate the many businesses, creators, workers and consumers dependent on their services and infrastructure. In short: the tech winners of yesterday are now extending and reinforcing their monopolistic hold through AI. Governments should not be complicit in that. Antitrust authorities may have failed to prevent digital technologies from being monopolised in the past, but competition policy – if enforced effectively – has a major role to play in tackling AI concentration. Competition authorities must use their existing powers to police takeovers, cartels and monopolistic conduct to prevent a handful of digital gatekeepers from running amok in their quest for ever-greater profits. This now requires investigating and where necessary breaking up anti-competitive deals between big Tech and AI startups, and preventing digital gatekeepers from leveraging their control over dominant platforms, such as in search and cloud computing, to entrench their hold on AI. Yet it is also important to acknowledge that even in a competitive market, the number of large-scale model providers will be limited, given the resources required to train and deploy such models. This is where regulation must step in to impose unprecedented responsibilities on dominant companies. As AI gains a bigger role in decision-making across society, safety, reliability, fairness and accountability are critical. AI systems can perpetuate biases from their underlying datasets or training, and generate plausible-sounding but false responses known as “hallucinations”. If deployed by those with malicious intent, they can also be used to create convincing propaganda, spy on workers and manipulate or discriminate against individuals. These harms are particularly grievous when they stem from a foundation model because of the cascading effects into downstream uses. Biases, errors, discrimination, manipulation or arbitrary decisions therefore present singular risks at the foundation level. The European Union is currently vying to become the first global authority to put forward binding AI rules imposing obligations on different uses of AI according to risk. However, the EU’s AI Act is struggling to measure up to the foundation model threat. skip past newsletter promotion Sign up to This is Europe Free weekly newsletter The most pressing stories and debates for Europeans – from identity to economics to the environment Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy. We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Currently, EU legislators are considering imposing a new set of tiered obligations on foundation model providers. Among other things, these providers could be required to share information with regulators on training processes (including the use of sensitive and copyrighted data) and submit to auditing of systemic risks. This will go some way towards mitigating the risks of AI. But above and beyond this, given their central role in the AI ecosystem, the dominant corporations providing large-scale models must be given strict overarching responsibilities to behave fairly and in the public interest. One way of achieving this, building on ideas developed by Jack Balkin at Yale Law School and Luigi Zingales at the University of Chicago, would be to impose a certain number of fiduciary duties on GPAI providers. A fiduciary duty is the highest standard of care in law and implies being bound both legally and ethically to act in others’ interests. An alternative or complementary approach would entail designating digital gatekeepers as public utilities (or “common carriers” in US terminology), mandated to treat their customers fairly and ensure operational safety. This legal status could conceivably be applied to both the foundation models upon which AI applications are built and the cloud computing infrastructure hosting them. The EU’s Digital Markets Act, which imposes pro-competition obligations on dominant tech firms, is one potential avenue for pursuing this. What is abundantly clear is that we cannot trust self-regulation by individual companies, let alone big tech, to guarantee safety and openness in AI. Only by tackling monopoly power, and ensuring that power comes with responsibility, can we realise the promise – and mitigate the risks – of this emerging technology. Georg Riekeles is associate director of the European Policy Centre, an independent thinktank based in Brussels. Max von Thun is director of Europe and transatlantic partnerships at the Open Markets Institute, an anti-monopoly thinktank Explore more on these topics Artificial intelligence (AI) Opinion Computing European Union Europe Regulators comment Reuse this content",
    "originSummary": [
      "The recent summit on AI deployment led by the British prime minister, Rishi Sunak, failed to address the issue of reigning in dominant tech corporations.",
      "The summit resulted in vague statements and voluntary agreements that lack real regulatory power over AI.",
      "Experts argue that the concentration of power in a few tech giants can lead to exploitation and manipulation, highlighting the need for aggressive enforcement of competition policy and tough regulations to ensure AI is used in the public interest."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "70 Dutch Tech Companies to Exhibit at CES 2024, Including Innovation Award Winners",
    "originLink": "https://www.prweb.com/releases/the-kingdom-of-the-netherlands-to-showcase-70-tech-companies-at-ces-2024-301990051.html",
    "originBody": "The Kingdom of the Netherlands to Showcase 70 Tech Companies at CES 2024 News provided by Mercury Global Partners for The Kingdom of the Netherlands 16 Nov, 2023, 07:32 ET Share this article Share toX Share this article Share toX The Netherlands logo The Netherlands Pavilion CES 2024 delegation includes 70 startups and scale-ups, including 12 CES 2024 Innovation Award winners that span a wide berth of sectors, including sustainability and circularity, consumer tech, health tech and medtech, wearables, audio and video, AI, big data security and blockchain, AR/VR, vehicle and battery tech, photonics, sensors optics and robotics, and the future of work AMSTERDAM and SAN FRANCISCO, Nov. 16, 2023 /PRNewswire-PRWeb/ -- The Kingdom of the Netherlands today announced the 70 Dutch startup and scale-up tech companies that will participate on January 9-12, 2024, as part of the Netherlands Tech Pavilion at CES 2024, the global stage for technology innovation. For the eighth consecutive year, the Netherlands will showcase its most innovative tech solutions at Eureka Park at the Venetian Expo (Hall G, Booth 62100), and ten NL Tech Pavilion companies will showcase their technology at CES Unveiled Las Vegas on Sunday evening, January 7 at the Mandalay Bay. The CES 2024 NL Tech Pavilion delegation features 12 CES 2024 Innovation Award winners, including Axelera.ai, Doser, Focus, Healthplus.ai, Ink Invent, LV Energy, Mantispectra, Naya, Sevvy, SlimDesign, SusPho and Whispp. The NL Tech Pavilion theme for CES 2024 is \"Let's Innovate Sustainable Solutions.\" Preview the CES 2024 NL Tech Pavilion companies here. \"The Netherlands has a storied history of pushing the world towards new innovation,\" said HRH Prince Constantijn van Oranje, Special Envoy, Techleap.nl. \"The 70 startups and scale-ups participating at CES 2024 represent one of the most exciting delegations. Their tech solutions are ambitious, unconventional, and most of all, focused on a better future for everyone.\" \"The 70 startups and scale-ups participating at CES 2024 represent one of the most exciting delegations. Their tech solutions are ambitious, unconventional, and most of all, focused on a better future for everyone,\" said HRH Prince Constantijn van Oranje, Special Envoy, Techleap.nl. Post this The Netherlands is one of Europe's largest technology hubs, with 2.6 times as many startups per one million residents as the European average — and is the third leading tech startup ecosystem in Europe. Dutch ingenuity and innovation have played a significant role in the world's evolution over the past centuries. The 70 companies participating in the CES 2024 NL Tech Pavilion are actively working to contribute to a better world and span a wide berth of tech sectors that will define future economies, including: CONSUMER TECH: Arc: Accessories for computers and mobile phones. Arc Pulse is renowned as the most minimalist and unique in the world of phone cases. (Startup) SUSTAINABILITY AND CIRCULARITY: Dayrize: The global leader for rapid climate impact assessment of consumer products. (Startup) LV Energy: Develops patented technology for harvesting energy from sound waves. (Startup and CES 2024 Innovation Award Honoree) HomeCube: Automated by AI to revolutionize household energy management. (Startup) SusPhos: A pioneering company focused on upcycling phosphate-rich waste streams to generate high-quality alternatives to replace fossil-sourced products. (Startup and CES 2024 Innovation Award Honoree) Sevvy: Technology that enables healthy, sustainable and fast cooking and baking. (Startup and CES 2024 Innovation Award - Best of Innovation) DIGITAL HEALTH, HEALTH TECH AND MEDTECH: Alphabeats: EEG-based mental training that uses music and neurofeedback to improve performance in elite athletes. (Startup) AMES: Creator of a unique remote patient-monitoring technique to safeguard COPD patients from potentially life-threatening and costly hospitalizations. (Startup) Doser: Enabling pharmacists to produce personalized medication locally and on demand. (Startup and CES 2024 Innovation Award Honoree) EW2Health: Patented, AI-driven, stress-free monitoring solution and weight loss results. (Startup) FlowBeams: Developing a groundbreaking technology to inject without a needle. (Startup) Healthplus.ai: Enabling proactive surgery care. (Startup and CES 2024 Innovation Award Honoree) Medical X: Providing innovative training and education in the field of medicine. (Startup) RetinaScope: A handheld, low-cost retinal imaging device to empower AI-based screening for Diabetic Retinopathy, Glaucoma and Age-Related Macular Degeneration. (Startup) Sencure: A medical device company that develops high-end chips and medical wearables to accelerate and improve remote patient monitoring. (Startup) SmartQare: A medical 24/7 monitoring solution for data-driven clinical decision support in remote patient care. (Startup) Splendo Health: Developer of patient monitoring and communication software designed to improve patient well-being and outcomes in the perioperative space. (Startup) Whispp: AI-powered, real-time assistive voice technology and calling app that converts whispered and affected speech into a person's clear, natural voice. (Startup and CES 2024 Innovation Award Honoree) AI, BIG DATA, SECURITY AND BLOCKCHAIN: Axelera.ai: Creator of the world's most powerful and advanced solutions for AI at the edge. Its game-changing hardware and software platform concentrates the AI computational power of an entire server into a single chip at a fraction of the power consumption and price of AI hardware today. (Startup and CES 2024 Innovation Award Honoree) Bubl Cloud: Restarting privacy-safe innovation on personal data by enabling innovators to create privacy-safe services in the cloud. (Startup) CodeGlass: A software development tool designed to enhance problem-solving, even when issues are difficult to reproduce, or there's a lack of documentation or developers. (Startup) COTIT: Ensures real-time visibility and traceability of goods from origin to destination. (Startup) Dology: A software platform that provides modern AI-driven knowledge infrastructure for customer-facing teams. (Startup) Engaige: An AI-powered customer service automation platform. (Startup) Freeday: A staffing platform for digital employees. (Startup) Focus: The world's first predictive AI analysis platform that accurately and reliably predicts the technological future based on global patent data. (Startup and CES 2024 Innovation Award Honoree) Fuga Cloud: Helps keep websites, business-critical platforms, and applications online 24/7. (Startup) IntrinsicID: A provider of security IP for embedded systems based on Physical Unclonable Functions (PUF) technology. (Scale-up) Klippa: An AI-based software company that automates administrative tasks. (Startup) LiveDrop: An intuitive and secure unidirectional data-sharing technology that can be integrated into existing applications or used independently. (Startup) MOOS: Powered by AI to predict stock level changes, register transactions and send customizable triggers accordingly. (Startup) SandGrain: Addresses the challenge of securing IoT end nodes with a simple system at a very low cost. (Startup) Solvimon: A next-generation pricing and billing platform. (Startup) TokenMe: A breakthrough construction-monitoring solution that improves productivity, safety and security using mobile sensors, AI and a real-time dashboard. (Startup) WEARABLES, AUDIO AND VIDEO: Absolute Audio Labs (AAL): Audio software for the hearing impaired. (Scale-up) BREGGZ Hearables: The world's first truly wireless custom-made in-ear computer (Startup) Concept 7 YourStoryz: A platform for mobile journalism, content creation and crowd journalism that combines a mobile app with a content distribution platform using AI. (Startup) Dopple: Specializes in the design, development and industrialization of miniaturized smart wearables. (Startup) Infuse Video: Generates personalized videos for customer engagement, training, marketing, and to create dynamic experiences. (Startup) Livery Video: An irresistibly fun, shoppable and engaging video platform for businesses, media and influencers. (Startup) NOWATCH: A personalized health tracker that keeps you aware of how your lifestyle impacts your health by measuring stress, sleep and activity so that you can take charge of your well-being. (Startup) SlimDesign: Creator of PhoneCam™, the ultimate safety companion. PhoneCam is the world's first affordable miniaturized AI-powered body camera that provides personal safety by deterring and de-escalating unwanted behavior. (Startup and CES 2024 Innovation Award Honoree) PHOTONICS, SENSORS, OPTICS AND ROBOTICS: Addoptics: Scale prototyping and production with affordable, industrial-quality optics. (Scale-up) InPhocal: A unique, concentric laser beam that reduces the need for ink and is 2.5 times faster than printing. (Startup) MantiSpectra: NIR (Near Infrared) spectroscopy on a miniaturized spectral chip that can accurately measure material properties in real-time using just light. Enables portable NIR spectroscopy. (Startup and CES 2024 Innovation Award Honoree) Morphotonics: Nanotechnology for micro and nano-scale surfaces for next-gen mobile device screens, immersive AR glasses, higher efficiency solar panels and high-accuracy sensors. (Scale-up) Ommatidia: Creates an optical metrology and ranging architecture for 3D applications. (Startup) Scantinel Photonics: A leading FMCW sensing technology company offering next-generation LiDAR solutions for autonomous mobility. (Startup) Starnus Technology: Developer of a highly flexible autonomous mobile robot (AMR) solution, which allows third-party logistics (3PL) companies to deal with their rapidly changing operations. (Startup) VEHICLE TECHNOLOGY AND BATTERY TECHNOLOGY: CarbonX: New carbon material that helps tire makers meet the increasing demand for sustainability, safety and performance. (Startup) Ink Invent: A pigment manufacturer and developer of a 'Tunable Detection and Determination Technology.' (Startup and CES 2024 Innovation Award Honoree) Squad Mobility: The world's first Solar City Car for sharing and private use. The ultimate smart urban mobility solution for emissions, congestion and parking. (Scale-up) SolutionAir: A technology that can convert an existing engine into a high-pressure air combustion engine that uses no fossil fuels and produces zero emissions. (Startup) Urban Mobility Systems: Developer and manufacturer of BEVs (battery electric vehicles) and electrification systems for construction equipment, enabling zero-emission transport and construction. (Scale-up) AUGMENTED AND VIRTUAL REALITY: Beecot: Provides construction and real estate solutions. Allows users to visualize the BIM model in the field by unlocking it in 2D, 3D, VR, and AR. (Startup) Fectar: Interactive augmented and virtual reality experiences without programming are possible with Fectar's VR and AR creator platform. (Startup) SenseGlove: Force and haptic feedback gloves that enable professionals to physically interact with virtual objects for VR training and research purposes. (Scale-up) FUTURE OF WORK: 2DAYSMOOD: An easy-to-use tool for empowering directors, managers, and employees to take responsibility for creating a positive work environment. (Startup) Sabender: A learning tool enriched with VR to increase effective teamwork. (Startup) DialogueTrainer: Next-generation simulation platform for conversation training. (Scale-up) EZ Factory: SaaS-based platform for optimizing operational effectiveness and efficiency of factory floor operations. (Scale-up) Happybase: A development platform grounded in positive psychology and design thinking, Happybase offers an approach to the major challenges organizations face with talent retention and development. (Startup) My Global Workspace: Co-working spaces connected to universities in emerging countries. (Startup) Naya: An ecosystem that empowers digital creators and creators of Naya Create, a modular keyboard that increases efficiency, flexibility and health. (Startup and CES 2024 Innovation Award Honoree) StellarUp: One platform for all organizational learning and development. (Startup) \"The Netherlands is proud of its outsized influence in technology, science and engineering,\" said Dirk Janssen, Consul General of the Netherlands, San Francisco. \"From the world's first telescopes in the 1600s to the machines that print the most advanced microchips today, Dutch entrepreneurs are well-acquainted with finding solutions for some of the world's greatest challenges. The CES 2024 NL Tech Pavilion delegation represents the next generation of Dutch innovators, ready to share their solutions with the world at CES.\" Interested media and analysts who want to schedule an interview before or during CES 2024, please contact NLatCES2024@wearemgp.com. About The Kingdom of the Netherlands The Netherlands strives to solve societal and economic challenges with local and international partners. The country ranks seventh on the Global Innovation Index, and Amsterdam is one of the fastest-growing ecosystems in Europe. As a trading nation, the Netherlands has continuously ranked as one of the top five foreign investors in the U.S. for multiple years, making the Netherlands the number one country with which the U.S. maintains a trade surplus. More than 955K jobs in the United States result from the strong economic relations with the Netherlands. The Consulate General of the Netherlands in San Francisco, in partnership with the Holland in the Valley network and the ScaleNL accelerator, empowers Dutch entrepreneurs and talent to innovate and scale in the U.S. Learn more at United StatesNetherlandsandyou.nl. All trademarks used herein are the property of their respective owners. ### Media Contact Mindy M. Hull, Mercury Global Partners for The Kingdom of the Netherlands, 1 4158899977, NLatCES2024@wearemgp.com, https://www.netherlandsandyou.nl/ Sietze Vermeulen, The Kingdom of the Netherlands, 1 +1 415 866 5572, sietze.vermeulen@minbuza.nl, https://www.netherlandsandyou.nl/ SOURCE Mercury Global Partners for The Kingdom of the Netherlands × Modal title",
    "originSummary": [
      "The Kingdom of the Netherlands will have a significant presence at CES 2024 with 70 tech companies, including 12 Innovation Award winners.",
      "These companies come from diverse sectors and are focused on creating a better future.",
      "The Netherlands is recognized for its innovative tech solutions and has strong economic ties with the United States."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "Top 5 Software Companies in Toronto Revolutionizing Industries",
    "originLink": "https://builtin.com/software-engineering-perspectives/software-companies-in-toronto",
    "originBody": "The software industry is a vast global landscape of companies providing solutions to businesses and consumers, and some of the top brands have established office locations in Canada. As an epicenter for the country’s tech workforce, Toronto is home to a substantial talent pool filling jobs in software and other adjacent industries. Here are some of the software companies in Toronto serving customers in fields including life sciences and edtech. Top Software Companies in Toronto Okta Veeva Top Hat Loopio OneHash Software Companies in Toronto to Know Okta View Profile We are hiring Okta operates a secure identity cloud, which is used as an identity management service for customers in both SaaS and consumer contexts. With Okta’s solutions, clients can offer ranges of security to their users, from multi-factor authentication for maximum security to passwordless single sign-on entry and universal login for a smoother user experience. Okta Is HiringView Open Jobs Further ReadingHere’s a List of the Largest Software Companies Veeva View Profile Follow Veeva works with clients in the life science space, providing software that’s designed specifically to meet the industry’s needs. Its cloud-based product offerings encompass clinical, medical, regulatory, safety, commercial and data solutions. Veeva’s customers have included prominent names such as Bayer, Gilead Sciences and Merck. Veeva Is HiringView Open Jobs Top Hat View Profile Follow Top Hat is an edtech software company that makes interactive digital textbooks for students. Using the Top Hat software, students can bring multimedia like videos, graphics and images into their texts, mimicking the way earlier generations of students have annotated their texts with pen. The company markets its services under a SaaS model, allowing professors and institutions to subscribe directly. Top Hat Is HiringView Open Jobs Loopio View Profile Follow Loopio is a cloud-based software that creates requests for proposals, or RFPs, for medium to large client businesses. An RFP is a document that describes and announces a project and solicits proposals with bids from interested contractors. Creating them at scale is time consuming and tedious and can be clunky with various contractors using different technologies, so Loopio offers a service that streamlines and automates this process. Loopio Is HiringView Open Jobs More Companies Hiring in CanadaTop Tech Companies in Toronto OneHash View Profile Follow OneHash is an enterprise resource management platform that handles sales, service, marketing, customer relationships and other core aspects of enterprise business. It also includes scheduling and calendar syncing. By joining all these services into a single software, the company is able to offer competitive pricing when compared to customers paying a la carte. OneHash Is HiringView Open Jobs Rose Velazquez contributed reporting to this story. Software Software Engineering Software Engineering Perspectives",
    "originSummary": [
      "Toronto is a hub for software companies serving different industries like life sciences and edtech.",
      "Notable software companies in Toronto include Okta, Veeva, Top Hat, Loopio, and OneHash.",
      "Each company specializes in a different area: Okta provides secure identity management, Veeva focuses on software for the life science industry, Top Hat creates interactive digital textbooks, Loopio simplifies the RFP process, and OneHash offers an enterprise resource management platform."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  },
  {
    "title": "The Future of Fashion Tech: Digital Passports and Mixed Reality",
    "originLink": "https://www.voguebusiness.com/story/technology/whats-next-in-fashion-tech-digital-passports-and-mixed-reality",
    "originBody": "Make better business decisions Sign up to our newsletter for a truly global perspective on the fashion industry SIGN UP Enter your email to receive editorial updates, special offers and breaking news alerts from Vogue Business. You can unsubscribe at any time. Please see our privacy policy for more information. MEMBER TECHNOLOGY What’s next in fashion tech: Digital passports and mixed reality What does the future hold for digital fashion? And how will digital IDs change luxury? DressX founders Natalia Modenova and Daria Shapovalova and Eon CEO Natasha Franck joined the Vogue Business Executive Summit to share their outlooks. BY VOGUE BUSINESS TEAM November 16, 2023 This article on fashion tech is part of our Vogue Business membership package. To enjoy unlimited access to our weekly Technology Edit, which contains Member-only reporting and analysis and our NFT Tracker, sign up for membership here. The direction of travel for fashion’s future includes physical clothing with built-in “operating systems” and mixed reality that adds digital enhancements to the world around us. That’s according to the founders of two of the leading fashion-tech companies, Eon and DressX, who are helping executives navigate the new stage of the internet.",
    "originSummary": [
      "Eon and DressX, fashion-tech companies, believe that the future of fashion will incorporate physical clothing with embedded \"operating systems\" and mixed reality technology.",
      "The founders of Eon and DressX discussed these insights at the Vogue Business Executive Summit.",
      "The companies aim to help executives adapt to the evolving internet era."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700140026858
  }
]
