[
  {
    "id": 39746468,
    "title": "YouTube prosazuje zveřejnění obsahu vytvořeného umělou inteligencí",
    "originLink": "https://blog.google/intl/en-in/products/platforms/how-were-helping-creators-disclose-altered-or-synthetic-content/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39746468",
    "commentBody": "",
    "originSummary": [
      "YouTube spouští nový nástroj v Creator Studiu, který tvůrcům umožňuje zveřejňovat upravená nebo syntetická média vytvořená pomocí generativní umělé inteligence, aby se zvýšila transparentnost a důvěra diváků.",
      "Povinné zveřejnění zahrnuje upravené záběry, syntetické hlasy a digitálně upravené obličeje, které se zobrazují v popisu videa a v přehrávači videa.",
      "Platforma plánuje prosadit pravidla pro zveřejňování informací a aktualizovat zásady ochrany osobních údajů, aby odstranila obsah generovaný umělou inteligencí nebo syntetický obsah napodobující skutečné osoby, a chce tak objasnit používání generativní umělé inteligence při tvorbě obsahu."
    ],
    "commentSummary": [
      "Debata se soustředí na nutnost označování obsahu vytvořeného umělou inteligencí na platformách, jako je YouTube, aby se rozlišilo mezi skutečným obsahem a obsahem vytvořeným umělou inteligencí.",
      "Obavy se týkají možného zneužití UI, problémů s prosazováním a dopadu na svobodu projevu a důvěru v online obsah.",
      "Účastníci diskutují o ověřování pravosti obsahu, vlastnictví autorských práv u obsahu generovaného umělou inteligencí, regulaci syntetických změn v audiu a videu a využití technologií, jako je PKI, pro ověřování, přičemž vyjadřují skepsi ohledně účinnosti takového označování kvůli dezinformacím a manipulaci uživatelů v digitální sféře."
    ],
    "points": 668,
    "commentCount": 398,
    "retryCount": 0,
    "time": 1710778798
  },
  {
    "id": 39749312,
    "title": "Stability.ai představuje SV3D: 3D video: nejmodernější generování 3D videa",
    "originLink": "https://stability.ai/news/introducing-stable-video-3d",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39749312",
    "commentBody": "",
    "originSummary": [
      "SV3D je nový pokročilý generativní model, který z jednotlivých snímků vytváří vysoce kvalitní 3D videa konzistentní s pohledem a nabízí dvě varianty: SV3D_u pro orbitální videa a SV3D_p pro 3D videa podél definovaných drah kamery.",
      "SV3D překonává předchozí modely jako Stable Zero123 a Zero123-XL, vyniká konzistencí více pohledů a novou syntézou pohledů a je k dispozici jak pro komerční použití s členstvím Stability AI, tak pro nekomerční použití s váhami na Hugging Face.",
      "SV3D využívá difuzní modely videa, zlepšuje optimalizaci rozptýleného osvětlení a zavádí maskovanou ztrátu při destilaci skóre pro lepší výstupy, vylepšuje 3D neuronová zářivá pole a podrobné reprezentace sítě."
    ],
    "commentSummary": [
      "Společnost Stability.ai představila aplikaci Stable Video 3D, která porovnává efektivitu svého modelu s jedním obrazem s modely využívajícími více obrazů.",
      "Diskuse se točí kolem technických otázek týkajících se konkrétních GPU, omezení a budoucího vývoje modelů GPU pro vysoce výkonné počítačové sestavy.",
      "Témata se týkají generování 3D modelů ve vysokém rozlišení z obrázků, automatizace tvorby a tisku 3D modelů, potenciálního využití umělé inteligence v hračkách a figurkách pro hry a problémů při získávání vysoce kvalitních 3D souborů, přičemž jsou ukázány možnosti i omezení těchto technologií."
    ],
    "points": 562,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1710792377
  },
  {
    "id": 39742422,
    "title": "Chybná konfigurace databáze Firebase odhalila 125 milionů uživatelských záznamů",
    "originLink": "https://env.fail/posts/firewreck-1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742422",
    "commentBody": "",
    "originSummary": [
      "Chybná konfigurace služby Firebase vedla k odhalení 125 milionů uživatelských záznamů, čímž došlo k vyzrazení citlivých údajů, jako jsou hesla a fakturační údaje.",
      "Ruční kontrola 550 tisíc záznamů přešla na automatické skenování pomocí nástroje Catalyst, který identifikuje data uložená v databázi Supabase.",
      "Navzdory této zprávě pouze 24 % majitelů postižených webů chybné konfigurace opravilo a jen 0,2 % z nich nabídlo odměny za chyby."
    ],
    "commentSummary": [
      "Diskuse se zabývá zranitelnostmi zabezpečení v systému Firebase s důrazem na složitá bezpečnostní pravidla a možné zneužití platformy.",
      "Účastníci diskutují o otázkách, jako je ukládání velkých binárních dat, paměťové limity a význam omezení velikosti požadavků.",
      "Obavy se týkají nastavení autorizačních pravidel, bezpečnosti zákazníků, ochrany soukromí a kritiky podpory společnosti Google a upřednostňování nákladů při vývoji cloudu."
    ],
    "points": 550,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1710759690
  },
  {
    "id": 39742578,
    "title": "Chybná představa o zákonu EU o banneru souborů cookie",
    "originLink": "https://www.amazingcto.com/cookie-banners-are-not-needed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742578",
    "commentBody": "",
    "originSummary": [
      "EU bannery se soubory cookie na webových stránkách nevyžaduje; společnosti je používají ke sledování uživatelů pro reklamy, jak je uvedeno v článku.",
      "Autor navrhuje alternativní, méně invazivní způsoby získání souhlasu uživatele se sledováním.",
      "Článek zdůrazňuje význam ochrany osobních údajů a předpisů EU, které ji zajišťují, a nabízí další zdroje pro technické ředitele v oblasti vývoje a správy softwaru."
    ],
    "commentSummary": [
      "Diskuse se točí kolem společností, které skrývají poplatky a sledují údaje uživatelů bez souhlasu, zejména pokud jde o bannery se soubory cookie a pravidla GDPR.",
      "Debata se zaměřuje na účinnost zákonů na ochranu soukromí, dopad na zkušenosti uživatelů a odpovědnost společností a vlády při prosazování ochrany spotřebitele.",
      "Diskutovaná možná řešení zahrnují zásuvné moduly pro prohlížeče a nutnost přísnějšího vymáhání práva, aby se řešily problémy se sledováním online a ochranou soukromí."
    ],
    "points": 547,
    "commentCount": 574,
    "retryCount": 0,
    "time": 1710761116
  },
  {
    "id": 39742692,
    "title": "Rust zavádí Cranelift pro rychlejší generování kódu",
    "originLink": "https://lwn.net/SubscriberLink/964735/8b795f23495af1d4/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742692",
    "commentBody": "",
    "originSummary": [
      "Cranelift, backend pro generování kódu pro WebAssembly, je nyní od října 2023 volitelnou součástí nočního řetězce nástrojů Rust, který se zaměřuje na rychlé generování kódu pro ladění sestavení a optimalizace, které konkurují stávajícím kompilátorům.",
      "Jeho univerzální architektura rozšiřuje jeho použití i mimo WebAssembly a umožňuje rychlejší kompilaci aplikací závislých na interpretu.",
      "Diskuse zdůrazňují výhody Craneliftu oproti LLVM, obavy o stabilitu LLVM, překážky při vývoji překladače a potenciál pro zlepšení vývoje Rustu prostřednictvím optimalizovaného generování kódu."
    ],
    "commentSummary": [
      "Zaměřuje se na integraci generování kódu Cranelift do jazyka Rust, zkoumá jeho kompatibilitu s LLVM, optimalizační strategie a příslib rychlejšího generování výstupů.",
      "Uživatelé hodnotí časy sestavení, zkoumají optimalizace e-grafu a porovnávají výkon Craneliftu s LLVM, přičemž upozorňují na potenciál rychlejší kompilace a překážky při optimalizaci rozsáhlých programů.",
      "Diskutuje se také o řešení nevyžádané pošty a komentářů se sníženým počtem hlasů v online fórech a zdůrazňuje se význam vyvážených pohledů a kritické analýzy v technických článcích."
    ],
    "points": 369,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1710761982
  },
  {
    "id": 39746806,
    "title": "Agentura EPA zakázala používání azbestu, který je smrtelným karcinogenem",
    "originLink": "https://apnews.com/article/epa-asbestos-cancer-brakes-biden-72b0fa8b36adedaff6000034d35c2acd",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39746806",
    "commentBody": "",
    "originSummary": [
      "Agentura pro ochranu životního prostředí (EPA) oznámila rozsáhlý zákaz azbestu, známého karcinogenu, který je stále přítomen v některých výrobcích, s odkazem na jeho závažná zdravotní rizika.",
      "Zákaz, který je zásadním opatřením pro ochranu veřejného zdraví, je v souladu s úsilím o regulaci nebezpečných látek podle zákona z roku 2016 a dotkne se zejména průmyslu výroby chloru a alkalických hydroxidů, kde bude postupně ukončován.",
      "Některá průmyslová odvětví vyjádřila obavy z přerušení dodávek, zatímco agentura EPA posuzuje používání azbestu ve starších budovách a od skupin obhájců práv a zákonodárců získala pochvalu za ochranu veřejného zdraví před toxickými látkami."
    ],
    "commentSummary": [
      "Diskuse zdůrazňuje rizika a předpisy spojené s expozicí azbestu, vliv politických ideologií na vládní rozhodnutí a problémy v oblasti odpovědnosti za jadernou energii.",
      "Zkoumá debaty o zdrojích energie, bezpečnostních předpisech a pojištění ve vysoce rizikových odvětvích a porovnává zdravotní rizika, která představují různé látky.",
      "Zabývá se také významem osobních ochranných prostředků při manipulaci s nebezpečnými materiály, závislostí společnosti na průmyslových odvětvích, jako jsou fosilní paliva, a správným řízením rizik v různých odvětvích."
    ],
    "points": 353,
    "commentCount": 340,
    "retryCount": 0,
    "time": 1710780458
  },
  {
    "id": 39745993,
    "title": "Porovnání komunikačních technologií serverů reálného času",
    "originLink": "https://rxdb.info/articles/websockets-sse-polling-webrtc-webtransport.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39745993",
    "commentBody": "",
    "originSummary": [
      "Článek hodnotí různé metody komunikace mezi serverem a klientem v reálném čase, včetně WebSockets, událostí zasílaných serverem, Long-Polling, WebRTC a WebTransport, a zdůrazňuje jejich výkonnostní rozdíly a rozdíly ve škálovatelnosti.",
      "WebSockets umožňují obousměrnou komunikaci, události zasílané serverem jsou vhodné pro časté aktualizace, Long-Polling je zastaralý a WebTransport vyniká nízkou latencí a vysokou propustností.",
      "Jsou uvedena doporučení pro výběr vhodné metody na základě konkrétního případu použití spolu s návrhy na zlepšení doby odezvy protokolu HTTP a řešení omezení připojení, přičemž se podporuje používání replikačního protokolu RxDB pro synchronizaci klientů."
    ],
    "commentSummary": [
      "Diskuse se zabývá různými webovými komunikačními technologiemi, jako jsou WebSockets, Server-Sent Events, Long-Polling, WebTransport a WebRTC, a zdůrazňuje jejich výhody, nevýhody a problémy.",
      "Zdůrazňuje význam přizpůsobení se novým protokolům a jejich sladění s potřebami aplikací při výběru push technologie pro lepší přenos dat v reálném čase a lepší konektivitu.",
      "Celkově je v rozhovoru zdůrazněno využití moderních webových technologií pro spolehlivá a efektivní řešení komunikace v reálném čase."
    ],
    "points": 320,
    "commentCount": 160,
    "retryCount": 0,
    "time": 1710776217
  },
  {
    "id": 39749646,
    "title": "Nvidia představuje čipy Blackwell AI pro vyšší výkon",
    "originLink": "https://www.cnbc.com/2024/03/18/nvidia-announces-gb200-blackwell-ai-chip-launching-later-this-year.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39749646",
    "commentBody": "",
    "originSummary": [
      "Generální ředitel společnosti Nvidia Jensen Huang představil na vývojářské konferenci společnosti Nvidia nové čipy pro umělou inteligenci s názvem Blackwell, včetně čipu GB200 Grace s výkonem 20 petaflopsů a \"transformačním enginem\" pro modely umělé inteligence.",
      "Představení softwaru NIM má zjednodušit nasazení umělé inteligence na grafických procesorech Nvidia, včetně starších modelů, a naznačuje transformaci společnosti Nvidia v poskytovatele platforem podobného Microsoftu nebo Applu.",
      "Společnost Nvidia plánuje spolupracovat s významnými poskytovateli cloudových služeb, jako jsou Amazon, Google, Microsoft a Oracle, a nabízet tak přístup ke GB200, čímž chce upevnit své postavení na konkurenčním trhu s umělou inteligencí."
    ],
    "commentSummary": [
      "Generální ředitel společnosti Nvidia Jensen Huang představuje nové čipy pro umělou inteligenci a kontejnerový systém pro snadné nasazení, čímž naznačuje přechod k pozici poskytovatele platformy pro umělou inteligenci, jako jsou Microsoft a Apple.",
      "Nárůst počtu společností, které se uchylují ke cloudovým službám, představuje pro společnost Nvidia výzvu, která vyvolává diskuse o možných antimonopolních problémech a otevření standardu CUDA společnosti Nvidia.",
      "Diskuse zdůrazňuje silnou pozici společnosti Nvidia na trhu grafických procesorů, ale zároveň se zabývá obavami z konkurence, změnami na trhu a strategickou trajektorií společnosti, včetně překážek v integraci hardwaru a softwaru a používání 4bitových výpočtů s plovoucí desetinnou čárkou v úlohách odvozování."
    ],
    "points": 313,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1710793966
  },
  {
    "id": 39742114,
    "title": "Elegantní samostatně hostovaný nástroj pro sledování projektů: Planka",
    "originLink": "https://github.com/plankanban/planka",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742114",
    "commentBody": "",
    "originSummary": [
      "Planka je open-source nástroj pro sledování projektů, který umožňuje vytváření projektů, nástěnek, karet a úkolů, sledování času, nastavování termínů a přidávání příloh.",
      "Podporuje markdown, filtrování podle členů/značek, aktualizace v reálném čase a interní oznámení, nasaditelný různými metodami s jednotným přihlášením přes OpenID Connect.",
      "Technický zásobník: Stack: React, Redux, PostgreSQL; licencováno pod AGPL-3.0. Pro hostovanou verzi napište na contact@planka.cloud, v případě bezpečnostních problémů se obraťte na security@planka.cloud. Podrobnosti o vývoji a podpora jsou k dispozici na GitHubu."
    ],
    "commentSummary": [
      "Zaměřuje se na samostatně hostované nástroje pro sledování projektů, jako je Kanboard, a zdůrazňuje použití nástroje Docker pro jednoduchou konfiguraci a správu.",
      "Uživatelé diskutují o svých zkušenostech a navrhují různé nástroje pro správu úkolů, jako jsou Planka a Redmine, a porovnávají je se softwarem, jako je OpenProject.",
      "Dále jsou zde uvedeny úvahy o hostování aplikací PHP pomocí nástroje Docker, o správě více projektů s různými technologickými balíčky a doporučení nástrojů, jako jsou Nextcloud Deck a Taskwarrior."
    ],
    "points": 268,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1710756976
  },
  {
    "id": 39744932,
    "title": "Počet cyklistů v Paříži se díky investicím do infrastruktury zdvojnásobil",
    "originLink": "https://momentummag.com/paris-cycling-numbers-double/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39744932",
    "commentBody": "",
    "originSummary": [
      "V Paříži se počet cyklistů během jednoho roku zdvojnásobil díky značným investicím do cyklistické infrastruktury, která se má stát \"stoprocentně cyklistickým městem\".",
      "Nárůst počtu cyklistů je v souladu s rostoucím trendem udržitelné mobility a revitalizace měst, což odráží širší společenský posun.",
      "Významné finanční prostředky přidělené francouzskou vládou naznačují, že se tento trend pravděpodobně rozšíří na celou zemi, a slibují, že v Paříži bude vzkvétat cyklistická kultura s rozšířenými cyklistickými pruhy a veřejnými programy sdílení kol."
    ],
    "commentSummary": [
      "Investice do cyklistické infrastruktury v Paříži zdvojnásobily počet cyklistů, ale vedly k přetížení cyklistických stezek, což vyvolalo obavy o bezpečnost a napětí mezi motoristy a cyklisty.",
      "V diskusi se zdůrazňují výhody cyklistické infrastruktury, problémy, jako je pocení, a řešení, jako je fitness, oblečení a tempo jízdy.",
      "Zdůrazňují se dopady cyklistiky na zdraví, dopravu a městské plánování, přičemž elektrokola se stávají praktickým řešením pro dojíždění do práce ve městech a podporují cyklistiku jako udržitelný způsob dopravy."
    ],
    "points": 256,
    "commentCount": 199,
    "retryCount": 0,
    "time": 1710771621
  },
  {
    "id": 39742916,
    "title": "Vývoj pg-copyjit: Nový JIT kompilátor pro PostgreSQL",
    "originLink": "https://www.pinaraf.info/2024/03/look-ma-i-wrote-a-new-jit-compiler-for-postgresql/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742916",
    "commentBody": "",
    "originSummary": [
      "Autor představuje pg-copyjit, nový JIT kompilátor pro PostgreSQL, inspirovaný novou metodikou konstrukce, a upozorňuje na problémy s použitím LLVM pro JIT kompilaci v PostgreSQL.",
      "Jako alternativu navrhují algoritmus copy-and-patch kvůli problémům s odhadem nákladů a podrobně popisují proces implementace nového JIT enginu v PostgreSQL.",
      "Jsou sdíleny výkonnostní benchmarky pg-copyjit versus LLVM, přičemž i přes probíhající optimalizační snahy je cílem potenciální nasazení na produkčních serverech."
    ],
    "commentSummary": [
      "Autor představil nový JIT kompilátor pro PostgreSQL a upozornil na obtíže s ukládáním zkompilovaných dotazů do mezipaměti a na specifickou povahu JIT kódu.",
      "Bylo provedeno srovnání, jak PostgreSQL, Oracle a MSSQL spravují plány dotazů, s důrazem na možné optimalizace při kompilaci JIT.",
      "Diskuse zahrnovala poznatky o kopírování a opravách v překladačích a o ukládání dotazů do mezipaměti v různých databázových systémech."
    ],
    "points": 252,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1710763044
  },
  {
    "id": 39743594,
    "title": "Pilulka Lotilaner slibně pomáhá v boji proti nemocem přenášeným klíšťaty",
    "originLink": "https://arstechnica.com/science/2024/03/tick-killing-pill-shows-promising-results-in-human-trial/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39743594",
    "commentBody": "",
    "originSummary": [
      "Společnost Tarsus Pharmaceuticals pracuje na pilulce, která zabíjí klíšťata u lidí a v prvních testech vykazovala pozitivní výsledky a schopnost chránit před boreliózou po dobu přibližně jednoho měsíce.",
      "Pilulka obsahuje lotilaner, který se zaměřuje na klíšťata namísto bakterií způsobujících boreliózu, což naznačuje možnou ochranu proti dalším nemocem přenášeným klíšťaty.",
      "Ačkoli je třeba provést další studie, aby se ověřila účinnost této pilulky v prevenci boreliózy, vykazuje tato pilulka rychlé schopnosti zabíjet klíšťata a mohla by mít zásadní význam při řešení narůstajícího problému nemocí přenášených klíšťaty ve Spojených státech."
    ],
    "commentSummary": [
      "Diskutuje se o metodách prevence a identifikace klíšťat, jako je oblečení ošetřené permethrinem a obojky Seresto pro domácí zvířata.",
      "Řeší se obavy týkající se toxicity chemických látek, jako je permethrin, pro kočky.",
      "Diskutuje se o rizicích onemocnění přenášených klíšťaty, jako je borelióza, o strategiích prevence, jako jsou trubičky proti klíšťatům a nové léky, o nové vakcíně proti borelióze a o úpravě genů pro vymýcení klíšťat."
    ],
    "points": 245,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1710765949
  },
  {
    "id": 39742188,
    "title": "Vývoj umělé inteligence ve vývoji softwaru",
    "originLink": "https://www.sheshbabu.com/posts/thoughts-on-the-future-of-software-development/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39742188",
    "commentBody": "",
    "originSummary": [
      "Velké jazykové modely (LLM) významně rozvíjejí vývoj softwaru a rozšiřují roli umělé inteligence nad rámec kódovacích úloh.",
      "Interní dohled nad vývojáři umělé inteligence je zásadní pro sladění s nadřazenými cíli, protože umělá inteligence pomáhá při vytváření složitých pracovních postupů pro podnikové uživatele.",
      "Navzdory pokroku v oblasti umělé inteligence budou vývojáři softwaru i nadále hrát zásadní roli při řízení složitosti, překládání obchodních problémů a definování obchodní logiky pro vytváření softwarových produktů."
    ],
    "commentSummary": [
      "Článek se zabývá dopadem umělé inteligence (AI) na budoucnost vývoje softwaru, obavami z přesunu pracovních míst a vývojem programovacích jazyků.",
      "Pojednává o potenciálu umělé inteligence navrhovat a realizovat řešení a zdůrazňuje význam lidského zásahu a přizpůsobivosti systémů umělé inteligence.",
      "Diskutuje se o rovnováze mezi automatizací a manuálním vstupem do programování, přičemž se zdůrazňují rizika, přínosy a obavy z koncentrace moci při vývoji softwaru, jakož i budoucí úloha lidských programátorů a důsledky automatizace a umělé inteligence pro trh práce a společnost."
    ],
    "points": 226,
    "commentCount": 352,
    "retryCount": 0,
    "time": 1710757784
  },
  {
    "id": 39744989,
    "title": "Průvodce pro kutily: Bezpečná výměna torzních pružin garážových vrat",
    "originLink": "https://www.truetex.com/garage.htm",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39744989",
    "commentBody": "",
    "originSummary": [
      "Autor se podělí o svůj kutilský projekt výměny torzních pružin u garážových vrat, zdůrazní bezpečnost, správné nářadí a probere problémy v oboru.",
      "Podrobné pokyny k měření, instalaci, vyvažování a možným nebezpečím jsou uvedeny spolu s radami, jak nakupovat u spolehlivých dodavatelů a vyhnout se podvodům při opravách.",
      "Text zdůrazňuje význam správných vlastností pružiny pro bezpečnost a funkčnost a varuje před klamavými taktikami poskytovatelů služeb."
    ],
    "commentSummary": [
      "Článek upozorňuje na rizika a význam správné údržby při výměně torzních pružin garážových vrat pro zajištění bezpečnosti a bezproblémového provozu.",
      "Zdůrazňuje nebezpečí oprav prováděných svépomocí, zdůrazňuje důležitost bezpečnostních opatření a vysvětluje, jak pružiny vyvažují hmotnost garážových vrat.",
      "Účastníci diskutují o osobních zkušenostech, diskutují o bezpečnosti různých mechanismů a zdůrazňují hodnotu odborných znalostí při manipulaci s pružinami garážových vrat."
    ],
    "points": 203,
    "commentCount": 267,
    "retryCount": 0,
    "time": 1710771872
  }
]
