[
  {
    "id": 39043871,
    "title": "زوال إيلو: نهاية مخيبة للآمال لشبكة اجتماعية خالية من الإعلانات",
    "originLink": "https://waxy.org/2024/01/the-quiet-death-of-ellos-big-dreams/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39043871",
    "commentBody": "",
    "originSummary": [
      "تم إغلاق Ello ، وهي شبكة اجتماعية تهدف إلى أن تكون بديلا خاليا من الإعلانات ل Facebook ، فجأة ، مما ترك المستخدمين محبطين.",
      "على الرغم من التزامها الأولي بالخصوصية وحماية بيانات المستخدم ، واجهت Ello تحديات في الحفاظ على قيمها أثناء البحث عن تمويل للنمو وتحقيق الدخل.",
      "أدت التغييرات في الملكية والإدارة ، إلى جانب الصعوبات المالية ، في النهاية إلى الإغلاق المفاجئ للمنصة دون إعطاء المستخدمين فرصة للحفاظ على محتواهم."
    ],
    "commentSummary": [
      "تغطي المقالة وسلسلة التعليقات مواضيع مختلفة تتعلق بمنصات الشبكات الاجتماعية ، بما في ذلك نماذج التمويل وتحديات تحقيق الدخل وتأثير رأس المال الاستثماري.",
      "تتم مناقشة أمثلة على كل من المنصات الناجحة (Ello و Mastodon) والفاشلة (Bluesky) ، مما يوفر سياقا واقعيا.",
      "تتعمق المناقشات في أهمية نمو المستخدمين ، والتحكم في المؤسس ، والحفاظ على المبادئ في المشاريع التجارية ، مع استكشاف مخاطر وتحديات طرق التمويل وتحقيق الدخل المختلفة. ومن المسلم به أيضا التأثير السلبي للمستثمرين الخارجيين وصعوبات بناء شبكات اجتماعية ناجحة. بشكل عام ، سلطت المحادثات الضوء على التعقيدات والشكوك المحيطة بالاستدامة والنماذج المالية لمنصات التواصل الاجتماعي."
    ],
    "points": 413,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1705595759
  },
  {
    "id": 39048317,
    "title": "يقوم فريق Notify بترحيل قاعدة بيانات PostgreSQL بنجاح مع وقت تعطل مدته 11 ثانية فقط",
    "originLink": "https://gds.blog.gov.uk/2024/01/17/how-we-migrated-our-postgresql-database-with-11-seconds-downtime/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39048317",
    "commentBody": "",
    "originSummary": [
      "نجح فريق GOV.UK Notify في ترحيل قاعدة بيانات PostgreSQL الخاصة بهم بأقل وقت تعطل باستخدام AWS Database Migration Service (DMS).",
      "تضمنت عملية الترحيل إعداد مثيل DMS ، وإنشاء قاعدة البيانات المستهدفة ، وإجراء تحميل كامل للبيانات ، وتنفيذ النسخ المتماثل المستمر.",
      "أدى الترحيل إلى توقف 11 ثانية فقط ، متجاوزا هدفهم البالغ أقل من 5 دقائق. يخطط الفريق لترحيل تطبيقاتهم إلى AWS Elastic Container Service (ECS) في المستقبل."
    ],
    "commentSummary": [
      "تغطي المناقشة موضوعات مثل عمليات نشر AWS RDS Blue-Green وقيود الرجوع إلى إصدار أقدم من قاعدة البيانات لترحيل قاعدة البيانات.",
      "تتم أيضا مناقشة التحديات المتعلقة بأطر عمل ترحيل قاعدة البيانات والمشكلات المتعلقة بخدمة AWS Data Migration Service (DMS).",
      "كما تتطرق المناقشة إلى الخدمات السحابية الحكومية، وأمن البيانات والمخاوف السيادية، وإيجابيات وسلبيات الاستعانة بمصادر خارجية لخدمات تكنولوجيا المعلومات للشركات الأجنبية، لا سيما في القطاع العام."
    ],
    "points": 386,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1705614665
  },
  {
    "id": 39042626,
    "title": "هانز رايزر يعتذر عن التأخير ويناقش إهمال ReiserFS في نواة لينكس",
    "originLink": "https://ftp.mfek.org/Reiser/Letters/№2%20Hans→Fred/reiser_response.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39042626",
    "commentBody": "",
    "originSummary": [
      "يعتذر هانز رايزر ، مبتكر ReiserFS V3 و Reiser4 ، عن التأخير في رده على رسالة ويقترح استخدام تقنيات التعرف الضوئي على الحروف لتحسين أوقات الاستجابة.",
      "يطلب Reiser المشورة بشأن مكان إرسال الرسالة والمعلومات حول Reiser5 ، بالإضافة إلى أنظمة الملفات وطرق الضغط الأخرى.",
      "يقدم نفسه على أنه في السجن بتهمة قتل زوجته في عام 2006 ، ويعرب عن ندمه على جريمته ، ويقدم اعتذارا مفصلا وتاريخا ل ReiserFS V3 و V4 ، ويسلط الضوء على المشكلات الفنية ويذكر أن ReiserFS 4 هو خيار أكثر استدامة."
    ],
    "commentSummary": [
      "يناقش المقال سقوط هانز رايزر ، مبتكر نظام الملفات ReiserFS ، الذي أدين بالقتل العمد وإخفاء جثة زوجته.",
      "يستكشف سلوك رايزر وآراء أولئك الذين عرفوه ، ويقدم نظرة ثاقبة لشخصيته وأفعاله.",
      "تتعمق المحادثة في مواضيع أعمق مثل الخلاص الشخصي ، ومفهوم الشر ، وموثوقية ReiserFS ، مما يوفر للقراء تحليلا مثيرا للتفكير للقضية."
    ],
    "points": 364,
    "commentCount": 336,
    "retryCount": 0,
    "time": 1705590653
  },
  {
    "id": 39051246,
    "title": "وفاة رائد الإنترنت ديف ميلز",
    "originLink": "https://elists.isoc.org/pipermail/internet-history/2024-January/009265.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39051246",
    "commentBody": "",
    "originSummary": [
      "توفي ديف ميلز ، وهو شخصية بارزة في الأيام الأولى للإنترنت ، بسلام.",
      "قدم مساهمات كبيرة في جوانب مختلفة من تكنولوجيا الإنترنت ، بما في ذلك بروتوكول وقت الشبكة ، وأجهزة توجيه Fuzzball ، وفريق عمل INARG ، ومختبرات COMSAT ، وجامعة ديلاوير."
    ],
    "commentSummary": [
      "توفي ديف ميلز ، المهندس الأصلي لبروتوكول وقت الشبكة (NTP) ، تاركا وراءه تأثيرا كبيرا على تطوير الوقت المتزامن في أنظمة الكمبيوتر والإنترنت.",
      "وضع عمله الرائد في NTP الأساس لأنظمة التوقيت الحديثة.",
      "ينعي مجتمع التكنولوجيا فقدان ميلز ويعرب عن امتنانه لمساهماته التي لا تقدر بثمن في هذا المجال."
    ],
    "points": 302,
    "commentCount": 31,
    "retryCount": 0,
    "time": 1705634878
  },
  {
    "id": 39043956,
    "title": "فتح بناء المساكن: حالة المباني متعددة العائلات ذات الدرج الواحد",
    "originLink": "https://www.thesisdriven.com/p/the-case-for-single-stair-multifamily",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39043956",
    "commentBody": "",
    "originSummary": [
      "يمكن أن يؤدي إضفاء الشرعية على المباني متعددة العائلات ذات الدرج الواحد إلى زيادة بناء المساكن ومعالجة مخاوف القدرة على تحمل التكاليف في الولايات المتحدة.",
      "يتعمق المقال في تاريخ وتأثير لوائح الخروج على التصميم والقدرة على تحمل التكاليف.",
      "يدعو مركز البناء في أمريكا الشمالية إلى إصلاح قوانين البناء للسماح بالمباني ذات الدرج الواحد حتى ستة طوابق كوسيلة لتحقيق تصميمات مساكن أكثر كفاءة وبأسعار معقولة."
    ],
    "commentSummary": [
      "يناقش قسم المقالة والتعليقات تأثير لوائح الإسكان على تكاليف الإسكان والقدرة على تحمل التكاليف.",
      "تؤكد المحادثة على الحاجة إلى إعادة تقييم وتقليل اللوائح لمعالجة أزمة الإسكان.",
      "تشمل الموضوعات التي يتم تناولها فعالية قوانين تقسيم المناطق ، وكثافة المساكن والقدرة على تحمل التكاليف ، وأنظمة السلامة من الحرائق في المباني ، واستخدام الخشب في البناء ، وتحقيق التوازن بين السلامة والتطبيق العملي في اللوائح ، ودور اللوائح في معالجة التمييز.",
      "وتختتم المحادثة بمقارنة لوائح وإحصاءات السلامة من الحرائق بين مختلف البلدان."
    ],
    "points": 282,
    "commentCount": 450,
    "retryCount": 0,
    "time": 1705596077
  },
  {
    "id": 39048948,
    "title": "خفض تكاليف الذكاء الاصطناعي بنسبة 99٪: دليل النجاح",
    "originLink": "https://twitter.com/wenquai/status/1748016021808595242",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39048948",
    "commentBody": "",
    "originSummary": [
      "نجح منشئ تطبيق Wanderer في خفض تكاليف الذكاء الاصطناعي بنسبة 99٪ مع تحسين زمن الوصول والحفاظ على الجودة.",
      "شارك المنشئ دليل اللعب الخاص به مع رؤى حول كيفية تحقيقه لهذا التخفيض الملحوظ في التكلفة.",
      "يعد هذا التخفيض في التكلفة أمرا مهما لأنه يسلط الضوء على إمكانية تحسين نفقات الذكاء الاصطناعي وتحسين الأداء في وقت واحد."
    ],
    "commentSummary": [
      "تتمحور المناقشات حول استخدام نماذج OpenAI وتثير مخاوف بشأن قانونية وأخلاقيات انتهاك شروط خدمة OpenAI.",
      "يناقش المشاركون القيود والمخاطر المحتملة لاستخدام النماذج ويناقشون القيمة والعواقب المحتملة للنهج المختلفة لاستخدام الذكاء الاصطناعي.",
      "تتطرق المحادثات أيضا إلى انتهاكات حقوق الطبع والنشر ، وقابلية تنفيذ شروط الخدمة ، ومخاوف جودة البيانات والشفافية ، واستخدام البيانات الاصطناعية ، والإجراءات القانونية المحتملة ضد OpenAI ، وتسليط الضوء على التعقيدات والاعتبارات الأخلاقية التي ينطوي عليها استخدام نماذج الذكاء الاصطناعي وإنفاذ الشروط والأحكام."
    ],
    "points": 248,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1705617830
  },
  {
    "id": 39043547,
    "title": "الهروب من رأسمالية المراقبة: الاستراتيجيات والقيود والحاجة إلى نهج شامل",
    "originLink": "https://ergaster.org/posts/2024/01/18-escaping-surveillance-capitalism-at-scale/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39043547",
    "commentBody": "",
    "originSummary": [
      "يتناول المقال قضية رأسمالية المراقبة ويقترح استراتيجيات بديلة لمكافحتها.",
      "يدرس القيود المفروضة على الاشتراكات المدفوعة ويسلط الضوء على فعالية الاستضافة الذاتية لمنع رأسمالية المراقبة.",
      "قد تواجه الاستضافة الذاتية تحديات قابلية التوسع وتتطلب خبرة فنية. يناقش المقال أيضا مفهوم التشفير من طرف إلى طرف (E2EE) ولكنه يشير إلى عيوبه ويؤكد على الحاجة إلى نهج شامل."
    ],
    "commentSummary": [
      "تستكشف هذه المناقشة مواضيع مختلفة حول الخصوصية وأمن البيانات ورأسمالية المراقبة.",
      "يتم اقتراح حلول وبدائل لحماية المعلومات الشخصية ، مثل أنظمة الخادم اللامركزية والتشفير.",
      "كما تسلط المحادثة الضوء على المخاوف المتعلقة بجمع البيانات، وعدم الدقة في التنميط، وتأثير رأسمالية المراقبة على الحريات الشخصية، مع التأكيد على أهمية الخصوصية والحاجة إلى التنظيم في ممارسات البيانات."
    ],
    "points": 248,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1705594468
  },
  {
    "id": 39051655,
    "title": "ثقافة Google المتغيرة: من تقييم الموظفين إلى التحديات المالية",
    "originLink": "https://social.clawhammer.net/blog/posts/2024-01-19-CultureChange/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39051655",
    "commentBody": "",
    "originSummary": [
      "يتأمل المؤلف ، وهو موظف سابق في Google ، في ثقافة الشركة المبكرة المتمثلة في إعطاء الأولوية لرفاهية الموظفين ويناقش نهج Google الفريد لإعادة التنظيم عن طريق نقل الموظفين بدلا من تسريحهم.",
      "ومع ذلك ، يعترف المؤلف أنه مع نمو Google ومواجهة صعوبات مالية ، تغيرت هذه الثقافة ، مما أدى إلى تسريح العمال واتباع نهج أكثر تقليدية لتخصيص الموارد.",
      "يؤكد المؤلف على أهمية تقدير الموظفين وخلق ثقافة السلامة النفسية لتعزيز الإنتاجية والإبداع ويقترح أن الشركات الصغيرة قد تجد أنه من الأسهل الحفاظ على نهج عملي لإعادة تنظيم الموظفين."
    ],
    "commentSummary": [
      "تغطي هذه المناقشة جوانب مختلفة من ثقافة Google وإدارتها واستراتيجيات الابتكار ومعاملة الموظفين والنمو المالي.",
      "يحلل المعلقون تحديات الحفاظ على مبادئ Google وثقافتها أثناء نموها ، فضلا عن انخفاض أدائها وابتكارها.",
      "تتطرق المحادثة أيضا إلى سياسات المكتب ، وتأثير ثقافة الشركة على الروح المعنوية والإنتاجية ، وأهمية تقييم الموظفين. ويناقش انتهاك حقوق الطبع والنشر، وتأثير الذكاء الاصطناعي على الصحافة، وتعويض وسائل الإعلام."
    ],
    "points": 238,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1705639592
  },
  {
    "id": 39049703,
    "title": "يتيح AlphaFold اكتشاف مخدر جديد لمضادات الاكتئاب",
    "originLink": "https://www.nature.com/articles/d41586-024-00130-8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39049703",
    "commentBody": "",
    "originSummary": [
      "حددت AlphaFold ، وهي أداة للتنبؤ ببنية البروتين ، مئات الآلاف من الجزيئات المخدرة المحتملة التي يمكن استخدامها في تطوير مضادات اكتئاب جديدة.",
      "أظهرت الدراسات الحديثة أن تنبؤات AlphaFold ذات قيمة لاكتشاف الأدوية ، ولكن الاعتماد فقط على الهياكل المتوقعة له قيود ، وغالبا ما تكون هناك حاجة إلى نماذج تجريبية أكثر تفصيلا.",
      "تستخدم Isomorphic Labs ، وهي شركة منبثقة عن DeepMind ، AlphaFold في جهودها لاكتشاف الأدوية وقد حصلت على صفقات مع شركات الأدوية ، مما يشير إلى إمكانات أدوات مثل AlphaFold للمساعدة بشكل كبير في البحث عن أدوية جديدة."
    ],
    "commentSummary": [
      "AlphaFold ، وهو نظام الذكاء الاصطناعي طورته DeepMind ، لديه القدرة على إحداث ثورة في اكتشاف الأدوية من خلال تحديد الجزيئات التي ترتبط بمستقبلات 5HT2A المشاركة في المخدر.",
      "يمكن لنماذج AlphaFold التنبؤ بدقة بجزيئات ربط GPCR ، وتحسين كفاءة العثور على روابط انتقائية ل GPCRs والمساعدة في البحث عن الاضطرابات العقلية.",
      "وتغطي المناقشة أيضا أهمية استهداف GPCRs في الطب ، والمخاوف بشأن موثوقية تنبؤات AlphaFold ، والمخاطر المحتملة المرتبطة باستخدام المواد الكيميائية البحثية."
    ],
    "points": 238,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1705622012
  },
  {
    "id": 39044985,
    "title": "دواء جديد للعلاج المناعي يقدم علاجا أكثر لطفا لسرطان الأطفال",
    "originLink": "https://www.bbc.com/news/health-67793887",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39044985",
    "commentBody": "",
    "originSummary": [
      "يتم علاج الأطفال المصابين بالسرطان بعلاج دوائي أقل سمية يسمى blinatumomab ، وهو علاج مناعي يستهدف الخلايا السرطانية مع الحفاظ على الخلايا السليمة.",
      "يتضمن العلاج أنبوبا بلاستيكيا رفيعا يبقى في ذراع المريض لعدة أشهر ، لتوصيل الدواء بشكل مستمر.",
      "تمت الموافقة بالفعل على استخدام Blinatumomab في البالغين المصابين بالسرطان ، ويستكشف الباحثون الآن سلامته وفعاليته في الأطفال."
    ],
    "commentSummary": [
      "تغطي المناقشات مجموعة من الموضوعات المتعلقة بعلاج السرطان والقرارات الطبية ، بما في ذلك الأدوية الجديدة والعلاجات والفوائد والعيوب والتكاليف المرتفعة والاعتبارات الأخلاقية.",
      "هناك شكوك تجاه بعض النظريات الطبية والرغبة في علاجات أكثر فعالية وبأسعار معقولة.",
      "توفر المجموعة معلومات قيمة للمهتمين بعلاج السرطان واتخاذ قرارات طبية مستنيرة."
    ],
    "points": 233,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1705600467
  },
  {
    "id": 39045598,
    "title": "WebGPU متاح الآن لأجهزة Android على Chrome 121",
    "originLink": "https://developer.chrome.com/blog/new-in-webgpu-121",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39045598",
    "commentBody": "",
    "originSummary": [
      "يوفر الإصدار 121 من Google Chrome تحديثات مثيرة للمطورين الذين يستخدمون تقنية WebGPU.",
      "يمكن للمطورين الآن استخدام WebGPU على أجهزة Android التي تعمل بنظام Android 12 أو أعلى.",
      "تتضمن التحديثات الأخرى استخدام DXC لتجميع التظليل على Windows ، وقياس وقت تنفيذ أمر GPU ، ونقاط الإدخال الافتراضية لوحدات التظليل ، ودعم مساحة اللون \"display-p3\" ، ومعلومات حول أكوام الذاكرة.",
      "تتلقى مكتبة Dawn أيضا ميزات وتحسينات جديدة."
    ],
    "commentSummary": [
      "يتوفر WebGPU الآن على Android ، مما يسمح للمطورين بقياس وقت تنفيذ أمر GPU.",
      "تحتوي استعلامات الطابع الزمني في WebGPU على تكميم 100 ميكروثانية لأغراض أمنية.",
      "يختلف دعم WebGPU باختلاف الأنظمة الأساسية ، حيث يفتقر Linux و iOS إلى الدعم الكافي.",
      "تتضمن المناقشة مخاوف بشأن دقة بيانات الاستطلاع ، والتوافق مع المتصفحات وأنظمة التشغيل المختلفة ، والمخاطر الأمنية المحتملة ، وقيود WebGPU مقارنة بواجهات برمجة تطبيقات الرسومات الأخرى.",
      "يثني بعض المستخدمين على WebGPU لراحته وإمكاناته ، بينما يذكر آخرون القيود والاختبارات المستمرة على وحدات معالجة الرسومات المختلفة.",
      "تغطي المناقشة استخدام WebGPU للرسومات والحوسبة ، وفوائد الأداء المحتملة ، وتطوير تطبيقات الويب كبديل للرمز الأصلي.",
      "تم ذكر PixiJS كأداة لتحسين الأداء ، ويدعم Unreal Engine 5 WebGPU."
    ],
    "points": 225,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1705602597
  },
  {
    "id": 39044586,
    "title": "تراجع صناعة الأدوات الآلية الأمريكية: الأسباب والعواقب",
    "originLink": "https://www.construction-physics.com/p/what-happened-to-the-us-machine-tool",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39044586",
    "commentBody": "",
    "originSummary": [
      "شهدت صناعة الأدوات الآلية في الولايات المتحدة ، التي كانت في السابق الأكبر في العالم ، انخفاضا حادا في ثمانينيات القرن العشرين.",
      "وتشمل العوامل التي ساهمت في الانهيار المنافسة من اليابان، ونقص الاستثمار في البحث والتطوير من قبل التكتلات، والركود التكنولوجي.",
      "ونتيجة لذلك ، كان هناك انخفاض في المبيعات ، وإغلاق شركات الأدوات الآلية الأمريكية ، وارتفاع الواردات.",
      "في الوقت الحاضر ، تقف الولايات المتحدة وراء اليابان وألمانيا والصين في سوق الأدوات الآلية.",
      "ومع ذلك ، تظل الولايات المتحدة مشترا مهما للأدوات الآلية."
    ],
    "commentSummary": [
      "يرجع تراجع صناعة الأدوات الآلية في الولايات المتحدة إلى عوامل مثل التكتلات والعولمة والهيمنة الأجنبية.",
      "ويناقش تأثير ماجستير في إدارة الأعمال على الصناعات التحويلية وتفضيل المعدات في الخارج.",
      "وتجري مناقشة تأثير الدولار القوي على الواردات والتصنيع في الولايات المتحدة، فضلا عن أهمية القدرة الصناعية، والقوة البحرية، والدولار الأميركي كعملة احتياطية."
    ],
    "points": 209,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1705598743
  },
  {
    "id": 39040023,
    "title": "404Service ، منصة التبرع الصغير ، تغلق بعد 14 عاما",
    "originLink": "https://flattr.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39040023",
    "commentBody": "",
    "originSummary": [
      "تم إغلاق منصة التبرع الصغيرة 404Service بعد 14 عاما من التشغيل ، معربة عن امتنانها لمجتمعهم لدعمهم وإيمانهم بمهمتهم.",
      "وسعت المنصة خدماتها لفترة وجيزة هذا العام لكنها اتخذت قرارا بإغلاق كلا المشروعين.",
      "يتمنى الفريق لمجتمعهم إبداعا وفرحا ونجاحا لا نهاية له في المستقبل."
    ],
    "commentSummary": [
      "يتم إغلاق Flattr ، وهي منصة مدفوعات صغيرة ، مما يثير تساؤلات حول جدوى المدفوعات الصغيرة كمصدر دخل للمنشئين.",
      "تستكشف المناقشة إيجابيات وسلبيات المدفوعات الصغيرة مقارنة بنماذج الاشتراك وهيمنة الإعلان كنموذج عمل أساسي.",
      "تشمل الموضوعات الأخرى مواقع الويب سريعة الزوال ، وقيمة الدفع مقابل المحتوى ، والعلاقات شبه الاجتماعية ، وربحية منصات مثل Twitch ، وخيارات تحقيق الدخل البديلة ، وقيود التورنت والنطاق الترددي ، وحظر الإعلانات ، واستخدام العملات المشفرة الذكاء الاصطناعي في المدفوعات الصغيرة."
    ],
    "points": 208,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1705572746
  },
  {
    "id": 39047825,
    "title": "أكاديمية الرياضيات: إعادة تعلم الرياضيات كشخص بالغ أصبحت سهلة ويمكن الوصول إليها",
    "originLink": "https://gmays.com/how-im-relearning-math-as-an-adult/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39047825",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربتهم في إعادة تعلم الرياضيات كشخص بالغ والدافع وراء ذلك ، مدفوعا بعملهم مع منتجات الذكاء الاصطناعي والرغبة في فهم أفضل لنماذج اللغة الكبيرة.",
      "وجدوا أن Math Academy ، وهي شركة ناشئة أسسها صديق ، هي أداة رائعة وفعالة لتعلم الرياضيات ، مع التأكيد على ملاءمتها واتساقها وأصالتها ونهجها العملي.",
      "يدرك المؤلف أن تعلم الرياضيات يتطلب عملا شاقا ، لكنه يعتقد أن أكاديمية الرياضيات تجعلها أسهل وأكثر سهولة ، وتضع هدفا طويل الأجل لفهم LLMs والمحولات مع التعلم المتسق على مدى عدة سنوات."
    ],
    "commentSummary": [
      "تغطي المناقشة مجموعة من الموضوعات المتعلقة بتعلم الرياضيات ، بما في ذلك التجارب الشخصية والموارد الموصى بها.",
      "يشارك الأفراد قصص النجاح باستخدام منصات عبر الإنترنت مثل أكاديمية خان وأكاديمية الرياضيات ، بينما يدافع آخرون عن طرق التعليم التقليدية والكتب المدرسية.",
      "تستكشف المحادثة أيضا الاختلافات في تعليم الرياضيات بين البلدان ، وأهمية وجود أساس قوي للرياضيات ، ودور الذكاء الاصطناعي والتعلم الآلي في تعليم الرياضيات."
    ],
    "points": 205,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1705612374
  }
]
