[
  {
    "id": 41840769,
    "title": "جوجل تلتزم بشراء الطاقة المولدة من قبل شركة الطاقة النووية الناشئة كايروس باور",
    "originLink": "https://www.wsj.com/business/energy-oil/google-nuclear-power-artificial-intelligence-87966624",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41840769",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "وافقت جوجل على شراء الطاقة من شركة كايروس باور، وهي شركة ناشئة تركز على تطوير المفاعلات المعيارية الصغيرة (SMRs) بقدرة 75 ميجاوات لكل منها.",
      "تشمل الخطة تشغيل أول مفاعل نووي صغير بحلول عام 2030، مع إمكانية إضافة المزيد من المفاعلات لتصل إلى 500 ميجاوات من الطاقة الخالية من الكربون بحلول عام 2035.",
      "تُعد هذه المبادرة جزءًا من استراتيجية جوجل لتأمين الطاقة النظيفة، على الرغم من أن الجدوى الاقتصادية وقابلية التنفيذ للمفاعلات النووية الصغيرة مقارنة بمصادر الطاقة المتجددة وتخزين البطاريات لا تزال قيد المناقشة."
    ],
    "points": 555,
    "commentCount": 472,
    "retryCount": 0,
    "time": 1728932782
  },
  {
    "id": 41846780,
    "title": "هندسة متصفح الويب",
    "originLink": "https://browser.engineering/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41846780",
    "commentBody": "",
    "originSummary": [
      "كتاب \"هندسة متصفح الويب\" من تأليف بافيل بانشيخا وكريس هارلسون هو كتاب يوجه القراء لبناء متصفح ويب أساسي باستخدام بايثون، ويقدم رؤى حول كيفية عمل متصفحات الويب.",
      "يغطي الكتاب، الذي نشرته مطبعة جامعة أكسفورد، مواضيع أساسية مثل الشبكات، وجافا سكريبت، وآليات عمل المتصفحات الحديثة، مما يجعله مصدرًا قيمًا لفهم تقنيات الويب.",
      "يتضمن أقسامًا عملية حول تحميل الصفحات، وعرض المستندات، وتشغيل التطبيقات، مما يوفر تجربة تعلم شاملة لأولئك المهتمين بتطوير الويب وهندسة المتصفحات."
    ],
    "commentSummary": [
      "يعتبر كتاب \"هندسة متصفح الويب\" كتابًا يتعمق في تعقيدات تطوير المتصفحات، مع التركيز بشكل خاص على تحديات تخطيط CSS وفك تشفير الفيديو. يستخدم الكتاب لغة بايثون لتوضيح مفاهيم المتصفح، مما يجعله متاحًا للمتعلمين ويشجع على الابتكار في تكنولوجيا المتصفحات. كما يؤكد على فهم الأجزاء الداخلية للمتصفح ويستكشف الإمكانيات لتقنيات واجهة المستخدم الجديدة."
    ],
    "points": 549,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1728985349
  },
  {
    "id": 41848150,
    "title": "لقد قمت ببناء مولد رموز تعبيرية \"تعامل مع الأمر\" الأكثر تعقيدًا.",
    "originLink": "https://emoji.build/deal-with-it-generator/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41848150",
    "commentBody": "",
    "originSummary": [
      "أنشأ مطور أداة متقدمة لتوليد \"إيموجي تعامل مع الأمر\" من أجل مقابلة عمل، والتي تستخدم التعلم الآلي لوضع النظارات على الوجوه وتقدم خيارات تخصيص واسعة. تعمل الأداة بالكامل على جانب العميل، مما يضمن عدم مغادرة أي بيانات لمتصفح المستخدم، وتشمل ميزات مثل إعدادات إخراج GIF. وعلى الرغم من عدم حصوله على الوظيفة، أطلق المطور الأداة مجانًا على GitHub، عارضًا مهاراته وداعيًا لفرص عمل محتملة كمطور Fullstack مع أكثر من 14 عامًا من الخبرة."
    ],
    "commentSummary": [
      "تم تطوير مشروع شخصي لإنشاء مولد رموز تعبيرية \"تعامل مع الأمر\"، باستخدام التعلم الآلي لوضع النظارات على الوجوه وتقديم خيارات تخصيص واسعة. - يعمل الأداة بالكامل على جانب العميل، ويسمح بإخراج بصيغة GIF، ويشمل مفاجآت خفية، مما يعرض إبداع ومهارات المطور التقنية. - تم إصدار المشروع مجانًا وهو متاح على GitHub، ويسعى المطور للحصول على ملاحظات وفرص جديدة كمطور Fullstack."
    ],
    "points": 425,
    "commentCount": 83,
    "retryCount": 0,
    "time": 1728997505
  },
  {
    "id": 41840931,
    "title": "كيف أختبر الويب اليوم (2021)",
    "originLink": "https://how-i-experience-web-today.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41840931",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يشعر المستخدمون بإحباط متزايد من تجربة الويب الحالية، التي تهيمن عليها عناصر مزعجة مثل مطالبات تسجيل الدخول، وطلبات الموقع، ونتائج البحث المثقلة بالإعلانات، خاصة من متصفح جوجل كروم.",
      "تكتسب بدائل مثل Kagi وBrave شعبية متزايدة لأنها تقدم تجربة تصفح أقل ازدحامًا وأكثر سهولة في الاستخدام.",
      "تثير الطبيعة المزدحمة للويب، المليئة بالنوافذ المنبثقة والإعلانات، نقاشات حول دفع المال مقابل المحتوى لتجنب الإعلانات والحنين إلى عصر ويب أبسط وأنظف."
    ],
    "points": 404,
    "commentCount": 121,
    "retryCount": 0,
    "time": 1728933773
  },
  {
    "id": 41844545,
    "title": "تم العثور على بطل العالم في لعبة الكونكر مع كستناء فولاذية، وتم تبرئته من الغش",
    "originLink": "https://www.theguardian.com/sport/2024/oct/14/cheating-alleged-after-mens-world-conker-champion-found-with-steel-chestnut",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41844545",
    "commentBody": "",
    "originSummary": [
      "بطولة العالم للكونكر تحقق في مزاعم الغش بعد أن تم العثور على الفائز في فئة الرجال، ديفيد جاكينز، ومعه كستناء فولاذية في جيبه.",
      "جاكينز، وهو منافس قديم وأعلى قاضٍ في الحدث، ينفي استخدامه للكونكر المعدني خلال المسابقة، مدعيًا أنه كان يقصد به المزاح.",
      "تأخذ البطولات الادعاءات على محمل الجد، خاصة وأن جاكينز كان مسؤولاً عن إعداد الكستناء، والتحقيق جارٍ."
    ],
    "commentSummary": [
      "تم اكتشاف بطل العالم في لعبة الكونكر مع كستناء فولاذية ولكنه بُرئ من تهم الغش.",
      "الكونكرز هي لعبة تقليدية في بريطانيا وأيرلندا حيث يحاول اللاعبون كسر كستناء بعضهم البعض المعلقة على خيط.",
      "أثار الحادث تساؤلات حول نزاهة اللعبة وتحضير الكستناء، ومع ذلك يستمر الحدث في كونه منافسة ممتعة وتقليدية."
    ],
    "points": 381,
    "commentCount": 520,
    "retryCount": 0,
    "time": 1728961920
  },
  {
    "id": 41842294,
    "title": "الأشعة السينية الروتينية للأسنان ليست مدعومة بالأدلة",
    "originLink": "https://arstechnica.com/health/2024/10/do-you-really-need-those-routine-dental-x-rays-probably-not/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41842294",
    "commentBody": "",
    "originSummary": [
      "يدعو الخبراء إلى تقليل استخدام الأشعة السينية الروتينية للأسنان، حيث إنها لا تدعمها الأدلة ويمكن أن تشكل مخاطر غير ضرورية، خاصة على الأطفال.",
      "توصي الجمعية الأمريكية لطب الأسنان (ADA) بإجراء الأشعة السينية كل سنتين إلى ثلاث سنوات للبالغين الذين لا يواجهون خطرًا متزايدًا لتسوس الأسنان، مع التأكيد على ضرورة تقليل التعرض وضمان التبرير السريري.",
      "يُعتبر الإفراط في استخدام الأشعة السينية للأسنان مصدر قلق عالمي، وغالبًا ما يكون مدفوعًا بالحوافز المالية ونقص الرقابة، مما يدعو إلى تبني ممارسات قائمة على الأدلة وإجراء المزيد من الأبحاث حول ضرورتها ومخاطرها."
    ],
    "commentSummary": [
      "لا يوجد دليل قوي على ضرورة الأشعة السينية الروتينية للأسنان، خاصة على أساس سنوي، حيث توصي كليات طب الأسنان الآن بإجراء الأشعة السينية كل 2-3 سنوات للمرضى ذوي المخاطر المنخفضة.",
      "قد توصي بعض عيادات الأسنان بإجراء الأشعة السينية بشكل متكرر بسبب الحوافز المالية أو ملكية الأسهم الخاصة، مما يبرز أهمية وعي المرضى.",
      "يُنصح المرضى باختيار أطباء الأسنان الذين يلتزمون بالإرشادات المحدثة والمبنية على الأدلة ويكونون شفافين بشأن توصياتهم العلاجية."
    ],
    "points": 303,
    "commentCount": 339,
    "retryCount": 0,
    "time": 1728941820
  },
  {
    "id": 41842975,
    "title": "Zamba2-7B",
    "originLink": "https://www.zyphra.com/post/zamba2-7b",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41842975",
    "commentBody": "",
    "originSummary": [
      "قدمت Zyphra نموذج Zamba2-7B، وهو نموذج لغوي صغير يتفوق على النماذج البارزة مثل Mistral وGemma من جوجل وLlama3 من Meta من حيث الجودة والأداء. تم تحسين Zamba2-7B للاستخدام على الأجهزة ومع وحدات معالجة الرسوميات للمستهلكين، مما يوفر توليدًا أسرع للرموز واستخدامًا أقل للذاكرة، بفضل التحسينات المعمارية مثل كتل Mamba2 وكتل الانتباه المشتركة المزدوجة. النموذج مفتوح المصدر بموجب ترخيص Apache 2.0، مما يشجع مجتمع الذكاء الاصطناعي على استكشاف ميزاته، وتم تدريبه على 128 وحدة معالجة رسومات H100 على مدى 50 يومًا، مما يظهر أداءً عاليًا بفريق صغير وميزانية معتدلة."
    ],
    "commentSummary": [
      "Zamba2-7B هو نموذج ذكاء اصطناعي تم إصداره حديثًا يتميز بأوزان مفتوحة المصدر على منصة Hugging Face، ويستخدم بنية جديدة تعتمد على الانتباه المشترك لتحسين الأداء باستخدام عدد أقل من رموز التدريب. النموذج مرخص تحت رخصة أباتشي، وهو ما يجادل بعض المستخدمين بأنه أكثر ملاءمة للبرمجيات من البيانات، مما يثير نقاشات حول كفاءته وإمكاناته مقارنة بنماذج مثل Phi-3.5 وQwen2.5. وبينما هناك حماس حول إصداره، يشكك بعض المستخدمين في التحسينات المتواضعة في الأداء رغم التقدم النظري."
    ],
    "points": 275,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1728945951
  },
  {
    "id": 41840872,
    "title": "Play 3.0 mini – نموذج تحويل النص إلى كلام متعدد اللغات خفيف الوزن وموثوق وذو تكلفة فعالة",
    "originLink": "https://play.ht/news/introducing-play-3-0-mini/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41840872",
    "commentBody": "",
    "originSummary": [
      "تم تقديم Play 3.0 mini كنموذج جديد لتحويل النص إلى كلام متعدد اللغات يدعم أكثر من 30 لغة، ويقدم موثوقية وجودة صوت محسنة.",
      "تم تصميمه ليكون النموذج الأسرع والأكثر تفاعلاً، حيث يدعم البث النصي والصوتي عبر واجهة برمجة التطبيقات (API) أو مجموعات تطوير البرمجيات (SDKs).",
      "النموذج أكثر كفاءة وفعالية من حيث التكلفة، مع تخفيض الأسعار للاستخدام بكميات أكبر، مما يجعله جذابًا للشركات والمطورين."
    ],
    "commentSummary": [
      "يُعتبر Play 3.0 mini نموذج تحويل النص إلى كلام (TTS) متعدد اللغات جديدًا، يُشاد بسرعته وموثوقيته وكفاءته من حيث التكلفة، مع قدرات قوية في استنساخ الصوت.",
      "يعمل على أقل من 3 جيجابايت من ذاكرة الفيديو (VRAM) وتم تحسينه للعمل مع متصفح كروم، على الرغم من أن المستخدمين أبلغوا عن مشاكل توافق مع فايرفوكس.",
      "النموذج ليس مفتوح المصدر، مما يثير مناقشات حول استخدامه مقارنة بالبدائل مثل OpenAI، خاصةً بالنظر إلى تحسينه المستمر للتطبيقات في الوقت الفعلي."
    ],
    "points": 232,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1728933377
  },
  {
    "id": 41842060,
    "title": "تم تشغيل روبوتات تسلا أوبتيموس عن بُعد في حدث سايبركاب",
    "originLink": "https://www.bloomberg.com/news/articles/2024-10-14/tesla-s-optimus-robots-were-remotely-operated-at-cybercab-event",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41842060",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تم عرض روبوتات أوبتيموس من تسلا في حدث حديث، لكنها كانت تعمل عن بُعد بدلاً من أن تكون ذاتية القيادة بالكامل، مما أثار الشكوك حول ادعاءات تسلا.",
      "سلط الحدث الضوء على الصعوبات في تطوير الروبوتات ذاتية التحكم بالكامل وأبرز المخاوف بشأن ميل تسلا إلى المبالغة في وعودها في التسويق.",
      "أثارت الوضعية نقاشًا أوسع حول كيفية استخدام شركات التكنولوجيا للضجة لزيادة الاهتمام والتأثير على أسعار الأسهم، مما يثير مقارنات مع عروض توضيحية مكتوبة لشركات أخرى."
    ],
    "points": 213,
    "commentCount": 206,
    "retryCount": 0,
    "time": 1728940241
  },
  {
    "id": 41846636,
    "title": "Pumpkin - خادم ماينكرافت حديث مكتوب بلغة Rust",
    "originLink": "https://github.com/Snowiiii/Pumpkin",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41846636",
    "commentBody": "",
    "originSummary": [
      "Pumpkin Pumpkin هو خادم ماينكرافت تم تطويره بلغة Rust، يركز على السرعة والكفاءة والتخصيص مع الحفاظ على آليات اللعبة الأساسية.",
      "تم تصميم الخادم لأداء عالي والتوافق مع أحدث إصدار من ماينكرافت، حيث يوفر الأمان والمرونة وقابلية التوسع لتطوير الإضافات.",
      "إنه حاليًا قيد التطوير، مع ميزات مثل التكوين، حالة الخادم، إعدادات اللاعبين، وإدارة العالم، ويدعو للمساهمات والمشاركة المجتمعية من خلال Discord ورعاة GitHub."
    ],
    "commentSummary": [
      "Pumpkin هو خادم ماينكرافت تم تطويره بلغة Rust، يركز على تحسين الأداء والكفاءة مقارنة بالخوادم التقليدية.",
      "على الرغم من أنه يفتقر حاليًا إلى ميزات مثل توليد العالم والإضاءة، إلا أنه يدعم الوظائف الأساسية مثل وضع الكتل وكسرها.",
      "الخادم ليس بديلاً مباشراً للخوادم التقليدية، حيث إنه لا يدعم التكوينات أو الإضافات الحالية، لكنه يهدف إلى أن يكون متوافقاً مع العملاء التقليديين وآليات اللعبة."
    ],
    "points": 201,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1728983896
  },
  {
    "id": 41840971,
    "title": "شركات تصنيع الدراجات تجعل الدراجات أقل قابلية للإصلاح",
    "originLink": "https://www.ifixit.com/News/101675/bike-manufacturers-are-making-bikes-less-repairable",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41840971",
    "commentBody": "",
    "originSummary": [
      "يتجه مصنعو الدراجات بشكل متزايد لاستخدام أجزاء مملوكة في الدراجات الكهربائية، مما يجعلها أقل قابلية للإصلاح ويدفع المستهلكين نحو شراء نماذج جديدة بدلاً من إصلاح النماذج الحالية.",
      "تساهم هذه الظاهرة في زيادة النفايات الإلكترونية (e-waste) وتحديات استدامة الدراجات الكهربائية كخيار نقل، على غرار الممارسات التي تُرى في صناعات السيارات والإلكترونيات.",
      "تهدف التدابير التشريعية المحتملة والمبادرات مثل البطارية اللانهائية إلى تعزيز حلول أكثر قابلية للإصلاح وضمان توفر الأجزاء للإصلاح الذاتي."
    ],
    "commentSummary": [
      "يستخدم مصنعو الدراجات بشكل متزايد أجزاء وتصاميم خاصة، مما يجعل الدراجات الكهربائية أقل قابلية للإصلاح ويساهم في التقادم المخطط له.",
      "تقوم شركة Gouach بالابتكار من خلال تطوير بطاريات للدراجات الكهربائية يمكن إصلاحها وتجميعها باستخدام مفك براغي فقط، وهم يفكرون في جعل جزء من برامجهم مفتوح المصدر.",
      "تسلط المحادثة الضوء على تعقيد إصلاح الدراجات، بما في ذلك المعايير المختلفة لمحاور الدراجات، والتحديات التي تواجه صيانة الدراجات الكهربائية الحديثة."
    ],
    "points": 200,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1728934023
  },
  {
    "id": 41841366,
    "title": "تقسيم فرق الهندسة إلى دفاع وهجوم",
    "originLink": "https://www.greptile.com/blog/how-we-engineer",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41841366",
    "commentBody": "",
    "originSummary": [
      "تقوم شركة Greptile، التي شارك في تأسيسها داكش، بتطوير أدوات ذكاء اصطناعي لفهم قواعد البيانات الكبيرة، مما يساعد في مراجعات الكود المدعومة بالذكاء الاصطناعي وتشخيص الانقطاعات.",
      "يتكون الفريق من أربعة مهندسين، وعلى الرغم من القدرات الواسعة للمنتج، فإنه يعاني من بعض الأخطاء بسبب صغر حجم الفريق.",
      "لإدارة الإنتاجية، يتم تقسيم الفريق: نصف يركز على المشاريع طويلة الأجل، بينما يتولى النصف الآخر معالجة الدعم وإصلاح الأخطاء، مما يقلل من التشتيت."
    ],
    "commentSummary": [
      "تستكشف المقالة مفهوم تقسيم فرق الهندسة إلى أدوار \"الدفاع\" و\"الهجوم\"، حيث يتولى \"الدفاع\" إدارة القضايا الفورية بينما يركز \"الهجوم\" على المشاريع طويلة الأجل.",
      "هذه الاستراتيجية شائعة في الفرق الصغيرة ذات الثقة العالية، ولكن قد تواجه صعوبات مع زيادة حجم الفريق، مما قد يؤدي إلى ضعف جودة العمل والاستياء.",
      "للحفاظ على التوازن والمساءلة، توصي المقالة بتدوير الأدوار وتسلط الضوء على أهمية التواصل الاستباقي وضمان الجودة."
    ],
    "points": 176,
    "commentCount": 116,
    "retryCount": 0,
    "time": 1728936447
  },
  {
    "id": 41850017,
    "title": "الطبعة C23 من كتاب C الحديث",
    "originLink": "https://gustedt.wordpress.com/2024/10/15/the-c23-edition-of-modern-c/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41850017",
    "commentBody": "",
    "originSummary": [
      "إصدار C23 من كتاب \"Modern C\" متاح الآن للتنزيل المجاني، متماشياً مع معيار C23 الجديد بعد نشره من قبل منظمة ISO.",
      "تدعم المترجمات الرئيسية معظم الميزات الجديدة، مثل الأنواع الدقيقة للبت، وتحسين أنواع التعداد، ورؤوس مكتبة C الجديدة.",
      "يقدم C23 مفاهيم مثل nullptr (ثابت المؤشر الخالي)، استنتاج النوع، التهيئة الافتراضية، وconstexpr (التعبيرات الثابتة)، مع مواد إضافية حول التعبيرات المركبة، واللامبدا، والتدويل."
    ],
    "commentSummary": [
      "تناقش المدونة إصدار C23 من لغة C الحديثة، مع التأكيد على أهمية عدم خلط C وC++ بسبب مشاكل التوافق.",
      "يشارك المستخدمون تجاربهم في دمج لغة C في مشاريع C++، مسلطين الضوء على كل من التحديات والفوائد، مثل نصيحة مايكروسوفت السابقة باستخدام مترجم C++ لشفرة C.",
      "تتناول المحادثة ميزات البرمجة الكائنية في C++، مثل الاستحواذ على الموارد هو التهيئة (RAII) والمساحات الأسمية، والصعوبات المتعلقة باستخدام C++ في الأنظمة المدمجة."
    ],
    "points": 170,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1729008389
  },
  {
    "id": 41842775,
    "title": "فيزياء النوافذ السحرية (2021)",
    "originLink": "https://mattferraro.dev/posts/caustics-engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41842775",
    "commentBody": "",
    "originSummary": [
      "تم إنشاء مربع أكريليك شفاف لتشكيل صور باستخدام الضوء وظاهرة تُعرف بالانكسار الضوئي، والتي تتضمن توجيه الضوء من خلال التلاعب بالسطح.",
      "تشمل العملية إنشاء خريطة ارتفاع، وتشكيل خلايا الشبكة، وتطبيق قانون سنيل لانكسار الضوء، مع التصنيع الذي يتم عبر التوجيه باستخدام الحاسوب (CNC) والتلميع.",
      "يعتمد المشروع على ورقة بحثية لعام 2014 من قبل يوي وآخرين، والكود متاح بموجب ترخيص MIT، مما يشجع الآخرين على إنشاء نسخهم الخاصة."
    ],
    "commentSummary": [
      "تناقش المناقشة نمذجة العدسات باستخدام شبكة من المربعات وتبحث فيما إذا كانت شبكة بارتفاعات متغيرة قد تقدم بديلاً أبسط.",
      "إنه يميز بين الكاوستيك والهولوغرامات، مسلطًا الضوء على غياب تأثيرات الطور في الأول، والتي تكون موجودة في الهولوغرامات الحقيقية.",
      "تُذكر المرايا السحرية التاريخية من اليابان والصين، بالإضافة إلى مفاهيم ذات صلة مثل \"نافذة البكسل\"."
    ],
    "points": 167,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1728944747
  },
  {
    "id": 41841581,
    "title": "مشروع أويلر رقم 912: أين الأعداد الفردية؟",
    "originLink": "https://projecteuler.net/problem=912",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41841581",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "تُركز منصات مثل Project Euler وLeetCode وAdvent of Code على الرياضيات وهياكل البيانات والخوارزميات، مما قد لا يكون الأمثل لتعلم لغات البرمجة الجديدة. هناك اقتراح لمنصة تركز على مهام تطوير البرمجيات العملية، مثل إعداد الخوادم، والتعامل مع الملفات، واستعلامات قواعد البيانات، لتعريف المستخدمين بشكل أفضل ببرمجة الحياة اليومية. بينما تقدم بعض المنصات مثل Exercism.io وRosetta Code تحديات خاصة باللغات، لا يزال مفهوم موقع مخصص لمهام البرمجة العملية يعتبر جذابًا ومفيدًا بشكل محتمل."
    ],
    "points": 160,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1728937649
  }
]
