[
  {
    "id": 37176703,
    "title": "Kultura dotazování vs. hádání",
    "originLink": "https://jeanhsu.substack.com/p/ask-vs-guess-culture",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37176703",
    "commentBody": "",
    "originSummary": [
      "Článek se zabývá konceptem \"ask culture\" a \"guess culture\" a tím, jak ovlivňuje vztahy a interakce.",
      "V kultuře dotazování se přímo žádá o to, co chcete, zatímco v kultuře hádání se spoléhá na čtení nepřímých signálů a dotazování se pouze v případě, že jste si jisti kladnou odpovědí.",
      "Článek uvádí příklady střetů mezi těmito kulturními normami a nabízí strategie, jak se orientovat v kultuře hádání v pracovním prostředí, kde převažuje kultura dotazování."
    ],
    "commentSummary": [
      "Článek se zabývá kulturními rozdíly v komunikaci a společenské etiketě, zejména mezi kulturou \"ptát se\" a kulturou \"hádat\".",
      "Osobní zkušenosti a anekdoty ilustrují kulturní střety ve vztazích.",
      "Článek se zabývá tématy, jako je trauma z dětství, účinnost terapie, dopad drobných traumat na vztahy, odolnost a důležitost pochopení a respektování kulturních rozdílů."
    ],
    "points": 757,
    "commentCount": 413,
    "retryCount": 0,
    "time": 1692371208
  },
  {
    "id": 37175432,
    "title": "Mister Rogers měl pravdu - běžné pozdravení šesti sousedů maximalizuje pohodu.",
    "originLink": "https://news.gallup.com/poll/509543/saying-hello-linked-higher-wellbeing-limits.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37175432",
    "commentBody": "",
    "originSummary": [
      "Podle studie společnosti Gallup je pozdravení více sousedů spojeno s vyšší životní pohodou dospělých v USA.",
      "Skóre blahobytu Američanů se zvyšuje s rostoucím počtem pozdravených sousedů, a to až do maximálního počtu šesti sousedů.",
      "Zdravení sousedů je častější u starších dospělých a osob s vyššími příjmy a je spojeno se zlepšením sociální, komunitní, profesní, fyzické a finanční pohody."
    ],
    "commentSummary": [
      "Sociální interakce, včetně pozdravů a interakcí se sousedy, je zásadní pro celkovou pohodu a zapojení do komunity.",
      "Článek zkoumá různé pohledy na sociální úzkost a kulturní rozdíly v pozdravu, jakož i dopad pandemie na sociální interakce.",
      "Budování vztahů a pěstování smyslu pro komunitu má řadu výhod a je ovlivněno jak fyzickým, tak sociálním prostředím. záměrné úsilí o interakci s ostatními je nezbytné."
    ],
    "points": 377,
    "commentCount": 261,
    "retryCount": 0,
    "time": 1692365775
  },
  {
    "id": 37176717,
    "title": "FBI opět dokazuje, že jí nelze věřit, pokud jde o paragraf 702",
    "originLink": "https://www.eff.org/deeplinks/2023/07/deja-vu-fbi-proves-again-it-cant-be-trusted-section-702",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37176717",
    "commentBody": "",
    "originSummary": [
      "Bylo zjištěno, že FBI získala přístup k soukromé komunikaci senátora a senátorky USA, aniž by dodržovala příslušná pravidla a omezení.",
      "Soud pro dohled nad zahraničním zpravodajstvím (FISC) tyto informace zveřejnil v odtajněném stanovisku, v němž zdůraznil, že FBI nerespektuje soukromí a občanské svobody.",
      "Významné změny nebo zrušení oddílu 702, který povoluje shromažďování zahraniční komunikace, mají podporu obou stran. Nadace Electronic Frontier Foundation (EFF) se zasazuje o ukončení bezzásahového přístupu ke komunikaci v USA a o zvýšení transparentnosti při případném obnovení oddílu 702."
    ],
    "commentSummary": [
      "Rozhovor vyvolává obavy z neoprávněného vyhledávání ze strany FBI a z korupce ve federální vládě.",
      "Upozorňuje také na zneužívání pravomocí zpravodajskými službami a porušování práva na soukromí.",
      "Diskuse zdůrazňuje potřebu odpovědnosti orgánů činných v trestním řízení, reformy, silnějšího dohledu a záruk na ochranu občanských svobod."
    ],
    "points": 329,
    "commentCount": 124,
    "retryCount": 0,
    "time": 1692371252
  },
  {
    "id": 37176666,
    "title": "Systém Windows 11 s radostí spustí binární soubor zkompilovaný před 30 lety.",
    "originLink": "https://twitter.com/mikko/status/1692503249595584526",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37176666",
    "commentBody": "",
    "originSummary": [
      "Systém Windows 11 vykazuje působivou zpětnou kompatibilitu, protože dokáže spustit binární soubor zkompilovaný před 30 lety, konkrétně 18. srpna 1993.",
      "To podtrhuje snahu společnosti Microsoft zajistit kompatibilitu se starším softwarem.",
      "Znamená to, že uživatelé mohou bez problémů přistupovat ke starším aplikacím a spouštět je v nejnovější verzi systému Windows."
    ],
    "commentSummary": [
      "Diskuse se točí kolem konceptu zpětné kompatibility operačních systémů, zejména Windows a Linuxu.",
      "Účastníci zkoumají problémy a debaty týkající se zpětné kompatibility, například zachování kulturní hodnoty a souvisejících nákladů.",
      "Zmíněny jsou problémy s nucenými aktualizacemi softwaru, pověst společnosti Microsoft a obtíže s přenosem softwaru mezi platformami, jakož i různá míra zpětné kompatibility různých operačních systémů. Navrhuje se, aby organizace udržovala staré verze systémových knihoven, aby byla zajištěna kompatibilita."
    ],
    "points": 284,
    "commentCount": 353,
    "retryCount": 0,
    "time": 1692371075
  },
  {
    "id": 37174657,
    "title": "Textová část: Rychlý vývoj aplikací pro Python",
    "originLink": "https://github.com/Textualize/textual",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37174657",
    "commentBody": "",
    "originSummary": [
      "Textualize je framework pro rychlý vývoj aplikací v jazyce Python, který vývojářům umožňuje vytvářet pokročilá uživatelská rozhraní v terminálu a v budoucnu i ve webových prohlížečích.",
      "Nabízí různé funkce, například podporu myši, 16,7 milionu barev a plynulé animace.",
      "Textualize je kompatibilní s Linuxem, MacOS a Windows a vyžaduje Python 3.7 nebo vyšší. Lze jej snadno nainstalovat pomocí pip a poskytuje dokumentaci, příklady a komunitu Discord pro podporu."
    ],
    "commentSummary": [
      "Textual je framework v jazyce Python pro tvorbu terminálových aplikací a diskutuje se o jeho připravované verzi pro webový prohlížeč.",
      "Uživatelé hovoří o funkcích, jako je podpora \"DirectoryTree\" a sdílení předvoleb textových editorů a kódovacích postupů.",
      "Debata se soustředí na výhody a nevýhody používání frameworků při vývoji softwaru s ohledem na požadavky projektu a úroveň dovedností. Diskuse se zabývá také problémy a výhodami aktualizací softwaru a používání frameworků se zaměřením na bezpečnost, správu zdrojů a flexibilitu."
    ],
    "points": 257,
    "commentCount": 84,
    "retryCount": 0,
    "time": 1692361327
  },
  {
    "id": 37178009,
    "title": "C a C++ upřednostňují výkon před správností",
    "originLink": "https://research.swtch.com/ub",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37178009",
    "commentBody": "",
    "originSummary": [
      "Upřednostňování výkonu před správností v programovacích jazycích C a C++ může vést k poškození programů.",
      "Problémy s neinicializovanými proměnnými, nulovými ukazateli a nedefinovaným chováním jsou v jazycích C a C++ kvůli tomuto upřednostnění běžné.",
      "Programovací jazyk Go je představen jako alternativa s odlišnou filozofií, která upřednostňuje bezpečnost a zabezpečení."
    ],
    "commentSummary": [
      "Diskuse se točí kolem programovacích jazyků a jejich vhodnosti pro různé úkoly, například upřednostňování výkonnosti nebo bezpečnostních funkcí.",
      "U jazyků C a C++ se má za to, že upřednostňují výkon, ale ve srovnání s jazyky, jako je Rust, mohou postrádat bezpečnostní funkce.",
      "Probíhá debata o omezeních a výhodách jazyka Rust ve srovnání s jazykem C++ a o důležitosti řešení rozdílu mezi vysokoúrovňovými jazyky a hardwarem."
    ],
    "points": 239,
    "commentCount": 458,
    "retryCount": 0,
    "time": 1692376030
  },
  {
    "id": 37175200,
    "title": "Širokopásmové monopoly prosazují návrh zákona, který by zničil možnost postavit se jim na odpor",
    "originLink": "https://www.techdirt.com/2023/08/18/with-hr-3557-broadband-monopolies-are-pushing-a-bill-that-would-crush-your-towns-ability-to-stand-up-to-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37175200",
    "commentBody": "",
    "originSummary": [
      "Telekomunikační giganti se snaží prostřednictvím navrhovaných právních předpisů omezit pravomoci místních samospráv v oblasti telekomunikační infrastruktury, což vede k nespokojenosti spotřebitelů.",
      "Místní samosprávy projevují stále větší zájem o zřízení vlastních optických sítí, což přispívá k posílení kontroly.",
      "Rozhovor se týká také různých témat, jako je odstranění konektorů pro sluchátka z telefonů, probíhající vyšetřování týkající se Trumpa a potíže spojené s anonymitou na internetu."
    ],
    "commentSummary": [
      "Spotřebitelé ve Spojených státech se potýkají s problémy a frustrací při získávání spolehlivých a cenově dostupných internetových služeb.",
      "Objevují se obavy z monopolů v oblasti širokopásmového připojení, nedostatečné regulace a hospodářské soutěže v tomto odvětví.",
      "Mezi návrhy patří považovat internetovou infrastrukturu za veřejnou službu a vytvořit samostatné subjekty pro infrastrukturu."
    ],
    "points": 237,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1692364661
  },
  {
    "id": 37176960,
    "title": "Učení asynchronního Rustu s příliš mnoha webovými servery",
    "originLink": "https://ibraheem.ca/posts/too-many-web-servers/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37176960",
    "commentBody": "",
    "originSummary": [
      "Článek se zaměřuje na výuku asynchronního programování v jazyce Rust pomocí sestavování několika webových serverů.",
      "Zahrnuje různá témata včetně souběžného programování s vlákny, neblokujícího I/O, efektivní obsluhy událostí pomocí epoll, implementace reaktoru a plánovače, vytváření futures a používání closures, obsluhy připojení TCP a šetrného vypínání.",
      "Článek obsahuje ukázky kódu a podrobná vysvětlení, která demonstrují koncepty a techniky spojené s vytvářením efektivních a citlivých serverů pomocí asynchronního programování v jazyce Rust."
    ],
    "commentSummary": [
      "Článek se zaměřuje na obtíže při učení se asynchronnímu Rustu a správě více webových serverů.",
      "Obsahuje příklady a zdroje pro ladění a učení se asynchronnímu jazyku Rust.",
      "Komentátoři se dělí o své zkušenosti a navrhují další zdroje pro vytváření webových backendů v jazyce Rust a diskutují o výhodách a problémech asynchronního programování."
    ],
    "points": 211,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1692372538
  },
  {
    "id": 37179094,
    "title": "Policie získává údaje o DNA od lidí, kteří si myslí, že se odhlásili.",
    "originLink": "https://theintercept.com/2023/08/18/gedmatch-dna-police-forensic-genetic-genealogy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37179094",
    "commentBody": "",
    "originSummary": [
      "Forenzní genetici využívají mezeru v databázi DNA GEDmatch k přístupu k údajům o DNA osob, které odmítly jejich sdílení s orgány činnými v trestním řízení.",
      "Tato technika pomohla vyřešit odložené případy, ale vyvolává obavy ohledně ochrany soukromí a nedostatečné regulace.",
      "Ancestry a 23andMe neumožňují přístup orgánům činným v trestním řízení, ale MyHeritage a GEDmatch ano se souhlasem uživatele a GEDmatch má mezeru pro chráněné profily."
    ],
    "commentSummary": [
      "Využívání údajů DNA orgány činnými v trestním řízení vyvolává obavy z porušování soukromí a zneužívání genetických informací.",
      "Existuje mezera, která umožňuje genealogům spolupracujícím s orgány činnými v trestním řízení získat přístup k profilům osob, které odmítly sdílet svou DNA.",
      "Nedostatek veřejného pobouření a politické pozornosti věnované tomuto porušování soukromí je znepokojující a vyvolává širší otázky týkající se vládního dohledu, osobních svobod a etických otázek spojených s databázemi DNA."
    ],
    "points": 209,
    "commentCount": 156,
    "retryCount": 0,
    "time": 1692379693
  },
  {
    "id": 37174758,
    "title": "Společnost Worldcoin ignorovala původní příkaz k zastavení skenování duhovky v Keni, ukazují záznamy",
    "originLink": "https://techcrunch.com/2023/08/15/worldcoin-in-kenya/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37174758",
    "commentBody": "",
    "originSummary": [
      "Kryptografický startup Worldcoin se vzepřel příkazu Úřadu komisaře pro ochranu osobních údajů (ODPC) v Keni, aby zastavil shromažďování osobních údajů, včetně skenování oční duhovky.",
      "ODPC již dříve nařídil společnosti Worldcoin, aby v květnu přestala shromažďovat údaje, ale společnost v tom pokračovala, dokud jí ministerstvo vnitra a správy v srpnu nepozastavilo činnost.",
      "ODPC podnikla právní kroky k zachování údajů shromážděných společností Worldcoin, zatímco probíhá vyšetřování otázek bezpečnosti, ochrany soukromí a zákonnosti."
    ],
    "commentSummary": [
      "Diskutuje se o kontroverzi kolem společnosti Worldcoin a jejího používání skenování oční duhovky v Keni, což vyvolává obavy o soukromí a bezpečnost údajů.",
      "Zkoumají se služby sdílení jízd, jako je Uber a Airbnb, a diskutuje se o dopadu těchto platforem na tradiční odvětví a o obavách týkajících se pracovních práv a bezpečnostních předpisů.",
      "Zkoumá se úloha regulace v technologickém průmyslu a uvažuje se o potřebě dohledu, který by chránil spotřebitele a zabránil negativním důsledkům, jako jsou monopoly a neetické praktiky."
    ],
    "points": 200,
    "commentCount": 176,
    "retryCount": 0,
    "time": 1692361902
  }
]
