[
  {
    "id": 37137110,
    "title": "Reduzimos em 100 vezes o custo de criação do Mastodon na escala do Twitter",
    "originLink": "https://blog.redplanetlabs.com/2023/08/15/how-we-reduced-the-cost-of-building-twitter-at-twitter-scale-by-100x/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37137110",
    "commentBody": "",
    "originSummary": [
      "A Red Planet Labs conseguiu uma redução de 100 vezes no custo de criação de uma instância do Mastodon em escala do Twitter usando a plataforma Rama.",
      "A instância foi criada com apenas 10.000 linhas de código, em comparação com as 1 milhão de linhas do Twitter.",
      "O Rama oferece escalabilidade, desempenho e tolerância a falhas, simplificando o desenvolvimento de back-end. A equipe planeja liberar o Rama para download público e abrir o código-fonte da implementação do Mastodon. O PState no Mastodon é usado para rastrear dados e aumentar a eficiência. As técnicas de otimização são discutidas, e o lançamento da documentação e da API do Rama é mencionado."
    ],
    "commentSummary": [
      "O artigo se concentra no Rama, uma nova estrutura de back-end que visa simplificar e reduzir o custo da criação de aplicativos dimensionáveis.",
      "Os comentaristas discutem as comparações feitas com o Twitter e questionam a escalabilidade da Rama.",
      "As discussões também se aprofundam nos desafios das plataformas descentralizadas, nos prós e contras do uso de Sistemas de Componentes de Entidade no desenvolvimento de jogos e na importância da segurança e da moderação."
    ],
    "points": 864,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692122053
  },
  {
    "id": 37134092,
    "title": "Firefox finalmente supera o desempenho do Google Chrome no SunSpider",
    "originLink": "https://www.phoronix.com/news/Firefox-Faster-SunSpider",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37134092",
    "commentBody": "",
    "originSummary": [
      "O Firefox ultrapassou o Google Chrome no benchmark SunSpider JavaScript, marcando uma conquista significativa para os desenvolvedores da Mozilla.",
      "Apesar desse sucesso, o Chrome continua a superar o Firefox no benchmark JetStream 2.0, mais exigente.",
      "O Firefox se concentrou em melhorar a velocidade de upload e introduzir outros aprimoramentos para melhorar seu desempenho geral."
    ],
    "commentSummary": [
      "Os tópicos de discussão se concentram em vários tópicos relacionados a navegadores da Web, como Firefox, Chrome e Safari.",
      "Os usuários participam de debates sobre benchmarks de desempenho, opções de personalização, uso de memória e interface do usuário.",
      "São levantadas preocupações sobre segurança, gerenciadores de senhas e o domínio do Chrome, além de discussões sobre o declínio do Firefox e o possível impacto do controle do Google sobre a Web."
    ],
    "points": 803,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692107924
  },
  {
    "id": 37133054,
    "title": "O Manifesto OpenTF",
    "originLink": "https://opentf.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133054",
    "commentBody": "",
    "originSummary": [
      "O Manifesto OpenTF levanta preocupações sobre uma mudança de licença no Terraform, uma plataforma de código aberto, e defende a reversão da mudança ou o estabelecimento de uma fundação para manter uma versão de código aberto.",
      "Várias empresas e indivíduos participam ativamente de iniciativas da comunidade de código aberto para aprimorar projetos e promover a colaboração.",
      "Em 15 de agosto de 2023, um grupo de pessoas contribuiu para o desenvolvimento individual e para os esforços da comunidade de código aberto, como testes, documentação, consultoria e utilização de ferramentas de código aberto."
    ],
    "commentSummary": [
      "O Manifesto OpenTF é uma discussão de desenvolvedores que defendem uma bifurcação do Terraform em uma fundação sem fins lucrativos devido a preocupações com a falta de manutenção e suporte da Hashicorp, a atual proprietária.",
      "Alguns desenvolvedores defendem uma bifurcação para aprimorar a linguagem e priorizar as necessidades da comunidade, enquanto outros esperam uma mudança de opinião da Hashicorp.",
      "A discussão também aborda os produtos de gerenciamento de segredos, as limitações da programação declarativa, o impacto na comunidade de código aberto, o ecossistema de provedores, a geração de receita pela Hashicorp, as opções alternativas de licenciamento, a renomeação e a mudança de marca dos projetos, a falta de estrutura de teste no Terraform, os problemas de propriedade e as preocupações com a nova licença.",
      "Os usuários expressam apoio a um Terraform de código aberto e exploram soluções alternativas.",
      "Também são discutidas as preocupações com a troca de licenças, o impacto no crescimento da receita, as limitações, a compatibilidade e a influência dos fornecedores de nuvem nas ferramentas de código aberto."
    ],
    "points": 554,
    "commentCount": 317,
    "retryCount": 0,
    "time": 1692101973
  },
  {
    "id": 37140013,
    "title": "Como o LLaMa.cpp é possível?",
    "originLink": "https://finbarr.ca/how-is-llama-cpp-possible/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140013",
    "commentBody": "",
    "originSummary": [
      "O autor examina a viabilidade de executar o código de inferência LLaMa em C++ puro em diferentes hardwares, incluindo dispositivos com RAM limitada, como o Raspberry Pi.",
      "A importância da largura de banda da memória na aprendizagem profunda é discutida, juntamente com os benefícios de usar modelos de menor precisão para diminuir o uso da memória.",
      "São fornecidos cálculos e exemplos para a execução do LLaMa em vários hardwares, com ênfase na importância da largura de banda da memória durante a amostragem de transformadores. Além disso, o autor destaca a importância da destilação e do treinamento estendido para modelos menores a fim de aumentar a eficiência. No entanto, ele reconhece a possibilidade de erros em seus cálculos e incentiva o feedback."
    ],
    "commentSummary": [
      "As discussões giram em torno dos modelos de quantização, dos recursos do modelo de linguagem Llama, da inferência baseada em CPU, das limitações de largura de banda da memória, do potencial da IA para se equiparar ao desempenho humano, das limitações e do potencial dos modelos de linguagem para AGI e dos desafios na obtenção de textos feitos por humanos.",
      "Os participantes abordam plataformas, métodos e configurações de hardware específicos.",
      "Opiniões divergentes são expressas sobre a viabilidade e os avanços futuros dos modelos de IA."
    ],
    "points": 497,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1692137897
  },
  {
    "id": 37136898,
    "title": "Opendream: Uma interface de usuário baseada em camadas para difusão estável",
    "originLink": "https://github.com/varunshenoy/opendream",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37136898",
    "commentBody": "",
    "originSummary": [
      "O Opendream é uma ferramenta de interface do usuário da Web que apresenta recursos como camadas, edição não destrutiva e portabilidade para geração e manipulação de imagens por meio de modelos de difusão.",
      "Os usuários podem desenvolver imagens existentes, realizar vários experimentos na mesma imagem e salvar e compartilhar seus fluxos de trabalho.",
      "O Opendream é compatível com extensões e oferece um método fácil de usar para escrever e utilizar novos recursos de difusão."
    ],
    "commentSummary": [
      "A discussão gira em torno da aplicação da tecnologia de IA na edição de imagens, arte e animação, destacando seus possíveis benefícios e desafios nesses campos.",
      "Os tópicos abordados incluem o desenvolvimento de uma interface de usuário baseada em camadas, o possível dano de conteúdo controverso gerado por IA, preocupações sobre violação de direitos autorais e as implicações éticas e legais do treinamento e uso de IA.",
      "O debate também explora a responsabilidade dos provedores de serviços, a necessidade de regulamentação e o impacto sobre os meios de subsistência dos artistas, levantando questões importantes sobre o futuro da IA nesses setores."
    ],
    "points": 407,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1692121090
  },
  {
    "id": 37138681,
    "title": "Os ISPs reclamam que listar todas as taxas é muito difícil e pedem que a FCC elimine a nova regra",
    "originLink": "https://arstechnica.com/tech-policy/2023/08/isps-complain-that-listing-every-fee-is-too-hard-urge-fcc-to-scrap-new-rule/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138681",
    "commentBody": "",
    "originSummary": [
      "O setor de banda larga dos EUA está se opondo à exigência da FCC de divulgar todas as taxas mensais, argumentando que isso aumentaria a complexidade e o ônus para consumidores e provedores.",
      "Os grupos de lobby sugerem incluir uma declaração explicativa sobre as taxas, semelhante aos impostos impostos pelo governo, em vez de listar todas as taxas.",
      "Os defensores dos consumidores criticam essa proposta, afirmando que ela permite que os ISPs ocultem o verdadeiro custo do serviço.",
      "As regras de rotulagem de banda larga da FCC, incluindo preços e cobranças adicionais, estão sendo revisadas atualmente pelo Escritório de Gerenciamento e Orçamento dos EUA."
    ],
    "commentSummary": [
      "A discussão abrange vários tópicos relacionados aos ISPs, como transparência de taxas, regulamentação como serviços públicos, cultura da gorjeta, disponibilidade de água na torneira, transparência de preços e taxas cobradas pelos ISPs.",
      "Também inclui preocupações sobre lobby, corrupção governamental, preços enganosos, concorrência de novos entrantes e práticas de vigilância e coleta de dados de ISPs.",
      "O tema geral é o apelo por mais transparência, proteção ao consumidor e regulamentação no setor de ISPs."
    ],
    "points": 406,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1692129943
  },
  {
    "id": 37132754,
    "title": "Seletores CSS: Um guia visual",
    "originLink": "https://fffuel.co/css-selectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37132754",
    "commentBody": "",
    "originSummary": [
      "Este guia visual fornece uma explicação de vários seletores de CSS, incluindo pseudoclasses e pseudoelementos, com exemplos de seu uso.",
      "O guia aborda seletores para elementos, classes, IDs, atributos e diferentes estados de elementos de entrada.",
      "Ele também menciona pseudoclasses e pseudoelementos CSS adicionais para direcionar e estilizar elementos específicos em uma página da Web e fornece recursos como geradores de SVG, ferramentas e recursos de design. Observe que ele inclui links de afiliados para serviços relacionados."
    ],
    "commentSummary": [
      "O artigo se aprofunda nas funcionalidades dos seletores de CSS, explicando seus vários usos e fornecendo exemplos.",
      "São discutidos recursos avançados, como nth-child e seletores com valores específicos no início ou no final.",
      "O artigo também explora uma ferramenta para generalizar seletores de CSS e destaca a utilidade da sintaxe de expressão regular em CSS."
    ],
    "points": 288,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1692100064
  },
  {
    "id": 37138807,
    "title": "Como devo ler a notação do sistema de tipos?",
    "originLink": "https://langdev.stackexchange.com/questions/2692/how-should-i-read-type-system-notation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138807",
    "commentBody": "",
    "originSummary": [
      "O Stack Exchange de Design e Implementação de Linguagem de Programação é uma plataforma para designers e implementadores de linguagens de programação trocarem perguntas e respostas.",
      "Uma pergunta recente no site buscou orientação sobre a leitura da notação do sistema de tipos.",
      "O site fornece uma explicação dos conceitos básicos, incluindo sintaxe, gramáticas, relações, julgamentos, axiomas e regras de inferência. Ele também discute a função do contexto ou do ambiente de tipos na determinação de tipos de variáveis e outras considerações na especificação de sistemas de tipos."
    ],
    "commentSummary": [
      "Compreender e usar a notação do sistema de tipos é fundamental na ciência da computação e nas linguagens de programação.",
      "O artigo explora o desenvolvimento histórico da notação do sistema de tipos e seu uso na lógica.",
      "São discutidos diferentes pontos de vista e experiências com relação ao posicionamento e à convenção de anotações de tipos em linguagens de programação."
    ],
    "points": 276,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692130527
  },
  {
    "id": 37133504,
    "title": "Por que hospedar seu próprio LLM?",
    "originLink": "http://marble.onl/posts/why_host_your_own_llm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133504",
    "commentBody": "",
    "originSummary": [
      "O autor apresenta um argumento a favor de modelos de linguagem auto-hospedados (LLMs) em vez de depender de modelos disponíveis publicamente, como o GPT-4 da OpenAI.",
      "A auto-hospedagem oferece maior controle sobre a arquitetura e os pesos do modelo, recursos de personalização e ajuste fino e um relacionamento de longo prazo com o modelo de IA.",
      "A auto-hospedagem permite mais experimentação, otimização e atualização com a tecnologia em evolução, enquanto as APIs podem não oferecer o mesmo nível de acesso e compreensão."
    ],
    "commentSummary": [
      "O artigo explora os motivos e os desafios dos modelos de modelo de linguagem (LLMs) auto-hospedados, em vez de depender da API da OpenAI.",
      "São discutidas opções alternativas para hospedar LLMs, como o Beam, hardware pessoal e a Tiny Box de George Hotz.",
      "A viabilidade e os benefícios dos LLMs auto-hospedados, incluindo a relação custo-benefício e as preocupações com a privacidade, são explorados."
    ],
    "points": 248,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1692104791
  },
  {
    "id": 37140159,
    "title": "CSV moderno versão 2",
    "originLink": "https://www.moderncsv.com/modern-csv-2-is-now-available/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140159",
    "commentBody": "",
    "originSummary": [
      "O desenvolvedor do Modern CSV, Evan, lançou a versão 2 do editor/visualizador de arquivos tabulares para Windows, Mac e Linux.",
      "Essa nova versão apresenta vários aprimoramentos, incluindo uma interface de usuário/UX aprimorada, melhor desempenho, recursos adicionais, documentação atualizada e suporte nativo para o Apple Silicon.",
      "Os usuários são incentivados a experimentar a nova versão e fornecer feedback ao desenvolvedor."
    ],
    "commentSummary": [
      "O Modern CSV versão 2 foi lançado para Windows, Mac e Linux, oferecendo um editor/visualizador de arquivos tabulares avançado que aprimora o manuseio de arquivos CSV.",
      "A atualização vem com uma interface de usuário/UX aprimorada, melhor desempenho, mais recursos, documentação atualizada e suporte para o Apple Silicon.",
      "Os usuários recomendaram a reformulação da marca e o fornecimento de uma finalidade mais clara para o software, ao mesmo tempo em que discutiram opções alternativas, expressaram frustrações com o Excel e levantaram preocupações sobre a comunicação e o atraso nas atualizações."
    ],
    "points": 247,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1692138909
  }
]
