[
  {
    "id": 37137110,
    "title": "हमने ट्विटर-स्केल पर मास्टोडॉन के निर्माण की लागत को 100 गुना कम कर दिया।",
    "originLink": "https://blog.redplanetlabs.com/2023/08/15/how-we-reduced-the-cost-of-building-twitter-at-twitter-scale-by-100x/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37137110",
    "commentBody": "",
    "originSummary": [
      "रेड प्लैनेट लैब्स ने रामा प्लेटफॉर्म का उपयोग करके ट्विटर-स्केल मास्टोडॉन इंस्टेंस के निर्माण के लिए लागत में 100 गुना कमी हासिल की।",
      "ट्विटर की 1 मिलियन लाइनों की तुलना में उदाहरण को कोड की केवल 10,000 लाइनों के साथ बनाया गया था।",
      "रामा बैकएंड विकास को सरल बनाते हुए, मापनीयता, प्रदर्शन और दोष सहिष्णुता प्रदान करता है। टीम ने रामा को सार्वजनिक डाउनलोड के लिए जारी करने और अपने मास्टोडॉन कार्यान्वयन को ओपन-सोर्स करने की योजना बनाई है। Mastodon में PState का उपयोग डेटा को ट्रैक करने और दक्षता में सुधार करने के लिए किया जाता है। अनुकूलन तकनीकों पर चर्चा की जाती है, और रामा प्रलेखन और एपीआई की रिहाई का उल्लेख किया जाता है।"
    ],
    "commentSummary": [
      "लेख रामा पर केंद्रित है, एक नया बैकएंड फ्रेमवर्क जिसका उद्देश्य स्केलेबल अनुप्रयोगों के निर्माण की लागत को सरल और कम करना है।",
      "टिप्पणीकार ट्विटर पर की गई तुलना पर चर्चा करते हैं और रामा की स्केलेबिलिटी पर सवाल उठाते हैं।",
      "चर्चा में विकेन्द्रीकृत प्लेटफार्मों की चुनौतियों, खेल विकास में एंटिटी कंपोनेंट सिस्टम का उपयोग करने के पेशेवरों और विपक्षों और सुरक्षा और मॉडरेशन के महत्व पर भी चर्चा की गई।"
    ],
    "points": 864,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692122053
  },
  {
    "id": 37134092,
    "title": "फ़ायरफ़ॉक्स ने आखिरकार सनस्पाइडर में Google Chrome को पछाड़ दिया",
    "originLink": "https://www.phoronix.com/news/Firefox-Faster-SunSpider",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37134092",
    "commentBody": "",
    "originSummary": [
      "फ़ायरफ़ॉक्स ने सनस्पाइडर जावास्क्रिप्ट बेंचमार्क में गूगल क्रोम को पीछे छोड़ दिया है, जो मोज़िला डेवलपर्स के लिए एक महत्वपूर्ण उपलब्धि है।",
      "इस सफलता के बावजूद, क्रोम अधिक मांग वाले जेटस्ट्रीम 2.0 बेंचमार्क में फ़ायरफ़ॉक्स से बेहतर प्रदर्शन करना जारी रखता है।",
      "फ़ायरफ़ॉक्स ने अपलोड गति में सुधार करने और अपने समग्र प्रदर्शन को बढ़ाने के लिए अन्य संवर्द्धन पेश करने पर ध्यान केंद्रित किया है।"
    ],
    "commentSummary": [
      "चर्चा थ्रेड्स फ़ायरफ़ॉक्स, क्रोम और सफारी जैसे वेब ब्राउज़र से संबंधित विभिन्न विषयों पर ध्यान केंद्रित करते हैं।",
      "उपयोगकर्ता प्रदर्शन बेंचमार्क, अनुकूलन विकल्प, मेमोरी उपयोग और उपयोगकर्ता इंटरफ़ेस के बारे में बहस में संलग्न होते हैं।",
      "सुरक्षा, पासवर्ड प्रबंधकों और क्रोम के प्रभुत्व के बारे में चिंताएं उठाई जाती हैं, और चर्चाफ़ायरफ़ॉक्स की गिरावट और वेब पर Google के नियंत्रण के संभावित प्रभाव को घेरती है।"
    ],
    "points": 803,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692107924
  },
  {
    "id": 37133054,
    "title": "ओपनटीएफ घोषणापत्र",
    "originLink": "https://opentf.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133054",
    "commentBody": "",
    "originSummary": [
      "ओपनटीएफ घोषणापत्र एक ओपन-सोर्स प्लेटफॉर्म टेराफॉर्म में लाइसेंस परिवर्तन के बारे में चिंताओं को उठाता है, और या तो परिवर्तन को वापस करने या ओपन-सोर्स संस्करण को बनाए रखने के लिए एक नींव स्थापित करने की वकालत करता है।",
      "विभिन्न कंपनियां और व्यक्ति परियोजनाओं को बढ़ाने और सहयोग को बढ़ावा देने के लिए ओपन-सोर्स सामुदायिक पहल में सक्रिय रूप से भाग लेते हैं।",
      "15 अगस्त, 2023 को, व्यक्तियों के एक समूह ने व्यक्तिगत विकास और ओपन-सोर्स सामुदायिक प्रयासों में योगदान दिया, जैसे कि परीक्षण, प्रलेखन, परामर्श और ओपन-सोर्स टूल का उपयोग करना।"
    ],
    "commentSummary": [
      "ओपनटीएफ घोषणापत्र डेवलपर्स द्वारा एक चर्चा है जो वर्तमान मालिक हाशिकॉर्प से रखरखाव और समर्थन की कमी के बारे में चिंताओं के कारण टेराफॉर्म को एक गैर-लाभकारी नींव में बदलने की वकालत करता है।",
      "कुछ डेवलपर्स भाषा में सुधार करने और समुदाय की जरूरतों को प्राथमिकता देने के लिए कांटे के लिए तर्क देते हैं, जबकि अन्य हशिकॉर्प से मन बदलने की उम्मीद करते हैं।",
      "चर्चा गुप्त प्रबंधन उत्पादों, घोषणात्मक प्रोग्रामिंग की सीमाओं, ओपन-सोर्स समुदाय पर प्रभाव, प्रदाता पारिस्थितिकी तंत्र, हशिकॉर्प द्वारा राजस्व सृजन, वैकल्पिक लाइसेंसिंग विकल्प, नाम बदलने और रीब्रांडिंग परियोजनाओं, टेराफॉर्म में परीक्षण ढांचे की कमी, स्वामित्व के मुद्दों और नए लाइसेंस के साथ चिंताओं को भी संबोधित करती है।",
      "उपयोगकर्ता एक ओपन-सोर्स टेराफॉर्म के लिए समर्थन व्यक्त करते हैं और वैकल्पिक समाधान ों का पता लगाते हैं।",
      "लाइसेंस बदलने के बारे में चिंताओं, राजस्व वृद्धि पर प्रभाव, सीमाओं, संगतता और ओपन सोर्स टूल पर क्लाउड विक्रेताओं के प्रभाव पर भी चर्चा की जाती है।"
    ],
    "points": 554,
    "commentCount": 317,
    "retryCount": 0,
    "time": 1692101973
  },
  {
    "id": 37140013,
    "title": "एलएलएएमए .cpp कैसे संभव है?",
    "originLink": "https://finbarr.ca/how-is-llama-cpp-possible/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140013",
    "commentBody": "",
    "originSummary": [
      "लेखक विभिन्न हार्डवेयर पर कच्चे सी ++ में एलएएमए अनुमान कोड चलाने की व्यवहार्यता की जांच करता है, जिसमें रास्पबेरी पाई जैसे सीमित रैम वाले डिवाइस शामिल हैं।",
      "गहरी शिक्षा में मेमोरी बैंडविड्थ के महत्व पर चर्चा की जाती है, साथ ही स्मृति उपयोग को कम करने के लिए कम परिशुद्धता मॉडल का उपयोग करने के लाभों के साथ।",
      "ट्रांसफार्मर से नमूना लेते समय मेमोरी बैंडविड्थ के महत्व पर जोर देने के साथ, विभिन्न हार्डवेयर पर एलएलएएमए चलाने के लिए गणना और उदाहरण प्रदान किए जाते हैं। इसके अतिरिक्त, लेखक ने दक्षता में सुधार के लिए छोटे मॉडलों के लिए आसवन और विस्तारित प्रशिक्षण के महत्व पर प्रकाश डाला है। हालांकि, वे अपनी गणना में त्रुटियों की संभावना को स्वीकार करते हैं और प्रतिक्रिया को प्रोत्साहित करते हैं।"
    ],
    "commentSummary": [
      "चर्चा एं क्वांटाइजिंग मॉडल, लामा भाषा मॉडल की क्षमताओं, सीपीयू-आधारित अनुमान, मेमोरी बैंडविड्थ सीमाओं, मानव प्रदर्शन से मेल खाने के लिए एआई की क्षमता, एजीआई के लिए भाषा मॉडल की सीमाओं और क्षमता और मानव निर्मित पाठ प्राप्त करने में चुनौतियों के इर्द-गिर्द घूमती हैं।",
      "प्रतिभागी विशिष्ट प्लेटफ़ॉर्म, विधियों और हार्डवेयर कॉन्फ़िगरेशन को कवर करते हैं।",
      "एआई मॉडल की व्यवहार्यता और भविष्य की प्रगति पर अलग-अलग राय व्यक्त की जाती है।"
    ],
    "points": 497,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1692137897
  },
  {
    "id": 37136898,
    "title": "ओपनड्रीम: स्थिर प्रसार के लिए एक परत-आधारित यूआई",
    "originLink": "https://github.com/varunshenoy/opendream",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37136898",
    "commentBody": "",
    "originSummary": [
      "ओपनड्रीम एक वेब यूआई टूल है जो प्रसार मॉडल के माध्यम से छवि उत्पादन और हेरफेर के लिए लेयरिंग, गैर-विनाशकारी संपादन और पोर्टेबिलिटी जैसी सुविधाओं का परिचय देता है।",
      "उपयोगकर्ता मौजूदा छवियों पर निर्माण कर सकते हैं, एक ही छवि पर कई प्रयोग कर सकते हैं, और अपने वर्कफ़्लो को सहेज और साझा कर सकते हैं।",
      "ओपनड्रीम एक्सटेंशन का समर्थन करता है और नई प्रसार सुविधाओं को लिखने और उपयोग करने के लिए एक उपयोगकर्ता के अनुकूल विधि प्रदान करता है।"
    ],
    "commentSummary": [
      "चर्चा छवि संपादन, कला और एनीमेशन में एआई प्रौद्योगिकी के अनुप्रयोग के आसपास केंद्रित है, जो इन क्षेत्रों में इसके संभावित लाभों और चुनौतियों को उजागर करती है।",
      "कवर किए गए विषयों में एक परत-आधारित यूआई का विकास, एआई-जनित विवादास्पद सामग्री का संभावित नुकसान, कॉपीराइट उल्लंघन के बारे में चिंताएं और एआई प्रशिक्षण और उपयोग के नैतिक और कानूनी निहितार्थ शामिल हैं।",
      "बहस सेवा प्रदाताओं की जिम्मेदारी, विनियमन की आवश्यकता और कलाकारों की आजीविका पर प्रभाव की भी पड़ताल करती है, जिससे इन उद्योगों में एआई के भविष्य के बारे में महत्वपूर्ण सवाल उठते हैं।"
    ],
    "points": 407,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1692121090
  },
  {
    "id": 37138681,
    "title": "आईएसपी की शिकायत है कि हर शुल्क को सूचीबद्ध करना बहुत कठिन है, एफसीसी से नए नियम को खत्म करने का आग्रह करें",
    "originLink": "https://arstechnica.com/tech-policy/2023/08/isps-complain-that-listing-every-fee-is-too-hard-urge-fcc-to-scrap-new-rule/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138681",
    "commentBody": "",
    "originSummary": [
      "अमेरिकी ब्रॉडबैंड उद्योग एफसीसी द्वारा सभी मासिक शुल्क का खुलासा करने की आवश्यकता का विरोध कर रहा है, यह तर्क देते हुए कि यह उपभोक्ताओं और प्रदाताओं दोनों के लिए जटिलता और बोझ जोड़ देगा।",
      "लॉबी समूह सभी शुल्कों को सूचीबद्ध करने के बजाय सरकार द्वारा लगाए गए करों के समान फीस के बारे में एक व्याख्यात्मक बयान शामिल करने का सुझाव देते हैं।",
      "उपभोक्ता अधिवक्ताओं ने इस प्रस्ताव की आलोचना करते हुए कहा कि यह आईएसपी को सेवा की वास्तविक लागत को छिपाने की अनुमति देता है।",
      "मूल्य निर्धारण और अतिरिक्त शुल्क सहित एफसीसी के ब्रॉडबैंड लेबलिंग नियमों की वर्तमान में यूएस ऑफिस ऑफ मैनेजमेंट एंड बजट द्वारा समीक्षा की जा रही है।"
    ],
    "commentSummary": [
      "चर्चा में आईएसपी से संबंधित कई विषयों को शामिल किया गया है, जैसे कि शुल्क पारदर्शिता, उपयोगिताओं के रूप में विनियमन, टिपिंग संस्कृति, नल के पानी की उपलब्धता, मूल्य निर्धारण पारदर्शिता, और आईएसपी द्वारा ली जाने वाली फीस।",
      "इसमें लॉबिंग, सरकारी भ्रष्टाचार, भ्रामक मूल्य निर्धारण, नए प्रवेशकों से प्रतिस्पर्धा, और आईएसपी निगरानी और डेटा संग्रह प्रथाओं के बारे में चिंताएं भी शामिल हैं।",
      "समग्र विषय आईएसपी उद्योग में अधिक पारदर्शिता, उपभोक्ता संरक्षण और विनियमन के लिए आह्वान है।"
    ],
    "points": 406,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1692129943
  },
  {
    "id": 37132754,
    "title": "सीएसएस चयनकर्ता: एक दृश्य गाइड",
    "originLink": "https://fffuel.co/css-selectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37132754",
    "commentBody": "",
    "originSummary": [
      "यह दृश्य मार्गदर्शिका विभिन्न सीएसएस चयनकर्ताओं की व्याख्या प्रदान करती है, जिसमें छद्म वर्ग और छद्म तत्व शामिल हैं, उनके उपयोग के उदाहरणों के साथ।",
      "गाइड में तत्वों, वर्गों, आईडी, विशेषताओं और इनपुट तत्वों की विभिन्न अवस्थाओं के लिए चयनकर्ताओं को शामिल किया गया है।",
      "यह एक वेबपेज के भीतर विशिष्ट तत्वों को लक्षित करने और स्टाइल करने के लिए अतिरिक्त सीएसएस छद्म वर्गों और छद्म तत्वों का भी उल्लेख करता है और एसवीजी जनरेटर, टूल और डिज़ाइन संसाधन जैसे संसाधन प्रदान करता है। कृपया ध्यान दें कि इसमें संबंधित सेवाओं के लिए सहबद्ध लिंक शामिल हैं।"
    ],
    "commentSummary": [
      "लेख सीएसएस चयनकर्ताओं की कार्यक्षमता में उतरता है, उनके विभिन्न उपयोगों की व्याख्या करता है और उदाहरण प्रदान करता है।",
      "शुरुआत या अंत में विशिष्ट मूल्यों के साथ एनटीएच-चाइल्ड और चयनकर्ताओं जैसी उन्नत विशेषताओं पर चर्चा की जाती है।",
      "लेख सीएसएस चयनकर्ताओं को सामान्य ीकृत करने के लिए एक उपकरण की भी पड़ताल करता है और सीएसएस में नियमित अभिव्यक्ति वाक्यविन्यास की उपयोगिता पर प्रकाश डालता है।"
    ],
    "points": 288,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1692100064
  },
  {
    "id": 37138807,
    "title": "मुझे टाइप सिस्टम नोटेशन कैसे पढ़ना चाहिए?",
    "originLink": "https://langdev.stackexchange.com/questions/2692/how-should-i-read-type-system-notation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138807",
    "commentBody": "",
    "originSummary": [
      "प्रोग्रामिंग भाषा डिजाइन और कार्यान्वयन स्टैक एक्सचेंज प्रोग्रामिंग भाषा डिजाइनरों और कार्यान्वयनकर्ताओं के लिए प्रश्नों और उत्तरों का आदान-प्रदान करने के लिए एक मंच है।",
      "साइट पर एक हालिया प्रश्न ने रीडिंग टाइप सिस्टम नोटेशन पर मार्गदर्शन मांगा।",
      "साइट मूल बातें की व्याख्या प्रदान करती है, जिसमें वाक्य रचना, व्याकरण, संबंध, निर्णय, स्वयंसिद्ध और अनुमान नियम शामिल हैं। यह प्रकार प्रणालियों को निर्दिष्ट करने में चर प्रकार और अन्य विचारों को निर्धारित करने में संदर्भ या प्रकार वातावरण की भूमिका पर भी चर्चा करता है।"
    ],
    "commentSummary": [
      "कंप्यूटर विज्ञान और प्रोग्रामिंग भाषाओं में टाइप सिस्टम नोटेशन को समझना और उपयोग करना महत्वपूर्ण है।",
      "लेख टाइप सिस्टम नोटेशन के ऐतिहासिक विकास और तर्क में इसके उपयोग की पड़ताल करता है।",
      "प्रोग्रामिंग भाषाओं में टाइप एनोटेशन के प्लेसमेंट और कन्वेंशन के बारे में विभिन्न दृष्टिकोणों और अनुभवों पर चर्चा की जाती है।"
    ],
    "points": 276,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692130527
  },
  {
    "id": 37133504,
    "title": "अपने खुद के एलएलएम की मेजबानी क्यों करें?",
    "originLink": "http://marble.onl/posts/why_host_your_own_llm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133504",
    "commentBody": "",
    "originSummary": [
      "लेखक ओपनएआई के जीपीटी -4 जैसे सार्वजनिक रूप से उपलब्ध मॉडल पर भरोसा करने के बजाय स्व-होस्टिंग भाषा मॉडल (एलएलएम) के पक्ष में एक तर्क प्रस्तुत करता है।",
      "स्व-होस्टिंग मॉडल आर्किटेक्चर और वजन, अनुकूलन और फाइन-ट्यूनिंग क्षमताओं और एआई मॉडल के साथ दीर्घकालिक संबंध पर अधिक नियंत्रण प्रदान करती है।",
      "स्व-होस्टिंग अधिक प्रयोग, अनुकूलन और विकसित तकनीक के साथ अद्यतित रहने की अनुमति देती है, जबकि एपीआई समान स्तर की पहुंच और समझ प्रदान नहीं कर सकते हैं।"
    ],
    "commentSummary": [
      "लेख ओपनएआई के एपीआई पर भरोसा करने के बजाय स्व-होस्टिंग भाषा मॉडल मॉडल (एलएलएम) के कारणों और चुनौतियों की पड़ताल करता है।",
      "एलएलएम की मेजबानी के लिए वैकल्पिक विकल्प, जैसे बीम, व्यक्तिगत हार्डवेयर और जॉर्ज हॉट्ज़ के टिनी बॉक्स पर चर्चा की जाती है।",
      "लागत-प्रभावशीलता और गोपनीयता चिंताओं सहित स्व-होस्टिंग एलएलएम की व्यवहार्यता और लाभों का पता लगाया जाता है।"
    ],
    "points": 248,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1692104791
  },
  {
    "id": 37140159,
    "title": "आधुनिक सीएसवी संस्करण 2",
    "originLink": "https://www.moderncsv.com/modern-csv-2-is-now-available/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140159",
    "commentBody": "",
    "originSummary": [
      "आधुनिक सीएसवी के डेवलपर, इवान ने विंडोज, मैक और लिनक्स के लिए सारणीबद्ध फ़ाइल संपादक / दर्शक का संस्करण 2 जारी किया है।",
      "यह नया संस्करण एक उन्नत यूआई / यूएक्स, बेहतर प्रदर्शन, अतिरिक्त सुविधाओं, अद्यतन प्रलेखन और ऐप्पल सिलिकॉन के लिए देशी समर्थन सहित कई सुधारों का परिचय देता है।",
      "उपयोगकर्ताओं को नए संस्करण को आज़माने और डेवलपर को प्रतिक्रिया प्रदान करने के लिए प्रोत्साहित किया जाता है।"
    ],
    "commentSummary": [
      "आधुनिक सीएसवी संस्करण 2 विंडोज, मैक और लिनक्स के लिए जारी किया गया है, जो एक शक्तिशाली सारणीबद्ध फ़ाइल संपादक / दर्शक की पेशकश करता है जो सीएसवी फ़ाइल हैंडलिंग को बढ़ाता है।",
      "अपडेट बेहतर यूआई/यूएक्स, बेहतर प्रदर्शन, अधिक सुविधाओं, अद्यतन प्रलेखन और ऐप्पल सिलिकॉन के लिए समर्थन के साथ आता है।",
      "उपयोगकर्ताओं ने वैकल्पिक विकल्पों पर चर्चा करते हुए, एक्सेल के साथ निराशा व्यक्त करते हुए, और संचार और विलंबित अपडेट के बारे में चिंताओं को उठाते हुए रीब्रांडिंग और स्पष्ट सॉफ़्टवेयर उद्देश्य प्रदान करने की सिफारिश की है।"
    ],
    "points": 247,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1692138909
  }
]
