[
  {
    "id": 37137110,
    "title": "트위터 규모의 마스토돈 구축 비용을 100배 절감했습니다.",
    "originLink": "https://blog.redplanetlabs.com/2023/08/15/how-we-reduced-the-cost-of-building-twitter-at-twitter-scale-by-100x/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37137110",
    "commentBody": "",
    "originSummary": [
      "레드 플래닛 랩은 라마 플랫폼을 사용하여 트위터 규모의 마스토돈 인스턴스를 구축하는 데 드는 비용을 100배 절감했습니다.",
      "이 인스턴스는 트위터의 100만 줄에 비해 단 10,000줄의 코드로 구축되었습니다.",
      "Rama는 확장성, 성능, 내결함성을 제공하여 백엔드 개발을 간소화합니다. 개발팀은 Rama를 공개적으로 다운로드할 수 있도록 공개하고 마스토돈 구현을 오픈소스화할 계획입니다. 마스토돈의 PState는 데이터를 추적하고 효율성을 개선하는 데 사용됩니다. 최적화 기법에 대해 논의하고 Rama 문서와 API의 릴리스에 대해 언급합니다."
    ],
    "commentSummary": [
      "이 문서에서는 확장 가능한 애플리케이션 구축 비용을 간소화하고 절감하는 것을 목표로 하는 새로운 백엔드 프레임워크인 Rama에 중점을 둡니다.",
      "댓글 작성자들은 트위터와의 비교에 대해 논의하고 라마의 확장성에 의문을 제기합니다.",
      "또한 탈중앙화 플랫폼의 과제, 게임 개발에서 엔티티 컴포넌트 시스템을 사용할 때의 장단점, 보안과 중재의 중요성에 대해서도 논의합니다."
    ],
    "points": 864,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692122053
  },
  {
    "id": 37134092,
    "title": "마침내 선스파이더에서 구글 크롬을 앞지른 파이어폭스",
    "originLink": "https://www.phoronix.com/news/Firefox-Faster-SunSpider",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37134092",
    "commentBody": "",
    "originSummary": [
      "Firefox가 SunSpider 자바스크립트 벤치마크에서 구글 크롬을 능가한 것은 Mozilla 개발자들에게 의미 있는 성과입니다.",
      "이러한 성공에도 불구하고 Chrome은 더 까다로운 JetStream 2.0 벤치마크에서 계속해서 Firefox를 능가하는 성능을 보이고 있습니다.",
      "Firefox는 업로드 속도를 개선하고 전반적인 성능을 향상시키기 위해 다른 개선 사항을 도입하는 데 중점을 두었습니다."
    ],
    "commentSummary": [
      "토론 스레드는 Firefox, Chrome, Safari 등 웹 브라우저와 관련된 다양한 주제에 중점을 둡니다.",
      "사용자들은 성능 벤치마크, 사용자 지정 옵션, 메모리 사용량, 사용자 인터페이스에 대한 토론에 참여합니다.",
      "보안, 비밀번호 관리자, 크롬의 지배력에 대한 우려가 제기되고 있으며, 파이어폭스의 쇠퇴와 웹에 대한 구글의 통제력이 미칠 잠재적 영향에 대한 논의가 이루어지고 있습니다."
    ],
    "points": 803,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692107924
  },
  {
    "id": 37133054,
    "title": "OpenTF 선언문",
    "originLink": "https://opentf.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133054",
    "commentBody": "",
    "originSummary": [
      "OpenTF 선언문은 오픈소스 플랫폼인 Terraform의 라이선스 변경에 대한 우려를 제기하고, 변경을 되돌리거나 오픈소스 버전을 유지하기 위한 기반을 마련할 것을 주장합니다.",
      "다양한 기업과 개인이 오픈소스 커뮤니티 이니셔티브에 적극적으로 참여하여 프로젝트를 개선하고 협업을 촉진합니다.",
      "2023년 8월 15일, 테스트, 문서화, 컨설팅, 오픈소스 도구 활용 등 개인 개발 및 오픈소스 커뮤니티 노력에 기여한 개인들이 모였습니다."
    ],
    "commentSummary": [
      "OpenTF 선언문은 현재 소유주인 해시코프의 유지보수 및 지원 부족에 대한 우려로 인해 테라폼을 비영리 재단으로 분리할 것을 주장하는 개발자들의 토론입니다.",
      "일부 개발자는 언어를 개선하고 커뮤니티의 요구를 우선시하기 위해 포크를 주장하고, 다른 개발자는 해시코프의 마음가짐이 바뀌기를 희망합니다.",
      "또한 비밀 관리 제품, 선언적 프로그래밍의 한계, 오픈소스 커뮤니티에 미치는 영향, 공급자 생태계, 해시코프의 수익 창출, 대체 라이선스 옵션, 프로젝트 이름 변경 및 리브랜딩, 테라폼의 테스트 프레임워크 부족, 소유권 문제, 새로운 라이선스에 대한 우려에 대해 논의합니다.",
      "사용자들은 오픈소스 테라폼에 대한 지지를 표명하고 대체 솔루션을 탐색합니다.",
      "라이선스 전환에 대한 우려, 매출 성장에 미치는 영향, 제한 사항, 호환성, 클라우드 공급업체가 오픈 소스 도구에 미치는 영향에 대해서도 논의합니다."
    ],
    "points": 554,
    "commentCount": 317,
    "retryCount": 0,
    "time": 1692101973
  },
  {
    "id": 37140013,
    "title": "LLaMa.cpp는 어떻게 가능한가요?",
    "originLink": "https://finbarr.ca/how-is-llama-cpp-possible/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140013",
    "commentBody": "",
    "originSummary": [
      "저자는 라즈베리 파이와 같이 RAM이 제한된 장치를 포함하여 다양한 하드웨어에서 원시 C++로 LLaMa 추론 코드를 실행할 수 있는 가능성을 검토합니다.",
      "딥러닝에서 메모리 대역폭의 중요성과 함께 저정밀 모델을 사용하여 메모리 사용량을 줄일 수 있는 이점에 대해 설명합니다.",
      "트랜스포머에서 샘플링할 때 메모리 대역폭의 중요성에 중점을 두고 다양한 하드웨어에서 LLaMa를 실행하기 위한 계산과 예제를 제공합니다. 또한 저자는 효율성을 개선하기 위해 소규모 모델에 대한 증류 및 확장 훈련의 중요성을 강조합니다. 그러나 계산에 오류가 있을 수 있음을 인정하고 피드백을 권장합니다."
    ],
    "commentSummary": [
      "토론에서는 모델 정량화, 라마 언어 모델의 기능, CPU 기반 추론, 메모리 대역폭의 한계, 인간의 성능과 일치하는 AI의 잠재력, AGI용 언어 모델의 한계와 가능성, 인간이 만든 텍스트를 얻는 데 따르는 어려움 등을 중심으로 논의가 진행되었습니다.",
      "참가자는 특정 플랫폼, 방법 및 하드웨어 구성을 다룹니다.",
      "AI 모델의 실현 가능성과 향후 발전 방향에 대해 다양한 의견이 제시되고 있습니다."
    ],
    "points": 497,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1692137897
  },
  {
    "id": 37136898,
    "title": "오픈드림: 안정적인 확산을 위한 레이어 기반 UI",
    "originLink": "https://github.com/varunshenoy/opendream",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37136898",
    "commentBody": "",
    "originSummary": [
      "오픈드림은 확산 모델을 통해 이미지 생성 및 조작에 레이어링, 비파괴 편집, 이동성과 같은 기능을 도입한 웹 UI 툴입니다.",
      "사용자는 기존 이미지를 기반으로 구축하고, 동일한 이미지에 대해 여러 실험을 수행하며, 워크플로우를 저장하고 공유할 수 있습니다.",
      "오픈드림은 확장을 지원하며 새로운 확산 기능을 작성하고 활용할 수 있는 사용자 친화적인 방법을 제공합니다."
    ],
    "commentSummary": [
      "이 토론에서는 이미지 편집, 아트, 애니메이션에 AI 기술을 적용하여 해당 분야의 잠재적 이점과 과제를 집중 조명합니다.",
      "레이어 기반 UI 개발, AI가 생성한 논란의 여지가 있는 콘텐츠의 잠재적 피해, 저작권 침해에 대한 우려, AI 학습 및 사용의 윤리적, 법적 영향 등을 주제로 다룹니다.",
      "이 토론에서는 서비스 제공업체의 책임, 규제의 필요성, 아티스트의 생계에 미치는 영향에 대해서도 살펴보고, 이러한 산업에서 AI의 미래에 대한 중요한 질문을 제기합니다."
    ],
    "points": 407,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1692121090
  },
  {
    "id": 37138681,
    "title": "ISP는 모든 요금을 나열하는 것이 너무 어렵다고 불평하며 FCC에 새로운 규칙 폐기를 촉구합니다.",
    "originLink": "https://arstechnica.com/tech-policy/2023/08/isps-complain-that-listing-every-fee-is-too-hard-urge-fcc-to-scrap-new-rule/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138681",
    "commentBody": "",
    "originSummary": [
      "미국 브로드밴드 업계는 FCC의 모든 월별 요금 공개 요구에 반대하고 있으며, 이는 소비자와 제공업체 모두에게 복잡성과 부담을 가중시킬 것이라고 주장합니다.",
      "로비 단체는 모든 수수료를 나열하는 대신 정부에서 부과하는 세금과 유사한 수수료에 대한 설명 문구를 포함할 것을 제안합니다.",
      "소비자 옹호자들은 이 제안에 대해 ISP가 실제 서비스 비용을 숨길 수 있다며 비판하고 있습니다.",
      "가격 및 추가 요금을 포함한 FCC의 광대역 라벨링 규정은 현재 미국 관리예산처에서 검토 중입니다."
    ],
    "commentSummary": [
      "이 토론에서는 요금 투명성, 유틸리티로서의 규제, 팁 문화, 수돗물 가용성, 가격 투명성, ISP가 부과하는 수수료 등 ISP와 관련된 여러 주제를 다룹니다.",
      "또한 로비, 정부 부패, 기만적인 가격 책정, 신규 진입자와의 경쟁, ISP 감시 및 데이터 수집 관행에 대한 우려도 포함되어 있습니다.",
      "전반적인 주제는 ISP 업계의 투명성, 소비자 보호, 규제 강화에 대한 요구입니다."
    ],
    "points": 406,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1692129943
  },
  {
    "id": 37132754,
    "title": "CSS 선택기: 시각적 가이드",
    "originLink": "https://fffuel.co/css-selectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37132754",
    "commentBody": "",
    "originSummary": [
      "이 시각적 가이드는 의사 클래스 및 의사 엘리먼트를 포함한 다양한 CSS 선택자에 대한 설명과 사용 예제를 제공합니다.",
      "이 가이드에서는 요소, 클래스, ID, 속성 및 입력 요소의 다양한 상태에 대한 선택기를 다룹니다.",
      "또한 웹페이지 내의 특정 요소를 타겟팅하고 스타일을 지정하기 위한 추가 CSS 의사 클래스 및 의사 요소에 대해 언급하고 SVG 생성기, 도구 및 디자인 리소스와 같은 리소스를 제공합니다. 관련 서비스에 대한 제휴 링크가 포함되어 있다는 점에 유의하세요."
    ],
    "commentSummary": [
      "이 문서에서는 CSS 선택기의 기능을 자세히 살펴보고 다양한 용도를 설명하고 예제를 제공합니다.",
      "n번째 자식 및 시작 또는 끝에 특정 값이 있는 선택기와 같은 고급 기능에 대해 설명합니다.",
      "또한 이 문서에서는 CSS 선택기를 일반화하는 도구를 살펴보고 CSS에서 정규식 구문의 유용성에 대해 강조합니다."
    ],
    "points": 288,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1692100064
  },
  {
    "id": 37138807,
    "title": "유형 시스템 표기법을 어떻게 읽어야 하나요?",
    "originLink": "https://langdev.stackexchange.com/questions/2692/how-should-i-read-type-system-notation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138807",
    "commentBody": "",
    "originSummary": [
      "프로그래밍 언어 설계 및 구현 스택 교환은 프로그래밍 언어 설계자와 구현자가 질문과 답변을 교환할 수 있는 플랫폼입니다.",
      "최근 사이트에 올라온 한 질문은 읽기 유형 시스템 표기법에 대한 지침을 요청했습니다.",
      "이 사이트에서는 구문, 문법, 관계, 판단, 공리, 추론 규칙 등 기본 사항에 대한 설명을 제공합니다. 또한 변수 유형을 결정할 때 컨텍스트 또는 유형 환경의 역할과 유형 시스템을 지정할 때 고려해야 할 기타 사항에 대해서도 설명합니다."
    ],
    "commentSummary": [
      "유형 시스템 표기법을 이해하고 사용하는 것은 컴퓨터 과학 및 프로그래밍 언어에서 매우 중요합니다.",
      "이 문서에서는 유형 시스템 표기법의 역사적 발전과 논리에서의 사용을 살펴봅니다.",
      "프로그래밍 언어에서 유형 주석의 배치 및 규칙에 관한 다양한 관점과 경험에 대해 논의합니다."
    ],
    "points": 276,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692130527
  },
  {
    "id": 37133504,
    "title": "왜 나만의 LLM을 호스팅해야 하나요?",
    "originLink": "http://marble.onl/posts/why_host_your_own_llm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133504",
    "commentBody": "",
    "originSummary": [
      "저자는 OpenAI의 GPT-4와 같은 공개적으로 사용 가능한 모델에 의존하는 대신 자체 호스팅 언어 모델(LLM)을 선호해야 한다는 주장을 제시합니다.",
      "셀프 호스팅은 모델 아키텍처 및 가중치, 사용자 지정 및 미세 조정 기능, AI 모델과의 장기적인 관계를 더욱 강력하게 제어할 수 있습니다.",
      "셀프 호스팅을 사용하면 더 많은 실험과 최적화가 가능하고 진화하는 기술에 대한 최신 정보를 얻을 수 있는 반면, API는 동일한 수준의 접근과 이해를 제공하지 못할 수 있습니다."
    ],
    "commentSummary": [
      "이 문서에서는 OpenAI의 API에 의존하지 않고 언어 모델 모델(LLM)을 자체 호스팅해야 하는 이유와 도전 과제에 대해 살펴봅니다.",
      "빔, 개인용 하드웨어, 조지 하츠의 타이니 박스 등 LLM을 호스팅할 수 있는 대체 옵션에 대해 설명합니다.",
      "비용 효율성 및 개인 정보 보호 문제를 포함하여 자체 호스팅 LLM의 타당성과 이점을 살펴봅니다."
    ],
    "points": 248,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1692104791
  },
  {
    "id": 37140159,
    "title": "최신 CSV 버전 2",
    "originLink": "https://www.moderncsv.com/modern-csv-2-is-now-available/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140159",
    "commentBody": "",
    "originSummary": [
      "Modern CSV의 개발자인 Evan이 Windows, Mac, Linux용 표 형식 파일 편집기/뷰어 버전 2를 출시했습니다.",
      "이 새 버전에는 향상된 UI/UX, 향상된 성능, 추가 기능, 업데이트된 문서, Apple Silicon에 대한 기본 지원 등 여러 가지 개선 사항이 포함되어 있습니다.",
      "사용자는 새 버전을 사용해보고 개발자에게 피드백을 제공하시기 바랍니다."
    ],
    "commentSummary": [
      "Windows, Mac, Linux용 최신 CSV 버전 2가 출시되어 강력한 표 형식의 파일 편집기/뷰어를 통해 CSV 파일 처리를 개선했습니다.",
      "이 업데이트에는 개선된 UI/UX, 더 나은 성능, 더 많은 기능, 업데이트된 문서, Apple Silicon 지원이 포함되어 있습니다.",
      "사용자들은 대체 옵션에 대해 논의하고, Excel에 대한 불만을 표출하고, 커뮤니케이션 및 업데이트 지연에 대한 우려를 제기하면서 브랜드 변경과 더 명확한 소프트웨어 용도를 제공할 것을 제안했습니다."
    ],
    "points": 247,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1692138909
  }
]
