[
  {
    "id": 37137110,
    "title": "ட்விட்டர் அளவில் மாஸ்டோடானை உருவாக்கும் செலவை 100 மடங்கு குறைத்துள்ளோம்",
    "originLink": "https://blog.redplanetlabs.com/2023/08/15/how-we-reduced-the-cost-of-building-twitter-at-twitter-scale-by-100x/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37137110",
    "commentBody": "",
    "originSummary": [
      "ரெட் பிளானட் லேப்ஸ் ராமா தளத்தைப் பயன்படுத்தி ட்விட்டர் அளவிலான மாஸ்டோடன் நிகழ்வை உருவாக்குவதற்கான செலவில் 100 மடங்கு குறைப்பை அடைந்தது.",
      "ட்விட்டரின் 1 மில்லியன் வரிகளுடன் ஒப்பிடும்போது, இந்த நிகழ்வு 10,000 கோடுகளுடன் மட்டுமே கட்டப்பட்டது.",
      "ராமன் அளவிடுதல், செயல்திறன் மற்றும் பிழை சகிப்புத்தன்மை ஆகியவற்றை வழங்குகிறார், பின்னணி வளர்ச்சியை எளிதாக்குகிறார். ராமாவை பொதுமக்கள் பதிவிறக்கம் செய்து, அவர்களின் மஸ்டோடன் செயலாக்கத்தைத் திறக்க குழு திட்டமிட்டுள்ளது. மாஸ்டோடனில் உள்ள பி ஸ்டேட் தரவைக் கண்காணிக்கவும் செயல்திறனை மேம்படுத்தவும் பயன்படுத்தப்படுகிறது. உகந்ததாக்குதல் நுட்பங்கள் விவாதிக்கப்படுகின்றன, மேலும் ராமா ஆவணம் மற்றும் ஏபிஐ வெளியீடு குறிப்பிடப்பட்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ராமா மீது கவனம் செலுத்துகிறது, இது அளவிடக்கூடிய பயன்பாடுகளை உருவாக்குவதற்கான செலவை எளிதாக்குவதையும் குறைப்பதையும் நோக்கமாகக் கொண்ட ஒரு புதிய பின்னணி கட்டமைப்பை நோக்கமாகக் கொண்டுள்ளது.",
      "ட்விட்டரில் செய்யப்பட்ட ஒப்பீடுகளைப் பற்றி விவாதிப்பவர்கள், ராமரின் அளவிடுதல் குறித்து கேள்வி எழுப்புகிறார்கள்.",
      "பரவலாக்கப்பட்ட தளங்களின் சவால்கள், விளையாட்டு மேம்பாட்டில் என்டிட்டி கூறு அமைப்புகளைப் பயன்படுத்துவதன் நன்மை தீமைகள் மற்றும் பாதுகாப்பு மற்றும் மிதவாதத்தின் முக்கியத்துவம் குறித்தும் விவாதங்கள் ஆராய்கின்றன."
    ],
    "points": 864,
    "commentCount": 320,
    "retryCount": 0,
    "time": 1692122053
  },
  {
    "id": 37134092,
    "title": "பயர்பாக்ஸ் இறுதியாக சன்ஸ்பிடரில் கூகிள் குரோம் ஐ மிஞ்சியது",
    "originLink": "https://www.phoronix.com/news/Firefox-Faster-SunSpider",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37134092",
    "commentBody": "",
    "originSummary": [
      "பயர்பாக்ஸ் சன்ஸ்பிடர் ஜாவாஸ்கிரிப்ட் அளவுகோலில் கூகிள் குரோமை முந்தியுள்ளது, இது மொஸில்லா டெவலப்பர்களுக்கு குறிப்பிடத்தக்க சாதனையைக் குறிக்கிறது.",
      "இந்த வெற்றி இருந்தபோதிலும், குரோம் தொடர்ந்து ஜெட்ஸ்ட்ரீம் 2.0 அளவுகோலில் பயர்பாக்ஸை மிஞ்சுகிறது.",
      "பயர்பாக்ஸ் பதிவேற்ற வேகத்தை மேம்படுத்துவதிலும், அதன் ஒட்டுமொத்த செயல்திறனை மேம்படுத்த பிற மேம்பாடுகளை அறிமுகப்படுத்துவதிலும் கவனம் செலுத்தியுள்ளது."
    ],
    "commentSummary": [
      "விவாத நூல்கள் பயர்பாக்ஸ், குரோம் மற்றும் சஃபாரி போன்ற வலை உலாவிகள் தொடர்பான பல்வேறு தலைப்புகளில் கவனம் செலுத்துகின்றன.",
      "பயனர்கள் செயல்திறன் அளவுகோல்கள், தனிப்பயனாக்க விருப்பங்கள், நினைவக பயன்பாடு மற்றும் பயனர் இடைமுகம் பற்றிய விவாதங்களில் ஈடுபடுகிறார்கள்.",
      "பாதுகாப்பு, கடவுச்சொல் மேலாளர்கள் மற்றும் குரோம் ஆதிக்கம் குறித்து கவலைகள் எழுப்பப்படுகின்றன, மேலும் விவாதங்கள் பயர்பாக்ஸின் வீழ்ச்சி மற்றும் வலை மீதான கூகிளின் கட்டுப்பாட்டின் சாத்தியமான தாக்கத்தைச் சுற்றியுள்ளன."
    ],
    "points": 803,
    "commentCount": 366,
    "retryCount": 0,
    "time": 1692107924
  },
  {
    "id": 37133054,
    "title": "OpenTF அறிக்கை",
    "originLink": "https://opentf.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133054",
    "commentBody": "",
    "originSummary": [
      "ஓபன்டிஎஃப் அறிக்கை ஒரு திறந்த மூல தளமான டெர்ராஃபார்மில் உரிம மாற்றம் குறித்து கவலைகளை எழுப்புகிறது, மேலும் மாற்றத்தை மாற்றியமைக்க அல்லது திறந்த மூல பதிப்பை பராமரிக்க ஒரு அடித்தளத்தை நிறுவ பரிந்துரைக்கிறது.",
      "பல்வேறு நிறுவனங்களும் தனிநபர்களும் திட்டங்களை மேம்படுத்துவதற்கும் ஒத்துழைப்பை வளர்ப்பதற்கும் திறந்த மூல சமூக முன்முயற்சிகளில் தீவிரமாக பங்கேற்கின்றனர்.",
      "ஆகஸ்ட் 15, 2023 அன்று, தனிநபர்களின் குழு சோதனை, ஆவணப்படுத்தல், ஆலோசனை மற்றும் திறந்த மூல கருவிகளைப் பயன்படுத்துதல் போன்ற தனிப்பட்ட வளர்ச்சி மற்றும் திறந்த மூல சமூக முயற்சிகளுக்கு பங்களித்தது."
    ],
    "commentSummary": [
      "ஓபன்டிஎஃப் அறிக்கை என்பது தற்போதைய உரிமையாளரான ஹாஷிகார்பின் பராமரிப்பு மற்றும் ஆதரவு இல்லாதது குறித்த கவலைகள் காரணமாக டெர்ராஃபார்மை ஒரு இலாப நோக்கற்ற அறக்கட்டளையாக மாற்ற பரிந்துரைக்கும் டெவலப்பர்களின் விவாதமாகும்.",
      "சில டெவலப்பர்கள் மொழியை மேம்படுத்துவதற்கும் சமூகத் தேவைகளுக்கு முன்னுரிமை அளிப்பதற்கும் ஒரு முட்கரண்டிக்காக வாதிடுகின்றனர், மற்றவர்கள் ஹாஷிகார்ப் நிறுவனத்திடமிருந்து மனமாற்றத்தை எதிர்பார்க்கிறார்கள்.",
      "ரகசிய மேலாண்மை தயாரிப்புகள், அறிவிக்கும் நிரலாக்கத்தின் வரம்புகள், திறந்த மூல சமூகத்தில் தாக்கம், வழங்குநர் சுற்றுச்சூழல் அமைப்பு, ஹாஷிகார்ப் வருவாய் உருவாக்கம், மாற்று உரிம விருப்பங்கள், மறுபெயரிடுதல் மற்றும் மறுபெயரிடுதல் திட்டங்கள், டெர்ராஃபார்மில் சோதனை கட்டமைப்பின் பற்றாக்குறை, உரிமையாளர் சிக்கல்கள் மற்றும் புதிய உரிமத்துடன் கவலைகள் குறித்தும் இந்த விவாதம் விவாதிக்கிறது.",
      "பயனர்கள் திறந்த மூல டெர்ராஃபார்மிற்கான ஆதரவை வெளிப்படுத்துகிறார்கள் மற்றும் மாற்று தீர்வுகளை ஆராய்கிறார்கள்.",
      "உரிமங்களை மாற்றுவது குறித்த கவலைகள், வருவாய் வளர்ச்சியில் தாக்கம், வரம்புகள், பொருந்தக்கூடிய தன்மை மற்றும் திறந்த மூல கருவிகளில் கிளவுட் விற்பனையாளர்களின் செல்வாக்கு ஆகியவை விவாதிக்கப்படுகின்றன."
    ],
    "points": 554,
    "commentCount": 317,
    "retryCount": 0,
    "time": 1692101973
  },
  {
    "id": 37140013,
    "title": "எல்.எல்.ஏ.எம்.cpp எவ்வாறு சாத்தியமாகும்?",
    "originLink": "https://finbarr.ca/how-is-llama-cpp-possible/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140013",
    "commentBody": "",
    "originSummary": [
      "ராஸ்பெர்ரி பை போன்ற வரையறுக்கப்பட்ட ரேம் கொண்ட சாதனங்கள் உட்பட பல்வேறு வன்பொருள்களில் மூல சி ++ இல் எல்.எல்.ஏ.எம்.ஏ அனுமானக் குறியீட்டை இயக்குவதற்கான சாத்தியக்கூறுகளை ஆசிரியர் ஆராய்கிறார்.",
      "ஆழ்ந்த கற்றலில் நினைவக அலைவரிசையின் முக்கியத்துவம் விவாதிக்கப்படுகிறது, அத்துடன் நினைவக பயன்பாட்டைக் குறைக்க குறைந்த துல்லியமான மாதிரிகளைப் பயன்படுத்துவதன் நன்மைகளும் விவாதிக்கப்படுகின்றன.",
      "டிரான்ஸ்பார்மர்களிலிருந்து மாதிரி எடுக்கும் போது நினைவக அலைவரிசையின் முக்கியத்துவத்தை வலியுறுத்தும் வகையில், பல்வேறு வன்பொருளில் எல்.எல்.ஏ.எம்.ஏவை இயக்குவதற்கான கணக்கீடுகள் மற்றும் எடுத்துக்காட்டுகள் வழங்கப்படுகின்றன. கூடுதலாக, செயல்திறனை மேம்படுத்த சிறிய மாதிரிகளுக்கு வடிகட்டுதல் மற்றும் நீட்டிக்கப்பட்ட பயிற்சியின் முக்கியத்துவத்தை ஆசிரியர் எடுத்துக்காட்டுகிறார். இருப்பினும், அவர்கள் தங்கள் கணக்கீடுகளில் பிழைகளின் சாத்தியத்தை ஒப்புக்கொள்கிறார்கள் மற்றும் கருத்துக்களை ஊக்குவிக்கிறார்கள்."
    ],
    "commentSummary": [
      "குவாண்டிசிங் மாதிரிகள், லாமா மொழி மாதிரியின் திறன்கள், சிபியு அடிப்படையிலான அனுமானம், நினைவக அலைவரிசை வரம்புகள், மனித செயல்திறனுடன் பொருந்தக்கூடிய செயற்கை நுண்ணறிவின் திறன், ஏஜிஐக்கான மொழி மாதிரிகளின் வரம்புகள் மற்றும் திறன் மற்றும் மனிதனால் உருவாக்கப்பட்ட உரையைப் பெறுவதில் உள்ள சவால்கள் ஆகியவற்றைச் சுற்றி விவாதங்கள் சுழல்கின்றன.",
      "பங்கேற்பாளர்கள் குறிப்பிட்ட தளங்கள், முறைகள் மற்றும் வன்பொருள் உள்ளமைவுகளை உள்ளடக்குகிறார்கள்.",
      "செயற்கை நுண்ணறிவு மாதிரிகளின் சாத்தியக்கூறுகள் மற்றும் எதிர்கால முன்னேற்றங்கள் குறித்து மாறுபட்ட கருத்துக்கள் வெளிப்படுத்தப்படுகின்றன."
    ],
    "points": 497,
    "commentCount": 172,
    "retryCount": 0,
    "time": 1692137897
  },
  {
    "id": 37136898,
    "title": "திறந்த கனவு: நிலையான பரவலுக்கான அடுக்கு அடிப்படையிலான UI",
    "originLink": "https://github.com/varunshenoy/opendream",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37136898",
    "commentBody": "",
    "originSummary": [
      "ஓபன்ட்ரீம் என்பது ஒரு வலை UI கருவியாகும், இது அடுக்கு, அழிவு அல்லாத எடிட்டிங் மற்றும் பரவல் மாதிரிகள் மூலம் பட உருவாக்கம் மற்றும் கையாளுதலுக்கு பெயர்வுத்திறன் போன்ற அம்சங்களை அறிமுகப்படுத்துகிறது.",
      "பயனர்கள் ஏற்கனவே உள்ள படங்களை உருவாக்கலாம், ஒரே படத்தில் பல சோதனைகளை நடத்தலாம் மற்றும் அவர்களின் பணிப்பாய்வுகளை சேமிக்கலாம் மற்றும் பகிரலாம்.",
      "ஓபன்ட்ரீம் நீட்டிப்புகளை ஆதரிக்கிறது மற்றும் புதிய பரவல் அம்சங்களை எழுதவும் பயன்படுத்தவும் பயனர் நட்பு முறையை வழங்குகிறது."
    ],
    "commentSummary": [
      "இந்த விவாதம் பட எடிட்டிங், கலை மற்றும் அனிமேஷன் ஆகியவற்றில் செயற்கை நுண்ணறிவு தொழில்நுட்பத்தைப் பயன்படுத்துவதை மையமாகக் கொண்டுள்ளது, இந்த துறைகளில் அதன் சாத்தியமான நன்மைகள் மற்றும் சவால்களை முன்னிலைப்படுத்துகிறது.",
      "அடுக்கு அடிப்படையிலான UI இன் வளர்ச்சி, செயற்கை நுண்ணறிவு உருவாக்கிய சர்ச்சைக்குரிய உள்ளடக்கத்தின் சாத்தியமான தீங்கு, பதிப்புரிமை மீறல் பற்றிய கவலைகள் மற்றும் செயற்கை நுண்ணறிவு பயிற்சி மற்றும் பயன்பாட்டின் நெறிமுறை மற்றும் சட்ட தாக்கங்கள் ஆகியவை அடங்கும்.",
      "இந்த விவாதம் சேவை வழங்குநர்களின் பொறுப்பு, ஒழுங்குமுறையின் அவசியம் மற்றும் கலைஞர்களின் வாழ்வாதாரங்களில் ஏற்படும் தாக்கம் ஆகியவற்றை ஆராய்கிறது, இந்த தொழில்களில் செயற்கை நுண்ணறிவின் எதிர்காலம் குறித்து முக்கியமான கேள்விகளை எழுப்புகிறது."
    ],
    "points": 407,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1692121090
  },
  {
    "id": 37138681,
    "title": "ஒவ்வொரு கட்டணத்தையும் பட்டியலிடுவது மிகவும் கடினம் என்று ஐ.எஸ்.பி.க்கள் புகார், புதிய விதியை ரத்து செய்ய எஃப்.சி.சி.க்கு வலியுறுத்தல்",
    "originLink": "https://arstechnica.com/tech-policy/2023/08/isps-complain-that-listing-every-fee-is-too-hard-urge-fcc-to-scrap-new-rule/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138681",
    "commentBody": "",
    "originSummary": [
      "அமெரிக்க பிராட்பேண்ட் தொழில்துறை அனைத்து மாதாந்திர கட்டணங்களையும் வெளியிட வேண்டும் என்ற எஃப்.சி.சியின் தேவையை எதிர்க்கிறது, இது நுகர்வோர் மற்றும் வழங்குநர்கள் இருவருக்கும் சிக்கலையும் சுமையையும் சேர்க்கும் என்று வாதிடுகிறது.",
      "அனைத்து கட்டணங்களையும் பட்டியலிடுவதற்குப் பதிலாக, அரசாங்கத்தால் விதிக்கப்பட்ட வரிகளைப் போன்ற கட்டணங்கள் குறித்த விளக்க அறிக்கையைச் சேர்க்க லாபி குழுக்கள் பரிந்துரைக்கின்றன.",
      "நுகர்வோர் வழக்கறிஞர்கள் இந்த முன்மொழிவை விமர்சிக்கிறார்கள், இது சேவையின் உண்மையான செலவை மறைக்க ஐ.எஸ்.பி.க்களை அனுமதிக்கிறது என்று கூறுகின்றனர்.",
      "எஃப்.சி.சியின் பிராட்பேண்ட் லேபிளிங் விதிகள், விலை மற்றும் கூடுதல் கட்டணங்கள் உள்ளிட்டவை தற்போது அமெரிக்க மேலாண்மை மற்றும் பட்ஜெட் அலுவலகத்தால் மதிப்பாய்வு செய்யப்பட்டு வருகின்றன."
    ],
    "commentSummary": [
      "கட்டண வெளிப்படைத்தன்மை, பயன்பாடுகளாக ஒழுங்குமுறை, டிப்பிங் கலாச்சாரம், குழாய் நீர் கிடைக்கும் தன்மை, விலை வெளிப்படைத்தன்மை மற்றும் ஐஎஸ்பிகளால் வசூலிக்கப்படும் கட்டணங்கள் போன்ற ஐஎஸ்பிக்கள் தொடர்பான பல தலைப்புகளை இந்த விவாதம் உள்ளடக்கியது.",
      "லாபியிங், அரசாங்க ஊழல், ஏமாற்றும் விலை நிர்ணயம், புதிதாக நுழைபவர்களிடமிருந்து போட்டி மற்றும் ஐஎஸ்பி கண்காணிப்பு மற்றும் தரவு சேகரிப்பு நடைமுறைகள் பற்றிய கவலைகளும் இதில் அடங்கும்.",
      "ஒட்டுமொத்த கருப்பொருள் ஐஎஸ்பி துறையில் அதிக வெளிப்படைத்தன்மை, நுகர்வோர் பாதுகாப்பு மற்றும் ஒழுங்குமுறைக்கான அழைப்பு ஆகும்."
    ],
    "points": 406,
    "commentCount": 302,
    "retryCount": 0,
    "time": 1692129943
  },
  {
    "id": 37132754,
    "title": "சிஎஸ்எஸ் தேர்வாளர்கள்: ஒரு காட்சி வழிகாட்டி",
    "originLink": "https://fffuel.co/css-selectors/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37132754",
    "commentBody": "",
    "originSummary": [
      "இந்த காட்சி வழிகாட்டி போலி வகுப்புகள் மற்றும் போலி கூறுகள் உள்ளிட்ட பல்வேறு சி.எஸ்.எஸ் தேர்வாளர்களின் விளக்கத்தை அவற்றின் பயன்பாட்டின் எடுத்துக்காட்டுகளுடன் வழங்குகிறது.",
      "வழிகாட்டி கூறுகள், வகுப்புகள், ஐடிகள், பண்புக்கூறுகள் மற்றும் உள்ளீட்டு கூறுகளின் வெவ்வேறு நிலைகளுக்கான தேர்வாளர்களை உள்ளடக்கியது.",
      "இது ஒரு வலைப்பக்கத்திற்குள் குறிப்பிட்ட கூறுகளை குறிவைத்து வடிவமைப்பதற்கான கூடுதல் சி.எஸ்.எஸ் போலி வகுப்புகள் மற்றும் போலி கூறுகளையும் குறிப்பிடுகிறது மற்றும் எஸ்.வி.ஜி ஜெனரேட்டர்கள், கருவிகள் மற்றும் வடிவமைப்பு வளங்கள் போன்ற வளங்களை வழங்குகிறது. இது தொடர்புடைய சேவைகளுக்கான இணைப்பு இணைப்புகளை உள்ளடக்கியது என்பதை நினைவில் கொள்க."
    ],
    "commentSummary": [
      "கட்டுரை சி.எஸ்.எஸ் தேர்வாளர்களின் செயல்பாடுகளை ஆராய்கிறது, அவற்றின் பல்வேறு பயன்பாடுகளை விளக்குகிறது மற்றும் எடுத்துக்காட்டுகளை வழங்குகிறது.",
      "என்.டி.எச்-குழந்தை மற்றும் தொடக்கத்திலோ அல்லது முடிவிலோ குறிப்பிட்ட மதிப்புகளைக் கொண்ட தேர்வாளர்கள் போன்ற மேம்பட்ட அம்சங்கள் விவாதிக்கப்படுகின்றன.",
      "இந்த கட்டுரை சி.எஸ்.எஸ் தேர்வாளர்களை பொதுமைப்படுத்துவதற்கான ஒரு கருவியையும் ஆராய்கிறது மற்றும் சி.எஸ்.எஸ்ஸில் வழக்கமான வெளிப்பாடு சொற்றொடரின் பயனை எடுத்துக்காட்டுகிறது."
    ],
    "points": 288,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1692100064
  },
  {
    "id": 37138807,
    "title": "வகை கணினி குறியீட்டை நான் எவ்வாறு படிக்க வேண்டும்?",
    "originLink": "https://langdev.stackexchange.com/questions/2692/how-should-i-read-type-system-notation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37138807",
    "commentBody": "",
    "originSummary": [
      "நிரலாக்க மொழி வடிவமைப்பு மற்றும் செயல்படுத்தல் ஸ்டாக் எக்ஸ்சேஞ்ச் என்பது நிரலாக்க மொழி வடிவமைப்பாளர்கள் மற்றும் செயல்படுத்துபவர்களுக்கு கேள்விகள் மற்றும் பதில்களைப் பரிமாறிக் கொள்வதற்கான ஒரு தளமாகும்.",
      "தளத்தில் சமீபத்தில் கேட்கப்பட்ட ஒரு கேள்வி வாசிப்பு வகை அமைப்பு குறியீட்டைப் பற்றிய வழிகாட்டுதலைக் கோரியது.",
      "சொற்றொடர்கள், இலக்கணங்கள், உறவுகள், தீர்ப்புகள், கோட்பாடுகள் மற்றும் அனுமான விதிகள் உள்ளிட்ட அடிப்படைகளின் விளக்கத்தை இந்த தளம் வழங்குகிறது. இது மாறுபடும் வகைகளைத் தீர்மானிப்பதில் சூழல் அல்லது வகை சூழலின் பங்கு மற்றும் வகை அமைப்புகளைக் குறிப்பிடுவதில் பிற பரிசீலனைகளையும் விவாதிக்கிறது."
    ],
    "commentSummary": [
      "கணினி அறிவியல் மற்றும் நிரலாக்க மொழிகளில் வகை கணினி குறியீட்டைப் புரிந்துகொள்வதும் பயன்படுத்துவதும் முக்கியம்.",
      "இந்த கட்டுரை வகை அமைப்பு குறியீட்டின் வரலாற்று வளர்ச்சி மற்றும் தர்க்கத்தில் அதன் பயன்பாடு ஆகியவற்றை ஆராய்கிறது.",
      "நிரலாக்க மொழிகளில் வகைக் குறிப்புகளின் இடம் மற்றும் மரபு பற்றிய வெவ்வேறு கண்ணோட்டங்கள் மற்றும் அனுபவங்கள் விவாதிக்கப்படுகின்றன."
    ],
    "points": 276,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1692130527
  },
  {
    "id": 37133504,
    "title": "உங்கள் சொந்த எல்.எல்.எம் ஏன் ஹோஸ்ட் செய்ய வேண்டும்?",
    "originLink": "http://marble.onl/posts/why_host_your_own_llm.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37133504",
    "commentBody": "",
    "originSummary": [
      "ஓபன்ஏஐயின் ஜிபிடி -4 போன்ற பொதுவில் கிடைக்கும் மாதிரிகளை நம்புவதற்கு பதிலாக சுய ஹோஸ்டிங் மொழி மாதிரிகளுக்கு (எல்.எல்.எம்) ஆதரவாக ஆசிரியர் ஒரு வாதத்தை முன்வைக்கிறார்.",
      "சுய ஹோஸ்டிங் மாதிரி கட்டமைப்பு மற்றும் எடைகள், தனிப்பயனாக்கம் மற்றும் நுணுக்கமான ட்யூனிங் திறன்கள் மற்றும் செயற்கை நுண்ணறிவு மாதிரியுடன் நீண்டகால உறவு ஆகியவற்றில் அதிக கட்டுப்பாட்டை வழங்குகிறது.",
      "சுய ஹோஸ்டிங் வளர்ந்து வரும் தொழில்நுட்பத்துடன் அதிக பரிசோதனை, உகந்ததாக்குதல் மற்றும் புதுப்பித்த நிலையில் இருக்க அனுமதிக்கிறது, அதே நேரத்தில் ஏபிஐக்கள் அதே அளவிலான அணுகல் மற்றும் புரிதலை வழங்காது."
    ],
    "commentSummary": [
      "இந்த கட்டுரை ஓபன்ஏஐயின் ஏபிஐயை நம்புவதற்கு பதிலாக, சுய ஹோஸ்டிங் மொழி மாதிரி மாதிரிகளின் (எல்.எல்.எம்) காரணங்கள் மற்றும் சவால்களை ஆராய்கிறது.",
      "பீம், தனிப்பட்ட வன்பொருள் மற்றும் ஜார்ஜ் ஹாட்ஸின் டைனி பாக்ஸ் போன்ற எல்.எல்.எம்களை ஹோஸ்டிங் செய்வதற்கான மாற்று விருப்பங்கள் விவாதிக்கப்படுகின்றன.",
      "செலவு-செயல்திறன் மற்றும் தனியுரிமை கவலைகள் உள்ளிட்ட சுய ஹோஸ்டிங் எல்.எல்.எம்களின் சாத்தியக்கூறு மற்றும் நன்மைகள் ஆராயப்படுகின்றன."
    ],
    "points": 248,
    "commentCount": 128,
    "retryCount": 0,
    "time": 1692104791
  },
  {
    "id": 37140159,
    "title": "நவீன சிஎஸ்வி பதிப்பு 2",
    "originLink": "https://www.moderncsv.com/modern-csv-2-is-now-available/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37140159",
    "commentBody": "",
    "originSummary": [
      "நவீன சி.எஸ்.வியின் டெவலப்பர், இவான், விண்டோஸ், மேக் மற்றும் லினக்ஸிற்கான அட்டவணை கோப்பு எடிட்டர் / பார்வையாளரின் பதிப்பு 2 ஐ வெளியிட்டுள்ளார்.",
      "இந்த புதிய பதிப்பு மேம்பட்ட UI / UX, மேம்பட்ட செயல்திறன், கூடுதல் அம்சங்கள், புதுப்பிக்கப்பட்ட ஆவணங்கள் மற்றும் ஆப்பிள் சிலிக்கனுக்கான சொந்த ஆதரவு உள்ளிட்ட பல மேம்பாடுகளை அறிமுகப்படுத்துகிறது.",
      "பயனர்கள் புதிய பதிப்பை முயற்சிக்கவும் டெவலப்பருக்கு கருத்துக்களை வழங்கவும் ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "நவீன சி.எஸ்.வி பதிப்பு 2 விண்டோஸ், மேக் மற்றும் லினக்ஸுக்கு வெளியிடப்பட்டுள்ளது, இது சி.எஸ்.வி கோப்பு கையாளுதலை மேம்படுத்தும் சக்திவாய்ந்த அட்டவணை கோப்பு எடிட்டர் / பார்வையாளரை வழங்குகிறது.",
      "இந்த புதுப்பிப்பு மேம்பட்ட UI / UX, சிறந்த செயல்திறன், கூடுதல் அம்சங்கள், புதுப்பிக்கப்பட்ட ஆவணங்கள் மற்றும் ஆப்பிள் சிலிக்கனுக்கான ஆதரவுடன் வருகிறது.",
      "மாற்று விருப்பங்களைப் பற்றி விவாதிக்கும்போது, எக்செல் உடன் விரக்திகளை வெளிப்படுத்தும்போது மற்றும் தகவல்தொடர்பு மற்றும் தாமதமான புதுப்பிப்புகள் குறித்த கவலைகளை எழுப்பும்போது பயனர்கள் மறுபெயரிடவும் தெளிவான மென்பொருள் நோக்கத்தை வழங்கவும் பரிந்துரைத்துள்ளனர்."
    ],
    "points": 247,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1692138909
  }
]
