[
  {
    "id": 40561872,
    "title": "보이저 1: 지구는 8.3GHz에서 비트당 1500개의 광자를 수신합니다.",
    "originLink": "https://physics.stackexchange.com/questions/816698/how-many-photons-are-received-per-bit-transmitted-from-voyager-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40561872",
    "commentBody": "",
    "originSummary": [
      "물리 스택 교환에 대한 논의에 따르면 보이저 1호가 비트당 약 2.6 x 10^22 광자를 보내고, 지구는 8.3GHz에서 비트당 약 1500 광자를 수신한다고 추정합니다.",
      "이 계산은 전송 주파수, 수신 접시 크기, 지구와의 거리 등의 요소를 고려하여 잡음으로 인한 신호 수신의 어려움을 강조합니다.",
      "또한 통신 채널을 통해 오류 없이 데이터를 전송할 수 있는 최대 속도를 정의하는 정보 이론의 기본 개념인 섀넌 한계에 대해서도 언급합니다."
    ],
    "commentSummary": [
      "물리 스택 교환 토론에서는 양자 오류 수정 연구원이 시작한 보이저 1호가 전송한 비트당 수신한 광자 수를 살펴봅니다.",
      "이 대화에서는 DRAM이나 해저 케이블과 같은 고전적인 오류 수정 방법과 양자 오류 수정 방법을 비교하며 양자 시스템의 복잡성을 강조합니다.",
      "섀넌 한계, 광자 계수, 장거리 우주 통신의 과제, 신호 수신 개선을 위한 다중 안테나 및 디지털 후처리와 같은 고급 기술 등을 주제로 다룹니다."
    ],
    "points": 603,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1717416477
  },
  {
    "id": 40559015,
    "title": "코드핍의 인터랙티브 가든 게임으로 CSS 그리드 배우기",
    "originLink": "https://cssgridgarden.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40559015",
    "commentBody": "",
    "originSummary": [
      "그리드 가든 레벨 1은 플레이어가 CSS 코드, 특히 그리드 열 시작 속성을 사용하여 가상의 당근 정원에 물을 주는 교육용 게임입니다.",
      "코드핍이 제작한 이 게임은 CSS 그리드 레이아웃을 활용하고 여러 언어로 제공되므로 많은 사람이 이용할 수 있습니다.",
      "CSS 플렉스박스 학습에 관심이 있는 분들을 위해 보완 학습 도구로 플렉스박스 개구리 게임도 추천합니다."
    ],
    "commentSummary": [
      "한 해커 뉴스 토론에서 가상 정원 게임(cssgridgarden.com)이 CSS 그리드 학습을 위한 교육 도구로 주목받으며 부트스트랩과 테일윈드와 같은 CSS 프레임워크에 대한 토론을 촉발했습니다.",
      "이 대화에서는 핵심 CSS 원칙을 이해하는 것이 중요하다는 점을 강조하며, Tailwind의 유용성과 코딩 관행에 미치는 영향에 대한 의견이 엇갈립니다.",
      "교육에서 게임 디자인의 역할, CSS Grid와 Flexbox의 강점과 과제, IDE와 고급 교육 리소스에서 더 나은 HTML과 CSS 통합의 필요성에 대해 논의합니다."
    ],
    "points": 320,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717384455
  },
  {
    "id": 40560300,
    "title": "NUCLEO-F103RB를 사용한 USB 디바이스 개발을 위한 초보자 가이드",
    "originLink": "https://popovicu.com/posts/making-usb-devices/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40560300",
    "commentBody": "",
    "originSummary": [
      "이 문서는 USB 장치 개발에 대한 초보자 가이드 역할을 하며, NUCLEO-F103RB 개발 보드를 사용한 간단한 엔드투엔드 프로젝트에 중점을 둡니다.",
      "데이터 전송을 위한 물리적 연결 및 차동 쌍을 포함한 USB의 기본 사항을 설명하고 PCB 라우팅에 대한 실용적인 조언을 제공합니다.",
      "저자는 STM32 설정의 복잡성을 비판하고 USB 장치 개발을 위한 보다 간소화된 대안으로 Linux를 제안하며 향후 보다 유연한 프레임워크가 필요하다고 주장합니다."
    ],
    "commentSummary": [
      "이 토론에서는 돌입 전류 관리, 베어메탈 USB 코드의 복잡성, libusb와 같은 도구 사용에 초점을 맞춰 USB 장치를 만들 때의 어려움을 강조합니다.",
      "사용자들은 아두이노 스타일의 보드, ESP32 에코시스템, VUSB를 사용하는 소형 컨트롤러를 추천하는 한편, USB 데이터 전송의 한계와 USB 공급업체 ID의 높은 비용에 대해서도 논의합니다.",
      "실용적인 솔루션으로는 라즈베리 파이 제로를 사용하여 프로토타입을 제작하고 오픈 소스 리소스를 활용하는 방법과 VID 및 PID의 법적 문제에 대한 추가 논의, USB-A를 USB-C 포트로 변환하는 방법 등이 있습니다."
    ],
    "points": 310,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1717401226
  },
  {
    "id": 40559368,
    "title": "AMD, 192코어의 Zen 5 EPYC \"Turin\" CPU, Radeon Pro W7900 및 Ryzen 5000XT 공개",
    "originLink": "https://www.anandtech.com/show/21415/amd-unveils-ryzen-9000-cpus-for-desktop-zen-5-takes-center-stage-at-computex-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40559368",
    "commentBody": "",
    "originSummary": [
      "AMD는 2024년 하반기 출시 예정인 최대 192코어의 Zen 5 기반 EPYC \"Turin\" 프로세서를 발표했으며, 7월에 출시되는 AI 추론용 Radeon Pro W7900 및 AM4 플랫폼용 새로운 Ryzen 5000XT CPU를 소개했습니다.",
      "TSMC는 3D 적층형 SoIC 패키징을 발전시키고 있으며 2025년 2nm 칩 양산을 시작할 계획이며 2025/2026년 N3X, N2P, A16 기술을 포함한 로드맵을 통해 2026년까지 매년 60%씩 CoWoS 생산 능력을 확대할 계획입니다.",
      "Lenovo는 새로운 요가 슬림 7x 및 씽크패드 T14 6세대 노트북을 공개했습니다(퀄컴 스냅드래곤 X 엘리트 탑재)."
    ],
    "commentSummary": [
      "Zen 5 아키텍처를 탑재한 AMD의 Ryzen 9000 CPU는 싱글 사이클 AVX-512 실행 및 향상된 512비트 FP 배율기 처리량 등 상당한 발전을 도입하여 인텔의 하이엔드 서버 CPU에 도전합니다.",
      "이 토론에서는 인텔이 소비자 CPU에서 지원을 축소하고 2025년까지 256비트 하위 집합을 다시 도입할 계획인 것과 대조적으로 512비트 AVX-512를 완벽하게 지원하는 AMD의 경쟁 우위를 강조합니다.",
      "사용자들은 AMD의 Zen 시리즈와 Apple의 M 시리즈 칩을 비교하며 AMD의 빠른 CPU 발전과 성능 및 효율성의 차이에 주목하는 한편, AI 및 실시간 애플리케이션에 미치는 광범위한 영향에 대해서도 논의합니다."
    ],
    "points": 308,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1717389244
  },
  {
    "id": 40560391,
    "title": "EU 제안: 사용자가 AI 스캔에 동의하지 않으면 미디어 공유가 차단됨",
    "originLink": "https://www.patrick-breyer.de/en/majority-for-chat-control-possible-users-who-refuse-scanning-to-be-prevented-from-sharing-photos-and-links/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40560391",
    "commentBody": "",
    "originSummary": [
      "2024년 5월 31일, 유럽 의회는 공유 미디어에서 아동 성학대 자료를 AI 기반으로 검색하도록 의무화하는 '채팅 통제' 규정을 논의했습니다.",
      "이 규정은 스캔에 대한 사용자 동의를 요구하며, 거부 시 미디어 공유가 차단되고, WhatsApp 및 Signal과 같은 엔드투엔드 암호화 서비스에는 클라이언트 측 스캔이 필요합니다.",
      "기본권 침해에 대한 법적 우려에도 불구하고 대부분의 EU 정부는 이 규정을 지지하지만, 비판론자들은 이 규정이 디지털 개인정보 보호와 보안 암호화를 약화시킨다고 주장합니다."
    ],
    "commentSummary": [
      "EU가 제안한 법안은 사용자에게 사진 및 링크 스캔을 의무화하지만 보안 당국, 군인, 비영리 서비스는 면제하고 있어 공정성과 실효성에 대한 우려가 제기되고 있습니다.",
      "비평가들은 이러한 예외 조항이 정책을 약화시키고, 공개 플랫폼에서 민감한 데이터를 공유하는 것의 실용성과 보안 위험에 의문을 제기하며, 오용 및 개인정보 침해의 가능성을 강조한다고 주장합니다.",
      "이 토론에서는 EU의 규제 접근 방식을 미국과 비교하며 AI 및 디지털 범죄법에 대한 과도한 규제가 개인의 권리를 침해하고 권위주의를 조장한다고 비판합니다."
    ],
    "points": 283,
    "commentCount": 288,
    "retryCount": 0,
    "time": 1717402427
  },
  {
    "id": 40558754,
    "title": "지적 비만의 전염병 퇴치하기: 더 건강한 정보 다이어트 큐레이팅",
    "originLink": "https://www.gurwinder.blog/p/the-intellectual-obesity-crisis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40558754",
    "commentBody": "",
    "originSummary": [
      "구르빈더의 '지적 비만 위기'라는 글은 저품질 정보의 과잉 소비를 정크푸드에 비유하며 쓸모없는 데이터로 우리의 마음을 가득 채우는 '지적 비만'을 초래한다고 지적합니다.",
      "특히 소셜 미디어에서 사소하고 감정적인 콘텐츠에 중독되면 지속적으로 주의가 산만해지고 정신이 어수선해져 가치 있는 정보를 처리하는 능력이 저하됩니다.",
      "이를 방지하기 위해 저자는 메타 인식을 개발하고, '10-10-10 규칙'을 사용하여 정보의 장기적인 가치를 평가하고, 글쓰기와 같은 활동을 통해 나쁜 정보를 걸러내고 궁극적으로 더 건강한 정보 다이어트를 큐레이팅할 것을 제안합니다."
    ],
    "commentSummary": [
      "블로그 게시물 '지적 비만의 위기'에서는 영양가 있는 식사 대신 정크푸드를 선택하는 것과 비교하며 저품질의 확인되지 않은 정보를 소비하는 것이 미치는 부정적인 영향에 대해 설명합니다.",
      "타일러 코웬의 저서 '인포보어의 시대'를 인용하며, 진정한 이해를 위해서는 매력적인 콘텐츠와 깊이 있고 포괄적인 출처 간의 균형이 필요하다고 강조합니다.",
      "이 토론에서는 디지털 소비를 관리하기 위한 전략을 다루고, '에듀테인먼트'의 피상적인 특성을 비판하며, 민주적 참여를 위한 다양한 뉴스 소비의 중요성을 강조합니다."
    ],
    "points": 248,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1717380438
  },
  {
    "id": 40558607,
    "title": "Q1K3: 고급 기능과 부드러운 게임플레이를 갖춘 13KB 브라우저 게임",
    "originLink": "https://js13kgames.com/entries/q1k3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40558607",
    "commentBody": "",
    "originSummary": [
      "\"포보스랩의 'Q1K3'는 2021년에 출시된 브라우저 기반 게임으로, 13KB의 작은 크기에 인상적인 기술적 성과가 돋보이는 게임입니다.",
      "이 게임은 두 가지 레벨, 다섯 가지 적 유형, 세 가지 무기, 30가지 텍스처, 동적 조명, 강력한 충돌 감지, 가시선 확인 기능이 있는 적 AI, 공간 오디오를 제공합니다.",
      "전문가 피드백은 이 게임의 부드러운 게임플레이와 풍부한 기능을 강조하며 효율적인 코딩과 디자인의 뛰어난 사례로 꼽았습니다."
    ],
    "commentSummary": [
      "js13kgames.com의 한 유머러스한 토론에서는 둠과 퀘이크 소스 코드를 우주로 보내자는 제안이 있었고, 외계인이 인간의 소프트웨어를 이해할 수 있는지에 대한 논쟁이 촉발되었습니다.",
      "댓글 작성자들은 '인디펜던스 데이'를 언급하며 외계 기술과의 인터페이스의 불합리함을 강조했고, 마우스 컨트롤을 뒤집거나 Quake를 QR코드에 넣는 등 색다른 기술 솔루션에 대해 논의했습니다.",
      "이 대화에는 압축 기술에 대한 경험, 역사적인 게임 사례, 브라우저 호환성, 게임 디자인 과제 등 초기 게임 개발의 독창성에 대한 향수와 존경이 반영되어 있었습니다."
    ],
    "points": 243,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1717378791
  },
  {
    "id": 40556995,
    "title": "HN-text: 간편한 탐색 기능을 갖춘 해커 뉴스를 위한 간소화된 터미널 클라이언트",
    "originLink": "https://github.com/piqoni/hn-text",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40556995",
    "commentBody": "",
    "originSummary": [
      "HN-text는 빠르고 사용하기 쉬우며 방해받지 않는 환경을 위해 설계된 해커뉴스의 터미널 클라이언트입니다.",
      "화살표 키 또는 hjkl을 사용하여 간단한 탐색을 지원하고 기사와 댓글을 가독성 있는 텍스트로 변환합니다.",
      "주요 기능으로는 기본 브라우저에서 기사와 댓글을 여는 옵션과 함께 첫 페이지, 댓글, 기사 텍스트 사이를 빠르게 탐색할 수 있는 기능이 있습니다."
    ],
    "commentSummary": [
      "사용자들은 저대역폭과 오프라인 기능에 초점을 맞춰 HN-text, hn.zip, 사용자 지정 스크레이퍼 등 해커 뉴스를 검색하기 위한 다양한 텍스트 기반 도구와 프로젝트에 대해 논의하고 있습니다.",
      "한 사용자가 서버 측 렌더링을 위해 구글 스프레드시트, 파이어스토어, 눅스트를 사용하여 비공개 프로젝트를 공유하며 비용 부담 없는 운영과 효과적인 캐싱 전략을 강조합니다.",
      "또 다른 사용자는 데이터 인덱싱과 자연어 처리(NLP) 작업을 위한 분산형 NATS 클러스터를 개발 중이며, 텍스트 전용 검색 옵션과 도구 개선에 대해서도 대화를 나누었습니다."
    ],
    "points": 203,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717360019
  },
  {
    "id": 40563283,
    "title": "2024년 6월 채용 공고 - 누구를 채용하나요?",
    "originLink": "https://news.ycombinator.com/item?id=40563283",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40563283",
    "commentBody": "",
    "originSummary": [
      "채용 기회를 게시할 때는 근무 지역, 원격 근무 옵션, 인턴십, 비자 스폰서십 가능 여부를 명시하세요.",
      "채용 담당자나 구인 게시판이 아닌 채용 회사에 직접 소속된 경우에만 게시할 수 있으며, 회사당 하나의 게시물로 제한합니다.",
      "회사가 잘 알려지지 않은 경우 간단한 설명을 제공하고 댓글 작성자가 주제에 집중할 수 있도록 합니다."
    ],
    "commentSummary": [
      "\"누가 채용 중인가요? (2024년 6월)\" 스레드에는 직위, 근무지, 원격 옵션, 인턴십, 비자 스폰서십 등 다양한 기술 기업의 채용 공고가 올라와 있습니다.",
      "주목할 만한 채용 기업으로는 VDX.tv, 더블포인트, 센서스, 클라라 시스템즈, 렙스파크, 라이브EO, 저스트워치, 레콘웰, 마히게이밍, 리그앱스, 서프에이피, 레이드랩, 니프티킷, 매터모스트, 존슨 법률 그룹, 시엔 파이낸스, 덕덕고, 돌비 연구소, 애브리지, 앰플리파이 교육, 맨 그룹, 눅스, 앤티시스, 퀘이사, 3플레이 미디어, 씽풀풀.ai, Higharc, 폭스글로브, 락스타 게임즈, 해피 스크라이브, 플랜팅스페이스, 클로즈, 하이브스택 바이 페리온, FRVR, 런, Avy.ai, 엔베리타스, 리페어와이즈, 비암, 롤바, 컨티뉴어스.ai, 테스트 드라이버.ai, 서도라이트, 서클 메디컬, 플롯리, 슬레이, 지토 재단, 피나리오, 아하! Viator, Akkio, Tracebit, Boxento, Writ, Neuronostics, Spill, Polaron.",
      "이 스레드는 기술 업계 구직자에게 유용한 리소스로, 기업이 직접 채용 공고를 게시하고 지원자의 진정한 관심을 유도합니다."
    ],
    "points": 193,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1717426914
  },
  {
    "id": 40562210,
    "title": "데이터 분석가를 위한 무료 SQL 편집기를 만들기 위한 10년간의 여정",
    "originLink": "https://www.timestored.com/qstudio/release-version-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562210",
    "commentBody": "",
    "originSummary": [
      "무료 SQL 편집기는 데이터 분석가를 대상으로 10년에 걸쳐 개발되었습니다.",
      "이 도구는 차트, 시각화 및 Excel 내보내기 기능을 강조합니다.",
      "사용자는 편집기를 사용해 보고 피드백을 제공하시기 바랍니다."
    ],
    "commentSummary": [
      "Ryan 해밀턴은 지난 10년 동안 차트, 시각화 및 Excel 내보내기 기능을 갖춘 데이터 분석가를 위한 무료 SQL 편집기인 qStudio를 개발했습니다.",
      "깃허브에서 제공되는 이 오픈 소스 프로젝트에는 AI 쿼리 생성, 다크 모드, 내보내기 개선 등의 기능이 포함되어 있으며, 인텔 맥과 애플 실리콘의 기술적 문제를 해결하기 위한 노력이 계속되고 있습니다.",
      "개발에 대한 반응은 엇갈리지만, 개발자가 사용자 및 금융회사와 적극적으로 소통하여 피드백을 받고 자금을 조달하는 등 속도와 유용성에 대해 호평을 받고 있습니다."
    ],
    "points": 174,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1717419363
  },
  {
    "id": 40562834,
    "title": "FBI, 전국적인 임대료 담합 수사로 코틀랜드 경영진 압수수색",
    "originLink": "https://www.thebignewsletter.com/p/monopoly-round-up-fbi-raids-big-corporate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562834",
    "commentBody": "",
    "originSummary": [
      "FBI는 소프트웨어 및 컨설팅 회사인 RealPage가 조율한 전국적인 임대료 담합 카르텔에 가담한 혐의로 주요 기업 임대주인 Cortland Management를 급습했습니다.",
      "이 카르텔에는 최소 21개의 대형 임대인과 기관 투자자가 연루되어 있으며, 실시간 데이터를 공유하고 가격 결정을 조정하여 최대 1,600만 채의 아파트 임대료를 조작한 것으로 추정됩니다.",
      "이번 조사는 법무부와 FBI가 깊이 관여한 중대한 반독점 조치로, 시장 조작과 임대료 인플레이션에 대한 우려를 강조하고 있습니다."
    ],
    "commentSummary": [
      "FBI는 임대료 인상을 유도하고 잠재적으로 가격 담합에 가담한 혐의를 받고 있는 한 대형 기업 임대인을 급습하여 반독점 문제를 제기했습니다.",
      "비평가들은 RealPage의 소프트웨어가 집주인의 담합을 가능하게 하여 주택 가격을 조작하고 경쟁을 감소시킨다고 주장하며, 법무부가 이러한 주장을 조사하고 있습니다.",
      "이 토론에서는 높은 생활비의 영향, 독점적 관행, 주택 경제성 문제를 악화시키는 정부 정책의 역할 등 보다 광범위한 경제 및 윤리적 문제를 강조합니다."
    ],
    "points": 173,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1717424203
  },
  {
    "id": 40562342,
    "title": "안정성과 성능을 강조한 DuckDB 1.0.0 '스노우덕' 출시",
    "originLink": "https://duckdb.org/2024/06/03/announcing-duckdb-100.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562342",
    "commentBody": "",
    "originSummary": [
      "DuckDB 팀은 안정성, 이전 버전과의 호환성, 강력한 성능에 중점을 둔 코드명 'Snow Duck'인 버전 1.0.0을 출시했습니다.",
      "DuckDB는 2018년 출시 이후 매월 수백만 건의 다운로드와 강력한 커뮤니티 지원으로 상당한 성장을 이루었습니다.",
      "이 프로젝트는 장기적인 지속 가능성을 보장하기 위해 DuckDB Labs와 DuckDB 재단의 지원을 받고 있으며, 향후 확장 환경을 확장할 계획입니다."
    ],
    "commentSummary": [
      "DuckDB 1.0.0이 출시되었으며, DuckDB Labs는 완전히 팀 소유로 운영되고 컨설팅 및 지원 서비스를 통해 자금을 지원받습니다.",
      "DuckDB 재단은 프로젝트가 MIT 라이선스에 따라 오픈소스로 유지되도록 보장하여 투명성과 접근성을 유지합니다.",
      "사용자들은 특히 S3의 Parquet과 같은 형식의 대규모 데이터 세트를 쿼리하고 스트림 처리에서 프로세스 중 집계를 위해 판다 데이터 프레임과 통합하는 데 있어 DuckDB의 단순성과 효율성을 높이 평가합니다."
    ],
    "points": 150,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1717420698
  },
  {
    "id": 40561906,
    "title": "50세 여성에서 희귀한 자동 양조장 증후군이 진단되었습니다: 사례 연구 및 관리",
    "originLink": "https://www.cmaj.ca/content/196/21/E724#msdynttrid",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40561906",
    "commentBody": "",
    "originSummary": [
      "캐나다 의학 협회 저널(CMAJ)에서는 장내 곰팡이가 알코올을 내생적으로 생성하여 알코올 섭취 없이도 중독을 일으키는 희귀 질환인 자가 양조 증후군(ABS)을 진단받은 50세 여성에 대한 사례 연구를 소개합니다.",
      "ABS의 진단에는 환자 병력, 에탄올 수치 검사, 진균 배양 검사 등이 포함되며, 관리에는 항진균제 치료와 저탄수화물 식단이 포함됩니다.",
      "1952년 일본에서 처음 발견된 ABS는 장내 미생물이 탄수화물을 알코올로 발효시키는 질환으로, 장내 미생물 이상 증식 및 높은 탄수화물 섭취와 같은 특정 숙주 요인이 필요하며 진단이 어렵고 종종 지연되는 경우가 있습니다."
    ],
    "commentSummary": [
      "자동 양조장 증후군을 앓고 있는 50세 여성은 의사들이 알코올 중독으로 인한 증상으로 오랫동안 오진을 받았고, 자신과 가족은 술을 마시지 않았다는 주장을 무시했습니다.",
      "이 사례는 희귀 질환 진단의 어려움, 환자 증언에 대한 편견에 대한 의존, 의료 전문가가 덜 흔한 진단을 고려해야 할 필요성 등 의료계의 체계적인 문제를 강조합니다.",
      "이 토론에서는 의료 치료에서의 성별 및 인종적 편견, 공감의 중요성, 철저한 조사, 자가 양조장 증후군과 같은 질환을 관리하는 데 있어 식단, 프로바이오틱스 및 장 건강의 역할에 대해서도 다룹니다."
    ],
    "points": 132,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1717416753
  }
]
