[
  {
    "id": 40561872,
    "title": "வாயேஜர் 1: பூமி 8.3 ஜிகாஹெர்ட்ஸில் ஒரு பிட்டுக்கு 1500 ஃபோட்டான்களைப் பெறுகிறது",
    "originLink": "https://physics.stackexchange.com/questions/816698/how-many-photons-are-received-per-bit-transmitted-from-voyager-1",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40561872",
    "commentBody": "",
    "originSummary": [
      "இயற்பியல் அடுக்கு பரிமாற்றம் பற்றிய விவாதம் வாயேஜர் 1 ஒரு பிட்டுக்கு தோராயமாக 2.6 x 10^22 ஃபோட்டான்களை அனுப்புகிறது என்றும், பூமி 8.3 ஜிகாஹெர்ட்ஸ் வேகத்தில் ஒரு பிட்டுக்கு சுமார் 1500 ஃபோட்டான்களைப் பெறுகிறது என்றும் மதிப்பிடுகிறது.",
      "பரிமாற்ற அதிர்வெண், டிஷ் அளவு மற்றும் பூமியிலிருந்து தூரம் போன்ற காரணிகளை கணக்கீடு கருதுகிறது, சத்தம் காரணமாக சமிக்ஞை வரவேற்பின் சவால்களை எடுத்துக்காட்டுகிறது.",
      "உரையாடல் ஷானன் வரம்பையும் குறிக்கிறது, இது தகவல் கோட்பாட்டில் ஒரு அடிப்படைக் கருத்தாகும், இது ஒரு தகவல்தொடர்பு சேனலில் பிழை இல்லாத தரவு பரிமாற்றத்தின் அதிகபட்ச விகிதத்தை வரையறுக்கிறது."
    ],
    "commentSummary": [
      "ஒரு இயற்பியல் அடுக்கு பரிமாற்ற விவாதம் வாயேஜர் 1 இலிருந்து அனுப்பப்பட்ட ஒரு பிட்டுக்கு பெறப்பட்ட ஃபோட்டான்களின் எண்ணிக்கையை ஆராய்கிறது, இது குவாண்டம் பிழை திருத்த ஆராய்ச்சியாளரால் தொடங்கப்பட்டது.",
      "உரையாடல் டிராம் மற்றும் கடலுக்கடியில் கேபிள்கள் போன்ற கிளாசிக்கல் பிழை திருத்த முறைகளை குவாண்டம் பிழை திருத்தத்துடன் ஒப்பிடுகிறது, இது குவாண்டம் அமைப்புகளின் சிக்கல்களை எடுத்துக்காட்டுகிறது.",
      "தலைப்புகள் ஷானன் வரம்பு, ஃபோட்டான் எண்ணிக்கை மற்றும் நீண்ட தூர விண்வெளி தகவல்தொடர்புகளின் சவால்கள், அத்துடன் சமிக்ஞை வரவேற்பை மேம்படுத்த பல ஆண்டெனாக்கள் மற்றும் டிஜிட்டல் பிந்தைய செயலாக்கம் போன்ற மேம்பட்ட நுட்பங்கள் ஆகியவை அடங்கும்."
    ],
    "points": 603,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1717416477
  },
  {
    "id": 40559015,
    "title": "Codepip இன் ஊடாடும் தோட்ட விளையாட்டுடன் CSS கட்டத்தைக் கற்றுக்கொள்ளுங்கள்",
    "originLink": "https://cssgridgarden.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40559015",
    "commentBody": "",
    "originSummary": [
      "கிரிட் கார்டன் நிலை 1 என்பது ஒரு கல்வி விளையாட்டு ஆகும், அங்கு வீரர்கள் CSS குறியீட்டைப் பயன்படுத்துகின்றனர், குறிப்பாக கட்டம்-நெடுவரிசை-தொடக்க சொத்து, மெய்நிகர் கேரட் தோட்டத்திற்கு தண்ணீர் ஊற்ற.",
      "Codepip ஆல் உருவாக்கப்பட்ட கேம், CSS கட்டம் தளவமைப்பைப் பயன்படுத்துகிறது மற்றும் பல மொழிகளில் கிடைக்கிறது, இது பரந்த பார்வையாளர்களுக்கு அணுகக்கூடியதாக உள்ளது.",
      "CSS ஃப்ளெக்ஸ்பாக்ஸைக் கற்றுக்கொள்ள ஆர்வமுள்ளவர்களுக்கு, Flexbox Froggy விளையாட்டு ஒரு நிரப்பு கற்றல் கருவியாகவும் பரிந்துரைக்கப்படுகிறது."
    ],
    "commentSummary": [
      "ஒரு ஹேக்கர் செய்தி விவாதம் மெய்நிகர் தோட்ட விளையாட்டை (cssgridgarden.com) CSS கட்டம் கற்றுக்கொள்வதற்கான கல்வி கருவியாக வெளிச்சம் போட்டுக் காட்டுகிறது, இது பூட்ஸ்டார்ப் மற்றும் டெயில்விண்ட் போன்ற CSS கட்டமைப்புகளில் விவாதங்களை பற்றவைக்கிறது.",
      "டெயில்விண்டின் பயன்பாடு மற்றும் குறியீட்டு நடைமுறைகளில் அதன் தாக்கம் குறித்த கலவையான கருத்துக்களுடன், முக்கிய CSS கொள்கைகளைப் புரிந்துகொள்வதன் முக்கியத்துவத்தை உரையாடல் அடிக்கோடிட்டுக் காட்டுகிறது.",
      "கல்வியில் விளையாட்டு வடிவமைப்பின் பங்கு, CSS கிரிட் மற்றும் ஃப்ளெக்ஸ்பாக்ஸின் பலம் மற்றும் சவால்கள் மற்றும் IDEகள் மற்றும் மேம்பட்ட கல்வி வளங்களில் சிறந்த HTML மற்றும் CSS ஒருங்கிணைப்பின் தேவை பற்றி பயனர்கள் விவாதிக்கின்றனர்."
    ],
    "points": 320,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717384455
  },
  {
    "id": 40560300,
    "title": "NUCLEO-F103RB உடன் USB சாதனங்களை உருவாக்குவதற்கான தொடக்க வழிகாட்டி",
    "originLink": "https://popovicu.com/posts/making-usb-devices/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40560300",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை USB சாதனங்களை உருவாக்குவதற்கான தொடக்க வழிகாட்டியாக செயல்படுகிறது, NUCLEO-F103RB மேம்பாட்டு வாரியத்தைப் பயன்படுத்தி ஒரு எளிய இறுதி முதல் இறுதி திட்டத்தில் கவனம் செலுத்துகிறது.",
      "தரவு பரிமாற்றத்திற்கான உடல் இணைப்புகள் மற்றும் வேறுபட்ட ஜோடிகள் உட்பட யூ.எஸ்.பியின் அடிப்படைகளை இது விளக்குகிறது, மேலும் பிசிபி ரூட்டிங்கிற்கான நடைமுறை ஆலோசனைகளை வழங்குகிறது.",
      "ஆசிரியர் STM32 அமைப்பின் சிக்கலை விமர்சிக்கிறார் மற்றும் USB சாதன மேம்பாட்டிற்கான மிகவும் நெறிப்படுத்தப்பட்ட மாற்றாக லினக்ஸை பரிந்துரைக்கிறார், எதிர்காலத்தில் மிகவும் நெகிழ்வான கட்டமைப்புகளுக்கு வாதிடுகிறார்."
    ],
    "commentSummary": [
      "விவாதம் யூ.எஸ்.பி சாதனங்களை உருவாக்குவதில் உள்ள சவால்களை எடுத்துக்காட்டுகிறது, தற்போதைய மேலாண்மை, வெற்று உலோக யூ.எஸ்.பி குறியீடு சிக்கலான தன்மை மற்றும் லிபஸ்ப் போன்ற கருவிகளின் பயன்பாடு ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "பயனர்கள் Arduino-பாணி பலகைகள், ESP32 சுற்றுச்சூழல் அமைப்பு மற்றும் VUSB உடன் சிறிய கட்டுப்படுத்திகளை பரிந்துரைக்கின்றனர், அதே நேரத்தில் USB தரவு பரிமாற்ற வரம்புகள் மற்றும் USB விற்பனையாளர் ஐடிகளின் அதிக விலை பற்றியும் விவாதிக்கின்றனர்.",
      "நடைமுறை தீர்வுகளில் ராஸ்பெர்ரி பை ஜீரோக்களை முன்மாதிரி செய்வதற்கும் திறந்த மூல வளங்களை மேம்படுத்துவதற்கும் பயன்படுத்துதல், VIDகள் மற்றும் PIDகளுடன் சட்ட சிக்கல்கள் குறித்த கூடுதல் விவாதங்கள் மற்றும் USB-A ஐ USB-C போர்ட்களாக மாற்றுதல் ஆகியவை அடங்கும்."
    ],
    "points": 310,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1717401226
  },
  {
    "id": 40559368,
    "title": "AMD 5 கோர்கள், Radeon Pro W192 மற்றும் Ryzen 5000XT உடன் Zen 5000 EPYC \"டுரின்\" CPUகளை வெளியிட்டது",
    "originLink": "https://www.anandtech.com/show/21415/amd-unveils-ryzen-9000-cpus-for-desktop-zen-5-takes-center-stage-at-computex-2024",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40559368",
    "commentBody": "",
    "originSummary": [
      "AMD ஆனது Zen 5 அடிப்படையிலான EPYC \"டுரின்\" செயலிகளை 192 கோர்கள் வரை அறிவித்தது, இது 2024 ஆம் ஆண்டின் இரண்டாம் பாதியில் வெளியிடப்பட உள்ளது, மேலும் AI அனுமானத்திற்காக ரேடியான் புரோ W7900 மற்றும் AM5000 இயங்குதளத்திற்கான புதிய Ryzen 4XT CPUகளை அறிமுகப்படுத்தியது, இது ஜூலை மாதம் தொடங்கப்பட்டது.",
      "TSMC அதன் 3D அடுக்கப்பட்ட SoIC பேக்கேஜிங்கை முன்னேற்றுகிறது மற்றும் 2025/3க்கான N3X, N2P மற்றும் A16 தொழில்நுட்பங்களை உள்ளடக்கிய சாலை வரைபடத்துடன், 2025 இல் 2026nm சில்லுகளின் வெகுஜன உற்பத்தியைத் தொடங்க திட்டமிட்டுள்ளது, மேலும் 60 ஆம் ஆண்டில் ஆண்டுதோறும் 2026% CoWoS திறனை விரிவுபடுத்த திட்டமிட்டுள்ளது.",
      "Qualcomm Snapdragon X Elite மூலம் இயக்கப்படும் புதிய Yoga Slim 7x மற்றும் ThinkPad T14 Gen 6 நோட்புக்குகளை Lenovo வெளியிட்டது."
    ],
    "commentSummary": [
      "Zen 9000 கட்டமைப்புடன் கூடிய AMD இன் Ryzen 5 CPUகள், ஒற்றை-சுழற்சி AVX-512 செயல்படுத்தல் மற்றும் மேம்படுத்தப்பட்ட 512-பிட் FP பெருக்கி செயல்திறன் உள்ளிட்ட குறிப்பிடத்தக்க முன்னேற்றங்களை அறிமுகப்படுத்துகின்றன, இது இன்டெல்லின் உயர்நிலை சேவையக CPUகளுக்கு சவால் விடுகிறது.",
      "விவாதம் முழு 512-பிட் AVX-512 ஆதரவுடன் AMD இன் போட்டி விளிம்பை எடுத்துக்காட்டுகிறது, இது நுகர்வோர் CPUகளில் இன்டெல்லின் குறைக்கப்பட்ட ஆதரவை வேறுபடுத்துகிறது மற்றும் 256 க்குள் 2025-பிட் துணைக்குழுவை மீண்டும் அறிமுகப்படுத்த திட்டமிட்டுள்ளது.",
      "பயனர்கள் AMD இன் Zen தொடரை ஆப்பிளின் M-தொடர் சில்லுகளுடன் ஒப்பிடுகின்றனர், AMD இன் விரைவான CPU முன்னேற்றங்கள் மற்றும் செயல்திறன் மற்றும் செயல்திறனில் உள்ள வேறுபாடுகளைக் குறிப்பிடுகின்றனர், அதே நேரத்தில் AI மற்றும் நிகழ்நேர பயன்பாடுகளுக்கான பரந்த தாக்கங்களையும் விவாதிக்கின்றனர்."
    ],
    "points": 308,
    "commentCount": 257,
    "retryCount": 0,
    "time": 1717389244
  },
  {
    "id": 40560391,
    "title": "ஐரோப்பிய ஒன்றிய முன்மொழிவு: பயனர்கள் AI ஸ்கேனிங்கிற்கு ஒப்புதல் அளிக்க வேண்டும் அல்லது மீடியாவைப் பகிர்வதில் இருந்து தடுக்கப்பட வேண்டும்",
    "originLink": "https://www.patrick-breyer.de/en/majority-for-chat-control-possible-users-who-refuse-scanning-to-be-prevented-from-sharing-photos-and-links/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40560391",
    "commentBody": "",
    "originSummary": [
      "மே 31, 2024 அன்று, ஐரோப்பிய பாராளுமன்றம் \"அரட்டை கட்டுப்பாடு\" ஒழுங்குமுறை பற்றி விவாதித்தது, இது குழந்தை பாலியல் துஷ்பிரயோக உள்ளடக்கத்திற்காக பகிரப்பட்ட ஊடகங்களை AI-அடிப்படையிலான ஸ்கேன் செய்வதை கட்டாயப்படுத்துகிறது.",
      "ஒழுங்குமுறைக்கு ஸ்கேனிங்கிற்கு பயனர் ஒப்புதல் தேவைப்படுகிறது, மறுப்பதன் விளைவாக ஊடக பகிர்வு தடுக்கப்படுகிறது; வாட்ஸ்அப் மற்றும் சிக்னல் போன்ற எண்ட்-டு-எண்ட் என்க்ரிப்ட் செய்யப்பட்ட சேவைகளுக்கு கிளையன்ட் பக்க ஸ்கேனிங் தேவைப்படும்.",
      "அடிப்படை உரிமைகளை மீறுவது குறித்த சட்ட கவலைகள் இருந்தபோதிலும், பெரும்பாலான ஐரோப்பிய ஒன்றிய அரசாங்கங்கள் இந்த ஒழுங்குமுறையை ஆதரிக்கின்றன, அதே நேரத்தில் விமர்சகர்கள் இது டிஜிட்டல் தனியுரிமை மற்றும் பாதுகாப்பான குறியாக்கத்தை குறைமதிப்பிற்கு உட்படுத்துவதாக வாதிடுகின்றனர்."
    ],
    "commentSummary": [
      "ஐரோப்பிய ஒன்றியத்தின் முன்மொழியப்பட்ட சட்டம் பயனர்களுக்கு புகைப்படம் மற்றும் இணைப்பு ஸ்கேனிங்கை கட்டாயப்படுத்துகிறது, ஆனால் பாதுகாப்பு அதிகாரிகள், இராணுவ வீரர்கள் மற்றும் இலாப நோக்கற்ற சேவைகளுக்கு விலக்கு அளிக்கிறது, இது நியாயம் மற்றும் செயல்திறன் குறித்த கவலைகளை எழுப்புகிறது.",
      "இந்த விலக்குகள் கொள்கையை குறைமதிப்பிற்கு உட்படுத்துகின்றன, பொது தளங்களில் முக்கியமான தரவைப் பகிர்வதன் நடைமுறை மற்றும் பாதுகாப்பு அபாயங்களை கேள்விக்குள்ளாக்குகின்றன, மேலும் தவறான பயன்பாடு மற்றும் தனியுரிமை மீறலுக்கான சாத்தியக்கூறுகளை முன்னிலைப்படுத்துகின்றன என்று விமர்சகர்கள் வாதிடுகின்றனர்.",
      "இந்த விவாதம் ஐரோப்பிய ஒன்றியத்தின் ஒழுங்குமுறை அணுகுமுறையையும் உரையாற்றுகிறது, அதை அமெரிக்காவுடன் ஒப்பிடுகிறது, மேலும் AI மற்றும் டிஜிட்டல் குற்றச் சட்டங்கள் மீதான கடுமையான ஒழுங்குமுறை நிலைப்பாட்டை தனிநபர் உரிமைகளை மீறுவதாகவும் சர்வாதிகாரத்தை வளர்ப்பதாகவும் விமர்சிக்கிறது."
    ],
    "points": 283,
    "commentCount": 288,
    "retryCount": 0,
    "time": 1717402427
  },
  {
    "id": 40558754,
    "title": "அறிவுசார் உடல் பருமன் தொற்றுநோயை எதிர்த்துப் போராடுதல்: ஆரோக்கியமான தகவல் உணவை குணப்படுத்துதல்",
    "originLink": "https://www.gurwinder.blog/p/the-intellectual-obesity-crisis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40558754",
    "commentBody": "",
    "originSummary": [
      "குர்விந்தரின் \"அறிவுசார் உடல் பருமன் நெருக்கடி\" என்ற கட்டுரை குறைந்த தரமான தகவல்களின் அதிகப்படியான நுகர்வை குப்பை உணவுடன் ஒப்பிடுகிறது, இது \"அறிவுசார் உடல் பருமனுக்கு\" வழிவகுக்கிறது, இது பயனற்ற தரவுகளுடன் நம் மனதை அடைக்கிறது.",
      "அற்பமான மற்றும் உணர்ச்சிவசப்பட்ட உள்ளடக்கத்திற்கான இந்த போதை, குறிப்பாக சமூக ஊடகங்களில், நிலையான கவனச்சிதறல் மற்றும் இரைச்சலான மனதை விளைவிக்கிறது, மதிப்புமிக்க தகவல்களை செயலாக்கும் திறனைக் குறைக்கிறது.",
      "இதை எதிர்த்துப் போராட, மெட்டா-விழிப்புணர்வை வளர்ப்பதற்கும், தகவல்களின் நீண்டகால மதிப்பை மதிப்பிடுவதற்கு \"10-10-10 விதி\" ஐப் பயன்படுத்துவதற்கும், மோசமான தகவல்களை வடிகட்ட எழுதுவது போன்ற செயல்களில் ஈடுபடுவதற்கும், இறுதியில் ஆரோக்கியமான தகவல் உணவைக் குணப்படுத்துவதற்கும் ஆசிரியர் பரிந்துரைக்கிறார்."
    ],
    "commentSummary": [
      "\"அறிவுசார் உடல் பருமன் நெருக்கடி\" என்ற வலைப்பதிவு இடுகை குறைந்த தரமான, உறுதிப்படுத்தும் தகவல்களை உட்கொள்வதன் எதிர்மறையான தாக்கத்தைப் பற்றி விவாதிக்கிறது, சத்தான உணவுக்கு மேல் குப்பை உணவைத் தேர்ந்தெடுப்பதை ஒப்பிடுகிறது.",
      "இது டைலர் கோவனின் \"தி ஏஜ் ஆஃப் தி இன்ஃபோவொர்\" புத்தகத்தைக் குறிப்பிடுகிறது, இது உண்மையான புரிதலுக்கான உள்ளடக்கம் மற்றும் ஆழமான, விரிவான ஆதாரங்களுக்கு இடையிலான சமநிலையின் அவசியத்தை வலியுறுத்துகிறது.",
      "இந்த விவாதம் டிஜிட்டல் நுகர்வை நிர்வகிப்பதற்கான உத்திகளை உள்ளடக்கியது, \"கல்வித்திட்டத்தின்\" மேலோட்டமான தன்மையை விமர்சிக்கிறது மற்றும் ஜனநாயக ஈடுபாட்டிற்கான மாறுபட்ட செய்தி நுகர்வின் முக்கியத்துவத்தை எடுத்துக்காட்டுகிறது."
    ],
    "points": 248,
    "commentCount": 141,
    "retryCount": 0,
    "time": 1717380438
  },
  {
    "id": 40558607,
    "title": "Q1K3: மேம்பட்ட அம்சங்கள் மற்றும் மென்மையான விளையாட்டு கொண்ட 13KB உலாவி விளையாட்டு",
    "originLink": "https://js13kgames.com/entries/q1k3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40558607",
    "commentBody": "",
    "originSummary": [
      "Phoboslab இன் \"Q1K3\" என்பது 2021 உலாவி அடிப்படையிலான கேம் ஆகும், இது ஒரு சிறிய 13KB அளவிற்குள் அதன் ஈர்க்கக்கூடிய தொழில்நுட்ப சாதனைகளுக்கு குறிப்பிடத்தக்கது.",
      "விளையாட்டில் இரண்டு நிலைகள், ஐந்து எதிரி வகைகள், மூன்று ஆயுதங்கள், 30 அமைப்புகள், டைனமிக் லைட்டிங், வலுவான மோதல் கண்டறிதல், லைன்-ஆஃப்-சைட் காசோலைகளுடன் எதிரி AI மற்றும் இடஞ்சார்ந்த ஆடியோ ஆகியவை உள்ளன.",
      "நிபுணர் கருத்து விளையாட்டின் மென்மையான விளையாட்டு மற்றும் பணக்கார அம்சங்களை எடுத்துக்காட்டுகிறது, இது திறமையான குறியீட்டு மற்றும் வடிவமைப்பின் குறிப்பிடத்தக்க எடுத்துக்காட்டு."
    ],
    "commentSummary": [
      "js13kgames.com பற்றிய ஒரு நகைச்சுவையான விவாதம் டூம் மற்றும் நிலநடுக்கம் மூல குறியீடுகளை விண்வெளிக்கு அனுப்ப முன்மொழிந்தது, இது வேற்றுகிரகவாசிகள் மனித மென்பொருளைப் புரிந்து கொள்ள முடியுமா என்ற விவாதங்களைத் தூண்டியது.",
      "வர்ணனையாளர்கள் அன்னிய தொழில்நுட்பத்துடன் இடைமுகப்படுத்துவதன் அபத்தத்தை முன்னிலைப்படுத்த \"சுதந்திர தினத்தை\" குறிப்பிட்டனர் மற்றும் மவுஸ் கட்டுப்பாடுகளை தலைகீழாக மாற்றுவது மற்றும் QR குறியீடுகளில் நிலநடுக்கத்தை பொருத்துவது போன்ற வழக்கத்திற்கு மாறான தொழில்நுட்ப தீர்வுகளை விவாதித்தனர்.",
      "உரையாடலில் சுருக்க நுட்பங்கள், வரலாற்று கேமிங் எடுத்துக்காட்டுகள், உலாவி பொருந்தக்கூடிய தன்மை மற்றும் விளையாட்டு வடிவமைப்பு சவால்கள் ஆகியவை அடங்கும், இது ஆரம்பகால விளையாட்டு மேம்பாட்டு புத்திக்கூர்மைக்கான ஏக்கம் மற்றும் பாராட்டை பிரதிபலிக்கிறது."
    ],
    "points": 243,
    "commentCount": 73,
    "retryCount": 0,
    "time": 1717378791
  },
  {
    "id": 40556995,
    "title": "HN-உரை: எளிதான வழிசெலுத்தலுடன் ஹேக்கர் செய்திகளுக்கான நெறிப்படுத்தப்பட்ட டெர்மினல் கிளையண்ட்",
    "originLink": "https://github.com/piqoni/hn-text",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40556995",
    "commentBody": "",
    "originSummary": [
      "HN-text என்பது ஒரு முனைய கிளையண்ட் ஆகும் ஹேக்கர் செய்திகள் வேகமான, பயன்படுத்த எளிதான மற்றும் கவனச்சிதறல் இல்லாத அனுபவத்திற்காக வடிவமைக்கப்பட்டுள்ளது.",
      "இது அம்புக்குறி விசைகள் அல்லது hjkl ஐப் பயன்படுத்தி எளிய வழிசெலுத்தலை ஆதரிக்கிறது, மேலும் கட்டுரைகள் மற்றும் கருத்துகளை படிக்கக்கூடிய உரையாக மாற்றுகிறது.",
      "முக்கிய அம்சங்களில் முதல் பக்கம், கருத்துகள் மற்றும் கட்டுரை உரைக்கு இடையில் விரைவான வழிசெலுத்தல், இயல்புநிலை உலாவியில் கட்டுரைகள் மற்றும் கருத்துகளைத் திறப்பதற்கான விருப்பங்கள் ஆகியவை அடங்கும்."
    ],
    "commentSummary": [
      "குறைந்த அலைவரிசை மற்றும் ஆஃப்லைன் திறன்களில் கவனம் செலுத்தும் எச்.என்-உரை, hn.zip மற்றும் தனிப்பயன் ஸ்கிராப்பர்கள் போன்ற ஹேக்கர் செய்திகளை உலாவுவதற்கான பல்வேறு உரை அடிப்படையிலான கருவிகள் மற்றும் திட்டங்களைப் பற்றி பயனர்கள் விவாதிக்கின்றனர்.",
      "ஒரு பயனர் தங்கள் தனிப்பட்ட திட்டத்தை Google Sheets, Firestore மற்றும் Nuxt ஐப் பயன்படுத்தி சேவையக பக்க ரெண்டரிங்கிற்காக பகிர்ந்து கொள்கிறார், அதன் செலவு இல்லாத செயல்பாடு மற்றும் பயனுள்ள கேச்சிங் உத்திகளை வலியுறுத்துகிறார்.",
      "மற்றொரு பயனர் தரவு குறியீட்டு மற்றும் இயற்கை மொழி செயலாக்கம் (என்.எல்.பி) பணிகளுக்கான விநியோகிக்கப்பட்ட என்ஏடிஎஸ் கிளஸ்டரை உருவாக்கி வருகிறார், உரையாடல் உரை மட்டும் உலாவல் விருப்பங்கள் மற்றும் கருவி மேம்பாடுகளையும் தொடுகிறது."
    ],
    "points": 203,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717360019
  },
  {
    "id": 40563283,
    "title": "ஜூன் 2024 வேலை வாய்ப்புகள் - யார் பணியமர்த்தப்படுகிறார்கள்?",
    "originLink": "https://news.ycombinator.com/item?id=40563283",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40563283",
    "commentBody": "",
    "originSummary": [
      "வேலை வாய்ப்புகளை இடுகையிடும்போது, இருப்பிடம், தொலைதூர வேலை விருப்பங்கள், இன்டர்ன்ஷிப் மற்றும் விசா ஸ்பான்சர்ஷிப் கிடைப்பதைக் குறிப்பிடவும்.",
      "நீங்கள் நேரடியாக பணியமர்த்தல் நிறுவனத்தின் ஒரு பகுதியாக இருந்தால் மட்டுமே இடுகையிடவும், ஒரு ஆட்சேர்ப்பு அல்லது வேலை வாரியம் அல்ல, மேலும் ஒரு நிறுவனத்திற்கு ஒரு இடுகைக்கு மட்டுப்படுத்தவும்.",
      "நிறுவனம் நன்கு அறியப்படவில்லை என்றால் ஒரு சுருக்கமான விளக்கத்தை வழங்கவும், வர்ணனையாளர்கள் தலைப்பில் இருப்பதை உறுதிசெய்யவும்."
    ],
    "commentSummary": [
      "\"யார் வேலைக்கு அமர்த்துகிறார்கள்? (ஜூன் 2024)\" ஹேக்கர் செய்திகளில் உள்ள நூல் பதவிகள், இருப்பிடங்கள், தொலைநிலை விருப்பங்கள், இன்டர்ன்ஷிப் மற்றும் விசா ஸ்பான்சர்ஷிப்கள் உள்ளிட்ட பல்வேறு தொழில்நுட்ப நிறுவனங்களின் வேலை இடுகைகளை பட்டியலிடுகிறது.",
      "Notable companies hiring include VDX.tv, Doublepoint, Census, Klara Systems, RepSpark, LiveEO, JustWatch, ReconWell, MahiGaming, LeagueApps, SerpApi, Radar Labs, NiftyKit, Mattermost, Johnson Law Group, Seen Finance, DuckDuckGo, Dolby Laboratories, Abridge, Amplify Education, Man Group, Nooks, Antithesis, Quasar, 3Play Media, Thoughtful.ai, Higharc, Foxglove, Rockstar Games, Happy Scribe, PlantingSpace, Close, Hivestack by Perion, FRVR, Runn, Avy.ai, Enveritas, RepairWise, Viam,  ரோல்பார், Continua.ai, TestDriver.ai, சுடோரைட், சர்க்கிள் மெடிக்கல், ப்ளாட்லி, ஸ்லே, தி ஜிட்டோ அறக்கட்டளை, ஃபைனாரியோ, ஆஹா!, வியேட்டர், அக்கியோ, ட்ரேஸ்பிட் மற்றும் பாக்சென்டோ, ரிட், நியூரோனாஸ்டிக்ஸ், ஸ்பில், போலரான்.",
      "தொழில்நுட்பத் துறையில் வேலை தேடுபவர்களுக்கு இந்த நூல் ஒரு மதிப்புமிக்க ஆதாரமாகும், நிறுவனங்களிடமிருந்து நேரடி இடுகைகளை வழங்குகிறது மற்றும் விண்ணப்பதாரர்களிடமிருந்து உண்மையான ஆர்வத்தை ஊக்குவிக்கிறது."
    ],
    "points": 193,
    "commentCount": 185,
    "retryCount": 0,
    "time": 1717426914
  },
  {
    "id": 40562210,
    "title": "தரவு ஆய்வாளர்களுக்கான இலவச SQL எடிட்டரை உருவாக்க தசாப்த கால பயணம்",
    "originLink": "https://www.timestored.com/qstudio/release-version-3",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562210",
    "commentBody": "",
    "originSummary": [
      "தரவு ஆய்வாளர்களை இலக்காகக் கொண்ட இலவச SQL எடிட்டர் 10 ஆண்டுகளில் உருவாக்கப்பட்டுள்ளது.",
      "கருவி விளக்கப்படம், காட்சிப்படுத்தல் மற்றும் எக்செல் ஏற்றுமதி செயல்பாடுகளை வலியுறுத்துகிறது.",
      "பயனர்கள் எடிட்டரை முயற்சிக்கவும் கருத்துக்களை வழங்கவும் ஊக்குவிக்கப்படுகிறார்கள்."
    ],
    "commentSummary": [
      "ரியான் ஹாமில்டன் கடந்த தசாப்தத்தில் தரவு ஆய்வாளர்களுக்கான இலவச SQL எடிட்டரான qStudio ஐ உருவாக்கியுள்ளார், இதில் விளக்கப்படம், காட்சிப்படுத்தல் மற்றும் எக்செல் ஏற்றுமதி ஆகியவை இடம்பெற்றுள்ளன.",
      "GitHub இல் கிடைக்கும் திறந்த மூல திட்டமானது, AI வினவல் உருவாக்கம், இருண்ட பயன்முறை மற்றும் மேம்பட்ட ஏற்றுமதி போன்ற அம்சங்களை உள்ளடக்கியது, Intel Macs மற்றும் Apple சிலிக்கானில் தொழில்நுட்ப சிக்கல்களை நிவர்த்தி செய்வதற்கான தொடர்ச்சியான முயற்சிகளுடன்.",
      "அதன் வளர்ச்சிக்கு கலவையான எதிர்வினைகள் இருந்தபோதிலும், qStudio அதன் வேகம் மற்றும் பயன்பாட்டிற்காக பாராட்டப்படுகிறது, டெவலப்பர் பயனர்கள் மற்றும் நிதி நிறுவனங்களுடன் கருத்து மற்றும் நிதிக்காக தீவிரமாக ஈடுபடுகிறார்."
    ],
    "points": 174,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1717419363
  },
  {
    "id": 40562834,
    "title": "நாடு தழுவிய வாடகை நிர்ணய விசாரணையில் கோர்ட்லேண்ட் நிர்வாகத்தை எஃப்.பி.ஐ சோதனை செய்கிறது",
    "originLink": "https://www.thebignewsletter.com/p/monopoly-round-up-fbi-raids-big-corporate",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562834",
    "commentBody": "",
    "originSummary": [
      "ஒரு மென்பொருள் மற்றும் ஆலோசனை நிறுவனமான ரியல்பேஜ் ஏற்பாடு செய்த நாடு தழுவிய வாடகை நிர்ணய கார்டெலில் பங்கேற்றதாக எழுந்த குற்றச்சாட்டின் பேரில் ஒரு பெரிய பெருநிறுவன நில உரிமையாளரான கோர்ட்லேண்ட் மேனேஜ்மென்ட் மீது எஃப்.பி.ஐ சோதனை நடத்தியது.",
      "இந்த கார்டெல் குறைந்தது 21 பெரிய நில உரிமையாளர்கள் மற்றும் நிறுவன முதலீட்டாளர்களை உள்ளடக்கியதாகக் கூறப்படுகிறது, நிகழ்நேர தரவைப் பகிர்வதன் மூலமும், விலை முடிவுகளை ஒருங்கிணைப்பதன் மூலமும் 16 மில்லியன் அடுக்குமாடி குடியிருப்புகளுக்கான வாடகை விலைகளை கையாளுகிறது.",
      "இந்த விசாரணை ஒரு குறிப்பிடத்தக்க நம்பிக்கையற்ற நடவடிக்கையை பிரதிநிதித்துவப்படுத்துகிறது, நீதித்துறை மற்றும் FBI ஆகியவை ஆழமாக ஈடுபட்டுள்ளன, சந்தை கையாளுதல் மற்றும் வாடகை பணவீக்கம் குறித்த கவலைகளை எடுத்துக்காட்டுகிறது."
    ],
    "commentSummary": [
      "ரியல்பேஜின் விளைச்சல்ஸ்டார் மென்பொருளை வாடகை உயர்வை இயக்குவதற்கும், விலை நிர்ணயத்தில் ஈடுபடுவதற்கும் பயன்படுத்தியதாக குற்றம் சாட்டப்பட்ட ஒரு பெரிய பெருநிறுவன நில உரிமையாளரை எஃப்.பி.ஐ சோதனை செய்தது, இது நம்பிக்கையற்ற கவலைகளை எழுப்பியது.",
      "ரியல்பேஜின் மென்பொருள் நில உரிமையாளர் கூட்டுச்சதி, வீட்டு விலைகளைக் கையாளுதல் மற்றும் போட்டியைக் குறைத்தல் ஆகியவற்றை செயல்படுத்துகிறது என்று விமர்சகர்கள் வாதிடுகின்றனர், நீதித்துறை இந்த கூற்றுக்களை விசாரிக்கிறது.",
      "இந்த விவாதம் பரந்த பொருளாதார மற்றும் நெறிமுறை பிரச்சினைகளை எடுத்துக்காட்டுகிறது, இதில் உயர்ந்த வாழ்க்கைச் செலவுகளின் தாக்கம், ஏகபோக நடைமுறைகள் மற்றும் வீட்டுவசதி மலிவு பிரச்சினைகளை அதிகரிப்பதில் அரசாங்கக் கொள்கைகளின் பங்கு ஆகியவை அடங்கும்."
    ],
    "points": 173,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1717424203
  },
  {
    "id": 40562342,
    "title": "DuckDB 1.0.0 \"ஸ்னோ டக்\" வெளியிடப்பட்டது, நிலைத்தன்மை மற்றும் செயல்திறனை வலியுறுத்துகிறது",
    "originLink": "https://duckdb.org/2024/06/03/announcing-duckdb-100.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40562342",
    "commentBody": "",
    "originSummary": [
      "DuckDB குழு பதிப்பு 1.0.0 ஐ வெளியிட்டுள்ளது, இது \"ஸ்னோ டக்\" என்ற குறியீட்டுப் பெயரிடப்பட்டது, இது நிலைத்தன்மை, பின்தங்கிய பொருந்தக்கூடிய தன்மை மற்றும் வலுவான செயல்திறன் ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "DuckDB 2018 இல் தொடங்கப்பட்டதிலிருந்து மில்லியன் கணக்கான மாதாந்திர பதிவிறக்கங்கள் மற்றும் வலுவான சமூக ஆதரவுடன் கணிசமான வளர்ச்சியைக் கண்டுள்ளது.",
      "இந்த திட்டம் DuckDB Labs மற்றும் DuckDB அறக்கட்டளையால் ஆதரிக்கப்படுகிறது, நீண்டகால நிலைத்தன்மையை உறுதி செய்கிறது, விரிவாக்க சூழலை விரிவுபடுத்துவதற்கான எதிர்கால திட்டங்களுடன்."
    ],
    "commentSummary": [
      "DuckDB 1.0.0 வெளியிடப்பட்டது, DuckDB Labs முழுமையாக அணிக்கு சொந்தமானது மற்றும் ஆலோசனை மற்றும் ஆதரவு சேவைகள் மூலம் நிதியளிக்கப்படுகிறது.",
      "DuckDB அறக்கட்டளை MIT உரிமத்தின் கீழ் திட்டம் திறந்த மூலமாக இருப்பதை உறுதி செய்கிறது, வெளிப்படைத்தன்மை மற்றும் அணுகலை பராமரிக்கிறது.",
      "பயனர்கள் DuckDB ஐ அதன் எளிமை மற்றும் செயல்திறனுக்காகப் பாராட்டுகிறார்கள், குறிப்பாக S3 இல் Parquet போன்ற வடிவங்களில் பெரிய தரவுத்தொகுப்புகளை வினவுவதற்கும், ஸ்ட்ரீம் செயலாக்கத்தில் செயல்முறை திரட்டலுக்காக பாண்டாஸ் டேட்டாஃப்ரேம்களுடன் ஒருங்கிணைப்பதற்கும்."
    ],
    "points": 150,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1717420698
  },
  {
    "id": 40561906,
    "title": "50 வயதான பெண்ணில் கண்டறியப்பட்ட அரிய ஆட்டோ ப்ரூவரி நோய்க்குறி: வழக்கு ஆய்வு மற்றும் மேலாண்மை",
    "originLink": "https://www.cmaj.ca/content/196/21/E724#msdynttrid",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40561906",
    "commentBody": "",
    "originSummary": [
      "கனடிய மருத்துவ சங்க இதழ் (சி.எம்.ஏ.ஜே) ஆட்டோ ப்ரூவரி சிண்ட்ரோம் (ஏபிஎஸ்) நோயால் கண்டறியப்பட்ட 50 வயதான பெண்ணைப் பற்றிய வழக்கு ஆய்வைக் கொண்டுள்ளது, இது குடல் பூஞ்சை ஆல்கஹால் உட்புறமாக ஆல்கஹால் உற்பத்தி செய்யும் ஒரு அரிய நிலை, இது மது அருந்தாமல் போதையை ஏற்படுத்துகிறது.",
      "ஏபிஎஸ் நோயறிதல் நோயாளி வரலாறு, எத்தனால் நிலை சோதனைகள் மற்றும் பூஞ்சை கலாச்சாரங்களை உள்ளடக்கியது, அதே நேரத்தில் நிர்வாகத்தில் பூஞ்சை காளான் சிகிச்சை மற்றும் குறைந்த கார்போஹைட்ரேட் உணவு ஆகியவை அடங்கும்.",
      "1952 ஆம் ஆண்டில் ஜப்பானில் முதன்முதலில் விவரிக்கப்பட்ட ஏபிஎஸ், குடல் நுண்ணுயிரிகள் கார்போஹைட்ரேட்டுகளை ஆல்கஹால் நொதித்தல், குடல் டிஸ்பயோசிஸ் மற்றும் அதிக கார்போஹைட்ரேட் உட்கொள்ளல் போன்ற குறிப்பிட்ட ஹோஸ்ட் காரணிகள் தேவைப்படுகின்றன; நோயறிதல் சவாலானது மற்றும் பெரும்பாலும் தாமதமானது."
    ],
    "commentSummary": [
      "ஆட்டோ ப்ரூவரி நோய்க்குறி கொண்ட 50 வயதான ஒரு பெண் நீண்ட காலமாக தவறாக கண்டறியப்பட்டார், ஏனெனில் மருத்துவர்கள் அவரது அறிகுறிகளை ஆல்கஹால் போதைக்கு காரணம் கூறினர், அவரும் அவரது குடும்பத்தினரும் மது அருந்தவில்லை என்ற கூற்றுக்களை புறக்கணித்தனர்.",
      "அரிதான நிலைமைகளைக் கண்டறிவதில் சிரமம், நோயாளியின் சாட்சியங்கள் மீதான சார்புகளை நம்பியிருத்தல் மற்றும் குறைவான பொதுவான நோயறிதல்களைக் கருத்தில் கொள்ள மருத்துவ வல்லுநர்களின் தேவை உள்ளிட்ட சுகாதாரப் பராமரிப்பில் முறையான சிக்கல்களை இந்த வழக்கு எடுத்துக்காட்டுகிறது.",
      "மருத்துவ சிகிச்சையில் பாலினம் மற்றும் இன சார்புகள், பச்சாத்தாபம், முழுமையான விசாரணையின் முக்கியத்துவம் மற்றும் ஆட்டோ ப்ரூவரி சிண்ட்ரோம் போன்ற நிலைமைகளை நிர்வகிப்பதில் உணவு, புரோபயாடிக்குகள் மற்றும் குடல் ஆரோக்கியத்தின் பங்கு ஆகியவற்றையும் விவாதம் உரையாற்றுகிறது."
    ],
    "points": 132,
    "commentCount": 108,
    "retryCount": 0,
    "time": 1717416753
  }
]
