[
  {
    "title": "2022: Chevy Silverado, Ford F-150, Tesla Model Y dominate US car market",
    "originLink": "https://www.themanual.com/auto/most-popular-cars-by-state/",
    "originBody": "When it comes to the popularity of cars and trucks in America, television ads would have us believe that somehow, in some way, every car and truck seems to be the best at this or offer the most of that in its class. Advertising, however, always has a way of being not-so-subtly subjective. But the objective truth lies in pure numbers and bottom-line results. Edmunds did the dirty work for all of us and collected retail registrations across the country, much in the same way we covered the most valuable colors for used cars some time ago. CONTENTS 1. Chevrolet Silverado 2. Ford F-Series 3. Toyota RAV4 4. Ram 1500/2500/3500 5. Toyota Camry Show 6 more items Rental sales and government purchases were not included in this auto census, so the results are proof of what cars and trucks were the most popular in the hearts and wallets of the U.S. public for 2022. The following is a list of the most popular cars and trucks in every state (and territory) in the United States. Read on to see what your state drives the most… General Motors / GM 1. Chevrolet Silverado Trucks, trucks, everywhere. Not surprisingly, the two most popular trucks in America are archrivals and divide the country pretty firmly. The Chevrolet Silverado is as versatile as a post-apocalyptic Eagle Scout and comes with almost as many badges. Crew Cab, Regular, or Double Cab configurations allow for the entire work family or family-family to traverse any kind of terrain to get to the job site or the movie theater. Recommended Videos For 2023, the lowest-priced Silverado checks in with an MSRP of $43,895 in Work Truck form, while the highest trim is the nearly unstoppable ZR2 with its $73,335 price tag, and the other eight available trims falling in between those bookend price points. Related Tesla has ‘waning marketability’ but still makes 5X more per vehicle than GM, Ford: Report The last gas Jags: Jaguar ends gas-powered heritage with limited-production 2024 F-Type ZP Edition sports cars This is every automaker that will adopt Tesla’s Supercharger network for EVs The states this vehicle is most popular in include: Alabama Arizona Delaware Indiana Iowa Kentucky Minnesota Missouri Nebraska New Mexico North Dakota Ohio Oklahoma South Carolina West Virginia Wisconsin Ford Motor Company / Ford 2. Ford F-Series In a lot of ways, the Hatfields only really have genuine significance because of the McCoys, and vice versa. The Ford F-Series has been battling the Chevy Silverado in one way or another since the end of the Vietnam War. Available in Regular Cab, Super Cab, and Super Crew, Ford matches the same offerings as Chevy but tacks on a powerful hybrid version as well as the Raptor and Raptor R for some off-roading heroics. The base F-150 is the XL, which has a reasonable base MSRP of $43,325 for 2023, while the top-of-the-line Raptor R tips the financial scales at a lofty $109,145 before any sort of markup from the dealer, while the other seven trims fall in between those two drastically different prices. The states this vehicle is most popular in include: Colorado Georgia Idaho Kansas Louisianna Maine Michigan Mississippi Montana South Dakota Tennessee Texas Utah Vermont Joel Patel/The Manual / Toyota 3. Toyota RAV4 Surprisingly, the little Toyota has upset the apple cart a bit in the pickup truck wars, pushing the mighty Ram out of a podium placement in popularity. But, offering a combination of safety, reliability, impressive fuel economy, and affordability makes this recreational activity vehicle a force to be reckoned with. The base LE checks in below the magical 30 grand mark, with an MSRP of just $29,825, while the top flight and almost paradoxical sounding TRD Off-Road trim only bumps the MSRP to a reasonable $39,445. The states this vehicle is most popular in include: Connecticut Illinois Maryland Massachusetts New Hampshire New York North Carolina Oregon Pennsylvania Rhode Island Virginia Washington Ram 1500 Red front 3/4 view Ram Trucks / Ram trucks 4. Ram 1500/2500/3500 Rounding out the Big Three American pickups, the Ram manages only to get top marks in three states. But with either a Crew Cab, Quad Cab, or TRX configuration, the Ram has enough firepower to hold its own with Ford or Chevy. The base Tradesman mirrors the Silverado Work Truck and F-150 XL with available features and a base MSRP of $42,155. At the other end of the financial spectrum is the mighty TRX, with its equally mighty base price of $86,350. The states this vehicle is most popular in include: Alaska Nevada Wyoming Toyota Camry TRD Toyota 5. Toyota Camry In a strange numerical mystery, somehow, the Toyota Camry managed to be the fifth highest-selling vehicle in the United States for 2022, yet not the most popular vehicle sold in any state in particular. But, that does speak volumes for the… volume of Camrys driving across America. Quiet, comfortable, and affordable, Toyota’s sedan brings genuine value to the table, with a base LE trim coming in at a mere $27,515, while the sporty and performance-oriented TRD model checks in at just $34,580 to own the top Camry, with the SE, SE Nightshade Edition, XLE and XSE filling in the gap between the LE and TRD. The Camry also carries the distinction of being the sole sedan in the top ten. No states Honda 6. Honda CR-V Much like its rival, the Toyota RAV4, Honda’s CR-V has continued to offer value, practicality, reliability, comfort, and fuel economy for a base price of $30,795 in LX form. For around another ten grand, the Sport Touring Hybrid tops the CR-V options list with an MSRP of $40,795, with the EX, Sport Hybrid, EX-L, and Sport-L Hybrid falling between the two. While the RAV4 takes top marks in twelve states, the CR-V wins just the Garden State, but with hometown heroes like Bon Jovi, Frank Sinatra, and Bruce Springsteen to mingle with, it’s easy to see the CR-V was born to run. New Jersey GM / GM 7. GMC Sierra Winning the top spot in just Arkansas, the GMC Sierra, like many GMC models, often gets overlooked because its Chevy twin tends to eat up the lion’s share of the spotlight. But, the newest generation of Sierra can be optioned out to be just as luxurious as it can be capable off-road. Checking in with a base MSRP of $44,695 for the Pro trim, the Sierra offers up a total of eight trim options, capped off by the prestigious and posh Denali Ultimate, which nearly doubles up that base price with an MSRP of $83,995. Arkansas 2024 Toyota Tacoma TRD and Trailhunter front 3/4 view Toyota / Toyota 8. Toyota Tacoma In an impressive placing, the Tacoma makes the third top-ten vehicle repping the Toyota brand. While only taking the top mark in Hawaii, the Tacoma is a more compact, cheaper, and generally more fuel-efficient option to the half-ton tyrants higher up on the list. Available in either Access Cab or Double Cab configurations, the cheapest Tacoma is the SR with an MSRP of $30,765, while the go-anywhere, do (almost) anything TRD Pro will cost you $49,370, with five trims in between the two. Hawaii Tesla / Tesla 9. Tesla Model Y In what feels almost like the punchline to a joke, the only electric car in the top ten cars managed to get the gold in just California. But, as any typical commute to or from work can confirm, the rEVolution is coming, and the Model Y is leading the charge (no pun intended). Being the most affordable of Elon Musk’s mechanical children, the Model Y has an MSRP of $45,380 for the Base trim, while the Long Range comes in at $49,880, and the most popular Performance trim tops the options list with its $53,880 MSRP tag. California Toyota Highlander Toyota 10. Toyota Highlander Not surprisingly, the only three-row SUV to make the list happens to be yet another Toyota. Though not the biggest Toyota, the biggest vehicle in the top ten takes everything people love about the RAV4, and offers just a bit… more of it, including the price. The base L trim checks in with a $37,955 MSRP, while the top Platinum trim will run you $50,810. The LE, XLE, XSE, and Limited each bump up their available features to be commensurate with the incremental increase in price. Like the Camry, the Highlander does not win out any state in particular, but as evidenced by its tenth-place finish, is incredibly popular nonetheless. Toyota Corolla front 3/4 view Toyota Honorable mention – Toyota Corolla While it may not be in the top ten most popular vehicles, it is a fan favorite in both Florida and Puerto Rico. The Corolla has always offered up enough comfort, reliability, and fuel economy for a very budget-friendly price, and the 2023 version is no different. For a mere $22,795 you can have a base Corolla LE right off the showroom floor. Opt for the mid-grade SE version, and it will only set you back $25,235, while the top XSE incurs a reasonable $27,945. In a world of skyrocketing interest rates, it isn’t hard to see why the Corolla is a perennial fan favorite. Florida Puerto Rico Editors' Recommendations Ford F-150, Ram 1500, and Chevy Silverado 1500 pickup trucks get poor ratings on IIHS backseat safety test Tesla reduces the prices of the Model 3 and Y again to drive up the demand What do Toyota, Porsche, and Ford have in common? The most loyal customers, according to J.D. Power New Ford F-150 Lightning Flash packs popular EV features into sub-$70k sticker price Alabama ‘barn find’ reveals 23 barely driven Chevy Corvettes, Ford Mustangs, and more",
    "originSummary": [
      "Edmunds has compiled retail registration data from across the United States to determine the top cars and trucks in each state for 2022.",
      "The top five most popular vehicles nationwide are the Chevrolet Silverado, Ford F-Series, Toyota RAV4, Ram 1500/2500/3500, and Toyota Camry.",
      "Other notable vehicles include the Honda CR-V, GMC Sierra, Toyota Tacoma, Tesla Model Y, and Toyota Highlander, with the Toyota Corolla receiving an honorable mention in Florida and Puerto Rico.",
      "These rankings are based on objective data and provide an unbiased perspective on the most popular vehicles in the country."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Lucid Gravity SUV Steals the Show at LA Auto Show Media Day!",
    "originLink": "https://cleantechnica.com/2023/11/19/what-i-learned-at-the-la-auto-show-media-day/",
    "originBody": "What I Learned At The LA Auto Show Media Day! November 19, 2023November 19, 2023 Paul Fosse 4 Comments Chevy Equinox, GM, Kia, Kia EV9, la auto show, Los Angeles Auto Show, lucid, Lucid Gravity, Lucid Motors, Toyota, toyota camry, Volkswagen, Volkswagen ID Buzz Sign up for daily news updates from CleanTechnica on email. Or follow us on Google News! Below are 2023 LA Auto Show highlights from the companies that have the potential to make a difference, including Lucid, Hyundai/Kia, Chevrolet, and Toyota. A surprise was a roundtable on Chinese cars in Mexico. The biggest news and the only significant new vehicle unveiling from my perspective was the unveiling of the Lucid Gravity SUV! It got by far the most attention, and even 4 hours after the announcement, the area was swarming with people taking pictures and asking questions of the representatives. Kyle Field of our team wrote an excellent piece explaining the announcement here. I’ll post his conclusion below and add a few comments. Lucid is pushing boldly into the SUV space with the Gravity and has delivered what looks to be an extremely functional luxury SUV. Most luxury SUVs these days are 5-seater builds, and that’s doubly true for the ultra premium segment where owners buy the car with plans to have a driver up front taking them from place to place. In this configuration, the third row of seats can just be folded down out of sight and out of mind. The world is in need of more 7-seater fully electric options, and it’s great to see the Gravity filling in this gap. With its sales of the Air already dipping, the company might be pinning its future viability on the success of the Gravity itself. Whether or not there is sufficient demand for an ultra premium 7-seater SUV like the Gravity remains to be seen, but it feels like a stretch at price tags that will range from the low $80k range for a rear-wheel drive build up to north of $250k for a fully loaded Lucid Gravity Sapphire. I agree we need more 3-row SUVs that can seat adults in the 3rd row, and think it is key to have a model under $80,000 to take advantage of the US tax credit for electric SUVs. The technology is truly impressive and I think the vehicle will be more successful than the Lucid Air sedan — because we all know sedans are less popular today than SUVs, and 3-row gas SUVs are very popular. Even the Tesla Model X (which is now available under $80,000) has the issue that its 3rd row isn’t very big. I have to mention that this company is losing a lot of money on every car. This means Lucid needs to do some combination of 4 things: Reduce costs. Scale production to spread fixed costs over more units. Get more cash from their investors. Maybe merge with a competitor that has deep pockets but needs Lucid’s technology. The next biggest news of the show is the Kia EV9, also a large 3-row SUV. I could argue it will have a bigger impact since it starts at $25,000 less than the Gravity ($54,900) and ships a year earlier (expected in the next month). I got to sit in the car, and although I am 6 foot 2 inches tall on a good day, I could sit comfortably in all 3 rows. I adjusted the seats to be comfortable for 7 large adults. Jennifer Sensiba wrote a great article covering all the important bits here. I saw it in both the 7-seat configuration and a more luxurious 6-seat configuration with two captain’s seats in the second row instead of a 3-person bench seat. I got the chance to discuss the tax credit with a Kia executive and he explained that they were able to quickly shift most of their electric vehicle sales to leases this year, since that allows them to get the $7,500 credit even though their EVs are made in South Korea. He also mentioned the EV9 will be made in Georgia starting in just 6 months (second quarter of 2024). Hyundai is expected to soon release a similar vehicle based on the same platform called the Ioniq 7. Unfortunately (and it seemed strange to me), they didn’t bring this vehicle to the auto show. The LA auto show also has a few fun vehicles on display. Who doesn’t like Scooby-Doo and the van that transported those meddling kids? I got a chance to see the ID Buzz in person. It wasn’t as roomy, comfortable, or refined as the Kia EV9. It seemed rather spartan. We have written a whole article on the vehicle here. My impression is it will sell well as a niche vehicle as long as it isn’t overpriced. (We don’t know the price yet.) As I repeat, we love our 3-row vehicles! Even if you only have two kids, everyone likes their own row. I got to see the Equinox at the show, but I wasn’t allowed to touch it. The salesperson didn’t seem too excited, and as we all know, GM has a history of overpromising and under-delivering. It certainly looks like it could be a nice compact crossover if GM delivers it in volume starting at the promised $35,000, but I’m not holding my breath. Steve Hanley has written more on this vehicle here. Toyota recently announced it was coming out with the new 2025 Toyota Camry. Usually, this doesn’t really mean anything. Toyota restyles it and it gets 2% more power and 2% better mileage. But this time, they made a significant change to the best selling sedan. They decided to drop the V6 and the normal 4-cylinder engines and power all Camry vehicles with a slightly enhanced hybrid engine. Toyota hasn’t yet announced the new fuel economy, but here is the info from the previous model: Image Credit: fueleconomy.gov As you can see, the hybrid has double the mileage of the V6 and 62.5% better mileage than the base 4-cylinder engine. I have read that last year only 18% of the Camrys sold were hybrids, so this a a big deal. Toyota sold 295,201 cars last year according to this article. I’m working on a new article on Toyota, but I wrote this article about the company 2 years ago. Basically, a hybrid is a gateway vehicle to a plug-in vehicle that introduces the joys of electrification to a large number of consumers who are afraid to buy an EV or even a plug-in hybrid. Lastly, I attended a roundtable by Motor Tread on Chinese vehicle manufacturers entering Mexico and hoping to use that as a base to enter other North and South American markets. Below I have pasted a link to Motor Trend‘s documentary. I plan to write more on this subject in the future. All images by Paul Fosse unless stated otherwise. Have a tip for CleanTechnica? Want to advertise? Want to suggest a guest for our CleanTech Talk podcast? Contact us here. EV Obsession Daily! I don't like paywalls. You don't like paywalls. Who likes paywalls? Here at CleanTechnica, we implemented a limited paywall for a while, but it always felt wrong — and it was always tough to decide what we should put behind there. In theory, your most exclusive and best content goes behind a paywall. But then fewer people read it!! So, we've decided to completely nix paywalls here at CleanTechnica. But... Like other media companies, we need reader support! If you support us, please chip in a bit monthly to help our team write, edit, and publish 15 cleantech stories a day! Thank you! Iontra: \"Thinking Outside the Battery\" Advertisement CleanTechnica uses affiliate links. See our policy here.",
    "originSummary": [
      "The Lucid Gravity SUV was unveiled at the LA Auto Show, garnering the most attention.",
      "The demand for 7-seater electric SUVs is highlighted, and the potential success of the Gravity in the market is discussed.",
      "The Kia EV9, a 3-row SUV with a lower starting price, is expected to have a bigger impact.",
      "The Toyota Camry has shifted to an enhanced hybrid engine.",
      "A roundtable discussion on Chinese vehicle manufacturers entering the Mexican market took place.",
      "CleanTechnica has removed paywalls and is seeking reader support."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "GM Acquires Tesla's 3D Printing Partner TEI",
    "originLink": "https://www.voxelmatters.com/general-motors-acquires-teslas-3d-printing-gigacasting-partner/",
    "originBody": "Home/Additive Manufacturing/Automotive/General Motors acquires Tesla’s 3D printing ‘gigacasting’ partner Acquisitions, Mergers & PartnershipsAutomotiveElectric Vehicles General Motors acquires Tesla’s 3D printing ‘gigacasting’ partner The acquisition of Tooling & Equipment International (TEI) places GM closer to Tesla's gigacasting expertise Edward WakefieldNovember 18, 2023 2 minutes read Image source: Tesla. Stay up to date with everything that is happening in the wonderful world of AM via our LinkedIn community. According to Reuters, General Motors (GM) has acquired Tooling & Equipment International (TEI), a firm responsible for helping Tesla develop its ‘gigacasting’, a 3D sand printing method for producing large car body parts in a single piece, for ‘less than $100 million’. GM’s acquisition of TEI signals its intent to manufacture cars more affordably and efficiently. This move comes as Tesla aims to launch a $25,000 electric vehicle (EV) and plans to produce millions of affordable EVs in the next decade. With TEI now under GM, Tesla is relying more on its other sand 3D printing casting partners in Britain (Grainger & Worral), Germany, and Japan, while also reportedly seeking a new sand casting specialist or developing such expertise in-house to reduce dependence on external suppliers. The General Motors headquarters in Detroit, Michigan, US. Credit: REUTERS/Rebecca Cook. Automakers like Ford, Hyundai, and Toyota are emulating Tesla’s gigacasting method to match its design and manufacturing efficiency. Tesla’s gigacasting approach, a core part of its ‘unboxed’ manufacturing strategy announced by Elon Musk, aims to halve assembly costs for future vehicles. This method involves creating the structural platform and subframes in one piece, and then assembling them with other concurrently produced parts. TEI, alongside Tesla’s other suppliers, enabled rapid prototyping using sand casting, a key factor in Tesla’s ability to develop cars economically within 18 to 24 months, significantly faster than the industry norm of three to four years. TEI’s expertise, dating back to 2017, has been pivotal in developing molds for Tesla’s various models. A 3D printed sand cast car part. Source: Tesla. When TEI was up for sale, GM recognized the potential to acquire gigacasting knowledge. This realization was confirmed during due diligence and possibly earlier, as GM had previously collaborated with TEI for the Cadillac Celestiq EV’s underbody castings. GM’s acquisition led to TEI establishing a dedicated production line for the Celestiq and integrating TEI into GM’s Global Manufacturing division. TEI won the 2023 Casting of the Year award for the Celestiq castings and remains its own entity under GM’s ownership. The acquisition strategically places GM closer to Tesla’s gigacasting expertise. Tesla’s lead in manufacturing innovation has been notable, but GM’s acquisition of TEI provides it with a direct insight into Tesla’s gigacasting methods. TEI’s role in creating test molds from industrial sand using 3D printing and digital designs has been crucial. This process allows for rapid, cost-effective mold creation and adjustments. TEI and its counterparts have also been integral in developing new alloys and heat-treating techniques for Tesla’s large metal parts. James Womack, a former MIT research director, reportedly views Musk’s manufacturing initiatives as a significant industry disruption, prompting even Toyota to adopt gigacasting and similar innovations. Womack anticipates ongoing competition for manufacturing efficiency, noting that cutting-edge efforts often require more time to mature and may involve some failures. Tags top news",
    "originSummary": [
      "General Motors (GM) has acquired Tooling & Equipment International (TEI), the company that helped Tesla develop its 'gigacasting' technique for 3D sand printing car body parts.",
      "This acquisition demonstrates GM's effort to enhance cost-efficiency and productivity in car manufacturing.",
      "Tesla, on the other hand, is collaborating with other sand casting partners and aiming to reduce reliance on external suppliers.",
      "GM's acquisition of TEI gives it valuable insight into Tesla's innovative gigacasting methods, which have played a significant role in their manufacturing success."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Kia and Hyundai Confident in Strong EV Demand Amid Tesla Competition",
    "originLink": "https://www.asiafinancial.com/kia-bullish-on-ev-demand-despite-tesla-gm-ford-fears",
    "originBody": "Home AF Indexes Markets Fintech Energy Transport Health Regions Insights AF TV Type to search Newsletter Home AF Indexes Global Fintech Leaders Index AF China Bond 50 Index GGETT Leaders Index China Electric Vehicle Index Markets Bonds News Capital Markets News Commodities News ESG News ETFs News Fintech AI News Blockchain News Crypto News Cyber Security News Payments News Energy Mining News New Energy News Oil & Gas News Rare Earths News Transport Aviation News Electric Vehicles News New Energy Vehicles News Space News Health Regions World News Asia News China News India News Central Asia News North Asia News Oceania News Insights Market Insights Fintech Insights Opinion AF TV NEWS ANALYSIS INDEXES Electric Vehicles Kia Bullish on EV Demand Despite Tesla, GM, Ford Fears November 19, 2023 The South Korean manufacturer, along with its parent Hyundai, said they weren’t seeing a slowdown in demand A KIA Niro is displayed during a press day at the 2021 Seoul Mobility Show in Goyang. File photo: Reuters. South Korean auto giants Kia and Hyundai remain confident that demand for electric vehicles (EVs) will remain strong, despite a recent downturn in mood in the sector. Senior executives from the carmakers said they were still optimistic about EV sales, especially in the US, ahead of the Los Angeles Auto Show. The comments run against industry fears that inflation and higher interest rates will undermine the boom in EV sales. Other major EV makers from Tesla to Ford Motor have pushed back EV-related factory buildouts in the face of economy-related concern. Also on AF: China Not Doing Enough to Spark Property Turnaround: Analysts “I am still very bullish on the battery electrics,” Jose Munoz, Hyundai’s global chief operating officer, said in Los Angeles ahead of the auto show that opened on Friday, adding the company’s EV sales were doubling year-over-year. “Our investments in the battery electric plant in Savannah [Georgia] move on. So we’re pushing as much as we possibly can to get it ready by October next year,” he said. “[Investments] are not on track. They are accelerated. We are pulling ahead.” Munoz added that, “based on what I see, I need more. If I had more capacity today, I could sell more cars.” Kia, which is 34% owned by Hyundai, has a similar view as its sister company. “We’re still growing organically despite the weather outside,” said Steven Center, chief operating officer at Kia America, referring to the economic climate. “We’re not seeing a slowdown.” He added that Kia was expanding into additional segments that would power EV growth. “All things being equal, as they say in economics, we’ll continue to grow in volume, and the EV side will do most of the growing.” Inflation and high interest rates have raised the costs of buying a car. Electric-vehicle makers meanwhile are dealing with supply-chain bottlenecks and pricing pressure from Tesla, which led EV price cuts this year. The average price paid for a new EV in the United States fell to just over $50,000 in September from more than $60,000 in January, according to Cox Automotive. The cuts helped drive EV sales in the third quarter up 50% from a year earlier to a record of more than 300,000 vehicles. Tesla’s Musk Concerned Still, Tesla CEO Elon Musk last month flagged his concerns about expanding factory capacity until interest rates ease, echoing similar signs of caution from General Motors and Ford. Startups Lucid and Fisker cut their 2023 production targets this month and Swedish EV maker Polestar trimmed its delivery forecast and halved its margin guidance for the year. About one in four Americans in the market for a new car intend to buy an EV, according to consumer insights firm the Langston Co. That is not enough, said Spencer Imel, a partner at Langston. “As early adopters have converted there is a lack of newly interested consumers to keep demand for the EV category high,” he said. To be sure, many in the industry are still trying to understand EV trends. Japanese automaker Subaru’s chief executive, Atsushi Osaki, told Reuters he was not sure about demand in the short term but was committed to the EV market. “There might be a bit of stagnation due to inflation at the moment, but as we look at it over a long span to 2030, we believe that we’ll have the ability to have battery EVs make up for about half of our sales,” he said. “However, as it’s the market that decides in the end, we’ll adapt flexibly to that.” Reuters with additional editing by Sean O’Meara Read more: South Korea’s Hyundai to Sell Vehicles on Amazon From 2024 China EV Sales Hit Record in October Amid Demand Slowdown Worry Hyundai, Kia Recall 3.37m US Vehicles Over Engine Fire Risks South Korea’s Kia to Use CATL Batteries in EVs Sold at Home Toyota Feels The Squeeze as it Extends Output Cut at China JV Sean O'Meara Sean O'Meara is an Editor at Asia Financial. He has been a newspaper man for more than 30 years, working at local, regional and national titles in the UK as a writer, sub-editor, page designer and print editor. A football, cricket and rugby fan, he has a particular interest in sports finance. You Might also Like Japan, South Korea Share Tech, Energy Tie-Up Ambitions India Approves Foxconn, Dell Investments in Domestic Tech Push South Korea’s Hyundai to Sell Vehicles on Amazon From 2024 China Not Doing Enough to Spark Property Turnaround: Analysts Electric Vehicles China EV Giant BYD to Build First Europe Plant in Hungary – FAS Vishakha Saxena 04 Nov 2023 China EV Sales Hit Record in October Amid Demand Slowdown Worry 14 Nov 2023 Hyundai Showcases its First High-Performance Electric Car 16 Nov 2023 Regulatory Filing Reveals First Images of Xiaomi’s Debut EV 16 Nov 2023 AF China Bond Popular News China-Russia Trade Booms as War Forces Moscow to Look East 10 Jun 2022 Iran Wants New Currency for China Bloc With 30% of Global GDP 07 Jun 2022 China Youth Unemployment to Hit 23%, Bank of America Says 06 Jun 2022 China Seizing Hi-Tech Share From US in ‘Win-Lose’ Battle 08 Jun 2022 Chinese Tech Firms in the Line of Fire From US Curbs – SCMP 04 Apr 2022 ABOUT AF Asia Financial News Group Asia Financial Index Group Capital Link International Ads and Partnerships About Us RESOURCES Index Tools Newsletters Your AF Careers Contact Us LEGAL + PRIVACY Copyright Legal & Privacy Terms & Conditions Privacy Policy Cookies Must Read Former VP of China’s Biggest Bank Latest to Face Graft Probe Regions China to Drive Development of AI, Robots to Boost Growth – SCMP Regions China EV Giant BYD to Build First Europe Plant in Hungary – FAS World Tags China Bonds US Categories AF Indexes Markets Fintech Energy Transport Health Regions Opinion DISCLAIMER Asia Financial is owned by Capital Link International Holdings Ltd, 902, Wilson House 19-27 Wyndham Street, Central, Hong Kong. www.capitallinkintl.com",
    "originSummary": [
      "Kia and Hyundai are confident that the demand for electric vehicles (EVs) will remain strong, despite concerns about inflation and higher interest rates.",
      "Executives from both companies are optimistic about EV sales, especially in the US, as their EV sales have been doubling year-over-year.",
      "Despite supply chain bottlenecks and pricing pressure from Tesla, the average price of a new EV in the US dropped to just over $50,000 in September. However, some industry experts question if there are enough new consumers to sustain the high demand for EVs."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Tesla Removes Resale Ban on Cybertruck, Raises Speculation on Production Volumes",
    "originLink": "https://www.autonews.com/sales/tesla-bans-reselling-cybertruck-then-reverses-course",
    "originBody": "Breadcrumb Home Sales Tesla flip-flops on Cybertruck resale ban Ahead of Cybertruck deliveries, Tesla banned buyers from flipping their vehicle within a year of purchase, then deleted the clause in the order agreement. November 19, 2023 12:00 AM 10 hours ago Nick Bunkley More Tweet Share Share Email Print The reversal of the Cybertruck resale ban added to the speculation about Tesla’s motivations. Tesla Inc. threatened to sue Cybertruck buyers for $50,000 if they resold the truck within a year, but it removed the clause last week after getting blowback over the unusual restriction. The reversal sparked even more speculation about Tesla's motivations, suggesting to some analysts that the electric vehicle maker headed by Elon Musk doesn't expect to produce large volumes of the Cybertruck, which it originally promised to release in 2021. Automakers rarely bar customers from reselling vehicles except when small production runs inflate prices on the secondary market. Ford Motor Co. sued wrestler John Cena in 2017 for flipping a GT supercar in less than a month; they eventually settled. \"Elon and company were very clearly viewing this as a limited-production vehicle,\" Stephen Beck, managing partner of consultancy cg42, told Business Insider. Tesla plans to deliver the first Cybertruck on Nov. 30. Ahead of that event, it added a Cybertruck-specific section to the order agreement on its website barring resale within a year of delivery. \"Tesla may seek injunctive relief to prevent the transfer of title of the Vehicle or demand liquidated damages from you in the amount of $50,000 or the value received as consideration for the sale or transfer, whichever is greater,\" the agreement said. \"Tesla may also refuse to sell you any future vehicles.\" The clause said owners who had a good reason to sell their Cybertruck could contact the company, which would then evaluate the request and either agree to buy it back — for the original price, minus mileage, wear and tear, and any repair costs — or allow someone else to buy it. Shortly after various media began reporting on the resale ban, the section was quietly deleted without explanation. RECOMMENDED FOR YOU October U.S. vehicle inventory rose to 2.4 million Letter to the Editor Send us a letter Have an opinion about this story? Click here to submit a Letter to the Editor, and we may publish it in print. Recommended for You October U.S. vehicle inventory rose to 2.4 million Honda lifts full-year earnings forecast on good foreign exchange, higher U.S. sales, better pricing Nissan quarterly profit doubles on robust gain in North America Sponsored Content: How dealerships and OEMs can leverage the power of vehicle connectivity Sponsored Content: BUY-SELL Q&A: How To Set a Record: Anatomy Of a Deal That Delivered Sign up for free newsletters Daily Summary (weekdays) Weekly Summary (Mondays) Breaking News Alerts (as needed) Yes, I'd like to receive email communications on editorial features, special offers, research and events and webinars from Automotive News. EMAIL ADDRESS Please enter a valid email address. Please enter your email address. Please verify captcha. Please select at least one newsletter to subscribe. See more newsletter options at autonews.com/newsletters. You can unsubscribe at any time through links in these emails. For more information, see our Privacy Policy. Digital Edition THIS WEEK'S EDITION See our archive",
    "originSummary": [
      "Tesla initially banned buyers of the Cybertruck from reselling the vehicle within a year of purchase but later removed the restriction due to public criticism.",
      "The reversal has raised questions and speculation about the production volumes of the Cybertruck.",
      "Automakers typically restrict resale when limited production causes inflated prices on the secondary market.",
      "The delivery of the Cybertruck is scheduled for November 30."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Tesla Cybertruck: Range, Variants, Features, and Pricing Revealed",
    "originLink": "https://www.torquenews.com/14335/tesla-cybertruck-complete-guide-what-we-know-so-far",
    "originBody": "The Tesla Cybertruck is about to release on November 30th, 2023. Here's everything we know so far including range, performance, battery, cost, motors, and safety. Posted: November 18, 2023 - 2:15PM Author: Jeremy Johnson The Cybertruck: Complete Guide To What We Know So Far The Cybertruck is about to release on November 30th, 2023, and we have the complete guide for everything you need to know about the Cybertruck. It's been a long 4 years from the Cybertruck unveil to now, and we believe this guide has the most information about the Cybertruck that you'll find anywhere. Range Recently, due to a user interface leak of the Cybertruck being shown while it was charging, we've been able to extrapolate the real world and EPA range from the Cybertruck. The Cybertruck variant in the video showed a real world range of 266.6 miles based on a 16-mile trip, taking the battery from 71% to 65%. However, it's important to note that this is generally not the EPA range, which is what Tesla will list for the vehicle. This is because Tesla factors in over 15 things when calculating its range and battery usage. Tesla's Navigation and Range Calculation System: 15 Things Calculated While You Drive To Give Your Range:https://t.co/Du9qmGHBzv$TSLA @Tesla @torquenewsauto #navigation #evs #driving #software #math #calculations pic.twitter.com/Pc4MVw0SJ6 — Jeremy Noel Johnson (@AGuyOnlineHere) November 14, 2023 I believe the EPA range is much higher in the variant shown in the video, and it could be as high as around 400 miles of range when you take out everything including excessive acceleration and climate controls being used, which quickly drain the batteries. It's possible the Cybertruck is going to be different from all the other Tesla vehicles in how it calculates range, in which case, I'd put this variant shown more at 300 to 350 miles of range. That would be surprising to me though since my Tesla Model 3 RWD has shown me differently and that it calculates range in a worse case scenario. My Model 3 RWD will often say I'm using, let's say, 10% when I start a trip to get to the end of it. By the end of the trip, I'll end up using only 7% because of my efficient driving, which gets me to the EPA range of the vehicle. For most people, you'll get closer to the real world range for everyday use, which includes all drains on the battery, including climate controls. I expect we'll see ranges between 300 and 500 miles across all the variants of the Tesla Cybertruck. The Tesla Cybertruck range was accidentally leaked with the latest screenshots of it charging:https://t.co/0W0wEKOyqC$TSLA @Tesla @torquenewsauto #cybertruck #evs #range pic.twitter.com/igmL0kTRJg — Jeremy Noel Johnson (@AGuyOnlineHere) November 15, 2023 Performance and Variants Elon Musk initially announced that there would be 3 variants of the Cybertruck: single-motor, dual-motor, and tri-motor. He later went on to say that there would be a quad-motor variant that would drive like a crab. I don't think we'll see a Cybertruck with four motors yet, though. We know that the Cybertruck will perform well when off-roading (more on that in a bit), but here's what we know about the performance of the Cybertruck. Elon Musk has said there will be a \"beast\" mode variant of the Cybertruck that will be able to go 0 to 60 mph in less than 3 seconds. Considering the weight of the Cybertruck at around 7,000 lbs., that will be quite a feat of engineering. Lower variants of the Cybertruck will be slower, and I expect performance to be 4.5 seconds for the dual-motor variant and for the single-motor variant, around 6.5 seconds. I also expect top speeds to be 110 mph in a single-motor variant, 120 mph in the dual-motor variant, and around 130 mph in the tri-motor variant. Batteries I would expect the battery size for the variants to be as such: Single-motor: 150 kWh Dual-motor: 175 kWh Tri-motor: 200 kWh or more Towing Elon Musk said that Cybertruck will be able to tow roughly 11,000 lbs. You can read more about some complex towing calculations based on battery kWh to further learn about the Cybertruck's towing capabilities. Seating The Cybertruck will seat two people in the front, with a center console unit separating them. There will be room for three people in the back. Legroom seems to be about on par with the Model Y. Cost The originally stated cost of the Cybertruck at the unveiling is most likely not going to be what the cost of the Cybertruck is at the upcoming delivery event. Tesla listed these costs at the unveiling: Single-motor: $39,990 Dual-motor: $49,990 Tri-motor: $69,990 If you simply take inflation into account over the last 4 years, you get an about 20% increase in costs. This is what I came up with when I researched macro trends and a variety of inflation calculators over the last 4 years. Inflation adjusted costs of the Cybertruck from unveiling: Single-motor: $47,988 Dual-motor: $59,988 Tri-motor: $83,988 I actually think the cost of the Cybertruck will fall pretty close to these numbers, and I'd like to see Tesla get the tri-motor variant to $79,990 in order to get it to qualify for the $7,500 U.S. tax credit. Look for the final prices to be $49,990, $59,990, and $79,990 for the single, dual, and tri motor variants. Steering We got word that the Cybertruck will have smooth turning of all 4 wheels when being operated. Not only that, the wheels will turn differently when you are going slow as when you are going fast. When you are going slow, the back wheels will turn in opposite directions. When you are going fast, the back wheels will turn in the same direction as the front wheels. Smooth and up close video of the Cybertruck turning using ALL 4 Wheels:https://t.co/cMAl8OesMb$TSLA @Tesla @torquenewsauto #cybertruck #evs #4wheelsteering #wow pic.twitter.com/238AfRSC55 — Jeremy Noel Johnson (@AGuyOnlineHere) November 12, 2023 Wraps and Colors The Cybertruck will come by default in its stainless steel silver color without any additional paint. However, we know that Tesla is now offering wraps for its vehicles, and I wouldn't be surprised to see a black wrap option offered to make the Cybertruck look like the Batmobile. Black wrapped Cybertruck looks like the Batmobile:https://t.co/JQkyigfTTt$TSLA @Tesla @torquenewsauto #batmobile #cybertruck #carwraps #cool pic.twitter.com/zgPeLarMkk — Jeremy Noel Johnson (@AGuyOnlineHere) November 4, 2023 I expect the cost of the Cybertruck wraps to be around $8,000 and to be an option that comes AFTER you buy your Cybertruck and configure your order. Tesla may even wait to release wraps, just to reduce the stress load of the initial launch. Software and Hardware The Cybertruck will come with Hardware 4 and a 48 volt architecture. This puts it at the cutting edge of Tesla technology. The Cybertruck should also be able to make use of v4 Superchargers, to give it a fast charging speed of anywhere between 250 kW to 350 kW. I expect there to be an epic sound system in the Cybertruck as well, with multiple subwoofers and speakers. It wouldn't surprise me to have the tri-motor variant have 22 speakers, 2 subwoofers, an amplifier, and the world's most amazing vehicle sound system. Tesla has been fairly quiet about the sound system, though. Off-Roading There have been videos showing the Cybertruck doing off-roading. In the latest discussion with Joe Rogan, Elon Musk said that he thinks the Cybertruck will be the best off-roading vehicle due to its high ground clearance and lack of having things underneath it that could be hit by rocks and damaged. Tesla Cybertruck - best off-roading truck according to Elon Musk as he shares with Joe Rogan the one thing that makes this so:https://t.co/PlORqn5uta$TSLA @Tesla @torquenewsauto #cybertruck #offroading #evs — Jeremy Noel Johnson (@AGuyOnlineHere) November 18, 2023 You'll have to be the judge of the best off-roading vehicle when looking at the videos of competitions between the Cybertruck, Rivian, and Ford-F150. For now, we see the Cybertruck as the current off-roading king. Safety The Tesla Cybertruck will be Tesla's safest vehicle ever produced. Its steel exoskeleton is bulletproof, and a compound arrow shot at it by Joe Rogan simply glanced off of it. The Tesla Cybertruck will come with Autopilot, and the option to purchase FSD. These are world-class software systems designed to increase safety. The Cybertruck steel exoskeleton can withstand bullets:https://t.co/IuKjJSLTY0$TSLA @Tesla @torquenewsauto #cybertruck #steel #evs pic.twitter.com/NruUsRYDuE — Jeremy Noel Johnson (@AGuyOnlineHere) October 21, 2023 Add-Ons There has been speculation over the years about add-ons for the Cybertruck. Because the release of this vehicle is going to be so complicated due to it being so different from any other Tesla vehicles, I don't think Tesla will offer many add-ons at first. Eventually, they may, such as adding solar panels and other accessories. That won't stop other companies from offering add-ons, though. One popular add-on is the Cyberlandr, which is a vertical camping trailer that starts compact and can be opened up as a camping compartment. I once did an article talking about if you could just live in a Cybertruck and a camper. I think this is a real possibility for those wanting to live as a digital nomad. There was talk of a secret Tesla Cybertruck accessories team that would manage add-ons such as winches, off-road lights, steel bumpers, camping equipment, and bike racks, but I haven't heard much more than that. This is the most comprehensive list I can think of, but you can be sure that I will add to it as I discover new things that should be added. In the meantime, please stay tuned for more articles and breaking Tesla news from me, and have a fantastic day! Was there anything I missed about the Cybertruck here? Are you looking forward to the delivery event as much as I am? Share this article with friends and family and on social media! Thank you so much for your support! Hi! My name is Jeremy Johnson, and I am a Tesla investor and supporter. I first invested in Tesla in 2017 after years of following Elon Musk and admiring his work ethic and intelligence. Since then, I've become a Tesla bull, covering anything about Tesla I can find, while also dabbling in other electric vehicle companies like Aptera. I cover Tesla and EV developments at Torque News. You can follow me on X.COM or LinkedIn to stay in touch and follow my Tesla news coverage. Image Credit, Tesla, Screenshot Auto Sector Stocks Automotive News Electric Vehicle News and Reviews Tesla Tesla Cybertruck Add new comment",
    "originSummary": [
      "The Tesla Cybertruck is scheduled for release on November 30th, 2023.",
      "It is expected to have a real-world range of 266.6 miles, potentially reaching an EPA range of 300 to 400 miles.",
      "The Cybertruck will come in three variants: single-motor, dual-motor, and tri-motor, with the tri-motor variant potentially reaching a top speed of 130 mph."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Transition to Electric Vehicles in US Faces Delays due to Range, Charging Concerns",
    "originLink": "https://www.barrons.com/articles/us-transition-to-electric-vehicles-faces-delays-9d62fa3c",
    "originBody": "FROM AFP NEWS US Transition To Electric Vehicles Faces Delays By Elodie MAZEIN November 18, 2023 Order Reprints Print Article A Tesla electric vehicle drives past the Tesla Inc Santa Monica Place store, in Santa Monica, California Patrick T. Fallon Text size The US transition to electric cars has hit a speed bump, with concerns about vehicle range and limited charging capacity adding to core affordability issues. Automakers in recent weeks have pushed back EV sales targets and delayed capital projects as they seek to reduce inventories of unsold EVs at dealerships. \"The slowdown in EV sales is much more pronounced than it is for other categories of vehicles and that isn't related to the economy,\" said Neil Saunders, managing director of GlobalData. \"The EV has a problem attached to it,\" he said. \"It's a much more difficult and complex purchase because of the range of the vehicles and the charging infrastructure.\" American consumers are accustomed to often-lengthy road trips for holidays or to visit friends and relatives, owing to the country's large size and limited public transit options. But so far, the network of EV charging stations remains dodgy, with many areas either lacking infrastructure or equipped with unreliable machines. More than three-quarters of drivers consider EVs reliable, according to a survey by the Consumer Technology Association (CTA), the organizer of the annual Consumer Electronics Show in Las Vegas. But there are also significant doubts among drivers surrounding the autos over inadequate charging infrastructure (36 percent), battery range (39 percent) and vehicle affordability (38 percent). The average EV sold in October for $51,762, some $13,000 below the year-ago level for the autos, but almost $4,000 above the average price of all autos. In Europe, the elevated price of gasoline adds an incentive that allows consumers there to overlook the lofty upfront cost of the vehicle. But that is less of a factor in the United States, where gas prices are only about half the level in France or Britain, according to Observatoire Cetelem 2024. Industry leaders such as Tesla Chief Executive Elon Musk have also pointed to increased borrowing costs as a drag after a series of Federal Reserve interest rate hikes over the last year and a half. Tesla remains a dominant player in EVs, accounting for more than 55 percent of the 873,000 EV autos sold in the first 10 months of 2023, according to industry researcher Kelley Blue Book. Ford Chief Executive Jim Farley predicted \"some bumpiness\" in the evolving US market. \"The dynamic changes in the market -- pricing, adoption rates, regulations -- are forcing us to further reduce the cost of our EVs,\" Farley said last month. Ford's rival and fellow Detroit giant General Motors recently pushed back until the end of 2025 a plan to convert its Orion, Michigan plant for EVs \"to better manage capital investment while aligning with evolving EV demand,\" the company said last month. \"In addition, we have identified engineering improvements that we will implement to increase the profitability of our products,\" GM said. Ford and Tesla too are looking to simplify their manufacturing processes to limit costs. \"Reducing the cost of our vehicles is our top priority,\" said Tesla Chief Financial Officer Vaibhav Taneja. For its futuristic Cybertruck, which is expected to commence deliveries before the end of 2023, Tesla is \"doing everything possible to simplify that vehicle\" to reach efficiency \"that is unheard of in the auto industry,\" Musk said. Ford has also vowed to tweak its vehicle design and manufacturing in order to reduce complexity. But the results are still unproven, according to Deutsche Bank analyst Emmanuel Rosner. \"What concerns us most is that automakers haven't cracked the economics to make an easy, affordable EV,\" Rosner said on CNBC. Washington has mobilized in favor of EVs during the presidency of Joe Biden, approving $7.5 billion in funds for EV chargers and extending tax credits up to $7.500 for consumer purchases of the autos. The Biden administration wants 50 percent of vehicles sales to be electric by 2030. \"The politicians wanted it to happen overnight, but you can't just set arbitrary targets, you've got to make sure the infrastructure's there,\" said Saunders of GlobalData. \"The long-term trajectory is probably good for EVs,\" but \"it's something that's much slower-going,\" he predicted. The Barron's news department was not involved in the creation of the content above. This story was produced by AFP. For more information go to AFP.com. © Agence France-Presse",
    "originSummary": [
      "The transition to electric vehicles (EVs) in the US is facing delays due to concerns about vehicle range, limited charging capacity, and high costs.",
      "Automakers have pushed back EV sales targets and delayed capital projects to reduce inventories.",
      "Consumers have doubts about the reliability, charging infrastructure, battery range, and affordability of EVs, which contributes to the slow transition."
    ],
    "commentBody": "",
    "commentSummary": ["The summary for this post is empty."],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Lucid Motors Unveils the Gravity: A Game-Changer in SUV Range",
    "originLink": "https://spectrum.ieee.org/lucid-motors-gravity-ev-suv",
    "originBody": "TRANSPORTATION NEWS Lucid Floats the Gravity: A Hail Mary in SUV Form But does even a 700-kilometer range impress today's consumers? LAWRENCE ULRICH21H6 MIN READ Lucid Motors' new Gravity, at least judging by announced its just-announced specs, is one stately, streamlined, electron-sipping SUV. LUCID MOTORS",
    "originSummary": [
      "Lucid Motors has revealed its latest vehicle, the Gravity SUV, featuring a sleek design and an impressive 700-kilometer range.",
      "Although the range is notable, it is unclear if it will genuinely impress contemporary consumers.",
      "Further details regarding the vehicle's specifications and pricing are not provided in the given text."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Could Tesla Add Hybrids to Counter EV Slowdown in the USA?",
    "originLink": "https://www.autospies.com/news/index.aspx?submissionid=119026",
    "originBody": "AutoSpies.comNewsletterAutomotive News Photo Galleries Could The Slowdown In EV Interest In The USA FORCE Tesla To Add Hybrids To Their Product Mix? And IF They Offered Them, Would They Sell MORE That The Full Electrics? Agent001 submitted on 11/18/2023 Auto Spies Photos Timestamp: 9:41:08 PM Views : 2,174Category: New CarsSource: www.autospies.com SHARE THIS ARTICLE Tesla, renowned for its groundbreaking advancements in electric vehicle technology, has long been a pioneer in the automotive industry. However, the question arises: would a hybrid version of Tesla's products outsell their full electric counterparts? The potential for a hybrid Tesla to outsell its electric models is a compelling notion, backed by several factors. Firstly, consumer demand for eco-friendly vehicles continues to grow, but there remains a segment of the market hesitant to fully embrace electric vehicles (EVs) due to concerns about charging infrastructure and range anxiety. A hybrid option combining both electric and traditional fuel capabilities could cater to these apprehensions. By offering the flexibility of using gasoline when needed while still providing the efficiency of an electric motor, Tesla could attract a broader audience, including those not yet ready to transition entirely to electric vehicles. Moreover, a hybrid Tesla could appeal to a global market where infrastructure limitations hinder the widespread adoption of EVs. Regions with underdeveloped charging networks or lacking sufficient access to renewable energy sources may find a hybrid option more practical and accessible. This potential to tap into markets previously restrained by infrastructure issues could significantly expand Tesla's customer base. Additionally, introducing a hybrid model aligns with Tesla's ethos of accelerating the world's transition to sustainable energy. While their electric vehicles have already made significant strides in reducing carbon emissions, a hybrid version could serve as a bridge for consumers gradually transitioning away from internal combustion engines. However, this proposition raises pertinent questions about potential drawbacks such as increased complexity, compromised performance, and the risk of diluting Tesla's brand identity as a leader in all-electric technology. In conclusion, while the idea of a hybrid Tesla may seem appealing, the success of such a venture remains speculative. Would a hybrid version outsell the full electric models, catering to a wider audience and circumventing infrastructure limitations? Only time and market response can provide a conclusive answer. Nonetheless, it prompts us to consider whether a hybrid option could be the key to further accelerating the global shift toward sustainable transportation. Will the slowdown of FULL electric adoption force them to consider it? After all, a HYBRID Cybertruck and a follow up CyberSUV sound like a winners to us on paper. Discuss. Most Viewed Photos on AutoSpies.com RIGHT NOW! 2023 Detroit Auto ShowSpy Photos Fall 2023Latest Spy Photos Fall 2023All-New Toyota Land CruiserDetroit Auto Show-A Look Back LAST 5 GALLERIES About the Author \"They are being watched. We work in secret. They'll never find us.\" — Agent001 (View Profile) Submit an article Photo Galleries Latest Photo Galleries Detroit Auto Show Spy Photos Fall 2023 All-New Toyota Land Cruiser Detroit Auto Show-A Look Back RAM 1500 Revolution Mercedes-AMG S 63 E PERFORMANCE LA Auto Show Porsche 911 Dakar Concept 2024 Sierra EV Spy Photos Fall 2022 Ford Super Duty 2024 Ford Mustang Dodge Charger Daytona SRT Concept Dodge Hornet Ford Bronco Heritage Editions 2024 Chevrolet Blazer EV Toyota Crown Honda HR-V Spy Photos Summer 2022 The BMW M3 Edition 50 Year BMW M The New BMW 3-Series Spy Photos Spring 2020 Range Rover Sport Lexus RZ 2022 NAIAS NY Auto Show CyberRodeo Tesla Hightlights Toyota GR Corolla Maserati Grecale SUV Mercedes-AMG GT 63 and GT 63 S 4-Door Coupe Acura Integra Toyota Sequoia 2022 Toyota Auto Salon 2022 Toyota Tundra Capstone BMW Concept M Next Generation Ford Ranger 2021 LA Auto Show LAAS2021 2022 Toyota RAV4 Spy Photos Fall 2021 2021 SEMA Show The All New Mercedes SL 2022 Range Rover 2022 GMC Sierra And Denali 2022 Lexus LX600 2022 Jeep Grand Cherokee 2022 Ram And Jeep Wrangler Willys Recon 2022 Acura RDX 2022 Toyota Tundra 2022 Lexus Changes 2022 Lexus IS500 Chevrolet Silverado ZR2 More photo galleries Latest Articles Could The Slowdown In EV Interest In The USA FORCE Tesla To Add Hybrids To Their Product Mix? And IF They Offered Them, Would They Sell MORE That The Full Electrics? DO WE SMELL FYRE? Vegas F1 Grand Prix Faces Potential 'Fyre Festival' Parallel Amidst Lawsuit and Chaos. Want To Know WHY EV's Cost SO MUCH To Insure? Look How Much It Costs To FIX A Rivian After A 20MPH Collision. RUMOR! WHAT? Tesla To Only Deliver HOW MANY Cybertrucks At The Launch Event? 2025 Cadillac Optiq To Slot In Below Lyriq EV NTSB Pushes Mandate To Limit Speeds In All New Cars More Swedish Unions Are Lining Up In Fight Against Tesla UAW Members BARELY Ratify New Contract With GM Judge Rules That Hyundai/Kia Must Answer Insurers In Court Over Theft Losses Fisker Debuts 2025 Pear Electric SUV With A See Through A-Pillar Volkswagen Recalls EVERY ID.4 EV It Ever Sold In The US Tesla Preparing A Feature Packed FSD Update Tesla Model 3 Is The Most Failed Vehicle In German TÜV Inspections Porshe Or Bentley? Which Car To Buy At Age 18? Subaru, BMW and Porsche Drivers Have One Thing Common - Can You Guess What It Is? MINI Considers Creating Own Electric Racing Series Porsche Prepares To Fire Up Production Of The Electric 718 Boxster And Macan 2025 Subaru Forester 4x4 Takes On The Urban Jungle As A Hybrid People Say The CyberTruck Is UGLY. HOLD OUR BEER! ENTER, The Aitekx RoboTruck! SHUT THE PLUG DOOR! DEAD BEFORE ARRIVAL? VW ID Buzz Not Even Out Yet In the USA And People Are ALREADY Finding Ways To HATE On It! BREAKING! Las Vegas F1 Practice CANCELLED Almost Just After It Started! Ferrari DAMAGED By The TRACK Itself? RAISING THE RED FLAG? Does Xi's Chinese BEAST Have Biden FRIED? YOU DECIDE! Elon Musk Accused Of Anti-Semitism In Tweet. Do You AGREE Or Was It Taken Out Of Context? REVIEW: 2025 Kia Sorento. Look What Slipped UNDER Radar! Now, BETTER Looking Inside And Out Than Their Own TELLURIDE? Buy Your Next Hyundai On AMAZON? PRIME Move For The Carmaker Or Misstep? Brothel Offering FREE SEX For The Las Vegas Race Drivers. Someone Should Tell Them F1 Isn't A Command, It Means FORMULA 1! BMW Will PAY Owners To Charge Their Vehicles IIHS \"Experts\" Spend Money On Study To Determine If Big SUVs And Trucks Are More Dangerous To Pedestrians Waymo Faces Uphill Battle From Unions In New York for Self Driving Services Tesla Warns Investors To Brace For New Growth Wave More latest news AutoSpies.com About Us Contact Us Advertising Privacy Policy Terms of Use Development and hosting by T-Tech Solutions LLC",
    "originSummary": [
      "Tesla is considering adding hybrid vehicles to their product lineup in response to a decline in electric vehicle (EV) interest in the USA.",
      "A hybrid option could appeal to a wider audience who have reservations about EVs due to charging infrastructure and range anxiety concerns.",
      "However, there are challenges such as increased complexity and the potential risk of diluting Tesla's brand identity as an all-electric leader. The market response will determine the success of a hybrid Tesla."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  },
  {
    "title": "Electric Bikes Lead the Charge, Lucid Gravity SUV, Tesla CEO Step Aside: EV and Climate Change News",
    "originLink": "https://www.evworld.com/index.php?rssID=58190",
    "originBody": "info@evworld.com Human Selected and Curated EVWORLD.COM © 25 Years of the Future In Motion™ Home NEWS Synopsis RSStream e-Videos TRENDING ARCHIVES Original Audio Interviews Original Video Interviews Podcast [NEW] Selected Youtube Videos My Perspective Blog Wayback Machine ABOUT About Supporters 19 Nov 2023 14:39:04 UTC EDITOR'S CHOICE The World's 280 Million Electric Bikes And Mopeds Are Cutting Demand For Oil Far More Than Electric Cars 17 Nov 2023Synopsis \"...there were over 20 million electric vehicles and 1.3 million commercial EVs such as buses, delivery vans and trucks...these numbers of four or more wheel vehicles are wholly eclipsed by two- and three-wheelers. There were over 280 million electric mopeds, scooters, motorcycles and three-wheelers on the road last year. \"If you commute on an e-bike 20km a day, five days a week, your charging cost would be about $20 – annually.\" Read Full Story The Lucid Gravity SUV Brings Big Range But Uses Half the Battery of Mainstream Carmakers 17 Nov 2023Synopsis \"The truck's new platform comes backed by an updated version of the brand’s 900V EV architecture, which includes even more powerful versions of their compact motors...The sedan offers two battery packs...measuring 92 kWh and 112 kWh \"Lucid says the SUV will arrive with a projected range of more than 440 miles per charge. Thanks to that 900V architecture, it'll only take around 15 minutes to add 200 miles of range back into that pack. Read Full Story New Report Charts the Path to an American-Made Energy Storage Future 17 Nov 2023Synopsis \"SEIA's report, 'Energizing American Battery Storage Manufacturing,' is one of the first comprehensive examinations of the challenges and opportunities facing domestic energy storage production following the passage of the Inflation Reduction Act (IRA). \"U.S. demand for battery energy storage systems (BESS) is likely to increase over six-fold from 18 GWh to 119 GWh by 2030...production incentives could reduce energy storage costs by 40% or Read Full Story Elon Musk Has Effectively 'Stepped Aside' As Tesla CEO With 'OutrageouS' X Comments, Long Time Tesla Bull Says 17 Nov 2023Synopsis \"Ross Gerber, president and CEO of Gerber Kawasaki Wealth & Investment Management...told CNBC Thursday Musk has 'already stepped aside' as CEO of the electric car company. \"None of his actions are to benefit Tesla. He thinks in some weird world that what he says matters, but what he's really doing is destroying everything he built.\" Gerber wrote on X that he plans to ditch his Model Y Tesla for a Rivian due to Musk's statements.\" Read Full Story Big Oil's Big Lies Are Catching Up With Them 17 Nov 2023Synopsis \"The new polling reveals that 77% of Americans agree that if oil and gas companies misled the public about climate impacts, they should help cover resulting climate costs. This consensus crosses political divisions. Agreement spans 91% of Democrats, 75% of Independents, and 63% of Republicans \"The costs of warming are no longer abstract statistics...In 2021 extreme weather fueled by climate change inflicted over $165 billion in damages nationwide.\" Read Full Story Porsche Starts Preparing To Build 718 Boxster And Macan EVs 16 Nov 2023Synopsis €250 million\"...renovation of its Zuffenhausen factory in Germany to accommodate production of the upcoming 718 electric sports car and powertrains for the Macan EV. \"Porsche has encountered significant delays in expanding its electrified portfolio, with the Macan EV pushed back multiple times - allegedly due to software issues in the larger VAG electric portfolio...Porsche has yet to commit to phaseout dates for any of its ICE vehicles.\" Read Full Story Roosevelt Institute 2015 Report Catalyst For A Surprisingly Progressive Shift in Economics 16 Nov 2023Synopsis \"...the Roosevelt Institute released a report in 2015 that called for a new approach to economic policy. It was unabashedly progressive \"The report called for higher taxes on the rich, a higher minimum wage, more regulation of Wall Street, more support for labor unions, more aggressive antitrust enforcement and more government investment in economic growth. \"the old economic approach hasn’t worked very well for most Americans...\" Read Full Story Biden's Fifth National Climate Assessment Found These 5 Key Ways Climate Change Is Affecting the Entire U.S. 16 Nov 2023Synopsis Fifth Climate Assessment...released by the Biden administration drives home a warning that scientists have been issuing for years...nowhere in the U.S. is safe from the effects of climate change...While record cold events have declined...the frequency, intensity and duration of extreme heat have increased\" \"Despite an increase in adaptation actions across the country, current adaptation efforts and investments are insufficient to reduce today's climate-related risks and keep pace with future changes in the climate.\" Read Full Story Even The Vatican Is Going All-Electric After VW Scores Deal To Replace Entire Fleet With EVs 16 Nov 2023Synopsis \"Vatican City State...will replace its entire fleet of vehicles with EVs by 2030. Volkswagen will deliver fully electric cars, including the ID.3 and ID.4...to support its transition to EVs...The automaker will deliver just under 40 fully electric vehicles, including the ID.3, ID.4 electric SUV, and ID.5. Further electric models will be delivered at later stages until the entire fleet has transitioned to fully electric...\" Read Full Story All the Metals We Mined In 2022 In One Visualization 16 Nov 2023Synopsis \"...infographic visualizes all 2.8 billion tonnes of metals mined in 2022 and highlights each metal’s largest end-use using data from the United States Geological Survey...Iron ore dominates the metals mining landscape, comprising 93% of the total mined. In 2022, 2.6 billion tonnes of iron ore were mined, containing about 1.6 billion tonnes of iron. \"Despite representing less than 1% of all the metals mined, technology metals have been on the news over the last few years...\" Read Full Story NEXT 10 CURRENT PODCAST Tesla FSD news - Cadillac Optiq - Solar keeps getting better SEARCH RSSTREAM 37 New Postings In Past 24 Hours EV World's new RSStream is an RSS (Real Simple Synication) feed continuously updated daily. It provides on-demand links to scores of EV world-relevant news items from around the globe to any number of RSS readers, from dedicated apps to browser plugins. Chinese electric car maker BYD is about to steal Tesla crown. Here is why it is winning the race. Category:finance Region:AsiaPacific Date:18 Nov 2023 New BYD Dolphin: Dimensions and boot of the Chinese electric car Category:review Region:AsiaPacific Date:18 Nov 2023 Hyundai And Lucid Target Tesla At The L.A. Auto Show Category:mobility Region:NoAmerica Date:18 Nov 2023 Fisker delivers over 100 cars in a day with new distribution strategy Category:mobility Region:NoAmerica Date:18 Nov 2023 Daihatsu Me:Mo is an EV minicar that can be fitted with 3D-printed parts Category:mobility Region:AsiaPacific Date:18 Nov 2023 Why Revel Shut Down Its Moped Service in New York Category:mobility Region:NoAmerica Date:18 Nov 2023 Emeya: Is This Luxury Electric Sedan Really A Lotus? Category:mobility Region:Europe Date:18 Nov 2023 ndian carmakers up in arms against duty cuts on high-end EVs for Tesla & co Category:policy Region:IndoAsia Date:18 Nov 2023 These dealers love their EVs. They just do not know how to convince shoppers. Category:finance Region:NoAmerica Date:18 Nov 2023 Elon Musk started a price war that Tesla cannot win Category:finance Region:Global Date:18 Nov 2023 GM reorganizes BrightDrop commercial EV unit, business head leaving Category:mobility Region:NoAmerica Date:18 Nov 2023 Why Elon Musks antisemitism is a national security risk Category:policy Region:NoAmerica Date:18 Nov 2023 Staten Island is not the only area in New York to question controversial battery energy storage sites Category:policy Region:NoAmerica Date:18 Nov 2023 Reliability v. sustainability: Inside the debate over the EPA’s proposed carbon rules Category:policy Region:NoAmerica Date:18 Nov 2023 EVgo To Build Charging Stations Faster, Offer Free Charging To Hertz Customers Category:energy Region:NoAmerica Date:18 Nov 2023 EV industry is the only sector in the world on track to meet climate goals - Autoblog Category:mobility Region:Global Date:18 Nov 2023 Exxon Is Trying to Find the Guy Who Did Climate Change Category:finance Region:Global Date:18 Nov 2023 Kia Pushing Affordability with EV3, EV4 Concepts Shown in LA Category:finance Region:NoAmerica Date:17 Nov 2023 Hyundai and Kia are pulling ahead with strong EV demand despite rival concerns Category:finance Region:AsiaPacific Date:17 Nov 2023 Guangzhou Auto Show roundup: BEV debuts from XPeng, ZEEKR, Li Auto, BYD, and more Category:mobility Region:AsiaPacific Date:17 Nov 2023 Tesla luxury rival unveils low-priced entry-level electric vehicle Category:mobility Region:AsiaPacific Date:17 Nov 2023 Musk touched the third rail, investor frustration reaching boiling point: Wedbushs Dan Ives Category:finance Region:NoAmerica Date:17 Nov 2023 Elon Musk antisemitic tweet angers Tesla investors, with calls for him to be suspended Category:policy Region:NoAmerica Date:17 Nov 2023 Popular car of the year wins the title again after 20 years Category:mobility Region:AsiaPacific Date:17 Nov 2023 GM Chevy Silverado EV lands in China in first overseas debut Category:mobility Region:AsiaPacific Date:17 Nov 2023 NEXT 25 4872511 Get In Touch Papillion, Nebraska, USA info@evworld.com SUPPORT EVWORLD Become a patron and help spread the good news of the world of electric vehicles. Become EVWorld Patron! Newsletter Not yet ready for primetime. Sign Up © EVWORLD.COM. All Rights Reserved. Design by HTML Codex Privacy Terms FAQs Help",
    "originSummary": [
      "Electric bikes and mopeds are reducing the demand for oil more than electric cars, as per multiple articles on electric vehicles (EVs) and climate change.",
      "The Lucid Gravity SUV is highlighted for its features in one of the articles, along with a report on American-made energy storage.",
      "Elon Musk stepping aside as Tesla CEO, the impact of big oil's lies, and Porsche's preparation for building EVs are also discussed in the summary.",
      "The summary mentions a progressive shift in economics, the effects of climate change in the US, and the Vatican's transition to EVs.",
      "It also refers to a visualization of metals mined in 2022 and provides links to recent EV-related news articles."
    ],
    "commentBody": "",
    "commentSummary": [],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1700404734155
  }
]
