[
  {
    "id": 38394364,
    "title": "ஆப்பிள் டெவலப்பர் கணக்கை நீக்கியது, சட்டப் போராட்டம் மற்றும் இழப்புகளைத் தூண்டியது",
    "originLink": "https://seraleev.notion.site/Our-developer-account-was-removed-by-Apple-and-they-haven-t-paid-out-108-878-b61192711c74487480373badc70d42c0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394364",
    "commentBody": "",
    "originSummary": [
      "புகைப்படம் மற்றும் வீடியோ பயன்பாடுகளின் டெவலப்பரான சரஃபான் மொபைல் லிமிடெட், அவர்களின் ஆப்பிள் டெவலப்பர் கணக்கை மூடியது, இது நிறுவனத்திற்கும் அதன் ஊழியர்களுக்கும் நிதி இழப்புகள் மற்றும் சிரமங்களுக்கு வழிவகுத்தது.",
      "இந்த மூடல் காரணமாக 108,878 டாலர் வருவாய் ஈட்டப்பட்டுள்ளது, இது சராஃபான் மொபைல் லிமிடெட் மீட்க முயற்சிக்கிறது.",
      "ஆப்பிள் தங்கள் டெவலப்பர் நிரல் உரிம ஒப்பந்தத்தை மீறியதை கணக்கை மூடுவதற்கான காரணமாக மேற்கோள் காட்டியது, ஆனால் தீர்வுக்கான குறிப்பிட்ட விவரங்கள் அல்லது படிகளை வழங்கவில்லை. சரஃபான் மொபைல் லிமிடெட்டின் மேல்முறையீடு நிராகரிக்கப்பட்டது."
    ],
    "commentSummary": [
      "டெவலப்பர் கணக்குகளை நீக்குதல் மற்றும் போலி மதிப்புரைகள் பற்றிய ஊகங்கள் உள்ளிட்ட அதன் பயன்பாட்டு சுற்றுச்சூழல் அமைப்பின் மீதான ஆப்பிளின் கட்டுப்பாடு குறித்த பல்வேறு விவாதங்களை இந்த தொகுப்பு உள்ளடக்கியது.",
      "சிறந்த மிதப்படுத்தல் மற்றும் வெளிப்படைத்தன்மையின் தேவை, பக்க ஏற்றுதல் மற்றும் மூன்றாம் தரப்பு பயன்பாட்டு ஸ்டோர்களை அனுமதிப்பது குறித்த விவாதம், அடக்குமுறை தொழில்நுட்பம் மற்றும் கண்காணிப்பு பற்றிய கவலைகள் மற்றும் திறந்த ஓஎஸ் தளங்களின் சாத்தியமான அபாயங்கள் ஆகியவை தலைப்புகளில் அடங்கும்.",
      "ஆப் ஸ்டோர்கள் மற்றும் அவற்றின் கொள்கைகளுக்கு இடையிலான ஒப்பீடுகள், ஆப் ஸ்டோரில் டெவலப்பர்கள் எதிர்கொள்ளும் சவால்கள், போலி மதிப்புரைகள் மற்றும் கட்டண சேவைகளின் மதிப்பு, கணக்கு மூடல்கள் மற்றும் வெளிப்படைத்தன்மையின்மை குறித்த கவலைகள் மற்றும் தளக் கட்டுப்பாட்டில் உள்ள அபாயங்கள் மற்றும் கொள்கைகள் ஆகியவை விவாதங்களில் அடங்கும்."
    ],
    "points": 685,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1700756182
  },
  {
    "id": 38397817,
    "title": "விளம்பரங்களைத் தடுக்க பயனர்கள் புதிய வழிகளைக் கண்டுபிடிப்பதால் யூடியூப் பின்னடைவை எதிர்கொள்கிறது",
    "originLink": "https://old.reddit.com/r/webdev/comments/181vbmk/youtube_is_now_blocking_ad_blockers_so_i_just/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38397817",
    "commentBody": "",
    "originSummary": [
      "ரெட்டிட் நூல் யூடியூப் மற்றும் ட்விச் போன்ற தளங்களில் விளம்பரங்களைத் தவிர்ப்பதற்கும் தடுப்பதற்குமான முறைகள் மற்றும் கருவிகளை ஆராய்கிறது, இது ஊடுருவும் விளம்பரங்களுடன் பயனர்களின் விரக்தியால் தூண்டப்படுகிறது.",
      "பயனர்கள் உலாவல் அனுபவத்தை மேம்படுத்துவதற்கான வழிகளைப் பற்றி விவாதிக்கிறார்கள் மற்றும் விளம்பரதாரர்கள் மற்றும் உள்ளடக்க உருவாக்குநர்கள் மீது விளம்பர-தடுப்பான்களின் தாக்கத்தை விவாதிக்கிறார்கள்.",
      "யூடியூப் வீடியோக்களை விளம்பரமின்றிப் பார்க்க உதவும் புதிய உலாவி நீட்டிப்பைப் பற்றி பயனர்கள் அறியும்போது உற்சாகமும் நேர்மறையான பின்னூட்டமும் எழுகின்றன."
    ],
    "commentSummary": [
      "யூடியூப்பில் விவாதம் விளம்பரத் தடுப்பு, உள்ளடக்க உருவாக்குநர்கள், மாற்று தளங்கள் மற்றும் விளம்பரத் தடுப்பின் நெறிமுறைகள் உள்ளிட்ட பல்வேறு தலைப்புகளை உள்ளடக்கியது.",
      "விளம்பரங்களைத் தவிர்ப்பதற்கான உத்திகள், பார்க்கும் அனுபவத்தில் விளம்பரங்களின் தாக்கம் மற்றும் YouTube இல் விளம்பரங்களின் செயல்திறன் பற்றிய உரையாடல்களில் பயனர்கள் ஈடுபடுகிறார்கள்.",
      "தரவு சேகரிப்பு, போட்டி, தணிக்கை, விளம்பரத்தில் செயற்கை நுண்ணறிவின் சாத்தியமான எதிர்காலம் மற்றும் YouTube இல் தனிப்பயனாக்கப்பட்ட விளம்பரங்களை செயல்படுத்துவதற்கான சவால்கள் ஆகியவை விவாதத்தின் பிற புள்ளிகளில் அடங்கும்."
    ],
    "points": 532,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1700775206
  },
  {
    "id": 38393237,
    "title": "உத்தரவாதமற்ற தொலைபேசி பதிவு தேடல்களுக்கு அமெரிக்க அரசாங்கம் ஏடி அண்ட் டிக்கு பணம் செலுத்துகிறது: கவலைகளை எழுப்புகிறது",
    "originLink": "https://www.theregister.com/2023/11/22/wyden_hemisphere_letter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393237",
    "commentBody": "",
    "originSummary": [
      "செனட்டர் ரான் வைடன் அரைக்கோளத் திட்டம் குறித்து கவலைகளை வெளிப்படுத்தியுள்ளார், இது அமெரிக்க சட்ட அமலாக்க முகமைகளை வாரண்ட்கள் இல்லாமல் டிரில்லியன் கணக்கான தொலைபேசி பதிவுகளைத் தேட அனுமதிக்கும் ஒரு ரகசிய கண்காணிப்பு திட்டமாகும்.",
      "இந்த திட்டத்தில் ஏடி அண்ட் டி 1987 ஆம் ஆண்டிற்கு முந்தைய தொலைபேசி பதிவுகளுக்கான அணுகலை வழங்குகிறது மற்றும் தினசரி நான்கு பில்லியன் அழைப்பு பதிவுகள் சேர்க்கப்படுகின்றன, இந்த அணுகலுக்கு வெள்ளை மாளிகையின் தேசிய மருந்து கட்டுப்பாட்டு கொள்கை அலுவலகம் பணம் செலுத்துகிறது.",
      "வைடன் இந்த திட்டத்தைப் பற்றிய கூடுதல் தகவலுக்கு அழைப்பு விடுத்துள்ளது மற்றும் அதன் சட்டப்பூர்வத்தன்மையை கேள்விக்குள்ளாக்கியுள்ளது, ஏனெனில் இது \"சட்ட அமலாக்க உணர்திறன்\" என்று நியமிக்கப்பட்டுள்ளது மற்றும் கூட்டாட்சி தனியுரிமை தாக்க மதிப்பீட்டிற்கு உட்பட்டது அல்ல."
    ],
    "commentSummary": [
      "இந்த விவாதம் அரசாங்க கண்காணிப்பு மற்றும் தனியுரிமை மீறல்கள் மற்றும் சட்ட அமலாக்கத்திற்கான பொறுப்புணர்வின்மை குறித்த கவலைகளை எழுப்புகிறது.",
      "வாரண்ட் இல்லாமல் தொலைபேசி பதிவுகளை அணுகுவது, மெட்டாடேட்டாவைப் பயன்படுத்துவது மற்றும் அதிகாரத்தை துஷ்பிரயோகம் செய்வது போன்ற சிக்கல்களை இது ஆராய்கிறது.",
      "நான்காவது திருத்தம், மறைகுறியாக்கப்பட்ட செய்தியிடல் பயன்பாடுகள் மற்றும் தனிப்பட்ட தனியுரிமை மற்றும் அரசாங்க கண்காணிப்புக்கு இடையிலான சமநிலை போன்ற தலைப்புகளையும் இந்த உரையாடல் பேசுகிறது."
    ],
    "points": 439,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1700750593
  },
  {
    "id": 38392277,
    "title": "போலியோ ஒழிப்பு: திரும்புவதைத் தடுத்தல் மற்றும் சாத்தியமான நன்மைகள்",
    "originLink": "https://www.nature.com/articles/d41586-023-03602-5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392277",
    "commentBody": "",
    "originSummary": [
      "போலியோவை ஒழிப்பதற்கான உலகளாவிய பிரச்சாரம் கிட்டத்தட்ட வெற்றிகரமாக உள்ளது, ஆனால் ஒழிக்கப்பட்ட பிறகு ஆய்வகங்கள் மற்றும் தனிநபர்களில் வைரஸ் நீடிப்பது குறித்து கவலைகள் உள்ளன.",
      "போலியோ ஒழிப்பு முயற்சிகள் சவாலாக உள்ளன, ஏனெனில் வைரஸின் திறன் மக்களை அமைதியாக பாதிக்கிறது மற்றும் வாய்வழி போலியோ தடுப்பூசி (ஓ.பி.வி) திரும்பப் பெறும்போது வைரஸ் மீண்டும் தோன்றும் அபாயம் உள்ளது.",
      "ஒழிப்பிற்குப் பிறகு போலியோ மீண்டும் வருவதைத் தடுக்க, அதிக மக்கள்தொகை நோய் எதிர்ப்பு சக்தி, வலுவான கண்காணிப்பு, சிறந்த ஆய்வக உயிர் பாதுகாப்பு மற்றும் நேரடி வைரஸ் இல்லாமல் மாற்று தடுப்பூசிகளை உருவாக்குவது முக்கியம்."
    ],
    "commentSummary": [
      "பாகிஸ்தானில் சி.ஐ.ஏ தலையீடு மற்றும் கலாச்சார தடைகள் உட்பட போலியோவை ஒழிப்பதில் முன்னேற்றம் மற்றும் சவால்கள் குறித்து இந்த கட்டுரை விவாதிக்கிறது.",
      "போலியோ தடுப்பூசிக்கு காப்புரிமை பெறுவதற்கான முடிவு, போலியோவால் ஏற்படும் பக்கவாதத்திற்கு மருந்து கண்டுபிடிப்பது, சுகாதாரம் மற்றும் நீர் உள்கட்டமைப்பிற்கு வளர்ந்த நாடுகள் உதவுவதன் முக்கியத்துவம் போன்ற பல்வேறு தலைப்புகளில் உரையாடல் அடங்கும்.",
      "அரசாங்க செலவினங்கள், மக்கள் தொகை பெருக்கம், தடுப்பூசி செயல்திறன், சதி கோட்பாடுகள் மற்றும் பாகிஸ்தானில் தடுப்பூசி வெளியீட்டை பாதிக்கும் ஒசாமா பின்லேடனைக் கொல்லும் நெறிமுறைகள் குறித்து விவாதங்கள் உள்ளன."
    ],
    "points": 418,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1700744421
  },
  {
    "id": 38392931,
    "title": "லினக்ஸ் சமூகம் விளையாட்டு வளர்ச்சியில் பிழை அறிக்கைகளில் 38% க்கும் அதிகமான பங்களிப்பை வழங்குகிறது (2021)",
    "originLink": "https://old.reddit.com/r/gamedev/comments/qeqn3b/despite_having_just_58_sales_over_38_of_bug/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392931",
    "commentBody": "",
    "originSummary": [
      "லினக்ஸில் விளையாட்டு மேம்பாட்டுக்கு லினக்ஸ் சமூகத்திலிருந்து பிழை அறிக்கையின் நன்மைகளைப் பற்றி இடுகை விவாதிக்கிறது.",
      "இது விளையாட்டு வளர்ச்சிக்கு லினக்ஸைப் பயன்படுத்துவதன் சவால்கள் மற்றும் நன்மைகளை ஆராய்கிறது, வெவ்வேறு வன்பொருள் மற்றும் கட்டமைப்புகளில் சோதனையின் முக்கியத்துவத்தை வலியுறுத்துகிறது.",
      "திறந்த மூல குறியீடு மற்றும் பிழை அறிக்கைகளின் சாத்தியமான நன்மைகள், அத்துடன் லினக்ஸ் கேமிங் சமூகத்தின் நேர்மறையான அனுபவங்கள் மற்றும் ஆதரவு ஆகியவையும் முன்னிலைப்படுத்தப்படுகின்றன."
    ],
    "commentSummary": [
      "லினக்ஸ் பயனர்கள் தங்கள் தொழில்நுட்ப புரிதல் மற்றும் பிழை டிராக்கர்களுக்கான அணுகல் காரணமாக விண்டோஸ் பயனர்களுடன் ஒப்பிடும்போது பிழை அறிக்கைகளில் அதிக சதவீதத்தை பங்களிக்கிறார்கள்.",
      "வெவ்வேறு தலைமுறையினரின் தொழில்நுட்பத் திறமை மற்றும் தொழில்நுட்பத்தின் வசதி மற்றும் கட்டுப்பாடு குறித்தும் விவாதிக்கப்படுகிறது.",
      "லினக்ஸிற்கான விளையாட்டு மேம்பாட்டில் உள்ள சவால்கள், பயனர் பின்னூட்டத்தின் பங்கு மற்றும் மென்பொருள் தர மேம்பாட்டிற்கான பிழை அறிக்கைகளின் முக்கியத்துவம் ஆகியவை குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 411,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1700748700
  },
  {
    "id": 38393238,
    "title": "புரிதல் கிட் கிளைகள்: உள்ளுணர்வு எதிர் யதார்த்தம்",
    "originLink": "https://jvns.ca/blog/2023/11/23/branches-intuition-reality/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393238",
    "commentBody": "",
    "originSummary": [
      "கிட் கிளைகளைப் பற்றிய உள்ளுணர்வு புரிதல் கிட் உண்மையில் எவ்வாறு செயல்படுகிறது என்பதோடு முழுமையாக ஒத்துப்போகவில்லை, ஆனால் இது இணைப்புகள், மறுசீரமைப்புகள் மற்றும் கிட்ஹப் இழுப்பு கோரிக்கைகளுடன் நெருக்கமாக தொடர்புடையது.",
      "கிட் கிளைகளுக்கு இடையில் ஒரு படிநிலை கட்டமைப்பைக் கொண்டிருக்கவில்லை, இது வரம்புகளையும் சவால்களையும் முன்வைக்கிறது.",
      "கிட்ஹப்பில் இயல்புநிலை கிளை உட்பட ஜிட்டின் பயனர் இடைமுகம் பயனர்கள் அறிந்திருக்க வேண்டிய அதன் தனித்துவங்களைக் கொண்டுள்ளது."
    ],
    "commentSummary": [
      "இந்த சுருக்கம் கிட் பற்றிய விரிவான கண்ணோட்டத்தை வழங்குகிறது, அதன் கிளைகள், ஈடுபாடுகள், இணைத்தல் மற்றும் ஒரு பதிப்பு கட்டுப்பாட்டு அமைப்பாக நன்மைகள் ஆகியவற்றில் கவனம் செலுத்துகிறது.",
      "பயனர்கள் ஜிட்டைப் பயன்படுத்துவதில் உள்ள சவால்களைப் பற்றி விவாதிக்கிறார்கள் மற்றும் கிட் கட்டளைகளை திறம்பட பயன்படுத்துவதற்கான உதவிக்குறிப்புகள் மற்றும் உத்திகளை வழங்குகிறார்கள்.",
      "வரலாறு மற்றும் கோப்பு நகர்வுகளின் கிட்டின் பிரதிநிதித்துவம் மற்றும் தெளிவான ஆவணங்கள் மற்றும் பயனர் நட்பு இடைமுகங்களின் தேவை குறித்து விவாதம் உள்ளது."
    ],
    "points": 357,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1700750596
  },
  {
    "id": 38396658,
    "title": "ஹெட்ஃபோன்களில் புளூடூத் ஆடியோ தரத்தை மேம்படுத்துதல்: மேம்படுத்தப்பட்ட எஸ்பிசி கோடெக் மற்றும் மென்பொருள் மாற்றங்கள் (2019)",
    "originLink": "https://habr.com/en/articles/456476/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396658",
    "commentBody": "",
    "originSummary": [
      "புளூடூத் தொழில்நுட்பத்தைப் பயன்படுத்தி ஏஏசி, ஆப்டிஎக்ஸ் அல்லது எல்.டி.ஏ.சி கோடெக்குகள் இல்லாத ஹெட்ஃபோன்களில் ஆடியோ தரத்தை எவ்வாறு மேம்படுத்துவது என்பதை கட்டுரை விவாதிக்கிறது.",
      "புளூடூத்தில் பயன்படுத்தப்படும் எஸ்பிசி கோடெக்கின் குறைந்த தரம் தற்போதைய புளூடூத் அடுக்குகள் மற்றும் ஹெட்ஃபோன் உள்ளமைவுகளில் உள்ள செயற்கை வரம்புகள் காரணமாகும், ஆனால் இந்த வரம்புகளை மென்பொருள் மாற்றங்களுடன் தவிர்க்கலாம்.",
      "ஆசிரியர் ஆண்ட்ராய்டு 8.1 மற்றும் 9 க்கான இணைப்புகளை வழங்குகிறார், இது டூயல் சேனல் பயன்முறைக்கான ஆதரவைச் சேர்க்கிறது மற்றும் புளூடூத் ஆடியோ தரத்தை மேம்படுத்துகிறது. சில ஃபார்ம்வேர்களின் பயனர்கள் வழங்கப்பட்ட இணைப்புகளைப் பயன்படுத்தி தங்கள் புளூடூத் ஆடியோ தரத்தை மேம்படுத்தலாம்."
    ],
    "commentSummary": [
      "ஹேக்கர் நியூஸ் விவாதம் ஹெட்ஃபோன்களில் ஆடியோ தரத்தை மேம்படுத்த புளூடூத் அடுக்கில் சாத்தியமான மாற்றங்களை ஆராய்கிறது.",
      "வெவ்வேறு கோடெக்குகளுக்கு இடையிலான பொருந்தக்கூடிய தன்மை, குறைந்த தாமத சிக்கல்கள், குறிப்பிட்ட கோடெக்குகளை டிகோடிங் செய்வதற்கான சக்தி தேவைகள் மற்றும் தயாரிப்பு வளர்ச்சியில் முதலாளித்துவத்தின் பங்கு ஆகியவை அடங்கும்.",
      "இந்த உரையாடல் குறைந்த தாமத ஆடியோ பரிமாற்றத்திற்கான மாற்று விருப்பங்கள், ஆண்ட்ராய்டு சாதனங்களில் புளூடூத் சிப்செட்களின் மாறுபாடு மற்றும் வைஃபை மற்றும் புளூடூத் பயன்பாட்டின் அடிப்படையில் வளங்களை ஒதுக்குதல் ஆகியவற்றை ஆராய்கிறது."
    ],
    "points": 321,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1700768509
  },
  {
    "id": 38396345,
    "title": "ஷெல்செக்: உங்கள் ஷெல் ஸ்கிரிப்ட்களில் பிழைகளைக் கண்டறிதல்",
    "originLink": "https://www.shellcheck.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396345",
    "commentBody": "",
    "originSummary": [
      "ஷெல்செக் என்பது ஹாஸ்கெலில் எழுதப்பட்ட ஒரு திறந்த மூல கருவியாகும், இது பயனர்கள் தங்கள் ஷெல் ஸ்கிரிப்ட்களில் உள்ள பிழைகளை அடையாளம் காண உதவுகிறது.",
      "கருவி பல்வேறு தளங்களில் நிறுவுவதற்கு கிடைக்கிறது மற்றும் பிரபலமான குறியீடு எடிட்டர்களில் ஒருங்கிணைக்கப்படலாம்.",
      "குறியீடு தரத்தை மேம்படுத்துவதற்கும் பிழைகளைத் தடுப்பதற்கும் ஷெல் ஸ்கிரிப்ட்களில் உள்ள சிக்கல்களைக் கண்டறிந்து சரிசெய்ய இது பயனர்களுக்கு உதவுகிறது."
    ],
    "commentSummary": [
      "குறியீடு தரம், மீளுருவாக்கம், ஒத்துழைப்பு மற்றும் குறிப்பிட்ட நோக்கங்களுக்காக பொருத்தமான மொழியைத் தேர்ந்தெடுப்பதில் கவனம் செலுத்தி, வெவ்வேறு சூழ்நிலைகளில் மொழிகளையும் அவற்றின் பயன்பாட்டையும் விவாதம் ஆராய்கிறது.",
      "தலைப்புகளில் ஷெல்செக், கிட்லாப் சிஐ ஸ்கிரிப்ட்களைப் பயன்படுத்தும் போது எதிர்கொள்ளும் சிக்கல்கள், பைத்தான் போன்ற ஷெல் ஸ்கிரிப்டிங்கிற்கான மாற்றுகள், பல்வேறு நிரலாக்க மொழிகளின் நன்மை தீமைகள், லினக்ஸ் மற்றும் உட்பொதிக்கப்பட்ட அமைப்புகளில் ஸ்கிரிப்ட் பயன்பாடு மற்றும் வள-கட்டுப்படுத்தப்பட்ட சாதனங்களில் நிரலாக்க மொழிகளின் திறன்கள் ஆகியவை அடங்கும்.",
      "வளர்ச்சி செயல்முறைகளை மேம்படுத்துவதற்கும் விரும்பிய விளைவுகளை அடைவதற்கும் ஸ்கிரிப்டிங் மொழிகளை திறம்பட பயன்படுத்துவதன் முக்கியத்துவத்தை மையமாகக் கொண்டுள்ளது."
    ],
    "points": 290,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1700766968
  },
  {
    "id": 38393032,
    "title": "சேவைகளை விட நூலகங்களுக்கு முன்னுரிமை: டெவலப்பர்களுக்கு செலவு குறைந்த தீர்வு",
    "originLink": "https://catern.com/services.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393032",
    "commentBody": "",
    "originSummary": [
      "நிர்வாக செலவுகளைக் குறைக்க சேவைகளை விட நூலகங்களை உருவாக்குவதற்கு டெவலப்பர்கள் முன்னுரிமை அளிக்க வேண்டும் என்று ஆசிரியர் பரிந்துரைக்கிறார்.",
      "நூலகங்கள் பயனர்களை மென்பொருளை தாங்களே இயக்க அனுமதிக்கின்றன மற்றும் சேவைகளைப் போலவே அதே செயல்பாட்டை வழங்குகின்றன, ஆனால் குறைந்த செலவில்.",
      "நூலக பயனர்களுக்கு பொறுப்பை மாற்றுவதன் மூலம், டெவலப்பர்கள் பெரும்பாலும் சேவைகளுடன் தொடர்புடைய பராமரிப்பு மற்றும் மேம்படுத்தல் செலவுகளைத் தவிர்க்கலாம், இது அதிக செயல்பாட்டை அனுமதிக்கிறது."
    ],
    "commentSummary": [
      "மென்பொருள் உருவாக்கத்தில் நூலகங்கள் மற்றும் சேவைகளைப் பயன்படுத்துவதன் நன்மைகள் மற்றும் தடைகளை இந்த கட்டுரை ஆராய்கிறது.",
      "இது நூலகங்களின் மறுபயன்பாடு மற்றும் சோதனைத்தன்மை, பதிப்பு கட்டுப்பாடு மற்றும் புதுப்பித்தல் உத்திகள், பாதுகாப்பு மற்றும் செயல்திறன் கவலைகள், வெவ்வேறு பதிப்புகள் மற்றும் வாடிக்கையாளர் நிலைநிறுத்தல் காட்சிகளை நிர்வகித்தல் மற்றும் தனியுரிம தொழில்நுட்பத்தைப் பாதுகாத்தல் ஆகியவற்றைப் பற்றி விவாதிக்கிறது.",
      "உரையாடல் சேமிப்பக தரவுத்தளங்கள், சுருக்கங்கள் மற்றும் மென்பொருளின் பணமாக்கல் போன்ற விஷயங்களையும் தொடுகிறது."
    ],
    "points": 267,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1700749275
  },
  {
    "id": 38394635,
    "title": "டைட்டானியத்தின் எழுச்சி மற்றும் சவால்கள்: வலிமை மற்றும் ஆற்றலின் ஒரு உலோகம்",
    "originLink": "https://www.construction-physics.com/p/the-story-of-titanium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394635",
    "commentBody": "",
    "originSummary": [
      "டைட்டானியம் அதன் வலிமை, குறைந்த எடை மற்றும் அரிப்பு எதிர்ப்பு ஆகியவற்றுக்கு பெயர் பெற்ற மிகவும் மதிப்புமிக்க உலோகமாகும்.",
      "டைட்டானியம் தொழில்துறைக்கு நிதி மற்றும் ஆராய்ச்சி மூலம் ஆதரவளிப்பதில் அமெரிக்க அரசு முக்கிய பங்கு வகிக்கிறது.",
      "டைட்டானியம் அதன் ஆயுட்காலம் காரணமாக விண்வெளி உற்பத்தி மற்றும் மருத்துவ உள்வைப்புகளில் பயன்பாடுகளைக் கண்டறிந்துள்ளது, ஆனால் இது மற்ற உலோகங்களுடன் ஒப்பிடும்போது முக்கிய மற்றும் விலையுயர்ந்ததாக உள்ளது."
    ],
    "commentSummary": [
      "மெக்னீசியம் மற்றும் அலுமினியம் போன்ற பிற பொருட்களுடன் ஒப்பிடும்போது டைட்டானியம் அதன் குணங்கள், பயன்பாடுகள் மற்றும் நன்மைகள் மற்றும் தீமைகளின் அடிப்படையில் விவாதிக்கப்படுகிறது.",
      "கட்டுமானம், பைக்கிங், சமையல் மற்றும் தொழில்நுட்பம் உள்ளிட்ட பல்வேறு தொழில்கள் டைட்டானியம் பயன்படுத்தப்படும் பகுதிகளாக குறிப்பிடப்பட்டுள்ளன.",
      "பயனர்கள் டைட்டானியம் பற்றிய தனிப்பட்ட அனுபவங்களையும் கருத்துக்களையும் பகிர்ந்து கொள்கிறார்கள், மேலும் எஃகு மற்றும் அலுமினியம் போன்ற பிற உலோகங்களும் குறிப்பிடப்பட்டுள்ளன."
    ],
    "points": 260,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1700757805
  },
  {
    "id": 38399740,
    "title": "உங்களை நீங்களே வலுப்படுத்துங்கள்: 2020 க்கான அனுமதிக்கப்பட்ட நடவடிக்கைகள்",
    "originLink": "https://milan.cvitkovic.net/writing/things_youre_allowed_to_do/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38399740",
    "commentBody": "",
    "originSummary": [
      "கற்றல், முடிவு எடுத்தல், ஒருவருக்கொருவர் தொடர்புகள், காதல், ஆதரவு மற்றும் பொறுப்புடைமை, வள மேலாண்மை மற்றும் தொழில்முறை முயற்சிகள் உள்ளிட்ட வாழ்க்கையின் பல்வேறு பகுதிகளில் தனிநபர்கள் ஈடுபட அனுமதிக்கப்பட்ட செயல்பாடுகளின் விரிவான பட்டியலை இந்த இடுகை வழங்குகிறது.",
      "இது ஆராய்ச்சியாளர்கள் அல்லது ஆலோசகர்களை பணியமர்த்தவும், ஒருவரின் அறிவு மற்றும் திறன்களை விரிவுபடுத்துவதற்கான வழிமுறைகளாக பண்டமாற்று அல்லது DIY திட்டங்களில் ஈடுபடவும் பரிந்துரைக்கிறது.",
      "இந்த நடவடிக்கைகளை ஆதரிப்பதற்கான வல்லுநர்கள், ஆராய்ச்சி மற்றும் தரவுகளைக் கண்டுபிடிப்பதற்கான ஆதாரங்களையும் இந்த இடுகை வழங்குகிறது."
    ],
    "commentSummary": [
      "கட்டுரை மற்றும் கருத்துக்கள் நிரலாக்கத்தைக் கற்றுக்கொள்வது, புதிய அனுபவங்களைத் தேடுவது, நேரத்தை மேம்படுத்துவது, வழக்கத்திற்கு மாறான வாழ்க்கை முறை தேர்வுகள், வரம்புகளைக் கடப்பது, புத்தகங்களில் குறிப்பு எடுப்பது, பிசியோதெரபி, உதவியாளர்களை பணியமர்த்துவது மற்றும் மாயத்தோற்றங்களை உண்மைகளுடன் கலக்கும் சாட்ஜிபிடி பிரச்சினை உள்ளிட்ட பரந்த அளவிலான தலைப்புகளைப் பற்றி விவாதிக்கின்றன.",
      "விவாதங்கள் இந்த தலைப்புகளில் பல்வேறு கண்ணோட்டங்கள், அனுபவங்கள் மற்றும் கருத்துக்களை முன்வைக்கின்றன, மதிப்புமிக்க நுண்ணறிவுகளையும் சாத்தியமான தீர்வுகளையும் வழங்குகின்றன.",
      "இந்த இடுகை தொழில்நுட்ப சமூகத்தில் உள்ள மற்றவர்களிடமிருந்து கற்றுக்கொள்வதற்கும் பல்வேறு தலைப்புகளில் வெவ்வேறு கண்ணோட்டங்களைப் பெறுவதற்கும் ஒரு தனித்துவமான வாய்ப்பை வழங்குகிறது."
    ],
    "points": 259,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1700788523
  },
  {
    "id": 38394613,
    "title": "குரோம் மேனிஸ்ட் வி 3 விளம்பர தடுப்பான்களை அச்சுறுத்துகிறது, பயனர்களை பயர்பாக்ஸுக்குத் தள்ளக்கூடும்",
    "originLink": "https://www.malwarebytes.com/blog/news/2023/11/chrome-pushes-forward-with-plans-to-limit-ad-blockers-in-the-future",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394613",
    "commentBody": "",
    "originSummary": [
      "விளம்பர தடுப்பான்களைக் கட்டுப்படுத்துவதற்கான விமர்சனங்கள் இருந்தபோதிலும், கூகிள் அதன் குரோம் நீட்டிப்பு விவரக்குறிப்பின் சமீபத்திய பதிப்பான மேனிஃபெஸ்ட் வி 2 இலிருந்து மேனிஃபெஸ்ட் வி 3 க்கு மாற திட்டமிட்டுள்ளது",
      "மேனிஃபெஸ்ட் வி 3 வடிகட்டுதல் விதிகளில் புதிய வரம்புகளை அறிமுகப்படுத்துகிறது, இது விளம்பர தடுப்பான்கள் மற்றும் தனியுரிமை பாதுகாப்பு டிராக்கர் தடுப்பான்களின் திறன்களைக் குறைக்கிறது",
      "எலக்ட்ரானிக் ஃப்ரான்டியர் ஃபவுண்டேஷன் (எஃப்எஃப்) மேனிஃபெஸ்ட் வி 3 ஐ ஏமாற்றக்கூடியது மற்றும் அச்சுறுத்தக்கூடியது என்று விமர்சித்துள்ளது, அதே நேரத்தில் பயர்பாக்ஸ் குறுக்கு உலாவி பொருந்தக்கூடிய தன்மைக்கு இதைப் பயன்படுத்த திட்டமிட்டுள்ளது, இது முழு நீட்டிப்பு திறன்கள் தேவைப்படும் பயனர்களுக்கு பயர்பாக்ஸை ஒரு சிறந்த தேர்வாக மாற்றும்."
    ],
    "commentSummary": [
      "கூகிள் அதன் குரோம் உலாவியில் விளம்பர தடுப்பான்களைக் கட்டுப்படுத்துவது குறித்து பரிசீலித்து வருகிறது, இது பயனர்கள் மற்றும் மாற்று உலாவி டெவலப்பர்களிடையே கவலைகளை எழுப்பியுள்ளது.",
      "பிரேவ், விவால்டி மற்றும் ஓபரா போன்ற உலாவிகள் தற்போதைய விளம்பரத் தடுப்பு அம்சத்தை ஆதரிக்க உறுதிபூண்டுள்ளன, அதே நேரத்தில் மேனிஃபெஸ்ட் வி 3 இல் புதிய திறன்களை அறிமுகப்படுத்துவது குறித்து விவாதங்கள் நடந்து வருகின்றன.",
      "பயனர்கள் மாற்றாக பயர்பாக்ஸ் அல்லது பிற தனியுரிமையை மையமாகக் கொண்ட உலாவிகளுக்கு மாறுவதைக் கருத்தில் கொண்டு, விளம்பர-தடுப்பான்களின் வரம்புகள், குரோமியம் கோட்பேஸ் மீதான கூகிளின் கட்டுப்பாடு மற்றும் விளம்பரத் தடுப்பு தரம் மற்றும் உலாவி செயல்திறன் மீதான தாக்கம் குறித்து விவாதிக்கின்றனர். அதிகப்படியான விளம்பரங்கள் மீதான விரக்தி, சில சாதனங்களில் விளம்பரத் தடுப்பான்கள் இல்லாதது மற்றும் பயனர் நலன்களுக்காக வாதிடுவதன் முக்கியத்துவம் ஆகியவையும் வெளிப்படுத்தப்படுகின்றன."
    ],
    "points": 241,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1700757650
  },
  {
    "id": 38392540,
    "title": "உகந்த கோரிக்கை ரெட்ரிகள்: அதிவேக பின்னடைவு மற்றும் நடுக்கம்",
    "originLink": "https://encore.dev/blog/retries",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392540",
    "commentBody": "",
    "originSummary": [
      "இந்த கட்டுரை மென்பொருள் உருவாக்கத்தில் தோல்வியுற்ற கோரிக்கைகளைக் கையாள்வதன் முக்கியத்துவத்தை ஆராய்கிறது மற்றும் கோரிக்கைகளை மீண்டும் முயற்சிப்பதற்கான பல்வேறு உத்திகளைப் பற்றிய நுண்ணறிவுகளை வழங்குகிறது.",
      "இது சேவையக செயல்திறனில் ரெட்ரிகளின் செல்வாக்கை வலியுறுத்துகிறது மற்றும் மறுமுயற்சி செயல்முறையை மேம்படுத்த அதிவேக பின்னடைவு மற்றும் நடுக்கத்தை செயல்படுத்த பரிந்துரைக்கிறது.",
      "கட்டுரை ஒரு குறியீட்டு எடுத்துக்காட்டை வழங்குகிறது மற்றும் பாதுகாப்பான மறுமுயற்சி நடத்தைகளைப் பின்பற்றுவதன் முக்கியத்துவத்தை அடிக்கோடிட்டுக் காட்டுகிறது, அதே நேரத்தில் பிற தொடர்புடைய தலைப்புகளை சுருக்கமாகக் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "தற்காலிக சேவையக சிக்கல்களை நிவர்த்தி செய்ய கோரிக்கை ரெட்ரிகள் மற்றும் உள்ளூர் சர்க்யூட் பிரேக்கர்கள் பயன்படுத்தப்படுகின்றன.",
      "சர்க்யூட் பிரேக்கர்களை செயல்படுத்துவதற்கு உள்ளூர் மற்றும் உலகளாவிய முடிவு எடுப்பது தேவைப்படுகிறது.",
      "அதிகப்படியான சீற்றங்கள் தீங்கு விளைவிக்கும் மற்றும் தவிர்க்கப்பட வேண்டும்.",
      "நடுக்கத்துடன் அதிவேக பின்னடைவு என்பது மறுமுயற்சி இடைவெளிகளைத் தீர்மானிக்க பொதுவாகப் பயன்படுத்தப்படும் உத்தியாகும்.",
      "இயந்திரத்தால் உருவாக்கப்பட்ட கோரிக்கைகளைக் கையாள பல்வேறு உத்திகள் தேவை.",
      "அனிமேஷன்களுக்குப் பயன்படுத்தப்படும் தொழில்நுட்பம் மற்றும் காட்சிப்படுத்தல் இடுகைகளுக்கான மூலக் குறியீடு கிடைப்பது ஆகியவற்றை கட்டுரை குறிப்பிடுகிறது.",
      "தோல்வியுற்ற கோரிக்கைகளைக் கையாள்வதற்கான உத்திகளைப் புறக்கணிப்பது விளைவுகளை ஏற்படுத்தும்.",
      "சுயமாக வழங்கப்பட்ட சேவை மறுப்பு (டி.டி.ஓ.எஸ்) தாக்குதல்களின் அபாயங்கள் உள்ளன."
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1700746336
  }
]
