[
  {
    "id": 38394364,
    "title": "Apple remove conta de desenvolvedor, desencadeia batalha jurídica e perdas",
    "originLink": "https://seraleev.notion.site/Our-developer-account-was-removed-by-Apple-and-they-haven-t-paid-out-108-878-b61192711c74487480373badc70d42c0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394364",
    "commentBody": "",
    "originSummary": [
      "A Sarafan Mobile Limited, desenvolvedora de aplicativos de foto e vídeo, teve sua conta de desenvolvedor da Apple encerrada, o que levou a perdas financeiras e dificuldades para a empresa e seus funcionários.",
      "O fechamento resultou em uma receita não paga de US$ 108.878 que a Sarafan Mobile Limited está tentando recuperar.",
      "A Apple citou uma violação do contrato de licença do programa de desenvolvedores como o motivo do fechamento da conta, mas não forneceu detalhes específicos ou etapas para a resolução. A apelação da Sarafan Mobile Limited foi rejeitada."
    ],
    "commentSummary": [
      "Esta coleção abrange várias discussões sobre o controle da Apple sobre seu ecossistema de aplicativos, incluindo a remoção de contas de desenvolvedores e especulações sobre avaliações falsas.",
      "Os tópicos incluem a necessidade de melhor moderação e transparência, o debate sobre a permissão de carregamento lateral e lojas de aplicativos de terceiros, preocupações sobre tecnologia opressiva e vigilância e os possíveis riscos das plataformas de sistemas operacionais abertos.",
      "As discussões também abrangem comparações entre lojas de aplicativos e suas políticas, desafios enfrentados pelos desenvolvedores na App Store, a questão das avaliações falsas e o valor dos serviços pagos, preocupações com o fechamento de contas e a falta de transparência, além dos riscos e princípios envolvidos no controle da plataforma."
    ],
    "points": 685,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1700756182
  },
  {
    "id": 38397817,
    "title": "YouTube enfrenta reações negativas à medida que os usuários encontram novas maneiras de bloquear anúncios",
    "originLink": "https://old.reddit.com/r/webdev/comments/181vbmk/youtube_is_now_blocking_ad_blockers_so_i_just/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38397817",
    "commentBody": "",
    "originSummary": [
      "O tópico do Reddit explora métodos e ferramentas para contornar e bloquear anúncios em plataformas como YouTube e Twitch, alimentado pela frustração dos usuários com anúncios intrusivos.",
      "Os usuários discutem maneiras de aprimorar a experiência de navegação e debatem o impacto dos bloqueadores de anúncios nos anunciantes e criadores de conteúdo.",
      "A empolgação e o feedback positivo surgem quando os usuários tomam conhecimento de uma nova extensão de navegador que permite a exibição de vídeos do YouTube sem anúncios."
    ],
    "commentSummary": [
      "A discussão sobre o YouTube abrange vários tópicos, incluindo bloqueio de anúncios, criadores de conteúdo, plataformas alternativas e a ética do bloqueio de anúncios.",
      "Os usuários participam de conversas sobre estratégias para contornar anúncios, o impacto dos anúncios na experiência de visualização e a eficácia da publicidade no YouTube.",
      "Outros pontos de discussão incluem coleta de dados, concorrência, censura, o possível futuro da IA na publicidade e os desafios da implementação de anúncios personalizados no YouTube."
    ],
    "points": 532,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1700775206
  },
  {
    "id": 38393237,
    "title": "Governo dos EUA paga à AT&T por buscas de registros telefônicos sem mandado e levanta preocupações",
    "originLink": "https://www.theregister.com/2023/11/22/wyden_hemisphere_letter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393237",
    "commentBody": "",
    "originSummary": [
      "O senador Ron Wyden expressou preocupação com o Projeto Hemisphere, um programa secreto de vigilância que permite que as agências de aplicação da lei dos EUA pesquisem trilhões de registros telefônicos sem mandados.",
      "O programa envolve a AT&T fornecendo acesso a registros telefônicos que remontam a 1987 e quatro bilhões de registros de chamadas adicionados diariamente, com o Escritório da Casa Branca da Política Nacional de Controle de Drogas pagando por esse acesso.",
      "Wyden solicitou mais informações sobre o programa e questionou sua legalidade, uma vez que ele é designado como \"sensível à aplicação da lei\" e não está sujeito a uma avaliação federal de impacto sobre a privacidade."
    ],
    "commentSummary": [
      "A discussão levanta preocupações sobre a vigilância do governo e as violações de privacidade, bem como a falta de responsabilidade pela aplicação da lei.",
      "Ele explora questões como o acesso a registros telefônicos sem mandado, o uso de metadados e o possível abuso de poder.",
      "A conversa também aborda tópicos como a Quarta Emenda, aplicativos de mensagens criptografadas e o equilíbrio entre privacidade individual e vigilância governamental."
    ],
    "points": 439,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1700750593
  },
  {
    "id": 38392277,
    "title": "Erradicação da pólio: Prevenção do retorno e benefícios potenciais",
    "originLink": "https://www.nature.com/articles/d41586-023-03602-5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392277",
    "commentBody": "",
    "originSummary": [
      "A campanha global para erradicar a poliomielite é quase bem-sucedida, mas há preocupações quanto à permanência do vírus em laboratórios e indivíduos após a erradicação.",
      "Os esforços de erradicação da poliomielite têm sido um desafio devido à capacidade do vírus de infectar as pessoas silenciosamente e ao risco de reemergência do vírus durante a retirada da vacina oral contra a poliomielite (OPV).",
      "Para evitar o ressurgimento da poliomielite após a erradicação, é fundamental que haja alta imunidade da população, forte vigilância, melhor biossegurança nos laboratórios e desenvolvimento de vacinas alternativas sem o vírus vivo."
    ],
    "commentSummary": [
      "O artigo discute o progresso e os desafios na erradicação da pólio, incluindo a interferência da CIA e as barreiras culturais no Paquistão.",
      "A conversa aborda vários tópicos, como a decisão de patentear a vacina contra a poliomielite, a descoberta de uma cura para a paralisia causada pela poliomielite e a importância de os países desenvolvidos ajudarem na infraestrutura de saneamento e água.",
      "Há um debate sobre os gastos do governo, o crescimento populacional, a eficácia da vacina, as teorias da conspiração e a ética de matar Osama bin Laden que afetam a implementação da vacina no Paquistão."
    ],
    "points": 418,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1700744421
  },
  {
    "id": 38392931,
    "title": "A comunidade Linux contribui com mais de 38% dos relatórios de bugs no desenvolvimento de jogos (2021)",
    "originLink": "https://old.reddit.com/r/gamedev/comments/qeqn3b/despite_having_just_58_sales_over_38_of_bug/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392931",
    "commentBody": "",
    "originSummary": [
      "A postagem discute os benefícios do relatório de bugs da comunidade Linux para o desenvolvimento de jogos no Linux.",
      "Ele explora os desafios e as vantagens de usar o Linux para o desenvolvimento de jogos, enfatizando a importância dos testes em diferentes hardwares e arquiteturas.",
      "Os possíveis benefícios do código-fonte aberto e dos relatórios de bugs, bem como as experiências positivas e o suporte da comunidade de jogos do Linux, também são destacados."
    ],
    "commentSummary": [
      "Os usuários do Linux contribuem com uma porcentagem maior de relatórios de bugs em comparação com os usuários do Windows, devido ao seu conhecimento técnico e acesso aos rastreadores de bugs.",
      "A proficiência técnica de diferentes gerações e a conveniência e o controle da tecnologia também são discutidos.",
      "São mencionados os desafios no desenvolvimento de jogos para Linux, a função do feedback do usuário e a importância dos relatórios de bugs para o aprimoramento da qualidade do software."
    ],
    "points": 411,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1700748700
  },
  {
    "id": 38393238,
    "title": "Entendendo as ramificações do Git: Intuição versus Realidade",
    "originLink": "https://jvns.ca/blog/2023/11/23/branches-intuition-reality/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393238",
    "commentBody": "",
    "originSummary": [
      "A compreensão intuitiva das ramificações do git não se alinha totalmente com o funcionamento real do git, mas está intimamente relacionada a mesclagens, rebases e solicitações pull do GitHub.",
      "O Git não tem uma estrutura hierárquica entre as ramificações, o que impõe limitações e desafios.",
      "A interface do usuário do git, incluindo o branch padrão no GitHub, tem suas peculiaridades das quais os usuários devem estar cientes."
    ],
    "commentSummary": [
      "Este resumo fornece uma visão geral abrangente do Git, concentrando-se em suas ramificações, commits, mesclagem e vantagens como um sistema de controle de versão.",
      "Os usuários discutem os desafios de usar o Git e oferecem dicas e estratégias para usar os comandos do Git de forma eficaz.",
      "Há um debate sobre a representação do histórico e das movimentações de arquivos pelo Git e sobre a necessidade de uma documentação mais clara e de interfaces mais fáceis de usar."
    ],
    "points": 357,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1700750596
  },
  {
    "id": 38396658,
    "title": "Melhoria da qualidade de áudio Bluetooth em fones de ouvido: Codec SBC aprimorado e modificações de software (2019)",
    "originLink": "https://habr.com/en/articles/456476/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396658",
    "commentBody": "",
    "originSummary": [
      "O artigo discute como melhorar a qualidade de áudio em fones de ouvido sem os codecs AAC, aptX ou LDAC usando a tecnologia Bluetooth.",
      "A baixa qualidade do codec SBC usado no Bluetooth se deve a limitações artificiais nas atuais pilhas Bluetooth e configurações de fones de ouvido, mas essas limitações podem ser contornadas com modificações de software.",
      "O autor fornece patches para o Android 8.1 e 9, que adicionam suporte ao modo Dual Channel e melhoram a qualidade de áudio do Bluetooth. Os usuários de determinados firmwares podem melhorar a qualidade do áudio Bluetooth usando os patches fornecidos."
    ],
    "commentSummary": [
      "A discussão do Hacker News explora possíveis modificações na pilha Bluetooth para melhorar a qualidade do áudio em fones de ouvido.",
      "Os tópicos abordados incluem compatibilidade entre diferentes codecs, problemas de baixa latência, requisitos de energia para decodificação de codecs específicos e a função do capitalismo no desenvolvimento de produtos.",
      "A conversa também aborda opções alternativas para a transmissão de áudio de baixa latência, a variabilidade dos chipsets Bluetooth em dispositivos Android e a alocação de recursos com base no uso de Wi-Fi e Bluetooth."
    ],
    "points": 321,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1700768509
  },
  {
    "id": 38396345,
    "title": "ShellCheck: Descobrindo bugs em seus scripts de shell",
    "originLink": "https://www.shellcheck.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396345",
    "commentBody": "",
    "originSummary": [
      "O ShellCheck é uma ferramenta de código aberto escrita em Haskell que ajuda os usuários a identificar bugs em seus scripts de shell.",
      "A ferramenta está disponível para instalação em várias plataformas e pode ser integrada a editores de código populares.",
      "Ele ajuda os usuários a encontrar e corrigir problemas em scripts de shell para melhorar a qualidade do código e evitar bugs."
    ],
    "commentSummary": [
      "A discussão explora as linguagens de script e sua aplicação em diferentes cenários, com foco na qualidade do código, reprodutibilidade, colaboração e seleção da linguagem apropriada para fins específicos.",
      "Os tópicos incluem Shellcheck, problemas encontrados ao usar scripts de CI do Gitlab, alternativas para scripts de shell como Python, prós e contras de várias linguagens de programação, uso de scripts no Linux e em sistemas incorporados e os recursos das linguagens de programação em dispositivos com recursos limitados.",
      "O tema central gira em torno da importância da utilização eficaz de linguagens de script para aprimorar os processos de desenvolvimento e alcançar os resultados desejados."
    ],
    "points": 290,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1700766968
  },
  {
    "id": 38393032,
    "title": "Priorização de bibliotecas em vez de serviços: Solução econômica para desenvolvedores",
    "originLink": "https://catern.com/services.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393032",
    "commentBody": "",
    "originSummary": [
      "O autor recomenda que os desenvolvedores priorizem a criação de bibliotecas em vez de serviços para reduzir os custos administrativos.",
      "As bibliotecas permitem que os usuários executem o software por conta própria e oferecem a mesma funcionalidade dos serviços, mas a um custo menor.",
      "Ao transferir a responsabilidade para os usuários da biblioteca, os desenvolvedores podem evitar os custos de manutenção e atualização normalmente associados aos serviços, permitindo mais funcionalidade."
    ],
    "commentSummary": [
      "O artigo examina as vantagens e os obstáculos da utilização de bibliotecas e serviços no desenvolvimento de software.",
      "Ele discute a reutilização e a capacidade de teste das bibliotecas, o controle de versão e as estratégias de atualização, as preocupações com segurança e eficiência, o gerenciamento de diferentes versões e cenários de implantação do cliente e a proteção da tecnologia proprietária.",
      "A conversa também aborda assuntos como bancos de dados de armazenamento, abstrações e a monetização do software."
    ],
    "points": 267,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1700749275
  },
  {
    "id": 38394635,
    "title": "A ascensão e os desafios do titânio: Um metal de força e potencial",
    "originLink": "https://www.construction-physics.com/p/the-story-of-titanium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394635",
    "commentBody": "",
    "originSummary": [
      "O titânio é um metal altamente valioso, conhecido por sua força, leveza e resistência à corrosão.",
      "O governo dos EUA tem desempenhado um papel fundamental no apoio ao setor de titânio por meio de financiamento e pesquisa.",
      "O titânio encontrou aplicações na fabricação aeroespacial e em implantes médicos devido à sua durabilidade, mas continua sendo um nicho e caro em comparação com outros metais."
    ],
    "commentSummary": [
      "O titânio está sendo discutido em termos de suas qualidades, usos, vantagens e desvantagens em comparação com outros materiais, como magnésio e alumínio.",
      "Vários setores, incluindo construção, ciclismo, culinária e tecnologia, são mencionados como áreas em que o titânio é usado.",
      "Os usuários compartilham experiências e opiniões pessoais sobre o titânio, e outros metais, como aço e alumínio, também são mencionados."
    ],
    "points": 260,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1700757805
  },
  {
    "id": 38399740,
    "title": "Capacite-se: Ações permitidas para 2020",
    "originLink": "https://milan.cvitkovic.net/writing/things_youre_allowed_to_do/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38399740",
    "commentBody": "",
    "originSummary": [
      "Esta publicação apresenta uma lista abrangente de atividades que as pessoas podem realizar em várias áreas da vida, incluindo aprendizado, tomada de decisões, interações interpessoais, romance, apoio e responsabilidade, gerenciamento de recursos e empreendimentos profissionais.",
      "Sugere a contratação de pesquisadores ou consultores e a participação em projetos de permuta ou de bricolagem como forma de ampliar o conhecimento e as habilidades.",
      "A publicação também fornece recursos para encontrar especialistas, pesquisas e dados para apoiar essas atividades."
    ],
    "commentSummary": [
      "O artigo e os comentários discutem uma ampla gama de tópicos, incluindo o aprendizado de programação, a busca de novas experiências, a otimização do tempo, escolhas não convencionais de estilo de vida, superação de limitações, anotações em livros, fisioterapia, contratação de assistentes e a questão de o ChatGPT misturar alucinações com fatos.",
      "As discussões apresentam diversas perspectivas, experiências e opiniões sobre esses assuntos, oferecendo percepções valiosas e possíveis soluções.",
      "Essa publicação oferece uma oportunidade única de aprender com outras pessoas da comunidade de tecnologia e obter perspectivas diferentes sobre vários tópicos."
    ],
    "points": 259,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1700788523
  },
  {
    "id": 38394613,
    "title": "O Manifesto V3 do Chrome ameaça os bloqueadores de anúncios e pode levar os usuários ao Firefox",
    "originLink": "https://www.malwarebytes.com/blog/news/2023/11/chrome-pushes-forward-with-plans-to-limit-ad-blockers-in-the-future",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394613",
    "commentBody": "",
    "originSummary": [
      "O Google planeja fazer a transição do Manifest V2 para o Manifest V3, a versão mais recente de sua especificação de extensão do Chrome, apesar das críticas por limitar os bloqueadores de anúncios",
      "O Manifest V3 introduz novas limitações nos conjuntos de regras de filtragem, o que reduz os recursos dos bloqueadores de anúncios e dos bloqueadores de rastreadores de proteção à privacidade",
      "A Electronic Frontier Foundation (EFF) criticou o Manifest V3 por considerá-lo enganoso e ameaçador, enquanto o Firefox planeja adotá-lo para obter compatibilidade entre navegadores, o que pode tornar o Firefox uma opção melhor para usuários que precisam de recursos completos de extensão."
    ],
    "commentSummary": [
      "O Google está considerando limitar os bloqueadores de anúncios em seu navegador Chrome, o que gerou preocupações entre os usuários e os desenvolvedores de navegadores alternativos.",
      "Navegadores como Brave, Vivaldi e Opera se comprometeram a oferecer suporte ao recurso atual de bloqueio de anúncios, enquanto há discussões em andamento sobre a possível introdução de novos recursos no Manifest V3.",
      "Os usuários estão considerando mudar para o Firefox ou outros navegadores voltados para a privacidade como alternativa e estão discutindo as limitações dos bloqueadores de anúncios, o controle do Google sobre a base de código do Chromium e o impacto na qualidade do bloqueio de anúncios e no desempenho do navegador. A frustração com o excesso de anúncios, a falta de bloqueadores de anúncios em determinados dispositivos e a importância de defender os interesses dos usuários também são expressos."
    ],
    "points": 241,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1700757650
  },
  {
    "id": 38392540,
    "title": "Otimização de novas tentativas de solicitação: Backoff exponencial e jitter",
    "originLink": "https://encore.dev/blog/retries",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392540",
    "commentBody": "",
    "originSummary": [
      "Este artigo analisa a importância de lidar com solicitações com falha no desenvolvimento de software e oferece insights sobre várias estratégias para tentar novamente as solicitações.",
      "Ele enfatiza a influência das novas tentativas no desempenho do servidor e sugere a implementação de backoff exponencial e jitter para otimizar o processo de nova tentativa.",
      "O artigo fornece um exemplo de código e ressalta a importância de adotar comportamentos de repetição seguros, além de mencionar brevemente outros tópicos relacionados."
    ],
    "commentSummary": [
      "As novas tentativas de solicitação e os circuit breakers locais são usados para resolver problemas temporários do servidor.",
      "A implementação de disjuntores requer uma tomada de decisão local e global.",
      "O excesso de novas tentativas pode causar danos e deve ser evitado.",
      "O backoff exponencial com jitter é uma estratégia comumente usada para determinar os intervalos de repetição.",
      "São necessárias estratégias diferentes para lidar com solicitações geradas por máquinas.",
      "O artigo menciona a tecnologia usada para animações e a disponibilidade do código-fonte para postagens de visualização.",
      "Ignorar estratégias para lidar com solicitações com falha pode ter consequências.",
      "Há riscos de ataques de negação de serviço distribuído (DDoS) autoinfligidos."
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1700746336
  }
]
