[
  {
    "id": 38394364,
    "title": "Apple verwijdert ontwikkelaarsaccount, leidt tot juridische strijd en verliezen",
    "originLink": "https://seraleev.notion.site/Our-developer-account-was-removed-by-Apple-and-they-haven-t-paid-out-108-878-b61192711c74487480373badc70d42c0",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394364",
    "commentBody": "",
    "originSummary": [
      "Sarafan Mobile Limited, een ontwikkelaar van foto- en videotoepassingen, heeft zijn Apple ontwikkelaarsaccount moeten sluiten, wat heeft geleid tot financiële verliezen en ontberingen voor het bedrijf en zijn werknemers.",
      "De sluiting resulteerde in onbetaalde inkomsten van $108.878 die Sarafan Mobile Limited probeert terug te krijgen.",
      "Apple noemde een schending van hun licentieovereenkomst voor ontwikkelaarsprogramma's als reden voor het sluiten van de account, maar gaf geen specifieke details of stappen voor een oplossing. Het beroep van Sarafan Mobile Limited werd afgewezen."
    ],
    "commentSummary": [
      "Deze verzameling behandelt verschillende discussies over Apple's controle over zijn app-ecosysteem, waaronder het verwijderen van ontwikkelaarsaccounts en speculaties over neprecensies.",
      "Onderwerpen zijn onder andere de behoefte aan betere moderatie en transparantie, het debat over het toestaan van side loading en app stores van derden, zorgen over onderdrukkende technologie en surveillance, en de potentiële risico's van open OS-platforms.",
      "De discussies gaan ook over vergelijkingen tussen app stores en hun beleid, uitdagingen waarmee ontwikkelaars in de App Store worden geconfronteerd, de kwestie van neprecensies en de waarde van betaalde diensten, zorgen over accountsluitingen en gebrek aan transparantie, en de risico's en principes van platformcontrole."
    ],
    "points": 685,
    "commentCount": 392,
    "retryCount": 0,
    "time": 1700756182
  },
  {
    "id": 38397817,
    "title": "YouTube krijgt te maken met reacties van gebruikers die nieuwe manieren vinden om advertenties te blokkeren",
    "originLink": "https://old.reddit.com/r/webdev/comments/181vbmk/youtube_is_now_blocking_ad_blockers_so_i_just/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38397817",
    "commentBody": "",
    "originSummary": [
      "Reddit onderzoekt methoden en tools om advertenties op platforms zoals YouTube en Twitch te omzeilen en te blokkeren, gevoed door de frustratie van gebruikers over opdringerige advertenties.",
      "Gebruikers bespreken manieren om de browse-ervaring te verbeteren en debatteren over de impact van ad-blockers op adverteerders en contentmakers.",
      "Opwinding en positieve feedback ontstaan wanneer gebruikers leren over een nieuwe browserextensie die het mogelijk maakt om reclamevrij YouTube-video's te bekijken."
    ],
    "commentSummary": [
      "De discussie over YouTube omvat verschillende onderwerpen, zoals het blokkeren van advertenties, makers van inhoud, alternatieve platforms en de ethiek van het blokkeren van advertenties.",
      "Gebruikers voeren gesprekken over strategieën om advertenties te omzeilen, de impact van advertenties op de kijkervaring en de doeltreffendheid van advertenties op YouTube.",
      "Andere discussiepunten zijn gegevensverzameling, concurrentie, censuur, de mogelijke toekomst van AI in reclame en de uitdagingen van het implementeren van gepersonaliseerde advertenties op YouTube."
    ],
    "points": 532,
    "commentCount": 569,
    "retryCount": 0,
    "time": 1700775206
  },
  {
    "id": 38393237,
    "title": "Amerikaanse overheid betaalt AT&T voor het zonder toestemming doorzoeken van telefoongegevens, en wekt bezorgdheid op",
    "originLink": "https://www.theregister.com/2023/11/22/wyden_hemisphere_letter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393237",
    "commentBody": "",
    "originSummary": [
      "Senator Ron Wyden heeft zijn bezorgdheid geuit over het Hemisphere Project, een geheim bewakingsprogramma waarmee Amerikaanse wetshandhavers zonder bevelschrift biljoenen telefoongegevens kunnen doorzoeken.",
      "Het programma houdt in dat AT&T toegang geeft tot telefoongegevens die teruggaan tot 1987 en dat er dagelijks vier miljard gespreksgegevens worden toegevoegd, waarbij het White House Office of National Drug Control Policy betaalt voor deze toegang.",
      "Wyden heeft om meer informatie over het programma gevraagd en vraagt zich af of het wel legaal is, omdat het wordt aangeduid als \"Law Enforcement Sensitive\" en niet onderhevig is aan een federale Privacy Impact Assessment."
    ],
    "commentSummary": [
      "De discussie roept zorgen op over overheidssurveillance en privacyschendingen, maar ook over het gebrek aan verantwoordingsplicht voor wetshandhavers.",
      "Het onderzoekt kwesties zoals de toegang tot telefoongegevens zonder bevelschrift, het gebruik van metadata en het mogelijke machtsmisbruik.",
      "Het gesprek gaat ook over onderwerpen als het Vierde Amendement, versleutelde berichtenapps en de balans tussen individuele privacy en overheidssurveillance."
    ],
    "points": 439,
    "commentCount": 138,
    "retryCount": 0,
    "time": 1700750593
  },
  {
    "id": 38392277,
    "title": "Uitroeiing van polio: Terugkeer voorkomen & potentiële voordelen",
    "originLink": "https://www.nature.com/articles/d41586-023-03602-5",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392277",
    "commentBody": "",
    "originSummary": [
      "De wereldwijde campagne om polio uit te roeien is bijna geslaagd, maar er is bezorgdheid over het feit dat het virus na de uitroeiing in laboratoria en individuen achterblijft.",
      "De inspanningen om polio uit te roeien zijn een uitdaging geweest vanwege het vermogen van het virus om mensen in stilte te besmetten en het risico dat het virus opnieuw de kop opsteekt wanneer het orale poliovaccin (OPV) wordt ingetrokken.",
      "Om te voorkomen dat polio na de uitroeiing opnieuw de kop opsteekt, zijn een hoge immuniteit van de bevolking, sterk toezicht, betere bioveiligheid in laboratoria en de ontwikkeling van alternatieve vaccins zonder het levende virus van cruciaal belang."
    ],
    "commentSummary": [
      "Het artikel bespreekt de vooruitgang en uitdagingen bij het uitroeien van polio, waaronder de inmenging van de CIA en culturele barrières in Pakistan.",
      "Het gesprek gaat over verschillende onderwerpen zoals de beslissing om het poliovaccin te patenteren, het vinden van een geneesmiddel voor verlamming veroorzaakt door polio en het belang van ontwikkelde landen die helpen met sanitaire voorzieningen en waterinfrastructuur.",
      "Er is een debat over overheidsuitgaven, bevolkingsgroei, de werkzaamheid van vaccins, samenzweringstheorieën en de ethiek van het doden van Osama bin Laden die van invloed zijn op de uitrol van vaccins in Pakistan."
    ],
    "points": 418,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1700744421
  },
  {
    "id": 38392931,
    "title": "Linux-gemeenschap draagt meer dan 38% bij aan bugrapporten in game-ontwikkeling (2021)",
    "originLink": "https://old.reddit.com/r/gamedev/comments/qeqn3b/despite_having_just_58_sales_over_38_of_bug/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392931",
    "commentBody": "",
    "originSummary": [
      "De post bespreekt de voordelen van bugrapportage van de Linux-gemeenschap voor de ontwikkeling van spellen op Linux.",
      "Het onderzoekt de uitdagingen en voordelen van het gebruik van Linux voor de ontwikkeling van games, waarbij het belang van testen op verschillende hardware en architecturen wordt benadrukt.",
      "De potentiële voordelen van open-source code en bugrapporten, evenals de positieve ervaringen en ondersteuning van de Linux gaming gemeenschap, worden ook benadrukt."
    ],
    "commentSummary": [
      "Linux-gebruikers dragen een hoger percentage bugrapporten bij dan Windows-gebruikers vanwege hun technische kennis en toegang tot bugtrackers.",
      "De technische vaardigheid van verschillende generaties en het gemak en de controle van technologie worden ook besproken.",
      "Uitdagingen bij de ontwikkeling van games voor Linux, de rol van feedback van gebruikers en het belang van bugrapporten voor kwaliteitsverbetering van software worden genoemd."
    ],
    "points": 411,
    "commentCount": 151,
    "retryCount": 0,
    "time": 1700748700
  },
  {
    "id": 38393238,
    "title": "Git Branches begrijpen: Intuïtie vs realiteit",
    "originLink": "https://jvns.ca/blog/2023/11/23/branches-intuition-reality/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393238",
    "commentBody": "",
    "originSummary": [
      "Het intuïtieve begrip van git branches komt niet helemaal overeen met hoe git eigenlijk werkt, maar het is nauw verbonden met merges, rebases, en GitHub pull requests.",
      "Git mist een hiërarchische structuur tussen branches, wat beperkingen en uitdagingen met zich meebrengt.",
      "De gebruikersinterface van git, inclusief de standaard branch in GitHub, heeft zijn eigenaardigheden waar gebruikers zich bewust van moeten zijn."
    ],
    "commentSummary": [
      "Deze samenvatting geeft een uitgebreid overzicht van Git, gericht op de branches, commits, samenvoegen en voordelen als versiebeheersysteem.",
      "Gebruikers bespreken de uitdagingen van het gebruik van Git en geven tips en strategieën om Git commando's effectief te gebruiken.",
      "Er is discussie over Git's representatie van geschiedenis en bestandsverplaatsingen, en de behoefte aan duidelijkere documentatie en gebruikersvriendelijke interfaces."
    ],
    "points": 357,
    "commentCount": 227,
    "retryCount": 0,
    "time": 1700750596
  },
  {
    "id": 38396658,
    "title": "Verbetering van Bluetooth-audiokwaliteit op hoofdtelefoons: Verbeterde SBC-codec en softwareaanpassingen (2019)",
    "originLink": "https://habr.com/en/articles/456476/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396658",
    "commentBody": "",
    "originSummary": [
      "Het artikel bespreekt hoe je de geluidskwaliteit kunt verbeteren op hoofdtelefoons zonder AAC-, aptX- of LDAC-codecs met behulp van Bluetooth-technologie.",
      "De lage kwaliteit van de SBC codec die gebruikt wordt in Bluetooth is te wijten aan kunstmatige beperkingen in de huidige Bluetooth stacks en hoofdtelefoonconfiguraties, maar deze beperkingen kunnen omzeild worden met software aanpassingen.",
      "De auteur biedt patches voor Android 8.1 en 9, die ondersteuning voor Dual Channel-modus toevoegen en de Bluetooth-audiokwaliteit verbeteren. Gebruikers van bepaalde firmwares kunnen hun Bluetooth-audiokwaliteit verbeteren met de meegeleverde patches."
    ],
    "commentSummary": [
      "De discussie in Hacker News verkent mogelijke aanpassingen aan de Bluetooth-stack om de geluidskwaliteit van koptelefoons te verbeteren.",
      "Onderwerpen die aan bod komen zijn onder andere compatibiliteit tussen verschillende codecs, problemen met lage latentie, stroomvereisten voor het decoderen van specifieke codecs en de rol van kapitalisme in productontwikkeling.",
      "Het gesprek gaat ook over alternatieve opties voor audio-overdracht met lage latentie, de variabiliteit van Bluetooth-chipsets in Android-apparaten en de toewijzing van bronnen op basis van Wi-Fi- en Bluetooth-gebruik."
    ],
    "points": 321,
    "commentCount": 90,
    "retryCount": 0,
    "time": 1700768509
  },
  {
    "id": 38396345,
    "title": "ShellCheck: Bugs in uw Shell-scripts ontdekken",
    "originLink": "https://www.shellcheck.net/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38396345",
    "commentBody": "",
    "originSummary": [
      "ShellCheck is een open-source hulpprogramma geschreven in Haskell dat gebruikers helpt bij het identificeren van bugs in hun shellscripts.",
      "De tool is beschikbaar voor installatie op verschillende platforms en kan worden geïntegreerd in populaire code-editors.",
      "Het helpt gebruikers bij het vinden en repareren van problemen in shellscripts om de kwaliteit van de code te verbeteren en bugs te voorkomen."
    ],
    "commentSummary": [
      "De discussie verkent scripttalen en hun toepassing in verschillende scenario's, met de nadruk op codekwaliteit, reproduceerbaarheid, samenwerking en het kiezen van de juiste taal voor specifieke doeleinden.",
      "Onderwerpen zijn onder andere Shellcheck, problemen bij het gebruik van Gitlab CI scripts, alternatieven voor shell scripting zoals Python, voor- en nadelen van verschillende programmeertalen, scriptgebruik in Linux en embedded systemen, en de mogelijkheden van programmeertalen in apparaten met beperkte bronnen.",
      "Het centrale thema draait om het belang van effectief gebruik van scripttalen om ontwikkelprocessen te verbeteren en gewenste resultaten te behalen."
    ],
    "points": 290,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1700766968
  },
  {
    "id": 38393032,
    "title": "Bibliotheken voorrang geven boven diensten: Kosteneffectieve oplossing voor ontwikkelaars",
    "originLink": "https://catern.com/services.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38393032",
    "commentBody": "",
    "originSummary": [
      "De auteur raadt ontwikkelaars aan om prioriteit te geven aan het maken van bibliotheken boven diensten om de administratiekosten te verlagen.",
      "Bibliotheken stellen gebruikers in staat om de software zelf te draaien en bieden dezelfde functionaliteit als diensten, maar tegen lagere kosten.",
      "Door de verantwoordelijkheid naar bibliotheekgebruikers te verschuiven, kunnen ontwikkelaars onderhouds- en upgradekosten vermijden die vaak met diensten geassocieerd worden, waardoor meer functionaliteit mogelijk wordt."
    ],
    "commentSummary": [
      "Het artikel onderzoekt de voordelen en obstakels van het gebruik van bibliotheken versus diensten bij softwareontwikkeling.",
      "Het bespreekt de herbruikbaarheid en testbaarheid van bibliotheken, versiebeheer en updatestrategieën, veiligheids- en efficiëntiekwesties, het beheren van verschillende versies en implementatiescenario's voor klanten, en het beschermen van propriëtaire technologie.",
      "Het gesprek gaat ook over onderwerpen als opslagdatabases, abstracties en het te gelde maken van software."
    ],
    "points": 267,
    "commentCount": 157,
    "retryCount": 0,
    "time": 1700749275
  },
  {
    "id": 38394635,
    "title": "De opkomst en uitdagingen van titanium: Een metaal met kracht en potentieel",
    "originLink": "https://www.construction-physics.com/p/the-story-of-titanium",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394635",
    "commentBody": "",
    "originSummary": [
      "Titanium is een zeer waardevol metaal dat bekend staat om zijn sterkte, lichte gewicht en corrosiebestendigheid.",
      "De Amerikaanse overheid heeft een cruciale rol gespeeld bij de ondersteuning van de titaniumindustrie door middel van financiering en onderzoek.",
      "Titanium heeft toepassingen gevonden in de ruimtevaart en medische implantaten vanwege zijn duurzaamheid, maar het blijft niche en duur vergeleken met andere metalen."
    ],
    "commentSummary": [
      "Titanium wordt besproken in termen van zijn kwaliteiten, toepassingen en voor- en nadelen in vergelijking met andere materialen zoals magnesium en aluminium.",
      "Verschillende industrieën, waaronder de bouw, fietsen, koken en technologie, worden genoemd als gebieden waar titanium wordt gebruikt.",
      "Gebruikers delen persoonlijke ervaringen en meningen over titanium, en andere metalen zoals staal en aluminium worden ook genoemd."
    ],
    "points": 260,
    "commentCount": 135,
    "retryCount": 0,
    "time": 1700757805
  },
  {
    "id": 38399740,
    "title": "Empower jezelf: Toegestane acties voor 2020",
    "originLink": "https://milan.cvitkovic.net/writing/things_youre_allowed_to_do/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38399740",
    "commentBody": "",
    "originSummary": [
      "Deze post presenteert een uitgebreide lijst van activiteiten die individuen mogen uitvoeren op verschillende gebieden van het leven, waaronder leren, beslissingen nemen, interpersoonlijke interacties, romantiek, steun en verantwoording, middelenbeheer en professionele inspanningen.",
      "Er wordt voorgesteld om onderzoekers of consultants in te huren en deel te nemen aan ruilhandel of doe-het-zelfprojecten om je kennis en vaardigheden te verbreden.",
      "De post biedt ook bronnen voor het vinden van experts, onderzoek en gegevens om deze activiteiten te ondersteunen."
    ],
    "commentSummary": [
      "Het artikel en de commentaren bespreken een breed scala aan onderwerpen, waaronder leren programmeren, nieuwe ervaringen zoeken, tijd optimaliseren, onconventionele keuzes in levensstijl, beperkingen overwinnen, notities maken in boeken, fysiotherapie, assistenten inhuren en de kwestie van ChatGPT die hallucinaties met feiten vermengt.",
      "De discussies presenteren verschillende perspectieven, ervaringen en meningen over deze onderwerpen en bieden waardevolle inzichten en mogelijke oplossingen.",
      "Deze functie biedt een unieke kans om te leren van anderen in de tech-community en verschillende perspectieven te krijgen op verschillende onderwerpen."
    ],
    "points": 259,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1700788523
  },
  {
    "id": 38394613,
    "title": "Manifest V3 van Chrome bedreigt advertentieblokkers, kan gebruikers naar Firefox duwen",
    "originLink": "https://www.malwarebytes.com/blog/news/2023/11/chrome-pushes-forward-with-plans-to-limit-ad-blockers-in-the-future",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38394613",
    "commentBody": "",
    "originSummary": [
      "Google is van plan om over te stappen van Manifest V2 naar Manifest V3, de nieuwste versie van de Chrome-extensiespecificatie, ondanks kritiek voor het beperken van advertentieblokkers",
      "Manifest V3 introduceert nieuwe beperkingen op filterregelsets, waardoor advertentieblokkers en trackerblokkers met privacybescherming minder mogelijkheden hebben",
      "De Electronic Frontier Foundation (EFF) heeft Manifest V3 bekritiseerd als misleidend en bedreigend, terwijl Firefox van plan is om het aan te nemen voor cross-browser compatibiliteit, waardoor Firefox mogelijk een betere keuze wordt voor gebruikers die volledige uitbreidingsmogelijkheden nodig hebben."
    ],
    "commentSummary": [
      "Google overweegt om advertentieblokkers in zijn Chrome-browser te beperken, wat tot bezorgdheid heeft geleid onder gebruikers en ontwikkelaars van alternatieve browsers.",
      "Browsers als Brave, Vivaldi en Opera hebben toegezegd de huidige ad-blocking functie te ondersteunen, terwijl er discussies gaande zijn over de mogelijke introductie van nieuwe mogelijkheden in Manifest V3.",
      "Gebruikers overwegen over te stappen op Firefox of andere privacy-gerichte browsers als alternatief en bespreken de beperkingen van ad-blockers, Google's controle over Chromium codebase en de impact op de kwaliteit van ad-blocking en browserprestaties. Frustratie over buitensporige advertenties, het gebrek aan ad-blockers op bepaalde apparaten en het belang van het opkomen voor gebruikersbelangen worden ook genoemd."
    ],
    "points": 241,
    "commentCount": 204,
    "retryCount": 0,
    "time": 1700757650
  },
  {
    "id": 38392540,
    "title": "Het optimaliseren van verzoekherhalingen: Exponentiële backoff en jitter",
    "originLink": "https://encore.dev/blog/retries",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38392540",
    "commentBody": "",
    "originSummary": [
      "Dit artikel gaat in op het belang van het afhandelen van mislukte verzoeken bij softwareontwikkeling en biedt inzicht in verschillende strategieën voor het opnieuw proberen van verzoeken.",
      "Het benadrukt de invloed van retries op de serverprestaties en stelt voor om exponentiële backoff en jitter te implementeren om het retry-proces te optimaliseren.",
      "Het artikel geeft een codevoorbeeld en onderstreept het belang van het aannemen van veilig retry-gedrag, terwijl ook andere gerelateerde onderwerpen kort worden genoemd."
    ],
    "commentSummary": [
      "Verzoekherhalingen en lokale stroomonderbrekers worden gebruikt om tijdelijke serverproblemen aan te pakken.",
      "Het implementeren van stroomonderbrekers vereist zowel lokale als globale besluitvorming.",
      "Overmatig opnieuw proberen kan schade veroorzaken en moet vermeden worden.",
      "Exponentiële backoff met jitter is een veelgebruikte strategie voor het bepalen van retry intervallen.",
      "Er zijn verschillende strategieën nodig voor het afhandelen van machine-gegenereerde verzoeken.",
      "Het artikel vermeldt de technologie die wordt gebruikt voor animaties en de beschikbaarheid van broncode voor visualisatieposten.",
      "Het negeren van strategieën voor het afhandelen van mislukte verzoeken kan gevolgen hebben.",
      "Er zijn risico's op zelf toegebrachte DDoS-aanvallen (Distributed Denial of Service)."
    ],
    "points": 229,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1700746336
  }
]
