[
  {
    "id": 40699684,
    "title": "MicroMac, en Macintosh for under £5",
    "originLink": "https://axio.ms/projects/2024/06/16/MicroMac.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699684",
    "commentBody": "",
    "originSummary": [
      "Et projekt ved navn Pico-mac bruger en Raspberry Pi RP2040 mikrocontroller til at emulere en Macintosh 128K, hvilket gør det muligt at køre gammel Macintosh-software.",
      "RP2040's 264KB RAM og 2MB flashhukommelse er tilstrækkeligt til at rumme Mac'ens 128KB hukommelse, emulatoren og en diskbillede med operativsystemet og software.",
      "Projektet involverede at bygge en Mac 128K emulator, skabe et kredsløb til VGA video output og optimere ydeevnen gennem overclocking og forbedringer af fortolkeren, hvilket opnåede omkring 1,4 MIPS."
    ],
    "commentSummary": [
      "MicroMac, en Macintosh til under £5, har tiltrukket betydelig opmærksomhed og fremhæver en lavpris, gør-det-selv tilgang til retrocomputing.",
      "Projektet involverer brugen af RP2040-mikrocontrolleren til at emulere en 68k Macintosh, hvilket giver en mere autentisk oplevelse end blot at køre en emulator på Linux.",
      "Diskussionen berører også udfordringerne og de kreative løsninger ved at skaffe gamle teknologikomponenter, hvilket understreger fællesskabets opfindsomhed og interesse i retro-computing-projekter."
    ],
    "points": 774,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1718568167
  },
  {
    "id": 40707558,
    "title": "FTC sagsøger Adobe for at skjule gebyrer og hæmme aflysninger",
    "originLink": "https://www.ftc.gov/news-events/news/press-releases/2024/06/ftc-takes-action-against-adobe-executives-hiding-fees-preventing-consumers-easily-cancelling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40707558",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "FTC har anlagt sag mod Adobe for at skjule gebyrer og gøre aflysninger vanskelige, hvilket adresserer vildledende praksis i deres abonnementsmodel.",
      "Adobes skift fra engangsbetaling til abonnementsmodel har ført til øgede omkostninger og drevet brugere til at søge alternativer som Procreate, DaVinci og Affinity.",
      "Retssagen søger at stoppe Adobes aggressive taktikker og give refusioner til berørte forbrugere, hvilket fremhæver bredere problemer med SaaS (Software as a Service) modeller."
    ],
    "points": 624,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1718641793
  },
  {
    "id": 40702782,
    "title": "Sådan får du ting repareret, når producenten ikke vil: tag dem i retten",
    "originLink": "https://blog.simonrumble.com/how-to-get-your-stuff-repaired-when-the-retailer-and-manufacturer-dont-wanna-take-em-to-court",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702782",
    "commentBody": "",
    "originSummary": [
      "Forfatteren oplevede en fejl med deres Electrolux-ovn og blev opkrævet $160 for en diagnose, på trods af at australsk forbrugerlovgivning giver en automatisk garanti for en rimelig produktlevetid.",
      "Efter mislykkede forhandlinger med både producenten og forhandleren indgav forfatteren en klage til NSW Civil and Administrative Tribunal (NCAT), hvilket førte til, at forhandleren dækkede reparationsomkostningerne for at undgå tribunaludgifter.",
      "Forfatteren opfordrer andre til at hævde deres forbrugerrettigheder og ikke nøjes med minimale garantiperioder, idet han fremhæver vigtigheden af juridiske veje som NCAT til at løse sådanne tvister."
    ],
    "commentSummary": [
      "I Australien tilbyder NSW Civil and Administrative Tribunal (NCAT) en billig og enkel måde at håndtere forbrugerkrav på, ofte uden behov for en advokat.",
      "Der findes lignende systemer i andre regioner, såsom Storbritanniens småkravsdomstole og EU's toårige produktgarantimandat.",
      "I USA kan småkravsdomstolen eller indgivelse af en klage til statens justitsministerkontor være effektivt for forbrugertvister."
    ],
    "points": 376,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1718604890
  },
  {
    "id": 40704428,
    "title": "At blive fyret og uplanlagt iværksætteri",
    "originLink": "https://www.deepsouthventures.com/on-being-laid-off-unplanned-entrepreneurship/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40704428",
    "commentBody": "",
    "originSummary": [
      "Peter Askews rejse ind i iværksætteri begyndte efter flere afskedigelser, hvilket fik ham til at finde alternative indtægtskilder.",
      "Ved at udnytte sin baggrund inden for webanalyse og betalt søgning, havde han oprindeligt succes ved at bruge annoncenetværk på højtrafik-websteder, og han lærte efterhånden at kode og erhvervede premium-domæner som DudeRanch.com.",
      "Med vægt på uafhængighed finansierer Peter sine projekter alene, undgår ekstern kontrol og finder tilfredshed i sin selvstændige iværksættervej."
    ],
    "commentSummary": [
      "Efter en mislykket startup startede forfatteren en ny virksomhed med fokus på selvstændig prototyping, implementering af lean-principper og generering af indtægter fra starten.",
      "Selvom forfatteren ikke er ingeniør, lykkedes det dem at bygge og markedsføre produktet, hvilket førte til en bæredygtig virksomhed, der finansierer deres børns uddannelse.",
      "Forfatteren fremhæver det amerikanske sundhedssystem som en betydelig hindring for iværksætteri og antyder, at universel sundhedspleje kunne fremme væksten af små virksomheder."
    ],
    "points": 318,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1718622880
  },
  {
    "id": 40699470,
    "title": "NumPy 2.0",
    "originLink": "https://numpy.org/devdocs/release/2.0.0-notes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699470",
    "commentBody": "",
    "originSummary": [
      "NumPy 2.0.0 er den første større udgivelse siden 2006, udviklet over 11 måneder af 212 bidragydere, med betydelige nye funktioner, ydeevneforbedringer og ændringer, der bryder kompatibiliteten med både Python- og C-API'er.",
      "Vigtige opdateringer inkluderer en ny variabel-længde streng dtype, accelererede sorteringsfunktioner og en klar opdeling mellem offentlige og private API'er, sammen med nye offentlige C API'er til oprettelse af brugerdefinerede dtypes.",
      "Brugere bør være opmærksomme på ændringer, der bryder kompatibiliteten, og problemer med bagudkompatibilitet, med migrationsvejledninger til rådighed for at hjælpe med at opdatere koden."
    ],
    "commentSummary": [
      "NumPy 2.0 er blevet udgivet og introducerer betydelige ændringer, herunder udfasning af visse offentlige API'er og ny support til strengrutiner.",
      "Udgivelsen sigter mod at adressere historiske svagheder i strengoperationer inden for NumPy, hvilket potentielt kan gavne NLP (Natural Language Processing) og LLM (Large Language Model) anvendelsestilfælde.",
      "Kompatibilitet med NumPy 1.x er for det meste opretholdt, bortset fra funktionen \"byte_bounds\", og brugere rådes til at fastlåse afhængigheder for at undgå problemer under overgangen."
    ],
    "points": 299,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1718566343
  },
  {
    "id": 40699583,
    "title": "Bouba/kiki-effekten",
    "originLink": "https://en.wikipedia.org/wiki/Bouba/kiki_effect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699583",
    "commentBody": "",
    "originSummary": [
      "Effekten Bouba/Kiki er en mental association, hvor \"bouba\" forbindes med runde former og \"kiki\" med spidse former, observeret globalt.",
      "Dette fænomen, som først blev bemærket i 1920'erne, er tydeligt hos spædbørn og små børn, hvilket indikerer dets potentielle rolle i sprogindlæring.",
      "fMRI-studier viser hjerneaktiveringsmønstre relateret til denne lyd-form-matching, hvilket giver indsigt i sprogets evolution og lydsymbolik, selvom effekten kan variere afhængigt af kultur og sprog."
    ],
    "commentSummary": [
      "Reggio Emilia undervisningsmetoder, ligesom Montessori, lægger vægt på tværmodalle former for udtryk, såsom at oversætte auditive oplevelser til visuelle.",
      "Effekten Bouba-Kiki, hvor børn naturligt forbinder sensoriske modaliteter, fremhæves, idet det bemærkes, at denne evne ofte aftager hos voksne.",
      "Diskussionen omfatter, om denne formindskelse skyldes hæmning eller hjerneudvikling, og hvordan sprog- og kulturelle faktorer påvirker opfattelse og navngivningskonventioner."
    ],
    "points": 246,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1718567416
  },
  {
    "id": 40702146,
    "title": "Jeg lærte Haskell på kun 15 år",
    "originLink": "https://duckrabbit.tech/articles/learning-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702146",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Indlægget diskuterer humoristisk den lange indlæringskurve for Haskell, et funktionelt programmeringssprog, samtidig med at det understreger fordelene ved funktionel programmering.",
      "Det fremhæver, at funktionel programmering, selvom det er udfordrende, tilbyder værdifulde lektioner i softwaredesign, som kan anvendes på andre programmeringsparadigmer.",
      "Diskussionen foreslår F# som et mere tilgængeligt alternativ for begyndere, da det understøtter både funktionel og objektorienteret programmering, hvilket gør indlæringskurven lettere."
    ],
    "points": 245,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1718595860
  },
  {
    "id": 40705222,
    "title": "Byttekort med e-ink skærme (2023)",
    "originLink": "https://howtoware.co/wyldcard",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40705222",
    "commentBody": "",
    "originSummary": [
      "Wyldcards er plastikkort med E-Ink, der har udskiftelige billeder og hukommelseschips til at gemme spilstatistikker. De tilbyder nye spilmekanikker, samtidig med at de bevarer en fysisk fornemmelse.",
      "Projektet var inspireret af fiktive spil som Yu-Gi-Oh og Card Captors, og skaberens baggrund inden for softwareudvikling og IoT 3D-printning muliggjorde dets udvikling.",
      "Efter et viralt opslag på Hacker News indsamlede en crowdfunding-kampagne på CrowdSupply $7277, hvilket førte til produktionen af 25 DevKits og planer for fremtidig spiludvikling."
    ],
    "commentSummary": [
      "Handelskort med e-ink-skærme er under udvikling og tilbyder en ny drejning på traditionelle kortspil ved at tillade dynamisk indhold og datalagring.",
      "Skaberen, Jonahss, nævner, at disse kort kan gemme spildata, hvilket gør hvert kort unikt baseret på dets brug, ligesom et legacy-stil spil snarere end et traditionelt samlekortspil.",
      "Projektet er stadig i sine tidlige faser, med fokus i øjeblikket på at levere crowdfundede udviklingssæt og udforske potentielle spildesigns og applikationer."
    ],
    "points": 241,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1718629469
  },
  {
    "id": 40705196,
    "title": "DJI-forbud vedtages i Repræsentanternes Hus og går videre til Senatet",
    "originLink": "https://dronedj.com/2024/06/14/dji-ban-passes-the-house-and-moves-on-to-the-senate/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40705196",
    "commentBody": "",
    "originSummary": [
      "Repræsentanternes Hus i USA har vedtaget et forbud mod DJI, en førende droneproducent, og lovforslaget er nu på vej til Senatet til overvejelse.",
      "Dette lovgivningsmæssige tiltag kunne have en betydelig indvirkning på droneindustrien, givet DJIs fremtrædende markedsposition.",
      "Forbuddet er en del af bredere bekymringer over national sikkerhed og databeskyttelse relateret til kinesiske teknologivirksomheder."
    ],
    "commentSummary": [
      "Repræsentanternes Hus i USA har vedtaget et forbud mod DJI-droner, som nu afventer godkendelse i Senatet, hvilket har udløst debatter om databeskyttelse og brugen af kinesiske produkter i USA.",
      "Critikere hævder, at Kongressen også bør undersøge ikke-kinesiske produkter, mens nogle brugere ikke stoler på DJI på grund af privatlivs- og app-problemer, på trods af dets overlegne teknologi.",
      "Det forbud betragtes som protektionisme, der potentielt kan gavne amerikanske virksomheder som Skydio, og har betydelige konsekvenser for sektorer som retshåndhævelse og offentlig sikkerhed, der er afhængige af DJI-droner."
    ],
    "points": 220,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1718629235
  },
  {
    "id": 40699504,
    "title": "Første kig på den kommende Starlink Mini",
    "originLink": "https://www.starlinkhardware.com/first-look-at-the-upcoming-starlink-mini/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699504",
    "commentBody": "",
    "originSummary": [
      "Starlink har modtaget FCC-godkendelse for den nye Starlink Mini parabolens Wifi-router, hvilket indikerer en forestående lancering.",
      "Starlink Mini, designet til bærbarhed, er ideel til camping, autocampere og vandreture, og har en indbygget Wifi-router og mesh-kompatibilitet for udvidet dækning.",
      "Den opdaterede Starlink-app inkluderer nu detaljer om Mini, en ny butiksside og udviklertilstandssider, hvilket tyder på, at lanceringen kun er få uger væk."
    ],
    "commentSummary": [
      "Den kommende Starlink Mini er betydeligt mindre end den nuværende Starlink Standard, med dimensioner på 29 cm x 25 cm sammenlignet med 59,5 cm x 38 cm.",
      "Diskussioner fremhæver potentialet for, at Starlink Mini kan være mere bærbar og anvendelig til aktiviteter som backpacking, især hvis funktioner som varmeelementet kan deaktiveres for at spare strøm.",
      "Starlink Mini kunne fungere som en mere praktisk backup-internetløsning i landdistrikter, med fleksible abonnementsmuligheder, der giver brugerne mulighed for kun at aktivere tjenesten, når det er nødvendigt."
    ],
    "points": 188,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1718566767
  },
  {
    "id": 40707037,
    "title": "USA sagsøger Adobe for 'vildledende' abonnementer, der er for svære at opsige",
    "originLink": "https://www.theverge.com/2024/6/17/24180196/adobe-us-ftc-doj-sues-subscriptions-cancel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40707037",
    "commentBody": "",
    "originSummary": [
      "Den amerikanske regering sagsøger Adobe for angiveligt at skjule gebyrer og komplicere processen for opsigelse af abonnement.",
      "Justitsministeriet hævder, at Adobe tilmeldte forbrugere til dyre planer uden klar oplysning om vilkårene, herunder gebyrer for tidlig opsigelse, og gjorde afbestillingsprocessen besværlig.",
      "Retssagen retter sig mod Adobe-direktørerne Maninder Sawhney og David Wadhwani og følger Adobes skift til en abonnementsmodel i 2012 samt den nylige modreaktion på virksomhedens AI-træningsbetingelser."
    ],
    "commentSummary": [
      "Den amerikanske regering sagsøger Adobe og hævder, at virksomheden har gjort det vanskeligt for kunder at opsige abonnementer.",
      "Federal Trade Commission (FTC) hævder, at Adobe brugte skjulte gebyrer til at fange kunder, hvilket har ført til retssager.",
      "Der bliver lavet sammenligninger med Apples mere ligetil proces for opsigelse af abonnementer, hvilket fremhæver problemets betydning."
    ],
    "points": 176,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1718639935
  },
  {
    "id": 40701310,
    "title": "De laver nu USB-C kabler med skærme",
    "originLink": "https://ounapuu.ee/posts/2024/06/05/usb-c-cables/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40701310",
    "commentBody": "",
    "originSummary": [
      "USB-C kabler med indbyggede displays er nu tilgængelige, som viser strømforbrug for at hjælpe med at overvåge opladningshastigheder.",
      "Disse kabler understøtter USB 4, hvilket kan gøre dem en smule stive, men de fungerer godt med højopløsningsskærme og dockingstationer.",
      "Brugere bør være opmærksomme på potentielle skjulte ondsindede chips i disse kabler."
    ],
    "commentSummary": [
      "USB-C kabler med displays er nu tilgængelige, hvilket gør det muligt for brugere at se strømforbruget direkte på kablet.",
      "Til sammenligning har O.MG-kablet, kendt for sine avancerede sikkerhedstestfunktioner, været på markedet i nogen tid.",
      "Diskussioner fremhæver bekymringer om potentielt ondsindede chips i sådanne kabler og oplevelser med problemer som røgudvikling og skader på enheder, hvilket understreger vigtigheden af pålidelige kabler og betroede mærker som Anker."
    ],
    "points": 176,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1718584677
  },
  {
    "id": 40702546,
    "title": "Marion Stokes, kvinden der brugte over 30 år på at optage hvert minut af amerikansk tv",
    "originLink": "https://allthatsinteresting.com/marion-stokes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702546",
    "commentBody": "",
    "originSummary": [
      "Marion Stokes, en tidligere bibliotekar og borgerrettighedsaktivist, optog tv-udsendelser døgnet rundt fra 1979 til 2012 og samlede 71.000 bånd for at bevare historiske nyhedsdetaljer.",
      "Efter hendes død begyndte Internet Archive i 2013 at digitalisere hendes omfattende samling, hvilket sikrede bevarelsen af dette unikke mediearkiv.",
      "Stokes' indsats, fremhævet i dokumentaren fra 2019 \"Recorder: The Marion Stokes Project,\" understreger vigtigheden af mediebevarelse i den digitale tidsalder."
    ],
    "commentSummary": [
      "Marion Stokes optog over 30 år af amerikansk tv, hvilket skabte et betydeligt arkiv, der inkluderer reklamer og lokale nyheder, som ofte går tabt med tiden.",
      "Internet Archive er i øjeblikket ved at behandle hendes samling og fremhæver den arkivmæssige værdi af gamle VHS-bånd.",
      "Diskussioner på Hacker News berørte det praktiske ved at bruge lejligheder til opbevaring og sammenlignede Stokes' indsats med andre arkiver som Museum of Broadcast Communications og Paley Center for Media."
    ],
    "points": 174,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1718601795
  },
  {
    "id": 40700343,
    "title": "SQLite Database Explorer",
    "originLink": "https://github.com/frectonz/sqlite-studio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40700343",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "SQLite Database Explorer, et CLI-værktøj, der starter en lokal webserver, modtog betydelig opmærksomhed og ros for sin rene brugergrænseflade bygget med shadcn/ui.",
      "Brugere foreslog forbedringer såsom at tilføje skærmbilleder til README og lave sammenligninger med andre værktøjer som DB Browser for SQLite.",
      "Der var bekymringer om potentielle varemærkeproblemer med navnet \"SQLite Studio,\" hvilket fik skaberen til at planlægge en omdøbning, og nogle brugere rapporterede falske positiver fra Windows Defender."
    ],
    "points": 174,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718573958
  },
  {
    "id": 40699459,
    "title": "Quake 1 potentiel original skrifttype",
    "originLink": "https://cohost.org/bekoha/post/2859948-quake-1-potential-or",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699459",
    "commentBody": "",
    "originSummary": [
      "Quake 1-skrifttypen ser ud til at være afledt af en ældre skrifttype ved navn \"Visa,\" designet af Raphael Boguslav i 1966.",
      "\"Visa\" var med i Dan X. Solos \"The Solotype Catalog of 4,147 Display Typefaces\" (1992) og \"Stencil Alphabets: 100 Complete Fonts\" (1988).",
      "Opdagelsen fremhæver de historiske rødder af Quake-skrifttypen, som forbinder den med et prisvindende design fra 1966 VGC National Type Face Design Competition."
    ],
    "commentSummary": [
      "Debatten på cohost.org drejer sig om, hvorvidt Quake 1's skrifttype er håndlavet eller afledt af eksisterende skrifttyper, med betydelige forskelle bemærket i specifikke bogstaver.",
      "Visse brugere spekulerer i, at skrifttypen måske er inspireret af stencil-designs eller nye skrifttyper som Democratica, mens andre foreslår at konsultere de oprindelige designere for klarhed.",
      "Diskussionen udforsker også udviklingen af skrifttyper og de kreative processer, der er involveret, med en vis skepsis omkring skrifttypens brugsrettigheder."
    ],
    "points": 174,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1718566230
  }
]
