[
  {
    "id": 40699684,
    "title": "মাইক্রোম্যাক, £৫ এর নিচে একটি ম্যাকিনটোশ",
    "originLink": "https://axio.ms/projects/2024/06/16/MicroMac.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699684",
    "commentBody": "",
    "originSummary": [
      "একটি প্রকল্প যার নাম পিকো-ম্যাক, একটি র্যাস্পবেরি পাই RP2040 মাইক্রোকন্ট্রোলার ব্যবহার করে একটি ম্যাকিনটোশ ১২৮কে অনুকরণ করে, যা পুরানো ম্যাকিনটোশ সফটওয়্যার চালাতে সক্ষম করে।",
      "RP2040-এর ২৬৪ কিলোবাইট RAM এবং ২ মেগাবাইট ফ্ল্যাশ মেমরি ম্যাকের ১২৮ কিলোবাইট মেমরি, এমুলেটর, এবং OS ও সফটওয়্যার সহ একটি ডিস্ক ইমেজ ধারণ করার জন্য যথেষ্ট।",
      "প্রকল্পটি একটি ম্যাক ১২৮কে এমুলেটর তৈরি করা, ভিজিএ ভিডিও আউটপুটের জন্য একটি সার্কিট তৈরি করা এবং ওভারক্লকিং ও ইন্টারপ্রেটার উন্নতির মাধ্যমে কর্মক্ষমতা অপ্টিমাইজ করা, প্রায় ১.৪ এমআইপিএস অর্জন করা।"
    ],
    "commentSummary": [
      "মাইক্রোম্যাক, যা £৫-এর নিচে একটি ম্যাকিনটোশ, উল্লেখযোগ্য মনোযোগ আকর্ষণ করেছে, যা রেট্রো কম্পিউটিংয়ের জন্য একটি কম খরচের, ডিআইওয়াই পদ্ধতির উপর আলোকপাত করে।",
      "প্রকল্পটি RP2040 মাইক্রোকন্ট্রোলার ব্যবহার করে একটি 68k ম্যাকিনটোশ অনুকরণ করার বিষয়ে, যা শুধুমাত্র লিনাক্সে একটি এমুলেটর চালানোর চেয়ে আরও প্রামাণিক অভিজ্ঞতা প্রদান করে।",
      "আলোচনাটি পুরানো প্রযুক্তি উপাদান সংগ্রহের চ্যালেঞ্জ এবং সৃজনশীল সমাধানগুলির উপরও আলোকপাত করে, যা সম্প্রদায়ের সম্পদশীলতা এবং রেট্রো কম্পিউটিং প্রকল্পগুলির প্রতি আগ্রহকে জোর দেয়।"
    ],
    "points": 774,
    "commentCount": 119,
    "retryCount": 0,
    "time": 1718568167
  },
  {
    "id": 40707558,
    "title": "এফটিসি অ্যাডোবের বিরুদ্ধে ফি লুকানো এবং বাতিলকরণে বাধা দেওয়ার অভিযোগে মামলা করেছে",
    "originLink": "https://www.ftc.gov/news-events/news/press-releases/2024/06/ftc-takes-action-against-adobe-executives-hiding-fees-preventing-consumers-easily-cancelling",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40707558",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "এফটিসি অ্যাডোবির বিরুদ্ধে মামলা দায়ের করেছে ফি গোপন করা এবং বাতিলকরণ কঠিন করার জন্য, তাদের সাবস্ক্রিপশন মডেলে প্রতারণামূলক কার্যকলাপের সমাধান করতে।",
      "অ্যাডোবির একবারের পেমেন্ট সফটওয়্যার থেকে সাবস্ক্রিপশন মডেলে পরিবর্তন খরচ বাড়িয়েছে এবং ব্যবহারকারীদের প্রোক্রিয়েট, ডা ভিঞ্চি এবং অ্যাফিনিটির মতো বিকল্প খুঁজতে বাধ্য করেছে।",
      "মামলাটি অ্যাডোবির আক্রমণাত্মক কৌশলগুলি বন্ধ করতে এবং প্রভাবিত ভোক্তাদের ফেরত প্রদান করতে চায়, যা SaaS (সফটওয়্যার অ্যাজ এ সার্ভিস) মডেলগুলির সাথে বৃহত্তর সমস্যাগুলি তুলে ধরে।"
    ],
    "points": 624,
    "commentCount": 242,
    "retryCount": 0,
    "time": 1718641793
  },
  {
    "id": 40702782,
    "title": "যখন প্রস্তুতকারক মেরামত করতে চায় না তখন কীভাবে জিনিসপত্র মেরামত করবেন: তাদের আদালতে নিয়ে যান",
    "originLink": "https://blog.simonrumble.com/how-to-get-your-stuff-repaired-when-the-retailer-and-manufacturer-dont-wanna-take-em-to-court",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702782",
    "commentBody": "",
    "originSummary": [
      "লেখক তাদের ইলেক্ট্রোলাক্স ওভেনের সাথে একটি ত্রুটির সম্মুখীন হন এবং একটি নির্ণয়ের জন্য $160 চার্জ করা হয়, যদিও অস্ট্রেলিয়ান ভোক্তা আইন একটি যুক্তিসঙ্গত পণ্যের আয়ুষ্কালের জন্য স্বয়ংক্রিয় ওয়ারেন্টি প্রদান করে।",
      "উৎপাদক এবং খুচরা বিক্রেতার সাথে ব্যর্থ আলোচনার পর, লেখক এনএসডব্লিউ সিভিল এবং অ্যাডমিনিস্ট্রেটিভ ট্রাইব্যুনাল (এনসিএটি)-এ একটি অভিযোগ দায়ের করেন, যার ফলে খুচরা বিক্রেতা ট্রাইব্যুনালের খরচ এড়াতে মেরামতের খরচ বহন করতে সম্মত হয়।",
      "লেখক অন্যদের তাদের ভোক্তা অধিকার প্রতিষ্ঠা করতে এবং ন্যূনতম ওয়ারেন্টি সময়সীমার জন্য মীমাংসা না করতে উৎসাহিত করেন, এনসিএটি-এর মতো আইনি পথের গুরুত্ব তুলে ধরে এই ধরনের বিরোধ নিষ্পত্তির জন্য।"
    ],
    "commentSummary": [
      "অস্ট্রেলিয়ায়, NSW সিভিল এবং প্রশাসনিক ট্রাইব্যুনাল (NCAT) ভোক্তা দাবিগুলি পরিচালনার জন্য একটি কম খরচে এবং সরল উপায় প্রদান করে, যা প্রায়শই একজন আইনজীবীর প্রয়োজন ছাড়াই করা যায়।",
      "অনুরূপ ব্যবস্থা অন্যান্য অঞ্চলেও বিদ্যমান, যেমন যুক্তরাজ্যের ছোট দাবির আদালত এবং ইউরোপীয় ইউনিয়নের দুই বছরের পণ্য ওয়ারেন্টি ম্যান্ডেট।",
      "যুক্তরাষ্ট্রে, ভোক্তা বিরোধের জন্য ছোট দাবির আদালত বা রাজ্যের অ্যাটর্নি জেনারেলের অফিসে অভিযোগ দায়ের করা কার্যকর হতে পারে।"
    ],
    "points": 376,
    "commentCount": 293,
    "retryCount": 0,
    "time": 1718604890
  },
  {
    "id": 40704428,
    "title": "চাকরি হারানো এবং অনিয়োজিত উদ্যোক্তা হওয়া",
    "originLink": "https://www.deepsouthventures.com/on-being-laid-off-unplanned-entrepreneurship/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40704428",
    "commentBody": "",
    "originSummary": [
      "পিটার আসকিউর উদ্যোক্তা যাত্রা শুরু হয়েছিল একাধিক চাকরি হারানোর পর, যা তাকে বিকল্প আয়ের উৎস খুঁজতে বাধ্য করেছিল।",
      "ওয়েব অ্যানালিটিক্স এবং পেইড সার্চে তার পটভূমি কাজে লাগিয়ে, তিনি প্রাথমিকভাবে উচ্চ-ট্রাফিক ওয়েবসাইটে বিজ্ঞাপন নেটওয়ার্ক ব্যবহার করে সফল হন, পরবর্তীতে কোডিং শিখে এবং DudeRanch.com এর মতো প্রিমিয়াম ডোমেইন অর্জন করেন।",
      "স্বাধীনতার উপর জোর দিয়ে, পিটার তার প্রকল্পগুলি এককভাবে অর্থায়ন করেন, বাহ্যিক নিয়ন্ত্রণ এড়িয়ে চলেন এবং তার স্ব-চালিত উদ্যোক্তা পথে সন্তুষ্টি খুঁজে পান।"
    ],
    "commentSummary": [
      "লেখক একটি ব্যর্থ স্টার্টআপের পর একটি নতুন ব্যবসা শুরু করেন, স্বাধীনভাবে প্রোটোটাইপিং, লীন নীতিমালা প্রয়োগ এবং শুরু থেকেই রাজস্ব উৎপাদনের উপর মনোযোগ দিয়ে।",
      "যদিও লেখক একজন প্রকৌশলী নন, তিনি সফলভাবে পণ্যটি তৈরি এবং বাজারজাত করেছেন, যা একটি টেকসই ব্যবসায় পরিণত হয়েছে এবং তাদের সন্তানের শিক্ষার জন্য অর্থায়ন করে।",
      "লেখক যুক্তরাষ্ট্রের স্বাস্থ্যসেবা ব্যবস্থাকে উদ্যোক্তাদের জন্য একটি গুরুত্বপূর্ণ বাধা হিসেবে উল্লেখ করেছেন এবং প্রস্তাব করেছেন যে সার্বজনীন স্বাস্থ্যসেবা ছোট ব্যবসার বৃদ্ধি প্রচার করতে পারে।"
    ],
    "points": 318,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1718622880
  },
  {
    "id": 40699470,
    "title": "নামপাই ২.০",
    "originLink": "https://numpy.org/devdocs/release/2.0.0-notes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699470",
    "commentBody": "",
    "originSummary": [
      "NumPy 2.0.0 হল ২০০৬ সালের পর প্রথম প্রধান সংস্করণ, যা ১১ মাস ধরে ২১২ জন অবদানকারীর দ্বারা উন্নত করা হয়েছে, এতে উল্লেখযোগ্য নতুন বৈশিষ্ট্য, কর্মক্ষমতা উন্নতি এবং Python এবং C API উভয়ের জন্য গুরুত্বপূর্ণ পরিবর্তন অন্তর্ভুক্ত রয়েছে।",
      "মূল আপডেটগুলির মধ্যে রয়েছে একটি নতুন পরিবর্তনশীল দৈর্ঘ্যের স্ট্রিং dtype, দ্রুততর বাছাই ফাংশন, এবং পাবলিক ও প্রাইভেট API গুলির মধ্যে একটি স্পষ্ট বিভাজন, পাশাপাশি কাস্টম dtype তৈরি করার জন্য নতুন পাবলিক C API।",
      "ব্যবহারকারীদের ভাঙা পরিবর্তন এবং পিছনের সামঞ্জস্যতা সমস্যাগুলি সম্পর্কে সচেতন হওয়া উচিত, কোড আপডেট করতে সহায়তার জন্য মাইগ্রেশন গাইড সরবরাহ করা হয়েছে।"
    ],
    "commentSummary": [
      "NumPy 2.0 প্রকাশিত হয়েছে, যা উল্লেখযোগ্য পরিবর্তনগুলি নিয়ে এসেছে, যার মধ্যে কিছু পাবলিক API-এর অবসান এবং স্ট্রিং রুটিনগুলির জন্য নতুন সমর্থন অন্তর্ভুক্ত রয়েছে।",
      "এই রিলিজটি NumPy-তে স্ট্রিং অপারেশনগুলির ঐতিহাসিক দুর্বলতাগুলি সমাধান করার লক্ষ্য রাখে, যা সম্ভাব্যভাবে NLP (ন্যাচারাল ল্যাঙ্গুয়েজ প্রসেসিং) এবং LLM (লার্জ ল্যাঙ্গুয়েজ মডেল) ব্যবহারের ক্ষেত্রে উপকারে আসতে পারে।",
      "NumPy 1.x এর সাথে সামঞ্জস্যতা বেশিরভাগই বজায় রাখা হয়েছে, শুধুমাত্র \"byte_bounds\" ফাংশনটি ব্যতিক্রম। এবং ব্যবহারকারীদের পরামর্শ দেওয়া হচ্ছে যে তারা নির্ভরশীলতাগুলি পিন করে রাখুন যাতে পরিবর্তনের সময় কোনো সমস্যা না হয়।"
    ],
    "points": 299,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1718566343
  },
  {
    "id": 40699583,
    "title": "বুবা/কিকি প্রভাব",
    "originLink": "https://en.wikipedia.org/wiki/Bouba/kiki_effect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699583",
    "commentBody": "",
    "originSummary": [
      "বুবা/কিকি প্রভাব একটি মানসিক সংযোগ যেখানে \"বুবা\" গোলাকার আকারের সাথে এবং \"কিকি\" কাঁটাযুক্ত আকারের সাথে যুক্ত হয়, যা বিশ্বব্যাপী পর্যবেক্ষণ করা হয়েছে।",
      "এই ঘটনাটি প্রথম ১৯২০-এর দশকে লক্ষ্য করা হয়েছিল, যা শিশু ও কিশোরদের মধ্যে স্পষ্টভাবে দেখা যায়, এবং এটি ভাষা শিক্ষার ক্ষেত্রে এর সম্ভাব্য ভূমিকা নির্দেশ করে।",
      "fMRI গবেষণাগুলি এই শব্দ-আকৃতি মিলের সাথে সম্পর্কিত মস্তিষ্কের সক্রিয়করণের নিদর্শনগুলি দেখায়, যা ভাষার বিবর্তন এবং শব্দ প্রতীকবাদের উপর অন্তর্দৃষ্টি প্রদান করে, যদিও এই প্রভাব সংস্কৃতি এবং ভাষা অনুযায়ী পরিবর্তিত হতে পারে।"
    ],
    "commentSummary": [
      "রেজিও এমিলিয়া শিক্ষাদান পদ্ধতি, মন্টেসরির মতো, বহুমাত্রিক প্রকাশের উপর জোর দেয়, যেমন শ্রবণ অভিজ্ঞতাকে দৃশ্যমান অভিজ্ঞতায় রূপান্তরিত করা।",
      "বৌবা-কিকি প্রভাব, যেখানে শিশুরা প্রাকৃতিকভাবে সংবেদনশীল মোডালিটিগুলিকে সংযুক্ত করে, তা উল্লেখ করা হয়েছে, এবং এই ক্ষমতা প্রায়ই প্রাপ্তবয়স্কদের মধ্যে হ্রাস পায়।",
      "আলোচনায় অন্তর্ভুক্ত রয়েছে এই হ্রাসটি বাধা বা মস্তিষ্কের বিকাশের কারণে কিনা, এবং ভাষা ও সাংস্কৃতিক উপাদানগুলি কীভাবে উপলব্ধি ও নামকরণের প্রথাগুলিকে প্রভাবিত করে।"
    ],
    "points": 246,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1718567416
  },
  {
    "id": 40702146,
    "title": "আমি মাত্র ১৫ বছরে Haskell শিখেছি",
    "originLink": "https://duckrabbit.tech/articles/learning-haskell.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702146",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "পোস্টটি হাস্যরসাত্মকভাবে হ্যাস্কেল, একটি ফাংশনাল প্রোগ্রামিং ভাষার দীর্ঘ শিক্ষণ প্রক্রিয়া নিয়ে আলোচনা করে, একই সাথে ফাংশনাল প্রোগ্রামিংয়ের সুবিধাগুলির উপর জোর দেয়।",
      "এটি উল্লেখ করে যে কার্যকরী প্রোগ্রামিং, যদিও চ্যালেঞ্জিং, সফটওয়্যার ডিজাইনে মূল্যবান পাঠ প্রদান করে যা অন্যান্য প্রোগ্রামিং প্যারাডাইমে প্রয়োগ করা যেতে পারে।",
      "আলোচনায় প্রস্তাব করা হয়েছে যে F# নবীনদের জন্য একটি আরও সহজলভ্য বিকল্প, কারণ এটি উভয় কার্যকরী এবং অবজেক্ট-ওরিয়েন্টেড প্রোগ্রামিং সমর্থন করে, যা শেখার প্রক্রিয়াকে সহজ করে।"
    ],
    "points": 245,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1718595860
  },
  {
    "id": 40705222,
    "title": "ই-ইঙ্ক ডিসপ্লে সহ ট্রেডিং কার্ড (২০২৩)",
    "originLink": "https://howtoware.co/wyldcard",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40705222",
    "commentBody": "",
    "originSummary": [
      "ওয়াইল্ডকার্ডস হল প্লাস্টিকের ই-ইঙ্ক ট্রেডিং কার্ড যা পরিবর্তনযোগ্য ছবি এবং মেমরি চিপস নিয়ে আসে, যা গেমের পরিসংখ্যান সংরক্ষণ করে এবং নতুন গেম মেকানিক্স প্রদান করে, একই সাথে একটি শারীরিক অনুভূতি বজায় রাখে।",
      "প্রকল্পটি ইউ-গি-ওহ এবং কার্ড ক্যাপ্টরস-এর মতো কাল্পনিক গেম দ্বারা অনুপ্রাণিত হয়েছিল, এবং স্রষ্টার সফটওয়্যার ডেভেলপমেন্ট এবং আইওটি 3ডি প্রিন্টিং-এর পটভূমি এর উন্নয়নকে সহজতর করেছিল।",
      "হ্যাকার নিউজে একটি ভাইরাল পোস্টের পর, ক্রাউডসাপ্লাইয়ে একটি ক্রাউডফান্ডিং প্রচারণা $৭২৭৭ সংগ্রহ করে, যার ফলে ২৫টি ডেভকিট উৎপাদন এবং ভবিষ্যতে গেম ডেভেলপমেন্টের পরিকল্পনা করা হয়।"
    ],
    "commentSummary": [
      "ই-ইঙ্ক ডিসপ্লে সহ ট্রেডিং কার্ডগুলি উন্নয়ন করা হচ্ছে, যা গতিশীল কন্টেন্ট এবং ডেটা সংরক্ষণের মাধ্যমে ঐতিহ্যবাহী কার্ড গেমগুলিতে একটি নতুন মোড় আনছে।",
      "স্রষ্টা, জোনাস, উল্লেখ করেছেন যে এই কার্ডগুলি গেমের ডেটা সংরক্ষণ করতে পারে, যার ফলে প্রতিটি কার্ড তার ব্যবহারের উপর ভিত্তি করে অনন্য হয়ে ওঠে, যা একটি ঐতিহ্যবাহী ট্রেডিং কার্ড গেমের পরিবর্তে একটি লিগ্যাসি-স্টাইল গেমের মতো।",
      "প্রকল্পটি এখনও তার প্রাথমিক পর্যায়ে রয়েছে, বর্তমানে ক্রাউডফান্ডেড ডেভেলপমেন্ট কিট সরবরাহ এবং সম্ভাব্য গেম ডিজাইন ও অ্যাপ্লিকেশনগুলি অন্বেষণ করার উপর মনোযোগ কেন্দ্রীভূত রয়েছে।"
    ],
    "points": 241,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1718629469
  },
  {
    "id": 40705196,
    "title": "ডিজেআই নিষেধাজ্ঞা হাউসে পাস হয়েছে এবং এখন সেনেটে যাচ্ছে",
    "originLink": "https://dronedj.com/2024/06/14/dji-ban-passes-the-house-and-moves-on-to-the-senate/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40705196",
    "commentBody": "",
    "originSummary": [
      "মার্কিন যুক্তরাষ্ট্রের প্রতিনিধি পরিষদ একটি শীর্ষস্থানীয় ড্রোন নির্মাতা DJI-এর উপর নিষেধাজ্ঞা পাস করেছে, এবং বিলটি এখন বিবেচনার জন্য সেনেটে যাচ্ছে।",
      "এই আইনগত পদক্ষেপটি ড্রোন শিল্পে উল্লেখযোগ্য প্রভাব ফেলতে পারে, যেহেতু DJI এর বাজারে প্রধান অবস্থান রয়েছে।",
      "এই নিষেধাজ্ঞা চীনা প্রযুক্তি কোম্পানিগুলির সাথে সম্পর্কিত জাতীয় নিরাপত্তা এবং ডেটা গোপনীয়তা নিয়ে বিস্তৃত উদ্বেগের অংশ।"
    ],
    "commentSummary": [
      "মার্কিন যুক্তরাষ্ট্রের হাউস ড্রোন নির্মাতা DJI-এর উপর নিষেধাজ্ঞা পাস করেছে, যা এখন সেনেটের অনুমোদনের অপেক্ষায় রয়েছে, ডেটা গোপনীয়তা এবং মার্কিন যুক্তরাষ্ট্রে চীনা পণ্যের ব্যবহারের বিষয়ে বিতর্ক উস্কে দিয়েছে।",
      "সমালোচকরা যুক্তি দেন যে কংগ্রেসের উচিত চীনা-বহির্ভূত পণ্যগুলিও পর্যালোচনা করা, যখন কিছু ব্যবহারকারী গোপনীয়তা এবং অ্যাপ সংক্রান্ত সমস্যার কারণে DJI-কে অবিশ্বাস করেন, যদিও এর প্রযুক্তি উন্নত।",
      "এই নিষেধাজ্ঞাটি সুরক্ষাবাদ হিসেবে দেখা হচ্ছে, যা Skydio-এর মতো মার্কিন কোম্পানিগুলির জন্য উপকারী হতে পারে এবং আইন প্রয়োগ ও জননিরাপত্তার মতো খাতগুলির জন্য গুরুত্বপূর্ণ প্রভাব ফেলতে পারে যারা DJI ড্রোনের উপর নির্ভরশীল।"
    ],
    "points": 220,
    "commentCount": 360,
    "retryCount": 0,
    "time": 1718629235
  },
  {
    "id": 40699504,
    "title": "প্রথমবারের মতো আসন্ন স্টারলিংক মিনি দেখুন",
    "originLink": "https://www.starlinkhardware.com/first-look-at-the-upcoming-starlink-mini/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699504",
    "commentBody": "",
    "originSummary": [
      "স্টারলিংক নতুন স্টারলিংক মিনি ডিশের ওয়াইফাই রাউটারের জন্য FCC অনুমোদন পেয়েছে, যা শীঘ্রই লঞ্চের ইঙ্গিত দেয়।",
      "স্টারলিংক মিনি, যা বহনযোগ্যতার জন্য ডিজাইন করা হয়েছে, ক্যাম্পিং, আরভি এবং হাইকিংয়ের জন্য আদর্শ, এতে একটি বিল্ট-ইন ওয়াইফাই রাউটার এবং বিস্তৃত কভারেজের জন্য মেশ সামঞ্জস্যতা রয়েছে।",
      "আপডেটেড স্টারলিংক অ্যাপে এখন মিনি সম্পর্কে বিস্তারিত, একটি নতুন শপ পেজ এবং ডেভেলপার মোড পেজ অন্তর্ভুক্ত করা হয়েছে, যা ইঙ্গিত দেয় যে লঞ্চটি মাত্র কয়েক সপ্তাহ দূরে।"
    ],
    "commentSummary": [
      "আসন্ন স্টারলিংক মিনি বর্তমান স্টারলিংক স্ট্যান্ডার্ডের তুলনায় উল্লেখযোগ্যভাবে ছোট, যার মাত্রা ২৯ সেমি x ২৫ সেমি, যেখানে স্টারলিংক স্ট্যান্ডার্ডের মাত্রা ৫৯.৫ সেমি x ৩৮ সেমি।",
      "আলোচনাগুলো স্টারলিংক মিনি-এর সম্ভাবনা তুলে ধরে যা ব্যাকপ্যাকিং-এর মতো কার্যকলাপের জন্য আরও বহনযোগ্য এবং কার্যকর হতে পারে, বিশেষ করে যদি হিটিং এলিমেন্টের মতো বৈশিষ্ট্যগুলি বিদ্যুৎ সাশ্রয়ের জন্য নিষ্ক্রিয় করা যায়।",
      "স্টারলিংক মিনি গ্রামীণ এলাকায় একটি আরও কার্যকর ব্যাকআপ ইন্টারনেট সমাধান হিসাবে কাজ করতে পারে, যেখানে নমনীয় সাবস্ক্রিপশন বিকল্পগুলি ব্যবহারকারীদের প্রয়োজন অনুযায়ী পরিষেবা সক্রিয় করার অনুমতি দেয়।"
    ],
    "points": 188,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1718566767
  },
  {
    "id": 40707037,
    "title": "যুক্তরাষ্ট্র অ্যাডোবির বিরুদ্ধে মামলা করেছে 'প্রতারণামূলক' সাবস্ক্রিপশন বাতিল করা কঠিন হওয়ার অভিযোগে",
    "originLink": "https://www.theverge.com/2024/6/17/24180196/adobe-us-ftc-doj-sues-subscriptions-cancel",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40707037",
    "commentBody": "",
    "originSummary": [
      "মার্কিন সরকার অ্যাডোবির বিরুদ্ধে অভিযোগ করেছে যে তারা ফি গোপন করেছে এবং সাবস্ক্রিপশন বাতিল করার প্রক্রিয়াটি জটিল করেছে।",
      "বিচার বিভাগ দাবি করেছে যে অ্যাডোবি গ্রাহকদের উচ্চমূল্যের পরিকল্পনায় অন্তর্ভুক্ত করেছে স্পষ্ট শর্তাবলী প্রকাশ না করেই, যার মধ্যে প্রাথমিক বাতিল ফি অন্তর্ভুক্ত রয়েছে, এবং বাতিল প্রক্রিয়াটি জটিল করেছে।",
      "মামলাটি অ্যাডোবের নির্বাহী ম্যানিন্দর সাওহনি এবং ডেভিড ওয়াধওয়ানিকে লক্ষ্য করে, এবং এটি ২০১২ সালে অ্যাডোবের সাবস্ক্রিপশন মডেলে পরিবর্তন এবং সাম্প্রতিক এআই প্রশিক্ষণ শর্তাবলীর বিরুদ্ধে প্রতিক্রিয়ার পরিপ্রেক্ষিতে করা হয়েছে।"
    ],
    "commentSummary": [
      "মার্কিন সরকার অ্যাডোবির বিরুদ্ধে মামলা করছে, অভিযোগ করে যে কোম্পানিটি গ্রাহকদের জন্য সাবস্ক্রিপশন বাতিল করা কঠিন করে তুলেছে।",
      "ফেডারেল ট্রেড কমিশন (এফটিসি) দাবি করেছে যে অ্যাডোবি গোপন ফি ব্যবহার করে গ্রাহকদের ফাঁদে ফেলেছে, যা আইনি পদক্ষেপের কারণ হয়েছে।",
      "অ্যাপলের আরও সরল সাবস্ক্রিপশন বাতিল প্রক্রিয়ার সাথে তুলনা করা হচ্ছে, যা সমস্যাটির গুরুত্বকে তুলে ধরছে।"
    ],
    "points": 176,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1718639935
  },
  {
    "id": 40701310,
    "title": "তারা এখন ডিসপ্লে সহ USB-C কেবল তৈরি করে",
    "originLink": "https://ounapuu.ee/posts/2024/06/05/usb-c-cables/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40701310",
    "commentBody": "",
    "originSummary": [
      "ইউএসবি-সি কেবলগুলি এখন বিল্ট-ইন ডিসপ্লে সহ উপলব্ধ, যা শক্তি খরচ প্রদর্শন করে এবং চার্জিং গতি পর্যবেক্ষণে সহায়তা করে।",
      "এই তারগুলি ইউএসবি ৪ সমর্থন করে, যা তাদের কিছুটা শক্ত করতে পারে, তবে তারা উচ্চ-রেজোলিউশনের ডিসপ্লে এবং ডকের সাথে ভালোভাবে কাজ করে।",
      "ব্যবহারকারীদের এই তারগুলিতে সম্ভাব্য লুকানো ক্ষতিকারক চিপ সম্পর্কে সতর্ক থাকা উচিত।"
    ],
    "commentSummary": [
      "ডিসপ্লে সহ USB-C কেবল এখন উপলব্ধ, যা ব্যবহারকারীদের কেবলের উপর সরাসরি বিদ্যুৎ খরচ দেখতে দেয়।",
      "তুলনামূলকভাবে, উন্নত নিরাপত্তা পরীক্ষার ক্ষমতার জন্য পরিচিত O.MG কেবলটি কিছু সময় ধরে বাজারে রয়েছে।",
      "আলোচনাগুলি সম্ভাব্য ক্ষতিকারক চিপস সহ এমন তারের বিষয়ে উদ্বেগ এবং ধূমপান ও ডিভাইসের ক্ষতির মতো সমস্যার অভিজ্ঞতাগুলিকে তুলে ধরে, নির্ভরযোগ্য তার এবং Anker-এর মতো বিশ্বস্ত ব্র্যান্ডের গুরুত্বকে জোর দেয়।"
    ],
    "points": 176,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1718584677
  },
  {
    "id": 40702546,
    "title": "ম্যারিয়ন স্টোকস, যিনি ৩০ বছরেরও বেশি সময় ধরে প্রতিটি মিনিটের মার্কিন টেলিভিশন রেকর্ড করেছেন",
    "originLink": "https://allthatsinteresting.com/marion-stokes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40702546",
    "commentBody": "",
    "originSummary": [
      "ম্যারিয়ন স্টোকস, একজন প্রাক্তন গ্রন্থাগারিক এবং নাগরিক অধিকার কর্মী, ১৯৭৯ থেকে ২০১২ সাল পর্যন্ত ২৪/৭ টেলিভিশন সম্প্রচার রেকর্ড করেছিলেন, ঐতিহাসিক সংবাদ বিবরণ সংরক্ষণের জন্য ৭১,০০০ টেপ সংগ্রহ করেছিলেন।",
      "তার মৃত্যুর পর, ইন্টারনেট আর্কাইভ ২০১৩ সালে তার বিশাল সংগ্রহ ডিজিটাইজ করা শুরু করে, এই অনন্য মিডিয়া আর্কাইভ সংরক্ষণের নিশ্চয়তা প্রদান করে।",
      "স্টোকসের প্রচেষ্টা, যা ২০১৯ সালের ডকুমেন্টারি \"রেকর্ডার: দ্য ম্যারিয়ন স্টোকস প্রজেক্ট\"-এ তুলে ধরা হয়েছে, ডিজিটাল যুগে মিডিয়া সংরক্ষণের গুরুত্বকে গুরুত্বারোপ করে।"
    ],
    "commentSummary": [
      "ম্যারিয়ন স্টোকস ৩০ বছরেরও বেশি সময় ধরে মার্কিন টেলিভিশন রেকর্ড করেছিলেন, যা একটি গুরুত্বপূর্ণ আর্কাইভ তৈরি করেছে যেখানে বিজ্ঞাপন এবং স্থানীয় সংবাদ অন্তর্ভুক্ত রয়েছে যা প্রায়শই সময়ের সাথে হারিয়ে যায়।",
      "ইন্টারনেট আর্কাইভ বর্তমানে তার সংগ্রহ প্রক্রিয়াকরণ করছে, পুরানো ভিএইচএস টেপগুলির আর্কাইভাল মূল্যকে তুলে ধরছে।",
      "হ্যাকার নিউজে আলোচনায় অ্যাপার্টমেন্টগুলি স্টোরেজ হিসাবে ব্যবহারের বাস্তবতা নিয়ে আলোচনা করা হয়েছিল এবং স্টোকসের প্রচেষ্টাকে ব্রডকাস্ট কমিউনিকেশনস মিউজিয়াম এবং প্যালি সেন্টার ফর মিডিয়ার মতো অন্যান্য আর্কাইভের সাথে তুলনা করা হয়েছিল।"
    ],
    "points": 174,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1718601795
  },
  {
    "id": 40700343,
    "title": "এসকিউএলাইট ডাটাবেস এক্সপ্লোরার",
    "originLink": "https://github.com/frectonz/sqlite-studio",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40700343",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "SQLite ডাটাবেস এক্সপ্লোরার, একটি CLI টুল যা একটি স্থানীয় ওয়েব সার্ভার শুরু করে, তার পরিষ্কার UI যা shadcn/ui দিয়ে তৈরি হয়েছে তার জন্য উল্লেখযোগ্য মনোযোগ এবং প্রশংসা পেয়েছে।",
      "ব্যবহারকারীরা উন্নতির জন্য কিছু প্রস্তাব দিয়েছেন যেমন README-তে স্ক্রিনশট যোগ করা এবং DB Browser for SQLite-এর মতো অন্যান্য টুলের সাথে তুলনা করা।",
      "নাম \"SQLite Studio\" নিয়ে সম্ভাব্য ট্রেডমার্ক সমস্যার বিষয়ে উদ্বেগ ছিল, যা সৃষ্টিকর্তাকে নাম পরিবর্তনের পরিকল্পনা করতে প্ররোচিত করেছিল, এবং কিছু ব্যবহারকারী উইন্ডোজ ডিফেন্ডার থেকে মিথ্যা পজিটিভ রিপোর্ট করেছেন।"
    ],
    "points": 174,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1718573958
  },
  {
    "id": 40699459,
    "title": "কোয়েক ১ সম্ভাব্য মূল ফন্ট",
    "originLink": "https://cohost.org/bekoha/post/2859948-quake-1-potential-or",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40699459",
    "commentBody": "",
    "originSummary": [
      "কোয়েক ১ ফন্টটি মনে হয় একটি পুরনো ফন্ট \"ভিসা\" থেকে উদ্ভূত, যা ১৯৬৬ সালে রাফায়েল বোগুস্লাভ দ্বারা ডিজাইন করা হয়েছিল।",
      "\"ভিসা\" ড্যান এক্স. সোলোর \"দ্য সোলোটাইপ ক্যাটালগ অফ ৪,১৪৭ ডিসপ্লে টাইপফেসেস\" (১৯৯২) এবং \"স্টেনসিল আলফাবেটস: ১০০ কমপ্লিট ফন্টস\" (১৯৮৮) এ প্রদর্শিত হয়েছিল।",
      "আবিষ্কারটি Quake ফন্টের ঐতিহাসিক শিকড়কে তুলে ধরে, যা ১৯৬৬ সালের VGC ন্যাশনাল টাইপ ফেস ডিজাইন প্রতিযোগিতায় পুরস্কারজয়ী একটি ডিজাইনের সাথে সংযুক্ত।"
    ],
    "commentSummary": [
      "কোহোস্ট.অর্গ-এ বিতর্কটি কেন্দ্র করে রয়েছে যে কোয়েক ১-এর ফন্টটি হাতে তৈরি নাকি বিদ্যমান ফন্ট থেকে উদ্ভূত, যেখানে নির্দিষ্ট অক্ষরগুলিতে উল্লেখযোগ্য পার্থক্য লক্ষ্য করা যায়।",
      "কিছু ব্যবহারকারী অনুমান করেন যে ফন্টটি স্টেনসিল ডিজাইন বা ডেমোক্রাটিকা মতো নতুন টাইপফেস দ্বারা অনুপ্রাণিত হতে পারে, অন্যরা স্পষ্টতার জন্য মূল ডিজাইনারদের সাথে পরামর্শ করার পরামর্শ দেন।",
      "আলোচনাটি ফন্টের বিবর্তন এবং এতে জড়িত সৃজনশীল প্রক্রিয়াগুলিও অন্বেষণ করে, ফন্টের ব্যবহারের অনুমতি নিয়ে কিছু সংশয় সহ।"
    ],
    "points": 174,
    "commentCount": 27,
    "retryCount": 0,
    "time": 1718566230
  }
]
