[
  {
    "id": 42037386,
    "title": "Bilim insanları iki proteini birbirine yapıştırarak kanser hücrelerini kendi kendini yok etmeye yönlendiriyor",
    "originLink": "https://med.stanford.edu/news/all-news/2024/10/protein-cancer.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42037386",
    "commentBody": "",
    "originSummary": [
      "Stanford Tıp araştırmacıları, iki proteini birleştirerek kanser hücrelerinin kendi kendini yok etmesini sağlayan ve hücre ölüm genlerini aktive eden bir molekül oluşturdu.",
      "Bu yenilikçi yöntem, hücre ölümünü engelleyen BCL6 proteinini, apoptozu (programlanmış hücre ölümü) tetikleyen bir enzim olan CDK9'a bağlayarak yaygın büyük B hücreli lenfomayı hedef alır.",
      "Science dergisinde yayımlanan araştırma, fareler üzerinde daha fazla testten geçiyor ve Howard Hughes Tıp Enstitüsü ve Ulusal Sağlık Enstitüleri gibi kurumların finansmanıyla klinik denemelere yol açabilir."
    ],
    "commentSummary": [
      "Bilim insanları, kanser hücrelerinin hayatta kalmasına yardımcı olan BCL6 genini hedef alarak iki proteini bağlayarak kanser hücrelerinin kendi kendini yok etmesini sağlamak için bir yöntem geliştirdiler.",
      "Bu teknik, kemoterapi gibi geleneksel tedaviler yerine hassasiyeti hedefleyen, hedefe yönelik kanser tedavileri eğiliminin bir parçasıdır.",
      "Zorluklar arasında potansiyel yan etkiler ve bireysel tümör DNA'sına dayalı kişiselleştirilmiş tedavilerin gerekliliği yer alırken, araştırmalardaki ilerlemeler daha etkili çözümler için umut sunmaktadır."
    ],
    "points": 577,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1730680978
  },
  {
    "id": 42038653,
    "title": "Çalışan metrikleri konusunda fikrimi değiştirdim.",
    "originLink": "http://rachelbythebay.com/w/2024/11/03/metrics/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42038653",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yazar, yöneticilerin sadece otomatik panolara güvenmek yerine ekiplerinin çalışmalarını anlamalarının önemini vurguluyor, bu da kalite yerine metriklere odaklanmaya yol açabilir.",
      "Yalnızca metriklere odaklanmak, yaratıcı yetenekleri caydırabilir ve elde tutma sorunlarına neden olabilir, bu da nicel veriler ile nitel içgörüler arasında bir denge kurulması gerektiğini vurgular.",
      "Yazı, zehirli bir çalışma ortamını önlemek ve etkili ekip yönetimini sağlamak için büyük resim metriklerini yönetsel içgörü ile birleştirmeyi savunuyor."
    ],
    "points": 466,
    "commentCount": 296,
    "retryCount": 0,
    "time": 1730696802
  },
  {
    "id": 42040795,
    "title": "New York Times Teknoloji Birliği greve gidiyor",
    "originLink": "https://www.washingtonpost.com/style/media/2024/11/04/new-york-times-tech-strike-walkout/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42040795",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "New York Times Teknoloji Birliği, \"haklı sebep\" ile işten çıkarma hükmü, maaş artışları, maaş eşitliği ve uzaktan çalışma politikaları gibi çözülmemiş sözleşme sorunları nedeniyle grev yapıyor. - İki yılı aşkın süredir devam eden müzakereler bir sözleşmeye ulaşmadan devam ediyor ve grev, NYT üzerindeki baskıyı artırmak için seçim haftasında stratejik olarak zamanlanmış durumda. - NYT, yıllık %2,5 maaş artışı ve uzaktan çalışma esnekliği önerdi, ancak sendika daha önemli taahhütler için baskı yapıyor."
    ],
    "points": 390,
    "commentCount": 737,
    "retryCount": 0,
    "time": 1730722110
  },
  {
    "id": 42035319,
    "title": "Proje Sid: Yapay Zeka medeniyetine yönelik çoklu ajan simülasyonları",
    "originLink": "https://github.com/altera-al/project-sid",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42035319",
    "commentBody": "",
    "originSummary": [
      "Proje Sid, 10-1000+ AI ajanıyla büyük ölçekli simülasyonları araştırarak AI medeniyetini keşfetmeyi amaçlıyor ve gerçek zamanlı etkileşim için PIANO mimarisini kullanıyor.- Araştırma, Minecraft ortamında AI ajanlarının roller, kurallar ve kültürel aktarım geliştirdiğini göstererek toplumsal simülasyonlar ve AI entegrasyonundaki ilerlemeleri vurguluyor.- Çalışma, arXiv'de mevcut olan bir makalede belgelenmiş olup, AI medeniyeti araştırmalarına yeni bakış açıları sunuyor."
    ],
    "commentSummary": [
      "Proje Sid, sosyal dinamikleri ve AI medeniyetini keşfetmek amacıyla, özellikle Minecraft bağlamında, çoklu ajan simülasyonlarının yapay zekada kullanımını araştırmaktadır.",
      "Eleştirmenler, projenin çığır açan bir yapay zekadan ziyade daha çok gelişmiş istem mühendisliği ile ilgili olabileceğini savunarak, geleneksel algoritmaların yeterli olabileceği oyunlarda büyük dil modellerinin (LLM'ler) gerekliliğini sorguluyorlar.",
      "Proje, yapay zekanın oyunlardaki potansiyelini ve mevcut sınırlamalarını vurgulayarak, yapay zekanın yaratıcılıktaki rolü, zekayı simüle etmenin zorlukları ve yapay zeka odaklı toplumların felsefi etkileri üzerine tartışmalar başlatıyor."
    ],
    "points": 372,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1730660959
  },
  {
    "id": 42036995,
    "title": "Hertz-dev, konuşma sesleri için ilk açık kaynaklı temel model",
    "originLink": "https://si.inc/hertz-dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42036995",
    "commentBody": "",
    "originSummary": [
      "Standard Intelligence, ses işleme teknolojisinde önemli bir ilerlemeyi işaret eden, 8,5 milyar parametreye sahip yalnızca ses tabanlı transformer modeli hertz-dev'i açık kaynak olarak sunmuştur.",
      "Yayın, daha düşük bit hızlarında üstün olan bir ses otoenkoderi olan hertz-codec'i ve ses Varyasyonel Otoenkoder (VAE) için 1.8 milyar parametreli bir dönüştürücü olan hertz-vae'yi içeriyor.",
      "Hertz-dev, 6.6 milyar parametreye sahip olup, düşük gecikme süresi ve gerçek zamanlı ses etkileşimi yetenekleri ile dikkat çekmektedir, bu da onu ince ayar ve araştırma amaçları için uygun hale getirmektedir."
    ],
    "commentSummary": [
      "Hertz-dev, sesli girdiyi metne dönüştürmeden çıktıya işleyen ilk açık kaynaklı konuşma ses modeli olup, metinden sese sistemlerinden daha doğal yanıtlar sunma potansiyeline sahiptir. Model, cinsiyet veya aksan gibi ses özelliklerini değiştirmek için ince ayar yapmaya olanak tanıyan yüksek derecede uyarlanabilir olup, çeşitli uygulamalar için çok yönlüdür. Küçük bir ekip tarafından geliştirilen Hertz-dev, 16 milyon saatlik geniş bir ses veri seti üzerinde eğitilmiştir ve gelecekte daha fazla ince ayar ve geliştirme sağlamak için HuggingFace üzerinde bir sürüm planlanmaktadır."
    ],
    "points": 252,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1730676648
  },
  {
    "id": 42037982,
    "title": "LLM'ler için öğrenilmemiş bilgiyi geri kazanmanın utanç verici derecede basit bir yaklaşımı",
    "originLink": "https://arxiv.org/abs/2410.16454",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42037982",
    "commentBody": "",
    "originSummary": [
      "Makale, büyük dil modellerinin (LLM'ler) telif hakkıyla korunan veya özel içerik gibi istenmeyen davranışları gerçekten unutup unutamayacağını, yeniden eğitim olmadan araştırıyor. Modelin ağırlıklarının hassasiyetini azaltma süreci olan kuantizasyonun, \"unutulmuş\" bilginin önemli bir kısmını geri yükleyebileceğini ve 4 bit kuantizasyondan sonra unutulmuş bilginin %83'üne kadarını unutan modellerin koruyabileceğini ortaya koyuyor. Yazarlar, LLM'lerdeki eksik unutma sorununu etkili bir şekilde ele almak için kuantizasyona dayanıklı bir unutma stratejisi öneriyorlar."
    ],
    "commentSummary": [
      "Son yapılan bir çalışma, bir modeli kuantize etmenin, modellerin belirli bilgileri unutmasını sağlamak için kullanılan \"öğrenmeyi geri alma\" yöntemlerini büyük dil modellerinde (LLM'ler) tersine çevirebileceğini göstermektedir.",
      "Model ağırlıklarının hassasiyetini azaltan bir süreç olan kuantizasyon, unutulmuş bilgileri istemeden geri yükleyebilir ve bu da öğrenmeyi geri almanın etkinliği konusunda endişelere yol açabilir.",
      "Bulunanlar, yapay zeka etiği, telif hakkı ve yapay zekanın bilgiye erişim ve yaratım üzerindeki etkileriyle ilgili daha geniş sorunları vurgulamaktadır."
    ],
    "points": 221,
    "commentCount": 103,
    "retryCount": 0,
    "time": 1730688734
  },
  {
    "id": 42036041,
    "title": "Tinder, ama Ne Yiyeceğine Karar Vermek İçin",
    "originLink": "https://whatdinner.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42036041",
    "commentBody": "",
    "originSummary": [
      "Bağımsız bir geliştirici, kararsızlıkla ilgili kişisel deneyimlerinden ilham alarak akşam yemeği seçeneklerine karar vermeye yardımcı olacak bir uygulama oluşturdu.",
      "Uygulama başlangıçta tarifleri listeliyor ve rastgele üç tanesini öneriyordu, daha sonra kullanıcıların yemekleri seçmek için kaydırdığı Tinder benzeri bir arayüze dönüştü.",
      "Geliştirici, uygulamayı geliştirmek için kullanıcı geri bildirimlerini arıyor ve bu, devam eden bir geliştirme sürecine işaret ediyor."
    ],
    "commentSummary": [
      "Bağımsız bir geliştirici, çiftlerin yemek tarifleri seçeneklerini Tinder arayüzüne benzer şekilde kaydırarak yemeklere karar vermelerine yardımcı olan bir uygulama başlattı.",
      "Uygulama, kullanıcıların kendi tariflerini girmelerine olanak tanır ve günlük seçenekler önerir, şu anda iOS'ta mevcuttur ve Android sürümü için planlar bulunmaktadır.",
      "Kullanıcılar, abonelik modeli hakkında endişelerini dile getirerek, yemek planlamasını geliştirmek ve karar yorgunluğunu azaltmak için malzeme filtreleri ve alışveriş listesi entegrasyonu gibi ek özellikler önermiştir."
    ],
    "points": 216,
    "commentCount": 188,
    "retryCount": 0,
    "time": 1730667365
  },
  {
    "id": 42039569,
    "title": "Quincy Jones öldü",
    "originLink": "https://apnews.com/article/quincy-jones-dead-a9e31c7e39c448d8971519f47a22dd21",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42039569",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Quincy Jones, efsanevi bir müzik yapımcısı, pop, caz ve diğer müzik türleri üzerinde önemli bir etki bırakarak hayatını kaybetti.",
      "Jones, müzikal başarılarının ötesinde, ACM Computers in Entertainment Dergisi'nin danışma komitesinde ve Alan Kay'in Viewpoints Research Institute'un yönetim kurulunda görev alarak teknoloji endüstrisine katkıda bulundu.",
      "Onun mirası, Jacob Collier gibi sanatçılara mentorluk yapmayı ve Afrika'da borç affı gibi sosyal nedenlere katkıda bulunmayı içeriyor."
    ],
    "points": 203,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1730708025
  },
  {
    "id": 42036305,
    "title": "Sistemd neden gömülü Linux için bir sorundur",
    "originLink": "https://kevinboone.me/systemd_embedded.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42036305",
    "commentBody": "",
    "originSummary": [
      "Kevin Boone, systemd'nin gömülü Linux sistemleri için sunduğu zorlukları vurguluyor ve bunun, SystemV init gibi geleneksel alternatiflere kıyasla kaynak açısından ağır bir yapıya sahip olduğunu belirtiyor.",
      "Systemd'nin init süreci ve günlük kaydı hizmeti gibi bileşenleri, bellek kullanımını ve başlatma sürelerini artırarak, Raspberry Pi gibi cihazlar için daha az ideal hale getiriyor.",
      "Boone, sistemd'ye dayanmayan Linux dağıtımlarını desteklemeyi ve gömülü ortamlarda esneklik ve etkinliği sağlamak için alternatifler geliştirmeyi savunuyor."
    ],
    "commentSummary": [
      "Sistemd'nin gömülü Linux sistemleri için uygunluğu konusundaki tartışma devam ediyor; eleştirmenler, kaynakları sınırlı cihazlar için yüksek bellek kullanımı, daha uzun açılış süreleri ve karmaşıklığını dezavantajlar olarak belirtiyor.",
      "Sistemd savunucuları, özellikle yeterli kaynaklara sahip cihazlar için gelişmiş hizmet yönetimi ve yanıt verme kabiliyeti sağladığını savunuyorlar.",
      "Bu tartışma, systemd'nin her şeyi kapsayan yaklaşımı ile küçük, modüler araçlar kullanma üzerine kurulu Unix felsefesi arasındaki daha geniş çatışmayı vurgulamaktadır."
    ],
    "points": 200,
    "commentCount": 243,
    "retryCount": 0,
    "time": 1730670146
  },
  {
    "id": 42036303,
    "title": "Redis'e ihtiyacınız var mı? PostgreSQL sıralama, kilitleme ve yayınla/abone ol yapar (2021)",
    "originLink": "https://spin.atomicobject.com/redis-postgresql/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42036303",
    "commentBody": "",
    "originSummary": [
      "Chris Farber'in blog yazısı, Redis'in web uygulamaları için gerekli olup olmadığını veya PostgreSQL'in aynı rolleri yerine getirip getiremeyeceğini inceliyor. Üç Redis kullanım durumunu vurguluyor: iş kuyruğu, uygulama kilitleri ve Pub/Sub, ve PostgreSQL'in bu görevleri sırasıyla SKIP LOCKED, danışman kilitleri ve LISTEN/NOTIFY ifadeleri kullanarak nasıl yönetebileceğini açıklıyor. Tartışma, Redis'in önbelleklemede üstün olduğunu öne sürerken, PostgreSQL'in yeteneklerinin Redis'e olan ihtiyacı azaltabileceğini, bu da potansiyel olarak operasyonel maliyetleri ve karmaşıklığı düşürebileceğini öneriyor."
    ],
    "commentSummary": [
      "PostgreSQL kuyruğa alma, kilitleme ve yayınla/abone ol (pub/sub) işlevlerini yönetebildiğinde Redis'in gerekli olup olmadığı tartışmanın merkezinde yer alıyor.",
      "Redis, özellikle uygulama ile aynı makinede çalışırken hızı ve performansı nedeniyle övülmektedir ve PostgreSQL'in disk tabanlı işlemlerine göre avantajlar sunmaktadır.",
      "Redis ve PostgreSQL arasında seçim yaparken, yüksek hızlı işlemler, paylaşılan bellek veya kalıcılık gibi belirli kullanım durumlarına ve dağıtık mimarilerin karmaşıklığına dikkat edilmelidir."
    ],
    "points": 191,
    "commentCount": 123,
    "retryCount": 0,
    "time": 1730670123
  },
  {
    "id": 42035981,
    "title": "180MB'lik Hacker News Veri Haritası",
    "originLink": "https://lmcinnes.github.io/datamapplot_examples/hackernews/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42035981",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "GitHub'da barındırılan bir Hacker News veri haritası 180MB boyutunda olup, sınırlı veri kullanan mobil kullanıcılar için anında yüklenmesi nedeniyle potansiyel sorunlara yol açabilir.",
      "Kullanıcılar, yükleme verimliliğini artırmak için boyut etiketi ekleme, önizleme resmi sağlama ve CDN (İçerik Dağıtım Ağı), webtorrent veya vektör haritalar gibi teknolojileri kullanma gibi iyileştirmeler önermektedir.",
      "Harita, hiyerarşik olmayan konular, belirsiz veri kaynakları ve belirli tarayıcılar veya mobil cihazlarla uyumluluk sorunları gibi zorluklarla karşı karşıya kalarak, büyük veri görselleştirmeleri için çözümler üzerine tartışmaları teşvik ediyor."
    ],
    "points": 180,
    "commentCount": 23,
    "retryCount": 0,
    "time": 1730666750
  },
  {
    "id": 42041917,
    "title": "Artık Kubernetes'i Kullanmayacağız",
    "originLink": "https://www.gitpod.io/blog/we-are-leaving-kubernetes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42041917",
    "commentBody": "",
    "originSummary": [
      "Gitpod, geliştirme ortamlarına özgü ölçeklenebilirlik, güvenlik ve kaynak yönetimi zorluklarını ele alarak Kubernetes'ten Gitpod Flex adlı yeni bir mimariye geçiş yapıyor.",
      "Kubernetes, durum bağımlılığı ve öngörülemeyen kaynak kullanımı gibi benzersiz ihtiyaçlar nedeniyle geliştirme ortamları için karmaşık ve maliyetli bulunmuştur.",
      "Gitpod Flex, Kubernetes'ten ilham alarak geliştirilmiş olup, geliştirilmiş güvenlik, operasyonel sadelik sunar ve kendi kendine barındırmayı destekler. Özelliklerini sergilemek için 6 Kasım'da sanal bir etkinlik planlanmıştır."
    ],
    "commentSummary": [
      "Metin, Kubernetes'in geliştirme ortamlarında kullanılmasının zorluklarını vurguluyor ve yüksek geri bildirim döngüleri ile uzaktan hata ayıklama zorlukları gibi konulara dikkat çekiyor.- Öneriler arasında, geliştiricilere güçlü yerel makineler sağlamak ve tutarlılık için sanal makineler (VM'ler) kullanmak yer alırken, GPU erişimi gibi özel ihtiyaçlar için bulut tabanlı ortamların da değerlendirilmesi bulunuyor.- Genel kanı, Kubernetes'in karmaşıklığı nedeniyle geliştirme ortamları için ideal olmayabileceği yönünde ve daha özel bir yaklaşım için Gitpod Flex gibi alternatif çözümler araştırılıyor."
    ],
    "points": 166,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1730731288
  },
  {
    "id": 42039935,
    "title": "Ucuz Heyecanlar, Robert Crumb tarafından bir albüm kapağı (2020)",
    "originLink": "https://musicaficionado.blog/2020/01/28/cheap-thrills-an-album-cover-by-robert-crumb/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42039935",
    "commentBody": "",
    "originSummary": [
      "Yeraltı çizgi romanlarıyla tanınan sanatçı Robert Crumb, grubun veya psikedelik müziğin hayranı olmamasına rağmen Janis Joplin'in 'Cheap Thrills' albümünün ikonik kapağını tasarladı.",
      "Crumb'un çizgi roman tasarımı, başlangıçta ilk tercih olmasa da, efsanevi bir statü kazandı ve ona ün getirdi, ancak o, hippi hareketine karşı eleştirel kalmaya devam etti.",
      "Crumb, albüm sanatındaki başarısına rağmen, 1920'ler ve 1930'ların müziğini tercih etti ve daha sonra tam bir müzik kariyeri peşinde koşmadan Cheap Suit Serenaders Band'de çaldı."
    ],
    "commentSummary": [
      "İkonik albüm kapağı sanatıyla tanınan etkili sanatçı Robert Crumb, geniş müzik koleksiyonunu tartışarak, Fransız bir grup tarafından yapılan nadir bir erken dönem caz plağını vurguladı.",
      "1990'lardan beri Fransa'da yaşayan Crumb, modern müzik yerine eski blues ve cazı tercih ettiğini belirterek, çağdaş kültüre dair karışık duygularını yansıttı.",
      "Çoğu zaman tartışma yaratan tartışmalı sanatı, 1960'ların karşı kültürünün özünü yakalamada etkili olmaya devam ederken, ırk ve toplum hakkındaki karmaşık görüşlerini yansıtıyor."
    ],
    "points": 139,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1730712919
  },
  {
    "id": 42042025,
    "title": "Alonzo Church: Bilgisayar zekasının mimarı",
    "originLink": "https://onepercentrule.substack.com/p/alonzo-church-the-forgotten-architect",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42042025",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Alonzo Church, bilgisayar bilimine önemli katkılarda bulunmuş, özellikle Lisp programlama dilini etkileyen ve yapay zekanın (AI) temelini oluşturan lambda hesaplaması ile tanınmıştır. Etkisine rağmen, Church, kısmen popüler medyada sınırlı temsil edilmesi nedeniyle Alan Turing gibi akranlarına göre daha az tanınmaktadır. Principia Mathematica'dan türetilen Church'ün lambda notasyonu, John McCarthy tarafından Lisp'in geliştirilmesinde benimsenmiş ve bu da onun bilişim tarihindeki etkisini vurgulamaktadır."
    ],
    "points": 133,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1730731870
  },
  {
    "id": 42038139,
    "title": "Yalnızca 'sadece' demeyi bırakın (2019)",
    "originLink": "https://sgringwe.com/2019/10/10/Please-just-stop-saying-just.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=42038139",
    "commentBody": "",
    "originSummary": [
      "Yazılım mühendisliğinde \"sadece\" terimi, görevlerin gerçek karmaşıklığını yansıtmayabilecek şekilde basitlik ima edebilir.- \"Sadece\" kelimesinin kullanımı, mühendislerin alternatifleri sorgulamasını veya önermesini engelleyerek sahtekar sendromuna katkıda bulunabilir ve fikir üretimini engelleyebilir.- İletişimde \"sadece\" kelimesinin kullanımından kaçınmak, daha iyi bir anlayış sağlamaya ve daha açık tartışmalar ile yeniliği teşvik etmeye yardımcı olabilir."
    ],
    "commentSummary": [
      "‘Sadece’ terimi, basitliği ima edebilir, bu da teknik bağlamlarda yanıltıcı veya küçümseyici olabilir ve potansiyel olarak görevin karmaşıklığını küçümseyebilir.",
      "Onun tartışmalarda kullanımı, tüm gerekli detayları veya zorlukları hesaba katmayan, yanlış anlamalara yol açabilecek aşırı basitleştirilmiş çözümler önerebilir.",
      "Bu tartışma, teknik tartışmalarda net iletişimin ve dinleyicinin bakış açısını anlamanın önemini vurgulamaktadır."
    ],
    "points": 118,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1730690749
  }
]
