[
  {
    "id": 38040468,
    "title": "'Niet van faculteitskwaliteit': Hoe Penn Katalin Karikó mishandelde",
    "originLink": "https://www.thedp.com/article/2023/10/penn-katalin-kariko-university-relationship-mistreatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040468",
    "commentBody": "",
    "originSummary": [
      "Acht mensen die hebben samengewerkt met Nobelprijswinnares Katalin Karikó beweren dat de Universiteit van Pennsylvania haar consequent verkeerd heeft behandeld en haar baanbrekende studies over mRNA-technologie heeft genegeerd.",
      "Ondanks Karikó's essentiële bijdragen aan de wetenschap, waaronder haar rol in de ontwikkeling van COVID-19 vaccins, werd ze geconfronteerd met scepticisme, financieringsobstakels en weigering van erkenning van de Penn administratie, wat resulteerde in haar vertrek naar BioNTech in Duitsland.",
      "Karikó's ervaringen onderstrepen de noodzaak van hervormingen in de manier waarop academische financiering wordt verdeeld en erkenning wordt gegeven aan getalenteerde wetenschappers."
    ],
    "commentSummary": [
      "Het artikel gaat in op verschillende wijdverspreide problemen binnen de academische wereld, waaronder een verkeerd begrip van een belangrijke wetenschapper in de ontwikkeling van het COVID-19 vaccin, problematische financiering van subsidies, overheadkosten en bureaucratische aanwerving.",
      "Het bespreekt de invloed van bestuurders op universiteiten, financiële lasten voor afgestudeerde studenten, manipulatie van subsidiegelden door universiteiten en gebreken in academische meetmethoden en illustreert de stress die gepaard gaat met het verkrijgen van financiering.",
      "Het gaat ook in op discrepanties tussen faculteit en personeel, financieel wanbeheer, zorgen over academische kwaliteit, gemiste kansen en een geval van een slecht uitgevoerde medische proef door een farmaceutisch bedrijf."
    ],
    "points": 473,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1698423383
  },
  {
    "id": 38037851,
    "title": "De langzame dood van authenticiteit in een aandachtseconomie",
    "originLink": "https://www.coryzue.com/writing/authenticity-and-engagement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38037851",
    "commentBody": "",
    "originSummary": [
      "De auteur bekritiseert de verschuiving van Twitter naar het aanmoedigen van inhoud die specifiek is ontworpen voor engagement in plaats van het stimuleren van authentieke communicatie.",
      "Ze suggereren dat het streven naar groei en populariteit op Twitter vaak leidt tot inauthentieke interacties en inhoud.",
      "Er wordt gewezen op de professionalisering van Twitter en de migratie van sommige gebruikers naar andere platformen, waarbij de auteur aangeeft Twitter te verlaten als het geen carrière- en zakelijke voordelen biedt."
    ],
    "commentSummary": [
      "De discussie gaat over de verminderde authenticiteit op sociale mediaplatforms, vooral Twitter, en het nadelige effect op de betrokkenheid van gebruikers en zinvolle conversaties.",
      "Deelnemers maken zich zorgen over clickbait, algoritmegestuurde inhoud, beïnvloeders, monetariseringspraktijken, de verspreiding van verkeerde informatie en het gebrek aan regulering, die allemaal de zichtbaarheid van echte inhoud belemmeren.",
      "Het gesprek pleit voor het herstellen van authenticiteit en doelgerichte interacties op sociale media, het verkennen van alternatieven zoals besloten groepen of andere platforms, en het in vraag stellen van de uitdagingen bij het definiëren en behouden van authenticiteit in verschillende sociale contexten door de invloed van technologie."
    ],
    "points": 447,
    "commentCount": 324,
    "retryCount": 0,
    "time": 1698411654
  },
  {
    "id": 38039133,
    "title": "Constatering dat loodemissies van vliegtuigmotoren bijdragen aan luchtvervuiling",
    "originLink": "https://www.federalregister.gov/documents/2023/10/20/2023-23247/finding-that-lead-emissions-from-aircraft-engines-that-operate-on-leaded-fuel-cause-or-contribute-to",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38039133",
    "commentBody": "",
    "originSummary": [
      "Toegang tot FederalRegister.gov en eCFR.gov is beperkt vanwege agressief geautomatiseerd schrapen, en daarom kunnen alleen menselijke gebruikers toegang krijgen door een CAPTCHA in te vullen en toegang te vragen voor hun IP-adres.",
      "Deze toegang is drie maanden geldig en kan indien nodig worden verlengd.",
      "Voor toegang tot een groter IP-bereik moeten gebruikers eerst toegang krijgen voor hun huidige IP en vervolgens de knop \"Site Feedback\" gebruiken voor de aanvraag."
    ],
    "commentSummary": [
      "De samenvatting richt zich op de toenemende bezorgdheid en discussie over het gebruik van loodhoudende brandstof (avgas) in de luchtvaart, met de nadruk op de gevaren voor het milieu en de gezondheid die het met zich meebrengt.",
      "Het erkent de uitdagingen die gepaard gaan met de overgang naar loodvrije brandstof, zoals het trage regelgevingsproces en de beperkte beschikbaarheid van alternatieven.",
      "Er zijn discussies gaande over de impact van de regelgeving, de prioriteiten van de FAA en de bezorgdheid over de hogere kosten en de beperkte toegang tot loodvrije brandstof."
    ],
    "points": 433,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1698417897
  },
  {
    "id": 38037141,
    "title": "Lessen uit twintig jaar betrouwbaarheidstechniek op locatie",
    "originLink": "https://sre.google/resources/practices-and-processes/twenty-years-of-sre-lessons-learned/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38037141",
    "commentBody": "",
    "originSummary": [
      "Het artikel beschrijft elf belangrijke lessen die Google heeft getrokken uit twee decennia Site Reliability Engineering (SRE), voortkomend uit incidenten en uitval van platforms als YouTube en Google Calendar.",
      "Enkele noemenswaardige lessen zijn de noodzaak van het schalen van mitigatie-inspanningen op basis van de ernst van uitval, de implementatie van canary testing en een \"Grote Rode Knop\" voor crises, het belang van integratietesten en de noodzaak van back-up communicatiekanalen.",
      "Andere cruciale lessen zijn het vaststellen van modi voor verminderde prestaties, het automatiseren van mitigaties, het minimaliseren van de tijd tussen roll-outs en het elimineren van single points of failure om de veerkracht bij rampen en het herstel te vergroten."
    ],
    "commentSummary": [
      "Deze Hacker News thread bespreekt de veelzijdige rol van Site Reliability Engineering (SRE) en softwareontwikkeling.",
      "De onderwerpen omvatten het belang van back-up communicatiekanalen, toegewijde SRE-teams, preventiestrategieën voor uitval en bugs, en het testen van herstelmechanismen voor noodgevallen.",
      "Deelnemers aan de discussies delen ervaringen en meningen en belichten de veranderende aard van SRE-rollen binnen de technologie-industrie."
    ],
    "points": 431,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1698405928
  },
  {
    "id": 38043033,
    "title": "Shadow: Nieuwe browser-engine bijna volledig gemaakt in JavaScript",
    "originLink": "https://goose.icu/introducing-shadow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043033",
    "commentBody": "",
    "originSummary": [
      "Een nieuwe browser-engine genaamd goose.icu, ontwikkeld in JavaScript voor educatieve en amusementsdoeleinden, is nu beschikbaar maar is mogelijk niet compatibel met de meeste sites.",
      "De ontwikkelaar ondersteunt open-source leren door de broncode van goose.icu te delen en anderen uit te nodigen om intrigerende aspecten van het ontwerp te verkennen, ervan te leren en te ontdekken.",
      "Het project daagt de conventionele perceptie uit dat het maken van een nieuwe browser-engine een enorme, zo niet onmogelijke taak is."
    ],
    "commentSummary": [
      "De discussie gaat over verschillende onderwerpen, waaronder browser engines, advertentieblokkering, reclame-ethiek, WebAssembly en beperkingen van browsers.",
      "Er is een debat gaande over de mogelijke stopzetting van gratis diensten van hoge kwaliteit en de gevolgen van reclame voor individuen.",
      "Het belicht de gebruikerservaring met qutebrowser, met de nadruk op de minimale GUI (Graphical User Interface) en het toetsenbordgerichte ontwerp, en verkent de risico's en voordelen van WebAssembly."
    ],
    "points": 396,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1698435983
  },
  {
    "id": 38038713,
    "title": "Automatische fraudedetectie maakt mijn leven tot een hel",
    "originLink": "https://news.ycombinator.com/item?id=38038713",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038713",
    "commentBody": "",
    "originSummary": [
      "De persoon is tijdelijk naar India verhuisd vanwege medische familiebehoeften en vertrouwt op online diensten om kosten te besparen, maar ondervindt problemen vanwege fraudebestrijdingsmaatregelen en accountbeperkingen.",
      "Ze zijn gefrustreerd over de complexiteit van taken die eenvoudig zouden moeten zijn, zoals het downloaden van regiospecifieke apps, en zijn teleurgesteld over de onverschillige houding van bedrijven.",
      "De persoon heeft de indruk dat productontwerp in de eerste plaats gericht is op het profiteren van belanghebbenden en overheden, wat leidt tot frustratie en ontevredenheid bij de gebruiker."
    ],
    "commentSummary": [
      "Individuen ondervinden problemen met online diensten en internationale financiële transacties, zoals onbetrouwbare fraudedetectiesystemen en beperkende veiligheidsmaatregelen.",
      "Er zijn ook problemen met toegangsbeperkingen, discriminatie bij aanwerving, internationale transacties en culturele en regelgevende barrières.",
      "Deelnemers delen persoonlijke ervaringen en stellen alternatieven en workarounds voor om deze uitdagingen tot een minimum te beperken."
    ],
    "points": 337,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1698416109
  },
  {
    "id": 38036921,
    "title": "Waarom je waarschijnlijk SQLite zou moeten gebruiken",
    "originLink": "https://www.epicweb.dev/why-you-should-probably-be-using-sqlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38036921",
    "commentBody": "",
    "originSummary": [
      "Het artikel bespreekt de geschiktheid van SQLite als database voor webapplicaties, waarbij eigenschappen als nul latentie, ingebedde implementatie, replicatie met meerdere instanties, schaalbaarheid en een vereenvoudigd ontwikkel- en testproces worden benadrukt.",
      "Ondanks de beperkingen zoals het ontbreken van ondersteuning voor abonnementen, externe clientverbindingen, specifieke plugins zoals TimescaleDB en enums, wordt SQLite vaak geprefereerd.",
      "Kortom, SQLite wordt gezien als een sterke keuze voor veel webontwikkelaars vanwege de prestaties, gebruiksvriendelijkheid en kosteneffectiviteit."
    ],
    "commentSummary": [
      "Het belangrijkste onderwerp van discussie gaat over het gebruik van SQLite voor app-ontwikkeling, de sterke punten en de tekortkomingen in vergelijking met andere databaseoplossingen zoals PostgreSQL.",
      "Deelnemers delen hun ervaringen en meningen over SQLite en bekijken factoren als schaalbaarheid, gebruiksvriendelijkheid, operationele beperkingen en de behoefte aan webschaalbaarheid.",
      "De geschiktheid van SQLite wordt bediscussieerd door de deelnemers, waarbij sommigen alternatieve databases voorstellen en anderen SQLite geschikt vinden voor bepaalde gebruikssituaties. De consensus onthult dat de keuze grotendeels afhangt van de behoeften en beperkingen van het project."
    ],
    "points": 331,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1698403912
  },
  {
    "id": 38038465,
    "title": "Een derde van de chocoladeproducten bevat veel zware metalen",
    "originLink": "https://www.consumerreports.org/health/food-safety/a-third-of-chocolate-products-are-high-in-heavy-metals-a4844566398/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038465",
    "commentBody": "",
    "originSummary": [
      "Consumer Reports testte verschillende chocolade en chocoladebevattende producten en ontdekte dat 16 producten hun veiligheidsniveaus voor zware metalen zoals lood en cadmium overschreden.",
      "Donkere chocoladerepen, warme chocolademixen en bepaalde brownie/cake mixen werden geïdentificeerd als producten die doorgaans hogere gehaltes aan deze zware metalen bevatten in vergelijking met melkchocoladerepen.",
      "Het rapport adviseerde consumenten om de consumptie van dergelijke producten te beperken, om producten met een lager besmettingsniveau te kiezen en fabrikanten om hun producten te betrekken uit gebieden met minder besmetting."
    ],
    "commentSummary": [
      "Een recent onderzoek wijst uit dat een derde van de chocoladeproducten hoge concentraties zware metalen zoals lood en cadmium bevat, die terug te voeren zijn op de bodem waar de cacaobonen worden verbouwd.",
      "Grote chocoladebedrijven testen meestal op zware metalen, terwijl kleinere bedrijven bonen inkopen bij distributeurs van superieure kwaliteit; Californië in het bijzonder heeft strengere richtlijnen voor aanvaardbare niveaus van zware metalen in voedsel.",
      "Er is een voortdurende discussie over de gezondheidsrisico's van de consumptie van deze metalen in chocoladeproducten en of er voorzorgsmaatregelen moeten worden opgelegd om deze risico's te minimaliseren."
    ],
    "points": 274,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1698415020
  },
  {
    "id": 38038239,
    "title": "ScratchDB - Open-Source Snowflake op ClickHouse",
    "originLink": "https://github.com/scratchdata/ScratchDB",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038239",
    "commentBody": "",
    "originSummary": [
      "De illustrator heeft een volledig beheerd datawarehouse ontwikkeld, ScratchDB, gebaseerd op Clickhouse, met als doel het proces van het onderhouden van een OLAP-database (Online Analytical Processing) in productie te stroomlijnen en de ervaring van ontwikkelaars te verbeteren.",
      "ScratchDB genereert autonoom tabellen en kolommen op basis van JSON-structuren, beheert datastreaming en bulklading en zorgt automatisch voor shards en replicas. Het kan werken op gewone servers en heeft al grote hoeveelheden gegevens verwerkt.",
      "ScratchDB is open-source, maar er is ook een betaalde gehoste versie. De ontwikkelaar is momenteel op zoek naar feedback over analytische databases en manieren om de ervaring van ontwikkelaars te verbeteren."
    ],
    "commentSummary": [
      "ScratchDB, een open-source datawarehouse, verbetert de ervaring van ontwikkelaars aanzienlijk door meerdere taken te automatiseren, 4000 verzoeken per seconde af te handelen en 2 TB aan gegevens te beheren met opmerkelijk lage serverkosten.",
      "De auteur onderscheidt ScratchDB van andere projecten door de nadruk te leggen op open-source software en praktische infrastructuurkeuzes, zoals Hetzner, voor kostenefficiëntie.",
      "Het doel van de auteur is om de interactie van ontwikkelaars met kolomgegevens te vereenvoudigen en feedback aan te moedigen voor de voortdurende verbetering van het project."
    ],
    "points": 231,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1698413646
  },
  {
    "id": 38040702,
    "title": "Genereer afbeeldingen in één seconde op je Mac met behulp van een latent consistent model",
    "originLink": "https://replicate.com/blog/run-latent-consistency-model-on-mac",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040702",
    "commentBody": "",
    "originSummary": [
      "Het artikel geeft een handleiding voor het gebruik van een latent consistentiemodel (LCM) - gebaseerd op Stable Diffusion - om snel afbeeldingen te genereren op een Mac in 4 tot 8 stappen.",
      "Het biedt gedetailleerde instructies voor het instellen van Python, het klonen van het LCM-script van Github en het installeren van de benodigde afhankelijkheden om het script succesvol uit te voeren.",
      "Het eindigt met advies voor het oplossen van problemen en verder onderzoek, waarbij wordt aanbevolen dat lezers hulp zoeken op Discord en de Github repository doorbladeren voor meer informatie."
    ],
    "commentSummary": [
      "Met het latente consistentiemodel kunnen Mac-gebruikers snel afbeeldingen genereren, hoewel de opstarttijd en het laden van de schijf de prestaties kunnen beïnvloeden.",
      "Er zijn suggesties gedaan om dit model specifiek te optimaliseren voor Mac-laptops, maar er zijn zorgen geuit over de beeldkwaliteit.",
      "Andere discussiepunten zijn het verwijderen van een veiligheidscontrole voor lokaal gebruik, het vergelijken van de prestaties van Apple's M-serie Macs met die van concurrerende apparaten en overwegingen zoals stroomverbruik, koeling en de beschikbaarheid van software op Windows- en Linux-platforms."
    ],
    "points": 206,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1698424674
  },
  {
    "id": 38043955,
    "title": "Grote ballonreflector: een mogelijk baanbrekend antenneontwerp",
    "originLink": "https://www.nasa.gov/directorates/stmd/nasa-tech-breathes-life-into-potentially-game-changing-antenna-design/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043955",
    "commentBody": "",
    "originSummary": [
      "NASA heeft een nieuw antenneontwerp geïntroduceerd, de Large Balloon Reflector (LBR), die gebruik maakt van een opblaasbaar apparaat om grote opvangopeningen mogelijk te maken.",
      "De LBR, gesteund door NASA's Innovative Advanced Concepts (NIAC) programma, valt op door zijn lichte gewicht en compacte opvouwbaarheid, waardoor hij gemakkelijker kan worden ingezet in de ruimte.",
      "De LBR is al getest op een stratosferische ballon en zal binnenkort worden getest op een CubeSat in een lage baan om de aarde, wat wijst op potentieel gebruik voor maan- en diepruimtemissies."
    ],
    "commentSummary": [
      "NASA heeft een Large Balloon Reflector antenne ontworpen die de potentie heeft om ruimtetelescopen en satellietcommunicatie te transformeren, hoewel er een aantal uitdagingen aan verbonden zijn.",
      "Er worden opblaasbare antennes met sferische reflectoren ontwikkeld, die een breder gezichtsveld bieden, licht van gewicht zijn en gemakkelijk kunnen worden ingezet, met toepassingen zowel in de ruimte als op aarde.",
      "NASA's NIAC-programma investeert in onderzoek naar een opblaasbare bolantenne voor communicatie tussen voertuigen, met de nadruk op de duurzaamheid tegen brokstukken."
    ],
    "points": 177,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1698440880
  },
  {
    "id": 38042114,
    "title": "Microsoft slaagt er niet in e-mails af te leveren die newclimate.org vermelden",
    "originLink": "https://newclimate.org/news/microsoft-error-or-external-attack-causing-disruption-to-email-communication-across-the",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38042114",
    "commentBody": "",
    "originSummary": [
      "Een fout van Microsoft of een mogelijke aanval van buitenaf heeft de e-mailcommunicatie binnen de klimaatveranderingsgemeenschap verstoord, vooral met betrekking tot e-mails die de URL van NewClimate bevatten.",
      "Hoewel het probleem van de e-mailblokkering gedeeltelijk is opgelost, worden PDF-bijlagen met de URL van NewClimate nog steeds geblokkeerd en blijft het herstel van verloren e-mails onzeker. Dit heeft gevolgen voor verschillende gouvernementele en niet-gouvernementele klimaatorganisaties.",
      "Microsoft-technici werken actief aan het probleem, maar de onderliggende oorzaak is nog niet vastgesteld en de e-mails die in de afgelopen weken verloren zijn gegaan, kunnen mogelijk niet meer worden hersteld. Deze situatie kan mogelijk gevolgen hebben voor de voorbereidingen voor COP28."
    ],
    "commentSummary": [
      "De Outlook 365 e-mailservice van Microsoft blokkeert e-mails die verwijzen naar de website newclimate.org, waardoor organisaties die zich bezighouden met klimaatverandering worden gestoord en de verspreiding van belangrijke rapporten wordt belemmerd.",
      "Hoewel de website niet officieel op de zwarte lijst van Microsoft staat, staat het bedrijf individuele organisaties toe om de blokkade op te heffen voor hun gebruik, wat vragen oproept over autonome censuurcontroles.",
      "Ondanks het feit dat er geen sprake is van opzettelijke doelwitten of gecompromitteerde infrastructuur, heeft het incident de bezorgdheid over de mogelijke invloed van grote techbedrijven op de verspreiding van informatie aangewakkerd, waardoor gebruikers zich afvragen in hoeverre deze bedrijven informatie kunnen controleren of onderdrukken."
    ],
    "points": 172,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1698431420
  },
  {
    "id": 38041335,
    "title": "Google betaalde 26,3 miljard dollar in 2021 om de standaardzoekmachine te zijn",
    "originLink": "https://www.theverge.com/2023/10/27/23934961/google-antitrust-trial-defaults-search-deal-26-3-billion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38041335",
    "commentBody": "",
    "originSummary": [
      "Tijdens het antitrustproces VS/Google kwam aan het licht dat Google in 2021 26,3 miljard dollar uitgaf om de standaardzoekmachine te worden op talloze browsers, telefoons en platforms.",
      "Deze uitgaven vertegenwoordigen ongeveer 16% van de zoekinkomsten en 29% van de winst van Google, waarbij een aanzienlijk deel wordt betaald aan Apple voor de standaardstatus in Safari.",
      "De rechtszaak draait om de invloed van wanbetalingen en de vraag of dergelijke aanzienlijke uitgaven om de status van wanbetaler te behouden de concurrentie belemmeren."
    ],
    "commentSummary": [
      "Google heeft in 2021 26,3 miljard dollar uitgetrokken om zijn positie als standaardzoekmachine te behouden, wat zijn dominantie in de browsermarkt en invloed op mobiele platforms benadrukt.",
      "Gebruikers gaven aan moeilijkheden te ondervinden bij het overschakelen van Firefox naar Chrome en het aanpassen van standaardinstellingen, naast discussies over de mogelijke voor- en nadelen van het gebruik van Kagi, een alternatieve zoekmachine.",
      "Er werd bezorgdheid geuit over de concurrentiebeperkende aard van het betalen voor standaardplaatsingen en de gevolgen daarvan voor consumenten, voornamelijk naar aanleiding van de betalingen van Google aan Apple voor het zijn van de standaardzoekmachine in Safari."
    ],
    "points": 171,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1698427614
  },
  {
    "id": 38040164,
    "title": "18-jarige bouwde een computermonitor die je ogen niet belast",
    "originLink": "https://www.fastcompany.com/90971739/this-18-year-old-built-a-better-computer-monitor-that-doesnt-strain-your-eyes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040164",
    "commentBody": "",
    "originSummary": [
      "De tekst bevat code voor website-animaties en JavaScript-functies, specifiek voor \"fastcompany.com\".",
      "Het bevat ook JavaScript-objecten met parameters met betrekking tot advertentieblokkering en websitegebruik.",
      "Aangezien dit technische code is, biedt het inzicht in hoe websitefuncties worden ontwikkeld en geïmplementeerd."
    ],
    "commentSummary": [
      "De discussie draait om problemen met vermoeide ogen die geassocieerd worden met traditionele beeldschermen en het onderzoeken van mogelijke oplossingen.",
      "Suggesties zijn onder andere om de helderheid van de monitor aan te passen aan het omgevingslicht, zoals vaak wordt gedaan op mobiele schermen, en om het gebruik van reflecterende LCD-schermen in plaats van de standaard LCD-schermen te onderzoeken.",
      "Andere factoren die bijdragen aan vermoeide ogen, zoals kleurbalans, ontwerp van achtergrondverlichting en persoonlijke gevoeligheden, vereisen verder onderzoek en experimenten. Andere factoren die werden besproken waren monitorvoorkeuren, ergonomie en hoe steun van ouders jonge innovators beïnvloedt."
    ],
    "points": 171,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1698422086
  },
  {
    "id": 38043574,
    "title": "Android 14's bug in gebruikersprofielgegevens",
    "originLink": "https://arstechnica.com/gadgets/2023/10/android-14s-ransomware-data-storage-bug-locks-out-users-remains-unfixed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043574",
    "commentBody": "",
    "originSummary": [
      "Er is een opslagfout in de functie \"meerdere profielen\" van Android 14 die gegevensverlies veroorzaakt en de toegang tot de opslag van het apparaat beperkt, met gevolgen die doen denken aan ransomware.",
      "De bug werd aanvankelijk gemeld op de Pixel 6, maar lijkt bredere implicaties te hebben en een reeks apparaten te treffen.",
      "Kritiek was er op het stilzwijgen en de passiviteit van Google, omdat het bedrijf de bug nog niet heeft erkend of toegewezen voor onderzoek, ondanks meer dan 350 reacties op hun issue tracker."
    ],
    "commentSummary": [
      "Een bug in Android 14 leidt tot het verlies van gegevens uit gebruikersprofielen en tot geblokte telefoons, waarbij workarounds momenteel verder gegevensverlies veroorzaken en een fabrieksreset noodzakelijk maken.",
      "Het bestaan van de bug onderstreept de noodzaak van effectieve gegevensback-ups en zaait ontevredenheid onder gebruikers over de back-upopties van Android en de reactie van Google op het probleem.",
      "Gebruikers discussiëren over controle en aanpassingen op Android-apparaten, inclusief potentiële risico's op gegevensverlies, waarbij GrapheneOS wordt voorgesteld als een mogelijke oplossing; er worden vergelijkingen gemaakt met ransomware, wat wijst op een ernstige bezorgdheid."
    ],
    "points": 162,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1698438935
  }
]
