[
  {
    "id": 38040468,
    "title": "'অনুষদের মানের নয়': পেন কীভাবে কাটালিন কারিকোর সাথে দুর্ব্যবহার করেছিলেন",
    "originLink": "https://www.thedp.com/article/2023/10/penn-katalin-kariko-university-relationship-mistreatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040468",
    "commentBody": "",
    "originSummary": [
      "নোবেল বিজয়ী কাতালিন কারিকোর সঙ্গে কাজ করা আটজন অভিযোগ করেছেন যে পেনসিলভেনিয়া বিশ্ববিদ্যালয় ধারাবাহিকভাবে তাকে ভুলভাবে পরিচালনা করেছে এবং এমআরএনএ প্রযুক্তি নিয়ে তার যুগান্তকারী গবেষণাকে উপেক্ষা করেছে।",
      "কোভিড-১৯ ভ্যাকসিন তৈরিতে তার ভূমিকা সহ বিজ্ঞানে কারিকোর অপরিহার্য অবদান সত্ত্বেও, তিনি সন্দেহ, অর্থায়নের বাধা এবং পেনের প্রশাসনের কাছ থেকে স্বীকৃতি প্রত্যাখ্যানের মুখোমুখি হয়েছিলেন, যার ফলে তিনি জার্মানিতে বায়োএনটেক-এ চলে যান।",
      "কারিকোর অভিজ্ঞতাগুলি কীভাবে একাডেমিক তহবিল বিতরণ করা হয় এবং প্রতিভাবান বিজ্ঞানীদের স্বীকৃতি প্রদান করা হয় তার সংস্কারের প্রয়োজনীয়তার উপর জোর দেয়।"
    ],
    "commentSummary": [
      "নিবন্ধটি কোভিড-১৯ ভ্যাকসিন উন্নয়নে একজন প্রধান বিজ্ঞানীর ভুল ধারণা, সমস্যাযুক্ত অনুদান তহবিল, ওভারহেড ব্যয় এবং আমলাতান্ত্রিক নিয়োগসহ একাডেমিয়ার মধ্যে বিভিন্ন বিস্তৃত বিষয় নিয়ে আলোচনা করেছে।",
      "এটি বিশ্ববিদ্যালয়গুলিতে প্রশাসকদের প্রভাব, স্নাতক শিক্ষার্থীদের জন্য আর্থিক বোঝা, বিশ্ববিদ্যালয়গুলির অনুদান তহবিলের কারচুপি এবং একাডেমিক মেট্রিক্সের ত্রুটিগুলি নিয়ে আলোচনা করে, তহবিল সুরক্ষিত করার সাথে সম্পর্কিত চাপকে চিত্রিত করে।",
      "এটি অনুষদ এবং কর্মীদের মধ্যে অসঙ্গতি, আর্থিক অব্যবস্থাপনা, একাডেমিক গুণমান সম্পর্কে উদ্বেগ, সুযোগ মিস করা এবং একটি ফার্মাসিউটিক্যাল ফার্ম দ্বারা দুর্বলভাবে পরিচালিত মেডিকেল ট্রায়ালের একটি মামলাও সমাধান করে।"
    ],
    "points": 473,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1698423383
  },
  {
    "id": 38037851,
    "title": "মনোযোগ অর্থনীতিতে সত্যতার ধীর মৃত্যু",
    "originLink": "https://www.coryzue.com/writing/authenticity-and-engagement/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38037851",
    "commentBody": "",
    "originSummary": [
      "লেখক খাঁটি যোগাযোগকে উত্সাহিত করার পরিবর্তে বিশেষত ব্যস্ততার জন্য ডিজাইন করা বিষয়বস্তুকে উত্সাহিত করার দিকে টুইটারের পরিবর্তনের সমালোচনা করেছেন।",
      "তারা পরামর্শ দেয় যে টুইটারে বৃদ্ধি এবং জনপ্রিয়তার অনুসন্ধান প্রায়শই অসত্য মিথস্ক্রিয়া এবং বিষয়বস্তুর দিকে পরিচালিত করে।",
      "টুইটারের পেশাদারীকরণ এবং কিছু ব্যবহারকারীর অন্য প্ল্যাটফর্মে মাইগ্রেশন নির্দেশিত হয়, লেখক প্রকাশ করেছেন যে তারা টুইটার ছেড়ে যেতে পারেন যদি তার ক্যারিয়ার এবং ব্যবসায়িক সুবিধার জন্য না হয়।"
    ],
    "commentSummary": [
      "আলোচনাটি সামাজিক মিডিয়া প্ল্যাটফর্মগুলিতে, বিশেষত টুইটারে সত্যতা হ্রাস এবং ব্যবহারকারীর ব্যস্ততা এবং অর্থপূর্ণ কথোপকথনের উপর ক্ষতিকারক প্রভাবের উপর দৃষ্টি নিবদ্ধ করে।",
      "অংশগ্রহণকারীরা ক্লিকবাইট, অ্যালগরিদম-চালিত সামগ্রী, প্রভাবশালী, নগদীকরণ অনুশীলন, ভুল তথ্য ছড়িয়ে পড়া এবং নিয়ন্ত্রণের অভাব সম্পর্কে উদ্বিগ্ন, যা সমস্ত প্রকৃত সামগ্রীর দৃশ্যমানতাকে বাধা দেয়।",
      "কথোপকথনটি সোশ্যাল মিডিয়ায় সত্যতা এবং উদ্দেশ্যমূলক মিথস্ক্রিয়া পুনরুদ্ধার, ব্যক্তিগত গোষ্ঠী বা অন্যান্য প্ল্যাটফর্মের মতো বিকল্পগুলি অন্বেষণ এবং প্রযুক্তির প্রভাবের কারণে বিভিন্ন সামাজিক প্রেক্ষাপটে সত্যতা সংজ্ঞায়িত এবং বজায় রাখার চ্যালেঞ্জগুলি নিয়ে প্রশ্ন তোলার পক্ষে।"
    ],
    "points": 447,
    "commentCount": 324,
    "retryCount": 0,
    "time": 1698411654
  },
  {
    "id": 38039133,
    "title": "বিমানের ইঞ্জিন থেকে সীসা নির্গমন বায়ু দূষণে অবদান রাখে",
    "originLink": "https://www.federalregister.gov/documents/2023/10/20/2023-23247/finding-that-lead-emissions-from-aircraft-engines-that-operate-on-leaded-fuel-cause-or-contribute-to",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38039133",
    "commentBody": "",
    "originSummary": [
      "আক্রমণাত্মক স্বয়ংক্রিয় স্ক্র্যাপিংয়ের কারণে FederalRegister.gov এবং eCFR.gov অ্যাক্সেস সীমাবদ্ধ, এবং তাই কেবলমাত্র মানব ব্যবহারকারীরা ক্যাপচা সম্পূর্ণ করে প্রবেশ করতে পারেন এবং তাদের আইপি ঠিকানার জন্য অ্যাক্সেসের অনুরোধ করতে পারেন।",
      "এই অ্যাক্সেস তিন মাসের জন্য বৈধ এবং প্রয়োজনে বাড়ানো যেতে পারে।",
      "বৃহত্তর আইপি রেঞ্জ অ্যাক্সেসের জন্য, ব্যবহারকারীদের প্রথমে তাদের বর্তমান আইপির জন্য অ্যাক্সেস পাওয়া উচিত এবং তারপরে অনুরোধের জন্য \"সাইট ফিডব্যাক\" বোতামটি ব্যবহার করা উচিত।"
    ],
    "commentSummary": [
      "সারসংক্ষেপটি বিমান চালনায় সীসাযুক্ত জ্বালানী (এভিগ্যাস) ব্যবহারের উপর ক্রমবর্ধমান উদ্বেগ এবং আলোচনার উপর দৃষ্টি নিবদ্ধ করে, এটি উপস্থাপিত পরিবেশগত এবং স্বাস্থ্যঝুঁকির উপর জোর দেয়।",
      "এটি ধীর নিয়ন্ত্রক প্রক্রিয়া এবং বিকল্পগুলির সীমিত প্রাপ্যতার মতো নেতৃত্বহীন জ্বালানীতে রূপান্তরের সাথে জড়িত চ্যালেঞ্জগুলি স্বীকার করে।",
      "প্রবিধানের প্রভাব, এফএএর অগ্রাধিকার এবং বর্ধিত ব্যয় এবং আনলেডেড জ্বালানির সীমিত অ্যাক্সেস সম্পর্কে উদ্বেগ নিয়ে বিতর্ক চলছে।"
    ],
    "points": 433,
    "commentCount": 314,
    "retryCount": 0,
    "time": 1698417897
  },
  {
    "id": 38037141,
    "title": "সাইট নির্ভরযোগ্যতা প্রকৌশলের বিশ বছর থেকে শেখা পাঠ",
    "originLink": "https://sre.google/resources/practices-and-processes/twenty-years-of-sre-lessons-learned/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38037141",
    "commentBody": "",
    "originSummary": [
      "ইউটিউব এবং গুগল ক্যালেন্ডারের মতো প্ল্যাটফর্মগুলিতে ঘটনা এবং বিভ্রাট থেকে উদ্ভূত সাইট রিলাইবিলিটি ইঞ্জিনিয়ারিং (এসআরই) থেকে গুগল ের এগারোটি মূল শিক্ষা তুলে ধরা হয়েছে।",
      "কিছু উল্লেখযোগ্য পাঠের মধ্যে রয়েছে বিভ্রাটের তীব্রতার উপর ভিত্তি করে প্রশমন প্রচেষ্টার স্কেলিংয়ের প্রয়োজনীয়তা, ক্যানারি পরীক্ষার বাস্তবায়ন এবং সংকটের জন্য একটি \"বিগ রেড বোতাম\", ইন্টিগ্রেশন পরীক্ষার তাত্পর্য এবং ব্যাকআপ যোগাযোগ চ্যানেলগুলির প্রয়োজনীয়তা।",
      "অন্যান্য গুরুত্বপূর্ণ পাঠগুলির মধ্যে রয়েছে অবনমিত কর্মক্ষমতা মোড স্থাপন, প্রশমনস্বয়ংক্রিয়করণ, রোলআউটগুলির মধ্যে সময় হ্রাস করা এবং দুর্যোগ ের স্থিতিস্থাপকতা বাড়াতে ব্যর্থতার একক পয়েন্টগুলি নির্মূল করা এবং পুনরুদ্ধার।"
    ],
    "commentSummary": [
      "এই হ্যাকার নিউজ থ্রেডটি সাইট রিলাইবিলিটি ইঞ্জিনিয়ারিং (এসআরই) এবং সফ্টওয়্যার বিকাশের বহুমুখী ভূমিকা নিয়ে আলোচনা করে।",
      "বিষয়গুলির মধ্যে ব্যাকআপ যোগাযোগ চ্যানেলগুলির গুরুত্ব, ডেডিকেটেড এসআরই দল, বিভ্রাট এবং বাগগুলির জন্য প্রতিরোধ কৌশল এবং জরুরী অবস্থার আগে পুনরুদ্ধার প্রক্রিয়াপরীক্ষা অন্তর্ভুক্ত রয়েছে।",
      "আলোচনায় অংশগ্রহণকারীরা অভিজ্ঞতা এবং মতামত ভাগ করে নেয়, প্রযুক্তি শিল্পের মধ্যে এসআরই ভূমিকার বিবর্তিত প্রকৃতিকে আলোকিত করে।"
    ],
    "points": 431,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1698405928
  },
  {
    "id": 38043033,
    "title": "ছায়া: জাভাস্ক্রিপ্টে প্রায় সম্পূর্ণরূপে তৈরি নতুন ব্রাউজার ইঞ্জিন",
    "originLink": "https://goose.icu/introducing-shadow/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043033",
    "commentBody": "",
    "originSummary": [
      "goose.icu নামে একটি নতুন ব্রাউজার ইঞ্জিন, প্রাথমিকভাবে শিক্ষাগত এবং উপভোগের উদ্দেশ্যে জাভাস্ক্রিপ্টে উন্নত, এখন উপলব্ধ তবে বেশিরভাগ সাইটের সাথে সামঞ্জস্যপূর্ণ নাও হতে পারে।",
      "বিকাশকারী goose.icu সোর্স কোড ভাগ করে ওপেন-সোর্স লার্নিংকে সমর্থন করে, অন্যদের তার ডিজাইনের আকর্ষণীয় দিকগুলি অন্বেষণ, শিখতে এবং আবিষ্কার করতে আমন্ত্রণ জানায়।",
      "প্রকল্পটি প্রচলিত ধারণাকে চ্যালেঞ্জ করে যে একটি নতুন ব্রাউজার ইঞ্জিন তৈরি করা একটি বিশাল কাজ, যদি অসম্ভব না হয়।"
    ],
    "commentSummary": [
      "আলোচনায় ব্রাউজার ইঞ্জিন, বিজ্ঞাপন ব্লকিং, বিজ্ঞাপন নৈতিকতা, ওয়েবঅ্যাসেম্বলি এবং ব্রাউজারের সীমাবদ্ধতা সহ একাধিক বিষয় অন্তর্ভুক্ত রয়েছে।",
      "উচ্চমানের বিনামূল্যে পরিষেবাগুলির সম্ভাব্য সমাপ্তি এবং ব্যক্তিদের উপর বিজ্ঞাপনের প্রভাব সম্পর্কে একটি বিতর্ক রয়েছে।",
      "এটি এর ন্যূনতম জিইউআই (গ্রাফিকাল ইউজার ইন্টারফেস) এবং কীবোর্ড-কেন্দ্রিক ডিজাইনের উপর দৃষ্টি নিবদ্ধ করে এবং ওয়েবঅ্যাসেম্বলির ঝুঁকি এবং সুবিধাগুলি অন্বেষণ করে কিউটেব্রাউজারের সাথে ব্যবহারকারীর অভিজ্ঞতা তুলে ধরে।"
    ],
    "points": 396,
    "commentCount": 228,
    "retryCount": 0,
    "time": 1698435983
  },
  {
    "id": 38038713,
    "title": "স্বয়ংক্রিয় জালিয়াতি সনাক্তকরণ আমার জীবনকে নরক করে তুলছে",
    "originLink": "https://news.ycombinator.com/item?id=38038713",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038713",
    "commentBody": "",
    "originSummary": [
      "এই ব্যক্তি পারিবারিক চিকিৎসার প্রয়োজনের কারণে অস্থায়ীভাবে ভারতে চলে গেছেন এবং ব্যয় সাশ্রয়ের জন্য অনলাইন পরিষেবার উপর নির্ভর করেন তবে জালিয়াতি বিরোধী ব্যবস্থা এবং অ্যাকাউন্টের বিধিনিষেধের কারণে সমস্যার সম্মুখীন হচ্ছেন।",
      "অঞ্চল-নির্দিষ্ট অ্যাপ্লিকেশনগুলি ডাউনলোড করার মতো সরল হওয়া উচিত এমন কাজগুলির জটিলতায় তারা হতাশ এবং সংস্থাগুলির উদাসীন মনোভাবদ্বারা হতাশ।",
      "ব্যক্তিটি উপলব্ধি করে যে পণ্য ডিজাইন প্রাথমিকভাবে স্টেকহোল্ডার এবং সরকারগুলিকে উপকৃত করার লক্ষ্যে, যা ব্যবহারকারীর হতাশা এবং অসন্তুষ্টির দিকে পরিচালিত করে।"
    ],
    "commentSummary": [
      "ব্যক্তিরা অনলাইন পরিষেবা এবং আন্তর্জাতিক আর্থিক লেনদেনযেমন অবিশ্বস্ত জালিয়াতি সনাক্তকরণ সিস্টেম এবং সুরক্ষা ব্যবস্থা সীমিত করার ক্ষেত্রে সমস্যার সম্মুখীন হচ্ছেন।",
      "অ্যাক্সেস সীমাবদ্ধতা, নিয়োগের ক্ষেত্রে বৈষম্য, আন্তর্জাতিক লেনদেন এবং সাংস্কৃতিক ও নিয়ন্ত্রক বাধাগুলির সাথেও সমস্যা রয়েছে, উন্নত পেমেন্ট সিস্টেম, সুরক্ষা এবং প্রবিধানের আহ্বান জানিয়েছে।",
      "অংশগ্রহণকারীরা ব্যক্তিগত অভিজ্ঞতা ভাগ করে নেয়, এই চ্যালেঞ্জগুলি হ্রাস করার জন্য বিকল্প এবং সমাধানের পরামর্শ দেয়।"
    ],
    "points": 337,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1698416109
  },
  {
    "id": 38036921,
    "title": "কেন আপনার সম্ভবত SQLite ব্যবহার করা উচিত",
    "originLink": "https://www.epicweb.dev/why-you-should-probably-be-using-sqlite",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38036921",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি ওয়েব অ্যাপ্লিকেশন ডাটাবেস হিসাবে এসকিউলাইটের উপযুক্ততা নিয়ে আলোচনা করে, শূন্য বিলম্বতা, এম্বেডেড স্থাপনা, মাল্টি-ইনস্ট্যান্স প্রতিলিপি, স্কেলেবিলিটি এবং সরলীকৃত উন্নয়ন এবং পরীক্ষার প্রক্রিয়ার মতো বৈশিষ্ট্যগুলি তুলে ধরে।",
      "সাবস্ক্রিপশন, বাহ্যিক ক্লায়েন্ট সংযোগ, টাইমস্কেলডিবি এবং এনামগুলির মতো নির্দিষ্ট প্লাগইনগুলির অনুপস্থিতির মতো সীমাবদ্ধতা সত্ত্বেও, এসকিউলাইট প্রায়শই পছন্দ করা হয়।",
      "চূড়ান্তভাবে, এসকিউলাইটতার কর্মক্ষমতা, ব্যবহারকারী-বন্ধুত্ব এবং ব্যয়-কার্যকারিতার কারণে অনেক ওয়েব ডেভেলপারদের জন্য একটি শক্তিশালী পছন্দ হিসাবে দেখা হয়।"
    ],
    "commentSummary": [
      "আলোচনার মূল বিষয় টি পোস্টগ্রেএসকিউএল এর মতো অন্যান্য ডাটাবেস সমাধানের তুলনায় অ্যাপ্লিকেশন বিকাশ, এর শক্তি এবং ত্রুটিগুলির জন্য এসকিউলাইট ব্যবহার ের চারপাশে ঘোরে।",
      "অংশগ্রহণকারীরা স্কেলেবিলিটি, ব্যবহারকারী-বন্ধুত্ব, অপারেশনাল সীমাবদ্ধতা এবং ওয়েব স্কেলেবিলিটির প্রয়োজনীয়তার মতো বিষয়গুলি বিবেচনা করে এসকিউলাইটে তাদের অভিজ্ঞতা এবং মতামত ভাগ করে নেয়।",
      "এসকিউলাইটের উপযুক্ততা অংশগ্রহণকারীদের মধ্যে বিতর্কিত, কেউ কেউ বিকল্প ডাটাবেসের পরামর্শ দেয় এবং অন্যরা নির্দিষ্ট ব্যবহারের ক্ষেত্রে এসকিউলাইটকে উপযুক্ত বলে মনে করে। ঐকমত্য প্রকাশ করে যে পছন্দটি মূলত প্রকল্পের প্রয়োজন এবং সীমাবদ্ধতার উপর নির্ভর করে।"
    ],
    "points": 331,
    "commentCount": 279,
    "retryCount": 0,
    "time": 1698403912
  },
  {
    "id": 38038465,
    "title": "চকোলেট পণ্যগুলির এক তৃতীয়াংশ ভারী ধাতুতে বেশি থাকে",
    "originLink": "https://www.consumerreports.org/health/food-safety/a-third-of-chocolate-products-are-high-in-heavy-metals-a4844566398/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038465",
    "commentBody": "",
    "originSummary": [
      "ভোক্তা প্রতিবেদনগুলি বিভিন্ন চকোলেট এবং চকোলেটযুক্ত পণ্যগুলি পরীক্ষা করে দেখেছে যে 16 টি সীসা এবং ক্যাডমিয়ামের মতো ভারী ধাতুগুলির জন্য তাদের সুরক্ষা স্তর ছাড়িয়ে গেছে।",
      "ডার্ক চকোলেট বার, হট চকোলেট মিশ্রণ এবং কিছু ব্রাউনি / কেক মিশ্রণগুলি এমন পণ্য হিসাবে চিহ্নিত করা হয়েছিল যা সাধারণত দুধের চকোলেট বারের তুলনায় এই ভারী ধাতুগুলির উচ্চ মাত্রা ছিল।",
      "প্রতিবেদনে ভোক্তাদের এই জাতীয় পণ্যগুলির ব্যবহার সীমিত করার পরামর্শ দেওয়া হয়েছে, দূষণের মাত্রা কম রয়েছে এমন পণ্যগুলি বেছে নেওয়ার পরামর্শ দেওয়া হয়েছে এবং নির্মাতাদের কম দূষিত অঞ্চলগুলি থেকে উত্স করার পরামর্শ দেওয়া হয়েছে, পাশাপাশি দূষিত লটগুলি নিয়মিত পরীক্ষা এবং প্রত্যাখ্যান করার পরামর্শ দেওয়া হয়েছে।"
    ],
    "commentSummary": [
      "একটি সাম্প্রতিক গবেষণা ইঙ্গিত দেয় যে এক-তৃতীয়াংশ চকোলেট পণ্যগুলিতে সীসা এবং ক্যাডমিয়ামের মতো ভারী ধাতুগুলির উচ্চ মাত্রা রয়েছে, যা কোকো মটরশুটি উত্পাদিত মাটিতে ফিরে পাওয়া যায়।",
      "প্রধান চকোলেট সংস্থাগুলি সাধারণত ভারী ধাতুগুলির জন্য পরীক্ষা করে, যখন ছোটগুলি উন্নত মানের পরিবেশকদের কাছ থেকে মটরশুটি সংগ্রহ করে; বিশেষত ক্যালিফোর্নিয়ায় খাবারে ভারী ধাতুর গ্রহণযোগ্য স্তরের জন্য কঠোর নির্দেশিকা রয়েছে।",
      "চকোলেট পণ্যগুলিতে এই ধাতুগুলি গ্রহণের স্বাস্থ্য ঝুঁকি এবং সেই ঝুঁকিগুলি হ্রাস করার জন্য সতর্কতামূলক ব্যবস্থা নেওয়া উচিত কিনা তা নিয়ে চলমান বিতর্ক রয়েছে।"
    ],
    "points": 274,
    "commentCount": 191,
    "retryCount": 0,
    "time": 1698415020
  },
  {
    "id": 38038239,
    "title": "- স্ক্র্যাচডিবি - ক্লিকহাউসে ওপেন সোর্স স্নোফ্লেক",
    "originLink": "https://github.com/scratchdata/ScratchDB",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38038239",
    "commentBody": "",
    "originSummary": [
      "ইলাস্ট্রেটর ক্লিকহাউসের উপর ভিত্তি করে একটি সম্পূর্ণ-পরিচালিত ডেটা গুদাম, স্ক্র্যাচডিবি তৈরি করেছে, যার লক্ষ্য উত্পাদনে ওএলএপি (অনলাইন অ্যানালিটিকাল প্রসেসিং) ডাটাবেস বজায় রাখার প্রক্রিয়াটি সহজতর করা এবং বিকাশকারীর অভিজ্ঞতা উন্নত করা।",
      "স্ক্র্যাচডিবি স্বয়ংক্রিয়ভাবে জেএসওএন কাঠামোর উপর ভিত্তি করে টেবিল এবং কলাম তৈরি করে, ডেটা স্ট্রিমিং এবং বাল্ক লোডিং পরিচালনা করে এবং স্বয়ংক্রিয়ভাবে শার্ট এবং রেপ্লিকাগুলির যত্ন নেয়। এটি নিয়মিত সার্ভারগুলিতে কাজ করতে পারে এবং ইতিমধ্যে প্রচুর পরিমাণে ডেটা প্রক্রিয়া করেছে।",
      "স্ক্র্যাচডিবি ওপেন-সোর্স, তবে একটি পেইড হোস্টেড সংস্করণও রয়েছে। বিকাশকারী বর্তমানে বিশ্লেষণমূলক ডাটাবেস এবং বিকাশকারীর অভিজ্ঞতা বাড়ানোর উপায়গুলিতে প্রতিক্রিয়া খুঁজছেন।"
    ],
    "commentSummary": [
      "স্ক্র্যাচডিবি, একটি ওপেন-সোর্স ডেটা গুদাম, একাধিক কাজ স্বয়ংক্রিয় করে, প্রতি সেকেন্ডে 4,000 অনুরোধ পরিচালনা করে এবং উল্লেখযোগ্যভাবে কম সার্ভার খরচ সহ 2 টিবি ডেটা পরিচালনা করে বিকাশকারীর অভিজ্ঞতাকে উল্লেখযোগ্যভাবে উন্নত করে।",
      "লেখক স্ক্র্যাচডিবিকে অন্যান্য প্রকল্প থেকে আলাদা করেছেন, ব্যয় দক্ষতার জন্য ওপেন-সোর্স সফ্টওয়্যার এবং হেটজনারের মতো ব্যবহারিক অবকাঠামো নির্বাচনের প্রাধান্যের উপর জোর দিয়েছেন।",
      "লেখকের লক্ষ্য হ'ল কলামার ডেটার সাথে ডেভেলপারদের মিথস্ক্রিয়া সহজ করা এবং প্রকল্পের ক্রমাগত উন্নতির জন্য প্রতিক্রিয়া উত্সাহিত করা।"
    ],
    "points": 231,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1698413646
  },
  {
    "id": 38040702,
    "title": "একটি সুপ্ত ধারাবাহিকতা মডেল ব্যবহার করে আপনার ম্যাকে এক সেকেন্ডে চিত্র তৈরি করুন",
    "originLink": "https://replicate.com/blog/run-latent-consistency-model-on-mac",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040702",
    "commentBody": "",
    "originSummary": [
      "নিবন্ধটি কীভাবে একটি সুপ্ত ধারাবাহিকতা মডেল (এলসিএম) ব্যবহার করবেন - স্থিতিশীল বিস্তারের উপর ভিত্তি করে - 4 থেকে 8 টি পদক্ষেপের মধ্যে ম্যাকে দ্রুত চিত্র তৈরি করতে একটি গাইড সরবরাহ করে।",
      "এটি পাইথন সেট আপ করার জন্য বিস্তারিত নির্দেশাবলী সরবরাহ করে, গিথুব থেকে এলসিএম স্ক্রিপ্ট ক্লোনিং করে এবং স্ক্রিপ্টটি সফলভাবে চালানোর জন্য প্রয়োজনীয় নির্ভরতা ইনস্টল করে।",
      "এটি সমস্যা সমাধান এবং আরও অনুসন্ধানের পরামর্শ দিয়ে শেষ করে, পাঠকদের ডিসকর্ডে সহায়তা নেওয়ার এবং আরও তথ্যের জন্য গিথুব সংগ্রহস্থলব্রাউজ করার পরামর্শ দেয়।"
    ],
    "commentSummary": [
      "সুপ্ত ধারাবাহিকতা মডেলটি ম্যাক ব্যবহারকারীদের দ্রুত চিত্র তৈরি করতে সক্ষম করে, যদিও প্রাথমিক স্টার্ট-আপ সময় এবং ডিস্ক থেকে ওজন-লোডিং কর্মক্ষমতাকে প্রভাবিত করতে পারে।",
      "বিশেষ করে ম্যাক ল্যাপটপের জন্য এই মডেলের অপ্টিমাইজেশন সম্পর্কে পরামর্শ দেওয়া হয়েছে, তবে চিত্রের গুণমান সম্পর্কে উদ্বেগ উত্থাপিত হয়েছে।",
      "অন্যান্য আলোচনার বিষয়গুলির মধ্যে রয়েছে স্থানীয় ব্যবহারের জন্য একটি সুরক্ষা পরীক্ষক অপসারণ, প্রতিদ্বন্দ্বী ডিভাইসগুলির সাথে অ্যাপলের এম সিরিজের ম্যাকগুলির পারফরম্যান্সের তুলনা এবং উইন্ডোজ এবং লিনাক্স প্ল্যাটফর্মগুলিতে পাওয়ার ব্যবহার, কুলিং এবং সফ্টওয়্যার প্রাপ্যতার মতো বিবেচনা।"
    ],
    "points": 206,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1698424674
  },
  {
    "id": 38043955,
    "title": "বড় বেলুন রিফ্লেক্টর: একটি সম্ভাব্য গেম-পরিবর্তনকারী অ্যান্টেনা ডিজাইন",
    "originLink": "https://www.nasa.gov/directorates/stmd/nasa-tech-breathes-life-into-potentially-game-changing-antenna-design/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043955",
    "commentBody": "",
    "originSummary": [
      "নাসা একটি অভিনব অ্যান্টেনা ডিজাইন, লার্জ বেলুন রিফ্লেক্টর (এলবিআর) চালু করেছে, যা বিস্তৃত সংগ্রহের অ্যাপারচারের সুবিধার্থে একটি ইনফ্ল্যাটেবল ডিভাইস ব্যবহার করে।",
      "নাসার ইনোভেটিভ অ্যাডভান্সড কনসেপ্টস (এনআইএসি) প্রোগ্রাম দ্বারা সমর্থিত এলবিআর তার হালকা ওজন এবং কম্প্যাক্ট ফোল্ডেবিলিটির জন্য উল্লেখযোগ্য, যা মহাকাশে আরও সহজ স্থাপনা সক্ষম করে।",
      "ইতিমধ্যে একটি স্ট্র্যাটোস্ফেরিক বেলুনে পরীক্ষা করা, এলবিআর শীঘ্রই পৃথিবীর নিম্ন কক্ষপথে কিউবস্যাটে পরীক্ষা করা হবে, যা চন্দ্র এবং গভীর-মহাকাশ মিশনের জন্য সম্ভাব্য ব্যবহারের ইঙ্গিত দেয়।"
    ],
    "commentSummary": [
      "নাসা স্পেস টেলিস্কোপ এবং স্যাটেলাইট যোগাযোগকে রূপান্তরিত করার সম্ভাবনা সহ একটি বড় বেলুন রিফ্লেক্টর অ্যান্টেনা ডিজাইন তৈরি করেছে, যদিও এটি কিছু চ্যালেঞ্জ উপস্থাপন করে।",
      "গোলাকার প্রতিফলক সহ ইনফ্ল্যাটেবল অ্যান্টেনাগুলি বিকাশ করা হচ্ছে, যা মহাকাশ এবং পৃথিবী উভয় ক্ষেত্রেই অ্যাপ্লিকেশনগুলির সাথে দৃশ্যের একটি বিস্তৃত ক্ষেত্র, হালকা এবং সহজ স্থাপনা সরবরাহ করে।",
      "নাসার এনআইএসি প্রোগ্রাম ধ্বংসাবশেষের বিরুদ্ধে এর স্থায়িত্বের উপর জোর দিয়ে আন্তঃযান যোগাযোগের জন্য একটি ইনফ্ল্যাটেবল গোলক অ্যান্টেনা নিয়ে গবেষণায় বিনিয়োগ করছে।"
    ],
    "points": 177,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1698440880
  },
  {
    "id": 38042114,
    "title": "মাইক্রোসফ্ট এমন ইমেল সরবরাহ করতে ব্যর্থ হচ্ছে যা newclimate.org উল্লেখ করে",
    "originLink": "https://newclimate.org/news/microsoft-error-or-external-attack-causing-disruption-to-email-communication-across-the",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38042114",
    "commentBody": "",
    "originSummary": [
      "একটি মাইক্রোসফ্ট ত্রুটি বা সম্ভাব্য বাহ্যিক আক্রমণ জলবায়ু পরিবর্তন সম্প্রদায়ের মধ্যে ইমেল যোগাযোগকে ব্যাহত করেছে, বিশেষত নিউক্লাইমেট ইউআরএল অন্তর্ভুক্ত ইমেলগুলির সাথে জড়িত।",
      "যদিও ইমেল ব্লকিং সমস্যাটি আংশিকভাবে সমাধান করা হয়েছে, নিউক্লাইমেট ইউআরএল সহ পিডিএফ সংযুক্তিগুলি এখনও অবরুদ্ধ রয়েছে এবং হারিয়ে যাওয়া ইমেলগুলির পুনরুদ্ধার অনিশ্চিত রয়ে গেছে। এটি বিভিন্ন সরকারী এবং বেসরকারী জলবায়ু সংস্থাকে প্রভাবিত করে।",
      "মাইক্রোসফ্ট প্রকৌশলীরা এই ইস্যুতে সক্রিয়ভাবে কাজ করছেন, তবে অন্তর্নিহিত কারণটি অনির্ধারিত, এবং আগের সপ্তাহগুলিতে হারিয়ে যাওয়া ইমেলগুলি পুনরুদ্ধারযোগ্য নাও হতে পারে। এই পরিস্থিতি সম্ভাব্যভাবে COP28 এর প্রস্তুতিকে প্রভাবিত করতে পারে।"
    ],
    "commentSummary": [
      "মাইক্রোসফ্টের আউটলুক 365 ইমেল পরিষেবাটি ওয়েবসাইট newclimate.org উল্লেখ করে ইমেলগুলি ব্লক করছে, যা জলবায়ু পরিবর্তন সংস্থাগুলির জন্য বিঘ্ন সৃষ্টি করছে, যার মধ্যে গুরুত্বপূর্ণ প্রতিবেদনের প্রচারে বাধা রয়েছে।",
      "যদিও ওয়েবসাইটটি আনুষ্ঠানিকভাবে মাইক্রোসফ্ট দ্বারা কালো তালিকাভুক্ত নয়, সংস্থাটি পৃথক সংস্থাগুলিকে তাদের ব্যবহারের জন্য এটি আনব্লক করার অনুমতি দেয়, স্বায়ত্তশাসিত সেন্সরশিপ নিয়ন্ত্রণ সম্পর্কে প্রশ্ন উত্থাপন করে।",
      "ইচ্ছাকৃতভাবে লক্ষ্যবস্তু বা আপোসযুক্ত অবকাঠামোর বরখাস্ত হওয়া সত্ত্বেও, এই ঘটনাটি তথ্য প্রচারের উপর বড় প্রযুক্তি সংস্থাগুলির সম্ভাব্য প্রভাব সম্পর্কে উদ্বেগ সৃষ্টি করেছে, ব্যবহারকারীদের এই সংস্থাগুলি কতটা তথ্য নিয়ন্ত্রণ বা দমন করতে পারে তা নিয়ে প্রশ্ন তুলেছে।"
    ],
    "points": 172,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1698431420
  },
  {
    "id": 38041335,
    "title": "ডিফল্ট সার্চ ইঞ্জিন হতে ২০২১ সালে গুগল ২৬.৩ বিলিয়ন ডলার দিয়েছে",
    "originLink": "https://www.theverge.com/2023/10/27/23934961/google-antitrust-trial-defaults-search-deal-26-3-billion",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38041335",
    "commentBody": "",
    "originSummary": [
      "যুক্তরাষ্ট্র বনাম মার্কিন যুদ্ধের সময়। গুগলের অ্যান্টিট্রাস্ট ট্রায়ালে দেখা গেছে, ২০২১ সালে অসংখ্য ব্রাউজার, ফোন ও প্লাটফর্মে ডিফল্ট সার্চ ইঞ্জিন হতে ২৬.৩ বিলিয়ন ডলার খরচ করেছে গুগল।",
      "এই ব্যয়টি গুগলের অনুসন্ধান আয়ের প্রায় 16% এবং এর মুনাফার 29% প্রতিনিধিত্ব করে, সাফারিতে ডিফল্ট স্ট্যাটাসের জন্য অ্যাপলকে একটি উল্লেখযোগ্য অংশ প্রদান করা হয়।",
      "ট্রায়ালটি ডিফল্টের প্রভাব এবং ডিফল্ট স্থিতি বজায় রাখার জন্য এই জাতীয় উল্লেখযোগ্য ব্যয় প্রতিযোগিতাকে বাধা দেয় কিনা তা নিয়ে প্রশ্নকে কেন্দ্র করে।"
    ],
    "commentSummary": [
      "ব্রাউজার বাজারে তার আধিপত্য এবং মোবাইল প্ল্যাটফর্মের উপর প্রভাব তুলে ধরে ডিফল্ট সার্চ ইঞ্জিন হিসাবে তার অবস্থান বজায় রাখতে গুগল ২০২১ সালে ২৬.৩ বিলিয়ন ডলার বরাদ্দ করেছে।",
      "ব্যবহারকারীরা ফায়ারফক্স থেকে ক্রোমে স্যুইচ করা এবং ডিফল্ট সেটিংস সামঞ্জস্য করতে অসুবিধা প্রকাশ করেছেন, পাশাপাশি বিকল্প সার্চ ইঞ্জিন কাগি ব্যবহারের সম্ভাব্য গুণাবলী এবং নেতিবাচক দিকগুলি নিয়ে আলোচনা করেছেন।",
      "ডিফল্ট প্লেসমেন্টের জন্য অর্থ প্রদানের প্রতিযোগিতাবিরোধী প্রকৃতি এবং ভোক্তাদের উপর এর প্রভাব সম্পর্কে উদ্বেগ উত্থাপিত হয়েছিল, যা মূলত সাফারিতে ডিফল্ট সার্চ ইঞ্জিন হওয়ার জন্য অ্যাপলকে গুগলের অর্থ প্রদানের ফলে উদ্ভূত হয়েছিল।"
    ],
    "points": 171,
    "commentCount": 169,
    "retryCount": 0,
    "time": 1698427614
  },
  {
    "id": 38040164,
    "title": "18 বছর বয়সী একটি কম্পিউটার মনিটর তৈরি করেছে যা আপনার চোখকে চাপ দেয় না",
    "originLink": "https://www.fastcompany.com/90971739/this-18-year-old-built-a-better-computer-monitor-that-doesnt-strain-your-eyes",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38040164",
    "commentBody": "",
    "originSummary": [
      "পাঠ্যটিতে ওয়েবসাইট অ্যানিমেশন এবং জাভাস্ক্রিপ্ট ফাংশনগুলির জন্য কোড রয়েছে, বিশেষত \"fastcompany.com\" জন্য।",
      "এতে বিজ্ঞাপন ব্লকিং এবং ওয়েবসাইট ব্যবহার সম্পর্কিত প্যারামিটারগুলির সাথে জাভাস্ক্রিপ্ট অবজেক্টগুলিও অন্তর্ভুক্ত রয়েছে।",
      "যেহেতু এটি প্রযুক্তিগত কোড, এটি ওয়েবসাইটের কার্যকারিতাগুলি কীভাবে বিকাশ এবং প্রয়োগ করা হয় সে সম্পর্কে অন্তর্দৃষ্টি সরবরাহ করে।"
    ],
    "commentSummary": [
      "বক্তৃতাটি ঐতিহ্যগত মনিটরগুলির সাথে যুক্ত চোখের চাপের সমস্যা এবং সম্ভাব্য প্রতিকারের অনুসন্ধানের চারপাশে ঘোরে।",
      "পরামর্শগুলির মধ্যে রয়েছে পরিবেষ্টিত আলোর সাথে সামঞ্জস্য করার জন্য মনিটরের উজ্জ্বলতা সামঞ্জস্য করা - যেমনটি সাধারণত মোবাইল স্ক্রিনে করা হয় এবং স্ট্যান্ডার্ড এলসিডিগুলির উপর প্রতিফলিত এলসিডি ডিসপ্লেগুলির ব্যবহার অন্বেষণ করা।",
      "চোখের স্ট্রেনের অন্যান্য অবদানকারী কারণগুলি যেমন রঙের ভারসাম্য, ব্যাকলাইট ডিজাইন এবং ব্যক্তিগত সংবেদনশীলতার জন্য আরও তদন্ত এবং পরীক্ষা প্রয়োজন। আলোচিত অন্যান্য কারণগুলির মধ্যে রয়েছে মনিটর পছন্দগুলি, এর্গোনোমিক্স এবং পিতামাতার সমর্থন কীভাবে তরুণ উদ্ভাবকদের প্রভাবিত করে।"
    ],
    "points": 171,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1698422086
  },
  {
    "id": 38043574,
    "title": "অ্যান্ড্রয়েড 14 এর ব্যবহারকারী-প্রোফাইল ডেটা বাগ",
    "originLink": "https://arstechnica.com/gadgets/2023/10/android-14s-ransomware-data-storage-bug-locks-out-users-remains-unfixed/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38043574",
    "commentBody": "",
    "originSummary": [
      "অ্যান্ড্রয়েড 14 এর \"একাধিক প্রোফাইল\" বৈশিষ্ট্যটিতে একটি স্টোরেজ বাগ রয়েছে যা ডেটা ক্ষতি করে এবং ডিভাইস স্টোরেজে অ্যাক্সেসকে সীমাবদ্ধ করে, যার প্রভাবগুলি র্যানসমওয়্যারের কথা মনে করিয়ে দেয়।",
      "প্রাথমিকভাবে পিক্সেল 6 এ রিপোর্ট করা হয়েছে, বাগটির বিস্তৃত প্রভাব রয়েছে বলে মনে হচ্ছে, যা বিভিন্ন ডিভাইসকে প্রভাবিত করে।",
      "গুগলের নীরবতা এবং নিষ্ক্রিয়তাকে লক্ষ্য করে সমালোচনা করা হয়েছে, কারণ সংস্থাটি তাদের ইস্যু ট্র্যাকারে 350 টিরও বেশি উত্তর দেওয়ার পরেও এখনও বাগটি স্বীকার করেনি বা তদন্তের জন্য বরাদ্দ করেনি।"
    ],
    "commentSummary": [
      "অ্যান্ড্রয়েড 14 এর একটি বাগ ব্যবহারকারী-প্রোফাইল ডেটা হ্রাস এবং ইটযুক্ত ফোনগুলির দিকে পরিচালিত করছে, বর্তমানে ওয়ার্কআরাউন্ডগুলি আরও ডেটা ক্ষতি করছে এবং ফ্যাক্টরি রিসেটের প্রয়োজন।",
      "বাগটির অস্তিত্ব কার্যকর ডেটা ব্যাকআপের প্রয়োজনীয়তা তুলে ধরে এবং অ্যান্ড্রয়েডের ব্যাকআপ বিকল্প এবং সমস্যার প্রতি গুগলের প্রতিক্রিয়া সম্পর্কে ব্যবহারকারীদের মধ্যে অসন্তোষ ের বীজ বপন করে।",
      "ব্যবহারকারীরা সম্ভাব্য ডেটা ক্ষতির ঝুঁকি সহ অ্যান্ড্রয়েড ডিভাইসগুলিতে নিয়ন্ত্রণ এবং কাস্টমাইজেশন নিয়ে বিতর্ক করছেন, গ্রাফিনওএসকে সম্ভাব্য সমাধান হিসাবে প্রস্তাব করা হয়েছে; র্যানসমওয়্যারের সাথে তুলনা করা হয়, যা একটি গুরুতর উদ্বেগের ইঙ্গিত দেয়।"
    ],
    "points": 162,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1698438935
  }
]
