[
  {
    "id": 37791002,
    "title": "Schwierige Dinge leicht machen",
    "originLink": "https://jvns.ca/blog/2023/10/06/new-talk--making-hard-things-easy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37791002",
    "commentBody": "",
    "originSummary": [
      "Der Redner auf der Strange Loop-Konferenz weiß, wie schwer es ist, komplexe Konzepte wie DNS und SQL sowie Programmiersprachen wie Bash zu verstehen.",
      "Der Schwerpunkt des Vortrags liegt auf dem Austausch von Wissen und Erfahrungen sowie auf der Verwendung von Werkzeugen und Beispielen, um verborgene Facetten von Computerprozessen zu enthüllen.",
      "Der Redner schätzt die Organisatoren der Konferenz und weist auf ihr Interesse an Untersuchungen hin, die sich auf die Verbesserung von UI-Design-Elementen, wie Git, konzentrieren."
    ],
    "commentSummary": [
      "Der Artikel behandelt die Bedeutung von Tools, die verborgene Informationen liefern, und die Herausforderungen bei der Programmierung in Bash und SQL, einschließlich der Schwierigkeiten, sich die Syntax von Kommandozeilen-Tools zu merken.",
      "Interaktive Shells, ihre Vorteile, der Bedarf an besseren Werkzeugen und alternative Programmiersprachen werden diskutiert.",
      "Die Notwendigkeit, Kernkonzepte zu verstehen, Wissen zu teilen, die Nutzung von Foren, Werkzeuge zur Verringerung der kognitiven Belastung, KI wie GPT-4 beim Skripting und unterschiedliche Präferenzen bei den Lernmethoden werden ebenfalls angesprochen."
    ],
    "points": 870,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1696601381
  },
  {
    "id": 37793635,
    "title": "AMD kann den CUDA-Graben überwinden",
    "originLink": "https://www.hpcwire.com/2023/10/05/how-amd-may-get-across-the-cuda-moat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37793635",
    "commentBody": "",
    "originSummary": [
      "Der Artikel befasst sich mit der Vorherrschaft von Nvidia auf dem GenAI-Markt und den Problemen, mit denen diejenigen konfrontiert werden, die andere Hardware verwenden wollen.",
      "Es unterstreicht die Wettbewerbsstrategien von AMD, wie die Unterstützung von PyTorch und die Einführung des Instinct MI300A Prozessors, um Nvidia Konkurrenz zu machen.",
      "Der Artikel hebt die Bedeutung von Leistung, Portabilität und Verfügbarkeit inmitten der GenAI-Hardware-Wettbewerbe hervor und informiert über aktuelle Entwicklungen in der Branche."
    ],
    "commentSummary": [
      "Die Diskussion dreht sich um den Wettbewerb zwischen AMD und NVIDIA auf dem GPU-Markt, insbesondere im Hinblick auf KI, maschinelles Lernen, High-Performance-Computing und die Verwendung von Linux-basierten Grafikkarten.",
      "Die Teilnehmer konzentrieren sich auf die Leistung, die Kompatibilität und die Grenzen der AMD-GPU-Computing-Technologie und der ROCm-Plattform. Sie vergleichen sie mit dem CUDA-Framework von NVIDIA und beleuchten die Herausforderungen in Bezug auf Hardware-Unterstützung, Paketierung, Build-Systeme und Software-Ökosystem.",
      "Es wurde festgestellt, dass AMD einen besseren Support, mehr Ressourcen und eine höhere Leistung benötigt. Die Teilnehmer erörtern auch die möglichen Auswirkungen des Wettbewerbs auf die Preise und das Potenzial neuer Marktteilnehmer wie Intel auf dem GPU-Markt."
    ],
    "points": 431,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696613736
  },
  {
    "id": 37789107,
    "title": "Wir öffnen den Zugang zu den Formularen von Gov.uk",
    "originLink": "https://gds.blog.gov.uk/2023/10/03/how-were-opening-up-access-to-gov-uk-forms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789107",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Der Artikel lobt die benutzerfreundliche Oberfläche und das Design von GOV.UK, beleuchtet aber auch mögliche Datenschutzbedenken und die Abhängigkeit von externen Plattformen.",
      "Der Beitrag spiegelt auch die unterschiedlichen Ansichten über die Attraktivität von Arbeitsplätzen im Bereich der Regierungstechnologie und die Effizienz von Regierungssystemen wider.",
      "Er hebt die Vorteile des digitalen Signatursystems der britischen Regierung und die Funktionen der Website gov.uk hervor und schlägt vor, die Richtlinien für Regierungsformulare zu verbessern."
    ],
    "points": 339,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1696589675
  },
  {
    "id": 37792690,
    "title": "Postman-Update entfernt alle Ihre Daten, wenn Sie sich weigern, ein Konto zu erstellen",
    "originLink": "https://news.ycombinator.com/item?id=37792690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792690",
    "commentBody": "",
    "originSummary": [
      "Ein Benutzer berichtete, dass die Offline-Nutzung von Postman ohne Konto dazu führte, dass alle seine Sammlungen und Einstellungen gelöscht wurden, wenn er sich weigerte, ein Konto zu erstellen, wenn er dazu aufgefordert wurde.",
      "Trotz der anschließenden Erstellung eines Kontos konnten die gelöschten Daten nicht wiederhergestellt werden, obwohl es dem Benutzer gelang, sie manuell von einem Backup an einem bestimmten Ort wiederherzustellen.",
      "Dieser Vorfall hat dazu geführt, dass der Benutzer sein Vertrauen in Postman verloren hat und nun nach alternativen Tools sucht, auf die er umsteigen kann."
    ],
    "commentSummary": [
      "Die jüngste Aktualisierung von Postman, einem API-Client-Tool, hat bei den Nutzern Frustration ausgelöst, da nun die Erstellung eines Kontos erforderlich ist, was zu Bedenken hinsichtlich des Datenverlusts führt.",
      "Die Benutzer erforschen Alternativen zu Postman, zu denen Tools wie Insomnia, VSCode-Erweiterungen, HTTPie, Bruno, Kreya, Paw/Rapid API, Hopscotch und IntelliJ HTTP-Anfragen gehören.",
      "Einige bevorzugen curl oder Kommandozeilenalternativen, während andere trotz Bedenken hinsichtlich Preis und Kompatibilität für die Bequemlichkeit von GUI-Tools wie Postman plädieren."
    ],
    "points": 314,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1696608894
  },
  {
    "id": 37794379,
    "title": "23andMe sagt, dass Benutzerdaten bei einem Angriff zum Ausfüllen von Anmeldeinformationen gestohlen wurden",
    "originLink": "https://www.bleepingcomputer.com/news/security/genetics-firm-23andme-says-user-data-stolen-in-credential-stuffing-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37794379",
    "commentBody": "",
    "originSummary": [
      "Das Genetikunternehmen 23andMe hat eine Datenpanne durch einen Angriff zum Ausfüllen von Zugangsdaten gemeldet, bei dem Nutzerdaten gestohlen wurden.",
      "Die kompromittierten Daten enthalten vollständige Namen, Benutzernamen, Profilbilder, genetische Abstammungsergebnisse und geografische Standorte der Nutzer.",
      "Um solche Angriffe zu verhindern, empfiehlt das Unternehmen den Nutzern, eine Zwei-Faktor-Authentifizierung zu verwenden und sichere, eindeutige Passwörter für ihre Online-Konten festzulegen."
    ],
    "commentSummary": [
      "Im Mittelpunkt der Diskussionen stehen Fragen der Sicherheit und des Schutzes der Privatsphäre im Zusammenhang mit Gentests von Unternehmen wie 23andMe sowie Themen wie Datenschutzverletzungen, Passwortsicherheit und Haftung für den Datenschutz.",
      "Einige Teilnehmer plädieren für strengere Sicherheitsmaßnahmen und eine größere Verantwortung der Unternehmen, während andere die Eigenverantwortung der Nutzer für ihre Daten betonen und die Wirksamkeit bestimmter Sicherheitsstrategien in Frage stellen.",
      "Die Gespräche verdeutlichen die komplexen Herausforderungen und möglichen Auswirkungen des Umgangs mit persönlichen und genetischen Daten."
    ],
    "points": 287,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1696616947
  },
  {
    "id": 37790745,
    "title": "Thread pro Kern",
    "originLink": "https://without.boats/blog/thread-per-core/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790745",
    "commentBody": "",
    "originSummary": [
      "Die Rust-Gemeinschaft debattiert über die standardmäßige Verwendung von Multi-Thread-Executors in der asynchronen Programmierung, wobei einige für eine \"Thread-per-Core\"-Architektur plädieren.",
      "Der Artikel befasst sich mit den Konzepten der \"work-stealing\"- und \"share-nothing\"-Architekturen und untersucht deren Auswirkungen auf die Systemleistung. Er verweist auf das Papier von Pekka Enberg, das die Vorteile der Share-Nothing-Architektur veranschaulicht.",
      "Der Autor äußert Zweifel an der Durchführbarkeit und Einfachheit der Implementierung von Enbergs Architektur im Vergleich zu traditionellen Methoden und kommt zu dem Schluss, dass sich Work-Stealing für Systeme mit einem gemeinsamen Zustand als vorteilhaft erweisen könnte."
    ],
    "commentSummary": [
      "Die Texte umfassen Diskussionen über Programmiersprachen, Gleichzeitigkeitsmodelle, asynchrone Programmierung sowie die Schwierigkeiten bei der Fehlersuche und -behebung.",
      "Zu den speziellen Themen gehören die Thread-per-Core-Architektur, Work Stealing Executors, Stackful Coroutines, Datenverarbeitung, Hochgeschwindigkeits-Netzwerkschnittstellenkarten und die Programmiersprache Rust.",
      "Es wird betont, wie wichtig ein effizientes Ressourcenmanagement, die Berücksichtigung von Leistungskompromissen, robuste Debugging-Tools und die Notwendigkeit einer strengeren technischen Kritik im Softwareentwicklungssektor sind."
    ],
    "points": 257,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696600052
  },
  {
    "id": 37789371,
    "title": "Verwenden Sie ein altes Tablet als zusätzlichen Monitor",
    "originLink": "https://github.com/alex028502/extra-screen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789371",
    "commentBody": "",
    "originSummary": [
      "Die genannte Funktion ist ausschließlich für Terminal- und Curses-Anwendungen verfügbar."
    ],
    "commentSummary": [
      "Der Artikel befasst sich mit der Verwendung von Tablets und Smartphones als sekundäre Displays für Computer und untersucht verschiedene Softwarelösungen.",
      "Er entlarvt das Thema der Verwendung mehrerer Monitore zur Produktivitätssteigerung, erörtert Präferenzen hinsichtlich der Anordnung von Bildschirmen und Eingabegeräten und spricht über die Grenzen der derzeitigen Möglichkeiten.",
      "In der Diskussion wird vor allem die Notwendigkeit einer breiteren Palette von Eingabemöglichkeiten und besseren Aufgaben- und Informationsmanagementsystemen hervorgehoben."
    ],
    "points": 240,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1696592201
  },
  {
    "id": 37788847,
    "title": "Narges Mohammadi erhält den Friedensnobelpreis 2023",
    "originLink": "https://www.cnn.com/world/live-news/nobel-peace-prize-2023-latest-news-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37788847",
    "commentBody": "",
    "originSummary": [
      "Die iranische Aktivistin Narges Mohammadi, die wegen ihres Einsatzes für die Rechte der Frauen seit über 30 Jahren im Gefängnis sitzt, wurde mit dem Friedensnobelpreis 2023 ausgezeichnet, was einen wichtigen Schritt gegen die Unterdrückung im Iran darstellt.",
      "Die iranische Regierung verhängt strengere Strafen gegen Frauen, die gegen die Kleiderordnung verstoßen, und setzt künstliche Intelligenz zur Identifizierung ein.",
      "Die ukrainische Menschenrechtsverteidigerin Oleksandra Matviichuk hat ihre Unterstützung für Mohammadi bekundet und damit die entscheidende Rolle der Solidarität im Kampf für die Freiheit unterstrichen, während die internationale Anerkennung des Modells eine starke Botschaft an die iranische Führung ist, die die Rechte der Frauen betont."
    ],
    "commentSummary": [
      "Dieser Text befasst sich mit den Kontroversen um den Friedensnobelpreis, einschließlich seiner Glaubwürdigkeit und der Bedenken hinsichtlich einer Politisierung.",
      "Der Inhalt befasst sich mit der Kritik am Auswahlverfahren des Preises und stellt einen Bezug zu realen Ereignissen wie dem Sturz der iranischen Regierung her.",
      "Die Diskussionen unterstreichen die Vielfalt der Ansichten über politische Regime, den Friedensnobelpreis selbst und das weltweite Streben nach Frieden."
    ],
    "points": 226,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1696586601
  },
  {
    "id": 37792444,
    "title": "Shortbread - KI-Comics in wenigen Minuten erstellen",
    "originLink": "https://shortbread.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792444",
    "commentBody": "",
    "originSummary": [
      "Shortbread ist eine benutzerfreundliche Plattform, die es Nutzern ermöglicht, Comics und Manga-Serien zu erstellen, ohne sich anmelden zu müssen, mit einem einfachen Einstiegsprozess und einem vollständig anpassbaren Editor.",
      "Die technische Struktur der Plattform basiert auf GPT 3.5 Turbo für die Skripterstellung und SD 1.5 für das Zuschneiden von Bildern, mit einem Frontend und Backend, die mit Next.js 13 auf Vercel bzw. Firebase entwickelt wurden.",
      "Shortbread plant, seine Funktionen zu erweitern, um detailliertere Bedienelemente und verschiedene Stile anzubieten, und bittet um konstruktive Kritik und Vorschläge zur Verbesserung des Dienstes."
    ],
    "commentSummary": [
      "Shortbread.ai hat eine neue Plattform veröffentlicht, die es Nutzern ermöglicht, KI-basierte Comics und Manga-Serien zu erstellen, indem sie der KI Vorgaben für die Erstellung von Comic-Panels machen.",
      "Dennoch leidet die aktuelle Version der Plattform an Problemen mit der Konsistenz und der Zeichenkontrolle, die das Unternehmen derzeit aktiv angeht und die Serverkapazität erhöht, um den steigenden Nutzerverkehr zu bewältigen.",
      "Obwohl der Dienst in der anfänglichen Betaphase kostenlos ist, könnte in Zukunft ein Abonnementmodell eingeführt werden. Die Plattform stößt auf großes Interesse bei den Nutzern, obwohl einige über technische Probleme bei der Anmeldung berichten."
    ],
    "points": 201,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696607782
  },
  {
    "id": 37792507,
    "title": "Ein Bewerbungs-Tracker mit Unternehmensbewertungen, Autoresponder für Personalverantwortliche",
    "originLink": "https://rolepad.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792507",
    "commentBody": "",
    "originSummary": [
      "Rolepad ist ein kostenloser Dienst, der die Stellensuche durch ein Aufzeichnungssystem verbessert, das die Verfolgung und Verwaltung von Bewerbungen, die Speicherung von Korrespondenz mit Personalverantwortlichen, die Erstellung von Fortschrittsdiagrammen und anonyme Bewertungen der Bewerbungsverfahren von Unternehmen ermöglicht.",
      "Der Technologie-Stack von Rolepad besteht aus React mit Tailwind für das Frontend und C# für das Backend und wird auf AWS für robuste und skalierbare Cloud-Lösungen gehostet. Die Anwendung wird serverseitig gerendert (SSR) für eine schnellere Leistung und keinen Kaltstart.",
      "Der Erfinder von Rolepad nimmt Gespräche mit Arbeitgebern auf, um Strategien zu finden, die die Frustration von Bewerbern und Arbeitgebern verringern und den gesamten Einstellungsprozess verbessern."
    ],
    "commentSummary": [
      "Rolepad ist ein Programm zur Verfolgung von Bewerbungen, das für mehr Transparenz und Effizienz im Einstellungsprozess sorgt. Es ermöglicht den Nutzern, Bewerbungen zu verfolgen, Unternehmensinformationen zu sammeln und den Fortschritt anhand von Diagrammen zu visualisieren.",
      "Die Nutzer können auch Feedback zu ihren Erfahrungen mit dem Bewerbungs-, Vorstellungsgesprächs- und Stellenangebotsverfahren geben. Rolepad verwendet React, C# und wird auf AWS gehostet und nutzt Google Firebase für die Authentifizierung.",
      "Der Gründer denkt über die Entwicklung einer einheitlichen Plattform für Arbeitssuchende und Arbeitgeber nach, wobei sich die Diskussionen auf Datenschutzbelange, die Authentizität der Bewertungen, künftige Funktionen, wirksame Sicherheitsmaßnahmen, mögliche Monetarisierungsmethoden und den Technologie-Stack konzentrieren. Bewerbungen für YC Winter 2024 sind derzeit möglich."
    ],
    "points": 193,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696608072
  },
  {
    "id": 37792294,
    "title": "Java 21 VirtualThreads vs. Clojure Lazy Seqs",
    "originLink": "https://clojure.org/news/2023/10/06/deref",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792294",
    "commentBody": "",
    "originSummary": [
      "Die neueste Ausgabe von Clojure Deref kündigt die Veröffentlichung von Java 21 an und beleuchtet dessen Auswirkungen auf virtuelle Threads und Probleme mit Objektmonitoren bei I/O-Blocking.",
      "In dieser Ausgabe werden verschiedene Lösungen wie die Verwendung von ReentrantLocks zur Lösung von Konflikten zwischen Objektmonitoren und virtuellen Threads untersucht.",
      "Die Ausgabe beschreibt die laufenden Arbeiten an funktionalen Schnittstellenadaptern, Methodenthunks, Verfeinerungen bei der impliziten Koerziation und Konvertierung sowie die Einführung einer neuen Syntax für Array-Klassen."
    ],
    "commentSummary": [
      "Der Artikel konzentriert sich auf die Unterschiede zwischen Java 21 VirtualThreads und Clojure Lazy Seqs, wobei das Problem des temporären Synchronisations-Pinings in Clojure und die mögliche Lösung mit nativen GraalVM-Images angesprochen wird.",
      "Er schlägt die Verwendung von virtuellen Threads in Java als eine Nischenlösung vor, die jedoch eine effiziente Lösung für Anwendungen mit hohem Datenverkehr darstellt, und untersucht die Vor- und Nachteile der Verwendung von Clojure, ClojureScript, Kotlin und Java in der Softwareentwicklung.",
      "Er enthält einen Vergleich der Kompatibilität und Unterstützung von Kotlin in verschiedenen integrierten Entwicklungsumgebungen (IDEs) wie Eclipse, IntelliJ und VS Code und regt eine Diskussion über die Bedeutung von IDEs für Sprachen wie Java an."
    ],
    "points": 191,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1696607053
  },
  {
    "id": 37790174,
    "title": "Vor dreißig Jahren: MS-DOS 6.00",
    "originLink": "https://www.pcjs.org/blog/2023/10/04/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790174",
    "commentBody": "",
    "originSummary": [
      "In der Zusammenfassung wird die MultiConfig-Funktion in MS-DOS 6.00 vorgestellt, ein System, das eine einfache Anpassung der Startkonfigurationen ermöglicht.",
      "Er weist auf die Existenz von Fehlern in der DoubleSpace-Funktion von MS-DOS hin.",
      "Es gibt eine Diskussion über verschiedene Konfigurationen und Optionen im Zusammenhang mit dem COMMAND.COM-Befehlsinterpreter für DOS 7.00."
    ],
    "commentSummary": [
      "Der Artikel regt eine nostalgische Diskussion über frühe Versionen von MS-DOS 6.00 und Windows an, einschließlich der Herausforderungen, die sich stellten, der Speicheroptimierung und des Spielens während dieser Ära.",
      "Die Kommentatoren berichten über ihre unterschiedlichen Erfahrungen mit MS-DOS, Windows und Festplattenkomprimierungssoftware sowie über die Verwendung alternativer Betriebssysteme.",
      "In den Diskussionen wird auf die rasanten Fortschritte der Informationstechnologie (IT) in den 1990er Jahren verwiesen."
    ],
    "points": 175,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1696597047
  },
  {
    "id": 37797606,
    "title": "DotBigBang - Multiplayer-Spiel-Engine mit 120fps und 2 Sekunden Ladezeit",
    "originLink": "https://dotbigbang.com/game/1af877e9bfdb47088611f55982b7570f/prestons-diamond-wars?mp=playdw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37797606",
    "commentBody": "",
    "originSummary": [
      "In dem Beitrag werden die Fortschritte auf dotbigbang.com erörtert, einer umfassenden Plattform, auf der Multiplayer-Spiele sowie die Spiel-Editoren im Internet betrieben werden.",
      "Es bietet eine einzigartige Funktion, die es Nutzern ermöglicht, Multiplayer-Spiele zu erstellen und gemeinsam zu nutzen, indem sie einfach einen Link bereitstellen, ohne dass eine Einrichtung erforderlich ist.",
      "Weitere Details, Dokumente und Aktualisierungen sind auf der Website, dem Blog und dem Discord-Server der Plattform zu finden."
    ],
    "commentSummary": [
      "DotBigBang ist eine webbasierte Multiplayer-Spiel-Engine, die die einfache Erstellung und gemeinsame Nutzung von Spielen auf mehreren Geräten ermöglicht. Die Plattform zeichnet sich durch hohe Bildraten und schnelle Ladezeiten aus.",
      "Es wurde von einem kleinen Team mit Python, Go und TypeScript entwickelt und erleichtert die Diskussion über seine Funktionen, Implementierungsherausforderungen und gemeinsame Erfahrungen mit technischen Problemen.",
      "Das Feedback der Nutzer zeigt, dass wirksame Maßnahmen gegen Betrug erforderlich sind, um das Spielerlebnis zu verbessern."
    ],
    "points": 163,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1696634767
  },
  {
    "id": 37792030,
    "title": "Unreal Engine wird nicht mehr kostenlos für alle sein",
    "originLink": "https://www.creativebloq.com/news/epic-games-unreal-engine-charge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792030",
    "commentBody": "",
    "originSummary": [
      "Epic Games hat die Umstellung auf ein abonnementbasiertes Preismodell für die Grafik-Engine Unreal Engine angekündigt, das sich nicht nur an die Spielebranche richtet, sondern auch die Verwendung für VFX oder Animation betrifft.",
      "Im Gegensatz zum bisherigen Lizenzgebührenmodell, das nur für Projekte mit einem Umsatz von über 1 Million Dollar galt, könnte sich dieses neue Modell auf unabhängige Filmemacher und nicht-professionelle Nutzer auswirken.",
      "Obwohl noch keine Details zu den Preisen bekannt gegeben wurden, versicherte Epic Games CEO Tim Sweeney, dass die neuen Tarife weder exorbitant noch ungewöhnlich billig sein werden; der Zugang zur Unreal Engine für Studenten und Lehrkräfte wird weiterhin kostenlos sein."
    ],
    "commentSummary": [
      "Die Unreal Engine hat ihr Lizenzierungsmodell geändert und wird nicht mehr für alle Nutzer kostenlos sein. Es enthält nun Umsatzschwellen für eine umfangreiche kommerzielle Nutzung außerhalb der Spieleentwicklung.",
      "In dem Artikel wird argumentiert, dass die Änderungen, auch wenn sie hinsichtlich ihrer Fairness und ihrer Auswirkungen auf die Industrie weithin diskutiert werden, nicht so dramatisch sind, wie sie scheinen, und dass sie früher hätten vorausgesehen werden können.",
      "Der Autor diskutiert die Vor- und Nachteile des Abo-Modells und die Notwendigkeit eines nachhaltigen Geschäftsmodells im Kontext der finanziellen Situation von Epic Games."
    ],
    "points": 157,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1696605859
  },
  {
    "id": 37795652,
    "title": "Vorfall bei 23andMe: Daten von 1,3 Mio. Nutzern wurden abgegriffen",
    "originLink": "https://therecord.media/scraping-incident-genetic-testing-site",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37795652",
    "commentBody": "",
    "originSummary": [
      "Das Gentestunternehmen 23andMe hat einen Vorfall eingeräumt, bei dem Hacker auf sensible Nutzerdaten zugegriffen und diese im Dark Web verkauft haben.",
      "Die durchgesickerten Daten enthalten Herkunftsschätzungen, gesundheitsbezogene Informationen und Fotos von fast 7 Millionen Nutzern und offenbaren eine Sicherheitslücke bei 23andMe.",
      "Trotz eines anfänglichen Dementis bestätigte das Unternehmen die Verletzung und stellt die Theorie auf, dass der Verstoß auf durchgesickerte Anmeldedaten von anderen Plattformen zurückzuführen ist, was bei Gentests zu Bedenken hinsichtlich Datenschutz und Sicherheit führt."
    ],
    "commentSummary": [
      "Bei der Gentestfirma 23andMe kam es zu einer Datenpanne, in deren Folge persönliche Informationen von etwa 1,3 Millionen Nutzern durchsickerten.",
      "Die Datenverletzung wurde durch einen Angriff mit gestohlenen Zugangsdaten verursacht, eine Art von Cyberangriff, bei dem gestohlene Zugangsdaten verwendet werden, um unbefugten Zugang zu Benutzerkonten zu erhalten.",
      "Weitere Einzelheiten und Diskussionen über die Veranstaltung sind auf der Plattform Hacker News zu finden."
    ],
    "points": 154,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1696622932
  }
]
