[
  {
    "id": 37791002,
    "title": "Zor İşleri Kolaylaştırmak",
    "originLink": "https://jvns.ca/blog/2023/10/06/new-talk--making-hard-things-easy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37791002",
    "commentBody": "",
    "originSummary": [
      "Strange Loop konferansındaki konuşmacı, DNS ve SQL gibi karmaşık kavramların ve bash gibi programlama dillerinin anlaşılmasındaki zorlukların farkındadır.",
      "Konuşma, bilgi ve deneyimlerin paylaşılmasına ve bilgisayar süreçlerinin bilinmeyen yönlerini ortaya çıkarmak için araçlar ve örnekler kullanılmasına vurgu yapıyor.",
      "Konuşmacı, konferans organizatörlerini takdir ediyor ve Git gibi kullanıcı arayüzü tasarım öğelerini geliştirmeye odaklanan keşiflere ilgi duyduklarını belirtiyor."
    ],
    "commentSummary": [
      "Makale, gizli bilgi sağlayan araçların önemini ve komut satırı araç sözdizimini hatırlama zorlukları da dahil olmak üzere bash ve SQL'de programlama yaparken karşılaşılan zorlukları tartışmaktadır.",
      "Etkileşimli kabuklar, bunların faydaları, daha iyi araçlara olan talep ve alternatif programlama dilleri tartışılmaktadır.",
      "Temel kavramları anlama ihtiyacı, bilgi paylaşımı, forumların kullanımı, bilişsel yük azaltma araçları, senaryo yazımında GPT-4 gibi yapay zeka ve öğrenme yöntemlerinde değişen tercihler de gündeme gelmektedir."
    ],
    "points": 870,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1696601381
  },
  {
    "id": 37793635,
    "title": "AMD CUDA hendeğini aşabilir",
    "originLink": "https://www.hpcwire.com/2023/10/05/how-amd-may-get-across-the-cuda-moat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37793635",
    "commentBody": "",
    "originSummary": [
      "Makale, Nvidia'nın GenAI pazarındaki hakimiyetini ve farklı donanım kullanmak isteyenlerin karşılaştığı sorunları ele alıyor.",
      "AMD'nin Nvidia'ya rakip olmak için PyTorch'u desteklemek ve Instinct MI300A işlemcisini piyasaya sürmek gibi rekabet stratejilerinin altını çiziyor.",
      "Makale, GenAI donanım rekabetleri arasında performans, taşınabilirlik ve kullanılabilirliğin önemini vurgulamakta ve sektördeki gelişmelerle ilgili güncellemeleri içermektedir."
    ],
    "commentSummary": [
      "Tartışma, GPU pazarında AMD ve NVIDIA arasındaki rekabete, özellikle de yapay zeka, makine öğrenimi, yüksek performanslı bilgi işlem ve Linux tabanlı grafik kartı kullanımına odaklanıyor.",
      "Katılımcılar, AMD'nin GPU bilgi işlem teknolojisi ve ROCm platformunun performansı, uyumluluğu ve sınırlamalarına odaklanmaktadır. Bunu NVIDIA'nın CUDA çerçevesiyle karşılaştırıyor ve donanım desteği, paketleme, derleme sistemleri ve yazılım ekosistemiyle ilgili zorlukların altını çiziyorlar.",
      "AMD'nin daha iyi desteğine, gelişmiş kaynaklara ve daha iyi performansa ihtiyaç duyulduğu tespit edildi. Katılımcılar ayrıca rekabetin fiyatlar üzerindeki potansiyel etkisini ve Intel gibi GPU pazarına yeni girenlerin potansiyelini tartışıyor."
    ],
    "points": 431,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696613736
  },
  {
    "id": 37789107,
    "title": "Gov.uk formlarına erişimi açıyoruz",
    "originLink": "https://gds.blog.gov.uk/2023/10/03/how-were-opening-up-access-to-gov-uk-forms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789107",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Makale, GOV.UK'nin kullanıcı dostu arayüzünü ve tasarımını överken, aynı zamanda potansiyel gizlilik endişelerine ve harici platformlara bağımlılığa da ışık tutuyor.",
      "Yazı aynı zamanda kamu teknoloji işlerinin cazibesi ve kamu sistemlerinin verimliliği konusundaki farklı görüşleri de yansıtıyor.",
      "Birleşik Krallık hükümetinin dijital imza sisteminin ve gov.uk web sitesinin özelliklerinin avantajlarını vurgulamakta ve hükümet formları için geliştirilmiş yönergelere ihtiyaç olduğunu öne sürmektedir."
    ],
    "points": 339,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1696589675
  },
  {
    "id": 37792690,
    "title": "Postman güncellemesi, hesap oluşturmayı reddederseniz tüm eşyalarınızı kaldırır",
    "originLink": "https://news.ycombinator.com/item?id=37792690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792690",
    "commentBody": "",
    "originSummary": [
      "Bir kullanıcı, Postman'i hesap olmadan çevrimdışı kullanmanın, sorulduğunda hesap oluşturmayı reddettiğinde tüm koleksiyonlarının ve ayarlarının silinmesine neden olduğunu bildirdi.",
      "Daha sonra bir hesap oluşturmasına rağmen, silinen veriler kurtarılamadı, ancak kullanıcı belirli bir konumdaki bir yedekten manuel olarak geri yüklemeyi başardı.",
      "Bu olay, şu anda geçiş yapmak için alternatif araçlar arayan kullanıcının Postman'a olan güvenini kaybetmesine neden oldu."
    ],
    "commentSummary": [
      "Bir API istemci aracı olan Postman'a yapılan son güncelleme, artık bir hesap oluşturulmasını gerektirdiği ve veri kaybına ilişkin endişelere neden olduğu için kullanıcılarda hayal kırıklığına yol açtı.",
      "Kullanıcılar Insomnia, VSCode uzantıları, HTTPie, Bruno, Kreya, Paw/Rapid API, Hopscotch ve IntelliJ HTTP istekleri gibi araçları içeren Postman alternatiflerini araştırıyor.",
      "Bu kullanıcılar arasında bir bölünme ortaya çıkmaktadır; bazıları curl veya komut satırı alternatiflerini tercih ederken, diğerleri fiyatlandırma ve uyumlulukla ilgili endişelere rağmen Postman gibi GUI araçlarının rahatlığını savunmaktadır."
    ],
    "points": 314,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1696608894
  },
  {
    "id": 37794379,
    "title": "23andMe, kimlik bilgisi doldurma saldırısında kullanıcı verilerinin çalındığını açıkladı",
    "originLink": "https://www.bleepingcomputer.com/news/security/genetics-firm-23andme-says-user-data-stolen-in-credential-stuffing-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37794379",
    "commentBody": "",
    "originSummary": [
      "Genetik şirketi 23andMe, kullanıcı verilerinin çalınmasıyla sonuçlanan bir kimlik bilgisi doldurma saldırısı yoluyla bir veri ihlali olduğunu bildirdi.",
      "Ele geçirilen veriler, kullanıcıların tam adlarını, kullanıcı adlarını, profil görüntülerini, genetik soy sonuçlarını ve coğrafi konumlarını içermektedir.",
      "Bu tür saldırıları önlemek için firma, kullanıcıların iki faktörlü kimlik doğrulama kullanmalarını ve çevrimiçi hesapları için güçlü, benzersiz parolalar oluşturmalarını öneriyor."
    ],
    "commentSummary": [
      "Tartışmaların ana teması, 23andMe gibi genetik test firmalarıyla bağlantılı güvenlik ve gizlilik sorunlarının yanı sıra veri ihlalleri, şifre güvenliği ve veri koruma sorumluluğu gibi konular etrafında dönüyor.",
      "Bazı katılımcılar daha sert güvenlik önlemlerini ve daha fazla kurumsal sorumluluğu savunurken, diğerleri verilerin kullanıcı sahipliğine vurgu yapmakta ve belirli güvenlik stratejilerinin etkinliğini sorgulamaktadır.",
      "Konuşmalar, kişisel ve genetik verilerle uğraşmanın karmaşık zorluklarının ve olası sonuçlarının altını çiziyor."
    ],
    "points": 287,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1696616947
  },
  {
    "id": 37790745,
    "title": "Çekirdek başına iş parçacığı",
    "originLink": "https://without.boats/blog/thread-per-core/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790745",
    "commentBody": "",
    "originSummary": [
      "Rust topluluğu, asenkron programlamada çok iş parçacıklı yürütücülerin varsayılan kullanımını tartışıyor ve bazıları \"çekirdek başına iş parçacığı\" mimarisini savunuyor.",
      "Makale, \"iş çalan\" ve \"hiçbir şey paylaşmayan\" mimari kavramlarını incelemekte ve bunların sistem performansı üzerindeki etkilerini araştırmaktadır. Pekka Enberg'in share-nothing mimarisinin avantajlarını gösteren makalesine atıfta bulunuyor.",
      "Yazar, Enberg'in mimarisini geleneksel yöntemlere kıyasla uygulamanın fizibilitesi ve basitliği konusunda şüphelerini dile getirmekte ve iş çalmanın paylaşılan bir duruma sahip sistemler için faydalı olabileceği sonucuna varmaktadır."
    ],
    "commentSummary": [
      "Metinler, hata ayıklama ve sorun giderme zorluklarının yanı sıra programlama dilleri, eşzamanlılık modelleri, eşzamansız programlama ile ilgili tartışmaları da kapsamaktadır.",
      "Vurgulanan spesifik konular arasında çekirdek başına iş parçacığı mimarisi, iş çalan yürütücüler, yığınlı korutinler, veri işleme, yüksek hızlı ağ arayüz kartları ve Rust programlama dili yer almaktadır.",
      "Kaynak yönetimi verimliliğinin önemi, performans ödünleşimlerinin dikkate alınması, sağlam hata ayıklama araçları ve yazılım geliştirme sektöründe daha sıkı teknik eleştiriye duyulan ihtiyaç vurgulanmaktadır."
    ],
    "points": 257,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696600052
  },
  {
    "id": 37789371,
    "title": "Eski bir tableti ekstra monitör olarak kullanın",
    "originLink": "https://github.com/alex028502/extra-screen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789371",
    "commentBody": "",
    "originSummary": [
      "Söz konusu özellik terminal ve curses uygulamaları için özel olarak mevcuttur."
    ],
    "commentSummary": [
      "Makale, tablet ve akıllı telefonların bilgisayarlar için ikincil ekran olarak kullanımını ele alıyor ve çeşitli yazılım çözümlerini inceliyor.",
      "Daha yüksek üretkenlik için birden fazla monitör kullanma konusunu tartışıyor, ekran düzenlemesi ve giriş cihazlarıyla ilgili tercihleri tartışıyor ve mevcut seçeneklerin sınırlamalarından bahsediyor.",
      "Tartışmanın en önemli noktası, daha geniş bir girdi seçenekleri yelpazesine ve daha iyi görev ve bilgi yönetim sistemlerine duyulan ihtiyacın vurgulanmasıdır."
    ],
    "points": 240,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1696592201
  },
  {
    "id": 37788847,
    "title": "Narges Mohammadi 2023 Nobel Barış Ödülü'nü kazandı",
    "originLink": "https://www.cnn.com/world/live-news/nobel-peace-prize-2023-latest-news-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37788847",
    "commentBody": "",
    "originSummary": [
      "Kadın haklarını savunduğu için 30 yılı aşkın süredir hapiste olan İranlı aktivist Narges Mohammadi'nin 2023 Nobel Barış Ödülü'ne layık görülmesi İran'daki baskıya karşı önemli bir geri adım anlamına geliyor.",
      "İran hükümeti, kıyafet kurallarını ihlal eden kadınlara daha katı cezalar uyguluyor ve kimlik tespiti için yapay zekadan yararlanıyor.",
      "Ukraynalı insan hakları savunucusu Oleksandra Matviichuk, Mohammadi'ye desteğini göstererek özgürlük mücadelesinde dayanışmanın hayati rolüne işaret ederken, modelin uluslararası tanınırlığı da İranlı liderlere kadın haklarını vurgulayan güçlü bir mesaj gönderiyor."
    ],
    "commentSummary": [
      "Bu metin, Nobel Barış Ödülü'nün güvenilirliği ve siyasallaşması konusundaki endişeler de dahil olmak üzere Nobel Barış Ödülü'nü çevreleyen tartışmaları incelemektedir.",
      "İçerik, ödülün seçim sürecine yönelik eleştirileri irdeliyor ve İran hükümetinin devrilmesi gibi gerçek olaylarla bağlantı kuruyor.",
      "Tartışmalar, siyasi rejimler, Nobel Barış Ödülü'nün kendisi ve küresel barış arayışına ilişkin çeşitli görüşlerin altını çiziyor."
    ],
    "points": 226,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1696586601
  },
  {
    "id": 37792444,
    "title": "Shortbread - Dakikalar içinde yapay zeka çizgi romanları oluşturun",
    "originLink": "https://shortbread.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792444",
    "commentBody": "",
    "originSummary": [
      "Shortbread, kullanıcıların oturum açma zorunluluğu olmadan, kolay bir katılım süreci ve tamamen özelleştirilebilir bir editör ile çizgi roman ve manga serileri oluşturmasına olanak tanıyan kullanıcı dostu bir platformdur.",
      "Platformun teknik yapısı, sırasıyla Vercel ve Firebase üzerinde Next.js 13 kullanılarak geliştirilen bir ön uç ve arka uç ile komut dosyası oluşturma için GPT 3.5 Turbo ve görüntü kırpma için SD 1.5'e dayanmaktadır.",
      "Shortbread, daha ayrıntılı panel kontrolleri ve çeşitli stiller sunmak için özelliklerini genişletmeyi planlıyor ve hizmeti geliştirmek için yapıcı eleştiri ve önerileri davet ediyor."
    ],
    "commentSummary": [
      "Shortbread.ai, kullanıcıların yapay zekanın çizgi roman panelleri oluşturması için yönlendirmeler sağlayarak yapay zeka tabanlı çizgi roman ve manga serileri oluşturmasına olanak tanıyan yeni bir platform yayınladı.",
      "Bununla birlikte, platformun mevcut versiyonu, şirketin aktif olarak ele aldığı tutarlılık ve karakter kontrolü sorunlarının yanı sıra artan kullanıcı trafiğini idare etmek için sunucu kapasitesini ölçeklendiriyor.",
      "Hizmet şu anda ilk beta aşamasında ücretsiz olsa da, gelecekte bir abonelik modeli uygulanabilir. Bazılarının teknik giriş sorunları bildirmesine rağmen platform önemli ölçüde kullanıcı ilgisi çekmiştir."
    ],
    "points": 201,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696607782
  },
  {
    "id": 37792507,
    "title": "Şirket incelemeleri, işe alım otomatik yanıtlayıcısı içeren bir iş başvurusu izleyicisi",
    "originLink": "https://rolepad.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792507",
    "commentBody": "",
    "originSummary": [
      "Rolepad, bir kayıt tutma sistemi sunarak, başvuruların izlenmesine ve yönetilmesine izin vererek, işe alım yazışmalarını kaydederek, ilerleme çizelgeleri oluşturarak ve şirketlerin başvuru süreçlerine ilişkin anonim incelemeler yaparak iş aramayı geliştirmek için tasarlanmış ücretsiz bir hizmettir.",
      "Rolepad'in teknoloji yığını, ön uçta Tailwind ile React, arka uç için C#'tan oluşur ve sağlam ve ölçeklenebilir bulut çözümleri için AWS'de barındırılır. Uygulama, daha hızlı performans ve soğuk başlatma olmaması için sunucu tarafında işlenmiştir (SSR).",
      "Rolepad'in yaratıcısı, hem iş adayları hem de işverenler için hayal kırıklığını azaltacak stratejiler keşfetmek üzere işverenlerle görüşmeler başlatarak genel işe alım sürecini iyileştirme konusundaki kararlılığını gösteriyor."
    ],
    "commentSummary": [
      "Rolepad, işe alım sürecinde şeffaflığı ve verimliliği artırmak için tasarlanmış, kullanıcıların iş başvurularını takip etmesine, şirket bilgilerini biriktirmesine ve grafikler aracılığıyla ilerlemeyi görselleştirmesine olanak tanıyan bir iş başvurusu izleyicisidir.",
      "Kullanıcılar ayrıca başvuru, mülakat ve iş teklifi prosedürleriyle ilgili deneyimleri hakkında geri bildirimde bulunabilirler. React ve C# kullanan Rolepad, AWS üzerinde barındırılıyor ve kimlik doğrulama için Google Firebase kullanılıyor.",
      "Kurucu, iş arayanlar ve işverenler için birleşik bir platform geliştirmeyi düşünüyor ve tartışmalar gizlilik endişeleri, incelemenin gerçekliği, gelecekteki özellikler, etkili güvenlik önlemleri, olası para kazanma yöntemleri ve teknoloji yığınına odaklanıyor. YC Winter 2024 için başvurular şu anda açık."
    ],
    "points": 193,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696608072
  },
  {
    "id": 37792294,
    "title": "Java 21 VirtualThreads vs. Clojure Lazy Seqs",
    "originLink": "https://clojure.org/news/2023/10/06/deref",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792294",
    "commentBody": "",
    "originSummary": [
      "Clojure Deref'in en yeni baskısı, Java 21'in sanal iş parçacıkları üzerindeki etkilerini ve G/Ç engelleme sırasında nesne izleyicileri ile ilgili sorunları vurgulayarak yayınlandığını duyuruyor.",
      "Konu, nesne izleyicileri ve sanal iş parçacıkları arasındaki çatışmaları çözmek için ReentrantLocks kullanımı gibi çeşitli çözümleri araştırmaktadır.",
      "Bu sayıda, işlevsel arayüz adaptörleri, yöntem parçacıkları, örtük zorlama ve dönüştürmedeki iyileştirmeler ve yeni bir dizi sınıfı sözdiziminin tanıtımı üzerinde devam eden çalışmalar ayrıntılı olarak açıklanmaktadır."
    ],
    "commentSummary": [
      "Makale, Java 21 VirtualThreads ve Clojure Lazy Seqs arasındaki farklara odaklanmakta, Clojure'daki geçici senkronizasyon sabitleme sorununa ve GraalVM yerel görüntülerini kullanarak potansiyel düzeltmeye değinmektedir.",
      "Java'da sanal iş parçacıklarının yüksek trafikli uygulamalar için niş ancak potansiyel olarak verimli bir çözüm olarak kullanılmasını önermekte ve yazılım geliştirmede Clojure, ClojureScript, Kotlin ve Java kullanımının artılarını ve eksilerini gözden geçirmektedir.",
      "Eclipse, IntelliJ ve VS Code gibi farklı Entegre Geliştirme Ortamlarında (IDE) Kotlin uyumluluğu ve desteğinin karşılaştırılmasını içeriyor ve Java gibi diller için IDE'lerin uygunluğu üzerine bir tartışma başlatıyor."
    ],
    "points": 191,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1696607053
  },
  {
    "id": 37790174,
    "title": "Otuz Yıl Önce: MS-DOS 6.00",
    "originLink": "https://www.pcjs.org/blog/2023/10/04/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790174",
    "commentBody": "",
    "originSummary": [
      "Özet, başlangıç yapılandırmalarının kolayca özelleştirilmesine olanak tanıyan bir sistem olan MS-DOS 6.00'daki MultiConfig özelliğini tanıtmaktadır.",
      "MS-DOS'un DoubleSpace özelliğindeki hataların varlığını vurgulamaktadır.",
      "DOS 7.00 için COMMAND.COM komut yorumlayıcısına bağlı çeşitli yapılandırmalar ve seçenekler hakkında bir tartışma bulunmaktadır."
    ],
    "commentSummary": [
      "Makale, MS-DOS 6.00 ve Windows'un ilk sürümleri hakkında, o dönemde karşılaşılan zorluklar, bellek optimizasyonu ve oyunlar da dahil olmak üzere nostaljik bir tartışma başlatıyor.",
      "Yorumcular MS-DOS, Windows ve disk sıkıştırma yazılımlarının yanı sıra alternatif işletim sistemlerinin kullanımına ilişkin çeşitli deneyimlerini paylaşmaktadır.",
      "Tartışmalarda 1990'larda Bilgi Teknolojilerinde (BT) yaşanan hızlı gelişmelere atıfta bulunulmaktadır."
    ],
    "points": 175,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1696597047
  },
  {
    "id": 37797606,
    "title": "DotBigBang - 120 fps ve 2 saniye yükleme süresine sahip çok oyunculu oyun motoru",
    "originLink": "https://dotbigbang.com/game/1af877e9bfdb47088611f55982b7570f/prestons-diamond-wars?mp=playdw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37797606",
    "commentBody": "",
    "originSummary": [
      "Yazıda, çok oyunculu oyunların yanı sıra oyun editörlerinin de web üzerinde faaliyet gösterdiği tamamen kapsayıcı bir platform olan dotbigbang.com'daki gelişmeler ele alınıyor.",
      "Kullanıcıların sadece bir bağlantı sağlayarak çok oyunculu oyunlar oluşturmasına ve paylaşmasına olanak tanıyan benzersiz bir özellik sunar ve herhangi bir kurulum ihtiyacını ortadan kaldırır.",
      "Kullanıcılar daha fazla ayrıntıya, belgeye ve güncellemeye platformun kendi web sitesinden, blogundan ve Discord sunucusundan erişebilir."
    ],
    "commentSummary": [
      "DotBigBang, web tabanlı çok oyunculu bir oyun motorudur ve oyunların birden fazla cihazda kolayca oluşturulmasına ve paylaşılmasına olanak tanır. Platform yüksek kare hızlarına ve hızlı yükleme sürelerine sahiptir.",
      "Python, Go ve TypeScript kullanan küçük bir ekip tarafından geliştirilen bu program, özellikleri, uygulama zorlukları ve teknik sorunlarla ilgili paylaşılan deneyimler etrafında tartışmayı kolaylaştırıyor.",
      "Kullanıcı geri bildirimleri, oyun deneyimini geliştirmek için etkili hile karşıtı önlemlere ihtiyaç duyulduğunu göstermektedir."
    ],
    "points": 163,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1696634767
  },
  {
    "id": 37792030,
    "title": "Unreal Engine artık herkes için ücretsiz olmayacak",
    "originLink": "https://www.creativebloq.com/news/epic-games-unreal-engine-charge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792030",
    "commentBody": "",
    "originSummary": [
      "Epic Games, grafik motoru Unreal Engine için, VFX veya animasyon kullanımını etkileyecek şekilde, oyun dışındaki sektörlere yönelik abonelik tabanlı bir fiyatlandırma modeline geçtiğini duyurdu.",
      "Sadece 1 milyon doların üzerinde gelir elde eden projelere uygulanan önceki telif modelinden farklı olarak, bu yeni model bağımsız film yapımcılarını ve profesyonel olmayan kullanıcıları potansiyel olarak etkileyebilir.",
      "Fiyatlandırma detayları henüz paylaşılmamış olsa da Epic Games CEO'su Tim Sweeney, yeni fiyatların fahiş veya alışılmadık derecede ucuz olmayacağını; Unreal Engine'e öğrenci ve eğitimci erişiminin ücretsiz olmaya devam edeceğini belirtti."
    ],
    "commentSummary": [
      "Unreal Engine lisanslama modelini değiştirdi ve artık tüm kullanıcılar için ücretsiz olmayacak. Artık oyun geliştirme dışında büyük ticari kullanım için gelir eşikleri içeriyor.",
      "Makale, her ne kadar adil olup olmadığı ve sektörler üzerindeki etkisi geniş çapta tartışılsa da, değişikliklerin göründüğü kadar dramatik olmadığını ve daha önceden öngörülebileceğini savunmaktadır.",
      "Yazar, Epic Games'in mali durumu bağlamında aboneliğe dayalı modelin artılarını ve eksilerini ve sürdürülebilir bir iş modelinin gerekliliğini tartışıyor."
    ],
    "points": 157,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1696605859
  },
  {
    "id": 37795652,
    "title": "23andMe kazıma olayı 1,3 milyon kullanıcının verilerini sızdırdı",
    "originLink": "https://therecord.media/scraping-incident-genetic-testing-site",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37795652",
    "commentBody": "",
    "originSummary": [
      "Genetik test şirketi 23andMe, bilgisayar korsanlarının hassas kullanıcı verilerine eriştiği ve bunları dark web'de sattığı bir veri kazıma olayını kabul etti.",
      "Sızdırılan veriler arasında yaklaşık 7 milyon kullanıcının köken tahmini, sağlıkla ilgili bilgileri ve fotoğrafları yer alıyor ve 23andMe'deki bir güvenlik açığını ortaya koyuyor.",
      "İlk başta inkar etmesine rağmen, şirket ihlali doğruladı ve ihlalin diğer platformlardan sızan giriş bilgileri nedeniyle gerçekleştiğini ve genetik test şirketlerinde gizlilik ve güvenlik endişelerini artırdığını teorize etti."
    ],
    "commentSummary": [
      "Genetik test firması 23andMe, yaklaşık 1,3 milyon kullanıcının kişisel bilgilerinin sızmasıyla sonuçlanan bir veri ihlaline tanık oldu.",
      "Veri ihlali, çalınan hesap kimlik bilgilerinin kullanıcı hesaplarına yetkisiz erişim sağlamak için kullanıldığı bir siber saldırı türü olan kimlik bilgisi doldurma saldırısından kaynaklanmıştır.",
      "Etkinlikle ilgili daha fazla ayrıntı ve tartışmalara Hacker News platformundan ulaşılabilir."
    ],
    "points": 154,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1696622932
  }
]
