[
  {
    "id": 37791002,
    "title": "הופכים דברים קשים לקלים",
    "originLink": "https://jvns.ca/blog/2023/10/06/new-talk--making-hard-things-easy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37791002",
    "commentBody": "",
    "originSummary": [
      "הדובר בכנס Strange Loop מזהה את הקשיים בהבנת מושגים מורכבים כמו DNS ו-SQL, ושפות תכנות כמו bash.",
      "ההרצאה שמה דגש על שיתוף ידע וחוויות, ושימוש בכלים ודוגמאות כדי לחשוף היבטים מעורפלים של תהליכים ממוחשבים.",
      "הדובר מעריך את מארגני הכנס ומציין את התעניינותם במחקרים המתמקדים בשיפור אלמנטים של עיצוב ממשק משתמש, כמו Git."
    ],
    "commentSummary": [
      "המאמר דן במשמעותם של כלים המספקים מידע מוסתר ובאתגרים העומדים בפני תכנות בבש וב-SQL, כולל קשיים בזכירת תחביר כלי שורת הפקודה.",
      "פגזים אינטראקטיביים, היתרונות שלהם, הביקוש לכלים טובים יותר, ושפות תכנות חלופיות מתווכחים.",
      "כמו כן מועלה הצורך להבין מושגי ליבה, שיתוף ידע, שימוש בפורומים, כלים להפחתת עומס קוגניטיבי, בינה מלאכותית כמו GPT-4 בסקריפטים והעדפות משתנות בשיטות למידה."
    ],
    "points": 870,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1696601381
  },
  {
    "id": 37793635,
    "title": "AMD עשויה לחצות את חפיר CUDA",
    "originLink": "https://www.hpcwire.com/2023/10/05/how-amd-may-get-across-the-cuda-moat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37793635",
    "commentBody": "",
    "originSummary": [
      "המאמר מתמודד עם השליטה של Nvidia בשוק GenAI והבעיות העומדות בפני אלה המבקשים להשתמש בחומרה שונה.",
      "זה מדגיש את האסטרטגיות התחרותיות של AMD, כמו גיבוי PyTorch והשקת מעבד Instinct MI300A, כדי להתחרות באנבידיה.",
      "המאמר מדגיש את החשיבות של ביצועים, ניידות וזמינות בתחרויות חומרה GenAI, יחד עם עדכונים על התפתחויות בתעשייה."
    ],
    "commentSummary": [
      "הדיון מתמקד בתחרות בין AMD ל-NVIDIA בשוק המעבדים הגרפיים, במיוחד בכל הנוגע לבינה מלאכותית, למידת מכונה, מחשוב עתיר ביצועים ושימוש בכרטיסים גרפיים מבוססי לינוקס.",
      "המשתתפים מתמקדים בביצועים, תאימות ומגבלות של טכנולוגיית מחשוב GPU של AMD ופלטפורמת ROCm. הם משווים אותה למסגרת CUDA של NVIDIA ומדגישים את האתגרים הקשורים לתמיכה בחומרה, אריזה, בניית מערכות ומערכת אקולוגית של תוכנה.",
      "זוהה צורך בתמיכה טובה יותר, משאבים משופרים וביצועים משופרים של AMD. המשתתפים דנים גם בהשפעה הפוטנציאלית של התחרות על המחירים, ובפוטנציאל של מתחרים חדשים כמו אינטל בשוק המעבדים הגרפיים."
    ],
    "points": 431,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696613736
  },
  {
    "id": 37789107,
    "title": "אנחנו פותחים גישה לטפסים Gov.uk",
    "originLink": "https://gds.blog.gov.uk/2023/10/03/how-were-opening-up-access-to-gov-uk-forms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789107",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "המאמר משלים את הממשק והעיצוב הידידותיים למשתמש של GOV.UK, תוך שהוא שופך אור על חששות פוטנציאליים לפרטיות ותלות בפלטפורמות חיצוניות.",
      "המאמר משקף גם השקפות שונות על כוח המשיכה של משרות טכנולוגיות ממשלתיות ועל יעילותן של מערכות ממשלתיות.",
      "הוא מדגיש את היתרונות של מערכת החתימה הדיגיטלית של ממשלת בריטניה ואת התכונות של אתר gov.uk, ומציע דרישה להנחיות משופרות עבור טפסים ממשלתיים."
    ],
    "points": 339,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1696589675
  },
  {
    "id": 37792690,
    "title": "עדכון הדוור מסיר את כל התוכן שלך אם אתה מסרב ליצור חשבון",
    "originLink": "https://news.ycombinator.com/item?id=37792690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792690",
    "commentBody": "",
    "originSummary": [
      "משתמש דיווח כי השימוש ב-Postman במצב לא מקוון ללא חשבון גרם לכך שכל האוספים וההגדרות שלו נמחקו לאחר שסירב ליצור חשבון כאשר התבקש.",
      "למרות יצירת חשבון לאחר מכן, הנתונים שנמחקו לא שוחזרו, אם כי המשתמש הצליח לשחזר אותם באופן ידני מגיבוי במיקום ספציפי.",
      "תקרית זו הובילה לאובדן אמון בפוסטמן מצד המשתמש, שמחפש כעת כלים חלופיים לעבור אליהם."
    ],
    "commentSummary": [
      "העדכון האחרון ל-Postman, כלי לקוח API, עורר תסכול בקרב המשתמשים מכיוון שהוא דורש כעת יצירת חשבון, מה שגרם לחששות לגבי אובדן נתונים.",
      "משתמשים בוחנים חלופות ל- Postman, הכוללות כלים כמו נדודי שינה, הרחבות VSCode, HTTPie, Bruno, Kreya, Paw/Rapid API, Hopscotch ובקשות IntelliJ HTTP.",
      "בקרב משתמשים אלה מתגלה פיצול כאשר חלקם מעדיפים חלופות תלתלים או שורת פקודה, בעוד שאחרים טוענים לנוחות של כלי GUI כמו Postman למרות חששות לגבי תמחור ותאימות."
    ],
    "points": 314,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1696608894
  },
  {
    "id": 37794379,
    "title": "23andMe: נתוני משתמשים נגנבו במתקפת מילוי אישורים",
    "originLink": "https://www.bleepingcomputer.com/news/security/genetics-firm-23andme-says-user-data-stolen-in-credential-stuffing-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37794379",
    "commentBody": "",
    "originSummary": [
      "חברת הגנטיקה 23andMe דיווחה על דליפת נתונים באמצעות מתקפת מילוי אישורים, שהובילה לגניבת נתוני משתמשים.",
      "הנתונים שנחשפו כוללים שמות מלאים, שמות משתמש, תמונות פרופיל, תוצאות מוצא גנטי ומיקומים גיאוגרפיים של משתמשים.",
      "כדי למנוע התקפות כאלה, החברה ממליצה למשתמשים להשתמש באימות דו-שלבי וליצור סיסמאות חזקות וייחודיות לחשבונות המקוונים שלהם."
    ],
    "commentSummary": [
      "הנושא המרכזי של הדיונים סובב סביב סוגיות אבטחה ופרטיות הקשורות לחברות בדיקות גנטיות, כגון 23andMe, כמו גם נושאים כמו פריצות נתונים, אבטחת סיסמאות ואחריות להגנה על נתונים.",
      "נקודות מבט שונות עולות, כאשר חלק מהמשתתפים תומכים באמצעי אבטחה מחמירים יותר ואחריות תאגידית מוגברת, בעוד שאחרים מדגישים את בעלות המשתמשים על נתונים ומטילים ספק ביעילות של אסטרטגיות אבטחה מסוימות.",
      "השיחות מדגישות את האתגרים המורכבים ואת ההשלכות האפשריות של התמודדות עם נתונים אישיים וגנטיים."
    ],
    "points": 287,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1696616947
  },
  {
    "id": 37790745,
    "title": "הליך משנה לליבה",
    "originLink": "https://without.boats/blog/thread-per-core/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790745",
    "commentBody": "",
    "originSummary": [
      "קהילת Rust מתלבטת לגבי השימוש המוגדר כברירת מחדל במבצעים מרובי הליכי משנה בתכנות אסינכרוני, כאשר חלקם תומכים בארכיטקטורה של \"הליך משנה לליבה\".",
      "המאמר מתעמק במושגי ארכיטקטורה של \"גניבת עבודה\" ו\"לא לשתף דבר\", ובוחן את השלכותיהם על ביצועי המערכת. הוא מזכיר את מאמרו של פקה נברג שממחיש את יתרונותיה של אדריכלות שאינה ניתנת לשיתוף.",
      "המחבר מעלה ספקות לגבי ההיתכנות והפשטות של יישום הארכיטקטורה של נברג לעומת שיטות מסורתיות, ומגיע למסקנה שגניבת עבודה עשויה להועיל למערכות בעלות מצב משותף."
    ],
    "commentSummary": [
      "הטקסטים כוללים דיונים סביב שפות תכנות, מודלים מקביליים, תכנות אסינכרוני, לצד הקשיים של ניפוי באגים ופתרון בעיות.",
      "נושאים ספציפיים המודגשים כוללים ארכיטקטורת חוט לכל ליבה, מבצעי גניבת עבודה, שגרות ערימה, עיבוד נתונים, כרטיסי ממשק רשת במהירות גבוהה ושפת התכנות Rust.",
      "יש דגש על החשיבות של יעילות ניהול משאבים, שיקול פשרות ביצועים, כלי ניפוי באגים חזקים, וצורך בביקורת טכנית מחמירה יותר במגזר פיתוח התוכנה."
    ],
    "points": 257,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696600052
  },
  {
    "id": 37789371,
    "title": "שימוש בטאבלט ישן כצג נוסף",
    "originLink": "https://github.com/alex028502/extra-screen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789371",
    "commentBody": "",
    "originSummary": [
      "התכונה שהוזכרה זמינה באופן בלעדי עבור יישומי מסוף וקללות."
    ],
    "commentSummary": [
      "המאמר מתעמק בשימוש בטאבלטים וסמארטפונים כצגים משניים למחשבים, ובוחן פתרונות תוכנה שונים.",
      "הוא מפריך את הנושא של שימוש בצגים מרובים לפרודוקטיביות מוגברת, דן בהעדפות לגבי סידור מסכים והתקני קלט, ומדבר על מגבלות האפשרויות הנוכחיות.",
      "באופן מכריע, הדיון מדגיש את הצורך במגוון רחב יותר של אפשרויות קלט ומערכות ניהול משימות ומידע טובות יותר."
    ],
    "points": 240,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1696592201
  },
  {
    "id": 37788847,
    "title": "נרגס מוחמדי זוכה בפרס נובל לשלום לשנת 2023",
    "originLink": "https://www.cnn.com/world/live-news/nobel-peace-prize-2023-latest-news-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37788847",
    "commentBody": "",
    "originSummary": [
      "הפעילה האיראנית נרגס מוחמדי, הנמצאת בכלא למעלה מ-30 שנה בשל פעילותה למען זכויות נשים, זכתה בפרס נובל לשלום לשנת 2023, המייצג מאבק משמעותי נגד הדיכוי באיראן.",
      "ממשלת איראן מטילה עונשים מחמירים יותר על נשים המפרות את קוד הלבוש, תוך שימוש בבינה מלאכותית לזיהוי.",
      "פעילת זכויות האדם האוקראינית אולכסנדרה מטבייצ'וק הראתה את תמיכתה במוחמדי, ובכך אותתה על תפקידה המכריע של הסולידריות במאבק לחופש, בעוד שההכרה הבינלאומית של הדוגמנית שולחת מסר חזק למנהיגים האיראנים המדגישים את זכויות הנשים."
    ],
    "commentSummary": [
      "טקסט זה מתעמק במחלוקות סביב פרס נובל לשלום, כולל אמינותו והחששות מפני פוליטיזציה.",
      "התוכן בוחן את הביקורת על תהליך בחירת הפרס וקושר אותה לאירועים בעולם האמיתי כגון הפלת הממשלה האיראנית.",
      "הדיונים מדגישים מגוון השקפות על משטרים פוליטיים, פרס נובל לשלום עצמו והחתירה העולמית לשלום."
    ],
    "points": 226,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1696586601
  },
  {
    "id": 37792444,
    "title": "Shortbread – יצירת קומיקס AI תוך דקות",
    "originLink": "https://shortbread.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792444",
    "commentBody": "",
    "originSummary": [
      "Shortbread היא פלטפורמה ידידותית למשתמש המאפשרת למשתמשים ליצור סדרות קומיקס ומנגה ללא צורך בכניסה, עם תהליך קליטה קל ועורך הניתן להתאמה אישית מלאה.",
      "המבנה הטכני של הפלטפורמה מסתמך על GPT 3.5 Turbo ליצירת סקריפטים ו-SD 1.5 לחיתוך תמונות, עם frontend ו-backend שפותחו באמצעות Next.js 13 ב-Vercel וב-Firebase בהתאמה.",
      "Shortbread מתכננת להרחיב את התכונות שלה כדי להציע בקרות פאנל מפורטות יותר וסגנונות מגוונים, ומזמינה ביקורת בונה והצעות לשיפור השירות."
    ],
    "commentSummary": [
      "Shortbread.ai שחררה פלטפורמה חדשה המאפשרת למשתמשים ליצור סדרות קומיקס ומנגה מבוססות בינה מלאכותית על ידי מתן הנחיות לבינה המלאכותית ליצור פאנלים של קומיקס.",
      "עם זאת, הגרסה הנוכחית של הפלטפורמה סובלת מבעיות עקביות ובקרת אופי, שהחברה מטפלת בהן באופן פעיל, יחד עם הגדלת קיבולת השרת כדי להתמודד עם תעבורת משתמשים מוגברת.",
      "למרות שהשירות מוצע כעת בחינם בשלב הבטא הראשוני שלו, מודל מנוי עשוי להיות מיושם בעתיד. הפלטפורמה עוררה עניין רב בקרב המשתמשים למרות שדווח על בעיות התחברות טכניות."
    ],
    "points": 201,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696607782
  },
  {
    "id": 37792507,
    "title": "גשש אחר בקשות עבודה עם ביקורות חברה, מגייס autoresponder",
    "originLink": "https://rolepad.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792507",
    "commentBody": "",
    "originSummary": [
      "רול פד הוא שירות חינמי שנועד לשפר את חיפוש העבודה על ידי הצעת מערכת לשמירת רשומות, המאפשרת מעקב וניהול של מועמדויות, שמירת התכתבויות בין מגייסים, יצירת תרשימי התקדמות וסקירות אנונימיות של תהליכי הגשת מועמדות של חברות.",
      "ערימת הטכנולוגיה של רולפד כוללת את React עם Tailwind בחזית, C# עבור הקצה האחורי, ומתארחת ב-AWS עבור פתרונות ענן חזקים ומדרגיים. היישום מעובד בצד השרת (SSR) לקבלת ביצועים מהירים יותר וללא התחלה קרה.",
      "היוצר של רולפיד יוזם דיונים עם מעסיקים כדי לגלות אסטרטגיות להפחתת תסכול הן עבור מועמדים לעבודה והן עבור מעסיקים, תוך הפגנת מחויבות לשיפור תהליך הגיוס הכולל."
    ],
    "commentSummary": [
      "Rolepad הוא מעקב אחר בקשות עבודה שנועד לשפר את השקיפות והיעילות בתהליך הגיוס, ומאפשר למשתמשים לעקוב אחר בקשות עבודה, לצבור מידע על החברה ולהציג באופן חזותי את ההתקדמות באמצעות תרשימים.",
      "משתמשים יכולים גם לספק משוב על החוויה שלהם עם נהלי היישום, הראיון והצעת העבודה. רולפד מעסיקה את React, C#, ומתארחת ב-AWS, תוך שימוש ב-Google Firebase לצורך אימות.",
      "המייסד שוקל פיתוח פלטפורמה מאוחדת עבור מחפשי עבודה ומעסיקים, עם דיונים המתמקדים בחששות לפרטיות, אותנטיות סקירה, תכונות עתידיות, אמצעי אבטחה יעילים, שיטות מונטיזציה אפשריות ומחסנית הטכנולוגיה. ההרשמה ל-YC חורף 2024 פתוחה כעת."
    ],
    "points": 193,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696608072
  },
  {
    "id": 37792294,
    "title": "Java 21 VirtualThreads נגד Clojure Lazy Seqs",
    "originLink": "https://clojure.org/news/2023/10/06/deref",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792294",
    "commentBody": "",
    "originSummary": [
      "המהדורה החדשה ביותר של Clojure Deref מכריזה על שחרורו של Java 21, תוך הדגשת השפעותיו על חוטים וירטואליים ובעיות הנוגעות לצגי אובייקטים במהלך חסימת קלט/פלט.",
      "הבעיה בוחנת פתרונות שונים כמו השימוש ב- ReentrantLocks כדי לפתור התנגשויות בין צגי אובייקטים לבין הליכי משנה וירטואליים.",
      "הגיליון מפרט עבודה שוטפת על מתאמי ממשק פונקציונליים, חבטות מתודות, חידודים בכפייה והמרה מרומזות והכנסת תחביר חדש של מחלקת מערך."
    ],
    "commentSummary": [
      "המאמר מתמקד בהבדלים בין Java 21 VirtualThreads לבין Clojure Lazy Seqs, נוגע בנושא של הצמדת סנכרון זמני ב- Clojure והתיקון הפוטנציאלי באמצעות תמונות מקוריות של GraalVM.",
      "הוא מציע את השימוש בחוטים וירטואליים ב- Java כפתרון נישה אך יעיל פוטנציאלית עבור יישומים בעלי תעבורה גבוהה, וסוקר את היתרונות והחסרונות של שימוש ב- Clojure, ClojureScript, Kotlin ו- Java בפיתוח תוכנה.",
      "הוא כולל השוואה של תאימות Kotlin ותמיכה בסביבות פיתוח משולבות שונות (IDEs) כמו Eclipse, IntelliJ ו- VS Code, ומעורר דיון על הרלוונטיות של IDE עבור שפות כגון Java."
    ],
    "points": 191,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1696607053
  },
  {
    "id": 37790174,
    "title": "לפני שלושים שנה: MS-DOS 6.00",
    "originLink": "https://www.pcjs.org/blog/2023/10/04/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790174",
    "commentBody": "",
    "originSummary": [
      "הסיכום מציג את התכונה MultiConfig ב- MS-DOS 6.00, מערכת המאפשרת התאמה אישית קלה של תצורות הפעלה.",
      "זה מדגיש את קיומם של באגים בתוך התכונה DoubleSpace של MS-DOS.",
      "יש דיון על תצורות ואפשרויות שונות המקושרות למתורגמן פקודות COMMAND.COM עבור DOS 7.00."
    ],
    "commentSummary": [
      "המאמר מעורר דיון נוסטלגי סביב גרסאות מוקדמות של MS-DOS 6.00 ו-Windows, כולל האתגרים שעמדו בפנינו, אופטימיזציה של זיכרון ומשחקים באותה תקופה.",
      "המגיבים חולקים חוויות מגוונות של שימוש ב- MS-DOS, Windows ותוכנות דחיסת דיסק, יחד עם שימוש במערכות הפעלה חלופיות.",
      "התייחסויות נעשות להתקדמות המהירה בטכנולוגיית המידע (IT) במהלך שנות התשעים בדיונים."
    ],
    "points": 175,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1696597047
  },
  {
    "id": 37797606,
    "title": "DotBigBang – מנוע משחק מרובה משתתפים עם 120fps וזמן טעינה של 2 שניות",
    "originLink": "https://dotbigbang.com/game/1af877e9bfdb47088611f55982b7570f/prestons-diamond-wars?mp=playdw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37797606",
    "commentBody": "",
    "originSummary": [
      "הפוסט דן בהתקדמות ב-dotbigbang.com, פלטפורמה מקיפה שבה משחקים מרובי משתתפים, כמו גם עורכי משחקים, פועלים ברשת.",
      "הוא מספק תכונה ייחודית המאפשרת למשתמשים ליצור ולשתף משחקים מרובי משתתפים רק על ידי מתן קישור, ומבטל את הצורך בכל התקנה.",
      "משתמשים יכולים לגשת לפרטים, מסמכים ועדכונים נוספים באתר, בבלוג ובשרת הדיסקורד של הפלטפורמה."
    ],
    "commentSummary": [
      "DotBigBang הוא מנוע משחק מרובה משתתפים מבוסס אינטרנט, המאפשר יצירה ושיתוף קלים של משחקים בין מכשירים מרובים. הפלטפורמה מתגאה בקצב פריימים גבוה וזמני טעינה מהירים.",
      "פותח על ידי צוות קטן באמצעות Python, Go ו- TypeScript, הוא מאפשר דיון סביב התכונות שלו, אתגרי יישום וחוויות משותפות עם בעיות טכניות.",
      "משוב המשתמשים מצביע על הצורך באמצעים יעילים נגד רמאות כדי לשפר את חוויית המשחק."
    ],
    "points": 163,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1696634767
  },
  {
    "id": 37792030,
    "title": "Unreal Engine כבר לא יהיה חינמי לכולם",
    "originLink": "https://www.creativebloq.com/news/epic-games-unreal-engine-charge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792030",
    "commentBody": "",
    "originSummary": [
      "Epic Games הודיעה על מעבר למודל תמחור מבוסס מנויים עבור Unreal Engine, המנוע הגרפי שלה, המיועד לתעשיות מעבר לגיימינג, ומשפיע על השימוש ב-VFX או אנימציה.",
      "בניגוד למודל התמלוגים הקודם, שחל רק על פרויקטים שהרוויחו מעל מיליון דולר, המודל החדש עלול להשפיע על יוצרי סרטים עצמאיים ומשתמשים לא מקצועיים.",
      "בעוד שפרטי התמחור טרם פורסמו, מנכ\"ל Epic Games טים סוויני הבטיח כי התעריפים החדשים לא יהיו מופקעים או זולים במיוחד; גישת התלמידים והמחנכים ל-Unreal Engine תמשיך להיות חינמית."
    ],
    "commentSummary": [
      "Unreal Engine שינתה את מודל הרישוי שלה ולא תהיה עוד חינמית לכל המשתמשים. כעת היא משלבת סף הכנסות לשימוש מסחרי גדול מחוץ לפיתוח משחקים.",
      "המאמר טוען כי שינויים, למרות שנויים במחלוקת רחבה לגבי הוגנות והשפעה על תעשיות, אינם דרמטיים כפי שהם נראים וניתן היה לצפות אותם קודם לכן.",
      "המחבר דן ביתרונות ובחסרונות של מודל מבוסס מנויים ובצורך במודל עסקי בר קיימא בהקשר של המצב הפיננסי של Epic Games."
    ],
    "points": 157,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1696605859
  },
  {
    "id": 37795652,
    "title": "תקרית הגירוד של 23andMe הדליפה נתונים על 1.3 מיליון משתמשים",
    "originLink": "https://therecord.media/scraping-incident-genetic-testing-site",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37795652",
    "commentBody": "",
    "originSummary": [
      "חברת הבדיקות הגנטיות 23andMe הכירה בתקרית גירוד נתונים שבה האקרים ניגשו ומכרו נתוני משתמשים רגישים ברשת האפלה.",
      "הנתונים שדלפו כוללים הערכת מקור, מידע הקשור לבריאות ותמונות של כמעט 7 מיליון משתמשים, מה שמבטא פרצת אבטחה ב-23andMe.",
      "למרות ההכחשה הראשונית, החברה אישרה את ההפרה ושיערה כי הפריצה התרחשה בשל אישורי כניסה שדלפו מפלטפורמות אחרות, מה שעורר חששות פרטיות ואבטחה בחברות בדיקות גנטיות."
    ],
    "commentSummary": [
      "חברת הבדיקות הגנטיות 23andMe הייתה עדה לדליפת מידע, שהובילה לדליפה של מידע אישי של כ-1.3 מיליון משתמשים.",
      "דליפת הנתונים נבעה ממתקפת דחיסת אישורים, סוג של מתקפת סייבר שבה פרטי חשבון גנובים משמשים להשגת גישה לא מורשית לחשבונות משתמשים.",
      "פרטים נוספים ודיונים על האירוע זמינים בפלטפורמת Hacker News."
    ],
    "points": 154,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1696622932
  }
]
