[
  {
    "id": 37791002,
    "title": "어려운 일을 쉽게 만들기",
    "originLink": "https://jvns.ca/blog/2023/10/06/new-talk--making-hard-things-easy/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37791002",
    "commentBody": "",
    "originSummary": [
      "Strange Loop 컨퍼런스의 연사는 DNS, SQL과 같은 복잡한 개념과 bash와 같은 프로그래밍 언어를 이해하는 것이 얼마나 어려운지 잘 알고 있습니다.",
      "이 강연은 지식과 경험을 공유하고, 도구와 예제를 사용하여 컴퓨터 프로세스의 잘 알려지지 않은 측면을 드러내는 데 중점을 둡니다.",
      "발표자는 컨퍼런스 주최자에게 감사를 표하며 Git과 같은 UI 디자인 요소 개선에 초점을 맞춘 탐색에 관심을 표합니다."
    ],
    "commentSummary": [
      "이 글에서는 숨겨진 정보를 제공하는 도구의 중요성과 명령줄 도구 구문을 기억하기 어려운 점 등 bash 및 SQL로 프로그래밍할 때 직면하는 어려움에 대해 설명합니다.",
      "인터랙티브 셸과 그 이점, 더 나은 도구에 대한 요구, 대체 프로그래밍 언어에 대한 논의가 이루어지고 있습니다.",
      "핵심 개념 이해의 필요성, 지식 공유, 포럼 활용, 인지 부하 감소 도구, 스크립팅의 GPT-4와 같은 AI, 학습 방법의 다양한 선호도 등도 제기되었습니다."
    ],
    "points": 870,
    "commentCount": 175,
    "retryCount": 0,
    "time": 1696601381
  },
  {
    "id": 37793635,
    "title": "AMD가 CUDA 해자를 통과할 수 있습니다.",
    "originLink": "https://www.hpcwire.com/2023/10/05/how-amd-may-get-across-the-cuda-moat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37793635",
    "commentBody": "",
    "originSummary": [
      "이 기사에서는 GenAI 시장에서 엔비디아의 지배력과 다른 하드웨어를 사용하려는 사람들이 직면한 문제를 다룹니다.",
      "이는 파이토치(PyTorch)를 지원하고 인스팅트 MI300A 프로세서를 출시하는 등 엔비디아에 대항하기 위한 AMD의 경쟁 전략을 강조합니다.",
      "이 기사에서는 업계 동향에 대한 업데이트와 함께 GenAI 하드웨어 경쟁 속에서 성능, 휴대성, 가용성의 중요성을 강조합니다."
    ],
    "commentSummary": [
      "이 토론은 특히 AI, 머신 러닝, 고성능 컴퓨팅 및 Linux 기반 그래픽 카드 사용과 관련하여 GPU 시장에서 AMD와 NVIDIA 간의 경쟁을 중심으로 진행됩니다.",
      "참가자들은 AMD의 GPU 컴퓨팅 기술 및 ROCm 플랫폼의 성능, 호환성, 한계에 대해 집중적으로 논의합니다. 또한 이를 NVIDIA의 CUDA 프레임워크와 비교하고 하드웨어 지원, 패키징, 빌드 시스템 및 소프트웨어 에코시스템과 관련된 과제를 강조합니다.",
      "AMD의 더 나은 지원, 강화된 리소스, 향상된 성능에 대한 요구가 확인되었습니다. 또한 참가자들은 경쟁이 가격에 미칠 수 있는 잠재적 영향과 GPU 시장에서 인텔과 같은 신규 진입자의 잠재력에 대해서도 논의합니다."
    ],
    "points": 431,
    "commentCount": 235,
    "retryCount": 0,
    "time": 1696613736
  },
  {
    "id": 37789107,
    "title": "Gov.uk 양식에 대한 액세스를 개방합니다.",
    "originLink": "https://gds.blog.gov.uk/2023/10/03/how-were-opening-up-access-to-gov-uk-forms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789107",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "이 기사는 GOV.UK의 사용자 친화적인 인터페이스와 디자인을 칭찬하는 동시에 잠재적인 개인정보 보호 문제와 외부 플랫폼에 대한 의존성에 대해서도 조명합니다.",
      "이 글은 또한 정부 기술 일자리의 매력과 정부 시스템의 효율성에 대한 다양한 견해를 반영합니다.",
      "영국 정부의 디지털 서명 시스템의 장점과 gov.uk 웹사이트의 기능을 강조하며 정부 양식에 대한 개선된 가이드라인의 필요성을 제안합니다."
    ],
    "points": 339,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1696589675
  },
  {
    "id": 37792690,
    "title": "계정 생성을 거부하면 우편배달부 업데이트에서 모든 자료가 삭제됩니다.",
    "originLink": "https://news.ycombinator.com/item?id=37792690",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792690",
    "commentBody": "",
    "originSummary": [
      "한 사용자가 계정 없이 오프라인에서 Postman을 사용할 때 계정 생성을 거부하면 모든 컬렉션과 설정이 삭제된다고 보고했습니다.",
      "이후 계정을 만들었음에도 불구하고 지워진 데이터는 복구되지 않았으며, 사용자는 특정 위치의 백업에서 수동으로 데이터를 복원할 수 있었습니다.",
      "이 사건으로 인해 사용자들은 Postman에 대한 신뢰를 잃었고, 현재 대체할 수 있는 도구를 찾고 있습니다."
    ],
    "commentSummary": [
      "최근 API 클라이언트 도구인 Postman이 업데이트되면서 계정 생성을 요구하고 데이터 손실에 대한 우려를 불러일으켜 사용자들의 불만을 불러일으켰습니다.",
      "사용자들은 Insomnia, VSCode 확장 프로그램, HTTPie, Bruno, Kreya, Paw/Rapid API, Hopscotch, IntelliJ HTTP 요청과 같은 도구를 포함하여 Postman을 대체할 수 있는 방법을 모색하고 있습니다.",
      "이러한 사용자들 사이에서는 컬이나 커맨드 라인 대안을 선호하는 사용자들이 있는가 하면, 가격 및 호환성에 대한 우려에도 불구하고 Postman과 같은 GUI 도구의 편리함을 주장하는 사용자들도 있습니다."
    ],
    "points": 314,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1696608894
  },
  {
    "id": 37794379,
    "title": "23andMe, 크리덴셜 스터핑 공격으로 사용자 데이터 도난 당함",
    "originLink": "https://www.bleepingcomputer.com/news/security/genetics-firm-23andme-says-user-data-stolen-in-credential-stuffing-attack/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37794379",
    "commentBody": "",
    "originSummary": [
      "유전학 회사인 23andMe에서 크리덴셜 스터핑 공격을 통해 사용자 데이터가 도난당하는 데이터 유출 사고가 발생했다고 보고했습니다.",
      "유출된 데이터에는 사용자의 전체 이름, 사용자 이름, 프로필 이미지, 유전적 혈통 결과 및 지리적 위치가 포함되어 있습니다.",
      "이러한 공격을 방지하려면 2단계 인증을 사용하고 온라인 계정에 강력하고 고유한 비밀번호를 설정할 것을 권장합니다."
    ],
    "commentSummary": [
      "토론의 중심 주제는 23andMe와 같은 유전자 검사 회사와 관련된 보안 및 개인정보 보호 문제와 데이터 유출, 비밀번호 보안, 데이터 보호 책임과 같은 주제에 관한 것입니다.",
      "일부 참가자는 더 엄격한 보안 조치와 기업의 책임 강화를 주장하는 반면, 다른 참가자는 데이터에 대한 사용자 소유권을 강조하고 특정 보안 전략의 효과에 의문을 제기하는 등 다양한 관점이 드러났습니다.",
      "이 대화는 개인 및 유전자 데이터를 다룰 때 발생할 수 있는 복잡한 문제와 그 파급 효과를 강조합니다."
    ],
    "points": 287,
    "commentCount": 256,
    "retryCount": 0,
    "time": 1696616947
  },
  {
    "id": 37790745,
    "title": "코어당 스레드 수",
    "originLink": "https://without.boats/blog/thread-per-core/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790745",
    "commentBody": "",
    "originSummary": [
      "Rust 커뮤니티에서는 비동기 프로그래밍에서 멀티 스레드 실행기의 기본 사용법에 대해 논의 중이며, 일부는 \"코어당 스레드\" 아키텍처를 옹호하고 있습니다.",
      "이 문서에서는 '작업 훔치기'와 '아무것도 공유하지 않음' 아키텍처 개념을 자세히 살펴보고 시스템 성능에 미치는 영향을 살펴봅니다. 이 글에서는 공유 아키텍처의 장점을 설명하는 Pekka Enberg의 논문을 참조합니다.",
      "저자는 엔버그의 아키텍처를 기존 방식과 비교하여 구현할 수 있는 가능성과 단순성에 의문을 제기하며, 작업 도용이 공유 상태를 가진 시스템에서 유용할 수 있다고 결론지었습니다."
    ],
    "commentSummary": [
      "이 텍스트는 프로그래밍 언어, 동시성 모델, 비동기 프로그래밍에 대한 논의와 디버깅 및 문제 해결의 어려움을 포괄합니다.",
      "코어당 스레드 아키텍처, 작업 훔치기 실행기, 스택형 코루틴, 데이터 처리, 고속 네트워크 인터페이스 카드, Rust 프로그래밍 언어 등 구체적인 주제를 중점적으로 다룹니다.",
      "리소스 관리 효율성, 성능 트레이드 오프 고려, 강력한 디버깅 도구, 소프트웨어 개발 부문에서 더욱 엄격한 기술적 비판의 필요성 등이 강조되고 있습니다."
    ],
    "points": 257,
    "commentCount": 170,
    "retryCount": 0,
    "time": 1696600052
  },
  {
    "id": 37789371,
    "title": "오래된 태블릿을 추가 모니터로 사용",
    "originLink": "https://github.com/alex028502/extra-screen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37789371",
    "commentBody": "",
    "originSummary": [
      "언급된 기능은 터미널 및 커스 애플리케이션에서만 사용할 수 있습니다."
    ],
    "commentSummary": [
      "이 기사에서는 태블릿과 스마트폰을 컴퓨터의 보조 디스플레이로 사용하는 방법을 살펴보고 다양한 소프트웨어 솔루션을 살펴봅니다.",
      "생산성 향상을 위해 여러 대의 모니터를 사용하는 방법에 대해 알아보고, 화면 배열 및 입력 장치에 대한 선호도를 논의하며, 현재 옵션의 한계에 대해 이야기합니다.",
      "결정적으로, 이 논의는 더 광범위한 입력 옵션과 더 나은 업무 및 정보 관리 시스템의 필요성을 강조합니다."
    ],
    "points": 240,
    "commentCount": 125,
    "retryCount": 0,
    "time": 1696592201
  },
  {
    "id": 37788847,
    "title": "나르게스 모하마디, 2023년 노벨 평화상 수상",
    "originLink": "https://www.cnn.com/world/live-news/nobel-peace-prize-2023-latest-news-intl/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37788847",
    "commentBody": "",
    "originSummary": [
      "여성 인권 옹호 활동으로 30년 넘게 감옥에 갇혀 있는 이란의 활동가 나르게스 모하마디가 2023년 노벨 평화상 수상자로 선정되어 이란의 억압에 대한 반발을 상징적으로 보여줬습니다.",
      "이란 정부는 신원 확인에 인공지능을 활용하여 복장 규정을 위반한 여성에게 더 엄격한 처벌을 부과하고 있습니다.",
      "우크라이나 인권 옹호자인 올렉산드라 마트비추크는 모하마디에 대한 지지를 표명하며 자유를 위한 투쟁에서 연대의 중요한 역할을 강조했고, 이 모델의 국제적 인지도는 여성의 권리를 강조하는 이란 지도자들에게 강력한 메시지를 보냈습니다."
    ],
    "commentSummary": [
      "이 글에서는 노벨 평화상의 신뢰성과 정치화에 대한 우려 등 노벨 평화상을 둘러싼 논란에 대해 자세히 살펴봅니다.",
      "이 콘텐츠는 수상자 선정 과정에 대한 비판을 살펴보고 이란 정부 전복과 같은 실제 사건과 연결합니다.",
      "이 토론은 정치 체제, 노벨 평화상 자체, 평화를 위한 전 세계적 노력에 대한 다양한 견해를 강조합니다."
    ],
    "points": 226,
    "commentCount": 240,
    "retryCount": 0,
    "time": 1696586601
  },
  {
    "id": 37792444,
    "title": "Shortbread - 몇 분 만에 AI 만화 만들기",
    "originLink": "https://shortbread.ai/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792444",
    "commentBody": "",
    "originSummary": [
      "쇼트브레드는 사용자 친화적인 플랫폼으로, 간편한 온보딩 프로세스와 완전히 사용자 정의 가능한 편집기를 통해 로그인할 필요 없이 만화와 만화 시리즈를 생성할 수 있습니다.",
      "플랫폼의 기술 구조는 스크립트 생성에는 GPT 3.5 Turbo를, 이미지 자르기에는 SD 1.5를 사용하며, 프론트엔드 및 백엔드는 각각 Vercel 및 Firebase에서 Next.js 13을 사용하여 개발되었습니다.",
      "쇼트브레드는 더 자세한 패널 컨트롤과 다양한 스타일을 제공하기 위해 기능을 확장할 계획이며, 서비스 개선을 위한 건설적인 비판과 제안을 기다리고 있습니다."
    ],
    "commentSummary": [
      "Shortbread.ai는 AI가 만화 패널을 만들 수 있는 프롬프트를 제공하여 사용자가 AI 기반 만화 및 만화 시리즈를 생성할 수 있는 새로운 플랫폼을 출시했습니다.",
      "그럼에도 불구하고 현재 버전의 플랫폼은 일관성 및 캐릭터 제어와 관련된 문제를 겪고 있으며, 트위터는 사용자 트래픽 증가를 처리하기 위해 서버 용량을 확장하는 등 적극적으로 문제를 해결하고 있습니다.",
      "이 서비스는 현재 초기 베타 단계에서는 무료로 제공되지만, 향후 구독 모델이 도입될 수 있습니다. 이 플랫폼은 일부 사용자들이 기술적 로그인 문제를 보고했음에도 불구하고 상당한 사용자 관심을 불러일으키고 있습니다."
    ],
    "points": 201,
    "commentCount": 53,
    "retryCount": 0,
    "time": 1696607782
  },
  {
    "id": 37792507,
    "title": "회사 리뷰, 채용 담당자 자동 응답 기능이 있는 입사 지원 추적기",
    "originLink": "https://rolepad.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792507",
    "commentBody": "",
    "originSummary": [
      "Rolepad는 지원서 추적 및 관리, 채용 담당자 서신 저장, 진행 상황 차트 작성, 회사 지원 절차에 대한 익명 리뷰 등 구직 활동을 개선하기 위해 고안된 무료 서비스입니다.",
      "Rolepad의 기술 스택은 프론트엔드에 Tailwind가 포함된 React, 백엔드에 C#으로 구성되며, 강력하고 확장 가능한 클라우드 솔루션을 위해 AWS에서 호스팅됩니다. 애플리케이션은 서버 측 렌더링(SSR)을 통해 더 빠른 성능과 콜드 스타트가 필요하지 않습니다.",
      "Rolepad의 개발자는 구직자와 고용주 모두의 불만을 완화할 수 있는 전략을 모색하기 위해 고용주들과 논의를 시작하며 전반적인 채용 프로세스를 개선하겠다는 의지를 보이고 있습니다."
    ],
    "commentSummary": [
      "Rolepad는 채용 프로세스의 투명성과 효율성을 높이기 위해 설계된 입사 지원 추적기로, 사용자가 입사 지원서를 추적하고, 회사 정보를 축적하고, 차트를 통해 진행 상황을 시각화할 수 있도록 지원합니다.",
      "또한 사용자는 지원, 면접, 채용 절차에 대한 경험에 대한 피드백을 제공할 수 있습니다. Rolepad는 React, C#을 사용하며, 인증을 위해 Google Firebase를 사용하는 AWS에서 호스팅됩니다.",
      "창립자는 구직자와 고용주를 위한 통합 플랫폼 개발을 고민하고 있으며, 개인 정보 보호 문제, 검토 신뢰성, 향후 기능, 효과적인 보안 조치, 가능한 수익화 방법, 기술 스택에 중점을 두고 논의하고 있습니다. YC 윈터 2024 참가 신청은 현재 진행 중입니다."
    ],
    "points": 193,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1696608072
  },
  {
    "id": 37792294,
    "title": "Java 21 가상 스레드와 클로저 지연 시퀀스 비교",
    "originLink": "https://clojure.org/news/2023/10/06/deref",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792294",
    "commentBody": "",
    "originSummary": [
      "Clojure Deref의 최신 버전에서는 Java 21의 출시를 발표하며 가상 스레드에 미치는 영향과 I/O 차단 중 객체 모니터와 관련된 문제를 강조합니다.",
      "이 이슈에서는 객체 모니터와 가상 스레드 간의 충돌을 해결하기 위한 재진입 잠금 사용과 같은 다양한 해결 방법을 살펴봅니다.",
      "이 이슈에서는 함수형 인터페이스 어댑터, 메서드 씽크, 암시적 강제 및 변환 개선, 새로운 배열 클래스 구문 도입에 대한 진행 중인 작업에 대해 자세히 설명합니다."
    ],
    "commentSummary": [
      "이 글에서는 Java 21 VirtualThreads와 Clojure 지연 시퀀스의 차이점에 초점을 맞추고, Clojure의 임시 동기화 고정 문제와 GraalVM 네이티브 이미지를 사용한 잠재적 해결 방법에 대해 다룹니다.",
      "트래픽이 많은 애플리케이션을 위한 틈새 시장이지만 잠재적으로 효율적인 솔루션으로 Java의 가상 스레드 사용을 제안하고 소프트웨어 개발에서 Clojure, ClojureScript, Kotlin 및 Java를 활용하는 것의 장단점을 검토합니다.",
      "여기에는 Eclipse, IntelliJ, VS Code와 같은 다양한 IDE(통합 개발 환경)에서의 Kotlin 호환성 및 지원 비교가 포함되어 있으며, Java와 같은 언어에 대한 IDE의 관련성에 대한 토론을 유도합니다."
    ],
    "points": 191,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1696607053
  },
  {
    "id": 37790174,
    "title": "30년 전: MS-DOS 6.00",
    "originLink": "https://www.pcjs.org/blog/2023/10/04/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37790174",
    "commentBody": "",
    "originSummary": [
      "이 요약에서는 시작 구성을 쉽게 사용자 지정할 수 있는 시스템인 MS-DOS 6.00의 멀티컨피그 기능을 소개합니다.",
      "MS-DOS의 더블 스페이스 기능에 버그가 있음을 강조합니다.",
      "DOS 7.00용 COMMAND.COM 명령 인터프리터에 연결된 다양한 구성 및 옵션에 대한 설명이 있습니다."
    ],
    "commentSummary": [
      "이 기사는 초기 버전의 MS-DOS 6.00과 Windows를 둘러싼 향수를 불러일으키며, 당시 직면했던 과제, 메모리 최적화, 게임 등 그 시절의 향수를 불러일으키는 이야기를 다룹니다.",
      "댓글 작성자는 대체 운영 체제의 사용법과 함께 MS-DOS, Windows 및 디스크 압축 소프트웨어에 대한 다양한 사용 경험을 공유합니다.",
      "1990년대 정보 기술(IT)의 급속한 발전이 논의에서 언급되었습니다."
    ],
    "points": 175,
    "commentCount": 97,
    "retryCount": 0,
    "time": 1696597047
  },
  {
    "id": 37797606,
    "title": "도트빅뱅 - 120fps, 2초의 로딩 시간을 제공하는 멀티플레이어 게임 엔진",
    "originLink": "https://dotbigbang.com/game/1af877e9bfdb47088611f55982b7570f/prestons-diamond-wars?mp=playdw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37797606",
    "commentBody": "",
    "originSummary": [
      "이 게시물에서는 멀티플레이어 게임과 게임 에디터를 웹에서 운영할 수 있는 포괄적인 플랫폼인 닷빅뱅닷컴의 발전된 기능에 대해 설명합니다.",
      "링크를 제공하는 것만으로 멀티플레이어 게임을 만들고 공유할 수 있는 고유한 기능을 제공하여 별도의 설정이 필요하지 않습니다.",
      "사용자는 플랫폼의 자체 웹사이트, 블로그, Discord 서버에서 자세한 내용, 문서, 업데이트에 액세스할 수 있습니다."
    ],
    "commentSummary": [
      "닷빅뱅은 웹 기반 멀티플레이어 게임 엔진으로, 여러 디바이스에서 게임을 쉽게 제작하고 공유할 수 있습니다. 이 플랫폼은 높은 프레임 속도와 빠른 로딩 시간을 자랑합니다.",
      "파이썬, Go, 타입스크립트를 사용하는 소규모 팀에 의해 개발되었으며, 기능, 구현 과제, 기술 문제에 대한 공유 경험에 대한 토론을 촉진합니다.",
      "사용자 피드백에 따르면 게임 경험을 개선하기 위해 효과적인 부정 행위 방지 조치가 필요하다는 의견이 있었습니다."
    ],
    "points": 163,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1696634767
  },
  {
    "id": 37792030,
    "title": "언리얼 엔진은 더 이상 모든 사람에게 무료가 아닙니다.",
    "originLink": "https://www.creativebloq.com/news/epic-games-unreal-engine-charge",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37792030",
    "commentBody": "",
    "originSummary": [
      "에픽게임즈가 그래픽 엔진인 언리얼 엔진의 구독 기반 가격 모델을 게임 이외의 산업을 대상으로 하는 VFX 또는 애니메이션 분야에도 적용하는 것으로 전환한다고 발표했습니다.",
      "수익이 100만 달러 이상인 프로젝트에만 적용되던 이전 로열티 모델과 달리, 이 새로운 모델은 독립 영화 제작자와 비전문 사용자에게도 영향을 미칠 수 있습니다.",
      "아직 자세한 가격은 공개되지 않았지만, 에픽게임즈의 CEO 팀 스위니는 새로운 요금이 터무니없이 비싸거나 비정상적으로 저렴하지는 않을 것이며, 학생과 교육자의 언리얼 엔진 액세스는 계속 무료로 제공될 것이라고 밝혔습니다."
    ],
    "commentSummary": [
      "언리얼 엔진은 라이선스 모델을 변경하여 더 이상 모든 사용자에게 무료로 제공되지 않습니다. 이제 게임 개발 외의 대규모 상업적 사용에 대한 수익 기준이 적용됩니다.",
      "이 기사는 공정성과 산업에 미치는 영향에 대해 널리 논의되고 있지만, 변화가 생각만큼 극적이지는 않으며 더 일찍 예상할 수 있었다고 주장합니다.",
      "저자는 구독 기반 모델의 장단점과 지속 가능한 비즈니스 모델의 필요성에 대해 에픽게임즈의 재무 상황과 관련하여 설명합니다."
    ],
    "points": 157,
    "commentCount": 114,
    "retryCount": 0,
    "time": 1696605859
  },
  {
    "id": 37795652,
    "title": "23andMe 스크래핑 사고로 인한 1.3백만 사용자 데이터 유출 사고",
    "originLink": "https://therecord.media/scraping-incident-genetic-testing-site",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37795652",
    "commentBody": "",
    "originSummary": [
      "유전자 검사 회사인 23andMe는 해커가 다크웹에서 민감한 사용자 데이터에 액세스하여 판매한 데이터 스크래핑 사고를 인정했습니다.",
      "유출된 데이터에는 출처 추정, 건강 관련 정보, 약 700만 명의 사용자 사진이 포함되어 있어 23andMe의 보안 허점이 드러났습니다.",
      "초기 부인에도 불구하고 회사는 위반 사실을 확인했으며, 다른 플랫폼에서 유출된 로그인 자격 증명으로 인해 유출된 것으로 추정하고 있어 유전자 검사 회사의 개인정보 보호 및 보안에 대한 우려가 커지고 있습니다."
    ],
    "commentSummary": [
      "유전자 검사 회사인 23andMe에서 데이터 유출 사고가 발생하여 약 130만 명의 사용자 개인정보가 유출되는 사고가 발생했습니다.",
      "데이터 유출은 크리덴셜 스터핑 공격으로 인해 발생했으며, 크리덴셜 스터핑 공격은 탈취한 계정 인증 정보를 사용하여 사용자 계정에 무단으로 액세스하는 사이버 공격의 일종입니다.",
      "이벤트에 대한 자세한 내용과 토론은 해커 뉴스 플랫폼에서 확인할 수 있습니다."
    ],
    "points": 154,
    "commentCount": 4,
    "retryCount": 0,
    "time": 1696622932
  }
]
