[
  {
    "id": 38992601,
    "title": "Vanna.ai: चैट इंटरफ़ेस के माध्यम से SQL क्वेरी जनरेट करना",
    "originLink": "https://github.com/vanna-ai/vanna",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38992601",
    "commentBody": "",
    "originSummary": [
      "वन्ना एक ओपन-सोर्स पायथन फ्रेमवर्क है जो प्रशिक्षित मॉडल के आधार पर एसक्यूएल क्वेरी उत्पन्न करता है, जिससे उपयोगकर्ता प्रश्न पूछ सकते हैं और परिणाम के रूप में एसक्यूएल प्रश्न प्राप्त कर सकते हैं।",
      "फ्रेमवर्क जुपिटर नोटबुक, स्ट्रीमलिट, फ्लास्क और स्लैक जैसे उपयोगकर्ता इंटरफेस प्रदान करता है।",
      "वन्ना को पिप का उपयोग करके स्थापित किया जा सकता है और डीडीएल स्टेटमेंट, प्रलेखन या एसक्यूएल प्रश्नों का उपयोग करके प्रशिक्षित किया जा सकता है। यह जटिल डेटासेट पर उच्च सटीकता प्रदान करता है, किसी भी एसक्यूएल डेटाबेस का समर्थन करता है, और आत्म-सीखने की अनुमति देता है। उपयोगकर्ता अपने स्वयं के एलएलएम या वेक्टर डेटाबेस का उपयोग करने के लिए वन्ना का विस्तार भी कर सकते हैं।"
    ],
    "commentSummary": [
      "चर्चा SQL डेटाबेस के साथ बातचीत करने के लिए विभिन्न AI-संचालित उपकरणों और प्रौद्योगिकियों की पड़ताल करती है, जैसे कि Vanna.ai, Louie.ai, और क्षेत्र में Microsoft की भागीदारी।",
      "यह एसक्यूएल इंटरैक्शन में भाषा मॉडल और प्राकृतिक भाषा प्रश्नों के उपयोग में शामिल है, एआई-सहायता प्राप्त एसक्यूएल की चुनौतियों और लाभों पर चर्चा करता है।",
      "बातचीत स्कीमा डिजाइन, वर्तमान मॉडल की सीमाओं और एसक्यूएल प्रश्नों को लिखने के लिए एआई सह-पायलटों की भविष्य की क्षमता को भी छूती है, जो डेटाबेस प्रबंधन और विश्लेषण कार्यों को सरल बनाने के लिए एआई का उपयोग करने में बढ़ती रुचि को उजागर करती है।"
    ],
    "points": 448,
    "commentCount": 192,
    "retryCount": 0,
    "time": 1705255086
  },
  {
    "id": 38994817,
    "title": "Warcraft के RNG की दुनिया को उजागर करना: कैसे एक किशोर ने खेल को हराने का एक तरीका पाया",
    "originLink": "https://orlp.net/blog/when-random-isnt/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38994817",
    "commentBody": "",
    "originSummary": [
      "लेखक ने अपने किशोर अनुभव को वर्ल्ड ऑफ वॉरक्राफ्ट खेलने और लुआ प्रोग्रामिंग का उपयोग करके ऐड-ऑन बनाने के बारे में साझा किया है।",
      "वे खेल में स्वचालन को रोकने के लिए ब्लिज़ार्ड गेम्स द्वारा लागू सुरक्षा उपायों पर चर्चा करते हैं।",
      "लेखक ने गेम के यादृच्छिक संख्या जनरेटर में हेरफेर करके एक खामी की खोज की, जिससे स्वचालित निर्णय लेने की अनुमति मिली। हालांकि, यह स्पष्ट नहीं है कि यह शोषण अभी भी ब्लिज़ार्ड गेम्स द्वारा संभावित सुधार या एल्गोरिदम परिवर्तनों के कारण काम करता है या नहीं।"
    ],
    "commentSummary": [
      "ऑनलाइन फोरम चर्चा में विषयों की एक विस्तृत श्रृंखला शामिल है, जिसमें जावा और एमएसवीसी में यादृच्छिक संख्या जनरेटर के बीच तुलना और वेनिला डब्ल्यूओडब्ल्यू में मेरसेन ट्विस्टर आरएनजी का उपयोग शामिल है।",
      "बातचीत पुराने इंटरनेट मंचों के लिए पुरानी यादों और ऑनलाइन मंचों की संरचना को भी छूती है।",
      "चर्चा किए गए अन्य विषयों में वीडियो गेम अर्थशास्त्र, उच्च आवृत्ति व्यापार, और WoW नीलामी घर में पैसा बनाने के लिए रणनीतियाँ शामिल हैं।"
    ],
    "points": 280,
    "commentCount": 86,
    "retryCount": 0,
    "time": 1705269389
  },
  {
    "id": 38990080,
    "title": "कारों के साथ निराशा: स्मार्ट टीवी की तुलना में अत्यधिक सुविधाएँ और खराब डिज़ाइन विकल्प",
    "originLink": "https://petargyurov.com/2024-01-14/cars-suck-man",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38990080",
    "commentBody": "",
    "originSummary": [
      "लेखक कारों की वर्तमान स्थिति के साथ असंतोष पर प्रकाश डालता है, स्मार्ट टीवी में देखे गए मुद्दों के साथ समानताएं खींचता है।",
      "अत्यधिक सुविधाओं, खराब डिजाइन विकल्पों, और टचस्क्रीन के पीछे छिपे हुए बटन और अत्यधिक उज्ज्वल एलईडी रोशनी जैसे उपयोगकर्ता-अमित्र तत्वों की आलोचना की जाती है।",
      "लेखक की पुरानी टोयोटा कोरोला जैसी सरल और अधिक उपयोगकर्ता के अनुकूल कारों के आह्वान के साथ बड़े वाहनों, सदस्यता-शैली योजनाओं और गोपनीयता उल्लंघनों की प्रवृत्ति का भी उल्लेख किया गया है।"
    ],
    "commentSummary": [
      "लेख और चर्चा आधुनिक कारों से संबंधित कई विषयों को छूती है, जिसमें अत्यधिक तकनीक और नियमों के साथ असंतोष, न्यूनतम और ओपन-सोर्स कार डिजाइनों के लाभ और एसयूवी और क्रॉसओवर की लोकप्रियता शामिल है।",
      "टिप्पणीकार कारों में सादगी, अनुकूलन और व्यावहारिकता के साथ-साथ लागत, सुरक्षा और पर्यावरणीय प्रभाव के बारे में चिंताओं के लिए अपनी प्राथमिकताओं को व्यक्त करते हैं।",
      "बातचीत उपभोक्ताओं की इच्छाओं को पूरा करने वाले सस्ती, उपयोगकर्ता के अनुकूल और विश्वसनीय वाहनों की आवश्यकता पर जोर देती है।"
    ],
    "points": 185,
    "commentCount": 289,
    "retryCount": 0,
    "time": 1705237723
  },
  {
    "id": 38990755,
    "title": "अपनी डिजिटल गोपनीयता को पुनः प्राप्त करना: डेटा ब्रोकरों से डेटा हटाना",
    "originLink": "https://www.cybercollective.org/blog/how-to-delete-your-data-from-data-brokers",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38990755",
    "commentBody": "",
    "originSummary": [
      "डेटा ब्रोकर हमारी जानकारी या सहमति के बिना व्यक्तिगत जानकारी एकत्र करते हैं और बेचते हैं, हमारी डिजिटल गोपनीयता से समझौता करते हैं।",
      "ब्लॉग इस बारे में कदम प्रदान करता है कि कैसे व्यक्ति डेटा दलालों से डेटा हटाने का अनुरोध करके और सीसीपीए और जीडीपीआर जैसे उपभोक्ता संरक्षण कानूनों का उपयोग करके अपने डेटा पर नियंत्रण प्राप्त कर सकते हैं।",
      "यह ऑनलाइन सहमति के बारे में जागरूक होने और डेटा दलालों द्वारा डेटा संग्रह का मुकाबला करने के लिए किसी के डिजिटल पदचिह्न को सक्रिय रूप से प्रबंधित करने के महत्व पर जोर देता है।"
    ],
    "commentSummary": [
      "चर्चा डेटा गोपनीयता और डेटा दलालों और ऐप्स द्वारा व्यक्तिगत जानकारी की संभावित बिक्री के बारे में चिंताओं पर केंद्रित है।",
      "ऑप्ट-आउट सेवाओं की विश्वसनीयता और डेटा हटाने वाली सेवाओं की प्रभावशीलता के आसपास बहस के साथ, उपयोगकर्ता डेटाबेस से व्यक्तिगत डेटा को हटाने के लिए विभिन्न उपकरणों और सेवाओं की सलाह देते हैं।",
      "डेटा रिसाव को कम करने के लिए अद्वितीय और डोमेन-विशिष्ट ईमेल पते का उपयोग करने के सुझाव दिए जाते हैं, जबकि कुछ व्यक्तिगत जानकारी सुरक्षा के लिए एलएलसी स्थापित करने के विकल्प पर चर्चा करते हैं। बातचीत ऑनलाइन व्यक्तिगत डेटा की सुरक्षा और इसमें शामिल बाधाओं के महत्व पर जोर देती है।"
    ],
    "points": 181,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1705242863
  },
  {
    "id": 38992292,
    "title": "ब्लूफिन प्रोजेक्ट डेवलपर-केंद्रित, क्लाउड-नेटिव लिनक्स के रूप में फिर से लॉन्च किया गया",
    "originLink": "https://www.ypsidanger.com/announcing-project-bluefin/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38992292",
    "commentBody": "",
    "originSummary": [
      "ब्लूफिन प्रोजेक्ट को projectbluefin.io के रूप में फिर से लॉन्च किया गया है, जो एक विश्वसनीय डेस्कटॉप अनुभव के साथ फेडोरा सिल्वरब्लू की कस्टम छवि प्रदान करता है।",
      "ब्लूफिन एक वितरण नहीं है, बल्कि डिफ़ॉल्ट छवि के शीर्ष पर एक परमाणु परत है, जो गिटहब के माध्यम से वितरण में स्वचालन प्रदान करता है और अविश्वसनीय लिनक्स डेस्कटॉप से असंतुष्ट उपयोगकर्ताओं के लिए एक विकल्प प्रदान करता है।",
      "परियोजना में ब्लूफिन-डीएक्स नामक एक डेवलपर छवि शामिल है, जो डेवलपर्स के लिए अतिरिक्त उपकरण और लचीलापन प्रदान करती है, जिसका उद्देश्य क्लाउड-नेटिव तकनीक को अपनाने में तेजी लाना और ओपन-सोर्स पारिस्थितिक तंत्र की स्थिरता को बढ़ाना है।"
    ],
    "commentSummary": [
      "ब्लूफिन फेडोरा सिल्वरब्लू पर आधारित एक क्लाउड-देशी लिनक्स वितरण है, जिसे डेवलपर्स के लिए डिज़ाइन किया गया है।",
      "इसमें एक अपरिवर्तनीय रूट फ़ाइल सिस्टम, अपडेट के लिए एक कंटेनर रजिस्ट्री और अतिरिक्त हार्डवेयर समर्थन है।",
      "यूनिवर्सल ब्लू एक क्लाउड-आधारित परिनियोजन प्लेटफ़ॉर्म है जो बेस लेयर घटकों का उपयोग करता है और आसान रोलबैक की अनुमति देता है।",
      "उपयोगकर्ताओं के पास ब्लूफिन के साथ सकारात्मक अनुभव हैं और वेबसाइट डिजाइन और प्रदर्शन के महत्व पर चर्चा करते हैं।",
      "ब्लूफिन की तुलना अन्य ऑपरेटिंग सिस्टम से की जाती है और मुख्य विकास मशीनों पर उपयोग के लिए अनुशंसित है।"
    ],
    "points": 178,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1705253010
  },
  {
    "id": 38996120,
    "title": "FedEx ने Amazon के साथ प्रतिस्पर्धा करने के लिए एक एंड-टू-एंड ई-कॉमर्स प्लेटफॉर्म FDX लॉन्च किया",
    "originLink": "https://www.theverge.com/2024/1/14/24038042/fedex-fdx-e-commerce-platform-amazon-rival-shoprunner",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38996120",
    "commentBody": "",
    "originSummary": [
      "फेडेक्स ऑनलाइन व्यापारियों को उनकी आपूर्ति श्रृंखलाओं के प्रबंधन, ग्राहकों को बेचने और डिलीवरी को संभालने में सहायता करने के लिए एफडीएक्स नामक एक नया ई-कॉमर्स प्लेटफॉर्म पेश कर रहा है।",
      "प्लेटफ़ॉर्म मौजूदा फेडएक्स टूल को नई सुविधाओं के साथ जोड़ देगा, जैसे कि \"कस्टम पोस्ट-खरीद अनुभव\", जो ब्रांडों को सटीक शिपमेंट विवरण प्रदान करने और ऑर्डर प्रबंधन के लिए फेडएक्स के शिपमेंट नेटवर्क डेटा को नियोजित करने में सक्षम बनाता है।",
      "यह विकास रसद क्षेत्र में अमेज़ॅन के साथ फेडएक्स की प्रतिस्पर्धा की प्रतिक्रिया है, जहां फेडएक्स चुनौतियों का सामना कर रहा है और इसका उद्देश्य नए मंच की क्षमताओं का लाभ उठाकर अपनी प्रतिस्पर्धात्मकता बनाए रखना है।"
    ],
    "commentSummary": [
      "फेडेक्स ने अमेजन की प्रमुख लॉजिस्टिक्स और ऑनलाइन शॉपिंग सर्विसेज को टक्कर देने के लिए एक ई-कॉमर्स प्लेटफॉर्म लॉन्च किया है।",
      "उपयोगकर्ताओं ने अमेज़ॅन की वेबसाइट, मूल्य निर्धारण और विक्रेता अनुभव के साथ निराशा व्यक्त की है, जिससे वैकल्पिक विकल्पों की मांग बढ़ रही है।",
      "फेडेक्स का उद्देश्य शॉपिंग कार्ट प्लगइन्स, केंद्रीकृत ऑर्डरिंग, भुगतान और रसद सेवाओं को एकीकृत करके एक व्यापक व्यावसायिक समाधान प्रदान करना है। हालांकि, अमेज़ॅन के साथ प्रतिस्पर्धा करने की उनकी क्षमता के बारे में चिंताएं हैं, विशेष रूप से उनकी वितरण सेवाओं और सटीकता के बारे में।"
    ],
    "points": 160,
    "commentCount": 110,
    "retryCount": 0,
    "time": 1705280137
  },
  {
    "id": 38992689,
    "title": "सामग्री फ़ाइलों का परिचय: सामग्री डिजाइन के साथ एंड्रॉइड के लिए एक ओपन-सोर्स फ़ाइल प्रबंधक",
    "originLink": "https://github.com/zhanghai/MaterialFiles",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38992689",
    "commentBody": "",
    "originSummary": [
      "यह ओपन-सोर्स फ़ाइल प्रबंधक सामग्री डिजाइन दिशानिर्देशों का पालन करते हुए हल्के और सुरक्षित होने के लिए डिज़ाइन किया गया है।",
      "यह ब्रेडक्रम्ब्स के साथ फाइल सिस्टम के माध्यम से आसान नेविगेशन प्रदान करता है और रूट एक्सेस के साथ फ़ाइलों के प्रबंधन का समर्थन करता है।",
      "इसमें संपीड़ित फ़ाइलों को देखने और बनाने और एफटीपी, एसएफटीपी और एसएमबी सर्वर पर फ़ाइलों को प्रबंधित करने की विशेषताएं भी हैं। उपयोगकर्ता इंटरफ़ेस को नाइट मोड विकल्प सहित विभिन्न रंग विषयों के साथ अनुकूलित किया जा सकता है।"
    ],
    "commentSummary": [
      "सामग्री फ़ाइलें एंड्रॉइड के लिए एक ओपन-सोर्स फ़ाइल मैनेजर है जो सामग्री डिजाइन सिद्धांतों का पालन करता है, जो एक नेत्रहीन आकर्षक और सहज उपयोगकर्ता अनुभव प्रदान करता है।",
      "इसमें आसान नेविगेशन, रूट एक्सेस के लिए समर्थन, अभिलेखागार को संभालने की क्षमता और एफटीपी, एसएफटीपी और एसएमबी सर्वर पर फ़ाइलों को प्रबंधित करने की क्षमता जैसी कई विशेषताएं शामिल हैं।",
      "उपयोगकर्ता इसकी कार्यक्षमता और इस तथ्य की सराहना करते हैं कि इसे गोपनीयता-केंद्रित Fdroid ऐप स्टोर से डाउनलोड किया जा सकता है, जो अधिक सुरक्षित अनुभव सुनिश्चित करता है।"
    ],
    "points": 136,
    "commentCount": 62,
    "retryCount": 0,
    "time": 1705255599
  },
  {
    "id": 38993552,
    "title": "गेम इंजन के लिए फास्ट आरआईएससी-वी-आधारित स्क्रिप्टिंग सिस्टम: बेहतर प्रदर्शन और कम ओवरहेड",
    "originLink": "https://github.com/fwsGonzo/rvscript",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38993552",
    "commentBody": "",
    "originSummary": [
      "आरवीस्क्रिप्ट एक गेम इंजन स्क्रिप्टिंग सिस्टम है जो टाइप-सेफ और मेमोरी-सेफ स्क्रिप्ट के लिए कम विलंबता आरआईएससी-वी सैंडबॉक्स का उपयोग करता है।",
      "इसका लक्ष्य प्रदर्शन को बढ़ाना और गेम स्क्रिप्टिंग में फ़ंक्शन कॉल के ओवरहेड को कम करना है।",
      "परियोजना में स्क्रिप्ट निष्पादन को अनुकूलित करने के लिए उन्नत तकनीकों को लागू करने के लिए उदाहरण और बेंचमार्क शामिल हैं, और नई कार्यक्षमता जोड़ने के लिए गतिशील कॉल का समर्थन करने के लिए आरआईएससी-वी कंपाइलर के साथ उपयोग किया जा सकता है। हालांकि, स्थिर एपीआई अभी तक उपलब्ध नहीं हैं क्योंकि सिस्टम अभी भी विकास में है।"
    ],
    "commentSummary": [
      "GitHub चर्चा गेम इंजन के लिए एक स्क्रिप्टिंग बैक एंड के रूप में RISC-V का उपयोग करने पर केंद्रित है, जिसमें लेखक बौद्धिक उत्तेजना और कम विकास समय जैसे लाभों पर प्रकाश डालता है।",
      "चर्चा में अन्य प्रतिभागियों द्वारा संभावित विलंबता मुद्दों और वैकल्पिक कंपाइलर लक्ष्यों के बारे में चिंताओं को उठाया जाता है।",
      "आरआईएससी-वी की पसंद को अन्य आर्किटेक्चर के साथ विरासत संगतता और संभावित पेटेंट प्रतिबंधों की कमी के लिए जिम्मेदार ठहराया जाता है, जबकि सीपीयू-बाउंड कोड के लिए वर्चुअलाइजेशन और सैंडबॉक्सिंग प्रौद्योगिकियों का पता लगाया जाता है।",
      "प्रदर्शन के मामले में लुआ और लुआजिट, वेबअसेंबली और सी / सी ++ जैसी स्क्रिप्टिंग भाषाओं के बीच तुलना की जाती है।",
      "आरआईएससी-वी का उपयोग करके एक मशीन कोड दुभाषिया के कार्यान्वयन पर चर्चा की गई है, साथ ही निम, नेलुआ, जिग, रस्ट और कोटलिन जैसी भाषाओं का उपयोग करके आरआईएससी-वी को संकलित करने के लिए विचार किया गया है।",
      "सी ++ और गेम इंजन स्क्रिप्टिंग के लिए जावास्क्रिप्ट, कोटलिन और सी # जैसी उच्च-स्तरीय भाषाओं का उपयोग भी शामिल है, जो प्रदर्शन और संगतता पर ध्यान केंद्रित करता है।",
      "सुरक्षित सर्वर-साइड कोड निष्पादन के लिए आरआईएससी-वी का संभावित उपयोग, वेबअसेंबली की व्याख्या करने की चुनौतियां, और स्टैक मशीनों की व्याख्या के लिए एक रजिस्टर एलोकेटर / फ़ाइल का कार्यान्वयन भी चर्चा के विषय हैं।",
      "स्टैक मशीनों और रजिस्टर मशीनों के बीच अंतर, साथ ही ब्राउज़र इंजन के लिए वेबअसेंबली के अनुकूलन का संक्षेप में उल्लेख किया गया है।",
      "चर्चा संक्षेप में आरआईएससी-वी आर्किटेक्चर में मूल्यों को जोड़ने की प्रक्रिया और आरआईएससी-वी की बढ़ती लोकप्रियता को छूती है।"
    ],
    "points": 135,
    "commentCount": 70,
    "retryCount": 0,
    "time": 1705260286
  },
  {
    "id": 38990709,
    "title": "ट्रांसफार्मर आर्किटेक्चर और भाषा मॉडल के लिए पायथन और पाइटॉर्च में ध्यान तंत्र को लागू करना",
    "originLink": "https://magazine.sebastianraschka.com/p/understanding-and-coding-self-attention",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38990709",
    "commentBody": "",
    "originSummary": [
      "यह लेख दर्शाता है कि ट्रांसफार्मर आर्किटेक्चर और बड़े भाषा मॉडल के लिए पायथन और पाइटॉर्च में आत्म-ध्यान तंत्र को कैसे लागू किया जाए।",
      "यह प्राकृतिक भाषा प्रसंस्करण कार्यों में ध्यान तंत्र के महत्व की व्याख्या करता है और विभिन्न प्रकार के ध्यान तंत्रों की पड़ताल करता है।",
      "लेख में आत्म-ध्यान और कारण आत्म-ध्यान में वाक्य एम्बेडिंग, ध्यान भार की गणना और संदर्भ वैक्टर बनाने की प्रक्रिया शामिल है। यह ध्यान भार को सामान्य बनाने के महत्व पर भी प्रकाश डालता है।"
    ],
    "commentSummary": [
      "लेख कोडिंग में उपयोग किए जाने वाले विभिन्न ध्यान तंत्रों की पड़ताल करता है, जैसे कि आत्म-ध्यान, बहु-सिर ध्यान, क्रॉस-ध्यान और कारण-ध्यान।",
      "भाषा मॉडल के प्रशिक्षण के लिए फ्लैश अटेंशन जैसे अनुकूलित कार्यान्वयन की सिफारिश की जाती है।",
      "उपयोगकर्ता PyTorch में नहीं पाए जाने वाले ध्यान विधियों को लागू करने की क्षमता और तंत्रिका नेटवर्क में ध्यान और मानव मनोविज्ञान में ध्यान के बीच संबंध पर चर्चा करते हैं।"
    ],
    "points": 130,
    "commentCount": 9,
    "retryCount": 0,
    "time": 1705242587
  },
  {
    "id": 38991953,
    "title": "रफल: 2023 में प्रमुख सुधारों के साथ फ्लैश एमुलेटर प्रगति",
    "originLink": "https://ruffle.rs/blog/2024/01/14/2023-in-review",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38991953",
    "commentBody": "",
    "originSummary": [
      "रफल, एक फ्लैश एमुलेटर, ने एक्शनस्क्रिप्ट 3 भाषा और एपीआई में कई सुधारों के साथ 2023 में पर्याप्त प्रगति की है।",
      "एमुलेटर अब फ़िल्टर, कैशबिटमैप, टेक्स्ट रेंडरिंग, सॉकेट, फ्लैश रेमोटिंग, एफएलवी और वीडियो प्लेबैक क्षमताओं का समर्थन करता है।",
      "एआईआर और मिश्रित एवीएम फिल्मों के लिए प्रारंभिक समर्थन जोड़ा गया है, साथ ही योगदान और प्रायोजन समर्थन के साथ विस्तार, डेस्कटॉप यूआई और वेबसाइट में वृद्धि हुई है।"
    ],
    "commentSummary": [
      "पोस्ट में रफल प्रोजेक्ट पर प्रकाश डाला गया है, जिसका उद्देश्य फ्लैश तकनीक को पुनर्जीवित करना और इससे जुड़ी पुरानी यादों और रचनात्मकता को वापस लाना है।",
      "उपयोगकर्ता फ्लैश द्वारा प्रदान किए गए अद्वितीय विकास अनुभव और इंटरैक्टिव सामग्री के लिए अपनी लालसा व्यक्त करते हैं।",
      "गेम इंजन या फ़्लटर जैसी वैकल्पिक तकनीकों का प्रस्ताव है, लेकिन आम सहमति यह है कि रफल फ्लैश को ब्राउज़र में वापस लाने के अपने प्रयासों के लिए सराहनीय है।"
    ],
    "points": 127,
    "commentCount": 20,
    "retryCount": 0,
    "time": 1705250684
  },
  {
    "id": 38991248,
    "title": "ईएसपी 32 रिवर्स इंजीनियरिंग के लिए एक प्रभावी फैराडे पिंजरे का निर्माण",
    "originLink": "https://esp32-open-mac.be/posts/0003-faraday-cage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38991248",
    "commentBody": "",
    "originSummary": [
      "लेखक को आसपास की हवा में वाई-फाई पैकेट की उच्च मात्रा के कारण ईएसपी 32 माइक्रोकंट्रोलर के लिए वाई-फाई स्टैक को रिवर्स इंजीनियरिंग में चुनौतियों का सामना करना पड़ता है।",
      "पारंपरिक तरीके, जैसे कि पेंट टिन, फेराइट चोक, और फैराडे पिंजरे के रूप में एक बंद माइक्रोवेव का उपयोग करना, बाहर के पैकेट को अवरुद्ध करने में अप्रभावी साबित होते हैं।",
      "लेखक ने प्रवाहकीय कपड़े और आमतौर पर उपलब्ध सामग्रियों से बने एक किफायती फैराडे पिंजरे को रेखांकित करते हुए एक शोध पत्र की खोज की है।",
      "लागत को कम करने के लिए, लेखक ने लकड़ी के अलमारियों और लीड-एसिड बैटरी का उपयोग करके फैराडे पिंजरे का निर्माण करने की योजना बनाई है।",
      "निर्मित फैराडे पिंजरा सफलतापूर्वक आरएफ सिग्नल को ब्लॉक करता है, जिससे वाई-फाई स्टैक का अधिक सटीक विश्लेषण हो सकता है।",
      "सारांश में सिग्नल क्षीणन पर जानकारी, सामग्री का एक बिल और फैराडे पिंजरे के निर्माण के लिए विस्तृत निर्देश शामिल हैं।"
    ],
    "commentSummary": [
      "पोस्ट ईएसपी 32 रिवर्स इंजीनियरिंग के लिए डेटा पासथ्रू के साथ एक फैराडे पिंजरे के निर्माण की पड़ताल करता है।",
      "पिंजरे के लिए अनुशंसित सामग्री पासथ्रू के लिए इकोफोइल एनटी और डेल्टा 20 डीबीएजी 5 हैं।",
      "पोस्ट में विंडोज़ / वेंट, परिरक्षण के लिए सामग्री प्रभावशीलता, आरएफ परीक्षण, वाईफाई कनेक्टिविटी मुद्दों और परिरक्षण के लिए माइक्रोवेव ओवन के संभावित उपयोग के लिए सिफारिशें भी शामिल हैं।"
    ],
    "points": 118,
    "commentCount": 25,
    "retryCount": 0,
    "time": 1705246161
  },
  {
    "id": 38991392,
    "title": "क्रिस्टल 1.11.0: नई सुविधाएँ, बग फिक्स, और LLVM 18 समर्थन",
    "originLink": "https://crystal-lang.org/2024/01/08/1.11.0-released/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38991392",
    "commentBody": "",
    "originSummary": [
      "क्रिस्टल प्रोग्रामिंग भाषा ने विभिन्न नई सुविधाओं और बग फिक्स के साथ एक नया संस्करण जारी किया है।",
      "उल्लेखनीय परिवर्तनों में आगामी एलएलवीएम 18 के लिए समर्थन, कंपाइलर अनुकूलन स्तर, नए संरेखण आदिम, और विंडोज पर गतिशील लिंक लाइब्रेरी निर्दिष्ट करने के लिए एक पैरामीटर शामिल हैं।",
      "रिलीज़ में संग्रह विधियों, संख्यात्मक संचालन, पाठ प्रसंस्करण और बग फिक्स के साथ-साथ कस्टम आवंटन तंत्र से संबंधित प्रयोगात्मक सुविधाओं के लिए संवर्द्धन भी शामिल हैं।",
      "मैक्रो अभिव्यक्तियों और कुछ एलएलवीएम कार्यों में स्प्लेट ऑपरेटरों को हटा दिया जाता है।",
      "रिलीज प्रायोजकों के समर्थन से संभव हुई थी।"
    ],
    "commentSummary": [
      "क्रिस्टल संस्करण 1.11.0 विंडोज समर्थन के बारे में चल रही चर्चाओं पर ध्यान देने के साथ जारी किया गया है।",
      "क्रिस्टल डेवलपर्स विंडोज समर्थन को प्राथमिकता दे रहे हैं और इसके विकास में सक्रिय रूप से योगदान दे रहे हैं और वित्तीय सहायता प्रदान कर रहे हैं।",
      "विंडोज पर क्रिस्टल की मांग है, खासकर पूरी तरह से पोर्टेबल निष्पादन योग्य फाइलें बनाने के लिए। क्रिस्टल एक स्थिर रूप से टाइप और संकलित प्रोग्रामिंग भाषा है जो पायथन और रूबी जैसी व्याख्या की गई भाषाओं की सादगी के साथ गो और रस्ट की गति को जोड़ती है। यह सी प्रोग्राम के साथ इंटरऑपरेबिलिटी प्रदान करता है और रूबी या पायथन की तुलना में बेहतर टाइपिंग और कम मेमोरी उपयोग प्रदान करता है।"
    ],
    "points": 107,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1705246909
  },
  {
    "id": 38991521,
    "title": "चुनौतीपूर्ण इंसुलिन थेरेपी: गैरी टॉब्स के साथ मधुमेह पर पुनर्विचार",
    "originLink": "https://www.theguardian.com/society/2024/jan/14/unlocking-the-truth-about-diabetes-is-it-time-for-a-diet-based-treatment",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38991521",
    "commentBody": "",
    "originSummary": [
      "विज्ञान लेखक गैरी टॉब्स मधुमेह के उपचार पर मुख्यधारा के विचारों को चुनौती देते हैं और सुझाव देते हैं कि इंसुलिन थेरेपी बीमारी की वैश्विक महामारी में योगदान दे सकती है।",
      "टॉब्स मधुमेह में रक्त शर्करा के स्तर के प्रबंधन के विकल्प के रूप में कीटो जैसे कम कार्ब आहार की वकालत करते हैं।",
      "उनके विचारों ने प्रशंसा और आलोचना दोनों को जन्म दिया है, कुछ ने पोषण पर उनके शोध की सराहना की है जबकि अन्य कम कार्ब आहार की सुरक्षा और प्रभावशीलता पर सवाल उठाते हैं।"
    ],
    "commentSummary": [
      "चर्चा पोषण, मधुमेह प्रबंधन, वजन घटाने और पोषण विज्ञान की विश्वसनीयता के विभिन्न पहलुओं की पड़ताल करती है।",
      "कम कार्ब आहार, विभिन्न प्रकार के मधुमेह और रक्त शर्करा के स्तर को ट्रैक करने के महत्व के बारे में विभिन्न राय साझा की जाती हैं।",
      "बातचीत मधुमेह प्रबंधन में आहार की भूमिका और विभिन्न आहार दृष्टिकोणों के संभावित लाभों पर भी प्रकाश डालती है, जबकि पोषण विज्ञान की वैज्ञानिक वैधता और क्षेत्र में विशेषज्ञों की योग्यता पर भी चर्चा करती है।"
    ],
    "points": 106,
    "commentCount": 107,
    "retryCount": 0,
    "time": 1705247634
  },
  {
    "id": 38991317,
    "title": "मेक्सिको ने पनामा नहर के प्रतिद्वंद्वी के लिए रेलवे का निर्माण किया",
    "originLink": "https://www.japantimes.co.jp/business/2023/11/16/mexico-rail-rival-panama-canal/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38991317",
    "commentBody": "",
    "originSummary": [
      "मैक्सिकन सरकार पनामा नहर के साथ प्रतिस्पर्धा करने के लिए एक रेलवे का निर्माण कर रही है, जो प्रशांत और अटलांटिक महासागरों को उनके सबसे संकीर्ण बिंदु पर जोड़ती है।",
      "परियोजना से आर्थिक लाभ आने की उम्मीद है, लेकिन संभावित पर्यावरणीय और सामाजिक परिणामों के बारे में चिंताएं बढ़ रही हैं।",
      "रेलवे पर निर्माण 2020 में राष्ट्रपति एंड्रेस मैनुअल लोपेज ओब्राडोर के प्रशासन के दौरान शुरू हुआ था।"
    ],
    "commentSummary": [
      "मेक्सिको पनामा नहर में परिवहन और पानी की कमी के मुद्दों को संबोधित करने के लिए एक विकल्प के रूप में एक रेल प्रणाली का निर्माण कर रहा है।",
      "समुद्री मार्गों की तुलना में रेल प्रणाली की लागत और दक्षता के बारे में चिंताओं को उठाया गया है, जिससे कनाडा के आसपास उत्तर की ओर जाने जैसे वैकल्पिक मार्गों का उपयोग करने के सुझाव मिले हैं।",
      "चर्चा किए गए विभिन्न समाधानों में उन्नत छंटाई तकनीक, समानांतर रेलवे और स्केल-अप क्रॉलर ट्रांसपोर्टर शामिल हैं, लेकिन जहाजों पर तनाव, दुर्घटनाओं और जल संदूषण के बारे में चिंताएं बनी हुई हैं।",
      "अन्य प्रस्तावित समाधानों में मौजूदा ताले का उपयोग करना, समुद्र से पानी पंप करना और सुरंगों का निर्माण करना शामिल है।",
      "पनामा नहर में पानी का स्तर कम होने के कारण टैंकर डिवीजन स्टोल्ट-नीलसन जहाजों को स्वेज नहर में भेज रहा है।",
      "मीठे पानी की आपूत के पूरक के रूप में खारे पानी और मॉड्यूलर नाभिकीय रिएक्टरों के उपयोग की व्यवहार्यता पर विचार किया जा रहा है।",
      "मीठे पानी की झीलों में खारे पानी के पंपिंग के बारे में एक बहस है, पारिस्थितिकी तंत्र को नुकसान को कम करने और सौर या पनबिजली शक्ति का उपयोग करके एक प्रणाली को लागू करने की व्यवहार्यता और लागत के बारे में चर्चा के साथ।"
    ],
    "points": 94,
    "commentCount": 101,
    "retryCount": 0,
    "time": 1705246507
  }
]
