[
  {
    "id": 41959428,
    "title": "நாங்கள் எங்கள் ஜாவாஸ்கிரிப்ட் மொனோரெப்போ கிட் அளவை சுருக்கினோம்",
    "originLink": "https://www.jonathancreamer.com/how-we-shrunk-our-git-repo-size-by-94-percent/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41959428",
    "commentBody": "",
    "originSummary": [
      "Microsoft, 1JS எனப்படும் அவர்களின் Javascript monorepo-வின் அளவை 178GB-இல் இருந்து 5GB-ஆக குறைத்து, 94% குறைப்பை அடைந்தது, git இன் CHANGELOG கோப்புகளை கையாள்வதில் உள்ள செயல்திறன் குறைபாடுகளை சரிசெய்து.",
      "தீர்வு புதிய git repack முறை மற்றும் கட்டமைப்பைப் பயன்படுத்துவதில் இருந்தது, இது இப்போது மைக்ரோசாஃப்ட் git கிளையில் கிடைக்கிறது மற்றும் மேலோட்ட git இல் ஒருங்கிணைக்கப்படும்.",
      "இந்த முன்னேற்றம் பெரிய மொனோறெப்போக்களை நிர்வகிக்கும் நபர்களுக்கு முக்கியமானது, ஏனெனில் இது களஞ்சிய வளர்ச்சியை திறம்பட நிர்வகிக்க மற்றும் குறைக்க உத்திகளை வழங்குகிறது."
    ],
    "commentSummary": [
      "Microsoft இன் git fork ஒரு புதிய கட்டளையை அறிமுகப்படுத்துகிறது, இது Javascript monorepos இன் அளவை குறிப்பிடத்தக்க வகையில் குறைக்கிறது, குறிப்பாக git இன் கோப்பு பாதைகளை கையாளும் செயல்முறைகளில் உள்ள செயல்திறன் குறைபாடுகளை சரிசெய்து.",
      "புதிய அணுகுமுறை முழு கோப்பு பாதைகளை டெல்டா சுருக்கத்திற்கு பயன்படுத்துகிறது, இது களஞ்சிய அளவுகளை பெரிதும் குறைக்க முடியும், இதற்கு உதாரணமாக குரோமியத்தின் அளவு 100GB இல் இருந்து 22GB ஆக குறைந்துள்ளது.",
      "Microsoft இன் திறந்த மூல திட்டங்களின் மீது உள்ள செல்வாக்கு குறித்து கவலைகள் இருந்தாலும், மாற்றங்கள் அதிகாரப்பூர்வ Git திட்டத்தில் சேர்க்கப்படுவதற்காக முன்மொழியப்படுகின்றன."
    ],
    "points": 287,
    "commentCount": 179,
    "retryCount": 0,
    "time": 1729996522
  },
  {
    "id": 41958766,
    "title": "நான் 2013 ஆம் ஆண்டில் ஒரு பொது வானொலி சேனலில் மர்மமான மறைக்கப்பட்ட சிக்னல்களை கண்டுபிடித்தேன் [வீடியோ]",
    "originLink": "https://media.ccc.de/v/30C3_-_5588_-_en_-_saal_g_-_201312281600_-_my_journey_into_fm-rds_-_oona_raisanen",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41958766",
    "commentBody": "",
    "originSummary": [
      "இந்த பதிவு NewsRSS இல் இருந்து ஒரு பாட்காஸ்ட் ஊட்டம் காப்பகத்தை வெளிப்படுத்துகிறது, MP3, MP4, WebM, மற்றும் Opus போன்ற பல வடிவங்களில் உள்ள உள்ளடக்கத்தை வழங்குகிறது, குறிப்பாக Chaos Computer Club இன் 30c3 மாநாட்டின் நிகழ்வுகளை மையமாகக் கொண்டு.",
      "\"என் FM-RDS பயணம்\" என்ற சிறப்பு உரை, ஊனா ரைசனன் வழங்கியது, ஹார்ட்வேர் ஹாக்கிங் மற்றும் குறியாக்க பகுப்பாய்வு பயன்படுத்தி பொது வானொலியில் மறைந்துள்ள சிக்னல்களை கண்டறிதல் குறித்து ஆராய்கிறது.",
      "தமிழில் எழுத வேண்டும். உள்ளடக்கம் FPGA (Field-Programmable Gate Array), கன்சோல் ஹாக்கிங், மற்றும் DVB-T (டிஜிட்டல் வீடியோ ஒளிபரப்பு - நிலப்பரப்பு) போன்ற தலைப்புகளில் ஆர்வமுள்ள ஆர்வலர்களுக்கு தொடர்புடையது."
    ],
    "commentSummary": [
      "ஒரு பயனர் பொதுமக்கள் எஃஎம் வானொலி சேனலில் மர்மமான சிக்னல்களை ஆராய்ந்து, ஒலி அட்டவணையைப் பயன்படுத்தி வானொலி தரவுத் தொகுதி (RDS) சிக்னல்களை டிகோடு செய்ய ஒரு ஸ்பெக்ட்ரம் அனலிசரை பயன்படுத்தினார்.",
      "வழங்கல் ஒரு RDS டிகோடர் கருவியை வெளியிடுவதையும், சத்தமுள்ள சூழல்களில் தரவுகளை பாதுகாப்பாக குறியாக்குவதின் சவால்களைப் பற்றியும் விவாதித்தது.",
      "இந்த உரை ஹேக்கர் மனப்பான்மைக்கு புகழ் பெற்றது, மர்மங்களை தீர்க்கும் மகிழ்ச்சியையும் ஸ்மார்ட்போன்களில் FM RDS இன் சாத்தியமான பயன்பாட்டையும் வலியுறுத்துகிறது."
    ],
    "points": 227,
    "commentCount": 59,
    "retryCount": 0,
    "time": 1729987790
  },
  {
    "id": 41961866,
    "title": "சுமார் 200 ஆண்டுகளுக்குப் பிறகு கண்டுபிடிக்கப்பட்ட ஒரு ஷோபின் வால்ட்ஸ்",
    "originLink": "https://www.nytimes.com/2024/10/27/arts/music/chopin-waltz-discovery.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41961866",
    "commentBody": "",
    "originSummary": [
      "முன்னர் தெரியாத ஒரு ஷோபின் வால்ட்ஸ் நியூயார்க்கில் உள்ள மோர்கன் நூலகம் மற்றும் அருங்காட்சியகத்தில் கண்டுபிடிக்கப்பட்டுள்ளது, இது 50 ஆண்டுகளுக்கு மேலாக நடந்த முதல் கண்டுபிடிப்பாகும்.",
      "மூல உரை: 1830களில் இருந்து வந்ததாக நம்பப்படும் அந்த கைப்பிரதி, நிபுணர்களால் சரிபார்க்கப்பட்டு, சாதாரண சோப்பின் வால்ட்ஸ்களைவிட குறைவாகவும், அதிக துடிப்பாகவும் இருப்பதற்காக புகழ்பெற்ற பியானோ வாத்தியக்காரர் லாங் லாங் மூலம் இசைக்கப்பட்டது.",
      "இந்த கண்டுபிடிப்பு சோப்பினின் மரபுக்கு பங்களிக்கிறது, அவர் சுமார் 250 படைப்புகளை, பெரும்பாலும் தனிப்பட்ட பியானோவிற்காக, சில சந்தேகங்களுடன் இருந்தாலும், கிளாசிக்கல் இசை சமூகத்தில் உருவாக்கினார்."
    ],
    "commentSummary": [
      "ஒரு புதியதாக கண்டுபிடிக்கப்பட்ட ஷோபின் வால்ட்ஸ், 200 ஆண்டுகள் பழமையானது, அதன் உண்மைத்தன்மை மற்றும் பாணி பண்புகள் குறித்து விவாதங்களை தூண்டியுள்ளது.",
      "வல்லுநர்கள், இந்த இசை துண்டு சோபினின் தனித்துவமான பாணியால், குறிப்பாக போலிஷ் இசை மற்றும் சலூன் கலாச்சாரத்தால் பாதிக்கப்படுவதால், அதன் ஒலியால் மட்டுமே அடையாளம் காணப்பட முடியுமா என்பதைப் பற்றி விவாதிக்கின்றனர்.",
      "அவரின் சிறந்த படைப்புகளில் ஒன்றாகக் கருதப்படாத போதிலும், இந்த வால்ட்ஸ் ஷோப்பின் இசை மரபை விரிவாகப் புரிந்துகொள்ள உதவுகிறது மற்றும் இசையமைப்பாளர்களின் படைப்புகளை அடையாளம் காணுதல் மற்றும் நவீன பின்பற்றல்களின் சாத்தியத்தைப் பற்றிய கேள்விகளை எழுப்புகிறது."
    ],
    "points": 208,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1730030224
  },
  {
    "id": 41962750,
    "title": "50 ஆண்டுகளுக்கு முன்பு, சர்க்கரை தொழில் கொழுப்பை குற்றம் சாட்ட அறிவியலாளர்களுக்கு பணம் கொடுத்தது (2016)",
    "originLink": "https://www.npr.org/sections/thetwo-way/2016/09/13/493739074/50-years-ago-sugar-industry-quietly-paid-scientists-to-point-blame-at-fat",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41962750",
    "commentBody": "",
    "originSummary": [
      "1960களில், சர்க்கரை தொழில் சர்க்கரையின் உடல் நல ஆபத்துகளை குறைத்து காட்டவும், கொழுப்பின் ஆபத்துகளை வெளிப்படுத்தவும் ஆராய்ச்சிக்கு நிதியளித்தது, என ஜேஎம்ஏ இன்டர்னல் மெடிசின் கட்டுரை வெளிப்படுத்தியது.",
      "தமிழில் எழுத வேண்டும். சர்க்கரை ஆராய்ச்சி அறக்கட்டளை (SRF) 1967 ஆம் ஆண்டில் ஹார்வார்ட் விஞ்ஞானிகளை நிதியுதவி வழங்கி, நிதியுதவி பற்றிய தகவலை வெளிப்படுத்தாமல், இதய நோய்களைத் தடுக்க கொழுப்பு குறைப்பை ஊக்குவிக்கும் ஒரு மதிப்பாய்வை வெளியிடச் செய்தது.",
      "கட்டுரை, தொழில் நிதியுதவி பெற்ற ஆய்வுகளின் மீது குறைந்த நம்பிக்கையை வலியுறுத்தி, சர்க்கரையின் ஆரோக்கிய தாக்கங்களைப் பற்றிய மேலும் ஆராய்ச்சிகளை ஆதரிக்கிறது, விஞ்ஞான விவாதங்களில் சர்க்கரை தொழில்துறையின் வரலாற்று செல்வாக்கை ஒப்புக்கொள்கிறது."
    ],
    "commentSummary": [
      "சர்க்கரை தொழில் வரலாற்று ரீதியாக ஆராய்ச்சியாளர்களுக்கு பணம் கொடுத்து, ஆரோக்கிய பிரச்சினைகளுக்கான குற்றத்தை சர்க்கரையிலிருந்து கொழுப்பிற்கு மாற்ற முயன்றது, இது உணவுக் குறித்த ஆரோக்கியத்தில் பரவலான தவறான கருத்துக்களை உருவாக்கியது.",
      "இந்த மாற்றம் உணவுப் பழக்கங்களை பாதித்தது, குறைந்த கொழுப்பு ஆனால் அதிக சர்க்கரை உள்ள தயாரிப்புகள் பிரபலமடைந்தன, இது பொதுமக்களின் சுகாதாரக் கருத்துக்களை பாதித்தது.",
      "இந்த விவாதம் பொதுமக்களின் பார்வை மற்றும் அரசாங்கத்தின் மீது நிறுவனங்களின் செல்வாக்கை பற்றிய பரந்த பிரச்சினையை வலியுறுத்துகிறது, தொழில்துறை சார்ந்த கதைகளின் விமர்சன மதிப்பீட்டின் தேவையை முக்கியமாகக் குறிப்பிடுகிறது."
    ],
    "points": 169,
    "commentCount": 134,
    "retryCount": 0,
    "time": 1730038247
  },
  {
    "id": 41960442,
    "title": "திறந்த மூலமே பெரிய தொழில்நுட்பத்திற்கு மாற்றாக இல்லை",
    "originLink": "https://berthub.eu/articles/posts/open-source-by-itself-is-no-alternative-for-big-tech/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41960442",
    "commentBody": "",
    "originSummary": [
      "திறந்த மூல மென்பொருள், அதன் முழுமையான ஆதரவு மற்றும் அடிக்கோட்பாடுகள் இல்லாததால், பெரிய தொழில்நுட்ப நிறுவனங்களின் ஆதிக்கத்தை எதிர்க்க தனித்தன்மையான தீர்வாக இல்லை. திறந்த மூலத்தை பயனுள்ளதாக மாற்றுவதற்கு ஆதரவு, பயிற்சி மற்றும் வளங்களில் முக்கிய முதலீடு தேவை, இது ஐரோப்பிய பாராளுமன்றத்தின் Nextcloud உடன் தோல்வியுற்ற முயற்சியால் நிரூபிக்கப்பட்டது. பெரிய தொழில்நுட்ப நிறுவனங்களுடன் போட்டியிட, திறந்த மூலத்திற்கு சேவைகள் மற்றும் ஆதரவுகளில் ஒப்பிடத்தக்க முதலீடு தேவை, வெற்றிகரமான தகவல் தொழில்நுட்ப மாற்றங்களுக்கு மென்பொருளின் தன்மையைப் பொருட்படுத்தாமல் கவனமாக திட்டமிடல் மற்றும் வளங்கள் தேவை என்பதை வலியுறுத்துகிறது."
    ],
    "commentSummary": [
      "திறந்த மூல மென்பொருள், மதிப்புமிக்கதாக இருந்தாலும், பெரும்பாலான தொழில்கள் தேவைப்படும் ஆதரவு மற்றும் நம்பகத்தன்மையை அடிக்கடி இழக்கிறது, இதனால் அது பெரிய தொழில்நுட்ப நிறுவனங்களுக்கு முழுமையான மாற்றாக இருக்க முடியாது.",
      "RedHat போன்ற நிறுவனங்கள் தங்கள் மென்பொருளுடன் சேவைகள் மற்றும் ஆதரவை வழங்குவதன் மூலம் வளர்ச்சி அடைகின்றன, இது வலுவான ஆதரவு சூழலின் முக்கியத்துவத்தை வெளிப்படுத்துகிறது.",
      "திறந்த மூல திட்டங்கள் பெரும்பாலும் பெரிய தொழில்நுட்ப நிறுவனங்களின் பங்களிப்புகளின் மீது சார்ந்திருக்கின்றன, இது நேரடி போட்டியல்லாமல் ஒற்றுமையான உறவை குறிக்கிறது."
    ],
    "points": 161,
    "commentCount": 177,
    "retryCount": 0,
    "time": 1730013130
  },
  {
    "id": 41958550,
    "title": "ZombAIs: Prompt Injection இல் இருந்து Claude Computer பயன்பாட்டுடன் C2 வரை",
    "originLink": "https://embracethered.com/blog/posts/2024/claude-computer-use-c2-the-zombais-are-coming/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41958550",
    "commentBody": "",
    "originSummary": [
      "ஆந்த்ரோபிக் க்ளோட் கணினி பயன்பாடு, ஏஐ ஒரு கணினியை எப்படி கட்டுப்படுத்த முடியும் என்பதை காட்டுகிறது, இது ப்ராம்ட் இன்ஜெக்ஷன் மூலம் சாத்தியமான சுரண்டலின் குறித்த கவலைகளை எழுப்புகிறது.",
      "டெமோ, க்ளோடை எவ்வாறு மால்வேரை பதிவிறக்கம் செய்து செயல்படுத்துவதற்கு மாற்றி, கணினியை கட்டளை மற்றும் கட்டுப்பாட்டு (C2) சர்வருடன் இணைப்பதன் மூலம் \"ZombAI\" ஆக மாற்ற முடியும் என்பதை விளக்குகிறது.",
      "இந்த நிலைமை நம்பிக்கையற்ற தரவுகளை கையாளும் தன்னாட்சி AI அமைப்புகளுடன் தொடர்புடைய அபாயங்களை வலியுறுத்துகிறது, எச்சரிக்கை மற்றும் பாதுகாப்பு நடவடிக்கைகளின் தேவையை முக்கியமாகக் குறிப்பிடுகிறது."
    ],
    "commentSummary": [
      "தமிழில் எழுத வேண்டும். இந்த விவாதம், குறிப்பாக \"prompt injection\" தாக்குதல்களுக்கு ஆளாகும் போது, தன்னாட்சி AI முகவர்களாக பயன்படுத்தப்படும் பெரிய மொழி மாதிரிகளின் (LLMs) பாதிப்புகளை, உதாரணமாக Claude போன்றவற்றின் பாதிப்புகளை மையமாகக் கொண்டுள்ளது.",
      "\"பிராம்ப்ட் இன்ஜெக்ஷன்\" என்பது வலைப்பக்கங்கள் போன்ற தரவுகளில் வழிமுறைகளை உட்பொதிப்பதைக் குறிக்கிறது, இதனால் LLMகள் மூலத்தை சரிபார்க்காமல் பின்பற்றக்கூடும், இது மால்வேரை பதிவிறக்கம் செய்வது போன்ற எதிர்பாராத செயல்களுக்கு வழிவகுக்கலாம்.",
      "பரிந்துரைக்கப்பட்ட தீர்வுகளில் கட்டளை மற்றும் தரவுக் கால்வாய்களைப் பிரிப்பது அல்லது மனித மேற்பார்வையை செயல்படுத்துவது ஆகியவை அடங்கும், ஆனால் இந்த சவால்கள் AI பயன்பாடுகளில் வலுவான பாதுகாப்பு நடவடிக்கைகளின் தேவையை வெளிப்படுத்துகின்றன."
    ],
    "points": 150,
    "commentCount": 76,
    "retryCount": 0,
    "time": 1729985787
  },
  {
    "id": 41960914,
    "title": "எழுதுபவர்கள் மற்றும் எழுதாதவர்கள்",
    "originLink": "https://paulgraham.com/writes.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41960914",
    "commentBody": "",
    "originSummary": [
      "ஆசிரியர் 2024 ஆம் ஆண்டிற்குள் எழுதும் திறன்கள் குறிப்பிடத்தக்க அளவில் குறையும் என்று கணிக்கிறார், ஏனெனில் எழுதும் பணிகளுக்கு AI மீது அதிகமாக நம்பிக்கை வைக்கப்படுவதால், தனிநபர்கள் எழுதுவதைக் கற்றுக்கொள்வதற்கும் பயிற்சி செய்வதற்கும் தேவையில்லை.",
      "எழுத்து திறன்களின் இந்த குறைவு, எழுதக்கூடியவர்களுக்கும் எழுத முடியாதவர்களுக்கும் இடையே ஒரு சமூகப் பிளவை ஏற்படுத்தக்கூடும், இது முக்கியமான சிந்தனை திறன்களை பாதிக்கக்கூடும், ஏனெனில் எழுத்து தெளிவான மற்றும் கட்டமைக்கப்பட்ட சிந்தனையுடன் நெருக்கமாக இணைக்கப்பட்டுள்ளது.",
      "எழுத்தாளர் எச்சரிக்கிறார், காலாவதியான பிற திறன்களுடன் மாறுபட்டு, எழுத்து முக்கியமானது விமர்சன சிந்தனைக்காக, மேலும் அதன் சரிவு சமூகத்திற்கு ஆபத்தை ஏற்படுத்தக்கூடும், ஏனெனில் இது தனிநபர்களின் விமர்சன சிந்தனை திறனை குறைக்கக்கூடும்."
    ],
    "commentSummary": [
      "பால் கிரஹாமின் கட்டுரை, நன்றாக எழுதுவது தெளிவான சிந்தனையுடன் தொடர்புடையது என்று கூறுகிறது, மேலும் செயற்கை நுண்ணறிவு வளர்ச்சி சராசரி எழுத்தாளர்களை நீக்கக்கூடும், இதனால் திறமையான எழுத்தாளர்கள் மற்றும் போராடுபவர்கள் மட்டுமே மீதமிருப்பார்கள்.",
      "கட்டுரை, ஸ்டீபன் ஹாக்கிங் போன்ற உதாரணங்களுடன், தெளிவான சிந்தனைக்கு எழுதுவது ஒரே முறை என்கிற விவாதத்தை தூண்டுகிறது, மேலும் AI இன் எழுத்தறிவு மற்றும் தொடர்பு திறன்களில் ஏற்படும் பாதிப்புகள் பற்றிய கவலைகளையும் உள்ளடக்கியது.",
      "இந்த விவாதம், எழுத்து திறன்களின் மேம்பாட்டை மேம்படுத்துமா அல்லது தடுக்குமா என்பதை கேள்வி எழுப்பி, எழுத்தில் செயற்கை நுண்ணறிவின் பங்கையும் ஆராய்கிறது."
    ],
    "points": 149,
    "commentCount": 136,
    "retryCount": 0,
    "time": 1730019592
  },
  {
    "id": 41960085,
    "title": "மூன்ஷைன், உரையிலிருந்து உரை மாற்றுவதற்கான புதிய நவீன தொழில்நுட்பம்",
    "originLink": "https://petewarden.com/2024/10/21/introducing-moonshine-the-new-state-of-the-art-for-speech-to-text/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41960085",
    "commentBody": "",
    "originSummary": [
      "Moonshine என்பது புதிய பேச்சு-உரை மாதிரி ஆகும், இது OpenAI இன் Whisper ஐ வேகம் மற்றும் திறனில் மிஞ்சுகிறது, அதேசமயம் துல்லியத்தையும் பராமரிக்கிறது.- இது 1.7 மடங்கு வேகத்தை அதிகரிக்கிறது மற்றும் நெகிழ்வான உள்ளீட்டு சாளரத்தை பயன்படுத்துகிறது, பூஜ்யம்-பேடிங் தேவையை தவிர்க்கிறது, இதனால் பத்து வினாடி ஆடியோ கிளிப்புகளில் ஐந்து மடங்கு வேகமாக செயல்படுகிறது.- Moonshine கிட்டத்தட்ட உடனடி மொழிபெயர்ப்புகளை ஆதரிக்கிறது, தனியுரிமைக்காக உள்ளூரில் செயல்படுகிறது, மற்றும் 8MB RAM மட்டுமே தேவைப்படும் எம்பெடெட் ஹார்ட்வேர் உடன் இணக்கமாக உள்ளது, இதனால் Raspberry Pi போன்ற சாதனங்களுக்கு ஏற்றது."
    ],
    "commentSummary": [
      "Moonshine என்பது புதிய பேச்சை எழுத்தாக மாற்றும் கருவியாகும், இது Whisper மாதிரிகளுடன் போட்டியிடுகிறது, குறைவான GPU நினைவகத்தை தேவைப்படுத்துகிறது மற்றும் நீண்ட வாக்கியங்களில் சிறப்பாக செயல்படுகிறது.",
      "கருவி திறந்த தானியங்கி பேச்சு அங்கீகார (ASR) தரவுத்தொகுப்புகள் மற்றும் உள்நாட்டு ஆதாரங்களில் இருந்து 200,000 மணிநேர தரவுகளால் பயிற்சியளிக்கப்பட்டுள்ளது, ஆனால் பயனர்கள் நிறுவல் மற்றும் செயல்திறன் குறித்து கலவையான அனுபவங்களை அறிவிக்கின்றனர்.",
      "\"Moonshine\" என்ற பெயர் தேர்வு பயனர்களிடையே விவாதங்களை ஏற்படுத்தியுள்ளது, அதன் விளைவுகள் குறித்து மாறுபட்ட கருத்துக்களுடன்."
    ],
    "points": 149,
    "commentCount": 32,
    "retryCount": 0,
    "time": 1730007189
  },
  {
    "id": 41962205,
    "title": "நீங்கள் பெறுகிறீர்கள்: இணையத்தை சுரண்டும் மந்தமான பதிவிறக்கி",
    "originLink": "https://github.com/soimort/you-get",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41962205",
    "commentBody": "",
    "originSummary": [
      "நீங்கள்-பெறுங்கள் என்பது யூடியூப் மற்றும் விமியோ போன்ற பல்வேறு வலைத்தளங்களில் இருந்து ஊடகங்களை பதிவிறக்கம் செய்ய வடிவமைக்கப்பட்ட கட்டளை வரி கருவியாகும், மேலும் பிப் மற்றும் ஹோம்ப்ரூ போன்ற பல்வேறு தளங்களின் மூலம் நிறுவப்படலாம்.",
      "தமிழில் எழுத வேண்டும். இது வீடியோக்கள், ஆடியோக்கள் மற்றும் படங்களை பதிவிறக்கம் செய்வது, மீடியா பிளேயர்களுக்கு ஸ்ட்ரீமிங் செய்வது, ப்ராக்ஸி ஆதரவு, பதிவிறக்கங்களை மீண்டும் தொடங்குவது மற்றும் தனிப்பயன் கோப்பு பாதைகளை அமைப்பது போன்ற அம்சங்களை வழங்குகிறது, Python 3.7.4+ மற்றும் FFmpeg தேவைப்படும்.",
      "இந்த கருவி MIT உரிமத்தின் கீழ் திறந்த மூலமாக உள்ளது, மேலும் மூலக் குறியீடு டெவலப்பர்களுக்கு கிளை செய்ய கிடைக்கிறது, மற்றும் இதைப் பயன்படுத்தும் போது சட்டப் பூர்வமான இணக்கத்தை உறுதிப்படுத்துவது பயனர்களின் பொறுப்பாகும்."
    ],
    "commentSummary": [
      "நீங்கள் பெறுவது என்பது ஒரு வலைத் தளத்தை சுரண்டி தரவிறக்கி ஆகும், இது yt-dlp போன்றது, ஆனால் குறைவான மேம்பட்டதாகக் கருதப்படுகிறது, இது ஆடியோ ஸ்ட்ரீம்களை தரவிறக்குவதற்கு பயன்படுத்தப்படுகிறது, இதனால் பாண்ட்விட்த் மற்றும் பேட்டரி ஆயுளை பாதுகாக்க முடியும்.",
      "பயனர்கள் You-get ஐ NewPipe மற்றும் Brave Mobile உலாவி போன்ற பிற கருவிகளுடன் ஒப்பிடுகின்றனர், அதன் பயன்பாடு மற்றும் வரம்புகளை வெளிப்படுத்துகின்றனர்.",
      "தமிழில் எழுத வேண்டும். திட்டம், பயனர்கள் ஒரு தோல்வியுற்ற சோதனையுடன் ஒரு புல் கோரிக்கையை சமர்ப்பிக்க வேண்டும் என்று கோருகிறது, இது சிலருக்கு கட்டுப்பாடாக தோன்றுகிறது, மேலும் விவாதங்களில் திறந்த மூலத் திட்டங்களை பராமரிக்கும் சவால்கள் மற்றும் எதிர்காலத்தில் கடுமையான உள்ளடக்க அணுகல் கட்டுப்பாடுகள் பற்றிய சாத்தியமான விவாதங்கள் அடங்கும்."
    ],
    "points": 142,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1730033102
  },
  {
    "id": 41958593,
    "title": "ஜேம்ஸ் வெப் தொலைநோக்கி தனிமையில் இருப்பதாக தோன்றும் சில குவாசார்களை கண்டறிகிறது",
    "originLink": "https://scitechdaily.com/james-webb-telescope-discovers-quasars-where-they-shouldnt-exist/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41958593",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "ஜேம்ஸ் வெப் தொலைநோக்கி தனித்துவமான குவாசார்களை கண்டறிந்துள்ளது, இது விண்மீன் உருவாக்கத்தின் தற்போதைய கோட்பாடுகளை சவாலுக்கு உட்படுத்துகிறது.",
      "இந்த கண்டுபிடிப்பு, இந்த குவாசார்கள் அருகிலுள்ள பொருள்களை வெளியேற்றியிருக்கலாம் அல்லது உறிஞ்சியிருக்கலாம், அல்லது தனிமைப்படுவதற்கு முன்பு அடர்த்தியான பகுதிகளில் உருவாகியிருக்கலாம் என்ற ஊகங்களை ஏற்படுத்தியுள்ளது.",
      "இந்த கண்டுபிடிப்பு தற்போதைய பிரபஞ்சவியல் மாதிரிகளின் வரம்புகளைப் பற்றிய விவாதங்களைத் தூண்டியுள்ளது மற்றும் இந்த விசித்திரங்களை விளக்க புதிய கோட்பாடுகள் தேவைப்படலாம் என்ற சாத்தியத்தை முன்வைக்கிறது."
    ],
    "points": 137,
    "commentCount": 51,
    "retryCount": 0,
    "time": 1729986139
  },
  {
    "id": 41957377,
    "title": "ஒலிவெட்டியின் இவ்ரியா",
    "originLink": "https://medium.com/@danielstone/olivettis-ivrea-how-an-italian-tech-giant-built-the-world-s-most-progressive-company-town-557cb035c383",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41957377",
    "commentBody": "",
    "originSummary": [
      "1950களில், இத்தாலியின் இவ்ரியா, ஒலிவெட்டி நிறுவனத்தின் கீழ் ஒரு தனித்துவமான நிறுவன நகரமாக மாறியது, அதனை அட்ரியானோ ஒலிவெட்டி வழிநடத்தினார், முன்னேற்றமான வாழ்வு மற்றும் வேலை நிபந்தனைகளில் கவனம் செலுத்தினார்.- அட்ரியானோ ஒலிவெட்டி வணிகம், அரசியல் மற்றும் சமூக நலனை நன்கு ஒருங்கிணைத்தார், Lettera 22 தட்டச்சு இயந்திரம் மற்றும் P101 கணினி போன்ற உலகளவில் பாராட்டப்பட்ட தயாரிப்புகளுடன் நிறுவனத்தை ஒரு நிறுவன பொறுப்பின் மாதிரியாக மாற்றினார்.- அட்ரியானோவின் மரணத்திற்கு பிறகு 1960 இல், நிறுவனம் சவால்களை எதிர்கொண்டது மற்றும் இறுதியில் உலகளாவிய போட்டிக்கு அடிபணிந்தது, ஆனால் இவ்ரியாவின் மரபு வணிகத்தின் சமூக பங்கு மற்றும் வேலை-வாழ்க்கை சமநிலையைப் பற்றிய சிந்தனையைத் தூண்டுகிறது."
    ],
    "commentSummary": [
      "ஒலிவெட்டி இவ்ரியா தொழிற்சாலை, அதன் புதுமையான வடிவமைப்பு மற்றும் சிக்கலான அமைப்பிற்காக அறியப்பட்டது, ஆப்பிள் போன்ற நவீன தொழில்நுட்ப நிறுவனங்களுக்கு முன்னோடி ஆக இருந்தது, 1980கள் வரை தட்டச்சு இயந்திரங்களை உற்பத்தி செய்தது.",
      "ஆலை, இப்போது உலக பாரம்பரிய தளம், சமூக கிளப் மற்றும் மானிய விலையில் வீடுகள் போன்ற தனித்துவமான ஊழியர் நலன்களை வழங்கியது, ஆனால் அதில் பெரும்பாலானவை தற்போது கைவிடப்பட்டுள்ளன.",
      "TEXT: ஒலிவெட்டியின் வீழ்ச்சி பெரும்பாலும் அட்ரியானோ ஒலிவெட்டி மரணத்திற்கு பிந்தைய மோசமான மேலாண்மைக்கு காரணமாகும், எனினும் அதன் தளம் வடிவமைப்பு மற்றும் தொழில்நுட்பத்திற்கான வரலாற்று பங்களிப்புகளுக்காக முக்கியத்துவம் வாய்ந்ததாகவே உள்ளது."
    ],
    "points": 132,
    "commentCount": 26,
    "retryCount": 0,
    "time": 1729973602
  },
  {
    "id": 41958221,
    "title": "ADHD மற்றும் உங்கள் தொழில்முறை கண்ணியத்தை மேலாண்மை செய்வது",
    "originLink": "https://www.optimaloutliers.com/p/adhd-and-managing-your-reputation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41958221",
    "commentBody": "",
    "originSummary": [
      "பால் கிரஹாமின் \"நல்ல மற்றும் கெட்ட தாமதம்\" என்ற கட்டுரை, முக்கியமற்றவற்றை விட முக்கியமான பணிகளை முன்னுரிமை கொடுப்பதற்கு தாமதம் செய்வது பயனுள்ளதாக இருக்கலாம் என்று வாதிடுகிறது.",
      "\"Optima & Outliers\" புத்தகம், ஏடிஎச்டி கொண்ட நபர்கள் எவ்வாறு புறக்கணிக்கப்பட்ட பணிகளை மற்றும் அவற்றின் கண்ணியத்திற்கான தாக்கத்தை மேலாண்மை செய்ய முடியும் என்பதை, அதிக ஆபத்துள்ள பணிகளுக்கு கவனம் செலுத்தி மற்றும் அதிக மதிப்புள்ள பணிகளை தெளிவாக காட்டுவதன் மூலம் விவரிக்கிறது.",
      "திட்டங்கள் நிர்வாக பலவீனங்களை ஒப்புக்கொள்வது, சில செயல்திறன் குறைபாடுகளை செயல்பாட்டு செலவுகளாக ஏற்குவது மற்றும் புகழ் பாதிப்புகளை குறைக்க வழக்கமான பணிகளுக்கு சேவைகளை பயன்படுத்துவது ஆகியவற்றை உள்ளடக்கியவை."
    ],
    "commentSummary": [
      "ADHD என்பது இளம் தொழில்முனைவோரிடையே அடிக்கடி விவாதிக்கப்படுகிறது, பலர் இதற்காக மருத்துவரால் அல்லது தாங்களே தங்களை நோயறிகுறி அடையாளம் காணப்பட்டுள்ளனர், இது விழிப்புணர்வு மற்றும் புரிதலின் தேவையை வலியுறுத்துகிறது.",
      "இந்த பதிவில், பொறுப்புகளை தவிர்க்க காரணமாக பயன்படுத்தாமல், குறைபாடுகளை சமாளிக்க ஏற்ற வசதிகளை தேடுவதன் முக்கியத்துவத்தை வலியுறுத்துகிறது, ஏனெனில் இது செயல்திறனை குறைக்க முடியும்.",
      "இது ADHD நோயறிதலைப் பெறுவதற்கான சவால்களையும், பொருத்தமான வேலை இட வசதிகளை நடைமுறைப்படுத்துவதின் முக்கியத்துவத்தையும் கையாள்கிறது."
    ],
    "points": 129,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1729982105
  },
  {
    "id": 41957637,
    "title": "செறிந்த கொழுப்பு: ஒரு அறிவியல் ஒருமித்த கருத்தின் உருவாக்கம் மற்றும் அழிப்பு (2022)",
    "originLink": "https://journals.lww.com/co-endocrinology/fulltext/2023/02000/a_short_history_of_saturated_fat__the_making_and.10.aspx",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41957637",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "நினா டெய்கோல்ஸின் கொழுப்பு குறித்த ஆய்வு சர்ச்சைக்குரியதாக உள்ளது, சத்துணவு அறிவியல் சமூகத்திலிருந்து ஆதாரங்களை தவறாக வெளிப்படுத்தியதாக குற்றச்சாட்டுகள் எழுந்துள்ளன.",
      "முக்கிய ஆராய்ச்சிகள், 2020 கோக்ரேன் மதிப்பீடு போன்றவை, செறிந்த கொழுப்பு உட்கொள்ளுதல் இதய நோய்களுக்கு ஒரு அபாய காரணி என்ற பார்வையை ஆதரிக்கின்றன.",
      "விவாதம் ஊட்டச்சத்து அறிவியலில் உள்ள சவால்களை வலியுறுத்துகிறது, அங்கு நீண்டகால விளைவுகளை ஆய்வு செய்வது கடினம், மற்றும் தவறான தகவல்கள் எளிதில் பரவக்கூடும், தனிப்பட்ட அனுபவங்கள் பல்வேறு ஆரோக்கிய தாக்கங்களை காட்டினாலும்."
    ],
    "points": 123,
    "commentCount": 202,
    "retryCount": 0,
    "time": 1729975892
  },
  {
    "id": 41961034,
    "title": "அமெரிக்காவை ரயிலில் கடக்குதல்",
    "originLink": "https://blinry.org/coast-to-coast/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41961034",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "தூரப்பயண ரயில் பயணம் ஐரோப்பாவில் தாமதங்களால் நம்பகமற்றதாக இருக்கலாம், இது இணைப்புகளை தவறவிடுவதற்கும் நிதி இழப்புகளுக்கும் வழிவகுக்கிறது, இத்தகைய பிரச்சினைகளை உதவ சில ஒப்பந்தங்கள் இருந்தாலும். ஜப்பானின் ரயில் அமைப்பு அதன் திறமைக்காக குறிப்பிடப்படுகிறது, ஆனால் புயல்களைப் போன்ற இயற்கை நிகழ்வுகள் சில நேரங்களில் இடையூறுகளை ஏற்படுத்தலாம். ரயில் பயணம் தனித்துவமான அனுபவங்களையும் காட்சியமைப்புகளையும் வழங்குகிறது, இது சாத்தியமான தாமதங்கள் மற்றும் திட்டங்களில் மாற்றங்களை ஏற்கக்கூடிய பயணிகளுக்கு ஈர்க்கக்கூடியதாக இருக்கிறது."
    ],
    "points": 119,
    "commentCount": 163,
    "retryCount": 0,
    "time": 1730021032
  },
  {
    "id": 41957829,
    "title": "புல்லென்பாதை.காம் சட்ட நடவடிக்கைகள் மிரட்டல்களுக்கு பின் இனி கிடைக்கவில்லை",
    "originLink": "https://bullenweg.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41957829",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "புல்லென்பேக்.காம், ஒரு வேர்ட்பிரஸ் சர்ச்சையை மாட் முல்லென்பேக் எப்படி கையாள்கிறார் என்பதைக் விமர்சிக்கும் ஒரு தளம், சட்ட மிரட்டல்களைத் தொடர்ந்து அகற்றப்பட்டது, இது வேர்ட்பிரஸ்ஸின் உள்ளக பிரச்சினைகளை வெளிப்படுத்துகிறது.",
      "இந்தச் சம்பவம் கருத்துச் சுதந்திரம் குறித்து விவாதங்களை ஏற்படுத்தியுள்ளது, சிலர் முல்லன்வெக் மீது இரட்டை நிலைப்பாடு குற்றம் சாட்டியுள்ளனர், மேலும் அவரது செயல்களுக்கு முக்கியமான கவனம் ஈர்க்கப்பட்டுள்ளது.",
      "தளத்தை அகற்றிய பிறகும், அதன் உள்ளடக்கம் காப்பகங்கள் மூலம் அணுகக்கூடியதாகவே உள்ளது, இது ஸ்ட்ரெய்சாண்ட் விளைவை ஏற்படுத்தக்கூடும், அதாவது தகவலை ஒடுக்க முயற்சிகள் பொதுமக்களின் ஆர்வத்தை அதிகரிக்க மட்டுமே வழிவகுக்கும்."
    ],
    "points": 111,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1729977835
  }
]
