[
  {
    "id": 36183788,
    "timestamp": 1685864218,
    "title": "Why do railway tracks have crushed stones alongside them?",
    "url": "https://www.alpharail.co.nz/why-do-railway-tracks-have-crushed-stones-alongside-them/",
    "hn_url": "http://news.ycombinator.com/item?id=36183788",
    "content": "DESIGNCONSTRUCTIONDIGITAL ENGINEERINGPROJECTSBLOGABOUT USContact usWhy do railway tracks have crushed stones alongside them?Published February 19, 2022It’s probably not something you have ever really thought about, however, the next time you are near a railway track, take a closer look at what sits beneath and alongside a railway track, no matter where you are in the world: crushed stones.These crushed stones are known as ballast, and they serve a number of crucial roles in helping to maintain railway tracks and ensure the safety of the railway vehicles travelling along them.What is track ballast?Track ballast is the name given to the rough, sharp-edged stones that are found underneath and alongside railway tracks. They basically form the track bed on which the sleepers are then laid. The track ballast is initially laid on the bare ground, helping to raise the track level (more on this later). Once the ballast has been laid, the sleepers are put into position at equal distances apart and more track ballast is then packed between the sleepers and to the side, ready for the railway tracks themselves to be laid on top.What is a railway sleeper?A railway sleeper, sometimes known as a “cross tie” in the USA or simply “railroad ties”, are beams that were traditionally made from hardwood that are laid perpendicular to the direction of the track at equal spacing apart. They are extremely heavy, weighing up to 90kgs and you can fit around 2,000 of them for every kilometre of track.Whilst they have traditionally been made from hardwood, heavily trafficked modern railway lines are increasingly turning to manmade alternatives including composite plastic, steel and more commonly pre-stressed concrete.You will still see wooden sleepers in place on railway tracks throughout New Zealand, however, a lot of the new tracks that are being laid, as well as sleeper replacements are being carried out using pre-stressed concrete sleepers.Once the sleepers are laid, the railway track itself it attached to the sleepers. Tracks are not, however, nailed onto the sleepers in a fixed position. The movement caused by heat expansion and contraction along the rail could cause the track to bruckle or break if it was fixed to the sleepers so they are instead attached using clips or anchors that allow for longitudinal movement.The main function of a railway sleeper is to provide a stable, even platform for the railway tracks and the ballast plays a key role in keeping the sleepers stable and level.Why are track ballast stones so sharp?One thing you will notice about the stones used for track ballast is that they are extremely rough and sharp-edged. This is important. If you were to use smooth-sided stones, like the ones you might find in a riverbed or in the ocean, there is a good chance these would roll or slide over each other when a train passes over.The sharp edges of the stones make it very difficult for them to move – they essentially lock into place as the sharp edges cut into each other, helping to create an extremely stable base for the railway sleepers and track to be laid.Benefits of track ballastAs well as providing an extremely sturdy and stable base for the sleepers and track to be laid, track ballast also has a number of other benefits.Railway track designers and engineers are faced with a number of challenges when laying hundreds of kilometres of track, not least of which is creating an even surface for the track to be laid.The steel tracks are subject to a lot of pressure from moving loads, not to mention the impact of the climate and the surroundings. They need to be able to cope with this stress in order to reduce the required maintenance and improve the overall safety of the tracks.Contraction and expansion, ground movement and vibration are all potential issues that could cause defects in the track along with the growth of vegetation and roots from nearby trees and shrubs.Ballast is a great way to protect against a lot of these issues.As well as helping to ensure the track stays in place when heavy trains pass over the tracks, ballast also plays an instrumental role in keeping any vegetation in check that grows nearby, helping to keep the tracks clear of any potential debris but also stunting the growth of any roots that could grown under the track and cause misalignments.Ballast also helps to stop the tracks from flooding. Tracks will often be built up off the bare ground with some foundation that the ballast then sits on. The ballast is a great material with excellent draining properties that helps to ensure tracks do not flood causing track closures and delays. As the water drains away from the tracks, it also ensures the ground beneath the ballast does not become saturated, ensuring a solid foundation for the tracks.SummaryTrack ballast is not a new concept and has in fact been used for centuries with very little change during that time to the way tracks are laid. The ballast distributes the load of the sleepers, which in turn bear the load of the train on the track laid on top of the sleepers.Without the ballast in place, railway lines would simply not be able to cope with the stress from the weight of the trains passing over them, not to mention the impacts of expansion and contraction.So, the next time you are near a railway line and you see the loose stones all around, you will now hopefully have a greater respect for the role they play in getting you safely to your destination.Related articlesThe evolution of railway electrification in New ZealandOverhead Line Electrification (OLE) for RailwaysHow do railway signals work?How do you maintain railway tracks?Share this entry:Continue readingThe evolution of railway electrification in New ZealandRailways are one of the most efficient mode of transportation and have been crucial to the growth and expansion of many western countries. In fact, railways have been an integral part of the social and economic development of New Zealand since as far back as the 1860s. And, although this information has gone relatively unmarked…Read more >Overhead Line Electrification (OLE) for RailwaysAnswers to your 5 most commonly asked questions While electric trains have been around in New Zealand since the early 1900s, they don’t often get much publicity. Consequently, we tend to take them for granted and have little idea of how electric railway systems actually work. Here at Alpha Rail, our goal is to increase…Read more >How do railway signals work?An important aspect of railway design, construction and safety is the signals deployed along the track. Signalling is a crucial part of the railway infrastructure and over the past decade, upgrades to signalling systems on railway networks around the world have helped to improve the overall safety of those rail networks, enabling trains to move…Read more >Get in touch todayWe understand all of the requirements and don't produceanything that can't be built.Contact usEXPLORE THE SITEDesignConstructionDigital DeliveryProjectsBlogAbout UsCONTACT USPO Box 71050, Rosebank, Auckland, 1348+64 098209720admin@alpharail.co.nz© Copyright 2023 - Alpha Rail Ltd.",
    "summary": "- Railway tracks have crushed stones alongside them, known as ballast, which serve a crucial role in maintaining tracks and ensuring the safety of trains.\n- Ballast provides a sturdy and stable base for sleepers and tracks, helps prevent defects in the track caused by contraction, expansion, ground movement, and vegetation growth, and protects against flooding.\n- Without ballast, railway lines would not be able to cope with the stress from the weight of passing trains and the impacts of expansion and contraction.",
    "hn_title": "Why do railway tracks have crushed stones alongside them?",
    "original_title": "Why do railway tracks have crushed stones alongside them?",
    "score": 604,
    "hn_content": "Railway tracks have crushed stones alongside them to prevent fouling, which can result in derailments. These stones help to keep the track straight and level, but vibrations can cause wear and chipping. To prevent this, railway maintenance involves digging and washing the stones every 25 years. This process is called \"ballast cleaning\" and involves sieving, or grading, the stones to remove everything that's under a specific size. There are alternatives to ballasted tracks, such as ballastless tracks that utilize a continuous concrete slab, but they require high upfront costs and longer construction time. High-speed rail tracks typically use continuously welded rails, but still use modern expansion joints to manage tension and compression.Rail tracks experience compressive forces due to temperature and mechanical sources, often leading to buckling, wear on train wheels, and maintenance costs. To address this, maintenance practices aim to anchor the rail at neutral temperature, use expansion gaps, and use ballastless or slab track. However, trade-offs include higher installation costs for ballastless or slab track and reduced elasticity without the ability to replace worn ballast. Railway tracks in hotter countries like Australia and the UK are experiencing issues with welded rails buckling due to global warming and temperature swings. To prevent derailment, track maintenance involves tamping machinesRailways use crushed stones, or ballast, alongside the tracks to provide stability, distribute load, enable drainage, allow for alignment adjustments, dampen noise and vibrations, and make maintenance easier. However, there are concerns about quartz dust from ballast stones causing health issues for workers who are not wearing masks. High-speed tracks use ballastless track, which is more expensive but more reliable and needs less maintenance. Pantographs on electric engines touch overhead wires and the carbon strip on top can wear out every couple of months. Overheads are more like a thick copper bar and have a longer lifespan than the carbon strips. Slab track is an alternative to ballasted track that has a higher construction cost but reduced maintenance cost and a breakeven point after about nine years. No evidence suggests that ballast has been used for railway tracks for centuries.Ballast, or small crushed stones, is used along railroad tracks to provide stability, aid drainage, control vegetation, and distribute train load. It has been in use since the early 18th century and is necessary for railway lines to support the weight of passing trains and cope with expansion and contraction. Tram lines typically have less ballast due to their lighter weight and slower speeds. Proper drainage maintenance is crucial to prevent issues like flooding and water buildup that can lead to catastrophic events. Modern high-speed tracks do not use ballast, opting instead for concrete track beds to prevent \"ballast lifting\" caused by low pressure air below passing trains. Tampers are used to maintain and replace ballast as needed.",
    "hn_summary": "- Railway tracks have crushed stones alongside them to prevent fouling and maintain stability.\n- Maintenance involves ballast cleaning every 25 years and tamping machines to prevent issues like buckling and wear.\n- Alternatives to ballasted tracks include ballastless tracks and slab track, with trade-offs in costs and maintenance needs."
  },
  {
    "id": 36186185,
    "timestamp": 1685891249,
    "title": "Show HN: Rarbg on IPFS",
    "url": "https://ipfs.io/ipfs/QmbpRxBZ5HDZDVRoeAU8xFYnoP4r5eGCxdkmfFW3JbA6mq/",
    "hn_url": "http://news.ycombinator.com/item?id=36186185",
    "content": "RARBG IPFSGetting Started",
    "summary": "- RARBG is a popular torrent website that has been made available on IPFS, which stands for InterPlanetary File System.\n- IPFS is a distributed network protocol that allows for decentralized file-sharing without relying on centralized servers or data centers.\n- This move to IPFS could potentially improve accessibility and stability for RARBG users, as well as provide a more secure and censorship-resistant platform for sharing files.",
    "hn_title": "Show HN: Rarbg on IPFS",
    "original_title": "Show HN: Rarbg on IPFS",
    "score": 575,
    "hn_content": "An IPFS version of Rarbg was shared by a user on Hacker News, containing 826,201 magnets (torrents) with an associated imdb ID and 2,017,490 without. However, the SQLite database may have some glitches when it comes to searching. The database has been categorized into several categories, including XXX, movies, TV, music, and software. The post gave tips on accessing content on IPFS, its limited censorship-resistant properties, and lack of anonymity. Users also shared their experiences with and recommendations for IPFS clients, including Lassie and Fleek. Finally, it was noted that the original Rarbg website had shut down.IPFS users discuss incremental requests, verification of partial reads, and how IPNS is used to update content on the network. They also debate the pros and cons of using IPFS over traditional BitTorrent. One user warns against running SQLite over non-static data, while another asks about finding illegal content hosted on IPFS. Users also share search terms that comply with specific conditions, and discuss the use of DHT for peer discovery.",
    "hn_summary": "- 'Show HN: Rarbg on IPFS', containing 826,201 magnets and categorized into several categories\n- SQLite database may have glitches when searching, and users gave recommendations for IPFS clients \n- Users discuss incremental requests, verification of partial reads, and pros/cons of using IPFS over BitTorrent"
  },
  {
    "id": 36183683,
    "timestamp": 1685862466,
    "title": "DreamBerd is a perfect programming language",
    "url": "https://github.com/TodePond/DreamBerd",
    "hn_url": "http://news.ycombinator.com/item?id=36183683",
    "content": "Announcement: DreamBerd was recently featured on the Future of Code podcast.DreamBerdDreamBerd is a perfect programming language. These are its features!When you've finished reading through all the features, check out the examples.Exclamation Marks!Be bold! End every statement with an exclamation mark!print(\"Hello world\")!If you're feeling extra-bold, you can use even more!!!print(\"Hello world\")!!!If you're unsure, that's ok. You can put a question mark at the end of a line instead. It prints debug info about that line to the console for you.print(\"Hello world\")?You might be wondering what DreamBerd uses for the 'not' operator, which is an exclamation mark in most other languages. That's simple - the 'not' operator is a semi-colon instead.if (;false) {  print(\"Hello world\")!}DeclarationsThere are four types of declaration. Constant constants can't be changed in any way.const const name = \"Luke\"!Constant variables can be edited, but not re-assigned.const var name = \"Luke\"!name.pop()!name.pop()!Variable constants can be re-assigned, but not edited.var const name = \"Luke\"!name = \"Lu\"!Variable variables can be re-assigned and edited.var var name = \"Luke\"!name = \"Lu\"!name.push(\"k\")!name.push(\"e\")!Immutable DataNew for 2023!Mutable data is an anti-pattern. Use the const const const keyword to make a constant constant constant. Its value will become constant and immutable, and will never change. Please be careful with this keyword, as it is very powerful, and will affect all users globally forever.const const const pi = 3.14!NamingBoth variables and constants can be named with any Unicode character or string.const const firstAlphabetLetter = 'A'!var const 👍 = True!var var 1️⃣ = 1! This includes numbers, and other language constructs.const const 5 = 4!print(2 + 2 === 5)! //trueArraysSome languages start arrays at 0, which can be unintuitive for beginners. Some languages start arrays at 1, which isn't representative of how the code actually works. DreamBerd does the best of both worlds: Arrays start at -1.const const scores = [3, 2, 5]!print(scores[-1])! //3print(scores[0])! //2print(scores[1])! //5New for 2022!You can now use floats for indexes too!const var scores = [3, 2, 5]!scores[0.5] = 4print(scores) //[3, 2, 4, 5]!WhenIn case you really need to vary a variable, the when keyword lets you check a variable each time it mutates.const var health = 10!when (health = 0) {  print(\"You lose\")!}LifetimeDreamBerd has a built-in garbage collector that will automatically clean up unused variables. However, if you want to be extra careful, you can specify a lifetime for a variable, with a variety of units.const const name<2> = \"Luke\"! //lasts for two linesconst const name<20s> = \"Luke\"! //lasts for 20 secondsBy default, a variable will last until the end of the program. But you can make it last in between program-runs by specifying a longer lifetime.const const name<Infinity> = \"Luke\"! //lasts foreverVariable hoisting can be achieved with this neat trick. Specify a negative lifetime to make a variable exist before its creation, and disappear after its creation.print(name)! //Lukeconst const name<-1> = \"Luke\"!InstallationTo install DreamBerd to your command line, first install the DreamBerd installer.To install the DreamBerd installer, install the DreamBerd installer installer.New for 2022!Due to the complicated installation process, you can now install the 'Create DreamBerd App' app that installs everything for you!LoopsLoops are a complicated relic of archaic programming languages. In DreamBerd, there are no loops.BooleansBooleans can be true, false or maybe.const var keys = {}!addEventListener(\"keydown\", e => keys[e.key] = true)!addEventListener(\"keyup\", e => keys[e.key] = false)!function isKeyDown(key) => {  if (keys[key] = undefined) {   return maybe!  }  return keys[key]!}Technical info: Booleans are stored as one-and-a-half bits.ArithmeticDreamBerd has significant whitespace. Use spacing to specify the order of arithmetic operations.print(1 + 2*3)! //7print(1+2 * 3)! //9IndentsWhen it comes to indentation, DreamBerd strikes a happy medium that can be enjoyed by everyone: All indents must be 3 spaces long.function main() => {  print(\"DreamBerd is the future\")!}-3 spaces is also allowed.  function main() => {print(\"DreamBerd is the future\")!  }EqualityJavaScript lets you do different levels of comparison. == for loose comparison, and === for a more precise check. DreamBerd takes this to another level.You can use == to do a loose check.3.14 == \"3.14\"! //trueYou can use === to do a more precise check.3.14 === \"3.14\"! //falseYou can use ==== to be EVEN MORE precise!const const pi = 3.14!print(pi ==== pi)! //trueprint(3.14 ==== 3.14)! //trueprint(3.14 ==== pi)! //falseIf you want to be much less precise, you can use =.3 = 3.14! //trueFunctionTo declare a function, you can use any letters from the word function (as long as they're in order):function add (a, b) => a + b!func multiply (a, b) => a * b!fun subtract (a, b) => a - b!fn divide (a, b) => a / b!functi power (a, b) => a ** b!Dividing by ZeroDividing by zero returns undefined.print(3 / 0) // undefinedStringsStrings can be declared with single quotes or double quotes.const const name = 'Lu'!const const name = \"Luke\"!They can also be declared with triple quotes.const const name = '''Lu'''!const const name = \"'Lu'\"!In fact, you can use any number of quotes.const const name = \"\"\"\"Luke\"\"\"\"!Even zero.const const name = Luke!String InterpolationPlease remember to use your regional currency when interpolating strings.const const name = \"world\"!print(\"Hello ${name}!\")!print(\"Hello £{name}!\")!print(\"Hello €{name}!\")!TypesType annotations are optional.const var age: Int = 28!By the way, strings are just arrays of characters.String == Char[]!Similarly, integers are just arrays of digits.Int == Digit[]!If you want to use a binary representation for integers, Int9 and Int99 types are also available.const var age: Int9 = 28!Technical info: Type annotations don't do anything, but they help some people to feel more comfortable.Regular ExpressionsYou can use the regular expression type to narrow string values.const const email: RegExp<(?:[a-z0-9!#$%&'*+/=?^_`{|}~-]+(?:\\.[a-z0-9!#$%&'*+/=?^_`{|}~-]+)*|\"(?:[\\x01-\\x08\\x0b\\x0c\\x0e-\\x1f\\x21\\x23-\\x5b\\x5d-\\x7f]|\\\\[\\x01-\\x09\\x0b\\x0c\\x0e-\\x7f])*\")@(?:(?:[a-z0-9](?:[a-z0-9-]*[a-z0-9])?\\.)+[a-z0-9](?:[a-z0-9-]*[a-z0-9])?|\\[(?:(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9]))\\.){3}(?:(2(5[0-5]|[0-4][0-9])|1[0-9][0-9]|[1-9]?[0-9])|[a-z0-9-]*[a-z0-9]:(?:[\\x01-\\x08\\x0b\\x0c\\x0e-\\x1f\\x21-\\x5a\\x53-\\x7f]|\\\\[\\x01-\\x09\\x0b\\x0c\\x0e-\\x7f])+)\\])> = \"mymail@mail.com\"!To avoid confusion, you can use any spelling that you want, such as 'Regex' or 'RegularExpression'.For simplicity, all supported regular expressions match the regular expression /Reg(ular)?[eE]x(pression|p)?/.PreviousThe previous keyword lets you see into the past!Use it to get the previous value of a variable.const var score = 5!score++!print(score)! //6print(previous score)! //5Similarly, the next keyword lets you see into the future!const var score = 5!after (\"click\") score++!print(await next score)! //6 (when you click)File StructureWrite five or more equals signs to start a new file. This removes the need for multiple files or any build process.const const score = 5!print(score)! //5=====================const const score = 3!print(score)! //3New for 2022!Thanks to recent advances in technology, you can now give files names.======= add.db =======function add(a, b) => {  return a + b!}ExportMany languages allow you to import things from specific files. In DreamBerd, importing is simpler. Instead, you export to specific files!===== add.db ==function add(a, b) => {  return a + b!}export add to \"main.db\"!===== main.db ==import add!add(3, 2)!By the way, to see DreamBerd in action, check out this page.ClassYou can make classes, but you can only ever make one instance of them. This shouldn't affect how most object-oriented programmers work.class Player {  const var health = 10!}const var player1 = new Player()!const var player2 = new Player()! //Error: Can't have more than one 'Player' instance!This is how you could do this:class PlayerMaker {  function makePlayer() => {   class Player {     const var health = 10!   }   const const player = new Player()!   return player!  }}const const playerMaker = new PlayerMaker()!const var player1 = playerMaker.makePlayer()!const var player2 = playerMaker.makePlayer()!NowUse Date.now() to get the current date and time.Date.now()!By the way, you can set the time.// Move the clocks back one hourDate.now() -= 3600000!Important!Please remember to do this when the clocks change.DeleteTo avoid confusion, the delete statement only works with primitive values like numbers, strings, and booleans.delete 3!print(2 + 1)! // Error: 3 has been deletedDreamBerd is a multi-paradigm programming language, which means that you can delete the keywords and paradigms you don't like.delete class!class Player {} // Error: class was deletedWhen perfection is achieved and there is nothing left to delete, you can do this:delete delete!OverloadingYou can overload variables. The most recently defined variable gets used.const const name = \"Luke\"!const const name = \"Lu\"!print(name)! // \"Lu\"Variables with more exclamation marks get prioritised.const const name = \"Lu\"!!const const name = \"Luke\"!print(name)! // \"Lu\"const const name = \"Lu or Luke (either is fine)\"!!!!!!!!!print(name)! // \"Lu or Luke (either is fine)\"SignalTo make a signal, use use.const var score = use(0)!When it comes to signals, the most important thing to discuss is syntax.In DreamBerd, you can set (and get) signals with just one function:const var score = use(0)!score(9)! // Set the valuescore()? // Get the value (and print it)Alternatively, you can be more explicit with your signal syntax, by splitting it into a getter and setter.const var [getScore, setScore] = use(0)!setScore(9)! // Set the valuegetScore()? // Get the value (and print it)Technical info: This is pure syntax sugar. The split signal functions are exactly the same as before.const var [getScore, setScore] = use(0)!getScore(9)! // Set the valuesetScore()? // Get the value (and print it)Of course, this means that you can carry on splitting as much as you like...const var [getScore, setScore] = use(0)!const var [retrieveScore, updateScore] = getScore!const var [calculateScore, assignScore] = updateScore!Signal SugarThe great thing about signals is that they let you work in real DreamBerd, instead of relying on frameworks.For this reason, there's some additional syntax sugar that gets compiled away in a build step.You can use signals as if they're just a value.const var score = use(0)!score = 9!print(score)! // 9If you want to be more explicit, you can use the value property instead.const var score = use(0)!score.value = 9!print(score.value)! // 9Technical info: The value property doesn't do anything. It just returns the signal again.const var score = use(0)!score.value(9)! // Set the valuescore.value()? // Get the value (and print it)score.value.value = 99!print(score.value.value.value)! // 99AIDreamBerd features AEMI, which stands for Automatic-Exclamation-Mark-Insertion.If you forget to end a statement with an exclamation mark, DreamBerd will helpfully insert one for you!print(\"Hello world\") // This is fineSimilarly... DreamBerd also features ABI, which stands for Automatic-Bracket-Insertion.If you forget to close your brackets, DreamBerd will pop some in for you!print(\"Hello world\" // This is also fineSimilarly.... DreamBerd also features AQMI, which stands for Automatic-Quotation-Marks-Insertion.If you forget to close your string, DreamBerd will do it for you!print(\"Hello world // This is fine as wellThis can be very helpful in callback hell situations!addEventListener(\"click\", (e) => {  requestAnimationFrame(() => {    print(\"You clicked on the page        // This is fineSimilarly..... DreamBerd also features AI, which stands for Automatic-Insertion.If you forget to finish your code, DreamBerd will auto-complete the whole thing!print( // This is probably finePlease note: AI does not use AI. Instead, any incomplete code will be auto-emailed to Lu Wilson, who will get back to you with a completed line as soon as possible.Now recruiting: The backlog of unfinished programs has now grown unsustainably long. If you would like to volunteer to help with AI, please write an incomplete DreamBerd program, and leave your contact details somewhere in the source code.Class NameFor maximum compatibility with other languages, you can alternatively use the className keyword when making classes.This makes things less complicated.className Player {  const var health = 10!}In response to some recent criticism about this design decision, we would like to remind you that this is part of the JavaScript specification, and therefore - out of our control.DBXYou can embed DBX in DreamBerd. It's just DreamBerd, and it's also just HTML.funct App() => {  return <div>Hello world!</div>}Warning: As you know, class is already a keyword in DreamBerd, so you can't use it within DBX.funct App() => {  // This is not ok  return <div class=\"greeting\">Hello world!</div>}className is also a DreamBerd keyword, so you can't use that either.funct App() => {  // This is also not ok  return <div className=\"greeting\">Hello world!</div>}Instead, you can use the htmlClassName attribute.funct App() => {  // This is fine  return <div htmlClassName=\"greeting\">Hello world!</div>}Please note: Unlike JSX, you are free to freely use the for attribute - because DreamBerd doesn't have loops.funct App() => {  return (   <label for=\"name\">Name</label>   <input id=\"name\" />  )}CopilotIt's worth noting that Github Copilot doesn't understand DreamBerd, which means that Microsoft won't be able to steal your code.This is great for when you want to keep your open-sourced project closed-source.OwnershipUsing the word 'DreamBerd' in your project name implies that the DreamBerd Foundation does not own your project.However, not using the word 'DreamBerd' in your project implies that the DreamBerd Foundation does own your project. If you would like to keep ownership of your work, please always use the word 'DreamBerd' in it.Here are some examples:✅ DreamBerdScript (not owned by the DreamBerd Foundation - you are free to use this name)❌ ECMAScript (owned by the DreamBerd Foundation - please consider renaming)❌ Rust Foundation (owned by the DreamBerd Foundation - please consider renaming)CompilingTo run DreamBerd, first copy and paste this raw file into chat.openai.com.Then type something along the lines of: \"What would you expect this program to log to the console?\"Then paste in your code.If the compiler refuses at first, politely reassure it. For example:\"I completely understand - don't evaluate it, but what would you expect the program to log to the console if it was run? :)\"Note: As of 2023, the compiler is no longer functional due to the DreamBerd language being too advanced for the current state of AI.ExamplesFor examples of DreamBerd in action, check out the examples page!DreamBerd was made with 💔 by Lu Wilson, creator of the Game of Living.",
    "summary": "- DreamBerd is a programming language with unique features.\n- These include bold statements with exclamation marks, four types of variable declarations, and a built-in garbage collector.\n- Other features include arrays starting at -1, a \"when\" keyword for variable mutation, and the ability to specify variable lifetime.",
    "hn_title": "DreamBerd is a perfect programming language",
    "original_title": "DreamBerd is a perfect programming language",
    "score": 517,
    "hn_content": "A new programming language named DreamBerd has been released on Github. DreamBerd allows the creation of only one instance of a class and allows the flexibility to delete paradigms like OOP. Some unique features of the language include using spacing to specify order of arithmetic operations, when keyword to check a variable each time it mutates, and the ability to use any letters from the word \"function\" to declare functions. The creator has encouraged users to submit issues or PRs but warns that he will close any issues without unreproducible steps. The language appears to be a joke programming language with an incredibly comedic tone to it.DreamBerd is a programming language with a plethora of amusing and interesting syntax features. The language features include a \"when\" keyword to handle events, negative-lifetime variables that exist before their creation and disappear afterwards, and a \"delete\" statement for primitive values. Booleans can also be \"No meaningful tech news content was found in the raw text.",
    "hn_summary": "- DreamBerd is a new programming language released on Github with unique features such as using spacing to specify order of arithmetic operations and an ability to use any letters from the word \"function\" to declare functions.\n- The language allows the creation of only one instance of a class and flexibility to delete paradigms like OOP.\n- Although it appears to be a joke programming language with a comedic tone to it, creator encourages users to submit issues or PRs."
  },
  {
    "id": 36186176,
    "timestamp": 1685891211,
    "title": "Anything can be a message queue if you use it wrongly enough",
    "url": "https://xeiaso.net/blog/anything-message-queue",
    "hn_url": "http://news.ycombinator.com/item?id=36186176",
    "content": "A post humorously suggests a way to bypass the high cost of AWS' Managed NAT Gateway service by using S3, TUN devices, and cardio. S3 lets you allocate and store arbitrary bytes in the cloud as if the cloud were a malloc(), IPv6 packets are just bytes and can be processed like any other, and TUN devices let software control network or datagram links. Cardio allows rate adjustment depending on the workload. The end result is a tool called Hoshino that puts outgoing IPv6 packets into S3 and retrieves incoming packets to avoid Managed NAT Gateway. The post warns against using Hoshino to produce workloads and is intended merely as an educational piece.- A Terraform module was used to automate creating IAM users and security policies on a network on AWS\n- A policy document caused an issue with writing and reading from a bucket but was fixed by allowing access to every file in the bucket\n- The author successfully managed to send ping packets and open TCP connections over Amazon S3\n- The architecture has many advantages for cross-region communication, but it becomes hilariously expensive when counting all S3 operations\n- UDP may be more reliable than it should be with appropriate timeouts and retries\n- The author created a unique legal conflict by creating something that will ultimately be owned by their employer\n- The author plans to use the basic technique of Hoshino as a replacement for DERP in the future.",
    "summary": "- A post humorously suggests using S3, TUN devices, and cardio to bypass the cost of AWS' Managed NAT Gateway service\n- The resulting tool called Hoshino puts outgoing IPv6 packets into S3 and retrieves incoming packets, providing cross-region communication that is hilariously expensive in terms of S3 operations\n- The post warns against using Hoshino to produce workloads and is intended merely as an educational piece.",
    "hn_title": "Anything can be a message queue if you use it wrongly enough",
    "original_title": "Anything can be a message queue if you use it wrongly enough",
    "score": 482,
    "hn_content": "A Hacker News post discusses how using a tool in unexpected ways can lead to new business ideas; a chat infrastructure tool was repurposed to create Firebase Realtime Database. Other anecdotes shared include using a MySQL database to replace a message queue, and using a file system for message queues due to its ease of implementation. Commenters also discuss the importance of understanding client needs, and the limitations and benefits of using different message queue solutions.Developers discuss using a single-file configuration system to store and distribute configuration values across multiple languages and bash scripts. They note potential issues with multiple processes, bottleneck situations, and the advantages and disadvantages of using a database or email as a message queue. While some see this method as a useful solution, others suggest it may be reinventing an old wheel or causing unforeseen issues. Overall, the conversation is a reminder that there are multiple ways to approach configuration management, and developers should carefully evaluate their options based on their specific needs.The discussion thread covers several topics related to message queues and some tangential topics, such as:\n\n- The strengths and weaknesses of email as a protocol for transporting data\n- Unconventional message queue implementations, including using Qmail, Slack, and file systems\n- Historical and alternative message queuing systems, like ebXML and spool directories\n- Anecdotes about using complicated, seemingly unnecessary systems to accomplish simple tasks\n- Technical details of accessing different types of memory in software\n- Jokes and humor intertwined with technical discussion\n\nOverall, the post is noteworthy for its diverse perspectives on messaging systems.The post is about creating a TUN/TAP device-based virtual network using AWS S3 instead of traditional VPN services. The article includes cartoon visuals and witty comments, which some readers appreciate. Some comments praise the article for being engaging and informative, while others criticize it for being too long or difficult to read. The article explains the concept of S3-based tun/tap virtual network devices, and the author uses the Socratic method in dialogues to explain the technical details. Some readers suggest creating a glossary of technical terms for better comprehension. Finally, some readers comment on the name of the tar command, which stands for \"Tape ARchive,\" and its relevance today.",
    "hn_summary": "- Discussion on unconventional message queue implementations, including email and file systems\n- Mention of historical and alternative message queuing systems\n- Humorous comments intertwined with technical discussion"
  },
  {
    "id": 36186080,
    "timestamp": 1685890603,
    "title": "High prices make textbook 'piracy' acceptable to most students",
    "url": "https://torrentfreak.com/high-prices-make-textbook-piracy-acceptable-to-most-students-230604/",
    "hn_url": "http://news.ycombinator.com/item?id=36186080",
    "content": "HOME > PIRACY RESEARCH >Through several lawsuits, Danish publishers tried to send a clear message: educating oneself through pirated textbooks is illegal. This message has thus far failed to make an impact. New research published by the Rights Alliance shows that more than half of all students find it acceptable to use pirated books. Prison threats are not much of a deterrent but they are willing to change if prices drop significantly.Studying can be a costly endeavor. Aside from the party budget, there are books and tuition fees to pay as well.To reduce costs, some students choose to share books or buy cheaper second-hand versions. Others go a step further and venture onto the dark side, by downloading or even buying ‘pirated’ books.These cost-saving tactics are nothing new. A few decades ago, copying machines at universities were already duplicating copyrighted works every day of the week. However, with digital books becoming more common, copying has become a breeze. This is a form of progress that publishers are not happy with.Danish Deterrent?Textbook piracy is happening around the globe. While enforcement is relatively rare, in Denmark several students have been convicted for selling pirated copies of textbooks. Publishers hoped that these cases would act as a deterrent but there are no signs that this is the case.Danish anti-piracy group Rights Alliance recently published a new study, conducted by Epinion, which polled the attitudes and behaviors of students towards digital textbooks. In particular, those that are obtained illegally.There have been several of these surveys over the years, which makes it possible to see how patterns change over time. In this case, things aren’t trending in the right direction. Despite lawsuits and public calls to avoid piracy, students continue to obtain unlicensed books from various sources.50% Obtain Textbook IllegallyOf all the students that used digital textbooks (84%), half admit to having used at least some ‘pirated’ copies. This number has been relatively stable since 2020 and doesn’t seem to be impacted by recent prosecutions and fines handed out by the courts.This relatively high percentage doesn’t mean that students are oblivious to the law; 70% admit to knowing that piracy is illegal.How many books are obtained illegally can differ quite a bit. For some, it’s just a book or two, but one in four of the ‘pirating’ students acquire more than half of all textbooks through unofficial sources. And 7% of these students obtain between 91% and 100% of their books illegally.Jail Threat Doesn’t Scare StudentsRights Alliance stresses that educational institutions have a role to play. They should put more effort into educating students on the subject, an issue that’s often overlooked.“There is a concrete need for educational institutions to be sharper in their communication to students in this area,” says Rights Alliance director Maria Fredenslund.“When management, teachers and tutors on the programs distance themselves from illegal sharing of study books, it has a concrete effect on the social norms within the programs,” she adds.The question is whether this will make a massive difference. The majority of the survey respondents were already aware of the illegal nature of book ‘piracy’ but continue anyway. Apparently it goes a long way towards saving costs.This is also reflected in the research, which found that only 18% would consider reducing their illegal textbook habits if they risked jail time. In addition, a lack of support from one’s social circle would only motivate 11% to reconsider.It’s All About the MoneyThere is one key element that would sway students to go legal and that is price. The survey found that roughly half of the pirating students would purchase books if prices were significantly reduced.To convince the majority of this group to change their behavior, prices should be at least 50% cheaper than they are now. This is probably not the solution publishers are looking for, however.In addition to slashing prices, better access to digital books through official libraries is also mentioned as a solution by many students. Again, this is another way to reduce costs.All in all the research shows that it will be hard to stop textbook piracy as long as the legal alternatives are considered unaffordable. Prosecuting more people and launching awareness campaigns may convince some to change their habits but, for the majority, it’s all about the money.",
    "summary": "- More than half of students find it acceptable to use pirated textbooks, according to a new study by Danish anti-piracy group Rights Alliance.\n- While 70% of students admit to knowing that piracy is illegal, 50% of those who use digital textbooks have used pirated copies and this number has remained stable since 2020.\n- The majority of students would consider purchasing books legally if prices were significantly reduced, with better access to digital books through official libraries also mentioned as a solution.",
    "hn_title": "High prices make textbook ‘piracy’ acceptable to most students",
    "original_title": "High prices make textbook ‘piracy’ acceptable to most students",
    "score": 399,
    "hn_content": "Textbook piracy has become an acceptable practice among most American students facing high material costs. A Hacker News user discusses their own experience sharing DC server access with a friend and book scanning to make available a trove of available digital books with others, along with a pining for the bygone days of university hacker culture. Commenters shared similar experiences, with some universities even providing pirated materials themselves via course packs, distributing materials via electronic means, or professors distributing scanned texts. Users share stories of price-gouged course materials, suggesting that universities could bypass the issue by making textbooks free for students via bundled tuition expenses.The post discusses the issue of high textbook costs in universities and how some professors require students to purchase textbooks they have authored, leading to conflicts of interest. Some commenters suggest that bundling mandatory costs like textbooks into tuition fees could be a solution while others argue that textbooks are not always necessary. The post highlights the issue of higher education being a profit-driven industry and questions the ethics of universities treating students as customers. Overall, the post focuses on the issue of transparency and ethics in higher education.US Department of Transportation requires airlines and travel agencies to advertise the total price, including all applicable taxes and fees, that consumers pay for purchasing a ticket, whereas in some European countries advertising restrictions are enforced where inventory should be available at the advertised low price. Some university professors provide free materials, but mandatory introductory classes often require expensive textbooks. Universities could solve these problems by having a price-cap on student textbooks, or including textbook prices in the tuition. The current model incentivizes universities and publishers, not professors, to push for more expensive textbooks and other add-ons. However, this problem continues because university administrators allow this situation and because they follow the ideology of using markets as solutions.Some commenters discuss the idea of bundling materials such as textbooks into tuition costs. Several individuals have had positive experiences with institutions that already do this. One commenter argues that bundling could incentivize professors to publish their own textbooks, but others suggest alternative solutions such as using open-source curriculum or limiting the ability for professors to require specific textbooks. The high cost of textbooks and the potential for professors to profit off requiring them is a central issue discussed in these comments. There are also mentions of the need for reform in the higher education system and the role of government in addressing these problems.Students are being exploited by the textbook industrial complex, with publishers leveraging digital technology to prevent resale and duplication and extracting money from young people. The move to digital textbooks was supposed to cut costs but instead led to license keys and other ways to prevent used book purchases. The system exploits students who are too naive to resist or have no alternative materials. Some colleges and universities are attempting to mitigate costs by writing open source books and sharing them with other schools. The education system in North America is expensive, with almost no regulations and political parties partially responsible. Young people feel exploited and turn to pirated copies when they realize they're being used for cash.An exchange on Hacker News discusses the cost of goods and services in the US. The cost of gas is considered comparatively cheap, although one commenter notes that taxes on gas are higher in other countries. The cost of food is debated, with one commenter arguing that it isn't cheap and its quality is questionable. Textbooks are a significant expense for students, and many commenters discuss the high cost, proprietary formats, and poor user experiences of digital platforms owned by textbook publishers. Many express frustration with professors and universities for not doing more to combat textbook prices. Some commenters express support for piracy as a way to combat the high cost of textbooks, while others suggest alternative models for distributing course materials.The comments discuss the high cost of textbooks and the prevalence of textbook piracy. Many commenters suggest solutions that include using open-source textbooks, creating public domain textbooks, and mandating that public universities use open textbooks. Some commenters mention innovative companies like Perlego that offer a Netflix-style model for accessing textbooks for a lower fee. There is also discussion of the legality of textbook piracy in different countries, with some countries explicitly allowing it. Some commenters suggest that textbooks are unnecessarily expensive and that governments and universities should provide more accessible materials to students. Overall, the comments present a view that textbooks are overpriced and that alternative solutions are needed to make knowledge more accessible to students.No meaningful content to provide a summary.",
    "hn_summary": "- Textbook piracy is prevalent among American students due to high material costs.\n- Some universities provide pirated materials themselves, and professors require students to buy textbooks they have authored, leading to conflicts of interest.\n- Commenters suggest solutions such as bundling textbook costs into tuition fees, using open-source or public domain textbooks, and government intervention to make knowledge more accessible to students."
  },
  {
    "id": 36187550,
    "timestamp": 1685900004,
    "title": "WFH – Watched from Home: Office 365 & workplace surveillance creep (2022)",
    "url": "https://privacyinternational.org/long-read/4909/wfh-watched-home-office-365-and-workplace-surveillance-creep",
    "hn_url": "http://news.ycombinator.com/item?id=36187550",
    "content": "",
    "summary": "- The article discusses how the shift to remote work during the COVID-19 pandemic has led to increased use of workplace surveillance software by companies, including Office 365's productivity monitoring tool.\n- It highlights concerns about the potential privacy violations and negative impacts on employee well-being that can result from such monitoring.\n- The article suggests that companies should prioritize transparency and employee consent when implementing workplace surveillance measures.",
    "hn_title": "WFH – Watched from Home: Office 365 and workplace surveillance creep (2022)",
    "original_title": "WFH – Watched from Home: Office 365 and workplace surveillance creep (2022)",
    "score": 386,
    "hn_content": "A discussion on the growing concerns of workplace surveillance from an article published on Privacy International. While monitoring software and security inspection are not new, sensors that detect warm bodies are being utilized to track employees working from home as well. Readers discussed the concept of surveillance in the workplace, pointing out the difference in regulations between Europe and the USA. Some say good businesses care about work accomplished while bad businesses use surveillance to squeeze productivity rather than promote it. Regulations determine overtime pay, and employees can forfeit the option if they choose to work longer hours. However, many are arguing for universal income to give people flexibility to pursue better jobs without jeopardizing their current situations.The debate surrounding universal basic income (UBI) is discussed in a multi-faceted conversation on Hacker News. Some argue that focusing on worker's rights and labor regulations is a better solution than UBI, which they believe would discourage work and decrease productivity. Others argue that happy and healthy non-working people contribute more to society than unhappy or unhealthy working people. The conversation also explores the fairness of UBI in terms of the distribution of resources, as well as potential issues with increasing rent prices and the need for rent control. Finally, some argue that most UBI experiments have been limited in nature, and that there are certain economic and human nature factors that make it difficult to implement a successful UBI system.The writer discusses the societal perception of work as being synonymous with being employed for someone else, and the dismissal of labor that benefits families and communities. The lack of a \"proper job\" can destroy people's sense of value and diminishes the value of other types of relationships. The writer questions how we can build a society where people's needs are met and contribute to a more egalitarian society without coercion. There is a discussion about the potential for a post-scarce society where UBI could succeed. The comment section includes debates on the morality of work and the effectiveness of UBI, including how it can shift power dynamics in the workplace.- Universal basic income (UBI) provides a monthly income regardless of employment status.\n- UBI could replace current welfare schemes, but its implementation would require massive amounts of additional funding to be livable.\n- Low-tier jobs may only provide a small premium over UBI, causing people to opt out of working.\n- Employers may be taxed more to fund UBI, causing them to hire fewer workers or raise prices, leading to inflation.\n- UBI hasn't been tested or demonstrated on a large scale, leaving many questions unanswered.\n- Good businesses care if work is getting accomplished but should focus on guidelines rather than rules.\n- Surveillance is an issue in the workplace, but humans will always find ways to exploit metrics. \n- Productivity metrics are difficult to evaluate and should only be considered as indicators at best.The post discusses measuring productivity in the workplace but ends up focusing on the topic of employee surveillance. Some argue that measuring output is a more reliable method than tracking keyboard and mouse activity. However, others have concerns about the fairness and effectiveness of measuring productivity in such a way. The discussion also touches on the use of monitoring software by employers and the potential invasion of employee privacy. Some commenters express surprise and concern about being monitored to such an extent, while others acknowledge that some level of monitoring is necessary for security reasons.Employee monitoring software demand surged by 108% in April and 70% in May 2020, but it is unclear how many companies already had it installed. The increase in demand is based on internet searches and does not necessarily indicate actual usage. Employees are encouraged to use company-provided devices and accounts to maintain privacy and security. Microsoft's Office 365 has raised concerns about employee surveillance via the \"productivity\" analytics and linked LinkedIn account options. While monitoring can be used for legitimate purposes, there are concerns about privacy invasion and abuse. Some suggest using separate network hardware, such as VLANs or guest WiFi, to isolate work devices and avoid mixing personal and work data.Employees working with Microsoft's Office 365 software can have their activities monitored by companies employing the technology, including which device they join meetings on. Among the metrics available are user profiling, time spent on micro-content, traffic on home networks and even the length of time taken to read a memo. However, some have viewed the practice as a gross invasion of privacy, with others pointing out that it highlights issues within modern management practices. The metrics can be used to detect employee work behaviour – and potential slackness – with a goal of increasing productivity. But some feel this is the wrong approach to improving work practices.A discussion thread on Hacker News regarding remote work and surveillance. \nDaily standups can be performed via Slack, but may still be considered noise and micromanaging. \nIssues with data metrics and decision making based on incomplete information. \nEmployers have the legal right to monitor work done on company equipment. \nDiscussion on creating robotic systems to masquerade as employees. \nConcerns about how businesses may use surveillance technology. \nDebate over whether remote work is a new form of slavery.",
    "hn_summary": "- Workplace surveillance is a growing concern for employees working from home, with sensors being utilized to track employees.\n- The debate surrounding universal basic income (UBI) is explored, with arguments for and against its implementation.\n- The writer questions societal perceptions of work and the value of other types of relationships."
  },
  {
    "id": 36187705,
    "timestamp": 1685901021,
    "title": "Popular Subreddits are organizing a strike on 2023-06-12 b/c high API prices",
    "url": "https://old.reddit.com/r/LifeProTips/comments/140b6q6/rlifeprotips_will_be_going_dark_from_june_1214_in/",
    "hn_url": "http://news.ycombinator.com/item?id=36187705",
    "content": "The Reddit API changes could kill many third-party apps, making features not seen in the official mobile app permanently inaccessible to users. This includes tools needed by many subreddit moderators to keep their communities spam-free and on-topic. Reddit will raise the price for calling their API to a level that will kill every third-party app on Reddit, from Apollo to Reddit is Fun. Therefore, many subreddits will be going dark from June 12-14 to protest this policy. The two-day blackout isn't the end; should things reach the 14th, many subreddits are prepared to go dark indefinitely. To support this change, the users could provide complaints and even boycott Reddit on June 12th through the 13th.",
    "summary": "- Reddit is increasing the price of their API, which will make many third-party apps unusable and remove critical features for subreddit moderators.\n- Many subreddits are planning to go dark from June 12-14 to protest this policy, with the possibility of an indefinite blackout if necessary.\n- Users can support this change by providing complaints and boycotting Reddit on June 12th and 13th.",
    "hn_title": "Popular Subreddits are organizing a strike on 2023-06-12 b/c high API prices",
    "original_title": "Popular Subreddits are organizing a strike on 2023-06-12 b/c high API prices",
    "score": 353,
    "hn_content": "On June 12, 2023, popular subreddits are organizing a strike in response to high API prices. Some users are calling for a return to the decentralized internet of the 90s when individuals had control over their own content. Many commenters discuss the difficulty of creating a successful alternative to large social media platforms like Reddit, citing the importance of community and niche interests. The potential challenges include hosting costs, moderation, and building a user base. Some mention existing alternatives such as Lemmy and Mastodon, and the value of communities like r/personalfinance. Others express frustration with Reddit's policies and moderation practices, leading some to hope for its downfall.Developing an alternative to Reddit is challenging due to the critical mass required to prevent users from moving back to Reddit, a unique moat known as the network effect. Furthermore, the legal aspects of handling user-generated content add complexity, and hosting the content could be done using new decentralized systems like Mastodon, Nostr, or Bluesky. However, such systems invite the cost of spam, moderation, and low-quality content, which does not scale for humans alone. Reddit's third-party API policy changes would remove the features and workflows from veteran users and private moderators who rely on third-party apps for their work. Without third-party clients, such users are likely to stop or dramatically reduce their usage of Reddit. Heavy usage by such groups results in a concentrated but valuable audience for third-party apps.An individual built an alternative social media application, FlingUp.com, in response to the poor moderation in Reddit's mobile app. The primary issue with alternative platforms like FlingUp.com,  notabug.io, and others is that the initial users are exceptionally hostile, which leads to bad experiences for early adopters resulting in stunted growth. A good alternative, in general, must offer fun elements, according to some users. However, the business model of big tech companies is not user-centric, but investor-centric, making it hard to replace them entirely, according to some. Furthermore, coordinated strikes from users and moderators against big tech companies like Reddit cannot cause a practical impact. Finally, the ultimate goal of a social media platform is to provide freedom of choice and expression while permitting communities to form and moderate their content independently.Tech users and moderators of Reddit have recently organized a strike in protest of the platform's new paid API service, which may hurt small developers. Some users argue that the power mods are part of the problem with Reddit. There is discussion of taking action to build open protocols instead of programs and encouraging the trend towards less reliance on public-facing websites. Some users suggest creating a read-only API proxy and using official mobile app APIs to circumvent Reddit's paywall. There is also debate over who owns the content generated on social media platforms and the rights of both users and platforms.- GDPR guidelines do not require forums to take down content but changing usernames to random strings can remove personal ties\n- Some users discuss the effectiveness of a one-day strike and express opinions on Reddit as a platform for prostitution\n- One user sees the situation as an opportunity to start new subreddits with more serious content and hopes it will discourage childish behavior from the platform's leadership\n- No new technology or release is discussed in this post",
    "hn_summary": "- Popular subreddits are organizing a strike on June 12, 2023, to protest against high API prices.\n- Developing a successful alternative to platforms like Reddit is challenging due to hosting costs, moderation, and building a user base.\n- Reddit's third-party API policy changes would remove features and workflows, affecting veteran users and private moderators who rely on third-party apps for their work."
  },
  {
    "id": 36184400,
    "timestamp": 1685873219,
    "title": "Apple Virtualization Framework",
    "url": "https://developer.apple.com/documentation/virtualization",
    "hn_url": "http://news.ycombinator.com/item?id=36184400",
    "content": "PlatformsiOSiPadOSmacOStvOSwatchOSToolsSwiftSwiftUISwift PlaygroundsTestFlightXcodeXcode CloudSF Symbols",
    "summary": "- Apple Virtualization Framework allows users to test their software on multiple devices without actually having access to the hardware.\n- The platform includes support for various Apple devices and tools such as iOS, macOS, watchOS and Swift.\n- This allows developers to test their apps on different devices and simulate different scenarios for optimal performance.",
    "hn_title": "Apple Virtualization Framework",
    "original_title": "Apple Virtualization Framework",
    "score": 296,
    "hn_content": "Apple's Virtualization Framework, which allows for running Linux and macOS guests, is a convenient but buggy option with limited device support. Some users have found that other Virtual Machine Monitors, like QEMU, can be faster and more reliable. However, third-party options are limited due to Apple's restrictions on setting necessary CPU flags for Rosetta. Users have found success with using the framework in conjunction with tools like UTM and Docker Desktop for macOS. Some features like dynamic memory allocation have been noted as significant benefits. Despite limitations, developers are intrigued by the potential for the framework, especially for the flexibility it could provide in running multiple platforms on a Mac.Apple's Virtualization Framework makes it simple to build VMs using Virtio peripherals, which includes a display, and the project supports hosting third-party images. The software runs tasks such as networking, as well as it operates with multiple operating systems, including macOS and Linux. Still, while the framework is useful, some developers run into issues with non-ANSI keyboards, and it lacks support for functions such as USB pass-through and snapshots. However, users can create their own apps on top of the framework. Also, Apple provides code samples that enable users to create VMs. Docker tried to leverage the technology, but it experienced degraded disk performance. Finally, the software simplifies the ability to run multiple VMs on Apple hardware, for example, running Linux snaps and x86 images on Apple silicon.- Discussion about using open-source vs. COTS products for tech\n- MacOS restore images can be obtained from Apple's website or created in the system\n- Issues with cloning the system on USB sticks due to the secure enclave and Carbon Copy Cloner crashing the system\n- Mention of virtualizing macOS inside macOS for testing on older OS releases\n- No significant updates or new information in the discussion\n- Virtualization framework is a library for developers, not a complete solution like WSL2.",
    "hn_summary": "- Apple's Virtualization Framework allows for running Linux and macOS guests but has limited device support and is buggy.\n- Third-party options are limited due to Apple's restrictions on necessary CPU flags for Rosetta.\n- Developers are still intrigued by the potential for the framework in running multiple platforms on a Mac."
  },
  {
    "id": 36185173,
    "timestamp": 1685882490,
    "title": "Lung cancer pill cuts risk of death by half",
    "url": "https://www.theguardian.com/science/2023/jun/04/lung-cancer-pill-cuts-risk-of-death-by-half-says-thrilling-study",
    "hn_url": "http://news.ycombinator.com/item?id=36185173",
    "content": "The survival benefit of osimertinib ‘was observed consistently’ in an analysis across all study subgroups, the study says. Photograph: utah778/Getty Images/iStockphotoCancer researchLung cancer pill cuts risk of death by half, says ‘thrilling’ studyTaking the drug osimertinib once a day after surgery reduces chance of patients dying by 51%, trials showAndrew Gregory Health editor in Chicago@andrewgregorySun 4 Jun 2023 08.00 EDTLast modified on Sun 4 Jun 2023 10.22 EDTA pill taken once a day cuts the risk of dying from lung cancer by half, according to “thrilling” and “unprecedented” results from a decade-long global study.Taking the drug osimertinib after surgery dramatically reduced the risk of patients dying by 51%, results presented at the world’s largest cancer conference showed.Lung cancer is the world’s leading cause of cancer death, accounting for about 1.8 million deaths a year. The results of the late-stage study, led by Yale University, were presented at the American Society of Clinical Oncology’s (Asco) annual meeting in Chicago.“Thirty years ago, there was nothing we could do for these patients,” said Dr Roy Herbst, the deputy director of Yale Cancer Center and lead author of the study. “Now we have this potent drug.“Fifty per cent is a big deal in any disease, but certainly in a disease like lung cancer, which has typically been very resistant to therapies.”The Adaura trial involved patients aged between 30 and 86 in 26 countries and looked at whether the pill could help non-small cell lung cancer patients, the most common form of the disease.Everyone in the trial had a mutation of the EGFR gene, which is found in about a quarter of global lung cancer cases, and accounts for as many as 40% of cases in Asia. An EGFR mutation is more common in women than men, and in people who have never smoked or have been light smokers.Speaking in Chicago, Herbst said the “thrilling” results added huge weight to earlier findings from the same trial that showed the pill also halves the risk of a recurrence of the disease.Herbst, the assistant dean for translational research at Yale School of Medicine, said the pill was proven to be “practice-changing” and should become the “standard of care” for the quarter of lung cancer patients worldwide with the EGFR mutation.Some patients in the UK, US and other countries are already able to access the drug, he said, but more should benefit.Not everyone diagnosed with lung cancer is tested for the EGFR mutation, which needs to change, Herbst said, given the study’s findings. “This further reinforces the need to identify these patients with available biomarkers at the time of diagnosis and before treatment begins.”Treatment after surgery with osimertinib, also known as Tagrisso and made by AstraZeneca, “significantly lowered” the risk of death in lung cancer patients, the trial results reported. “Adjuvant osimertinib demonstrated an unprecedented, highly statistically significant and clinically meaningful overall survival benefit in patients,” the report said.After five years, 88% of patients who took the daily pill after the removal of their tumour were still alive, compared with 78% of patients treated with a placebo. Overall, there was a 51% lower risk of death for those who received osimertinib compared with those who received placebo.The survival benefit “was observed consistently” in an analysis across all study subgroups, including those with stage one, stage two and stage three lung cancer. Chemotherapy had been given to 60% of those in the study, and the survival benefit of osimertinib was seen regardless of whether prior chemotherapy was received.“It is hard to convey how important this finding is and how long it’s taken to get here,” said Dr Nathan Pennell, an Asco expert who was not involved with the study. “This shows an unequivocal, highly significant improvement in survival.”Breast cancer drug cuts risk of most common form returning by 25%Read moreAbout two-thirds of the 682 patients in the trial were women. About two-thirds of patients also had no history of smoking, which suggested the pill works for smokers and non-smokers diagnosed with lung cancer.Angela Terry, the chair of EGFR Positive UK, a lung cancer charity, said the findings were “very exciting” and “hugely significant”.“A five-year overall survival rate of 88% is incredibly positive news,” she said. “Having access to a drug whose efficacy is proven and whose side-effects are tolerable means patients can be confident of and able to enjoy a good quality of life for longer.”TopicsCancer researchLung cancerCancerMedical researchHealthnewsReuse this contentMost viewedLiveRussia-Ukraine war live: Moscow claims to have repelled ‘major’ attack in Donetsk; Belgorod energy facility on fireClumps of 5,000-mile seaweed blob bring flesh-eating bacteria to FloridaKathleen Folbigg pardoned and released after 20 years in jail over deaths of her four childrenUS jets pursue light aircraft over Washington DC before it crashes in VirginiaI love electric vehicles – and was an early adopter. But increasingly I feel dupedRowan Atkinson",
    "summary": "- A new study shows that taking the drug osimertinib once a day after surgery reduces the chance of patients dying by 51%, cutting the risk of death from lung cancer by half.\n- The Adaura trial found that the pill, also known as Tagrisso, significantly lowered the risk of death in lung cancer patients and should become the \"standard of care\" for the quarter of lung cancer patients worldwide with the EGFR mutation.\n- Treatment with osimertinib was seen to have a survival benefit consistently across all study subgroups, with a highly significant improvement in survival that is of great importance.",
    "hn_title": "Lung cancer pill cuts risk of death by half",
    "original_title": "Lung cancer pill cuts risk of death by half",
    "score": 272,
    "hn_content": "A new drug, osimertinib, has been found to reduce the risk of death from non-small cell lung cancer by 50%. The drug works by targeting a specific mutated gene that occurs in approximately 30% of non-small cell lung cancers and is considered highly efficacious, although it only helps around 1.4% of all cancers. Personalized therapy is seen as the way forward, but it has limitations as it is difficult to test in a comparable system. The FDA fast-tracks drugs in cases where studies show overwhelming success, and it is no longer ethical to keep it from the control group. However, the FDA must find the balance between promoting healthcare innovation without endangering patients and ensuring drugs are safe before they are greenlit.A study presented at the American Society of Clinical Oncology (ASCO) has revealed that a drug called Tagrisso is significantly improving the chances of survival among those with non-small cell lung cancer. The medication, manufactured by AstraZeneca, is an EGFR-TKI and has been shown to reduce the mortality rate by 50% compared to the placebo group. Tagrisso stopped the disease from spreading in patients by 83% and cut the risk of new tumours growing by 79%. The drug is already authorised for use in late-stage patients and in this new study, it is the first time it has been shown to benefit patients where the cancer had not yet spread.A recent clinical trial of the drug osimertinib in lung cancer patients with specific genetic mutations showed a higher survival rate compared to a placebo group. The drug reduced the risk of death by 51% and extended survival by about 10 months, according to a new study. However, the drug is expensive, costing around $12,750 per month, and may not be cost-effective for all patient populations. The drug's maker, AstraZeneca, has a patent on the drug until 2035, but it is likely that it will face competition from other companies in the future. Molecular marker and genetic testing of cancer can be to the benefit of patients and is not a scam. Overall, the drug has significant potential, but it may not be suitable for all patients.",
    "hn_summary": "- Osimertinib and Tagrisso are new drugs that have shown significant improvement in reducing the risk of death from non-small cell lung cancer by around 50%.\n- Osimertinib targets a specific mutated gene, while Tagrisso is an EGFR-TKI, and both have been found to help specific patient populations with specific genetic mutations.\n- Personalized therapy has limitations, and the FDA has to balance promoting healthcare innovation without endangering patients and ensuring drugs are safe before greenlighting them."
  },
  {
    "id": 36185394,
    "timestamp": 1685884936,
    "title": "Meta Is Trying, & Failing, to Crush Unions in Kenya",
    "url": "https://jacobin.com/2023/06/meta-is-trying-and-failing-to-crush-unions-in-kenya",
    "hn_url": "http://news.ycombinator.com/item?id=36185394",
    "content": "06.03.2023KenyaScience and Technology UnionsFacebook IconTwitter IconEmail IconPrint IconMeta Is Trying, and Failing, to Crush Unions in KenyaBYJODY RAYKenyan content moderators at Meta have been fighting for better compensation for workers forced to watch videos of murder, rape, and ethnic cleansing. Meta was initially unwilling to give in to these demands, but Kenyan courts are intervening on the side of workers.Kenyan lawyer Mercy Mutemi (center) speaks to the media after filing a lawsuit against Meta accusing Facebook’s parent company of fanning violence and hate speech in Africa at the Milimani Law Courts in Nairobi, Kenya, on December 14, 2022. (Yasuyoshi Chiba /AFP via Getty Images)Our new issue on conspiracy is out now. Subscribe today to get it in print at a special discounted rate!Two Centuries of the National QuestionDANIEL FINNBRIC Nationalism Is No AlternativeGRACE BLAKELEYTaking Back Left Parties From the BrahminsTHOMAS PIKETTY CLARA MARTÍNEZ-TOLEDANO AMORY GETHINFrom Bowling Alone to Posting AloneANTON JÄGERMeta is in hot water with Kenyan courts after three suits brought against it in the last year highlight its unwillingness to work with organized labor for better working conditions.Last December, two Ethiopian researchers brought suit against Meta, the parent company of Facebook, for failing to adequately moderate extreme and violent content during the ongoing Tigray War, a devastating internal conflict in Ethiopia that has since left over six hundred people dead.The researchers, Fisseha Tekle and Abrham Meareg, filed suit in the capital city of Nairobi, Kenya, where Meta’s content moderation business is located. Meareg sued because her father, Professor Meareg Amare Abrha, was murdered after his identity and location was doxed on Facebook during the conflict’s resulting information war online.A court in Nairobi granted them leave to serve Meta at its California headquarters after it could not locate any physical office space in the country. That’s because Meta uses a third-party company called Sama to employ approximately 150 remote workers around Nairobi to moderate content from East Africa to the South African tip, an area that comprises almost five hundred million people.The petitioners asked Meta to put an end to viral hate on Facebook, increase content review and moderation in an actual office hub in Kenya, and create a $1.6-billion compensation fund.Five months later, Meta was sued again by Daniel Motaung, a former subcontracting content moderator with Sama. Motaung alleges to have been fired from Sama after his attempts to unionize moderators, bringing suit to both companies for “forced labor, exploitation, human trafficking, unfair labor relations, union busting and failure to provide ‘adequate’ mental health and psychosocial support.”Meta struck back in court, demanding its name be removed from the lawsuit because Motaung was not an employee of Meta, but rather Sama. Kenyan courts disagreed, saying there was a case, indicating the likelihood that Sama was established solely to supply Meta with content moderators so that it could comply with and operate through various markets in Africa. Meta has since appealed.The case caused a small ripple in the mainstream American press, where coverage of labor movements in Africa are almost always relegated to South Africa, if at all. Motaung’s story was highlighted in many places including the establishment magazine Time, which referred to the content moderation offices in Kenya as “Facebook’s African Sweatshop.”And now last month, a third suit in Kenyan courts alleged that Meta, Sama, and another content review subcontractor called Majorel illegally fired and blacklisted 183 employees. Petitioners claimed that Sama ramped down its content moderation business (likely as a response to unionization efforts) so that Meta could use Luxembourg-based Majorel and instructed Majorel to blacklist specific individuals who had just been fired from Sama.Despite Meta’s efforts to be relinquished from the suit, in April Kenyan courts again agreed it had jurisdiction to hear disputes around “matters of alleged unlawful and unfair termination of employment on grounds of redundancy” and that it had power “to enforce alleged violation of human rights and fundamental freedoms” by Meta, Sama, and Majorel.Even if Meta could make the argument that it has no concrete ties to subcontracting companies in Kenya that operate on its behalf, it’s clear the social media company has no intention of bolstering its content moderation operations there.“There isn’t nearly enough moderation happening outside the English-speaking US and Western Europe — and both workers and users of social media pay a stiff price. Facebook’s Nairobi content moderation covers around five hundred million people, yet of the estimated 15,000 Facebook content moderators in the world, only about 260 of them work in Nairobi. Contrast that with the thousands of moderators working in the US and it’s clear which language markets, and people, Mark Zuckerberg values,” said Martha Dark, founder and director of Foxglove, a London-based tech justice nonprofit.While based in the UK, Foxglove works internationally and partners with people, supporting these three cases against Meta in Kenya. And they don’t just stop with Meta: “We have our sights on other exploitative tech firms, from Amazon to TikTok,” Dark said.In 2020, Meta agreed to pay for the mental health care for American employees in a landmark acknowledgment of the mental anguish and toll that content moderation takes on its workforce. A settlement in a San Mateo, California, court paved the way for a $52-million compensation package for former and then current employees to alleviate the mental health issues they developed on the job.In 2022, a California judge approved $85 million in a second settlement between Facebook and more than ten thousand content moderators who had accused the company of failing to protect them from psychological damages that resulted from the extreme images and video they encountered in content moderation.But in Africa? Not so fast.The cost to increase content moderation in Kenya, even through its same subcontracting companies, would have been a drop in the bucket for Meta. The moderators in Kenya make around $2 per hour, where in the United States, moderators earn between $15 and $16 per hour. By working through contracting companies, Meta is immune from having to pay for workers’ health care or transportation — even daily meals and entertainment, which are amenities most of its full-time employees around the world not only enjoy but expect.The constant exposure of violence — videos of murder, torture, and rape — takes enough of a toll on the human psyche. But on top of that, these Kenyan-based moderators face the additional hardships of feeding their families and paying their bills on a salary of $16 a day. For non-Kenyans it’s even more dire, as they face a precarious choice: keep doing this dangerous work or face losing your work permit and leaving the country, maybe even back to the conflict from which they fled.“Facebook could choose to directly employ moderators rather than outsourcing them to companies like Sama in Kenya or Accenture in the United States. They could give them the same pay, benefits, and mental health cover as Facebook’s employees at Menlo Park,” said Dark:The importance of moderators’ work to Facebook’s daily operations is not in doubt. The question, instead, is why Mark Zuckerberg refuses to recognize the vital role of moderators in generating Facebook’s huge revenues? We see no reason apart from greed.These three suits, along with Motaung’s international press appearances as a result of the crackdown against his nascent union to organize for better pay and working conditions, has created something of a Streisand effect for Meta.The company’s attempt to jockey and hustle around labor organization in a part of the world where they certainly did not expect it to occur has only brought political and press attention to the continued plight of content moderators in Kenya.Organizations like Foxglove hope this will cast ripples across the world of social media.“Everywhere they are, these critical workers don’t get the value and respect they deserve — but these people are demanding their worth. The one-two punch of resolving to form this union — alongside the lawsuit fighting for their jobs — could create two powerful precedents and, hopefully, templates for other workers fighting exploitation by Big Tech around the world,” Dark concluded.SHARE THIS ARTICLEFacebookTwitterEmailCONTRIBUTORSJody Ray is a travel writer and photojournalist based in New Orleans. He is the creator of Exit Strategy, a project that seeks to discover the world through political conflict, culture, and cuisine.FILED UNDERKenyaScience and Technology UnionsSocial Media Facebook Mark Zuckerberg Exploitation",
    "summary": "- Meta, the parent company of Facebook, is facing legal action in Kenya after three lawsuits were brought against it within the last year, accusing the company of union-busting and exploitation of Kenyan content moderators.\n- Kenyan content moderators at Meta are advocating for better working conditions, including increased compensation for watching violent content including murder, rape, and ethnic cleansing, and a physical office hub for content moderation in Kenya.\n- Meta uses a subcontracting company to employ approximately 150 remote workers in Kenya, paying them around $2 per hour, whereas content moderators in the US earn between $15 and $16 per hour. Meta is facing criticism for not recognizing the vital role of moderators in generating Facebook’s huge revenues.",
    "hn_title": "Meta Is Trying, and Failing, to Crush Unions in Kenya",
    "original_title": "Meta Is Trying, and Failing, to Crush Unions in Kenya",
    "score": 268,
    "hn_content": "Kenyan moderators for Meta, a social media company, are struggling to establish unions while working in harmful conditions due to content involved. Unionizing moderators is slowly becoming an international discussion, and the lack of basic amenities is a concern for workers. The value of offshore workers and whether they should receive the same wages as onshore workers are under discussion, where factors like cost of living are key. Additionally, the article highlights the question of how companies can be held responsible for subcontractors working on their behalf. Finally, the article discusses whether directly employing moderators instead of outsourcing to contracting companies could improve their pay, benefits, and overall conditions.An article sheds light on the treatment of Meta's non-official employees, who don't receive the same benefits as full-time employees, such as healthcare, transportation, daily meals, and entertainment. The article suggests that the issue is not specific to Meta but is common across industries. The piece is controversial, with readers disagreeing on the definition of hard evidence. Some readers argue that there is a lack of specific examples of union-busting, while others claim that the story provides a lot of substance and evidence to support its claims. The article highlights the need for regulation and better treatment of workers in the industry, with one reader suggesting that countries should regulate all companies like Sama to treat workers better. Others argue that the problems should be brought up with the contracting agency rather than Meta.",
    "hn_summary": "- Kenyan moderators for Meta struggle to establish unions, sparking international discussion.\n- Concerns raised about harmful working conditions and lack of basic amenities for offshore workers.\n- Debate over whether offshore workers should receive the same wages as onshore workers due to factors like cost of living, as well as responsibility of companies for subcontractors."
  }
]
