[
  {
    "id": 40213591,
    "title": "ABD Narkotik Dairesi Esrarın Yeniden Sınıflandırılmasını Teklif Etti",
    "originLink": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213591",
    "commentBody": "",
    "originSummary": [
      "ABD Uyuşturucuyla Mücadele İdaresi, marihuanayı daha az tehlikeli bir uyuşturucu olarak yeniden sınıflandırmayı ve ülkedeki uyuşturucu politikalarını yeniden şekillendirmeyi düşünüyor.",
      "Başkan Biden federal marihuana yasalarının gözden geçirilmesini destekliyor ve bulundurma suçundan mahkum olan kişilere af çıkardı.",
      "Önerilen değişiklik federal uyuşturucu politikalarını eyaletlerdeki yasallaştırma hareketleriyle uyumlu hale getirebilir ve genç seçmenlere hitap ederek Başkan Biden'ın kamuoyundaki imajına fayda sağlayabilir."
    ],
    "commentSummary": [
      "Tartışma, yeniden sınıflandırma, bankacılık düzenlemelerinin etkisi, dispanser güvenliği, iş zorlukları ve işlemler için kripto para birimi kullanımı gibi ABD'de marihuananın yasallaştırılması ve düzenlenmesinin çeşitli yönlerini ele alıyor.",
      "Ayrıca federal yasaların etkilerini, marihuana perakende pazarını ve uyuşturucu kullanımı ve yasallaştırma konusundaki farklı bakış açılarını da araştırıyor.",
      "Yanlış bilgilendirme, geçiş dönemi ilaçları ve büyük şirketlerin piyasa üzerindeki etkisi tartışmada öne çıkan endişeler arasında yer alıyor."
    ],
    "points": 582,
    "commentCount": 726,
    "retryCount": 0,
    "time": 1714498320
  },
  {
    "id": 40216057,
    "title": "CSS Grid'de Müzik Notasyonunu Keşfetmek",
    "originLink": "https://cruncher.ch/blog/printing-music-with-css-grid/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40216057",
    "commentBody": "",
    "originSummary": [
      "Scribe prototipi, web üzerinde gelişmiş müzik notasyonu erişilebilirliği ve pürüzsüzlüğü için ızgara benzeri bir müzik kadrosu oluşturmak üzere CSS Grid'i kullanır.",
      "CSS ızgarası ve veri nitelikleri aracılığıyla müzik sembollerinin bir stave üzerinde nasıl konumlandırılacağı, CSS kullanılarak düzen ve aralıkların nasıl değiştirileceği gösterilmekte ve sistemin kısıtlamaları ve potansiyel geliştirmeleri vurgulanmaktadır.",
      "Ek özellikler arasında davul ve piyano için stave bölme, çoklu stave oluşturma ve bir caz standardı için transpoze edilebilir bir lead sheet bulunmaktadır."
    ],
    "commentSummary": [
      "Makale, CSS Grid'in müzik notasyonu için kullanımını, avantajlarını ve kısıtlamalarını özetleyerek ele alıyor.",
      "Yorumcular, müzik dizgisinde daha etkili bir çözünürlük amaçlayarak CSS'de geliştirmeler önermektedir.",
      "Kullanıcılar, müzik notasyonu oluşturma konusunda görüş alışverişinde bulunmakta, farklı araçları ve alternatifleri keşfetmekte ve diğer yöntemlere kıyasla CSS'nin etkinliği konusunda farklı görüşler ifade etmektedir."
    ],
    "points": 579,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1714509599
  },
  {
    "id": 40211655,
    "title": "Pyinfra ile Altyapı Otomasyonunu Kolaylaştırın",
    "originLink": "https://pyinfra.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211655",
    "commentBody": "",
    "originSummary": [
      "pyinfra, geçici komutlar, hizmet dağıtımı ve yapılandırma yönetimi için hız, ölçeklenebilirlik ve çok yönlülük sunan, altyapı otomasyonuna yönelik bir Python aracıdır.",
      "Hızlı yürütme, anında hata ayıklama, idempotent işlemler ve konektörlerle entegrasyon sunarak altyapı otomasyonu için kapsamlı bir çözüm haline getirir.",
      "Kullanıcılar pyinfra'yı pip aracılığıyla kurabilir, SSH üzerinden komutlar çalıştırabilir, işlemleri kullanarak durumları tanımlayabilir ve Python paket ekosistemini kullanarak genişletme esnekliği ile Python kodunu kullanarak görevleri dağıtabilir."
    ],
    "commentSummary": [
      "Pyinfra, Ansible, Puppet ve Terraform gibi altyapı otomasyon araçlarının bildirimsel ve zorunlu yaklaşımlara, karmaşıklıklara, faydalara ve sınırlamalara göre karşılaştırılması.",
      "Kullanıcılar otomasyon görevleri için Python tabanlı Pyinfra'yı övüyor, Ansible ve Puppet sınırlamaları hakkındaki endişelerini dile getiriyor ve altyapı otomasyonunda durum yönetiminin önemini vurguluyor.",
      "Tartışma, büyük sunucu filolarını verimli bir şekilde yönetmenin zorluklarını, bildirimsel programlamanın faydalarını ve DRY programlama ilkeleri ile yapılandırma yönetiminde basitlik arasındaki dengeyi kapsamaktadır."
    ],
    "points": 490,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1714488885
  },
  {
    "id": 40211891,
    "title": "Borgo: Go ile Derlenen Statik Tipli Bir Dil",
    "originLink": "https://github.com/borgo-lang/borgo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211891",
    "commentBody": "",
    "originSummary": [
      "Borgo, Go'nun sadeliğini Rust'un ifade gücüyle birleştirerek Go'ya aktaran yeni bir programlama dilidir.",
      "Cebirsel veri türleri, desen eşleştirme, ? operatörü ile hata işleme içerir ve mevcut Go paketleriyle uyumludur.",
      "Borgo sözdizimi, isteğe bağlı noktalı virgüllerle Rust'a benzer ve nil işleme için Option, birden fazla geri dönüş değeri için Result gibi özellikler sunar ve bir tahmin oyunu örneği ile gösterilir."
    ],
    "commentSummary": [
      "Tartışma, Go koduyla ilgili yaygın hayal kırıklıklarını ele alan ve enumlar ve isteğe bağlı türler gibi ek özellikler sunan, Go'ya aktarılan bir dil olan Borgo'yu inceliyor.",
      "Kullanıcılar Borgo'nun işlevlerine ilgi duyuyor, Go gibi fikirli dillerin avantajlarına ve dezavantajlarına işaret ediyor, Go'nun hata işleme yöntemine kıyasla try/catch yoluyla hata işlemeyi tartışıyor ve deyimsel adlandırma kurallarının önemini vurguluyor.",
      "Konuşmada ayrıca derleyici ve transpiler ayrımları, geriye dönük uyumluluk zorlukları ve dil tasarımı, hata yönetimi ve diller arası uyumluluğa odaklanarak diğer dillere derleme yapan dil örnekleri de ele alınmaktadır."
    ],
    "points": 487,
    "commentCount": 310,
    "retryCount": 0,
    "time": 1714490002
  },
  {
    "id": 40211010,
    "title": "Reddit İfşa Oldu: Botlar 10 Ay Sonra Konuyu Yeniden Paylaşıyor",
    "originLink": "https://lemmy.blahaj.zone/post/11615413",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211010",
    "commentBody": "",
    "originSummary": [
      "Reddit kullanıcıları Blaze ve Lemmy.world, botların 10 ay sonra bir başlığın tamamını yorum yorum aynı şekilde yeniden yayınladığını tespit etti.",
      "Bu keşif, Reddit'te tekrarlayan davranışlarda bulunan ve potansiyel olarak tartışmaları manipüle eden botların varlığını vurgulamaktadır.",
      "Olay, platformdaki kullanıcı etkileşimlerinin ve içeriğin gerçekliğine ilişkin endişeleri artırarak bot faaliyetlerinin tespit edilmesi ve ele alınmasının önemini vurguluyor."
    ],
    "commentSummary": [
      "Reddit konuşmaları, botların içeriği yeniden paylaşması, ürünleri tanıtan sahte hesaplar ve yapay zeka tarafından oluşturulan içerik yoluyla potansiyel tartışma manipülasyonu gibi konulara odaklanıyor.",
      "Bilgi güvenilirliği, taraflı Wikipedia düzenlemeleri ve kurumsal etki ile ilgili endişeler yaygın konulardır.",
      "Önerilen çözümler arasında çevrimiçi kimlik sistemleri, pasaport doğrulama ve botlarla savaşmak için köpeklerin kullanılması yer alıyor."
    ],
    "points": 318,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1714485473
  },
  {
    "id": 40210627,
    "title": "Extension.js: Kolaylaştırılmış Web Uzantısı Oluşturma Aracı",
    "originLink": "https://github.com/cezaraugusto/extension.js",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40210627",
    "commentBody": "",
    "originSummary": [
      "Extension.js, TypeScript, WebAssembly, React ve modern JavaScript için yerleşik destek sunarak süreci kolaylaştıran tarayıcı uzantıları için bir geliştirme aracıdır.",
      "Karmaşık yapılandırmalar ve kurulum talimatları gereksinimini ortadan kaldırarak geliştiricilerin kodlamaya odaklanmasını sağlar.",
      "Araç, npm komut dosyalarına sorunsuz bir şekilde entegre edilebilir ve derleme yapılandırmasına gerek kalmadan tarayıcılar arası uzantıların oluşturulmasını basitleştirir. Başlangıçta uzantı geliştirme konusunda eğitim vermek için oluşturulan araç, şimdi geri bildirim teşvik edilerek genel kullanıma açık."
    ],
    "commentSummary": [
      "Extension.js, web uzantısı oluşturmayı basitleştiren, TypeScript, WebAssembly, React ve modern JavaScript'i destekleyen, Chrome ve Edge ile tam uyumlu, gelecekte Firefox ve Safari uyumluluğu gündemde olan bir CLI aracıdır.",
      "Github ve HN gibi platformlardaki tartışmalar Extension.js özelliklerine, Plasmo gibi çerçevelerle karşılaştırmalara ve Mutation Observers ve CSS gibi araçları kullanarak web sayfası ve SPA modifikasyonu stratejilerine odaklanmaktadır.",
      "Topluluk geri bildirimi, Extension.js için iyileştirme önerilerini ve yaklaşan tarayıcı desteği planlarını içerir."
    ],
    "points": 312,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1714482676
  },
  {
    "id": 40213731,
    "title": "Dosya Dosya Sistemi: Unix Araçları ile Modern Verilerin Manipülasyonu",
    "originLink": "https://mgree.github.io/ffs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213731",
    "commentBody": "",
    "originSummary": [
      "ffs, kullanıcıların JSON gibi yarı yapılandırılmış verileri bir Unix dosya sistemine bağlamasına ve standart kabuk araçlarıyla manipülasyona izin veren bir dosya dosya sistemidir.",
      "JSON, YAML ve TOML formatlarını destekler, yerinde dosya düzenlemeyi mümkün kılar, Linux'ta FUSE ve macOS'ta macFUSE gerektirir ve GPLv3 altında lisanslanmıştır.",
      "mgree tarafından geliştirilen ffs, jq ve gron gibi araçlara kıyasla komut satırı veri işleme için farklı bir yaklaşım sunar."
    ],
    "commentSummary": [
      "Tartışma, Apple'ın API kısıtlamaları ve osxfuse gibi üçüncü taraf araçlara bağımlılık nedeniyle zorluklarla karşılaşan macOS gibi işletim sistemlerinde kullanıcı tarafından erişilebilir dosya sistemi özelliklerinin etkinleştirilmesine odaklanıyor.",
      "Kullanıcılar, Apple'ın harici geliştiricilere yönelik sınırlamalarından dolayı hayal kırıklığına uğramış, güvenilirlik ve veri bütünlüğü konusunda endişelere yol açmış ve NFS'den yararlanma gibi önerilerde bulunmuşlardır.",
      "Tartışmalar ayrıca Git taahhütlerini bir dosya sistemi olarak monte etmek, arabellekleri dosya olarak ele almak ve XML'i XPath teknolojisi ile bir dosya sistemine eşlemek gibi yenilikçi fikirleri de içeriyor ve teknik ayrıntıları ve teknoloji topluluğu içindeki potansiyel artıları ve eksileri araştırıyor."
    ],
    "points": 254,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1714498992
  },
  {
    "id": 40218463,
    "title": "Penpot 2.0: Sorunsuz İşbirliği için Yeni Web Tabanlı Açık Kaynak Tasarım Aracı",
    "originLink": "https://penpot.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40218463",
    "commentBody": "",
    "originSummary": [
      "Penpot 2.0, tasarımcılar ve geliştiriciler arasında işbirliğini teşvik eden web tabanlı açık kaynaklı bir tasarım aracının yeni sürümüdür.",
      "Kullanıcılar Penpot'u kendi kendilerine barındırabilir, entegrasyonlarından, açık tasarım yaklaşımından ve destekleyici topluluğundan yararlanabilir, kullanıcı dostu kontrollerini ve geliştirici odaklı işlevlerini vurgulayan referanslarla.",
      "Araç, tasarım ve geliştirme sürecini geliştirmek için web ve geliştirme standartlarından akıllıca yararlanarak, tasarımcılar ve geliştiriciler arasındaki işbirliğini teşvik eden Penpot Fest konferansında sergilendiği gibi sorunsuz bir iş akışını teşvik ediyor."
    ],
    "commentSummary": [
      "Diyalogda Inkscape ve Penpot gibi açık kaynak tasarım araçları ile Figma gibi tescilli seçenekler karşılaştırılarak avantajlar ve zorluklar vurgulanıyor.",
      "Inkscape, Ölçeklenebilir Vektör Grafikleri (SVG'ler) ile kullanım kolaylığı nedeniyle övülmekte ve Blender'ın açık kaynağa geçişi takdir edilmektedir.",
      "Tasarımcılar ve geliştiriciler arasındaki işbirliğinin, yazılım geliştirmede kullanıcı deneyimi (UX) için çok önemli olduğu vurgulanarak, Figma ile Penpot gibi UI tasarımı araçlarına ilişkin farklı görüşler ortaya konuyor."
    ],
    "points": 232,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1714526230
  },
  {
    "id": 40213400,
    "title": "Avrupa'nın Girişimcilik Uyandırma Çağrısı",
    "originLink": "https://klinger.io/posts/eu-acc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213400",
    "commentBody": "",
    "originSummary": [
      "Yazar, Avrupalı girişimcilerin sıkı çalışma ve risk alma zihniyetini sergileyerek klişelere meydan okuyor ve Avrupalıların Amerikalılara kıyasla tembel ve riskten kaçınan kişiler olduğu fikrine karşı çıkıyor.",
      "Öneriler arasında AB'de standart bir tüzel kişilik oluşturulması, İngilizce eğitiminin geliştirilmesi ve mevzuat farklılıkları ve yeni girişimler için sınırlı erken aşama desteği gibi engelleri aşmak için birleşik bir iş piyasası oluşturmaya çalışmak yer alıyor.",
      "Bu öneriler Avrupa'da girişimcilik için daha elverişli bir ortam yaratmayı ve politika yapıcıları kıtanın girişimcilik ortamını güçlendirmeye yönelik stratejileri yeniden düşünmeye teşvik etmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "Çalışma kültüründeki farklılıklar, Amerikalı yazılım geliştiricilerin tercih ettiği risk alma ile Avrupa'daki güvenlik vurgusunu gözler önüne seriyor.",
      "San Francisco, ABD teknoloji sektöründe risk alma ve uzun çalışma saatleri açısından benzersiz bir merkez olarak öne çıkmakta, üretkenliği ve işe alım uygulamalarını etkilemektedir.",
      "Brexit sonrası Avrupalı teknoloji şirketlerinin karşılaştığı zorlukların ele alındığı söyleşide, yapay zeka alanında baskın ABD pazarıyla rekabet edebilmek için İngilizce akıcılığının ve yatırımın önemi vurgulanıyor."
    ],
    "points": 228,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1714497156
  },
  {
    "id": 40213292,
    "title": "Diferansiyellenebilir Programlama ile Sinir Ağlarını Keşfetmek",
    "originLink": "https://www.sscardapane.it/alice-book",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213292",
    "commentBody": "",
    "originSummary": [
      "\"Alice's Adventures in a Differentiable Wonderland\", sinir ağlarını ve türevlenebilir programlamayı tanıtan, fonksiyonları optimize etmek için otomatik türevlemeyi vurgulayan bir kitaptır.",
      "Kitap, diziler, grafikler, metinler ve sesler için tasarım tekniklerini kapsamakta, evrişimsel, dikkatsel ve tekrarlayan bloklara odaklanmakta ve büyük dil modelleri ve çok modlu mimariler gibi gelişmiş modelleri açıklamak için PyTorch ve JAX kullanmaktadır.",
      "Ek bölümler, teori ve pratik kod uygulaması arasında köprü kurmayı amaçlayarak modelin yeniden kullanımı, yoğunluk tahmini, koşullu hesaplama ve model hata ayıklama gibi konuları ele alacaktır."
    ],
    "commentSummary": [
      "Tartışma, türevlenebilir ilkelleri kullanarak sinir ağlarını optimize etmeyi ve stokastik gradyan inişi ve rastgele ağırlık pertürbasyonu gibi gradyan tabanlı yöntemlerin zorluklarını kapsamaktadır.",
      "Algoritmaların doğru bir şekilde tanımlanmasına, matematiksel kavramların derinlemesine anlaşılmasına, Jacobian matrislerinin dahil edilmesine ve sinir ağlarında fonksiyonel ve geleneksel programlama arasında ayrım yapılmasına vurgu yapılmaktadır.",
      "Yapay sinir ağları ve biyolojik nöronlar arasındaki ilişki üzerine tartışmalar, hesaplama gücü, işlemler, gradyanların genelleştirilmesi ve fikri mülkiyetle ilgili potansiyel yasal konulardaki farklılıkları ele alır."
    ],
    "points": 185,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1714496616
  },
  {
    "id": 40209382,
    "title": "Tesla tüm Supercharger ekibini işten çıkarıyor",
    "originLink": "https://electrek.co/2024/04/29/tesla-conducting-more-layoffs-including-entire-supercharger-team/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40209382",
    "commentBody": "",
    "originSummary": [
      "Tesla, Supercharger ekibinin tamamının azaltmalardan etkilenmesiyle birlikte ek işten çıkarmalar gerçekleştiriyor.",
      "Şirketin Supercharger ekibini kesintilere dahil etme kararı, Supercharger ağının Tesla'nın altyapısındaki önemi nedeniyle dikkat çekti."
    ],
    "commentSummary": [
      "Hissedarlar Elon Musk'ın liderliğini, karar alma mekanizmasını ve 55 milyar dolarlık hisse senedi tahsisi de dahil olmak üzere son işten çıkarmaları tartışıyor.",
      "SpaceX ve Tesla'nın sürdürülebilirliği ve karlılığı, Musk'ın davranış değişiklikleri ve şirketlerdeki iş güvenliği hakkında endişeler dile getiriliyor.",
      "Musk'ın bir lider olarak etkinliği, şirketlerinin geleceği ve aldığı kararların şirketlerin değerlemesi ve başarısı üzerindeki etkisine ilişkin sorular devam ediyor."
    ],
    "points": 178,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1714473195
  },
  {
    "id": 40219201,
    "title": "DEA Keneviri Program I'den III'e Yeniden Sınıflandıracak",
    "originLink": "https://norml.org/blog/2024/04/30/dea-accepts-health-agencys-recommendation-to-reclassify-cannabis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40219201",
    "commentBody": "",
    "originSummary": [
      "DEA, Sağlık ve İnsani Hizmetler Bakanlığı'nın tavsiyesine dayanarak esrarı, tedavi edici faydalarını göz önünde bulundurarak Çizelge I'den Çizelge III'e yeniden sınıflandıracaktır.",
      "Yeniden sınıflandırmaya rağmen, eyalet ve federal esrar yasaları arasındaki tutarsızlıklar nedeniyle zorluklar devam etmektedir.",
      "Süreç, Beyaz Saray Yönetim ve Bütçe Ofisi'nin incelemesini, halkın geri bildirimini, idari duruşmaları ve herhangi bir değişiklik uygulanmadan önce nihai kararı içermektedir."
    ],
    "commentSummary": [
      "DEA, bir sağlık örgütünün yönlendirmesi üzerine esrarın yeniden sınıflandırılmasını kabul etti.",
      "Bu karar esrarın yasal statüsünde önemli bir değişikliğe işaret etmektedir.",
      "Daha fazla ayrıntı için lütfen verilen bağlantıya bakınız."
    ],
    "points": 177,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1714534174
  },
  {
    "id": 40218021,
    "title": "StoryDiffusion ile Yaratıcılığın Kilidini Açmak",
    "originLink": "https://storydiffusion.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40218021",
    "commentBody": "",
    "originSummary": [
      "StoryDiffusion, etkileyici çizgi romanlar, yüksek kaliteli videolar oluşturmak ve karakter tutarlılığını korumak için tutarlı öz dikkati kullanan çok yönlü bir araçtır.",
      "Tutarlı çizgi karakter görüntüleri üretir, aynı anda birden fazla karakter kimliğini yönetir ve kullanıcı tarafından girilen görüntüleri koşul olarak dahil edebilir.",
      "Bulma'nın tarzından esinlenen araç, çıktı kalitesini ve benzersizliğini artırmak için bir hareket tahmincisi kullanıyor."
    ],
    "commentSummary": [
      "StoryDiffusion, doğal hareketlerle görüntü ve video oluşturmaya yönelik bir araçtır, ancak kullanıcılar süreklilik hataları olduğunu belirtmişlerdir.",
      "Kullanıcılar, niş içerik oluşturma ve potansiyel spam için üretici yapay zekanın kullanımını tartışıyor, GitHub bağlantısının gizliliği ve Amazon'da otomatik olarak oluşturulan e-kitapların kalitesi hakkındaki endişelerini dile getiriyor.",
      "Konuşma, üretken yapay zeka teknolojisinin yeteneklerini ve kısıtlamalarını derinlemesine inceliyor."
    ],
    "points": 173,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1714522028
  },
  {
    "id": 40214763,
    "title": "Arti: Tor Anonimlik Protokollerini Uygulayan Rust Projesi",
    "originLink": "https://tpo.pages.torproject.net/core/arti/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40214763",
    "commentBody": "",
    "originSummary": [
      "Arti, Tor anonimlik protokollerini uygulayan ve onion hizmetleri için erken destek ile işlevsel bir Tor istemcisi sağlayan bir Rust projesidir.",
      "C Tor uygulamasıyla eşleşecek şekilde güvenliği artırmak için geliştirme devam etmektedir, bu da onu şu anda yalnızca deneysel amaçlar için uygun hale getirmektedir.",
      "En son sürüm 1.2.0 sürümüdür ve README, kaynak deposu, API belgeleri, katkı yönergeleri, SSS ve Tor ile ilgili ayrıntılar gibi çeşitli kaynaklar sunar."
    ],
    "commentSummary": [
      "Makale, Rust'ta kodlanmış bir Tor uygulaması olan Arti'yi inceliyor, gelişimi, finansmanı ve deneysel kullanım önerileri hakkında bilgiler paylaşıyor.",
      "Arti'nin mevcut durumu ve potansiyel güvenlik açıklarına ilişkin bir tartışma ortaya çıkıyor ve kullanıcılar için önemli hususlara dikkat çekiliyor.",
      "Arti in Rust, Tor uygulamalarına benzersiz bir bakış açısı sunmakta, geliştirme yönleri ve güvenlik etkileri nedeniyle ilgi çekmektedir."
    ],
    "points": 164,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1714503262
  }
]
