[
  {
    "id": 40213591,
    "title": "Az amerikai DEA javasolja a marihuána átminősítését",
    "originLink": "https://apnews.com/article/marijuana-biden-dea-criminal-justice-pot-f833a8dae6ceb31a8658a5d65832a3b8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213591",
    "commentBody": "",
    "originSummary": [
      "Az amerikai kábítószer-ellenes hatóság fontolgatja a marihuána kevésbé veszélyes kábítószerré való átminősítését, ami átformálhatja az ország drogpolitikáját.",
      "Biden elnök támogatja a szövetségi marihuánatörvények felülvizsgálatát, és kegyelmet adott a kábítószer birtoklásáért elítélt személyeknek.",
      "A javasolt változtatás összehangolhatja a szövetségi kábítószer-politikát az állami legalizációs mozgalmakkal, és a fiatalabb szavazókat is megszólíthatja, ami kedvezően hathat Biden elnök közmegítélésére."
    ],
    "commentSummary": [
      "A megbeszélés a marihuána legalizálásának és szabályozásának különböző aspektusait járja körül az Egyesült Államokban, mint például az átsorolás, a banki szabályozás hatása, a gyógyszertárak biztonsága, az üzleti kihívások és a kriptovaluta használata a tranzakciókhoz.",
      "Emellett feltárja a szövetségi törvények hatásait, a marihuána kiskereskedelmi piacát, valamint a kábítószer-használattal és a legalizálással kapcsolatos különböző nézeteket.",
      "A félretájékoztatás, a \"kapudrogok\" és a nagyvállalatok piaci befolyása a vita során kiemelt aggodalmak közé tartozik."
    ],
    "points": 582,
    "commentCount": 726,
    "retryCount": 0,
    "time": 1714498320
  },
  {
    "id": 40216057,
    "title": "Zenei jelölések felfedezése a CSS Gridben",
    "originLink": "https://cruncher.ch/blog/printing-music-with-css-grid/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40216057",
    "commentBody": "",
    "originSummary": [
      "A Scribe prototípus a CSS Grid segítségével egy rácsszerű kottaszerkezetet hoz létre, amely a kotta jobb elérhetőségét és gördülékenységét biztosítja a weben.",
      "Bemutatja, hogyan lehet a zenei szimbólumokat CSS rács és adatattribútumok segítségével elhelyezni egy kottában, hogyan lehet az elrendezést és a távolságot CSS segítségével módosítani, és kiemeli a rendszer korlátait és a lehetséges fejlesztéseket.",
      "A további funkciók közé tartozik a dobok és a zongora hangjegyek felosztása, a több hangjegyű megjelenítés, és egy jazz standardhoz transzponálható vezető kottát kínál."
    ],
    "commentSummary": [
      "A cikk a CSS Grid zenei notációhoz való felhasználását vizsgálja, ismertetve annak előnyeit és korlátait.",
      "A hozzászólók a CSS továbbfejlesztésére tesznek javaslatot, amelynek célja a zenei szedés hatékonyabb felbontása.",
      "A felhasználók véleményt cserélnek a zenei notáció megjelenítéséről, és különböző eszközöket és alternatívákat vizsgálnak meg, eltérő véleményt nyilvánítva a CSS hatékonyságáról más módszerekkel összehasonlítva."
    ],
    "points": 579,
    "commentCount": 52,
    "retryCount": 0,
    "time": 1714509599
  },
  {
    "id": 40211655,
    "title": "Az infrastruktúra automatizálásának egyszerűsítése a Pyinfra segítségével",
    "originLink": "https://pyinfra.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211655",
    "commentBody": "",
    "originSummary": [
      "A pyinfra egy Python-eszköz az infrastruktúra automatizálásához, amely gyorsaságot, skálázhatóságot és sokoldalúságot kínál az ad-hoc parancsok, a szolgáltatások telepítése és a konfigurációkezelés terén.",
      "Gyors végrehajtást, azonnali hibakeresést, idempotens műveleteket és csatlakozókkal való integrációt kínál, így átfogó megoldást kínál az infrastruktúra automatizálására.",
      "A felhasználók a pip segítségével telepíthetik a pyinfra-t, parancsokat futtathatnak SSH-n keresztül, állapotokat definiálhatnak műveletek segítségével, és feladatokat telepíthetnek Python kóddal, és rugalmasan bővíthetik a Python csomagok ökoszisztémájának segítségével."
    ],
    "commentSummary": [
      "Az olyan infrastruktúra-automatizálási eszközök, mint a Pyinfra, Ansible, Puppet és Terraform összehasonlítása deklaratív és imperatív megközelítések, összetettség, előnyök és korlátok alapján.",
      "A felhasználók dicsérik a Python-alapú Pyinfra-t az automatizálási feladatokhoz, aggodalmukat fejezik ki az Ansible és a Puppet korlátaival kapcsolatban, és hangsúlyozzák az állapotkezelés fontosságát az infrastruktúra automatizálásában.",
      "A megbeszélés kiterjed a nagy szerverparkok hatékony kezelésének kihívásaira, a deklaratív programozás előnyeire, valamint a DRY programozási elvek és a konfigurációkezelés egyszerűsége közötti egyensúlyra."
    ],
    "points": 490,
    "commentCount": 184,
    "retryCount": 0,
    "time": 1714488885
  },
  {
    "id": 40211891,
    "title": "Borgo: Egy statikusan tipizált nyelv Go nyelvre fordítva",
    "originLink": "https://github.com/borgo-lang/borgo",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211891",
    "commentBody": "",
    "originSummary": [
      "A Borgo egy új programozási nyelv, amely átültethető a Go nyelvbe, és egyesíti a Go egyszerűségét a Rust kifejezőerejével.",
      "Tartalmaz algebrai adattípusokat, mintaillesztést, hibakezelést a ? operátorral, és kompatibilis a meglévő Go csomagokkal.",
      "A Borgo szintaxis hasonlít a Rustra, opcionális pontosvesszőkkel, és olyan funkciókat kínál, mint az Option a nil kezeléséhez, Result a több visszatérési értékhez, amit egy tippelős játék példáján keresztül mutatunk be."
    ],
    "commentSummary": [
      "A beszélgetés a Go nyelvre átültetett Borgo nyelvvel foglalkozik, amely a Go kóddal kapcsolatos gyakori csalódásokat kezeli, és olyan további funkciókat kínál, mint az enumok és az opcionális típusok.",
      "A felhasználók érdeklődnek a Borgo funkcionalitásai iránt, rámutatnak az olyan véleményes nyelvek előnyeire és hátrányaira, mint a Go, megvitatják a try/catch segítségével történő hibakezelést a Go hibakezelésével összehasonlítva, és kiemelik az idiomatikus elnevezési konvenciók fontosságát.",
      "A beszélgetés kitér a fordító és a transzpiler közötti különbségtételre, a visszafelé kompatibilitás kihívásaira, valamint a más nyelvekbe fordított nyelvek példáira is, a nyelvtervezésre, a hibakezelésre és a nyelvek közötti kompatibilitásra összpontosítva."
    ],
    "points": 487,
    "commentCount": 310,
    "retryCount": 0,
    "time": 1714490002
  },
  {
    "id": 40211010,
    "title": "Reddit Exposed: Bots Repost Thread 10 hónappal később",
    "originLink": "https://lemmy.blahaj.zone/post/11615413",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40211010",
    "commentBody": "",
    "originSummary": [
      "A Reddit-felhasználók, Blaze és Lemmy.world 10 hónap után találtak olyan botokat, amelyek egy teljes témát kommentről kommentre, ugyanúgy újraközöltek.",
      "Ez a felfedezés rávilágít a botok jelenlétére a Redditen, amelyek ismétlődő viselkedést folytatnak és potenciálisan manipulálják a vitákat.",
      "Az incidens aggodalomra ad okot a felhasználói interakciók és tartalmak hitelességével kapcsolatban a platformon, hangsúlyozva a bottevékenységek felderítésének és kezelésének fontosságát."
    ],
    "commentSummary": [
      "A Reddit-beszélgetések olyan kérdésekre összpontosítanak, mint a tartalmakat újra közzétevő botok, a termékeket népszerűsítő hamis fiókok és az AI által generált tartalmakkal történő potenciális vitamanipuláció.",
      "Az információk megbízhatóságával, a Wikipédia elfogult szerkesztésével és a vállalatok befolyásával kapcsolatos aggodalmak gyakori témák.",
      "A javasolt megoldások között szerepelnek az online azonosítási rendszerek, az útlevél-hitelesítés és a kutyák használata a botok elleni küzdelemben, hogy megoldják ezeket a kihívásokat."
    ],
    "points": 318,
    "commentCount": 259,
    "retryCount": 0,
    "time": 1714485473
  },
  {
    "id": 40210627,
    "title": "Extension.js: Streamlined Web Extension Creation eszköz",
    "originLink": "https://github.com/cezaraugusto/extension.js",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40210627",
    "commentBody": "",
    "originSummary": [
      "Az Extension.js a böngészőbővítmények fejlesztésére szolgáló eszköz, amely a TypeScript, a WebAssembly, a React és a modern JavaScript beépített támogatásával egyszerűsíti a folyamatot.",
      "Megszünteti a bonyolult konfigurációk és beállítási utasítások szükségességét, így a fejlesztők a kódolásra koncentrálhatnak.",
      "Az eszköz zökkenőmentesen integrálható az npm szkriptekbe, ami egyszerűsíti a böngészők közötti kiterjesztések létrehozását, anélkül, hogy a build konfigurációra lenne szükség. Eredetileg a bővítményfejlesztés oktatására hozták létre, de most már nyilvános használatra is nyitva áll, és a visszajelzéseket is bátorítják."
    ],
    "commentSummary": [
      "Az Extension.js egy CLI eszköz, amely leegyszerűsíti a webes bővítmények létrehozását, támogatja a TypeScript, WebAssembly, React és a modern JavaScriptet, teljes mértékben kompatibilis a Chrome és az Edge böngészővel, a jövőben pedig a Firefox és a Safari kompatibilitás is napirenden lesz.",
      "Az olyan platformokon, mint a Github és a HN folytatott viták az Extension.js funkcióira, az olyan keretrendszerekkel való összehasonlításokra, mint a Plasmo, valamint a weboldalak és SPA-k módosítására vonatkozó stratégiákra összpontosítanak olyan eszközökkel, mint a Mutation Observers és a CSS.",
      "A közösségi visszajelzések fejlesztési javaslatokat és az Extension.js böngészőtámogatási terveit tartalmazzák."
    ],
    "points": 312,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1714482676
  },
  {
    "id": 40213731,
    "title": "A fájl fájlrendszer: Unix eszközökkel",
    "originLink": "https://mgree.github.io/ffs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213731",
    "commentBody": "",
    "originSummary": [
      "Az ffs egy fájlrendszer, amely lehetővé teszi a felhasználók számára, hogy félig strukturált adatokat, például JSON-t csatoljanak egy Unix fájlrendszerre, lehetővé téve a szabványos shell eszközökkel történő manipulációt.",
      "Támogatja a JSON, YAML és TOML formátumokat, lehetővé teszi a helyben történő fájlszerkesztést, Linuxon FUSE-t, macOS-en macFUSE-t igényel, és GPLv3 licenc alatt áll.",
      "A mgree által kifejlesztett ffs más megközelítést kínál a parancssori adatfeldolgozáshoz, mint az olyan eszközök, mint a jq és a gron."
    ],
    "commentSummary": [
      "A vita középpontjában a felhasználó által elérhető fájlrendszerfunkciók lehetővé tétele áll az olyan operációs rendszereken, mint a macOS, amely az Apple API-korlátozásai és a harmadik féltől származó eszközökre, például az osxfuse-ra való támaszkodás miatt kihívásokkal néz szembe.",
      "A felhasználók csalódottak az Apple külső fejlesztőkre vonatkozó korlátai miatt, ami a megbízhatósággal és az adatok sértetlenségével kapcsolatos aggodalmakhoz vezet, és olyan javaslatokat eredményez, mint az NFS kihasználása.",
      "A megbeszélések olyan innovatív ötleteket is tartalmaznak, mint a Git commitok fájlrendszerként való rögzítése, a pufferek fájlként való kezelése, valamint az XML fájlrendszerre való leképezése az XPath technológiával, a technikai részletek és a lehetséges előnyök és hátrányok feltárása a technológiai közösségen belül."
    ],
    "points": 254,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1714498992
  },
  {
    "id": 40218463,
    "title": "Penpot 2.0: A zökkenőmentes együttműködést biztosító új, webalapú, nyílt forráskódú tervezőeszköz",
    "originLink": "https://penpot.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40218463",
    "commentBody": "",
    "originSummary": [
      "A Penpot 2.0 egy webalapú, nyílt forráskódú tervezőeszköz új kiadása, amely elősegíti a tervezők és fejlesztők közötti együttműködést.",
      "A felhasználók a Penpotot saját maguk is üzemeltethetik, kihasználva az integrációkat, a nyílt tervezési megközelítést és a támogató közösséget, valamint az ajánlások kiemelik a felhasználóbarát vezérlést és a fejlesztőkre összpontosító funkciókat.",
      "Az eszköz okosan kihasználja a webes és fejlesztési szabványokat, hogy javítsa a tervezési és fejlesztési folyamatot, elősegítve a zökkenőmentes munkafolyamatot, amint azt a Penpot Fest konferencián bemutatták, amely elősegíti a tervezők és fejlesztők közötti együttműködést."
    ],
    "commentSummary": [
      "A párbeszédben olyan nyílt forráskódú tervezőeszközök, mint az Inkscape és a Penpot, kerülnek szembe az olyan szabadalmaztatott eszközökkel, mint a Figma, kiemelve az előnyöket és a kihívásokat.",
      "Az Inkscape-et dicsérik a skálázható vektorgrafikák (SVG) egyszerű használatáért, és elismerik a Blender nyílt forráskódúvá válását.",
      "A tervezők és a fejlesztők közötti együttműködést a szoftverfejlesztés során a felhasználói élmény (UX) szempontjából kulcsfontosságúnak tartják, bemutatva a Figma és az olyan eszközök, mint a Penpot közötti eltérő véleményeket a felhasználói felület tervezéséről."
    ],
    "points": 232,
    "commentCount": 67,
    "retryCount": 0,
    "time": 1714526230
  },
  {
    "id": 40213400,
    "title": "Európa vállalkozói ébresztője",
    "originLink": "https://klinger.io/posts/eu-acc",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213400",
    "commentBody": "",
    "originSummary": [
      "A szerző megkérdőjelezi a sztereotípiákat az európai vállalkozók kemény munkájának és kockázatvállaló mentalitásának bemutatásával, és szembeszáll azzal a vélekedéssel, hogy az európaiak az amerikaiakhoz képest lusták és kockázatkerülők.",
      "A javaslatok között szerepel egy egységes jogi személy létrehozása az EU-ban, az angol nyelvű oktatás javítása, valamint az egységes üzleti piac kiépítésére való törekvés az olyan akadályok, mint a szabályozási eltérések és az induló vállalkozások korai szakaszának korlátozott támogatása, leküzdése érdekében.",
      "E javaslatok célja, hogy elősegítsék a vállalkozói környezet javulását Európában, és arra ösztönözzék a politikai döntéshozókat, hogy gondolják át a kontinens vállalkozói tevékenységének fellendítését célzó stratégiákat."
    ],
    "commentSummary": [
      "A munkakultúra különbségei az amerikai szoftverfejlesztők által kedvelt kockázatvállalást mutatják az európai biztonsági hangsúlyokkal szemben.",
      "San Francisco a kockázatvállalás és a hosszú munkaidő egyedülálló központjaként tűnik ki az amerikai technológiai szektorban, ami hatással van a termelékenységre és a felvételi gyakorlatra.",
      "A beszélgetés az európai technológiai vállalatok előtt álló kihívásokról szól a Brexit után, hangsúlyozva az angol nyelvtudás és a beruházások fontosságát, hogy versenyezni tudjanak a domináns amerikai piaccal a mesterséges intelligencia területén."
    ],
    "points": 228,
    "commentCount": 277,
    "retryCount": 0,
    "time": 1714497156
  },
  {
    "id": 40213292,
    "title": "Neurális hálózatok felfedezése differenciálható programozással",
    "originLink": "https://www.sscardapane.it/alice-book",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40213292",
    "commentBody": "",
    "originSummary": [
      "Az \"Alice kalandjai a differenciálható csodaországban\" című könyv a neurális hálózatokat és a differenciálható programozást mutatja be, hangsúlyt fektetve az automatikus differenciálásra a függvények optimalizálása érdekében.",
      "A könyv a szekvenciák, gráfok, szövegek és hangok tervezési technikáit tárgyalja, a konvolúciós, figyelmi és rekurrens blokkokra összpontosítva, és a PyTorch és a JAX segítségével olyan fejlett modelleket ismertet, mint a nagy nyelvi modellek és a multimodális architektúrák.",
      "A további fejezetek olyan témákat járnak körül, mint a modell újrafelhasználása, a sűrűségbecslés, a feltételes számítás és a modell hibakeresése, az elmélet és a gyakorlati kódimplementáció összekapcsolása céljából."
    ],
    "commentSummary": [
      "A tárgyalás kiterjed a neurális hálózatok differenciálható primitívek segítségével történő optimalizálására, valamint a gradiens alapú módszerek, például a sztochasztikus gradiens leszállás és a véletlenszerű súlyperturbáció kihívásaira.",
      "A hangsúlyt az algoritmusok pontos leírására, a matematikai fogalmak mély megértésére, a Jacobi-mátrixok beépítésére, valamint a funkcionális és a hagyományos programozás megkülönböztetésére helyezik a neurális hálózatokban.",
      "Viták a mesterséges neurális hálózatok és a biológiai neuronok közötti kapcsolatról, a számítási teljesítmény, a műveletek, az általánosító gradiensek és a szellemi tulajdonnal kapcsolatos lehetséges jogi kérdések közötti különbségekről."
    ],
    "points": 185,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1714496616
  },
  {
    "id": 40209382,
    "title": "A Tesla elbocsátja a teljes Supercharger csapatot",
    "originLink": "https://electrek.co/2024/04/29/tesla-conducting-more-layoffs-including-entire-supercharger-team/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40209382",
    "commentBody": "",
    "originSummary": [
      "A Tesla további elbocsátásokat hajt végre, a leépítések a teljes Supercharger-csapatot érintik.",
      "A vállalat döntése, hogy a Supercharger csapatot is bevonja a leépítésekbe, a Supercharger-hálózatnak a Tesla infrastruktúrájában betöltött fontos szerepe miatt hívta fel magára a figyelmet."
    ],
    "commentSummary": [
      "A részvényesek vitatják Elon Musk vezetését, döntéshozatalát és a közelmúltbeli elbocsátásokat, beleértve az 55 milliárd dolláros részvénytámogatást.",
      "Aggályok merülnek fel a SpaceX és a Tesla fenntarthatóságával és jövedelmezőségével, Musk viselkedésének megváltozásával és a vállalatok munkahelyi biztonságával kapcsolatban.",
      "Továbbra is kérdéses Musk vezetői hatékonysága, vállalatainak jövője, valamint döntéseinek hatása a cégek értékelésére és sikerére."
    ],
    "points": 178,
    "commentCount": 200,
    "retryCount": 0,
    "time": 1714473195
  },
  {
    "id": 40219201,
    "title": "A DEA átminősíti a kannabiszt az I-es listáról a III-as listára",
    "originLink": "https://norml.org/blog/2024/04/30/dea-accepts-health-agencys-recommendation-to-reclassify-cannabis/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40219201",
    "commentBody": "",
    "originSummary": [
      "A DEA az Egészségügyi és Emberi Szolgálatok Minisztériumának ajánlása alapján a kannabiszt az I. jegyzékből a III. jegyzékbe sorolja át, elismerve annak terápiás előnyeit.",
      "Az átsorolás ellenére az állami és a szövetségi kannabisztörvények közötti eltérések miatt továbbra is kihívások állnak fenn.",
      "Az eljárás magában foglalja a Fehér Ház irányítási és költségvetési hivatala által végzett felülvizsgálatot, a nyilvánosság visszajelzéseit, közigazgatási meghallgatásokat és a végső döntést, mielőtt bármilyen változtatás végrehajtásra kerülne."
    ],
    "commentSummary": [
      "A DEA elfogadta a kannabisz átminősítését egy egészségügyi szervezet útmutatását követően.",
      "Ez a döntés jelentős változást jelent a kannabisz jogi státuszában.",
      "További részletekért kérjük, látogasson el a megadott linkre."
    ],
    "points": 177,
    "commentCount": 2,
    "retryCount": 0,
    "time": 1714534174
  },
  {
    "id": 40218021,
    "title": "A kreativitás felszabadítása a StoryDiffusion segítségével",
    "originLink": "https://storydiffusion.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40218021",
    "commentBody": "",
    "originSummary": [
      "A StoryDiffusion egy sokoldalú eszköz, amely a következetes önfigyelmet kihasználva lenyűgöző képregényeket, kiváló minőségű videókat hoz létre, és fenntartja a karakterek következetességét.",
      "Konzisztens rajzfilmfigurák képeit generálja, több karakterazonosítót kezel egyidejűleg, és képes a felhasználó által megadott képeket feltételként beépíteni.",
      "A Bulma stílusa által ihletett eszköz mozgás-előrejelzőt használ a kimeneti minőség és az egyediség fokozása érdekében."
    ],
    "commentSummary": [
      "A StoryDiffusion egy olyan eszköz, amellyel természetes mozgású képeket és videókat lehet készíteni, bár a felhasználók folytonossági hibákat észleltek.",
      "A felhasználók megvitatják a generatív mesterséges intelligencia használatát a hiánypótló tartalmak létrehozására és a potenciális spameket, aggodalmukat fejezik ki a GitHub link adatvédelmével és az Amazonon automatikusan generált e-könyvek minőségével kapcsolatban.",
      "A beszélgetés a generatív mesterséges intelligencia technológia képességeit és korlátait tárja fel."
    ],
    "points": 173,
    "commentCount": 42,
    "retryCount": 0,
    "time": 1714522028
  },
  {
    "id": 40214763,
    "title": "Arti: Tor anonimitási protokollokat implementáló Rust projekt",
    "originLink": "https://tpo.pages.torproject.net/core/arti/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40214763",
    "commentBody": "",
    "originSummary": [
      "Az Arti egy Rust projekt, amely a Tor anonimitási protokollokat valósítja meg, és egy működőképes Tor klienst biztosít, amely korai támogatást nyújt a hagymás szolgáltatásokhoz.",
      "A fejlesztés folyamatban van a biztonság növelése érdekében, hogy megfeleljen a C Tor implementációnak, így jelenleg csak kísérleti célokra alkalmas.",
      "A legfrissebb kiadás az 1.2.0 verzió, amely különböző forrásokat kínál, mint például README, forrástár, API dokumentáció, hozzájárulási irányelvek, GYIK és Torral kapcsolatos részletek."
    ],
    "commentSummary": [
      "A cikk az Arti, egy Rust nyelven kódolt Tor implementációval foglalkozik, betekintést nyújt a fejlesztésébe, a finanszírozásba és javaslatokat tesz a kísérleti felhasználásra.",
      "Vita bontakozik ki az Arti jelenlegi állapotáról és potenciális biztonsági sebezhetőségéről, felhívva a figyelmet a felhasználók számára fontos szempontokra.",
      "Az Arti in Rust egyedülálló perspektívát kínál a Tor implementációkhoz, és a fejlesztési szempontok és a biztonsági vonatkozások miatt érdeklődésre tart számot."
    ],
    "points": 164,
    "commentCount": 22,
    "retryCount": 0,
    "time": 1714503262
  }
]
