[
  {
    "id": 41184365,
    "title": "HIV'in Önlenmesi",
    "originLink": "https://www.science.org/content/blog-post/prevention-hiv",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184365",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Lenacapavir, yeni bir HIV tedavisi olarak, her altı ayda bir uygulanan uzun etkili bir ilaç olarak umut vaat ediyor ve yeni vakaları %90-95 oranında azaltma potansiyeline sahip.",
      "Virüsün kapsidini engelleyerek çalışır, replikasyonu önler ve florinler dahil kimyasal yapısı nedeniyle uzun bir yarı ömre sahiptir.",
      "Bu, HIV önlenmesinde önemli bir ilerlemeyi temsil ederken, özellikle ABD'de ilaç direnci, maliyet ve erişilebilirlik konusundaki endişeler devam etmektedir."
    ],
    "points": 610,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1723057899
  },
  {
    "id": 41188295,
    "title": "Google ve Meta, gençleri hedef almak için gizli reklam anlaşması yaptı",
    "originLink": "https://www.ft.com/content/b3bb80f4-4e01-4ce6-8358-f4f8638790f8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188295",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Google ve Meta, Google'ın 18 yaş altı kişilere yönelik reklamları kişiselleştirme kurallarını ihlal ederek, gençlere yönelik reklam hedeflemesi konusunda gizlice iş birliği yaptı.",
      "Bu, çocukları reklamlarla hedef almanın etik tartışmalarını ateşledi ve tarihi ve modern tartışmalı pazarlama uygulamalarıyla karşılaştırmalar yapılmasına yol açtı.",
      "Bu tartışma, mahremiyet, veri toplama ve büyük teknoloji şirketlerinin etkisi konusundaki daha geniş endişeleri vurguluyor ve savunmasız grupları korumak için daha sıkı düzenlemeler yapılması çağrılarını tetikliyor."
    ],
    "points": 465,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1723093698
  },
  {
    "id": 41184359,
    "title": "Nasa, Boeing Starliner astronotlarının 2025'te SpaceX ile eve dönebileceğini söylüyor",
    "originLink": "https://www.nytimes.com/2024/08/07/science/boeing-starliner-nasa-spacex.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184359",
    "commentBody": "",
    "originSummary": [
      "Nasa, Boeing'in Starliner uzay aracındaki sorunların başlangıçta düşünülenden daha ciddi olabileceğini kabul etti ve bu durum, astronotlar Suni Williams ve Butch Wilmore'un 2025'te SpaceX'in Crew Dragon'u ile Dünya'ya dönmelerini gerektirebilir.",
      "Uluslararası Uzay İstasyonu'ndaki (ISS) astronotların kalışı gelecek yıla kadar uzayabilir, NASA, Williams ve Wilmore'un altı aylık kalışını sağlamak için bir sonraki Crew Dragon'u sadece iki astronotla fırlatmayı düşünüyor.",
      "Boeing, Starliner programında 125 milyon dolarlık bir zarar yazımı da dahil olmak üzere birçok aksilikle karşılaştı ve NASA'nın bu konudaki kararının Ağustos ortasına kadar açıklanması bekleniyor. Crew Dragon fırlatması ise en erken 24 Eylül'e ertelendi."
    ],
    "commentSummary": [
      "Nasa, Starliner ile ilgili güvenlik endişeleri nedeniyle 2025 yılında Boeing Starliner astronotlarını Dünya'ya geri getirmek için SpaceX'in Dragon kapsülünü kullanmayı düşünüyor.",
      "Nasa mühendisleri risk konusunda ikiye bölünmüş durumda, bazıları Dragon kapsülünü tercih ediyor; Crew-9 fırlatma hazırlıklarıyla uyumlu olması için kararın Ağustos ortasında alınması bekleniyor.",
      "Mevcut itici güç sorunlarına rağmen, NASA, astronot güvenliğinin uzay görevlerindeki karmaşıklıklarını ve önceliklerini vurgulayarak, Starliner'ı gelecekteki görevler için hala sertifikalandırabilir."
    ],
    "points": 353,
    "commentCount": 462,
    "retryCount": 0,
    "time": 1723057854
  },
  {
    "id": 41188647,
    "title": "RLHF, zar zor RL'dir",
    "originLink": "https://twitter.com/karpathy/status/1821277264996352246",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188647",
    "commentBody": "",
    "originSummary": [
      "İnsan Geri Bildiriminden Pekiştirmeli Öğrenme (RLHF), büyük dil modellerini eğitmede ön eğitim ve denetimli ince ayardan sonra gelen son önemli aşamadır.",
      "Eleştiri, RLHF'nin gerçek anlamda pekiştirmeli öğrenme olarak kabul edilme kriterlerini zar zor karşıladığını öne sürüyor."
    ],
    "commentSummary": [
      "Yapay zeka kodlama yardımı, test yazabilen, kod yazabilen, derleyebilen ve çözümler arayabilen, denetimsiz bir döngüde çalışan, gelecekteki modeller için eğitim verisi üreten kodlama yapay zekası ile önemli ölçüde ilerlemesi bekleniyor.",
      "Dil modelleri (LLM'ler), teorem doğrulama yazılımından aldıkları doğru geri bildirimler sayesinde matematiksel teorem ispatında başarılı olabilirler ve bu da program doğruluğunun resmi doğrulamasını iyileştirerek açıklamalar oluşturmalarını sağlayabilir.",
      "Bu tartışma, yazılım geliştirme sürecinin yinelemeli doğası ve sorunların belirlenmesinin karmaşıklığı ile karşılaştırıldığında, programlamada yapay zeka için net ödül fonksiyonları tanımlamanın zorluklarını vurgulamaktadır."
    ],
    "points": 343,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1723098138
  },
  {
    "id": 41192118,
    "title": "Firefox Kenar Çubuğu ve Dikey Sekmeler: deneyin",
    "originLink": "https://blog.nightly.mozilla.org/2024/08/07/firefox-sidebar-and-vertical-tabs-try-them-out-in-nightly-firefox-labs-131/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192118",
    "commentBody": "",
    "originSummary": [
      "Firefox Nightly 131, bağlam değiştirme ve çoklu görev yapmayı iyileştirmeyi amaçlayan dikey sekmeler ve yeni bir kenar çubuğu deneyimi sunuyor.",
      "Bu özellikleri etkinleştirmek için kullanıcılar en son Nightly sürümüne güncelleme yaparak Ayarlar > Firefox Labs bölümüne gidip Kenar Çubuğu ve Dikey sekmeler deneylerini etkinleştirebilirler.",
      "Topluluk, bu özellikleri test etmeye ve Mozilla Connect üzerinden geri bildirim sağlamaya teşvik edilmektedir, web uzantısı geliştiricilerinin ise uyumluluğu kontrol etmeleri tavsiye edilmektedir."
    ],
    "commentSummary": [
      "Firefox, sekme yönetimini geliştirmeyi amaçlayan dikey sekmeler ve bir kenar çubuğu için yeni bir özelliği nightly build sürümünde tanıttı.",
      "Bu özellik, gelişmiş sekme organizasyonu için popüler olan Tree Style Tab ve Sidebery gibi uzantılara fayda sağlayabilir.",
      "Kullanıcı geri bildirimleri karışık; bazıları daha iyi ekran alanı kullanımı için dikey sekmeleri tercih ederken, diğerleri geleneksel yatay sekmelere veya birden fazla tarayıcı penceresine bağlı kalıyor."
    ],
    "points": 312,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1723128408
  },
  {
    "id": 41191069,
    "title": "RP2350 ile neredeyse tüm dileklerim gerçekleşti",
    "originLink": "https://dmitry.gr/?r=06.%20Thoughts&proj=11.%20RP2350",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41191069",
    "commentBody": "",
    "originSummary": [
      "RP2350 mikrodenetleyici, daha iyi çekirdek performansı, daha fazla DMA kanalı ve geliştirilmiş PIO birimleri gibi RP2040'ın birçok sınırlamasını ele alıyor.",
      "RP2350'nin temel özellikleri arasında çift Cortex-M33F çekirdekleri, 300MHz'de kararlı hız aşırtma, iki katına çıkarılmış RAM ve güvenilir QSPI PSRAM desteği bulunmaktadır.",
      "RP2350, DEFCON 32 rozet projesinde sergilendi ve yeteneklerini vurgulayarak daha iyi performans ve güvenilirlik için STM32H7 serisine üstün bir alternatif olarak önerildi."
    ],
    "commentSummary": [
      "Raspberry Pi tarafından tasarlanan RP2350 mikrodenetleyici, 150 MHz hızında çalışan ARM Cortex-M33 çekirdekleri ve RISC-V Hazard3 çekirdekleri arasında bir seçim sunar ve kullanıcıların her iki çekirdeği de aynı anda çalıştırmasına olanak tanır.",
      "RP2350, sağlam güvenlik özellikleri, düşük güç tüketimi ve orijinal Pico form faktörü ile uyumluluk sunarak RP2040'a göre önemli bir yükseltme sağlar.",
      "RP2350'de değiştirilebilir çekirdeklerin (ARM ve RISC-V) tanıtılması, RISC-V'ye geçişi kolaylaştırmak için stratejik bir hamle olarak görülüyor ve açık kaynak donanımla ilgilenen teknoloji meraklıları ve geliştiricileri çekiyor."
    ],
    "points": 268,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1723122202
  },
  {
    "id": 41192341,
    "title": "Raspberry Pi Pico 2, yeni 5 dolarlık mikrodenetleyici kartımız, şimdi satışta",
    "originLink": "https://www.raspberrypi.com/news/raspberry-pi-pico-2-our-new-5-microcontroller-board-on-sale-now/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192341",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Yeni $5 mikrodenetleyici kartı Raspberry Pi Pico 2, artık mevcut olup, önyüklemede seçilebilir çift çekirdekli ARM Cortex-M33 ve RISC-V çekirdekleri içermektedir.",
      "Artan GPIO pinleri, PIO durum makineleri ve DMA kanalları gibi geliştirilmiş özelliklere rağmen, bazı kullanıcılar hala Micro USB yerine USB-C kullanıldığı için hayal kırıklığına uğramış durumda.",
      "Pico 2 W adlı kablosuz özellikli bir versiyonun yıl sonuna kadar çıkması bekleniyor, ancak bazı kullanıcılar dahili kablosuz özellikleri nedeniyle ESP32'yi tercih ediyor."
    ],
    "points": 220,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1723129761
  },
  {
    "id": 41192303,
    "title": "Kozmik: Yeni Bir Masaüstü Ortamı",
    "originLink": "https://system76.com/cosmic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192303",
    "commentBody": "",
    "originSummary": [
      "COSMIC, modüler bir masaüstü ortamı ile kullanıcı deneyimleri tasarlamak için yeni bir yazılım platformudur ve şu anda ilk alfa sürümü olan COSMIC Epoch 1'de bulunmaktadır.",
      "Platform, özelleştirme ve gelişmiş işlevselliğe odaklanarak Pop!_OS 24.04 LTS alpha ve diğer Linux dağıtımlarında test için kullanılabilir.",
      "Temel özellikler arasında özelleştirilebilir paneller, otomatik döşeme pencereleri, geliştirilmiş temalandırma ve bağımsız uygulamalar bulunur; bunların hepsi, kararlılık ve performans için Rust dilinde yazılmıştır."
    ],
    "commentSummary": [
      "Sistem76, Iced tabanlı yeni bir GUI araç seti ve Rust ile geliştirilen yeni bir Wayland kompozitörü kullanılarak oluşturulan yeni bir masaüstü ortamı (DE) olan Cosmic'in ilk alfa sürümünü yayınladı.",
      "Yayın, i3/sway ile aşina olan kullanıcıları çeken entegre döşeme desteğini içeriyor ve tam klavye navigasyonu ile yalın, hafif ve hızlı bir DE vaat ediyor.",
      "Reaksiyonlar karışık, bazı kullanıcılar yenilik ve potansiyel iyileştirmeler konusunda heyecanlıyken, diğerleri tasarım ve kullanılabilirlik konusunda endişeli."
    ],
    "points": 211,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1723129518
  },
  {
    "id": 41185783,
    "title": "GPT-4 LLM, sosyal bilimler deneylerini yeniden oluşturacak kadar iyi bir şekilde insanları simüle eder.",
    "originLink": "https://www.treatmenteffect.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41185783",
    "commentBody": "",
    "originSummary": [
      "Demo, özellikle ABD'li yetişkinler üzerindeki tedavi etkilerini tahmin etmek için GPT-4o-mini kullanan bir aracı sergiliyor.",
      "Bu araç, koşullar arasındaki karşıtlıkların yönünü tahmin etmede yaklaşık %70-80 doğruluğa sahiptir ve tahmin edilen ve gerçek etki büyüklükleri arasında güçlü bir korelasyon (r = .85) bulunmaktadır.",
      "Uygulamalar arasında müdahale tasarımı, katılımcı zararını en aza indirme, çalışma materyallerinin pilot testi ve alt grup etkilerini tahmin etme yer alır, ancak potansiyel önyargılar nedeniyle dikkatli olunması tavsiye edilir."
    ],
    "commentSummary": [
      "GPT-4 LLM (Büyük Dil Modeli), sosyal bilimler deneylerini çoğaltmak için insan davranışını yeterince iyi simüle edebilir ve sonuçları %69 doğrulukla tahmin edebilir, bu da %66 doğrulukla tahmin yapan insan öngörücülerden biraz daha iyidir.",
      "Eleştirmenler, modelin tahminlerinin, tekrarlamayı amaçladığı deneyleri içerebilecek olan eğitim verilerinden etkilenebileceğini, bu durumun da modelin gerçek öngörü gücü hakkında endişeler yarattığını savunuyorlar.",
      "Bu tartışma, sosyal bilimlerde devam eden replikasyon krizini vurgulamakta ve LLM'lerin ilgi çekici olasılıklar sunduğunu, ancak soruna kesin bir çözüm olmadığını önermektedir."
    ],
    "points": 197,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1723066236
  },
  {
    "id": 41189971,
    "title": "Bir eBPF Linux çekirdek güvenlik açığını nasıl bulduk ve düzelttik",
    "originLink": "https://bughunters.google.com/blog/6303226026131456/a-deep-dive-into-cve-2023-2163-how-we-found-and-fixed-an-ebpf-linux-kernel-vulnerability",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41189971",
    "commentBody": "",
    "originSummary": [
      "CVE-2023-2163, Linux çekirdeğinin eBPF (genişletilmiş Berkeley Paket Filtresi) alt sisteminde yeni keşfedilen bir güvenlik açığını tartışan blog.",
      "Bu, güvenlik uzmanları ve geliştiriciler için değerli bilgiler sunarak keşif sürecini, potansiyel etkileri ve güvenlik açığını düzeltmek için atılan adımları ayrıntılarıyla açıklar.",
      "Bu gönderi, birçok sistemde kritik bir bileşen olan Linux çekirdeğini güvence altına alma çabalarını vurguladığı ve proaktif zafiyet yönetiminin önemini vurguladığı için önemlidir."
    ],
    "commentSummary": [
      "Linux çekirdeğindeki eBPF (genişletilmiş Berkeley Paket Filtresi) zafiyeti keşfedildi ve düzeltildi, bu da çekirdek çöküşlerini önlemede eBPF doğrulayıcısının önemini vurguladı.",
      "eBPF doğrulayıcı hataları önemlidir, ancak genellikle yetkisiz kodun eBPF programlarını yükleyemediği platformları etkilemez, bu da onları sunucu ortamlarında daha yönetilebilir hale getirir.",
      "Kompleksliğine rağmen, eBPF esnekliği ve özel çekirdek yamaları gerektirecek sorunları çözme yeteneği nedeniyle büyük teknoloji şirketleri tarafından yaygın olarak kullanılmakta ve desteklenmektedir."
    ],
    "points": 191,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1723113546
  },
  {
    "id": 41188966,
    "title": "FlexAttention: PyTorch'un Esnekliği ile FlashAttention'un Performansı",
    "originLink": "https://pytorch.org/blog/flexattention/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188966",
    "commentBody": "",
    "originSummary": [
      "FlexAttention, FlashAttention gibi mevcut optimize edilmiş uygulamaların sınırlamalarını ele alarak, makine öğrenimi modellerinde çeşitli dikkat mekanizmalarının uygulanmasını basitleştirmek için tasarlanmış yeni bir PyTorch API'sidir.",
      "Bu, araştırmacıların dikkat varyantlarını minimum kodla uygulamalarına olanak tanır, ekstra bellek kullanımı olmadan rekabetçi performans sağlar ve softmax'tan önce dikkat puanlarını değiştirmek için kullanıcı tanımlı işlevleri destekler.",
      "FlexAttention, PyTorch'un gece sürümlerinde mevcuttur ve 2.5.0 sürümünde prototip bir özellik olarak yer alacaktır. Performans ve ek destek özellikleri için gelecekte iyileştirmeler planlanmaktadır."
    ],
    "commentSummary": [
      "FlexAttention, dikkat mekanizmalarının optimizasyonunu basitleştirerek PyTorch'un esnekliğini FlashAttention'ın yüksek performansıyla birleştirir.",
      "İleri geçişte FlashAttention2'nin performansının %90'ına ve geri geçişte %85'ine ulaşır, ancak FlashAttention-3 hala daha hızlıdır.",
      "Mevcut büyük dil modeli (LLM) iş yüklerinin çoğunda dikkat mekanizmaları ana hesaplama darboğazı olmasa da, veri ölçeklendikçe bunların optimizasyonu kritik hale gelecektir."
    ],
    "points": 175,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1723101898
  },
  {
    "id": 41186310,
    "title": "Argdown, argüman haritalama için Markdown gibi",
    "originLink": "https://argdown.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41186310",
    "commentBody": "",
    "originSummary": [
      "Argdown v1.8.2, Şubat 2022'de yayınlandı ve karmaşık tartışmalar için basit bir sözdizimi sunarak, artıları ve eksileri bir Twitter mesajı gibi yazmayı kolaylaştırdı.",
      "Argdown, Markdown içinde argüman haritaları oluşturmak için kullanılabilir ve bu haritalar PDF olarak yayınlanabilir, web sayfalarına gömülebilir veya görüntü olarak dışa aktarılabilir.",
      "Argdown için araçlar arasında bir tarayıcı sanal alanı, canlı önizleme ve sözdizimi vurgulama özelliklerine sahip bir VS Code uzantısı ve özel işlemler ve çoklu dışa aktarımlar için bir komut satırı aracı bulunmaktadır."
    ],
    "commentSummary": [
      "Argdown, tartışmaları argüman ağaçları olarak sunmak için kullanılan bir araçtır, tıpkı Markdown'ın metni biçimlendirmesi gibi.",
      "Gerçek dünya argümanları genellikle daha karmaşıktır, basit ağaçlar yerine ağırlıklı kenarları olan Yönlendirilmiş Asiklik Grafiklere (DAG'lere) benzer.",
      "LLM-gömme gibi ileri teknikler ve UMAP gibi görselleştirme araçları, argümanların temsilini geliştirebilir ve Kialo ve Obsidian gibi platformlar benzer argüman haritalama özellikleri sunar."
    ],
    "points": 167,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1723070700
  },
  {
    "id": 41184559,
    "title": "Mistral Ajanları",
    "originLink": "https://mistral.ai/news/build-tweak-repeat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184559",
    "commentBody": "",
    "originSummary": [
      "Mistral AI, Mistral Large 2 ve Codestral gibi modelleri temel istemler, birkaç örnekle isteme veya kendi veri setleriyle ince ayar yaparak geliştiricilerin özelleştirmesine olanak tanıyan model özelleştirmelerinde ilerlemeler duyurdu.",
      "Le Chat veya API üzerinde özel davranışlar ve iş akışlarını mümkün kılan ek bağlam ve talimatlarla sarılmış modelleri tanıtan bir alpha sürümü olan Agents tanıtıldı.",
      "Mistralai kütüphanesinin kararlı sürümü, mistralai 1.0, artık Python ve Typescript için kullanılabilir, kullanılabilirliği ve tutarlılığı artırıyor."
    ],
    "commentSummary": [
      "Mistral Ajanları, bir sistem istemi ve sıcaklığı bir modele bağlayan yeni bir özelliktir ve talimatlar ve örneklerle özel davranışlar ve iş akışları oluşturmayı amaçlar.",
      "Özellik hala geliştirme aşamasında olup, Ajanları araçlara ve veri kaynaklarına bağlama planları bulunmaktadır, ancak bu entegrasyonlar henüz mevcut değildir.",
      "‘Ajanlar’ terimi belirsiz ve gevşek tanımlanmış olarak görülüyor, bazı kullanıcılar bunu özel GPT'ler veya OpenAI'nin GPT Mağazası gibi diğer yapay zeka çerçeveleriyle karşılaştırıyor."
    ],
    "points": 158,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1723059166
  },
  {
    "id": 41189946,
    "title": "Haberler Bilgi Abur Cuburudur (2022)",
    "originLink": "https://chuck.is/news/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41189946",
    "commentBody": "",
    "originSummary": [
      "Yazar, haber tüketimini azaltmanın kaygılarını önemli ölçüde azalttığını ve diğer ilgi alanlarına zaman ayırmalarını sağladığını, modern haberlerin bilgi vermekten çok eğlence amaçlı olduğunu öne sürüyor.",
      "Birkaç şirketin çoğu medyayı kontrol ettiğini, bu durumun tıklamalar ve reklam gelirlerine odaklanan önyargılı hikayelere yol açtığını, duygusal tepkileri tetikleyebileceğini ve mevcut önyargıları pekiştirebileceğini vurguluyorlar.",
      "Yazar, daha sağlıklı bir zihinsel durum ve daha verimli bir zaman kullanımı elde etmek için 24 saatlik haber döngüsü yerine uzun biçimli okumayı ve anlamlı faaliyetleri vurgulayarak, bilgi tüketimine seçici bir yaklaşımı savunuyor."
    ],
    "commentSummary": [
      "Haberler genellikle abur cubur yiyeceklere benzetilir, hızlı, sansasyonel içerik sunarak gerçekliği çarpıtabilir ve aşırı görüşleri teşvik edebilir.",
      "Gazeteciliğin iş modeli, okuyucuların inançlarıyla örtüşen içeriği tercih etme eğilimindedir, bu da taraflı haberciliğe ve yanlış bilgilere yol açabilir, bu da demokrasilere zarar verebilir.",
      "Bu sorunları hafifletmek için öneriler arasında yerel haberlere, uzun biçimli gazeteciliğe ve haber sitelerinin bağımsız sıralamalarına odaklanmak, kalite ve şeffaflığı sağlamak bulunmaktadır."
    ],
    "points": 149,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1723113270
  },
  {
    "id": 41193968,
    "title": "İşverenler, çalışanların istifa etmesi için ofise dönüşü kullandı",
    "originLink": "https://thehill.com/opinion/technology/4800828-office-mandates-cause-attrition/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41193968",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "İşverenler, yılların çeşitlilik çabalarını tersine çevirerek, dolaylı olarak istifaları teşvik etmek için ofise dönüş (RTO) politikalarını kullanıyor.",
      "Böyle bir yaklaşım, kadınları ve bakıcıları orantısız bir şekilde etkileyerek öngörülebilir istifalara ve şirket kültürü ile verimliliğine potansiyel zararlar vermeye yol açar.",
      "Eleştirmenler, RTO politikalarının işten çıkarmalar olmadan çalışan sayısını azaltmak için kısa vadeli bir taktik olduğunu ve bunun uzun vadeli iş sağlığına zarar verebileceğini savunuyorlar."
    ],
    "points": 134,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1723137662
  }
]
