[
  {
    "id": 41184365,
    "title": "एचआईवी की रोकथाम",
    "originLink": "https://www.science.org/content/blog-post/prevention-hiv",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184365",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "लेनाकापाविर, एक नया एचआईवी उपचार, हर छह महीने में दी जाने वाली एक दीर्घकालिक दवा के रूप में आशाजनक दिखता है, जो नए मामलों को 90-95% तक कम कर सकता है।",
      "यह वायरस के कैप्सिड में हस्तक्षेप करके काम करता है, प्रतिकृति को रोकता है, और इसमें फ्लोरीन सहित इसकी रासायनिक संरचना के कारण लंबा आधा जीवन होता है।",
      "हालांकि यह एचआईवी रोकथाम में एक महत्वपूर्ण प्रगति का प्रतिनिधित्व करता है, दवा प्रतिरोध, लागत, और पहुंच के बारे में चिंताएं बनी रहती हैं, विशेष रूप से अमेरिका में।"
    ],
    "points": 610,
    "commentCount": 255,
    "retryCount": 0,
    "time": 1723057899
  },
  {
    "id": 41188295,
    "title": "गूगल और मेटा ने किशोरों को लक्षित करने के लिए गुप्त विज्ञापन समझौता किया",
    "originLink": "https://www.ft.com/content/b3bb80f4-4e01-4ce6-8358-f4f8638790f8",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188295",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "गूगल और मेटा ने गुप्त रूप से किशोरों के लिए विज्ञापन लक्ष्यीकरण पर सहयोग किया, जिससे गूगल के अपने नियमों का उल्लंघन हुआ जो 18 वर्ष से कम उम्र के लोगों के लिए व्यक्तिगत विज्ञापनों पर रोक लगाते हैं।",
      "इसने बच्चों को विज्ञापनों के माध्यम से लक्षित करने के बारे में नैतिक बहसों को जन्म दिया है, जिससे ऐतिहासिक और आधुनिक विवादास्पद विपणन प्रथाओं की तुलना की जा रही है।",
      "विवाद गोपनीयता, डेटा संग्रहण, और बड़ी तकनीकी कंपनियों के प्रभाव के बारे में व्यापक चिंताओं को उजागर करता है, जिससे कमजोर समूहों की सुरक्षा के लिए कड़े नियमों की मांग बढ़ रही है।"
    ],
    "points": 465,
    "commentCount": 241,
    "retryCount": 0,
    "time": 1723093698
  },
  {
    "id": 41184359,
    "title": "नासा का कहना है कि बोइंग स्टारलाइनर अंतरिक्ष यात्री 2025 में स्पेसएक्स पर घर लौट सकते हैं",
    "originLink": "https://www.nytimes.com/2024/08/07/science/boeing-starliner-nasa-spacex.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184359",
    "commentBody": "",
    "originSummary": [
      "नासा ने स्वीकार किया है कि बोइंग के स्टारलाइनर अंतरिक्ष यान की समस्याएं प्रारंभिक अनुमान से अधिक गंभीर हो सकती हैं, जिससे संभवतः अंतरिक्ष यात्री सुनी विलियम्स और बुच विलमोर को 2025 में स्पेसएक्स के क्रू ड्रैगन पर पृथ्वी पर लौटने की आवश्यकता हो सकती है।",
      "अंतर्राष्ट्रीय अंतरिक्ष स्टेशन (ISS) पर अंतरिक्ष यात्रियों का प्रवास अगले वर्ष तक बढ़ सकता है, क्योंकि नासा विलियम्स और विलमोर के छह महीने के प्रवास को समायोजित करने के लिए केवल दो अंतरिक्ष यात्रियों के साथ अगला क्रू ड्रैगन लॉन्च करने पर विचार कर रहा है।",
      "Boeing को Starliner कार्यक्रम के साथ कई झटकों का सामना करना पड़ा है, जिसमें $125 मिलियन का नुकसान भी शामिल है, और इस मामले पर NASA का निर्णय मध्य अगस्त तक आने की उम्मीद है, जबकि Crew Dragon का प्रक्षेपण 24 सितंबर से पहले नहीं होगा।"
    ],
    "commentSummary": [
      "नासा सुरक्षा चिंताओं के कारण 2025 में बोइंग स्टारलाइनर अंतरिक्ष यात्रियों को पृथ्वी पर वापस लाने के लिए स्पेसएक्स के ड्रैगन कैप्सूल का उपयोग करने पर विचार कर रहा है।",
      "नासा के इंजीनियर जोखिम को लेकर विभाजित हैं, कुछ ड्रैगन कैप्सूल का समर्थन कर रहे हैं; क्रू-9 लॉन्च की तैयारियों के साथ तालमेल बिठाने के लिए मध्य अगस्त तक एक निर्णय की उम्मीद है।",
      "हालांकि मौजूदा थ्रस्टर समस्याएं हैं, फिर भी NASA भविष्य के मिशनों के लिए स्टारलाइनर को प्रमाणित कर सकता है, जो अंतरिक्ष मिशनों में जटिलताओं और अंतरिक्ष यात्रियों की सुरक्षा की प्राथमिकता को रेखांकित करता है।"
    ],
    "points": 353,
    "commentCount": 462,
    "retryCount": 0,
    "time": 1723057854
  },
  {
    "id": 41188647,
    "title": "RLHF बस मुश्किल से ही RL है",
    "originLink": "https://twitter.com/karpathy/status/1821277264996352246",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188647",
    "commentBody": "",
    "originSummary": [
      "मानव प्रतिक्रिया से सुदृढीकरण शिक्षण (RLHF) बड़े भाषा मॉडलों के प्रशिक्षण में अंतिम महत्वपूर्ण चरण है, जो पूर्व-प्रशिक्षण और पर्यवेक्षित फाइनट्यूनिंग के बाद आता है।",
      "आलोचना यह सुझाव देती है कि RLHF शायद ही सच्चे सुदृढीकरण शिक्षण के मानदंडों को पूरा करता है।"
    ],
    "commentSummary": [
      "एआई कोडिंग सहायता में महत्वपूर्ण प्रगति की उम्मीद है, जिसमें कोडिंग एआई परीक्षण लिखने, कोड लिखने, संकलन करने और बिना पर्यवेक्षण के समाधान खोजने में सक्षम होगा, और भविष्य के मॉडलों के लिए प्रशिक्षण डेटा उत्पन्न करेगा।",
      "भाषा मॉडल (LLMs) गणितीय प्रमेय सिद्ध करने में उत्कृष्ट हो सकते हैं क्योंकि प्रमेय सत्यापन सॉफ़्टवेयर से सटीक प्रतिक्रिया मिलती है, जिससे एनोटेशन उत्पन्न करके प्रोग्राम की शुद्धता के औपचारिक सत्यापन में सुधार हो सकता है।",
      "चर्चा में एआई के प्रोग्रामिंग में स्पष्ट इनाम कार्यों को परिभाषित करने की चुनौतियों पर प्रकाश डाला गया है, इसे समस्याओं को निर्दिष्ट करने की जटिलता और सॉफ्टवेयर विकास की पुनरावृत्तिमूलक प्रकृति से तुलना की गई है।"
    ],
    "points": 343,
    "commentCount": 213,
    "retryCount": 0,
    "time": 1723098138
  },
  {
    "id": 41192118,
    "title": "फ़ायरफ़ॉक्स साइडबार और वर्टिकल टैब्स: इन्हें आज़माएं",
    "originLink": "https://blog.nightly.mozilla.org/2024/08/07/firefox-sidebar-and-vertical-tabs-try-them-out-in-nightly-firefox-labs-131/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192118",
    "commentBody": "",
    "originSummary": [
      "फायरफॉक्स नाइटली 131 वर्टिकल टैब्स और एक नए साइडबार अनुभव को पेश करता है, जिसका उद्देश्य संदर्भ-स्विचिंग और मल्टीटास्किंग को सुधारना है।",
      "उपयोगकर्ता इन सुविधाओं को सक्षम कर सकते हैं नवीनतम नाइटली को अपडेट करके, सेटिंग्स > फ़ायरफ़ॉक्स लैब्स पर जाकर, और साइडबार और वर्टिकल टैब्स प्रयोगों को सक्रिय करके।",
      "समुदाय को इन सुविधाओं का परीक्षण करने और मोज़िला कनेक्ट पर प्रतिक्रिया देने के लिए प्रोत्साहित किया जाता है, जबकि वेब एक्सटेंशन डेवलपर्स को संगतता की जांच करने की सलाह दी जाती है।"
    ],
    "commentSummary": [
      "फायरफॉक्स ने अपने नाइटली बिल्ड में वर्टिकल टैब्स और साइडबार के लिए एक नया फीचर पेश किया है, जिसका उद्देश्य टैब प्रबंधन को बेहतर बनाना है।",
      "यह सुविधा Tree Style Tab और Sidebery जैसी एक्सटेंशनों को लाभ पहुंचा सकती है, जो उन्नत टैब संगठन के लिए लोकप्रिय हैं।",
      "उपयोगकर्ता प्रतिक्रिया मिश्रित है, कुछ बेहतर स्क्रीन स्पेस उपयोग के लिए वर्टिकल टैब्स को पसंद करते हैं, जबकि अन्य पारंपरिक क्षैतिज टैब्स या कई ब्राउज़र विंडो का उपयोग करते हैं।"
    ],
    "points": 312,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1723128408
  },
  {
    "id": 41191069,
    "title": "मुझे RP2350 के साथ मेरी लगभग सभी इच्छाएँ पूरी हो गईं",
    "originLink": "https://dmitry.gr/?r=06.%20Thoughts&proj=11.%20RP2350",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41191069",
    "commentBody": "",
    "originSummary": [
      "RP2350 माइक्रोकंट्रोलर अपने पूर्ववर्ती RP2040 की कई सीमाओं को दूर करता है, जिसमें बेहतर कोर प्रदर्शन, अधिक DMA चैनल, और उन्नत PIO इकाइयाँ शामिल हैं।",
      "RP2350 की प्रमुख विशेषताओं में ड्यूल Cortex-M33F कोर, 300MHz पर स्थिर ओवरक्लॉकिंग, दोगुनी RAM, और विश्वसनीय QSPI PSRAM समर्थन शामिल हैं।",
      "RP2350 को DEFCON 32 बैज प्रोजेक्ट में प्रदर्शित किया गया, जिसमें इसकी क्षमताओं को उजागर किया गया और इसे बेहतर प्रदर्शन और विश्वसनीयता के लिए STM32H7 श्रृंखला के एक श्रेष्ठ विकल्प के रूप में सुझाया गया।"
    ],
    "commentSummary": [
      "रास्पबेरी पाई द्वारा डिज़ाइन किया गया RP2350 माइक्रोकंट्रोलर, ARM Cortex-M33 कोर और RISC-V Hazard3 कोर के बीच एक विकल्प प्रदान करता है, दोनों 150 MHz पर चलते हैं, जिससे उपयोगकर्ता एक साथ दोनों में से एक को चला सकते हैं।",
      "RP2350 में मजबूत सुरक्षा विशेषताएँ, कम-शक्ति संचालन शामिल हैं, और यह मूल पिको फॉर्म फैक्टर के साथ संगत है, जिससे यह RP2040 की तुलना में एक महत्वपूर्ण उन्नयन बन जाता है।",
      "RP2350 में स्विचेबल कोर (ARM और RISC-V) का परिचय एक रणनीतिक कदम के रूप में देखा जा रहा है, जो RISC-V में संक्रमण को आसान बनाने के लिए है, और यह ओपन-सोर्स हार्डवेयर में रुचि रखने वाले तकनीकी उत्साही और डेवलपर्स को आकर्षित कर रहा है।"
    ],
    "points": 268,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1723122202
  },
  {
    "id": 41192341,
    "title": "रास्पबेरी पाई पिको 2, हमारा नया $5 माइक्रोकंट्रोलर बोर्ड, अब बिक्री के लिए उपलब्ध है",
    "originLink": "https://www.raspberrypi.com/news/raspberry-pi-pico-2-our-new-5-microcontroller-board-on-sale-now/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192341",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "रास्पबेरी पाई पिको 2, एक नया $5 माइक्रोकंट्रोलर बोर्ड, अब उपलब्ध है, जिसमें डुअल-कोर एआरएम कॉर्टेक्स-M33 और RISC-V कोर शामिल हैं, जिन्हें बूट के समय चुना जा सकता है।",
      "बेहतर स्पेसिफिकेशन्स जैसे अधिक GPIO पिन्स, PIO स्टेट मशीनें, और DMA चैनल्स के बावजूद, कुछ उपयोगकर्ता निराश हैं कि यह अभी भी Micro USB का उपयोग करता है बजाय USB-C के।",
      "एक वायरलेस-सक्षम संस्करण, Pico 2 W, वर्ष के अंत तक अपेक्षित है, हालांकि कुछ उपयोगकर्ता इसके अंतर्निर्मित वायरलेस क्षमताओं के लिए ESP32 को पसंद करते हैं।"
    ],
    "points": 220,
    "commentCount": 96,
    "retryCount": 0,
    "time": 1723129761
  },
  {
    "id": 41192303,
    "title": "कॉस्मिक: एक नया डेस्कटॉप वातावरण",
    "originLink": "https://system76.com/cosmic",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41192303",
    "commentBody": "",
    "originSummary": [
      "COSMIC एक नया सॉफ्टवेयर प्लेटफॉर्म है जो एक मॉड्यूलर डेस्कटॉप वातावरण के साथ उपयोगकर्ता अनुभवों को डिजाइन करने के लिए है, और वर्तमान में इसका पहला अल्फा रिलीज़, COSMIC Epoch 1, जारी किया गया है।",
      "प्लेटफ़ॉर्म परीक्षण के लिए Pop!_OS 24.04 LTS अल्फा और अन्य लिनक्स वितरणों पर उपलब्ध है, जिसमें अनुकूलन और उन्नत कार्यक्षमता पर ध्यान केंद्रित किया गया है।",
      "मुख्य विशेषताओं में अनुकूलन योग्य पैनल, स्वचालित टाइलिंग विंडो, उन्नत थीमिंग, और स्वतंत्र ऐपलेट्स शामिल हैं, जो स्थिरता और प्रदर्शन के लिए रस्ट में लिखे गए हैं।"
    ],
    "commentSummary": [
      "सिस्टम76 ने कॉस्मिक का पहला अल्फा संस्करण जारी किया है, जो एक नया डेस्कटॉप वातावरण (डीई) है। इसे एक नए GUI टूलकिट का उपयोग करके बनाया गया है जो Iced पर आधारित है और एक नए वेलैंड कंपोज़िटर के साथ है, जिसे सभी रस्ट में विकसित किया गया है।",
      "रिलीज में एकीकृत टाइलिंग समर्थन शामिल है, जो i3/sway से परिचित उपयोगकर्ताओं को आकर्षित करता है, और पूर्ण कीबोर्ड नेविगेशन के साथ एक पतला, हल्का और तेज़ डेस्कटॉप वातावरण (DE) का वादा करता है।",
      "प्रतिक्रियाएँ मिश्रित हैं, कुछ उपयोगकर्ता नवाचार और संभावित सुधारों को लेकर उत्साहित हैं, जबकि अन्य डिज़ाइन और उपयोगिता को लेकर चिंतित हैं।"
    ],
    "points": 211,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1723129518
  },
  {
    "id": 41185783,
    "title": "GPT-4 LLM सामाजिक विज्ञान प्रयोगों को दोहराने के लिए लोगों का अच्छी तरह से अनुकरण करता है",
    "originLink": "https://www.treatmenteffect.app/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41185783",
    "commentBody": "",
    "originSummary": [
      "डेमो एक उपकरण को प्रदर्शित करता है जो GPT-4o-mini का उपयोग करके सामाजिक विज्ञान के प्रयोगात्मक परिणामों की भविष्यवाणी करता है, विशेष रूप से अमेरिकी वयस्कों पर उपचार प्रभावों को।",
      "यह उपकरण स्थितियों के बीच विरोधाभासों की दिशा की भविष्यवाणी करने में लगभग 70-80% सटीक है, और भविष्यवाणी किए गए और वास्तविक प्रभाव आकारों के बीच एक मजबूत सहसंबंध (r = .85) है।",
      "आवेदन में हस्तक्षेप डिजाइन, प्रतिभागी हानि को कम करना, अध्ययन सामग्री का पायलट परीक्षण, और उपसमूह प्रभावों की भविष्यवाणी शामिल हैं, हालांकि संभावित पूर्वाग्रहों के कारण सावधानी बरतने की सलाह दी जाती है।"
    ],
    "commentSummary": [
      "GPT-4 एलएलएम (लार्ज लैंग्वेज मॉडल) सामाजिक विज्ञान के प्रयोगों को दोहराने के लिए मानव व्यवहार का अनुकरण इतनी अच्छी तरह से कर सकता है कि यह परिणामों की भविष्यवाणी 69% सटीकता के साथ कर सकता है, जो 66% सटीकता वाले मानव पूर्वानुमानकर्ताओं से थोड़ा बेहतर है।",
      "आलोचकों का तर्क है कि मॉडल की भविष्यवाणियाँ उसके प्रशिक्षण डेटा से प्रभावित हो सकती हैं, जिसमें वे प्रयोग भी शामिल हो सकते हैं जिन्हें यह दोहराने का प्रयास करता है, जिससे इसकी वास्तविक भविष्यवाणी क्षमता पर सवाल उठते हैं।",
      "चर्चा सामाजिक विज्ञानों में चल रहे प्रतिकृति संकट को उजागर करती है, यह सुझाव देते हुए कि जबकि LLMs दिलचस्प संभावनाएं प्रदान करते हैं, वे समस्या का अंतिम समाधान नहीं हैं।"
    ],
    "points": 197,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1723066236
  },
  {
    "id": 41189971,
    "title": "हमने एक eBPF लिनक्स कर्नेल कमजोरी को कैसे खोजा और ठीक किया",
    "originLink": "https://bughunters.google.com/blog/6303226026131456/a-deep-dive-into-cve-2023-2163-how-we-found-and-fixed-an-ebpf-linux-kernel-vulnerability",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41189971",
    "commentBody": "",
    "originSummary": [
      "ब्लॉग में CVE-2023-2163 पर चर्चा की गई है, जो लिनक्स कर्नेल के eBPF (विस्तारित बर्कले पैकेट फ़िल्टर) सबसिस्टम में एक नई खोजी गई भेद्यता है।",
      "यह खोज प्रक्रिया, संभावित प्रभावों, और भेद्यता को ठीक करने के लिए उठाए गए कदमों का विवरण देता है, जो सुरक्षा पेशेवरों और डेवलपर्स के लिए मूल्यवान अंतर्दृष्टि प्रदान करता है।",
      "यह पोस्ट महत्वपूर्ण है क्योंकि यह कई प्रणालियों में एक महत्वपूर्ण घटक, लिनक्स कर्नेल, को सुरक्षित करने के लिए चल रहे प्रयासों को उजागर करती है और सक्रिय भेद्यता प्रबंधन के महत्व पर जोर देती है।"
    ],
    "commentSummary": [
      "eBPF (विस्तारित बर्कले पैकेट फ़िल्टर) लिनक्स कर्नेल में एक कमजोरी की खोज की गई और उसे ठीक किया गया, जिससे कर्नेल क्रैश को रोकने में eBPF वेरिफायर के महत्व को उजागर किया गया।",
      "eBPF वेरिफायर बग महत्वपूर्ण होते हैं लेकिन अक्सर उन प्लेटफार्मों को प्रभावित नहीं करते जहां अनप्रिविलेज्ड कोड eBPF प्रोग्राम लोड नहीं कर सकता, जिससे वे सर्वर वातावरण में अधिक प्रबंधनीय हो जाते हैं।",
      "अपनी जटिलता के बावजूद, eBPF का व्यापक रूप से उपयोग किया जाता है और बड़ी तकनीकी कंपनियों द्वारा इसका समर्थन किया जाता है क्योंकि यह लचीलापन प्रदान करता है और उन समस्याओं को हल करने में सक्षम है जिनके लिए अन्यथा कस्टम कर्नेल पैच की आवश्यकता होती।"
    ],
    "points": 191,
    "commentCount": 30,
    "retryCount": 0,
    "time": 1723113546
  },
  {
    "id": 41188966,
    "title": "फ्लेक्सअटेंशन: फ्लैशअटेंशन के प्रदर्शन के साथ पायटॉर्च की लचीलापन",
    "originLink": "https://pytorch.org/blog/flexattention/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41188966",
    "commentBody": "",
    "originSummary": [
      "फ्लेक्सअटेंशन एक नया पायटॉर्च एपीआई है जिसे मशीन लर्निंग मॉडलों में विभिन्न अटेंशन मैकेनिज्म के कार्यान्वयन को सरल बनाने के लिए डिज़ाइन किया गया है, जो फ्लैशअटेंशन जैसी मौजूदा अनुकूलित कार्यान्वयन की सीमाओं को संबोधित करता है।",
      "यह शोधकर्ताओं को न्यूनतम कोड के साथ ध्यान वेरिएंट्स को लागू करने की अनुमति देता है, अतिरिक्त मेमोरी उपयोग के बिना प्रतिस्पर्धी प्रदर्शन सुनिश्चित करता है, और सॉफ्टमैक्स से पहले ध्यान स्कोर को संशोधित करने के लिए उपयोगकर्ता-परिभाषित कार्यों का समर्थन करता है।",
      "FlexAttention PyTorch के नाइटली रिलीज़ में उपलब्ध है और संस्करण 2.5.0 में एक प्रोटोटाइप फीचर के रूप में होगा, जिसमें प्रदर्शन और अतिरिक्त समर्थन सुविधाओं के लिए भविष्य में सुधार की योजना बनाई गई है।"
    ],
    "commentSummary": [
      "FlexAttention PyTorch की लचीलापन को FlashAttention के उच्च प्रदर्शन के साथ मिलाता है, जिससे ध्यान तंत्रों के अनुकूलन को सरल बनाता है।",
      "यह फॉरवर्ड पास में FlashAttention2 के प्रदर्शन का 90% और बैकवर्ड पास में 85% प्राप्त करता है, हालांकि FlashAttention-3 अभी भी तेज है।",
      "हालांकि ध्यान तंत्र अधिकांश वर्तमान बड़े भाषा मॉडल (LLM) कार्यभार में मुख्य गणनात्मक बाधा नहीं हैं, लेकिन जैसे-जैसे डेटा का पैमाना बढ़ेगा, उनकी अनुकूलन क्षमता महत्वपूर्ण हो जाएगी।"
    ],
    "points": 175,
    "commentCount": 15,
    "retryCount": 0,
    "time": 1723101898
  },
  {
    "id": 41186310,
    "title": "आर्गडाउन, तर्क मानचित्रण के लिए मार्कडाउन की तरह",
    "originLink": "https://argdown.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41186310",
    "commentBody": "",
    "originSummary": [
      "फरवरी 2022 में Argdown v1.8.2 जारी किया गया था, जो जटिल तर्क-वितर्क के लिए एक सरल सिंटैक्स प्रदान करता है, जिससे ट्विटर संदेश की तरह पक्ष और विपक्ष लिखना आसान हो जाता है।",
      "Argdown का उपयोग Markdown के भीतर तर्क मानचित्र बनाने के लिए किया जा सकता है, जिन्हें PDF के रूप में प्रकाशित किया जा सकता है, वेबपेजों में एम्बेड किया जा सकता है, या छवियों के रूप में निर्यात किया जा सकता है।",
      "Argdown के लिए उपकरणों में एक ब्राउज़र सैंडबॉक्स, लाइव प्रीव्यू और सिंटैक्स हाइलाइटिंग के साथ एक VS कोड एक्सटेंशन, और कस्टम प्रक्रियाओं और कई निर्यातों के लिए एक कमांड-लाइन टूल शामिल हैं।"
    ],
    "commentSummary": [
      "आर्गडाउन एक उपकरण है जो चर्चाओं को तर्क वृक्षों के रूप में प्रस्तुत करता है, जैसे कि मार्कडाउन पाठ को प्रारूपित करता है।",
      "वास्तविक दुनिया के तर्क अक्सर अधिक जटिल होते हैं, जो भारित किनारों वाले निर्देशित अचक्रित ग्राफ़ (DAGs) के समान होते हैं, बजाय साधारण पेड़ों के।",
      "उन्नत तकनीकें जैसे LLM-एंबेडिंग और विज़ुअलाइज़ेशन टूल्स जैसे UMAP तर्कों के प्रतिनिधित्व को बेहतर बना सकते हैं, और Kialo और Obsidian जैसी प्लेटफ़ॉर्म समान तर्क मानचित्रण सुविधाएँ प्रदान करते हैं।"
    ],
    "points": 167,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1723070700
  },
  {
    "id": 41184559,
    "title": "मिस्ट्रल एजेंट्स",
    "originLink": "https://mistral.ai/news/build-tweak-repeat/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41184559",
    "commentBody": "",
    "originSummary": [
      "मिस्ट्रल एआई ने मॉडल कस्टमाइजेशन में प्रगति की घोषणा की है, जिससे डेवलपर्स मिस्ट्रल लार्ज 2 और कोडस्ट्रल जैसे मॉडलों को बेस प्रॉम्प्ट्स, फ्यू-शॉट प्रॉम्प्टिंग, या अपने स्वयं के डेटासेट्स के साथ फाइन-ट्यूनिंग का उपयोग करके अनुकूलित कर सकते हैं।",
      "एजेंट्स के एक अल्फा रिलीज में अतिरिक्त संदर्भ और निर्देशों के साथ लिपटे मॉडल पेश किए गए हैं, जो ले चैट या एपीआई पर कस्टम व्यवहार और वर्कफ़्लो को सक्षम बनाते हैं।",
      "मिस्ट्रालाई लाइब्रेरी का स्थिर संस्करण, मिस्ट्रालाई 1.0, अब पायथन और टाइपस्क्रिप्ट के लिए उपलब्ध है, जिससे उपयोगिता और स्थिरता में सुधार हुआ है।"
    ],
    "commentSummary": [
      "Mistral एजेंट्स एक नई विशेषता है जो एक सिस्टम प्रॉम्प्ट और तापमान को एक मॉडल के साथ जोड़ती है, जिसका उद्देश्य निर्देशों और उदाहरणों के साथ कस्टम व्यवहार और वर्कफ़्लो बनाना है।",
      "यह सुविधा अभी विकास के चरण में है, जिसमें एजेंट्स को उपकरणों और डेटा स्रोतों से जोड़ने की योजना है, लेकिन ये एकीकरण अभी उपलब्ध नहीं हैं।",
      "\"एजेंट्स\" शब्द को अस्पष्ट और ढीले ढंग से परिभाषित माना जाता है, कुछ उपयोगकर्ता इसे कस्टम GPTs या अन्य AI फ्रेमवर्क जैसे OpenAI के GPT स्टोर से तुलना करते हैं।"
    ],
    "points": 158,
    "commentCount": 40,
    "retryCount": 0,
    "time": 1723059166
  },
  {
    "id": 41189946,
    "title": "समाचार सूचना जंक फूड है (2022)",
    "originLink": "https://chuck.is/news/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41189946",
    "commentBody": "",
    "originSummary": [
      "लेखक का तर्क है कि समाचार उपभोग को कम करने से उनकी चिंता में काफी कमी आई है और अन्य रुचियों के लिए समय मिल गया है, यह सुझाव देते हुए कि आधुनिक समाचार जानकारी से अधिक मनोरंजन के बारे में है।",
      "वे इस बात पर जोर देते हैं कि कुछ कंपनियाँ अधिकांश मीडिया को नियंत्रित करती हैं, जिससे क्लिक और विज्ञापन राजस्व पर केंद्रित पक्षपाती कहानियाँ बनती हैं, जो भावनात्मक प्रतिक्रियाओं को उकसा सकती हैं और मौजूदा पूर्वाग्रहों को मजबूत कर सकती हैं।",
      "लेखक जानकारी उपभोग के लिए एक चयनात्मक दृष्टिकोण की वकालत करते हैं, 24 घंटे के समाचार चक्र के बजाय लंबी अवधि की पढ़ाई और सार्थक गतिविधियों पर जोर देते हैं ताकि एक स्वस्थ मानसिक स्थिति और समय का अधिक उत्पादक उपयोग प्राप्त किया जा सके।"
    ],
    "commentSummary": [
      "समाचार की अक्सर तुलना जंक फूड से की जाती है, जो त्वरित, सनसनीखेज सामग्री प्रदान करता है जो वास्तविकता को विकृत कर सकता है और चरम विचारों को बढ़ावा दे सकता है।",
      "पत्रकारिता का व्यवसाय मॉडल आमतौर पर ऐसे सामग्री को प्राथमिकता देता है जो पाठकों की मान्यताओं के अनुरूप हो, जिससे पक्षपाती रिपोर्टिंग और गलत सूचना फैलने की संभावना बढ़ जाती है, जो लोकतंत्रों को नुकसान पहुंचा सकती है।",
      "इन समस्याओं को कम करने के सुझावों में स्थानीय समाचारों पर ध्यान केंद्रित करना, लंबी-फॉर्म पत्रकारिता, और समाचार साइटों की स्वतंत्र रैंकिंग शामिल हैं ताकि गुणवत्ता और पारदर्शिता सुनिश्चित की जा सके।"
    ],
    "points": 149,
    "commentCount": 190,
    "retryCount": 0,
    "time": 1723113270
  },
  {
    "id": 41193968,
    "title": "नियोक्ताओं ने कर्मचारियों को इस्तीफा देने के लिए कार्यालय में वापसी का उपयोग किया",
    "originLink": "https://thehill.com/opinion/technology/4800828-office-mandates-cause-attrition/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41193968",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "नियोक्ता कार्यालय में वापसी (आरटीओ) नीतियों का उपयोग अप्रत्यक्ष रूप से इस्तीफे को प्रोत्साहित करने के लिए कर रहे हैं, जिससे वर्षों की विविधता प्रयासों को उलट दिया जा रहा है।",
      "यह दृष्टिकोण महिलाओं और देखभालकर्ताओं को असमान रूप से प्रभावित करता है, जिससे पूर्वानुमानित इस्तीफे और कंपनी की संस्कृति और उत्पादकता को संभावित नुकसान हो सकता है।",
      "आलोचकों का तर्क है कि आरटीओ नीतियाँ बिना छंटनी के कर्मचारियों की संख्या कम करने की एक अल्पदृष्टि रणनीति हैं, जो दीर्घकालिक व्यापारिक स्वास्थ्य के लिए हानिकारक हो सकती हैं।"
    ],
    "points": 134,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1723137662
  }
]
