[
  {
    "id": 39097356,
    "title": "La FTC prohíbe la publicidad \"gratuita\" de TurboTax",
    "originLink": "https://www.cnn.com/2024/01/22/business/ftc-turbotax-free-services/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097356",
    "commentBody": "",
    "originSummary": [
      "Los textos facilitados contienen una amplia gama de datos, incluidos fragmentos de código CSS, ajustes de configuración, información publicitaria, acciones reguladoras, fragmentos de código JavaScript e informes de noticias sobre TurboTax y la Comisión Federal de Comercio.",
      "Cada dato sirve para un fin concreto y tiene su propia funcionalidad en función de su contexto.",
      "Los textos proporcionan información diversa y relevante relacionada con TurboTax y la Comisión Federal de Comercio."
    ],
    "commentSummary": [
      "La Comisión Federal de Comercio (FTC) ha prohibido a TurboTax hacer publicidad de sus servicios \"gratuitos\", lo que suscita dudas sobre las prácticas de marketing de la empresa.",
      "El debate también explora los retos a los que se enfrenta la gente con las fracciones en matemáticas y la importancia de comprender este concepto.",
      "Se aborda el tema de la elaboración de presupuestos para personas con bajos ingresos, destacando las dificultades financieras a las que se enfrentan muchos y la necesidad de estrategias presupuestarias eficaces.",
      "Se discuten diferentes opciones de declaración de impuestos, incluido el papel de Intuit en la industria de la declaración de impuestos y sus esfuerzos de presión.",
      "Se examina el debate sobre el acceso y la influencia de las empresas en la representación política, destacando las posibles implicaciones para la democracia."
    ],
    "points": 757,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1705968020
  },
  {
    "id": 39092505,
    "title": "Un modder recrea juegos de Game Boy Advance con sonidos de accidentes",
    "originLink": "https://arstechnica.com/gaming/2024/01/modder-recreates-game-boy-advance-games-using-the-audio-from-crash-sounds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39092505",
    "commentBody": "",
    "originSummary": [
      "Un modder ha descubierto una técnica para desarrollar juegos de Game Boy Advance funcionales capturando los sonidos de los accidentes de los juegos originales y analizando las formas de onda de audio.",
      "El modder se enfrentó a dificultades durante el proceso, pero al final consiguió recrear los datos del juego, lo que dio como resultado una ROM perfectamente exacta.",
      "La ROM creada puede reproducirse en hardware físico de Game Boy Advance, lo que supone una forma emocionante de revivir experiencias de juego clásicas."
    ],
    "commentSummary": [
      "Los usuarios están debatiendo la idea de utilizar el audio para recuperar el estado del juego cuando los juegos de Game Boy Advance (GBA) se bloquean.",
      "La conversación explora la arquitectura de la GBA y la posibilidad de que el hardware de audio acceda a la ROM del juego.",
      "Se tratan diversos temas, como la recuperación del reloj, los sistemas de codificación, el tratamiento digital de señales, la tecnología GPS, los filtros medianos para la eliminación del ruido en las fotos, las limitaciones de la resolución de 8 bits y el uso de emuladores para detectar errores en las ROM de GBA reconstruidas."
    ],
    "points": 484,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1705945153
  },
  {
    "id": 39090879,
    "title": "Instagram introduce \"Notes Prompts\" para fomentar el compromiso de los usuarios",
    "originLink": "https://www.neowin.net/news/meta-now-lets-eu-users-unlink-their-facebook-messenger-and-instagram-accounts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39090879",
    "commentBody": "",
    "originSummary": [
      "Instagram ha lanzado una nueva función llamada \"Notas de aviso\" que permite a los usuarios enviar recordatorios o avisos a sus amigos.",
      "Esta función pretende animar a los amigos a responder a mensajes o publicaciones.",
      "Los usuarios pueden utilizar las \"Notas de aviso\" para asegurarse de que sus mensajes o publicaciones reciben la atención y la participación de sus amigos."
    ],
    "commentSummary": [
      "La normativa de la Unión Europea (UE) es un tema candente, especialmente en torno a la privacidad de los datos y las empresas tecnológicas.",
      "Los usuarios de la UE tienen la posibilidad de desvincular sus cuentas de Facebook, Messenger e Instagram, lo que plantea retos e implicaciones.",
      "La normativa GDPR ha tenido un impacto en la privacidad de los usuarios, pero existen limitaciones y críticas a la normativa de la UE.",
      "También se debaten las ventanas emergentes de cookies y la posible influencia de las grandes tecnológicas en la legislación.",
      "Crear y desarrollar empresas de software en Europa puede ser difícil.",
      "Existen opiniones divergentes sobre la eficacia y la aplicación de la normativa, así como sobre el papel de los políticos y los ciudadanos en su configuración.",
      "Los debates también abordan los servicios de Google, la interconexión de las plataformas y las posibles prohibiciones de YouTube o Gmail."
    ],
    "points": 447,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1705939200
  },
  {
    "id": 39099065,
    "title": "Hacker News ya admite conexión IPv6",
    "originLink": "https://news.ycombinator.com/item?id=39099065",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39099065",
    "commentBody": "",
    "originSummary": [
      "El navegador del usuario se conecta ahora a Hacker News a través de IPv6, como indica la presencia de direcciones IPv4 e IPv6 pertenecientes al mismo ASN (M5 Computer Security).",
      "El usuario se alegra de haber sido redirigido a Hacker News y espera que no corra la misma suerte que Reddit, que fue desactivado anteriormente."
    ],
    "commentSummary": [
      "Este resumen ofrece una visión general de la implantación de IPv6, sus retos, ventajas y problemas.",
      "Abarca temas como las extensiones del navegador, la asignación de direcciones, los problemas de latencia, el rendimiento de los juegos, la capacidad de la red, la compatibilidad con TLS y el uso de CGNAT.",
      "Los debates ponen de relieve las complejidades y ventajas potenciales de la adopción de IPv6, así como las dudas y dificultades que encuentran los usuarios y los ISP."
    ],
    "points": 361,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1705978815
  },
  {
    "id": 39091777,
    "title": "Desbloquear el acceso gratuito: Iniciar sesión",
    "originLink": "https://lightning.ai/lightning-ai/studios/code-lora-from-scratch?view=public&section=all",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39091777",
    "commentBody": "",
    "originSummary": [
      "La frase \"Inicio de sesión gratuito\" sugiere la existencia de una opción de inicio de sesión gratuito."
    ],
    "commentSummary": [
      "El debate se centra en la aplicación y optimización del LoRA en los modelos de aprendizaje automático, con opiniones divergentes sobre si debe aplicarse a todas las capas o sólo a la última.",
      "Existe confusión con respecto al acrónimo LoRA, ya que puede confundirse con el protocolo de radio LoRa.",
      "El debate también explora la distinción entre ingeniería y descubrimiento en la IA, la falta de fundamentos teóricos de la inteligencia y los retos de establecer principios generalizables.",
      "Se examinan varios casos de uso del ajuste fino en el aprendizaje automático y se comparan con la generación aumentada por recuperación.",
      "La conversación concluye con un comentario desenfadado sobre la posibilidad de bautizar un proyecto con el nombre de \"Lehsun\"."
    ],
    "points": 297,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1705942580
  },
  {
    "id": 39097314,
    "title": "La República Checa fija el 6 de junio de 2032 como fecha límite para los servicios IPv4",
    "originLink": "https://konecipv4.cz/en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097314",
    "commentBody": "",
    "originSummary": [
      "El Gobierno de la República Checa ha aprobado un plan para adoptar las tecnologías DNSSEC e IPv6 en la administración estatal.",
      "A partir del 6 de junio de 2032, el país dejará de prestar servicios sobre IPv4.",
      "Esta transición es necesaria debido al creciente número de dispositivos y servicios, ya que las direcciones IPv4 se han vuelto insuficientes, mientras que IPv6 ofrece un número casi ilimitado de direcciones.",
      "La cuenta atrás para el fin de IPv4 se ha fijado en 3056 días, 13 horas, 57 minutos y 16 segundos."
    ],
    "commentSummary": [
      "El debate explora los retos y ventajas de la transición de IPv4 a IPv6.",
      "Se analizan las implicaciones para el seguimiento de personas, el uso de direcciones locales únicas, las limitaciones y los problemas de seguridad tanto de IPv4 como de IPv6.",
      "La conversación hace hincapié en la importancia del soporte de hardware y software, la necesidad de iniciativas para impulsar la adopción y las complejidades de actualizar la infraestructura."
    ],
    "points": 269,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1705967767
  },
  {
    "id": 39095337,
    "title": "Winlator: Ejecute aplicaciones Windows en Android con Wine y Box86/Box64",
    "originLink": "https://winlator.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39095337",
    "commentBody": "",
    "originSummary": [
      "Winlator es una aplicación para Android que permite a los usuarios ejecutar aplicaciones de Windows utilizando Wine y Box86/Box64.",
      "El proyecto se ha desarrollado con la ayuda de ptitSeb y los desarrolladores de Wine.",
      "La última versión de Winlator puede descargarse desde el sitio web oficial, cuyo copyright pertenece a BrunoSX."
    ],
    "commentSummary": [
      "El debate gira en torno a la ejecución de aplicaciones de Windows en distintas plataformas, como Android y Linux, y los usuarios comparten sus experiencias y recomendaciones.",
      "Los temas específicos incluyen la ejecución de juegos, aplicaciones de Microsoft Office y software de producción musical.",
      "Se hace especial hincapié en el uso de Wine, una capa de compatibilidad, para ejecutar diversos programas."
    ],
    "points": 269,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1705957047
  },
  {
    "id": 39088551,
    "title": "Desvío: Una alternativa a Git nativa en la nube de última generación",
    "originLink": "https://news.ycombinator.com/item?id=39088551",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39088551",
    "commentBody": "",
    "originSummary": [
      "Diversion es un sistema de control de versiones nativo en la nube diseñado para resolver los problemas de escalabilidad y complejidad de Git.",
      "Su objetivo es mantener las capacidades de ramificación y fusión de Git, al tiempo que ofrece colaboración en tiempo real y compatibilidad con los repositorios Git.",
      "Diversion se encuentra actualmente en fase beta abierta y se publicará como código abierto en el futuro."
    ],
    "commentSummary": [
      "Los debates giran en torno a las limitaciones y complejidades de Git, un popular sistema de control de versiones, y la necesidad de soluciones alternativas.",
      "Diversion, una alternativa nativa en la nube a Git, se presenta como una posible solución para los desarrolladores de juegos.",
      "Otros temas incluyen el uso de Árboles de Sintaxis Abstracta (AST) en el control de versiones, los retos de escalabilidad con monorepos en Git, y el debate sobre la complejidad y eficacia de Git como sistema de control de versiones."
    ],
    "points": 269,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1705924870
  },
  {
    "id": 39088991,
    "title": "Desesperación de un astronauta en órbita: Amenaza con quedarse en el espacio",
    "originLink": "https://arstechnica.com/space/2024/01/solving-a-nasa-mystery-why-did-space-shuttle-commanders-lock-the-hatch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39088991",
    "commentBody": "",
    "originSummary": [
      "Taylor Wang, la primera persona nacida en China que voló al espacio, se encontró con un importante contratiempo cuando su experimento no funcionó mientras estaba en el transbordador espacial.",
      "Al principio se le negó la posibilidad de solucionar y reparar el experimento, lo que le llevó a amenazar con no volver a la Tierra.",
      "Este incidente arroja luz sobre las dificultades a las que se enfrentan los astronautas no pertenecientes a la NASA y los especialistas en cargas útiles que realizan experimentos científicos en microgravedad, y sigue siendo relevante hoy en día, cuando los vuelos espaciales comerciales abren vías para que más personas exploren el espacio."
    ],
    "commentSummary": [
      "La conversación gira en torno a un artículo sobre los problemas de salud mental de un astronauta y el uso de técnicas narrativas en los reportajes.",
      "Se discute la importancia del periodismo conciso y el debate en curso sobre la longitud y relevancia de los artículos.",
      "Otros temas son la justificación de los vuelos espaciales tripulados, el papel de los robots en la exploración espacial y los posibles riesgos y medidas de seguridad en las misiones espaciales."
    ],
    "points": 251,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1705928225
  },
  {
    "id": 39097502,
    "title": "Libro abierto de ingeniería de aprendizaje automático: Un recurso completo para el entrenamiento de modelos lingüísticos y multimodales",
    "originLink": "https://github.com/stas00/ml-engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097502",
    "commentBody": "",
    "originSummary": [
      "The Machine Learning Engineering Open Book es una completa colección de metodologías y recursos para el entrenamiento de grandes modelos lingüísticos y modelos multimodales.",
      "Proporciona material técnico, incluidos scripts y comandos, destinado específicamente a la formación de ingenieros y operadores que trabajan con modelos LLM/VLM.",
      "El libro comparte las experiencias del autor en la formación de modelos de código abierto, cubriendo componentes de hardware, optimización del rendimiento, funcionamiento de SLURM, depuración del desarrollo y otros recursos varios."
    ],
    "commentSummary": [
      "El libro en línea ML Engineering es un recurso beneficioso para las personas involucradas en el aprendizaje automático, ya que ofrece información sobre optimización, rendimiento y aspectos de ingeniería de nivel inferior.",
      "El libro sugiere el uso de perfiladores y otras herramientas para comprender mejor y mejorar el rendimiento de los modelos.",
      "Slurm, un gestor de cargas de trabajo, se utiliza ampliamente en la comunidad de computación de alto rendimiento (HPC), principalmente en el mundo académico y en centros de computación de investigación. Sin embargo, fuera de los contextos académicos y de HPC, se emplean con más frecuencia alternativas como AWS y Snowflake."
    ],
    "points": 237,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1705968866
  },
  {
    "id": 39092278,
    "title": "Descubrimientos fortuitos: Edulcorantes artificiales y la búsqueda de otros nuevos",
    "originLink": "https://www.lesswrong.com/posts/oA23zoEjPnzqfHiCt/there-is-way-too-much-serendipity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39092278",
    "commentBody": "",
    "originSummary": [
      "El artículo explora los descubrimientos accidentales de los edulcorantes artificiales y plantea interrogantes sobre el proceso de creación de otros nuevos.",
      "Examina las razones de nuestra preferencia por los sabores dulces y sugiere que los edulcorantes bajos en calorías pueden no existir de forma natural.",
      "El debate también pone de relieve los riesgos potenciales de que los químicos prueben sustancias y las limitaciones de los métodos de descubrimiento de fármacos."
    ],
    "commentSummary": [
      "La conversación abarca una amplia gama de temas científicos, como las migrañas, los desencadenantes y el papel de la mecánica cuántica en la química.",
      "Incluye debates sobre conceptos matemáticos como que la raíz cuadrada de 2 es un número irracional.",
      "La conversación también toca temas como los compuestos y sus efectos en los organismos, los avances científicos, el sabor y la evolución, y los descubrimientos accidentales de edulcorantes, incluido un azúcar falso."
    ],
    "points": 199,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1705944384
  },
  {
    "id": 39098603,
    "title": "El Nobel de Física Arno A. Penzias, de 90 años, confirmó la teoría del Big Bang",
    "originLink": "https://www.nytimes.com/2024/01/22/science/space/arno-a-penzias-dead.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39098603",
    "commentBody": "",
    "originSummary": [
      "Arno A. Penzias, físico galardonado con el Premio Nobel, ha fallecido a los 90 años.",
      "Confirmó la teoría del Big Bang con su descubrimiento de la radiación cósmica de fondo de microondas en 1964.",
      "El inesperado descubrimiento de Penzias marcó un momento crucial en la cosmología, que pasó de ser un campo filosófico a uno impulsado por la investigación observacional."
    ],
    "commentSummary": [
      "Arno A. Penzias, físico galardonado con el Premio Nobel, ha fallecido a los 90 años.",
      "Penzias y su colega Robert Wilson descubrieron la radiación cósmica de fondo de microondas, en apoyo de la teoría del Big Bang.",
      "Sus importantes descubrimientos no fueron plenamente reconocidos en un principio, pero en 1978 recibieron el Premio Nobel de Física por su contribución a la cosmología."
    ],
    "points": 181,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1705975546
  },
  {
    "id": 39091416,
    "title": "La automatización de la optimización de costes en la nube ahorra 150.000 dólares al año",
    "originLink": "https://tuananh.net/2024/01/21/cloud-cost-optimization-at-scale-part-1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39091416",
    "commentBody": "",
    "originSummary": [
      "El autor hace hincapié en la importancia de la optimización de los costes de la nube y presenta una solución utilizando Lambda, Step Functions y EventBridge.",
      "El sistema automatiza tareas como el apagado de recursos cuando no se utilizan, la aplicación de políticas de seguridad y el apagado automático de recursos.",
      "La solución afirma haber logrado una reducción del 70 % en los costes de no producción, con un ahorro previsto de 150 000 USD anuales. Los planes futuros incluyen abordar cargas de trabajo más complejas como Kubernetes."
    ],
    "commentSummary": [
      "El debate se centra en la gestión de costes en infraestructura de nube, desarrollo de software e ingeniería.",
      "Los participantes comparten sus experiencias y puntos de vista sobre la reducción de costes y los retos de la transparencia en la facturación.",
      "Se hacen recomendaciones sobre diferentes estrategias, herramientas y enfoques para gestionar eficazmente los gastos en servicios en nube."
    ],
    "points": 169,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1705941237
  },
  {
    "id": 39098780,
    "title": "Las acusaciones de fraude y manipulación de datos sacuden el Instituto Oncológico Dana-Farber de Harvard",
    "originLink": "https://forbetterscience.com/2024/01/02/dana-farberications-at-harvard-university/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39098780",
    "commentBody": "",
    "originSummary": [
      "Han surgido acusaciones de manipulación de datos y mala conducta en la investigación del cáncer en el Instituto Oncológico Dana-Farber de la Universidad de Harvard.",
      "Se han detectado casos concretos de falsificación de datos y prácticas fraudulentas.",
      "La credibilidad y competencia de algunos investigadores están en tela de juicio, y se han producido numerosas retractaciones y correcciones a raíz de estas acusaciones."
    ],
    "commentSummary": [
      "El artículo y la sección de comentarios discuten las acusaciones de falsificación de investigaciones en el Instituto Oncológico Dana-Farber.",
      "Entre los temas de conversación figuran los retos y sesgos de la investigación científica, los sistemas de clasificación universitaria y el descenso del nivel de la enseñanza en Harvard.",
      "Otros temas tratados en los comentarios son las disparidades raciales en el rendimiento académico, la inflación de las notas, la falta de preocupación por corregir los trabajos fraudulentos, la positividad corporal, el enfoque de las redes en Harvard, el valor de las instituciones educativas, la ciencia del clima y el apoyo a las dinámicas sociales a pesar de las creencias religiosas personales."
    ],
    "points": 159,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1705976766
  }
]
