[
  {
    "id": 39097356,
    "title": "FTC تحظر TurboTax من الإعلانات \"المجانية\"",
    "originLink": "https://www.cnn.com/2024/01/22/business/ftc-turbotax-free-services/index.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097356",
    "commentBody": "",
    "originSummary": [
      "تحتوي النصوص المحددة على مجموعة واسعة من البيانات ، بما في ذلك مقتطفات شفرة CSS ، وإعدادات التكوين ، ومعلومات الإعلان ، والإجراءات التنظيمية ، ومقتطفات شفرة JavaScript ، والتقارير الإخبارية حول TurboTax ولجنة التجارة الفيدرالية.",
      "تخدم كل معلومة غرضا محددا ولها وظائفها الخاصة بناء على سياقها.",
      "توفر النصوص معلومات متنوعة وذات صلة تتعلق ب TurboTax ولجنة التجارة الفيدرالية."
    ],
    "commentSummary": [
      "حظرت لجنة التجارة الفيدرالية (FTC) TurboTax من الإعلان عن خدماتها \"المجانية\" ، مما أثار مخاوف بشأن ممارسات التسويق للشركة.",
      "تستكشف المناقشة أيضا التحديات التي يواجهها الناس مع الكسور في الرياضيات وأهمية فهم هذا المفهوم.",
      "يتم تناول موضوع الميزنة للأفراد ذوي الدخل المنخفض ، مع تسليط الضوء على الصعوبات المالية التي يواجهها الكثيرون والحاجة إلى استراتيجيات فعالة للميزنة.",
      "تتم مناقشة خيارات الإيداع الضريبي المختلفة ، بما في ذلك دور Intuit في صناعة الإيداع الضريبي وجهود الضغط الخاصة بهم.",
      "يتم فحص النقاش حول وصول الشركات وتأثيرها في التمثيل السياسي ، مع تسليط الضوء على الآثار المحتملة على الديمقراطية."
    ],
    "points": 757,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1705968020
  },
  {
    "id": 39092505,
    "title": "يعيد Modder إنشاء ألعاب Game Boy Advance باستخدام أصوات الأعطال",
    "originLink": "https://arstechnica.com/gaming/2024/01/modder-recreates-game-boy-advance-games-using-the-audio-from-crash-sounds/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39092505",
    "commentBody": "",
    "originSummary": [
      "وجد أحد المودعين تقنية لتطوير ألعاب Game Boy Advance الوظيفية من خلال التقاط أصوات التعطل من الألعاب الأصلية وتحليل أشكال الموجات الصوتية.",
      "واجه المورد تحديات أثناء العملية ولكنه تمكن في النهاية من إعادة إنشاء بيانات اللعبة ، مما أدى إلى ROM دقيق تماما.",
      "يمكن تشغيل ROM الذي تم إنشاؤه على أجهزة Game Boy Advance المادية ، مما يوفر طريقة مثيرة لاستعادة تجارب الألعاب الكلاسيكية."
    ],
    "commentSummary": [
      "يناقش المستخدمون فكرة استخدام الصوت لاستعادة حالة اللعبة عند تعطل ألعاب Game Boy Advance (GBA).",
      "تستكشف المحادثة بنية GBA وإمكانية وصول الأجهزة الصوتية إلى ROM الخاص باللعبة.",
      "تتم مناقشة مواضيع مختلفة ، بما في ذلك استعادة الساعة ، وأنظمة الترميز ، ومعالجة الإشارات الرقمية ، وتقنية GPS ، والمرشحات المتوسطة لإزالة الضوضاء في الصور ، وقيود دقة 8 بت ، واستخدام المحاكيات لاكتشاف الأخطاء في ذاكرة القراءة فقط GBA المعاد بناؤها."
    ],
    "points": 484,
    "commentCount": 66,
    "retryCount": 0,
    "time": 1705945153
  },
  {
    "id": 39090879,
    "title": "يقدم Instagram \"مطالبات الملاحظات\" لتشجيع تفاعل المستخدمين",
    "originLink": "https://www.neowin.net/news/meta-now-lets-eu-users-unlink-their-facebook-messenger-and-instagram-accounts/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39090879",
    "commentBody": "",
    "originSummary": [
      "أطلق Instagram ميزة جديدة تسمى \"Notes Prompts\" تمكن المستخدمين من إرسال تذكيرات أو مطالبات إلى أصدقائهم.",
      "تهدف هذه الميزة إلى تشجيع الأصدقاء على الرد على الرسائل أو المنشورات.",
      "يمكن للمستخدمين استخدام \"مطالبات الملاحظات\" لضمان حصول رسائلهم أو منشوراتهم على الاهتمام والمشاركة من أصدقائهم."
    ],
    "commentSummary": [
      "تعد لوائح الاتحاد الأوروبي (EU) موضوعا ساخنا ، خاصة فيما يتعلق بخصوصية البيانات وشركات التكنولوجيا.",
      "يتمتع المستخدمون في الاتحاد الأوروبي بالقدرة على إلغاء ربط حساباتهم على Facebook و Messenger و Instagram ، مما يثير تحديات وآثار.",
      "كان للوائح GDPR تأثير على خصوصية المستخدم ، ولكن هناك قيود وانتقادات للوائح الاتحاد الأوروبي.",
      "كما تتم مناقشة النوافذ المنبثقة لملفات تعريف الارتباط والتأثير المحتمل لشركات التكنولوجيا الكبرى على التشريعات.",
      "قد يكون بدء أعمال البرمجيات وتنميتها في أوروبا أمرا صعبا.",
      "توجد آراء مختلفة حول فعالية وتنفيذ اللوائح ، وكذلك دور السياسيين والمواطنين في تشكيلها.",
      "تتطرق المناقشات أيضا إلى خدمات Google ، والترابط بين المنصات ، والحظر المحتمل على YouTube أو Gmail."
    ],
    "points": 447,
    "commentCount": 224,
    "retryCount": 0,
    "time": 1705939200
  },
  {
    "id": 39099065,
    "title": "أخبار القراصنة يدعم الآن اتصال IPv6",
    "originLink": "https://news.ycombinator.com/item?id=39099065",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39099065",
    "commentBody": "",
    "originSummary": [
      "يتصل متصفح المستخدم الآن ب Hacker News عبر IPv6 ، كما يتضح من وجود عناوين IPv4 و IPv6 التي تنتمي إلى نفس ASN (M5 Computer Security).",
      "يسعد المستخدم بإعادة توجيهه إلى Hacker News ويأمل ألا يعاني من نفس مصير Reddit ، الذي تم إيقاف تشغيله سابقا."
    ],
    "commentSummary": [
      "يقدم هذا الملخص نظرة عامة على تنفيذ IPv6 والتحديات والفوائد والمخاوف.",
      "يغطي موضوعات مثل ملحقات المتصفح ، وتخصيص العنوان ، ومشكلات زمن الوصول ، وأداء الألعاب ، وسعة الشبكة ، ودعم TLS ، واستخدام CGNAT.",
      "تؤكد المناقشات على التعقيدات والمزايا المحتملة لاعتماد IPv6 ، فضلا عن التردد والصعوبات التي يواجهها المستخدمون ومقدمو خدمات الإنترنت."
    ],
    "points": 361,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1705978815
  },
  {
    "id": 39091777,
    "title": "فتح الوصول المجاني: ابدأ بتسجيل الدخول",
    "originLink": "https://lightning.ai/lightning-ai/studios/code-lora-from-scratch?view=public&section=all",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39091777",
    "commentBody": "",
    "originSummary": ["تشير عبارة \"تسجيل الدخول والبدء مجانا\" إلى وجود خيار تسجيل دخول مجاني."],
    "commentSummary": [
      "يتركز النقاش حول تنفيذ وتحسين LoRA في نماذج التعلم الآلي ، مع اختلاف الآراء حول ما إذا كان ينبغي تطبيقه على جميع الطبقات أو الطبقة الأخيرة فقط.",
      "هناك ارتباك فيما يتعلق بالاختصار LoRA, حيث يمكن الخلط بينه وبين بروتوكول راديو LoRa.",
      "تستكشف المناقشة أيضا التمييز بين الهندسة والاكتشاف في الذكاء الاصطناعي ، والافتقار إلى الأسس النظرية للذكاء ، وتحديات إنشاء مبادئ قابلة للتعميم.",
      "يتم فحص حالات الاستخدام المختلفة للضبط الدقيق في التعلم الآلي ومقارنتها بالتوليد المعزز للاسترجاع.",
      "تختتم المحادثة بتعليق خفيف حول احتمال تسمية مشروع \"Lehsun\"."
    ],
    "points": 297,
    "commentCount": 74,
    "retryCount": 0,
    "time": 1705942580
  },
  {
    "id": 39097314,
    "title": "جمهورية التشيك تحدد 6 يونيو 2032 كتاريخ انتهاء لخدمات IPv4",
    "originLink": "https://konecipv4.cz/en/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097314",
    "commentBody": "",
    "originSummary": [
      "وافقت حكومة الجمهورية التشيكية على خطة لاعتماد تقنيات DNSSEC و IPv6 في إدارة الدولة.",
      "اعتبارا من 6 يونيو 2032 ، لن تقدم الدولة خدمات عبر IPv4.",
      "هذا الانتقال ضروري بسبب العدد المتزايد من الأجهزة والخدمات ، حيث أصبحت عناوين IPv4 غير كافية ، بينما يقدم IPv6 عددا غير محدود تقريبا من العناوين.",
      "تم تعيين العد التنازلي لنهاية IPv4 على 3056 يوما و 13 ساعة و 57 دقيقة و 16 ثانية."
    ],
    "commentSummary": [
      "تستكشف المناقشة تحديات وفوائد الانتقال من IPv4 إلى IPv6.",
      "تتم مناقشة الآثار المترتبة على تتبع الأفراد ، واستخدام العناوين المحلية الفريدة ، والقيود ، والمخاوف الأمنية لكل من IPv4 و IPv6.",
      "تؤكد المحادثة على أهمية دعم الأجهزة والبرامج ، والحاجة إلى مبادرات لدفع التبني ، وتعقيدات ترقية البنية التحتية."
    ],
    "points": 269,
    "commentCount": 260,
    "retryCount": 0,
    "time": 1705967767
  },
  {
    "id": 39095337,
    "title": "Winlator: تشغيل تطبيقات ويندوز على الروبوت مع النبيذ وBox86 / box64",
    "originLink": "https://winlator.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39095337",
    "commentBody": "",
    "originSummary": [
      "Winlator هو تطبيق Android يتيح للمستخدمين تشغيل تطبيقات Windows باستخدام Wine و Box86 / Box64.",
      "تم تطوير المشروع بمساعدة ptitSeb ومطوري النبيذ.",
      "يمكن تنزيل أحدث إصدار من Winlator من الموقع الرسمي ، وهو محمي بحقوق الطبع والنشر بواسطة BrunoSX."
    ],
    "commentSummary": [
      "تدور المناقشة حول تشغيل تطبيقات Windows على منصات مختلفة مثل Android و Linux ، حيث يشارك المستخدمون تجاربهم وتوصياتهم.",
      "تشمل الموضوعات المحددة تشغيل الألعاب وتطبيقات Microsoft Office وبرامج إنتاج الموسيقى.",
      "هناك تركيز خاص على استخدام Wine ، طبقة التوافق ، لتشغيل برامج مختلفة."
    ],
    "points": 269,
    "commentCount": 72,
    "retryCount": 0,
    "time": 1705957047
  },
  {
    "id": 39088551,
    "title": "التحويل: بديل سحابي أصلي من الجيل التالي ل Git",
    "originLink": "https://news.ycombinator.com/item?id=39088551",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39088551",
    "commentBody": "",
    "originSummary": [
      "Diversion هو نظام تحكم في الإصدار السحابي الأصلي مصمم لحل مشكلات قابلية التوسع والتعقيد في Git.",
      "يهدف إلى الحفاظ على قدرات Git المتفرعة والدمج مع تقديم التعاون والتوافق في الوقت الفعلي مع مستودعات Git.",
      "التحويل حاليا في مرحلة تجريبية مفتوحة وسيتم إصداره كمصدر مفتوح في المستقبل."
    ],
    "commentSummary": [
      "تدور المناقشات حول قيود وتعقيدات Git ، وهو نظام شائع للتحكم في الإصدار ، والحاجة إلى حلول بديلة.",
      "يتم تقديم التحويل ، وهو بديل سحابي أصلي ل Git ، كحل محتمل لمطوري الألعاب.",
      "تشمل الموضوعات الأخرى استخدام أشجار بناء الجملة المجردة (AST) في التحكم في الإصدار ، وتحديات قابلية التوسع مع monorepos في Git ، والنقاش حول تعقيد وفعالية Git كنظام للتحكم في الإصدار."
    ],
    "points": 269,
    "commentCount": 382,
    "retryCount": 0,
    "time": 1705924870
  },
  {
    "id": 39088991,
    "title": "يأس رائد الفضاء في المدار: يهدد بالبقاء في الفضاء",
    "originLink": "https://arstechnica.com/space/2024/01/solving-a-nasa-mystery-why-did-space-shuttle-commanders-lock-the-hatch/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39088991",
    "commentBody": "",
    "originSummary": [
      "واجه تايلور وانغ ، أول شخص صيني المولد يطير إلى الفضاء ، انتكاسة كبيرة عندما فشلت تجربته في العمل أثناء وجوده على متن مكوك الفضاء.",
      "وقد حرم في البداية من فرصة استكشاف الأخطاء وإصلاحها وإصلاح التجربة، مما دفعه إلى التهديد بعدم العودة إلى الأرض.",
      "يسلط هذا الحادث الضوء على الصعوبات التي يواجهها رواد الفضاء من خارج وكالة ناسا وأخصائيو الحمولة الذين يجرون تجارب علمية في الجاذبية الصغرى ، ولا تزال ذات صلة اليوم حيث تفتح رحلات الفضاء التجارية مسارات لمزيد من الأفراد لاستكشاف الفضاء."
    ],
    "commentSummary": [
      "تدور المحادثة حول مقال حول قضايا الصحة العقلية لرائد الفضاء واستخدام تقنيات سرد القصص في إعداد التقارير.",
      "تتم مناقشة أهمية الصحافة الموجزة والنقاش المستمر حول طول المقالة وأهميتها.",
      "وتشمل الموضوعات الأخرى تبرير رحلات الفضاء البشرية ، ودور الروبوتات في استكشاف الفضاء ، والمخاطر المحتملة وتدابير السلامة في البعثات الفضائية."
    ],
    "points": 251,
    "commentCount": 212,
    "retryCount": 0,
    "time": 1705928225
  },
  {
    "id": 39097502,
    "title": "الكتاب المفتوح لهندسة التعلم الآلي: مورد شامل للغة التدريب والنماذج متعددة الوسائط",
    "originLink": "https://github.com/stas00/ml-engineering",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39097502",
    "commentBody": "",
    "originSummary": [
      "الكتاب المفتوح لهندسة التعلم الآلي عبارة عن مجموعة شاملة من المنهجيات والموارد لتدريب نماذج اللغات الكبيرة والنماذج متعددة الوسائط.",
      "يوفر المواد التقنية ، بما في ذلك البرامج النصية والأوامر ، التي تهدف بشكل خاص إلى تدريب المهندسين والمشغلين الذين يعملون مع نماذج LLM / VLM.",
      "يشارك الكتاب تجارب المؤلف في تدريب النماذج مفتوحة المصدر ، والتي تغطي مكونات الأجهزة ، وتحسين الأداء ، وتشغيل SLURM ، وتصحيح أخطاء التطوير ، وغيرها من الموارد المتنوعة."
    ],
    "commentSummary": [
      "يعد كتاب ML Engineering عبر الإنترنت موردا مفيدا للأفراد المشاركين في التعلم الآلي ، حيث يقدم رؤى حول التحسين والأداء والجوانب الهندسية ذات المستوى الأدنى.",
      "يقترح الكتاب استخدام ملفات التعريف والأدوات الأخرى لفهم أداء النموذج وتحسينه بشكل أفضل.",
      "يستخدم Slurm ، مدير عبء العمل ، على نطاق واسع في مجتمع الحوسبة عالية الأداء (HPC) ، في المقام الأول في الأوساط الأكاديمية ومراكز الحوسبة البحثية. ومع ذلك ، خارج الأوساط الأكاديمية وسياقات الحوسبة عالية الأداء ، يتم استخدام بدائل مثل AWS و Snowflake بشكل أكثر شيوعا."
    ],
    "points": 237,
    "commentCount": 19,
    "retryCount": 0,
    "time": 1705968866
  },
  {
    "id": 39092278,
    "title": "اكتشافات الصدفة: المحليات الصناعية والبحث عن محليات جديدة",
    "originLink": "https://www.lesswrong.com/posts/oA23zoEjPnzqfHiCt/there-is-way-too-much-serendipity",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39092278",
    "commentBody": "",
    "originSummary": [
      "يستكشف المقال الاكتشافات العرضية للمحليات الصناعية ويثير أسئلة حول عملية إنشاء محليات جديدة.",
      "يدرس الأسباب الكامنة وراء تفضيلنا للنكهات الحلوة ويشير إلى أن المحليات منخفضة السعرات الحرارية قد لا تكون موجودة بشكل طبيعي.",
      "كما تسلط المناقشة الضوء على المخاطر المحتملة لتذوق الكيميائيين للمواد والقيود المفروضة على طرق اكتشاف الأدوية."
    ],
    "commentSummary": [
      "تغطي المحادثة مجموعة واسعة من الموضوعات العلمية ، مثل الصداع النصفي والمحفزات ودور ميكانيكا الكم في الكيمياء.",
      "يتضمن مناقشات حول المفاهيم الرياضية مثل الجذر التربيعي ل 2 كونه عددا غير نسبي.",
      "تتطرق المحادثة أيضا إلى موضوعات مثل المركبات وتأثيراتها على الكائنات الحية ، والتقدم العلمي ، والذوق والتطور ، والاكتشافات العرضية للمحليات ، بما في ذلك السكر المزيف."
    ],
    "points": 199,
    "commentCount": 93,
    "retryCount": 0,
    "time": 1705944384
  },
  {
    "id": 39098603,
    "title": "أكد عالم الفيزياء الحائز على جائزة نوبل أرنو أ. بينزياس ، 90 عاما ، نظرية الانفجار العظيم",
    "originLink": "https://www.nytimes.com/2024/01/22/science/space/arno-a-penzias-dead.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39098603",
    "commentBody": "",
    "originSummary": [
      "توفي أرنو أ. بينزياس ، عالم الفيزياء الحائز على جائزة نوبل ، عن عمر يناهز 90 عاما.",
      "أكد نظرية الانفجار العظيم باكتشافه إشعاع الخلفية الكونية الميكروي في عام 1964.",
      "كان اكتشاف بينزياس غير المتوقع بمثابة لحظة محورية في علم الكونيات ، حيث نقله من مجال فلسفي إلى مجال مدفوع بالبحث القائم على الملاحظة."
    ],
    "commentSummary": [
      "توفي أرنو أ. بينزياس ، عالم الفيزياء الحائز على جائزة نوبل ، عن عمر يناهز 90 عاما.",
      "اكتشف بينزياس وزميله روبرت ويلسون إشعاع الخلفية الكونية الميكروي ، مما يدعم نظرية الانفجار العظيم.",
      "لم يتم الاعتراف بنتائجهم المهمة في البداية بشكل كامل ، لكنهم حصلوا على جائزة نوبل في الفيزياء في عام 1978 لمساهمتهم في علم الكونيات."
    ],
    "points": 181,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1705975546
  },
  {
    "id": 39091416,
    "title": "أتمتة تحسين تكلفة السحابة يوفر 150 ألف دولار في السنة",
    "originLink": "https://tuananh.net/2024/01/21/cloud-cost-optimization-at-scale-part-1/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39091416",
    "commentBody": "",
    "originSummary": [
      "يؤكد المؤلف على أهمية تحسين تكلفة السحابة ويقدم حلا باستخدام Lambda و Step Functions و EventBridge.",
      "يقوم النظام بأتمتة مهام مثل إيقاف تشغيل الموارد عندما لا تكون قيد الاستخدام ، وتنفيذ سياسات الأمان ، والإغلاق التلقائي للموارد.",
      "يدعي الحل أنه حقق انخفاضا بنسبة 70٪ في التكاليف غير الإنتاجية ، مع وفورات متوقعة قدرها 150 ألف دولار أمريكي سنويا. تتضمن الخطط المستقبلية معالجة أعباء العمل الأكثر تعقيدا مثل Kubernetes."
    ],
    "commentSummary": [
      "تركز المناقشة على إدارة التكاليف في البنية التحتية السحابية وتطوير البرمجيات والهندسة.",
      "يشارك المشاركون خبراتهم ورؤاهم حول خفض التكاليف والتغلب على تحديات شفافية الفواتير.",
      "يتم تقديم توصيات لاستراتيجيات وأدوات ونهج مختلفة لإدارة النفقات في الخدمات السحابية بشكل فعال."
    ],
    "points": 169,
    "commentCount": 186,
    "retryCount": 0,
    "time": 1705941237
  },
  {
    "id": 39098780,
    "title": "مزاعم الاحتيال والتلاعب بالبيانات تهز معهد دانا فاربر للسرطان بجامعة هارفارد",
    "originLink": "https://forbetterscience.com/2024/01/02/dana-farberications-at-harvard-university/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39098780",
    "commentBody": "",
    "originSummary": [
      "ظهرت مزاعم التلاعب بالبيانات وسوء السلوك في أبحاث السرطان في معهد دانا فاربر للسرطان بجامعة هارفارد.",
      "تم تحديد حالات محددة من تزوير البيانات والممارسات الاحتيالية.",
      "ويجري التشكيك في مصداقية وكفاءة بعض الباحثين، وقد تم إجراء العديد من عمليات السحب والتصويب نتيجة لهذه الادعاءات."
    ],
    "commentSummary": [
      "يناقش قسم المقالة والتعليقات مزاعم الأبحاث المزيفة في معهد دانا فاربر للسرطان.",
      "تشمل موضوعات المحادثة التحديات والتحيزات في البحث العلمي وأنظمة تصنيف الجامعات وانخفاض معايير التدريس في جامعة هارفارد.",
      "تشمل الموضوعات الإضافية التي تم التطرق إليها في التعليقات التفاوتات العرقية في الأداء الأكاديمي ، وتضخم الدرجات ، وعدم الاهتمام بتصحيح الأوراق المزورة ، وإيجابية الجسم ، والتركيز على الشبكات في جامعة هارفارد ، وقيمة المؤسسات التعليمية ، وعلوم المناخ ، ودعم الديناميات الاجتماعية على الرغم من المعتقدات الدينية الشخصية."
    ],
    "points": 159,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1705976766
  }
]
