[
  {
    "id": 40521518,
    "title": "لماذا أبتعد عن GraphQL بعد ست سنوات",
    "originLink": "https://bessey.dev/blog/2024/05/24/why-im-over-graphql/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521518",
    "commentBody": "",
    "originSummary": [
      "يشارك المؤلف تجربة مدتها ست سنوات مع GraphQL ، مشيرا في البداية إلى فوائدها على واجهات برمجة تطبيقات JSON REST غير المكتوبة ولكنها تشير في النهاية إلى عيوب كبيرة.",
      "تتضمن المشكلات الرئيسية في GraphQL زيادة سطح الهجوم ، والتخويل المعقد ، وتحديات تحديد المعدل ، ونقاط الضعف في تحليل الاستعلام ، ومشاكل الأداء مثل مشكلة N + 1.",
      "يوصي المؤلف بالنظر في بدائل مثل واجهات برمجة تطبيقات JSON REST المتوافقة مع OpenAPI والأدوات الحديثة مثل FastAPI و tsoaو TypeSpec لتطوير واجهة برمجة تطبيقات أكثر كفاءة وأمانا."
    ],
    "commentSummary": [
      "بعد ست سنوات من استخدام GraphQL ، يجد المؤلف أنه معقد للغاية ، لا سيما في الأذونات والأداء وتصحيح الأخطاء ، مما يشير إلى أن نقاط نهاية REST التقليدية قد تكون أكثر كفاءة.",
      "تسلط المناقشة الضوء على تحديات دمج GraphQL مع أنظمة الواجهة الخلفية ، مع التأكيد على الحاجة إلى المعرفة التفصيلية والتوثيق ، وتقترح حلولا مثل منشئي الاستعلامات من جانب الخادم وتصميمات المخطط أولا.",
      "يتناقض النقاش بين مرونة GraphQL والاستعلام المتداخل الفعال مع بساطة REST وموثوقيتها ، مع ملاحظة أن الاختيار بينهما يجب أن يعتمد على الاحتياجات المحددة للمشروع ونضجه."
    ],
    "points": 647,
    "commentCount": 453,
    "retryCount": 0,
    "time": 1717059030
  },
  {
    "id": 40521657,
    "title": "بول جراهام ينفي شائعات عن طرد سام من Y Combinator",
    "originLink": "https://twitter.com/paulg/status/1796107666265108940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521657",
    "commentBody": "",
    "originSummary": [
      "أوضح بول جراهام ، المؤسس المشارك لشركة Y Combinator (YC) ، على تويتر أن سام ألتمان لم يتم طرده من قبل YC ، حيث تناول وواجه الشائعات المتداولة.",
      "يهدف هذا البيان إلى تبديد المعلومات الخاطئة وتوفير الوضوح فيما يتعلق برحيل سام ألتمان من YC."
    ],
    "commentSummary": [
      "مناقشة Hacker News ، التي أثارتها تغريدة بول جراهام ، تفضح الأساطير حول القيادة غير الربحية ، مع التركيز على التحديات والإرهاق في الأدوار غير مدفوعة الأجر.",
      "تدرس المحادثة دور ميتشل بيكر في موزيلا ورحيل سام ألتمان عن Y Combinator للتركيز على OpenAI ، ومناقشة ما إذا كان ذلك طردا أو خطوة طوعية.",
      "تسلط المناقشة الضوء على تعقيدات إدارة الأدوار ذات المسؤولية العالية والفروق الدقيقة في الروايات العامة المحيطة بالتغييرات المهنية البارزة في التكنولوجيا ورأس المال الاستثماري."
    ],
    "points": 520,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1717060765
  },
  {
    "id": 40520334,
    "title": "كيف يستخدم الممثلون الفهم العميق لحفظ السطور",
    "originLink": "https://thereader.mitpress.mit.edu/how-actors-remember-their-lines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40520334",
    "commentBody": "",
    "originSummary": [
      "يتذكر الممثلون خطوطهم من خلال بروفة تفصيلية ، والتي تتضمن فهم معنى المادة وربطها بدوافع وعواطف شخصيتهم.",
      "اكتشف عالما النفس هيلغا وتوني نويس أن الممثلين يتبنون منظور شخصيتهم ويحللون النص بعمق لتذكر الخطوط بشكل طبيعي.",
      "تؤكد هذه الطريقة ، التي يمثلها ممثلون مثل مايكل كين وجون باسنجر ، على المعالجة العميقة والارتباطات ذات المغزى ، مما يعزز الاحتفاظ بالذاكرة وينطبق على المواقف اليومية."
    ],
    "commentSummary": [
      "يستخدم الممثلون تقنيات مثل تقنية Meisner لتعزيز التفاعل الحقيقي والأصالة العاطفية ، مع التركيز على الاستجابات في الوقت الفعلي بدلا من الحفظ عن ظهر قلب.",
      "تتناقض المناقشة بين التمثيل العاطفي الداخلي والإسقاط الخارجي ، مشبهة الأخير بعدم القدرة على التنبؤ الذكاء الاصطناعي ، وتسلط الضوء على موضوعات من \"هي\" حول حدود التواصل في الذكاء الاصطناعي.",
      "يجمع المتحدثون والممثلون الفعالون بين الفهم العميق للمواد والشخصيات الجذابة ، بينما يتفوق المهندسون في التواصل المرتجل بسبب فهمهم العميق."
    ],
    "points": 417,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1717046506
  },
  {
    "id": 40519722,
    "title": "FrankenPHP: خادم PHP حديث مع ميزات Go و Caddy و Cloud-Native",
    "originLink": "https://frankenphp.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40519722",
    "commentBody": "",
    "originSummary": [
      "FrankenPHP هو خادم تطبيقات PHP حديث مكتوب بلغة Go ، ويدمج منفذ PHP الرسمي مع خادم الويب Caddy ، ويدعم HTTP / 1.1 و HTTP / 2 و HTTP / 3 وشهادات HTTPS التلقائية.",
      "تشمل الميزات الرئيسية وضع العامل لتحسين الأداء ، والتوافق مع أطر عمل PHP الشائعة ، ودعم تنسيقات الضغط الحديثة ، ومقاييس Prometheus المضمنة ، والتسجيل المنظم ، ومعالجة الأحداث في الوقت الفعلي عبر مركز Mercure.",
      "تم تصميم FrankenPHP للبيئات السحابية الأصلية ، وهو سهل النشر كصورة Docker أو ثنائي مستقل ، بقيادة Kévin Dunglas ، مع تصميم Laury Sorriaux ورعاية من Les-Tilleuls.coop."
    ],
    "commentSummary": [
      "FrankenPHP هو خادم تطبيقات PHP حديث يدمج PHP داخل خادم Go ، مما يبسط النشر في ثنائي واحد ، ويجذب المطورين لتصميمه سهل الاستخدام.",
      "تسلط المناقشة الضوء على إيجابيات وسلبيات PHP و Go لتطوير الويب ، حيث تشتهر PHP بسهولة الاستخدام والميزات المضمنة ، بينما يتم الإشادة ب Go لقابلية التوسع والأمان ومعالجة الأخطاء.",
      "على الرغم من إمكاناتها ، تواجه FrankenPHP انتقادات بسبب عملية البناء المعقدة ، ومشكلات الأداء ، ونقص دعم وضع العامل ، مما يشير إلى الحاجة إلى مزيد من التحسين والتوثيق الأفضل."
    ],
    "points": 389,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1717038632
  },
  {
    "id": 40522844,
    "title": "تعمل واجهة مستخدم ChatGPT الجديدة على تحسين استكشاف حفرة الأرنب من خلال تخطيط التبليط ومطالبات الارتباط التشعبي",
    "originLink": "https://delve.a9.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522844",
    "commentBody": "",
    "originSummary": [
      "تقوم الواجهة بتحويل عملية ثقب الأرانب إلى تخطيط تجانب ، مما يسمح للمستخدمين باستكشاف الموضوعات من خلال مطالبات الارتباط التشعبي التي تم إنشاؤها.",
      "ستشمل الميزات القادمة الجلسات وإمكانات المشاركة والتنقل المحسن ووظائف التمييز إلى التعمق وتكامل الصور.",
      "يسعى المطورون للحصول على تعليقات حول حالات الاستخدام الإضافية والأفكار لمزيد من التحسين."
    ],
    "commentSummary": [
      "قدم Maxkrieger واجهة ChatGPT جديدة على a9.io ، تتميز بتصميم تجانب يعزز استكشاف الموضوع من خلال مطالبات الارتباط التشعبي التي تم إنشاؤها بواسطة النموذج.",
      "يهدف التصميم إلى تحسين تجربة المستخدم لنماذج اللغات الكبيرة (LLMs) من خلال منع إعادة فتح الموضوعات التي تم استكشافها بالفعل ويتم تشبيهه بالتنقل في ويكيبيديا.",
      "يثني المستخدمون على الواجهة النظيفة والسريعة والجذابة ، ويقترحون تحسينات مثل رؤية أفضل للارتباط ، وإدارة الجلسة ، وتخطيط شجرة للتنقل ، وتمييز الكلمات يدويا ، ولوحة قماشية قابلة للتكبير ، مع ملاحظة التطبيقات التعليمية المحتملة."
    ],
    "points": 356,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1717071755
  },
  {
    "id": 40521963,
    "title": "تم الكشف عن رسالة حب ريتشارد فاينمان غير المفتوحة إلى زوجته الراحلة بعد وفاته",
    "originLink": "https://lettersofnote.com/2012/02/15/i-love-my-wife-my-wife-is-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521963",
    "commentBody": "",
    "originSummary": [
      "كتب ريتشارد فاينمان ، عالم الفيزياء الشهير ، رسالة حب صادقة إلى زوجته الراحلة ، أرلين ، بعد 16 شهرا من وفاتها في عام 1945.",
      "الرسالة ، التي ظلت غير مفتوحة حتى بعد وفاة فاينمان في عام 1988 ، تعبر عن حبه وحزنه الدائمين.",
      "تظهر هذه الرسالة المؤثرة في كتاب \"رسائل ملاحظة\"."
    ],
    "commentSummary": [
      "يشارك أحد مستخدمي المنتدى رحلة استمرت عقدا من الزمن للتعامل مع وفاة زوجته ، مما يعكس اختلاط ريتشارد فاينمان كآلية للتكيف والتوازن بين الوظيفة والأسرة.",
      "تتعمق المناقشة في التعقيدات العاطفية والأخلاقية للبحث عن علاقات جديدة بعد وفاة الزوج ، مع التأكيد على الموافقة المستنيرة وعدم إمكانية استبدال الروابط العميقة طويلة الأجل.",
      "يعيد منشور Hacker News النظر في رسالة فاينمان إلى زوجته الراحلة ، مما أثار مناقشات حول الحب والخسارة وأخلاقيات نشر الكتابات الخاصة والموضوعات الأوسع لدور الموت في التطور المجتمعي والنمو الشخصي."
    ],
    "points": 282,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1717063567
  },
  {
    "id": 40525064,
    "title": "تجنب التجريدات المبكرة: إعادة التفكير في مبدأ DRY في الترميز",
    "originLink": "https://testing.googleblog.com/2024/05/dont-dry-your-code-prematurely.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525064",
    "commentBody": "",
    "originSummary": [
      "ينصح دان ماكسيموفيتش بعدم التطبيق السابق لأوانه لمبدأ \"لا تكرر نفسك\" (DRY) في الترميز ، لأنه يمكن أن يؤدي إلى تجريدات سابقة لأوانها وتعقيد التغييرات المستقبلية.",
      "ويقترح التسامح مع بعض الازدواجية في التعليمات البرمجية في البداية للحفاظ على منطق أكثر وضوحا وتحديدا للسياق وتسهيل التعديلات المستقبلية الأسهل.",
      "يتوافق نهج ماكسيموفيتش مع مبدأ \"لن تحتاج إليه\" (YAGNI) ، والذي يوصي بتجنب إضافة وظائف غير ضرورية حتى تكون هناك حاجة إليها حقا."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على الحاجة إلى تحقيق التوازن بين قابلية قراءة الكود وتماسكه مع مبدأ \"لا تكرر نفسك\" (DRY) في تطوير البرمجيات.",
      "يتفق المساهمون على أنه في حين أن DRY يعزز التماسك ، إلا أنه يمكن أن يعقد تصحيح الأخطاء بسبب التجريدات المتداخلة ، والدعوة إلى إعطاء الأولوية لقابلية القراءة والصيانة.",
      "وتؤكد المحادثة على أهمية اتخاذ القرارات المدركة للسياق والمفاضلات في الهندسة، مع التركيز على الأمثلة العملية والرؤى التاريخية حول إدارة الديون الفنية وتحسين مجالات الأداء الحرجة."
    ],
    "points": 231,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1717083954
  },
  {
    "id": 40515957,
    "title": "آليات الانتباه الجديدة تتجاوز الاهتمام القياسي متعدد الرؤوس في الكفاءة والأداء",
    "originLink": "https://arxiv.org/abs/2403.01643",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40515957",
    "commentBody": "",
    "originSummary": [
      "تقدم ورقة \"أنت بحاجة إلى إيلاء اهتمام أفضل\" لمهران حسيني وبيمان حسيني ثلاث آليات انتباه جديدة: الانتباه الأمثل ، والاهتمام الفعال ، والاهتمام الفائق.",
      "يقلل الانتباه المحسن المعلمات بنسبة 25٪ ويتطلب مضاعفة مصفوفة أقل لكل فرد ، بينما يعمل الانتباه الفعال على تقليل المعلمات إلى النصف وتقليل مضاعفات المصفوفة بمقدار اثنين لكل رأس ، مما يضاعف السرعة.",
      "يتفوق Super Attention بشكل كبير على الاهتمام القياسي في مهام معالجة الرؤية واللغة الطبيعية ، والتي يتم تقييمها على مجموعات البيانات مثل MNST و CIFAR100 و IMDB Movie Reviews و Amazon Reviews."
    ],
    "commentSummary": [
      "تقدم الأبحاث الحديثة آليات انتباه جديدة مثل الانتباه الأمثل والانتباه الفعال والانتباه الفائق والانتباه Infini ، والتي تتفوق على الاهتمام القياسي متعدد الرؤوس في الكفاءة والأداء.",
      "يتم استكشاف تحويل فورييه المنفصل 2D (DFT) كبديل محتمل لآليات الانتباه ، مع مناقشات حول تكامله في الشبكات العصبية ومكاسب الكفاءة المشار إليها في ورقة FNet.",
      "تسلط المحادثة الضوء على تعقيد أنظمة الذكاء الاصطناعي ، والتأثير البيئي للنماذج الكبيرة ، ونفور الصناعة من المخاطر ، مع التأكيد على الحاجة إلى مزيد من التجارب والتحقق من صحة التقنيات الجديدة."
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1717011192
  },
  {
    "id": 40518016,
    "title": "جوجل تؤكد صحة 2500 وثيقة بحث مسربة",
    "originLink": "https://www.theverge.com/2024/5/29/24167407/google-search-algorithm-documents-leak-confirmation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40518016",
    "commentBody": "",
    "originSummary": [
      "أكدت Google صحة 2,500 وثيقة داخلية مسربة توضح بالتفصيل البيانات التي تجمعها ، والتي قد يؤثر بعضها على خوارزمية ترتيب البحث الخاصة بها.",
      "قام خبيرا تحسين محركات البحث راند فيشكين ومايك كينج بتحليل المستندات ، وقدما لمحة نادرة عن عمليات بحث Google ، لكنهما تركا العديد من الأسئلة دون إجابة حول استخدام البيانات وترجيحها.",
      "ومن المتوقع أن يؤثر التسريب على صناعات تحسين محركات البحث والتسويق والنشر، التي تعتمد بشكل كبير على فهم آليات البحث في جوجل، على الرغم من أن المتحدث باسم جوجل حذر من استخلاص استنتاجات من المعلومات التي يحتمل أن تكون قديمة أو غير كاملة."
    ],
    "commentSummary": [
      "أكدت Google صحة مستندات البحث الداخلية المسربة ، مما أثار مخاوف بشأن التلاعب في تحسين محركات البحث (SEO) مما يؤدي إلى تفاقم نتائج البحث.",
      "أكد التسريب صحة الشكوك حول استخدام Google للنقرات وبيانات Chrome للتصنيفات ، على عكس النفي السابق ، مما أثر على الدعاوى القضائية المستمرة وسلط الضوء على قضايا مثل هيمنة الإعلانات والتحديات التي تواجه الناشرين الأصغر.",
      "تشمل المناقشات تطور تحسين محركات البحث ، وإمكانات الأنظمة التي تعتمد على الذكاء الاصطناعي مثل ChatGPT لتحل محل محركات البحث التقليدية ، واقتراحات لتصنيف مواقع الويب بشكل عشوائي لمنع التلاعب ، على الرغم من استمرار المخاوف بشأن التسويق والتحيز."
    ],
    "points": 222,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717023058
  },
  {
    "id": 40525130,
    "title": "هجوم إلكتروني هائل يعطل 600000 جهاز توجيه SOHO ، ويتطلب استبدال الأجهزة",
    "originLink": "https://blog.lumen.com/the-pumpkin-eclipse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525130",
    "commentBody": "",
    "originSummary": [
      "أبلغت Black Lotus Labs التابعة لشركة Lumen Technologies عن هجوم إلكتروني في الفترة من 25 إلى 27 أكتوبر 2023 ، أدى إلى تعطيل أكثر من 600,000 جهاز توجيه SOHO (مكتب صغير / مكتب منزلي) داخل شبكة مزود خدمة إنترنت واحد ، مما يتطلب استبدال الأجهزة.",
      "استغل الهجوم ، المنسوب إلى برنامج Chalubo RAT (حصان طروادة للوصول عن بعد) ، بيانات الاعتماد الضعيفة أو الواجهات المكشوفة ، مما تسبب في اضطرابات كبيرة في الخدمة ، لا سيما في المناطق الريفية.",
      "تنصح Black Lotus Labs بتأمين أجهزة التوجيه بكلمات مرور قوية وتحديثات منتظمة ؛ يتوفر مزيد من التفاصيل ومؤشرات التسوية (IoCs) على صفحة GitHub الخاصة بهم."
    ],
    "commentSummary": [
      "تركز المناقشات على إدارة تحديثات البرامج الثابتة والتخزين للأجهزة المتصلة بالإنترنت ، وتحقيق التوازن بين تصحيحات الأمان ومنع التحديثات غير المرغوب فيها.",
      "تشمل القضايا الرئيسية استخدام التخزين غير القابل للتغيير لاستعادة النظام ، وتعقيدات الأجهزة التي يتحكم فيها مزود خدمة الإنترنت ، وأهمية أنظمة التمهيد الآمن.",
      "تؤكد حوادث محددة ، مثل الباب الخلفي ل 600000 جهاز توجيه وانقطاع Windstream على نطاق واسع ، على الحاجة إلى آليات تحديث موثوقة وممارسات أمنية قوية."
    ],
    "points": 218,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1717084349
  },
  {
    "id": 40522241,
    "title": "يثبت PyPy موثوقيته وكفاءته لبرامج Python على خوادم Ubuntu",
    "originLink": "https://utcc.utoronto.ca/~cks/space/blog/python/PyPyQuietlyWorking",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522241",
    "commentBody": "",
    "originSummary": [
      "أبلغ كريس سيبنمان عن تجربة إيجابية باستخدام PyPy كبديل ل CPython على خوادم Ubuntu ، المثبتة عبر pipx.",
      "يعمل PyPy بسلاسة لسنوات ، حتى مع الحزم المعقدة ، بما في ذلك أداة CLI لمزود السحابة الأخير.",
      "تؤكد تجربة Siebenmann على فعالية PyPy وموثوقيتها كبديل أسرع ل CPython."
    ],
    "commentSummary": [
      "توضح المناقشة الخلط بين PyPy (مترجم Python) و PyPI (فهرس حزمة Python) ، وتشرح بروح الدعابة مصطلح \"عجلة\" في عبوات Python.",
      "يشارك المستخدمون الخبرات مع PyPy ، ويسلطون الضوء على فوائدها وقيودها ، خاصة مع حزم C / Fortran واستخدام الذاكرة ، ومقارنتها مع CPython.",
      "تغطي المحادثة أيضا تكامل بايثون مع اللغات الأخرى للحوسبة العلمية ، وتحديات تجميع Just-In-Time (JIT) ، وتأثير شركات التكنولوجيا الكبرى على تطوير Python ، بما في ذلك مشاريع مثل NoGIL و Faster CPython."
    ],
    "points": 180,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1717066360
  },
  {
    "id": 40516532,
    "title": "الصبر الاستراتيجي لشركة Waymo وهندستها يدفعانها إلى قيادة سيارات الأجرة الآلية",
    "originLink": "https://fortune.com/2024/05/29/waymo-self-driving-robo-taxi-uber-tesla-alphabet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516532",
    "commentBody": "",
    "originSummary": [
      "أصبحت Waymo ، التي كانت في البداية \"مشروع Google Self-Driving Car\" ، رائدة في صناعة السيارات ذاتية القيادة ، حيث تقدم خدمات مشاركة الركوب المستقلة بالكامل في فينيكس وسان فرانسيسكو وأجزاء من لوس أنجلوس.",
      "على عكس المنافسين مثل Uber و General Motors's Cruise ، الذين واجهوا انتكاسات وقضايا تتعلق بالسلامة ، تقدمت Waymo بشكل مطرد بسبب نهج التوسع الحذر والهندسة القوية والدعم المالي من Alphabet.",
      "تجنب أسطول Waymo من سيارات الدفع الرباعي الكهربائية Jaguar I-Pace ، المجهزة بأجهزة استشعار متقدمة ، الحوادث الكبرى إلى حد كبير ، لكن الشركة تواجه الآن تدقيقا تنظيميا ومنافسة من اللاعبين الناشئين مثل Tesla."
    ],
    "commentSummary": [
      "أدى نهج Waymo الصارم للقيادة الذاتية إلى نجاح أعمال سيارات الأجرة الآلية ، مما يميزها عن المنافسين مثل Tesla و Uber ، الذين يواجهون انتقادات بسبب الأساليب الأقل صرامة.",
      "تم الإشادة بنظام المستوى 4 من Waymo لسلامته وموثوقيته ، خاصة في ظروف محددة ، في حين يتم انتقاد تقنية القيادة الذاتية الكاملة (FSD) من Tesla بسبب عدم موثوقيتها وأخطائها المتكررة.",
      "تسلط المناقشات الضوء على تحديات ظروف القيادة غير المتوقعة ، والنقاش بين استخدام الكاميرات مقابل LIDAR ، والآثار الاقتصادية والثقافية المحتملة للمركبات ذاتية القيادة."
    ],
    "points": 176,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1717013996
  },
  {
    "id": 40516983,
    "title": "مستشفى القلم في كولكاتا البالغ من العمر 77 عاما ينعش أقلام الحبر العزيزة",
    "originLink": "https://www.vogue.in/content/pen-hospital-in-kolkata-will-nurse-your-broken-fountain-pen-back-to-health",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516983",
    "commentBody": "",
    "originSummary": [
      "مستشفى Pen في كولكاتا ، وهو متجر عمره 77 عاما ، متخصص في إصلاح وصيانة أقلام النافورة ، وجذب عشاق الأقلام الذين يعتبرون أقلامهم إرثا عزيزا.",
      "يدير المتجر حاليا محمد امتياز ، حفيد المؤسس ، ويزدهر المتجر على الرغم من العصر الرقمي والقرطاسية الأرخص بسبب عملائه المتفانين.",
      "لا يقوم امتياز بإصلاح الأقلام فحسب ، بل يقوم أيضا بتثقيف العملاء حول العناية المناسبة بالقلم ، حيث يشهد المتجر زيادة في عدد الزوار خلال مواسم الامتحانات والمناسبات الخاصة."
    ],
    "commentSummary": [
      "بدأ مقال عن \"مستشفى القلم\" في كولكاتا ، الذي يصلح أقلام الحبر ، مناقشة على Hacker News حول صيانة القلم ودقة المصطلحات.",
      "وشملت الموضوعات تجفيف الحبر ، وممارسات التنظيف ، والاختلافات بين تصميمات الأقلام الحديثة والقديمة ، والتأثير البيئي للعناصر التي تستخدم لمرة واحدة.",
      "شارك المستخدمون التفضيلات الشخصية والنصائح والموارد لصيانة القلم والحكايات حول جمع القلم والهوايات المتخصصة."
    ],
    "points": 174,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1717016496
  }
]
