[
  {
    "id": 40521518,
    "title": "למה אני מתרחק מ-GraphQL אחרי שש שנים",
    "originLink": "https://bessey.dev/blog/2024/05/24/why-im-over-graphql/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521518",
    "commentBody": "",
    "originSummary": [
      "המחבר חולק ניסיון של שש שנים עם GraphQL, בתחילה ציין את היתרונות שלה על פני ממשקי API של JSON REST שלא הוקלדו, אך בסופו של דבר הצביע על חסרונות משמעותיים.",
      "בעיות עיקריות עם GraphQL כוללות שטח התקפה מוגבר, הרשאות מורכבות, אתגרי הגבלת קצב, פגיעויות ניתוח שאילתות ובעיות ביצועים כמו בעיית N+1.",
      "המחבר ממליץ לשקול חלופות כמו ממשקי API תואמי JSON REST תואמי OpenAPI וכלים מודרניים כגון FastAPI, tosoa ו- TypeSpec לפיתוח API יעיל ומאובטח יותר."
    ],
    "commentSummary": [
      "לאחר שש שנים של שימוש ב- GraphQL, המחבר מוצא אותו מורכב מדי, במיוחד בהרשאות, ביצועים וניפוי באגים, מה שמרמז על כך שנקודות קצה מסורתיות של REST עשויות להיות יעילות יותר.",
      "הדיון מדגיש את האתגרים בשילוב GraphQL עם מערכות backend, מדגיש את הצורך בידע מפורט ותיעוד, ומציע פתרונות כמו בוני שאילתות בצד השרת ותכנוני סכימה תחילה.",
      "הוויכוח משווה בין הגמישות והשאילתות המקוננות היעילות של GraphQL לבין הפשטות והאמינות של REST, ומציין כי הבחירה ביניהן צריכה להתבסס על הצרכים והבשלות הספציפיים של הפרויקט."
    ],
    "points": 647,
    "commentCount": 453,
    "retryCount": 0,
    "time": 1717059030
  },
  {
    "id": 40521657,
    "title": "פול גרהאם מכחיש את השמועות על פיטוריו של סם מ-Y Combinator",
    "originLink": "https://twitter.com/paulg/status/1796107666265108940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521657",
    "commentBody": "",
    "originSummary": [
      "פול גרהאם, מייסד שותף של Y Combinator (YC), הבהיר בטוויטר כי סם אלטמן לא פוטר על ידי YC, והתייחס לשמועות שהופצו.",
      "הצהרה זו נועדה להפיג מידע שגוי ולספק בהירות לגבי עזיבתו של סם אלטמן את YC."
    ],
    "commentSummary": [
      "דיון של Hacker News, שהתעורר בעקבות ציוץ של פול גרהאם, מנפץ מיתוסים על מנהיגות ללא מטרות רווח, ומדגיש את האתגרים והשחיקה בתפקידים ללא שכר.",
      "השיחה בוחנת את תפקידו של מיטשל בייקר במוזילה ואת עזיבתו של סם אלטמן את Y Combinator כדי להתמקד ב-OpenAI, ומתלבטת אם מדובר בפיטורים או במהלך מרצון.",
      "הדיון מדגיש את המורכבות של ניהול תפקידים בעלי אחריות גבוהה ואת הניואנסים של נרטיבים ציבוריים סביב שינויי קריירה בפרופיל גבוה בהייטק ובהון סיכון."
    ],
    "points": 520,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1717060765
  },
  {
    "id": 40520334,
    "title": "כיצד שחקנים משתמשים בהבנה עמוקה כדי לשנן שורות",
    "originLink": "https://thereader.mitpress.mit.edu/how-actors-remember-their-lines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40520334",
    "commentBody": "",
    "originSummary": [
      "השחקנים זוכרים את השורות שלהם באמצעות חזרה מורכבת, הכוללת הבנת משמעות החומר ושיווכו למניעים ולרגשות של דמותם.",
      "הפסיכולוגים הלגה וטוני נויס גילו ששחקנים מאמצים את נקודת המבט של הדמות שלהם ומנתחים לעומק את התסריט כדי להיזכר בשורות באופן טבעי.",
      "שיטה זו, שהודגמה על ידי שחקנים כמו מייקל קיין וג'ון בייסינגר, מדגישה עיבוד עמוק ואסוציאציות משמעותיות, שיפור שימור הזיכרון וישמה למצבים יומיומיים."
    ],
    "commentSummary": [
      "שחקנים משתמשים בטכניקות כמו טכניקת מייזנר כדי לטפח אינטראקציה אמיתית ואותנטיות רגשית, תוך התמקדות בתגובות בזמן אמת ולא בשינון.",
      "הדיון מנגיד בין פעולה רגשית פנימית לבין השלכה חיצונית, מדמה את האחרונה לבלתי צפויה של הבינה המלאכותית, ומדגיש נושאים מתוך \"היא\" על מגבלות התקשורת של הבינה המלאכותית.",
      "דוברים ושחקנים אפקטיביים משלבים הבנה עמוקה של חומר עם פרסונות מרתקות, בעוד מהנדסים מצטיינים בתקשורת מאולתרת בשל הבנתם העמוקה."
    ],
    "points": 417,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1717046506
  },
  {
    "id": 40519722,
    "title": "FrankenPHP: שרת PHP מודרני עם תכונות Go, Caddy ו-Cloud-native",
    "originLink": "https://frankenphp.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40519722",
    "commentBody": "",
    "originSummary": [
      "FrankenPHP הוא שרת יישומי PHP מודרני שנכתב בגו, המשלב את מנהל ה-PHP הרשמי עם שרת האינטרנט Caddy, ותומך ב-HTTP/1.1, HTTP/2, HTTP/3 ואישורי HTTPS אוטומטיים.",
      "התכונות העיקריות כוללות מצב עובד לביצועים משופרים, תאימות עם מסגרות PHP פופולריות, תמיכה בפורמטי דחיסה מודרניים, מדדי Prometheus מובנים, רישום מובנה וטיפול באירועים בזמן אמת באמצעות רכזת Mercure.",
      "FrankenPHP מיועד לסביבות מקוריות בענן, וקל לפריסה כתמונת Docker או כקובץ בינארי עצמאי, בהובלת Kévin Dunglas, עם עיצוב של Laury Sorriaux ובחסות Les-Tilleuls.coop."
    ],
    "commentSummary": [
      "FrankenPHP הוא שרת יישומי PHP מודרני המשלב PHP בתוך שרת Go, מפשט את הפריסה לבינארי יחיד, ופונה למפתחים בזכות העיצוב הידידותי למשתמש שלו.",
      "הדיון מדגיש את היתרונות והחסרונות של PHP ו- Go לפיתוח אתרים, כאשר PHP ידוע בקלות השימוש ובתכונות המובנות, בעוד Go זוכה לשבחים על מדרגיות, אבטחה וטיפול בשגיאות.",
      "למרות הפוטנציאל שלה, FrankenPHP מתמודדת עם ביקורת על תהליך הבנייה המורכב שלה, בעיות ביצועים, והיעדר תמיכה במצב העובד, מה שמצביע על צורך בחידוד נוסף ותיעוד טוב יותר."
    ],
    "points": 389,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1717038632
  },
  {
    "id": 40522844,
    "title": "ממשק המשתמש החדש של ChatGPT משפר את חקר מחילות הארנב עם פריסת אריחים ובקשות להיפר-קישורים",
    "originLink": "https://delve.a9.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522844",
    "commentBody": "",
    "originSummary": [
      "הממשק ממיר את תהליך חור הארנב לפריסת אריחים, ומאפשר למשתמשים לחקור נושאים באמצעות בקשות היפר-קישור שנוצרו.",
      "התכונות הקרובות יכללו הפעלות, יכולות שיתוף, ניווט משופר, פונקציונליות הדגשה ל-delve ושילוב תמונות.",
      "המפתחים מחפשים משוב על מקרי שימוש נוספים ורעיונות לשיפור נוסף."
    ],
    "commentSummary": [
      "Maxkrieger הציגה ממשק ChatGPT חדש ב-a9.io, הכולל פריסת אריחים המשפרת את חקר הנושא באמצעות הנחיות היפר-קישור שנוצרו על ידי המודל.",
      "העיצוב נועד לשפר את חוויית המשתמש של מודלי שפה גדולים (LLM) על ידי מניעת פתיחה מחדש של נושאים שכבר נחקרו והוא דומה לניווט בוויקיפדיה.",
      "המשתמשים משבחים את הממשק הנקי, המהיר והמרתק, ומציעים שיפורים כמו נראות קישורים טובה יותר, ניהול הפעלות, פריסת עץ לניווט, הדגשת מילים ידנית ובד ציור הניתן להגדלה, עם יישומים חינוכיים פוטנציאליים שצוינו."
    ],
    "points": 356,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1717071755
  },
  {
    "id": 40521963,
    "title": "מכתב האהבה שלא נפתח של ריצ'רד פיינמן לאשתו המנוחה נחשף לאחר מותו",
    "originLink": "https://lettersofnote.com/2012/02/15/i-love-my-wife-my-wife-is-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521963",
    "commentBody": "",
    "originSummary": [
      "ריצ'רד פיינמן, פיזיקאי ידוע, כתב מכתב אהבה מרגש לאשתו המנוחה, ארלין, 16 חודשים לאחר מותה בשנת 1945.",
      "המכתב, שלא נפתח עד לאחר מותו של פיינמן ב-1988, מבטא את אהבתו וצערו המתמשכים.",
      "מכתב נוקב זה מופיע בספר \"מכתבי פתק\"."
    ],
    "commentSummary": [
      "גולש בפורום משתף במסע בן עשור של התמודדות עם מות אשתו, ומהרהר בהפקרות של ריצ'רד פיינמן כמנגנון התמודדות ובאיזון בין קריירה למשפחה.",
      "הדיון מתעמק במורכבות הרגשית והמוסרית של חיפוש קשרים חדשים לאחר מות בן הזוג, תוך שימת דגש על הסכמה מדעת ועל חוסר התחליף של קשרים עמוקים וארוכי טווח.",
      "פוסט של Hacker News חוזר למכתבו של פיינמן לאשתו המנוחה, ומעורר דיונים על אהבה, אובדן, האתיקה של פרסום כתבים פרטיים, ונושאים רחבים יותר של תפקיד המוות באבולוציה חברתית ובצמיחה אישית."
    ],
    "points": 282,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1717063567
  },
  {
    "id": 40525064,
    "title": "הימנעו מהפשטות מוקדמות: חשיבה מחודשת על עקרון ה-DRY בקידוד",
    "originLink": "https://testing.googleblog.com/2024/05/dont-dry-your-code-prematurely.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525064",
    "commentBody": "",
    "originSummary": [
      "דן מקסימוביץ' מייעץ נגד יישום מוקדם מדי של עקרון \"אל תחזור על עצמך\" (DRY) בקידוד, מכיוון שהוא עלול להוביל להפשטות מוקדמות מדי ולסבך שינויים עתידיים.",
      "הוא מציע לסבול שכפול קוד מסוים בתחילה כדי לשמור על לוגיקה ברורה יותר, ספציפית להקשר ולאפשר שינויים עתידיים קלים יותר.",
      "גישתו של מקסימוביץ' עולה בקנה אחד עם עקרון \"אתה לא תזדקק לזה\" (YAGNI), הממליץ להימנע מהוספת פונקציונליות מיותרת עד שהיא באמת נחוצה."
    ],
    "commentSummary": [
      "הדיון מדגיש את הצורך לאזן בין קריאות הקוד ולכידותו לבין עקרון \"אל תחזור על עצמך\" (DRY) בפיתוח תוכנה.",
      "התורמים מסכימים כי בעוד DRY משפר את הלכידות, הוא יכול לסבך את איתור הבאגים עקב הפשטות מקוננות, ותומך במתן עדיפות לקריאות ותחזוקה.",
      "השיחה מדגישה את החשיבות של קבלת החלטות מודעת הקשר ופשרות בהנדסה, תוך שימת דגש על דוגמאות מעשיות ותובנות היסטוריות על ניהול חוב טכני ואופטימיזציה של תחומי ביצוע קריטיים."
    ],
    "points": 231,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1717083954
  },
  {
    "id": 40515957,
    "title": "מנגנוני קשב חדשים עולים על הקשב הרב-ראשי הסטנדרטי ביעילות ובביצועים",
    "originLink": "https://arxiv.org/abs/2403.01643",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40515957",
    "commentBody": "",
    "originSummary": [
      "המאמר \"אתה צריך לשים לב טוב יותר\" מאת מהראן חוסייני ופיימן חוסייני מציג שלושה מנגנוני קשב חדשים: תשומת לב אופטימלית, תשומת לב יעילה ותשומת לב על.",
      "תשומת לב אופטימלית מפחיתה פרמטרים ב-25% ודורשת כפל מטריצה אחד פחות לכל ראש, בעוד שתשומת לב יעילה מפחיתה בחצי את הפרמטרים ומפחיתה את כפל המטריצה בשניים לכל ראש, מה שמכפיל את המהירות.",
      "Super Attention עולה באופן משמעותי על ביצועי תשומת הלב הסטנדרטית במשימות ראייה ועיבוד שפה טבעית, המוערכות על מערכי נתונים כמו MNIST, CIFAR100, IMDB Movie Reviews ו-Amazon Reviews."
    ],
    "commentSummary": [
      "מחקר שנערך לאחרונה מציג מנגנוני קשב חדשים כמו תשומת לב אופטימלית, תשומת לב יעילה, תשומת לב סופר ותשומת לב אינפיני, אשר עולים בביצועיהם על תשומת לב רב-ראשית סטנדרטית ביעילות ובביצועים.",
      "התמרת פורייה בדידה דו-ממדית (DFT) נחקרת כתחליף פוטנציאלי למנגנוני קשב, כאשר דיונים על שילובה ברשתות עצביות ושיפור יעילות צוינו במאמר FNet.",
      "השיחה מדגישה את המורכבות של מערכות בינה מלאכותית, את ההשפעה הסביבתית של מודלים גדולים ואת שנאת הסיכון של התעשייה, ומדגישה את הצורך בניסויים נוספים ותיקוף של טכניקות חדשות."
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1717011192
  },
  {
    "id": 40518016,
    "title": "גוגל מאשרת את האותנטיות של 2,500 מסמכי חיפוש שדלפו",
    "originLink": "https://www.theverge.com/2024/5/29/24167407/google-search-algorithm-documents-leak-confirmation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40518016",
    "commentBody": "",
    "originSummary": [
      "גוגל אישרה את האותנטיות של 2,500 מסמכים פנימיים שדלפו המפרטים את הנתונים שהיא אוספת, שחלקם עשויים להשפיע על אלגוריתם דירוג החיפוש שלה.",
      "מומחי ה-SEO רנד פישקין ומייק קינג ניתחו את המסמכים, סיפקו הצצה נדירה לפעולות החיפוש של גוגל, אך השאירו שאלות רבות ללא מענה לגבי השימוש בנתונים ושקלולם.",
      "הדליפה צפויה להשפיע על תעשיות ה-SEO, השיווק והפרסום, הנשענות במידה רבה על הבנת מנגנוני החיפוש של גוגל, אם כי דובר גוגל הזהיר מפני הסקת מסקנות ממידע שעלול להיות מיושן או חלקי."
    ],
    "commentSummary": [
      "גוגל אישרה את האותנטיות של מסמכי חיפוש פנימיים שדלפו, מה שהעלה חששות לגבי מניפולציה של SEO (אופטימיזציה למנועי חיפוש) המחמירה את תוצאות החיפוש.",
      "ההדלפה אימתה את החשדות לגבי השימוש של גוגל בקליקים ובנתוני כרום לצורך דירוגים, בניגוד להכחשות קודמות, והשפיעה על תביעות מתמשכות והדגישה נושאים כמו דומיננטיות של מודעות ואתגרים לבעלי אתרים קטנים יותר.",
      "הדיונים כוללים את האבולוציה של SEO, הפוטנציאל של מערכות מבוססות בינה מלאכותית כמו ChatGPT להחליף את מנועי החיפוש המסורתיים, והצעות לדירוגים אקראיים באתר כדי למנוע מניפולציה, אם כי חששות לגבי מסחור והטיה נמשכים."
    ],
    "points": 222,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717023058
  },
  {
    "id": 40525130,
    "title": "מתקפת סייבר מסיבית משביתה 600,000 נתבי SOHO, דורשת החלפת חומרה",
    "originLink": "https://blog.lumen.com/the-pumpkin-eclipse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525130",
    "commentBody": "",
    "originSummary": [
      "מעבדות הלוטוס השחור של לומן טכנולוגיות דיווחו על מתקפת סייבר בין התאריכים 25-27 באוקטובר 2023, שהשביתה מעל 600,000 נתבי SOHO (משרד קטן/משרד ביתי) ברשת של ספק אינטרנט יחיד, מה שהצריך החלפת חומרה.",
      "המתקפה, שיוחסה לנוזקת Chalubo RAT (סוס טרויאני לגישה מרחוק), ניצלה אישורים חלשים או ממשקים חשופים, וגרמה לשיבושים משמעותיים בשירות, במיוחד באזורים כפריים.",
      "Black Lotus Labs מייעצת לאבטח נתבים עם סיסמאות חזקות ועדכונים שוטפים; פרטים נוספים ואינדיקטורים לפשרה (IoCs) זמינים בדף GitHub שלהם."
    ],
    "commentSummary": [
      "הדיונים מתמקדים בניהול עדכוני קושחה ואחסון עבור מכשירים המחוברים לאינטרנט, איזון תיקוני אבטחה עם מניעת עדכונים לא רצויים.",
      "בעיות עיקריות כוללות את השימוש באחסון שאינו ניתן לשינוי לצורך שחזור מערכת, מורכבויות של התקנים הנשלטים על-ידי ספק שירותי האינטרנט והחשיבות של תוכניות אתחול מאובטחות.",
      "תקריות ספציפיות, כמו הדלת האחורית של 600,000 נתבים וההפסקות הנרחבות של Windstream, מדגישות את הצורך במנגנוני עדכון אמינים ונהלי אבטחה חזקים."
    ],
    "points": 218,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1717084349
  },
  {
    "id": 40522241,
    "title": "PyPy מוכיח את עצמו כאמין ויעיל עבור תוכנות Python בשרתי אובונטו",
    "originLink": "https://utcc.utoronto.ca/~cks/space/blog/python/PyPyQuietlyWorking",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522241",
    "commentBody": "",
    "originSummary": [
      "כריס סיבנמן מדווח על חוויה חיובית בשימוש ב-PyPy כתחליף ל-CPython בשרתי אובונטו, המותקנים באמצעות pipx.",
      "PyPy מתפקדת בצורה חלקה כבר שנים, אפילו עם חבילות מורכבות, כולל כלי CLI של ספק ענן עדכני.",
      "הניסיון של Siebenmann מדגיש את היעילות והאמינות של PyPy כחלופה מהירה יותר ל-CPython."
    ],
    "commentSummary": [
      "הדיון מבהיר את הבלבול בין PyPy (מתורגמן Python) לבין PyPI (Python Package Index), ומסביר בהומור את המונח \"גלגל\" באריזות Python.",
      "משתמשים משתפים חוויות עם PyPy, מדגישים את היתרונות והמגבלות שלה, במיוחד עם חבילות C/Fortran ושימוש בזיכרון, ומשווים אותה ל-CPython.",
      "השיחה עוסקת גם בשילוב של פייתון עם שפות אחרות למחשוב מדעי, אתגרים של אוסף Just-In-Time (JIT), וההשפעה של חברות טכנולוגיה גדולות על הפיתוח של Python, כולל פרויקטים כמו NoGIL ו- Faster CPython."
    ],
    "points": 180,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1717066360
  },
  {
    "id": 40516532,
    "title": "הסבלנות האסטרטגית וההנדסה של Waymo מניעים אותה למנהיגות Robo-Taxi",
    "originLink": "https://fortune.com/2024/05/29/waymo-self-driving-robo-taxi-uber-tesla-alphabet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516532",
    "commentBody": "",
    "originSummary": [
      "Waymo, בתחילה \"פרויקט הרכב האוטונומי של גוגל\", הפכה למובילה בתעשיית הרכב האוטונומי, ומציעה שירותי שיתוף נסיעות אוטונומיות לחלוטין בפיניקס, סן פרנסיסקו וחלקים מלוס אנג'לס.",
      "בניגוד למתחרות כמו אובר וקרוז של ג'נרל מוטורס, שהתמודדו עם מכשולים ובעיות בטיחות, וויימו התקדמה בהתמדה בזכות גישת ההתרחבות הזהירה שלה, ההנדסה החזקה והגב הפיננסי של אלפבית.",
      "צי רכבי השטח החשמליים I-Pace של Waymo, המצוידים בחיישנים מתקדמים, נמנע במידה רבה מתאונות קשות, אך החברה עומדת כעת בפני ביקורת רגולטורית ותחרות מצד שחקניות מתפתחות כמו טסלה."
    ],
    "commentSummary": [
      "הגישה הקפדנית של וויימו לנהיגה אוטונומית הובילה לעסקי רובו-טקסי מצליחים, מה שמבדיל אותה ממתחרות כמו טסלה ואובר, שמתמודדות עם ביקורת על שיטות פחות מחמירות.",
      "מערכת רמה 4 של Waymo זוכה לשבחים על הבטיחות והאמינות שלה, במיוחד בתנאים ספציפיים, בעוד שטכנולוגיית הנהיגה העצמית המלאה (FSD) של טסלה זוכה לביקורת על חוסר האמינות והשגיאות התכופות שלה.",
      "הדיונים מדגישים את האתגרים של תנאי נהיגה בלתי צפויים, את הוויכוח בין שימוש במצלמות לעומת LIDAR, ואת ההשפעות הכלכליות והתרבותיות הפוטנציאליות של כלי רכב אוטונומיים."
    ],
    "points": 176,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1717013996
  },
  {
    "id": 40516983,
    "title": "בית החולים לעטים בן 77 של קולקטה מחייה עטים נובעים יקרים",
    "originLink": "https://www.vogue.in/content/pen-hospital-in-kolkata-will-nurse-your-broken-fountain-pen-back-to-health",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516983",
    "commentBody": "",
    "originSummary": [
      "בית החולים עטים בקולקטה, חנות בת 77, מתמחה בתיקון ותחזוקה של עטים נובעים, ומושך חובבי עטים הרואים בעטים שלהם ירושה יקרה.",
      "כיום, החנות מנוהלת על ידי מוחמד אימתיאז, נכדו של המייסד, ומשגשגת למרות העידן הדיגיטלי ומכשירי כתיבה זולים יותר הודות לקהל הלקוחות המסור שלה.",
      "Imtiaz לא רק מתקן עטים אלא גם מחנך את הלקוחות על טיפול נכון בעט, כאשר החנות רואה יותר מבקרים במהלך עונות הבחינות ואירועים מיוחדים."
    ],
    "commentSummary": [
      "כתבה על \"בית החולים לעטים\" בקולקטה, המתקן עטים נובעים, יזמה דיון בחדשות האקר על תחזוקת עטים ודיוק בטרמינולוגיה.",
      "הנושאים כללו ייבוש דיו, שיטות ניקוי, הבדלים בין עיצובי עטים מודרניים וישנים יותר וההשפעה הסביבתית של פריטים חד פעמיים.",
      "משתמשים שיתפו העדפות אישיות, טיפים, משאבים לתחזוקת עטים ואנקדוטות על איסוף עטים ותחביבי נישה."
    ],
    "points": 174,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1717016496
  }
]
