[
  {
    "id": 40521518,
    "title": "Mengapa Saya Meninggalkan GraphQL Setelah Enam Tahun",
    "originLink": "https://bessey.dev/blog/2024/05/24/why-im-over-graphql/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521518",
    "commentBody": "",
    "originSummary": [
      "Penulis berbagi pengalaman selama enam tahun dengan GraphQL, awalnya mencatat keunggulannya dibandingkan API REST JSON yang tidak diketik, tetapi pada akhirnya menunjukkan kelemahan yang signifikan.",
      "Masalah utama dengan GraphQL termasuk peningkatan permukaan serangan, otorisasi yang kompleks, tantangan pembatasan kecepatan, kerentanan penguraian kueri, dan masalah kinerja seperti masalah N+1.",
      "Penulis merekomendasikan untuk mempertimbangkan alternatif seperti JSON REST API yang sesuai dengan OpenAPI dan alat modern seperti FastAPI, tsoa, dan TypeSpec untuk pengembangan API yang lebih efisien dan aman."
    ],
    "commentSummary": [
      "Setelah enam tahun menggunakan GraphQL, penulis merasa GraphQL terlalu rumit, terutama dalam hal perizinan, kinerja, dan debugging, sehingga menyarankan endpoint REST tradisional mungkin lebih efisien.",
      "Diskusi ini menyoroti tantangan dalam mengintegrasikan GraphQL dengan sistem backend, menekankan perlunya pengetahuan dan dokumentasi yang mendetail, dan mengusulkan solusi seperti pembuat kueri sisi server dan desain yang mengutamakan skema.",
      "Perdebatan ini membandingkan fleksibilitas GraphQL dan kueri bersarang yang efisien dengan kesederhanaan dan keandalan REST, dengan catatan bahwa pilihan di antara keduanya harus didasarkan pada kebutuhan dan kematangan proyek yang spesifik."
    ],
    "points": 647,
    "commentCount": 453,
    "retryCount": 0,
    "time": 1717059030
  },
  {
    "id": 40521657,
    "title": "Paul Graham Membantah Rumor Pemecatan Sam dari Y Combinator",
    "originLink": "https://twitter.com/paulg/status/1796107666265108940",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521657",
    "commentBody": "",
    "originSummary": [
      "Paul Graham, salah satu pendiri Y Combinator (YC), mengklarifikasi melalui Twitter bahwa Sam Altman tidak dipecat oleh YC, untuk menjawab dan menepis rumor yang beredar.",
      "Pernyataan ini bertujuan untuk menghilangkan informasi yang salah dan memberikan kejelasan mengenai kepergian Sam Altman dari YC."
    ],
    "commentSummary": [
      "Sebuah diskusi Hacker News, yang dipicu oleh tweet Paul Graham, menyanggah mitos tentang kepemimpinan nirlaba, dengan menekankan pada tantangan dan kelelahan dalam peran yang tidak dibayar.",
      "Percakapan ini membahas peran Mitchell Baker di Mozilla dan kepergian Sam Altman dari Y Combinator untuk fokus pada OpenAI, memperdebatkan apakah ini adalah pemecatan atau perpindahan sukarela.",
      "Diskusi ini menyoroti kompleksitas dalam mengelola peran dengan tanggung jawab tinggi dan nuansa narasi publik seputar perubahan karier tingkat tinggi di bidang teknologi dan modal ventura."
    ],
    "points": 520,
    "commentCount": 428,
    "retryCount": 0,
    "time": 1717060765
  },
  {
    "id": 40520334,
    "title": "Bagaimana Aktor Menggunakan Pemahaman Mendalam untuk Menghafal Dialog",
    "originLink": "https://thereader.mitpress.mit.edu/how-actors-remember-their-lines/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40520334",
    "commentBody": "",
    "originSummary": [
      "Para aktor mengingat dialog mereka melalui latihan elaboratif, yang melibatkan pemahaman makna materi dan mengaitkannya dengan motivasi dan emosi karakter mereka.",
      "Psikolog Helga dan Tony Noice menemukan bahwa para aktor mengadopsi sudut pandang karakter mereka dan menganalisis naskah secara mendalam untuk mengingat dialog secara alami.",
      "Metode ini, yang dicontohkan oleh aktor seperti Michael Caine dan John Basinger, menekankan pada pemrosesan yang mendalam dan asosiasi yang bermakna, meningkatkan retensi memori dan dapat diterapkan pada situasi sehari-hari."
    ],
    "commentSummary": [
      "Para aktor menggunakan teknik seperti Teknik Meisner untuk mendorong interaksi yang tulus dan keaslian emosional, dengan fokus pada respons waktu nyata, bukan hafalan.",
      "Diskusi ini mengontraskan tindakan emosional internal dengan proyeksi eksternal, mengibaratkan yang terakhir sebagai ketidakpastian AI, dan menyoroti tema-tema dari \"Her\" tentang batasan komunikasi AI.",
      "Pembicara dan aktor yang efektif menggabungkan pemahaman yang mendalam tentang materi dengan kepribadian yang menarik, sementara para insinyur unggul dalam komunikasi dadakan karena pemahaman mereka yang mendalam."
    ],
    "points": 417,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1717046506
  },
  {
    "id": 40519722,
    "title": "FrankenPHP: Server PHP Modern dengan Fitur Go, Caddy, dan Cloud-Native",
    "originLink": "https://frankenphp.dev/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40519722",
    "commentBody": "",
    "originSummary": [
      "FrankenPHP adalah server aplikasi PHP modern yang ditulis dalam bahasa Go, mengintegrasikan eksekutor PHP resmi dengan server web Caddy, dan mendukung HTTP/1.1, HTTP/2, HTTP/3, dan sertifikat HTTPS otomatis.",
      "Fitur utama termasuk mode pekerja untuk meningkatkan kinerja, kompatibilitas dengan kerangka kerja PHP yang populer, dukungan untuk format kompresi modern, metrik Prometheus internal, pencatatan terstruktur, dan penanganan peristiwa waktu nyata melalui hub Mercure.",
      "Dirancang untuk lingkungan cloud-native, FrankenPHP mudah digunakan sebagai citra Docker atau biner mandiri, dipimpin oleh Kévin Dunglas, dengan desain oleh Laury Sorriaux dan disponsori oleh Les-Tilleuls.coop."
    ],
    "commentSummary": [
      "FrankenPHP adalah server aplikasi PHP modern yang mengintegrasikan PHP dalam server Go, menyederhanakan penyebaran ke dalam satu biner, menarik bagi para pengembang karena desainnya yang ramah pengguna.",
      "Diskusi ini menyoroti pro dan kontra PHP dan Go untuk pengembangan web, dengan PHP yang dikenal dengan kemudahan penggunaan dan fitur bawaannya, sementara Go dipuji karena skalabilitas, keamanan, dan penanganan kesalahan.",
      "Terlepas dari potensinya, FrankenPHP menghadapi kritik karena proses pembuatannya yang kompleks, masalah kinerja, dan kurangnya dukungan mode pekerja, yang mengindikasikan perlunya perbaikan lebih lanjut dan dokumentasi yang lebih baik."
    ],
    "points": 389,
    "commentCount": 180,
    "retryCount": 0,
    "time": 1717038632
  },
  {
    "id": 40522844,
    "title": "UI ChatGPT Baru Meningkatkan Eksplorasi Lubang Kelinci dengan Tata Letak Ubin dan Petunjuk Hyperlink",
    "originLink": "https://delve.a9.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522844",
    "commentBody": "",
    "originSummary": [
      "Antarmuka mengubah proses rabbit-holing menjadi tata letak ubin, sehingga pengguna dapat menjelajahi topik melalui petunjuk hyperlink yang dihasilkan.",
      "Fitur-fitur yang akan datang akan mencakup sesi, kemampuan berbagi, navigasi yang disempurnakan, fungsionalitas sorot-ke-dua belas, dan integrasi gambar.",
      "Para pengembang sedang mencari umpan balik tentang kasus penggunaan tambahan dan ide-ide untuk perbaikan lebih lanjut."
    ],
    "commentSummary": [
      "Maxkrieger memperkenalkan antarmuka ChatGPT baru di a9.io, menampilkan tata letak ubin yang meningkatkan eksplorasi topik melalui petunjuk hyperlink yang dihasilkan oleh model.",
      "Desain ini bertujuan untuk meningkatkan pengalaman pengguna model bahasa besar (LLM) dengan mencegah pembukaan kembali topik yang telah dijelajahi dan disamakan dengan menavigasi Wikipedia.",
      "Para pengguna memuji antarmuka yang bersih, cepat, dan menarik, menyarankan peningkatan seperti visibilitas tautan yang lebih baik, manajemen sesi, tata letak pohon untuk navigasi, penyorotan kata secara manual, dan kanvas yang dapat diperbesar, dengan aplikasi pendidikan yang potensial."
    ],
    "points": 356,
    "commentCount": 87,
    "retryCount": 0,
    "time": 1717071755
  },
  {
    "id": 40521963,
    "title": "Surat Cinta Richard Feynman yang Belum Dibuka untuk Mendiang Istrinya Terungkap Setelah Kematiannya",
    "originLink": "https://lettersofnote.com/2012/02/15/i-love-my-wife-my-wife-is-dead/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40521963",
    "commentBody": "",
    "originSummary": [
      "Richard Feynman, seorang fisikawan ternama, menulis surat cinta yang tulus kepada mendiang istrinya, Arline, 16 bulan setelah kematiannya pada tahun 1945.",
      "Surat tersebut, yang tetap tidak dibuka hingga setelah kematian Feynman pada tahun 1988, mengekspresikan cinta dan kesedihannya yang abadi.",
      "Surat yang menyentuh ini ditampilkan dalam buku \"Letters of Note.\""
    ],
    "commentSummary": [
      "Seorang pengguna forum berbagi perjalanan selama satu dekade dalam menghadapi kematian istrinya, merefleksikan pergaulan bebas Richard Feynman sebagai mekanisme penanggulangan dan keseimbangan antara karier dan keluarga.",
      "Diskusi ini menggali kompleksitas emosional dan moral dalam mencari hubungan baru setelah kematian pasangan, dengan menekankan pada persetujuan yang diinformasikan dan tak tergantikannya hubungan jangka panjang yang mendalam.",
      "Sebuah tulisan di Hacker News membahas kembali surat Feynman kepada mendiang istrinya, yang memicu perdebatan tentang cinta, kehilangan, etika penerbitan tulisan pribadi, dan tema-tema yang lebih luas mengenai peran kematian dalam evolusi masyarakat dan pertumbuhan pribadi."
    ],
    "points": 282,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1717063567
  },
  {
    "id": 40525064,
    "title": "Hindari Abstraksi Prematur: Memikirkan Kembali Prinsip DRY dalam Pengkodean",
    "originLink": "https://testing.googleblog.com/2024/05/dont-dry-your-code-prematurely.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525064",
    "commentBody": "",
    "originSummary": [
      "Dan Maksimovich menyarankan agar tidak terlalu dini menerapkan prinsip \"Don't Repeat Yourself\" (DRY) dalam pengkodean, karena hal ini dapat menyebabkan abstraksi dini dan mempersulit perubahan di masa depan.",
      "Dia menyarankan untuk menoleransi beberapa duplikasi kode pada awalnya untuk mempertahankan logika yang lebih jelas dan sesuai dengan konteks dan memfasilitasi modifikasi yang lebih mudah di masa depan.",
      "Pendekatan Maksimovich selaras dengan prinsip \"You Aren't Gonna Need It\" (YAGNI), yang merekomendasikan untuk menghindari penambahan fungsionalitas yang tidak perlu sampai benar-benar dibutuhkan."
    ],
    "commentSummary": [
      "Diskusi ini menyoroti perlunya menyeimbangkan keterbacaan dan keterpaduan kode dengan prinsip \"Don't Repeat Yourself\" (DRY) dalam pengembangan perangkat lunak.",
      "Para kontributor setuju bahwa meskipun DRY meningkatkan kohesi, DRY dapat mempersulit debugging karena abstraksi yang bersarang, dan menganjurkan untuk memprioritaskan keterbacaan dan pemeliharaan.",
      "Percakapan ini menggarisbawahi pentingnya pengambilan keputusan yang sadar konteks dan trade-off dalam bidang teknik, dengan menekankan contoh praktis dan wawasan historis dalam mengelola utang teknis dan mengoptimalkan area kinerja yang kritis."
    ],
    "points": 231,
    "commentCount": 153,
    "retryCount": 0,
    "time": 1717083954
  },
  {
    "id": 40515957,
    "title": "Mekanisme Perhatian Baru Melampaui Perhatian Multi-Kepala Standar dalam Efisiensi dan Kinerja",
    "originLink": "https://arxiv.org/abs/2403.01643",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40515957",
    "commentBody": "",
    "originSummary": [
      "Makalah \"Anda Perlu Memperhatikan dengan Lebih Baik\" oleh Mehran Hosseini dan Peyman Hosseini memperkenalkan tiga mekanisme perhatian yang baru: Perhatian yang Dioptimalkan, Perhatian yang Efisien, dan Perhatian Super.",
      "Perhatian yang Dioptimalkan mengurangi parameter sebesar 25% dan membutuhkan satu perkalian matriks lebih sedikit per kepala, sedangkan Perhatian yang Efisien mengurangi separuh parameter dan mengurangi perkalian matriks sebanyak dua kali lipat per kepala, menggandakan kecepatan.",
      "Super Attention secara signifikan mengungguli perhatian standar dalam tugas-tugas penglihatan dan pemrosesan bahasa alami, yang dievaluasi pada kumpulan data seperti MNIST, CIFAR100, Ulasan Film IMDB, dan Ulasan Amazon."
    ],
    "commentSummary": [
      "Penelitian terbaru memperkenalkan mekanisme perhatian baru seperti Perhatian yang Dioptimalkan, Perhatian yang Efisien, Perhatian Super, dan Perhatian Infini, yang mengungguli perhatian multi-kepala standar dalam hal efisiensi dan kinerja.",
      "Discrete Fourier Transform (DFT) 2D sedang dieksplorasi sebagai pengganti potensial untuk mekanisme perhatian, dengan diskusi tentang integrasinya dalam jaringan saraf dan peningkatan efisiensi yang dicatat dalam makalah FNet.",
      "Percakapan tersebut menyoroti kompleksitas sistem AI, dampak lingkungan dari model-model besar, dan keengganan industri untuk mengambil risiko, yang menekankan perlunya lebih banyak eksperimen dan validasi teknik-teknik baru."
    ],
    "points": 229,
    "commentCount": 44,
    "retryCount": 0,
    "time": 1717011192
  },
  {
    "id": 40518016,
    "title": "Google Mengonfirmasi Keaslian 2.500 Dokumen Pencarian yang Bocor",
    "originLink": "https://www.theverge.com/2024/5/29/24167407/google-search-algorithm-documents-leak-confirmation",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40518016",
    "commentBody": "",
    "originSummary": [
      "Google telah mengonfirmasi keaslian 2.500 dokumen internal yang bocor yang merinci data yang dikumpulkannya, beberapa di antaranya dapat memengaruhi algoritme peringkat penelusurannya.",
      "Pakar SEO Rand Fishkin dan Mike King menganalisis dokumen-dokumen tersebut, menawarkan pandangan sekilas yang langka ke dalam operasi pencarian Google, tetapi meninggalkan banyak pertanyaan yang belum terjawab tentang penggunaan dan pembobotan data.",
      "Kebocoran ini diperkirakan akan berdampak pada industri SEO, pemasaran, dan penerbitan, yang sangat bergantung pada pemahaman mekanisme pencarian Google, meskipun juru bicara Google memperingatkan agar tidak menarik kesimpulan dari informasi yang mungkin sudah ketinggalan zaman atau tidak lengkap."
    ],
    "commentSummary": [
      "Google mengkonfirmasi keaslian dokumen Search internal yang bocor, meningkatkan kekhawatiran tentang manipulasi SEO (Search Engine Optimization) yang memperburuk hasil pencarian.",
      "Kebocoran tersebut memvalidasi kecurigaan tentang penggunaan klik dan data Chrome oleh Google untuk menentukan peringkat, yang bertentangan dengan penyangkalan sebelumnya, yang berdampak pada tuntutan hukum yang sedang berlangsung dan menyoroti isu-isu seperti dominasi iklan dan tantangan bagi penerbit yang lebih kecil.",
      "Diskusi mencakup evolusi SEO, potensi sistem berbasis AI seperti ChatGPT untuk menggantikan mesin pencari tradisional, dan saran untuk mengacak peringkat situs web untuk mencegah manipulasi, meskipun kekhawatiran tentang komersialisasi dan bias tetap ada."
    ],
    "points": 222,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1717023058
  },
  {
    "id": 40525130,
    "title": "Serangan Siber Besar-besaran Menonaktifkan 600.000 Router SOHO, Membutuhkan Penggantian Perangkat Keras",
    "originLink": "https://blog.lumen.com/the-pumpkin-eclipse/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40525130",
    "commentBody": "",
    "originSummary": [
      "Black Lotus Labs dari Lumen Technologies melaporkan adanya serangan siber pada tanggal 25-27 Oktober 2023, yang melumpuhkan lebih dari 600.000 router SOHO (Small Office/Home Office) di dalam jaringan satu ISP, yang membutuhkan penggantian perangkat keras.",
      "Serangan tersebut, yang dikaitkan dengan malware Chalubo RAT (Remote Access Trojan), mengeksploitasi kredensial yang lemah atau antarmuka yang terbuka, menyebabkan gangguan layanan yang signifikan, terutama di daerah pedesaan.",
      "Black Lotus Labs menyarankan untuk mengamankan router dengan kata sandi yang kuat dan pembaruan rutin; rincian lebih lanjut dan Indikator Kompromi (IoC) tersedia di halaman GitHub mereka."
    ],
    "commentSummary": [
      "Diskusi berfokus pada pengelolaan pembaruan firmware dan penyimpanan untuk perangkat yang terhubung ke internet, menyeimbangkan patch keamanan dengan mencegah pembaruan yang tidak diinginkan.",
      "Isu-isu utama termasuk penggunaan penyimpanan yang tidak dapat diubah untuk pemulihan sistem, kerumitan perangkat yang dikendalikan ISP, dan pentingnya skema boot yang aman.",
      "Insiden tertentu, seperti backdooring 600.000 router dan pemadaman yang meluas di Windstream, menggarisbawahi perlunya mekanisme pembaruan yang dapat diandalkan dan praktik keamanan yang kuat."
    ],
    "points": 218,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1717084349
  },
  {
    "id": 40522241,
    "title": "PyPy Terbukti Andal dan Efisien untuk Program Python di Server Ubuntu",
    "originLink": "https://utcc.utoronto.ca/~cks/space/blog/python/PyPyQuietlyWorking",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40522241",
    "commentBody": "",
    "originSummary": [
      "Chris Siebenmann melaporkan pengalaman positif menggunakan PyPy sebagai pengganti CPython di server Ubuntu, yang dipasang melalui pipx.",
      "PyPy telah berfungsi dengan lancar selama bertahun-tahun, bahkan dengan paket-paket yang rumit, termasuk alat CLI penyedia cloud terbaru.",
      "Pengalaman Siebenmann menggarisbawahi keefektifan dan keandalan PyPy sebagai alternatif yang lebih cepat untuk CPython."
    ],
    "commentSummary": [
      "Diskusi ini mengklarifikasi kebingungan antara PyPy (penerjemah Python) dan PyPI (Python Package Index), dan secara jenaka menjelaskan istilah \"roda\" dalam pengemasan Python.",
      "Para pengguna berbagi pengalaman dengan PyPy, menyoroti manfaat dan keterbatasannya, terutama dengan paket C/Fortran dan penggunaan memori, dan membandingkannya dengan CPython.",
      "Percakapan ini juga mencakup integrasi Python dengan bahasa lain untuk komputasi ilmiah, tantangan kompilasi Just-In-Time (JIT), dan pengaruh perusahaan teknologi besar terhadap perkembangan Python, termasuk proyek-proyek seperti NoGIL dan Faster CPython."
    ],
    "points": 180,
    "commentCount": 89,
    "retryCount": 0,
    "time": 1717066360
  },
  {
    "id": 40516532,
    "title": "Kesabaran dan Rekayasa Strategis Waymo Mendorongnya Menuju Kepemimpinan Taksi Robot",
    "originLink": "https://fortune.com/2024/05/29/waymo-self-driving-robo-taxi-uber-tesla-alphabet/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516532",
    "commentBody": "",
    "originSummary": [
      "Waymo, yang awalnya merupakan \"Proyek Mobil Swakemudi Google,\" telah menjadi pemimpin dalam industri kendaraan otonom, menawarkan layanan rideshare otonom sepenuhnya di Phoenix, San Francisco, dan beberapa bagian Los Angeles.",
      "Tidak seperti pesaing seperti Uber dan Cruise dari General Motors, yang menghadapi kemunduran dan masalah keamanan, Waymo telah berkembang dengan mantap karena pendekatan penskalaan yang hati-hati, teknik yang kuat, dan dukungan finansial dari Alphabet.",
      "Armada SUV listrik Jaguar I-Pace milik Waymo, yang dilengkapi dengan sensor canggih, sebagian besar telah menghindari kecelakaan besar, tetapi perusahaan ini sekarang menghadapi pengawasan regulasi dan persaingan dari pemain baru seperti Tesla."
    ],
    "commentSummary": [
      "Pendekatan Waymo yang ketat terhadap pengemudian otonom telah menghasilkan bisnis taksi robot yang sukses, yang membedakannya dari pesaing seperti Tesla dan Uber, yang menghadapi kritik karena metodenya yang kurang ketat.",
      "Sistem Level 4 Waymo dipuji karena keamanan dan keandalannya, terutama dalam kondisi tertentu, sementara teknologi Full Self-Driving (FSD) Tesla dikritik karena tidak dapat diandalkan dan sering terjadi kesalahan.",
      "Diskusi menyoroti tantangan kondisi mengemudi yang tidak dapat diprediksi, perdebatan antara penggunaan kamera versus LIDAR, dan potensi dampak ekonomi dan budaya dari kendaraan otonom."
    ],
    "points": 176,
    "commentCount": 326,
    "retryCount": 0,
    "time": 1717013996
  },
  {
    "id": 40516983,
    "title": "Rumah Sakit Pena Berusia 77 Tahun di Kolkata Menghidupkan Kembali Pena Air Mancur",
    "originLink": "https://www.vogue.in/content/pen-hospital-in-kolkata-will-nurse-your-broken-fountain-pen-back-to-health",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40516983",
    "commentBody": "",
    "originSummary": [
      "Rumah Sakit Pena di Kolkata, sebuah toko berusia 77 tahun, mengkhususkan diri dalam memperbaiki dan merawat pulpen, menarik perhatian para penggemar pena yang menganggap pena mereka sebagai pusaka yang berharga.",
      "Saat ini dijalankan oleh Muhammad Imtiaz, cucu dari sang pendiri, toko ini berkembang pesat meskipun era digital dan alat tulis yang lebih murah karena pelanggan yang berdedikasi.",
      "Imtiaz tidak hanya memperbaiki pena tetapi juga mengedukasi pelanggan tentang perawatan pena yang tepat, dengan toko yang mengalami peningkatan pengunjung selama musim ujian dan acara-acara khusus."
    ],
    "commentSummary": [
      "Sebuah artikel tentang \"Rumah Sakit Pena\" di Kolkata, yang memperbaiki pena, memulai diskusi di Hacker News tentang perawatan pena dan akurasi terminologi.",
      "Topik yang dibahas termasuk pengeringan tinta, praktik pembersihan, perbedaan antara desain pena modern dan yang lebih tua, dan dampak lingkungan dari barang sekali pakai.",
      "Para pengguna berbagi preferensi pribadi, saran, sumber daya untuk pemeliharaan pena, dan anekdot mengenai pengumpulan pena dan hobi khusus."
    ],
    "points": 174,
    "commentCount": 41,
    "retryCount": 0,
    "time": 1717016496
  }
]
