[
  {
    "id": 41012443,
    "title": "21. yüzyılda ABD'deki neredeyse her trafik ölümünü haritaladım",
    "originLink": "https://roadway.report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012443",
    "commentBody": "",
    "originSummary": [
      "Ülke Çapında Sıfır Vizyon Haritası, yollarda trafik ölümlerini ve ciddi yaralanmaları ortadan kaldırmayı amaçlayan yeni bir girişimdir.",
      "Bu harita, ülke genelindeki trafik güvenliği verilerinin kapsamlı bir özetini sunarak, yüksek riskli bölgeleri belirlemeye ve hedeflenmiş güvenlik önlemlerini uygulamaya yardımcı olur.",
      "Bu girişim, çeşitli şehirler ve ülkeler tarafından veri odaklı yaklaşımlar ve topluluk katılımı yoluyla yol güvenliğini artırmak için benimsenen daha geniş bir Sıfır Vizyon stratejisinin bir parçasıdır."
    ],
    "commentSummary": [
      "21. yüzyılda ABD'deki neredeyse her trafik ölümünü kapsayan kapsamlı bir harita oluşturuldu ve kullanıcılar, ölümcül kazaların yoğun olduğu bölgeleri belirlemek için bir ısı haritası önerdi.",
      "Tartışmalar, polis raporları ve eyalet raporlama sistemleriyle ilgili sorunlar da dahil olmak üzere, NHTSA'nın FARS veritabanındaki veri tutarsızlıklarını vurguladı.",
      "Kullanıcılar, yol tasarımının güvenlik üzerindeki etkisini tartışarak daha dar sokaklar ve trafik yatıştırma önlemleri savundular ve yol güvenliği ile trafik verimliliği arasındaki dengeyi ele aldılar."
    ],
    "points": 681,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1721431006
  },
  {
    "id": 41016768,
    "title": "Araştırmacı, a16z web sitesinde bazı şirket verilerini açığa çıkaran bir kusur buldu",
    "originLink": "https://www.kibty.town/blog/a16z/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016768",
    "commentBody": "",
    "originSummary": [
      "Bir güvenlik araştırmacısı, a16z crypto'nun alt alanında bir güvenlik açığı keşfetti ve AWS anahtarları ve veritabanı içerikleri gibi hassas bilgileri ortaya çıkardı.",
      "Ortaya çıkan kimlik bilgileri, AWS, Salesforce, Mailgun ve Kişisel Tanımlanabilir Bilgiler (PII) içeren bir veritabanına erişimi içeriyordu.",
      "Özel bir iletişim yöntemi bulamadıktan sonra kamuya açıklama yaptığı için araştırmacı hata ödülü almadı, bu durumu adaletsiz buldu."
    ],
    "commentSummary": [
      "Araştırmacı, a16z web sitesinde şirket verilerini açığa çıkaran bir güvenlik açığı tespit etti, ancak özel iletişim girişimleri başarısız olduktan sonra kamuya açıklama yapıldığı için hata ödülü almadı.",
      "Bu olay, sorumlu açıklama, şirket güvenlik uygulamaları ve ücretsiz hata avcılığının etiği konularında tartışmaları ateşledi.",
      "Eleştiriler, a16z'nin araştırmacıyı tazmin etmemesi nedeniyle yöneltildi ve bu durum, hem şirketlerin hem de güvenlik araştırmacılarının bu tür keşifleri ele alma konusundaki sorumluluklarını vurguladı."
    ],
    "points": 461,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1721485998
  },
  {
    "id": 41013004,
    "title": "Garaj: Açık Kaynak Dağıtık Nesne Depolama",
    "originLink": "https://garagehq.deuxfleurs.fr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013004",
    "commentBody": "",
    "originSummary": [
      "Garage, verileri üç bölgeye çoğaltarak yedeklilik sunan, kendi kendine barındırma için tasarlanmış açık kaynaklı bir dağıtılmış nesne depolama hizmetidir.",
      "Hafif ve verimli dağıtım, birden fazla veri merkezi arasında çok yönlülük ve ağ ve donanım arızalarına karşı dayanıklılık gibi temel özellikler içerir.",
      "Farklı donanımları destekler, uyumluluk için Amazon S3 API'sini uygular ve NGI POINTER, NLnet / NGI0 Entrust ve Avrupa Birliği'nin Horizon 2021 araştırma ve yenilik programı tarafından finanse edilir."
    ],
    "commentSummary": [
      "Garage, kullanıcıların küçük dosyalar ve replikasyon ile daha iyi performans nedeniyle Minio yerine tercih ettiği açık kaynaklı bir dağıtık nesne depolama sistemidir.",
      "Temel özellikler arasında önemli performans iyileştirmeleri, düşük bellek kullanımı ve dağıtılmış mutabakat için Çakışmasız Çoğaltılmış Veri Türleri (CRDT'ler) bulunmaktadır.",
      "Proje, AGPL lisanslıdır ve esnek, kendi kendine barındırılan bir depolama çözümü sunmayı amaçlamaktadır. Uyum özellikleri ve SeaweedFS, IPFS ve Tahoe-LAFS gibi diğer depolama sistemleriyle karşılaştırmalar hakkında devam eden tartışmalar bulunmaktadır."
    ],
    "points": 389,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1721436031
  },
  {
    "id": 41012193,
    "title": "Çoklu uydu verileri, bir kuyu patlamasından kaynaklanan rekor düzeyde metan sızıntısını gösteriyor",
    "originLink": "https://pubs.acs.org/doi/10.1021/acs.estlett.4c00399",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012193",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Çoklu uydu verileri, bir kuyu patlamasından kaynaklanan rekor düzeyde bir metan sızıntısını tespit etti ve bu durum, petrol ve gazla ilgili metan emisyonlarının endüstri tarafından önemli ölçüde eksik raporlandığını vurguladı.",
      "Metanın sera gazı potansiyeli, 100 yıl boyunca CO2'nin 20 katıdır, bu da bazı üretim yollarını iklim etkisi açısından kömürden daha kötü hale getirir.",
      "Bu olay, zayıflamış düzenleyici kurumlar ve eski altyapı tarafından daha da kötüleşen metan sızıntılarını ele almak için daha güçlü iklim politikalarına ve doğru ölçümlere duyulan ihtiyacı vurgulamaktadır."
    ],
    "points": 303,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1721428945
  },
  {
    "id": 41014941,
    "title": "Typst: LaTex için öğrenmesi kolay bir alternatif",
    "originLink": "https://github.com/typst/typst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014941",
    "commentBody": "",
    "originSummary": [
      "Typst, yerleşik işaretleme, esnek işlevler, entegre betik yazma ve hızlı derleme süreleri sunan, LaTeX kadar güçlü olacak şekilde tasarlanmış yeni ve kullanıcı dostu bir işaretleme tabanlı dizgi sistemidir.",
      "Typst derleyicisi ve CLI (Komut Satırı Arayüzü) yerel belge derlemesi için mevcuttur ve geliştirilmiş bir deneyim için şu anda herkese açık beta sürümünde olan ücretsiz bir çevrimiçi düzenleyici bulunmaktadır.",
      "Kullanıcılar, destek almak ve topluluk tarafından oluşturulan kaynaklara erişmek için Discord'da Typst topluluğuna katılabilirler. Hata bildirme veya özellik önerme fırsatları ile katkıda bulunabilirler."
    ],
    "commentSummary": [
      "Typst, PDF oluşturmak için LaTeX'e daha kolay ve daha kaynak verimli bir alternatif olarak sunulmaktadır ve kullanıcılar önemli performans iyileştirmeleri bildirmektedir.",
      "Bu araç, özellikle büyük hacimli belgeleri hızlı bir şekilde oluşturmak için LaTeX'e kıyasla kullanıcılar için daha erişilebilir hale getiren sezgisel şablonlama sistemi nedeniyle övülmektedir.",
      "Typst, akademik yazım ve düzenleyici belge oluşturma süreçlerini kolaylaştırma potansiyeli nedeniyle dikkat çekiyor, ancak şu anda HTML çıktısı ve tam TeX desteği gibi bazı özelliklerden yoksun."
    ],
    "points": 292,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1721463260
  },
  {
    "id": 41010188,
    "title": "Reklamlarla finanse edilen yapay zeka – GPT-4o mini dönüm noktası",
    "originLink": "https://batchmon.com/blog/ai-cheaper-than-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010188",
    "commentBody": "",
    "originSummary": [
      "OpenAI, GPT-4o mini modelini piyasaya sürdü. Bu modelin fiyatı, 1 milyon giriş tokeni için 0,15 dolar ve 1 milyon çıkış tokeni için 0,60 dolar olarak belirlenmiş olup, GPT-3.5 Turbo'dan daha uygun fiyatlı ve daha zekidir.",
      "GPT-4o mini'nin düşük maliyeti, tamamen reklam gelirleriyle desteklenebilecek AI tarafından üretilen içeriklerin oluşturulmasını mümkün kılarak çevrimiçi içerik oluşturmayı potansiyel olarak dönüştürebilir.",
      "Örneğin, GPT-4o mini ile bir blog yazısı oluşturmanın maliyeti $0.00051525 iken, sayfa görüntüleme başına reklam geliri yaklaşık $0.0026 olabilir ve bu da sayfa görüntüleme başına yaklaşık $0.002 net kâr ile sonuçlanır."
    ],
    "commentSummary": [
      "Bu tartışma, web içeriğinin geleceği hakkındaki endişeleri vurguluyor ve AI tarafından üretilen içeriğin yakında baskın hale gelebileceğini, bunun da AI çıktıları üzerinde AI eğitimi döngüsüne yol açabileceğini öne sürüyor.",
      "Mevcut web içeriğinin kalitesi hakkında bir tartışma var, bazıları bunun büyük bir kısmının zaten düşük kaliteli SEO (Arama Motoru Optimizasyonu) materyali olduğunu ve yapay zekanın bu sorunu daha da kötüleştirebileceğini savunuyor.",
      "Konuşma, insan ve yapay zeka tarafından üretilen metinleri ayırt etmenin zorluğuna değinerek, çevrimiçi etkileşimlerin ve içeriğin özgünlüğü ve orijinalliği hakkında sorular ortaya çıkarıyor."
    ],
    "points": 276,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1721417319
  },
  {
    "id": 41016290,
    "title": "No Uptime Hosting (2006)",
    "originLink": "https://nouptime.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016290",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "No Uptime Hosting, dosyaları disketlerde kabul etmek ve OS/2 Warp gibi eski işletim sistemlerini desteklemek gibi modası geçmiş ve pratik olmayan barındırma hizmetleri sunarak mizahi bir şekilde hizmet veren bir hiciv sitesidir.",
      "Siteye ait HTML kaynak kodu, karışık doctype deklarasyonları, ham PHP etiketleri ve eksik kapanış etiketleri gibi hatalar ve eski uygulamalarla kasıtlı olarak doldurulmuş, bu da şakaya katmanlar ekliyor.",
      "Topluluk, hizmet tekliflerinin saçmalığındaki mizahı ve kasıtlı olarak kötü tasarlanmış web sitesini buluyor, birçok yorum nostaljik ve komik unsurları vurguluyor."
    ],
    "points": 210,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1721481660
  },
  {
    "id": 41009942,
    "title": "Hiçbir Şeyi Güncelleme",
    "originLink": "https://blog.kronis.dev/articles/never-update-anything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41009942",
    "commentBody": "",
    "originSummary": [
      "Makale, sık yazılım güncellemelerine karşı tartışmalı bir görüş sunarak, bu güncellemelerin neden olduğu kesintiler ve kaynak tüketimine dikkat çekiyor.",
      "Bu, sürekli güncellemeler ihtiyacını azaltmak için Lazarus IDE ve FreeBSD'nin kararlı paketleri gibi örnekler kullanarak daha istikrarlı bir yaklaşım öneriyor.",
      "Yazar, güncellemelerin hızını yavaşlatmayı, uzun vadeli istikrara ve bakımın kolaylaştırılması ile geliştirici bilişsel yükünün azaltılması için uyumsuz olmayan değişikliklere odaklanmayı savunuyor."
    ],
    "commentSummary": [
      "İnternet öncesinde, yazılım güncellemeleri seyrek ve maliyetliydi, bu da hatalı yazılımları önemli bir sorun haline getiriyordu.",
      "İnternet, daha kolay güncellemeleri mümkün kıldı, bu da şirketlerin sık güncellemeler yapmasına ve müşterileri test edici olarak kullanmasına yol açtı, sonuç olarak daha az kararlı yazılımlar ortaya çıktı.",
      "Stabilite için uzun vadeli destek (LTS) sürümlerine öncelik vermek ile kalite pahasına sık güncellemeler yapma eğilimindeki endüstri trendi arasında bir tartışma var."
    ],
    "points": 175,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721416068
  },
  {
    "id": 41015731,
    "title": "Halka açık tuvaletler kayboluyor ve bu bir sivil felaket",
    "originLink": "https://psyche.co/ideas/public-toilets-are-vanishing-and-thats-a-civic-catastrophe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41015731",
    "commentBody": "",
    "originSummary": [
      "Halka açık tuvaletler ortadan kayboluyor, bu da özellikle sağlık sorunları olan bireyleri ve marjinal grupları etkileyen bir sivil krize yol açıyor.",
      "Guido Corradi, bir psikoloji araştırmacısı, zengin Batı ülkelerindeki umumi tuvaletlerin kötü durumunu vurgulayarak, bunların halk sağlığı ve insan onuru üzerindeki etkilerini öne çıkarıyor.",
      "Çalışmalar, yoksul, daha az eğitimli bireyler ve kadınların umumi tuvaletlerde daha olumsuz deneyimler yaşadığını, bu nedenle tesislerin iyileştirilmesi ve kamu bilinci kampanyalarının gerekliliğini vurgulamaktadır."
    ],
    "commentSummary": [
      "Kamu tuvaletlerinin ABD'de ortadan kalkması, önemli erişilebilirlik sorunlarına yol açmış ve insanları tuvalet erişimi için işletmelere güvenmeye zorlamıştır.",
      "Amerika'da Ücretli Tuvaletleri Sonlandırma Komitesi ücretli tuvaletleri yasaklamayı başarmış olsa da, bunların yerine ücretsiz halka açık tuvaletler koymak için herhangi bir önlem alınmadı.",
      "Florida gibi bazı eyaletlerde, işletmelerin halka açık tuvaletlere sahip olması gerekmektedir, ancak erişim genellikle müşterilerle sınırlıdır, bu da daha iyi bir halka açık tuvalet altyapısına duyulan ihtiyacı vurgulamaktadır."
    ],
    "points": 155,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1721475434
  },
  {
    "id": 41013159,
    "title": "Doom Playdate'de",
    "originLink": "https://devforum.play.date/t/doom-on-playdate/852",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013159",
    "commentBody": "",
    "originSummary": [
      "Erken bir Doom versiyonu, taşınabilir bir oyun konsolu olan Playdate'e başarıyla taşındı.",
      "Yazılımcı, özellikle libc'deki eksik referanslar olmak üzere makefile'lar, derleyiciler ve bağlayıcı sorunlarıyla ilgili önemli zorluklarla karşılaştı. Bu sorunlar, bağlayıcı seçeneklerini ayarlayarak ve Playdate SDK'sını değiştirerek çözüldü.",
      "Oyun artık hem simülatörde hem de gerçek donanımda çalışıyor, bu da geliştiricinin oyun kontrolü, sunumu ve optimizasyonuna odaklanmasını sağlıyor."
    ],
    "commentSummary": [
      "Playdate el konsolu Doom'u çalıştırıyor ve daha iyi görsel netlik için çeşitli tarama tekniklerini kullanarak ekranını optimize etme üzerine tartışmalar başlatıyor.",
      "Kullanıcılar, Atkinson ve sıralı ditherleme gibi farklı ditherleme yöntemlerinin avantajlarını tartışıyor ve ilham almak için Return of the Obra Dinn gibi diğer oyunlara atıfta bulunuyorlar.",
      "Playdate, hızlı yenileme hızları ve düşük güç tüketimi sunan bir Sharp Memory LCD kullanır, ancak bazı kullanıcılar daha iyi kullanılabilirlik için bir arka ışığa sahip olmasını ister."
    ],
    "points": 140,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1721437831
  },
  {
    "id": 41010458,
    "title": "Avrupa Birliği, özgür yazılımları finanse etmeye devam etmelidir",
    "originLink": "https://pad.public.cat/lettre-NCP-NGI",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010458",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Avrupa Birliği'nin, mevcut katkıların ticari çabalara kıyasla minimal olduğu göz önüne alındığında, özgür yazılım için fonları artırması teşvik edilmektedir.",
      "Yeni bir finansman modeli, NLnet'in etkisinin Google gibi büyük şirketlere kıyasla sınırlı olması nedeniyle, gelişen bir özgür yazılım ekosistemini teşvik etmek için gerekli olabilir.",
      "Bu tartışma, teknik projeler için hükümet fonlarının etkinliği ve AB'nin teknoloji endüstrisindeki konumu üzerine odaklanmaktadır."
    ],
    "points": 136,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1721419023
  },
  {
    "id": 41017077,
    "title": "KitleStrike fiyaskosu, düşmanlara Amerikan zayıflıklarının yol haritasını sunuyor",
    "originLink": "https://www.nytimes.com/2024/07/19/us/politics/crowdstrike-outage.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41017077",
    "commentBody": "",
    "originSummary": [
      "Bir yazılım güncelleme hatası, Cuma günü dijital bir çöküşe neden olarak havaalanlarını, hastaneleri ve TV istasyonlarını etkiledi ve birbirine bağlı ağların kırılganlığını gözler önüne serdi.",
      "Bu olay, bir ulus-devlet saldırısından değil, insan hatasından kaynaklanıyordu ve siber saldırıları etkisiz hale getirmeyi amaçlayan CrowdStrike yazılımını içeriyordu.",
      "Bu olay, ABD hükümeti ve özel sektörün siber güvenliği artırma çabalarına rağmen, dijital dayanıklılığın geliştirilmesi gereğini vurgulamaktadır."
    ],
    "commentSummary": [
      "KitleStrike olayı, Amerikan kritik altyapısındaki zayıflıkları ortaya çıkardı ve sık sık güvenlik yamalarına ihtiyaç duyan işletim sistemlerinin (OS) kullanımı konusunda tartışmalara yol açtı.",
      "Uzmanlar, tarihsel ve pratik nedenlerle yaygın olarak kullanılan Windows'a kıyasla daha iyi güvenlik sunduğu düşünülen Linux veya OpenBSD gibi alternatifler öneriyorlar.",
      "Bu olay, sistemlerde yerleşik güvenlik özelliklerinin gerekliliğini vurgulamakta ve ulusal güvenlik ile altyapı dayanıklılığı için daha geniş etkiler konusunda endişeleri artırmaktadır."
    ],
    "points": 128,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1721488699
  },
  {
    "id": 41014089,
    "title": "Google'ın kısaltılmış bağlantıları gelecek yıl çalışmayı durduracak",
    "originLink": "https://www.theverge.com/2024/7/19/24201734/google-url-link-shortening-service-shut-down-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014089",
    "commentBody": "",
    "originSummary": [
      "Google'ın kısaltılmış bağlantıları (goo.gl) 25 Ağustos 2025'ten sonra çalışmayı durduracak ve bu tür tüm bağlantılar için 404 hatası oluşacak.",
      "23 Ağustos 2024'ten itibaren, goo.gl bağlantıları kullanıcılara yaklaşan kapanış hakkında uyarı veren bir ara sayfa gösterecek.",
      "Google, geliştiricilere kesintileri önlemek için etkilenen bağlantıları güncellemelerini tavsiye ediyor ve goo.gl hizmetinin 2019'da kapatıldığını, Firebase Dynamic Links'e geçiş yapılmasının önerildiğini, ancak bu hizmetin de artık kullanımdan kaldırıldığını belirtiyor."
    ],
    "commentSummary": [
      "Google'ın URL kısaltma hizmeti gelecek yıl faaliyetlerini durduracak ve bu hizmete yönlendirmeler için güvenen kullanıcılar arasında hayal kırıklığına neden olacak.",
      "Eleştirmenler, Google'ın hizmetleri sonlandırma eğilimini vurgulayarak, bu kararı bakım maliyetleri ve iç politikalarına bağlamaktadır.",
      "Kullanıcılar, yönlendirmeler için AWS gibi alternatifler öneriyor ve hizmetin işlevsel kalmasını sağlamak için daha basit çözümler veya dış kaynak kullanımı öneriyor."
    ],
    "points": 120,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1721450175
  },
  {
    "id": 41011779,
    "title": "Akademisyenler, T&F'nin araştırmalarına erişimi Microsoft AI'ye satmasının ardından şokta",
    "originLink": "https://www.thebookseller.com/news/academic-authors-shocked-after-taylor--francis-sells-access-to-their-research-to-microsoft-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41011779",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Akademisyenler, Taylor & Francis'in araştırmalarına erişimi Microsoft AI'ye satmasından dolayı hayal kırıklığına uğramış durumda, kamu tarafından finanse edilen araştırmaların faydalarını en üst düzeye çıkarmak için serbestçe erişilebilir olması gerektiğini savunuyorlar.",
      "Eleştirmenler, erişim için ücret almanın engeller oluşturduğunu ve bilimsel ilerlemeyi engellediğini iddia ederek, uygun atıfın ve kredi hakkının önemini vurguluyorlar.",
      "Durum, genellikle kamu tarafından finanse edilen araştırmalardan kâr eden açık erişim ve geleneksel yayıncılık modelleri arasındaki devam eden gerilimi vurguluyor."
    ],
    "points": 111,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1721426035
  },
  {
    "id": 41013198,
    "title": "Bugünkü Kesinti Hakkında Teknik Detaylar",
    "originLink": "https://www.crowdstrike.com/blog/technical-details-on-todays-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013198",
    "commentBody": "",
    "originSummary": [
      "19 Temmuz 2024'te, CrowdStrike Windows sistemleri için bir sensör yapılandırma güncellemesi yayınladı ve bu güncelleme, yaklaşık 1,5 saat içinde düzeltilen bir mantık hatası nedeniyle sistem çökmelerine ve mavi ekranlara (BSOD) neden oldu.",
      "Bu sorun, adlandırılmış boru yürütmesini değerlendirmek için tasarlanmış sorunlu Kanal Dosyası 291 nedeniyle, 04:09 UTC ile 05:27 UTC arasında çevrimiçi olan ve Windows sürüm 7.11 ve üzeri için Falcon sensörünü kullanan müşterileri etkiledi.",
      "Sistemleri Linux veya macOS çalıştıranlar etkilenmedi ve gelecekteki sorunları önlemek için kök neden analizi devam ediyor."
    ],
    "commentSummary": [
      "Kötü biçimlendirilmiş bir yapılandırma dosyası nedeniyle CrowdStrike önemli bir kesinti yaşadı, bu da Windows sistemlerinin Mavi Ekran (BSOD) ve önyükleme döngüleri ile çökmesine neden oldu.",
      "Problem, kötü niyetli adlandırılmış boruları hedefleyen bir güncellemeden kaynaklandı ve bu, istemeden CrowdStrike'ın kendi sistemlerinin kendilerini engellemesine yol açtı, bu da yeterli test ve dağıtım prosedürlerinin eksikliğini vurguladı.",
      "Bu olay, CrowdStrike'ın kalite kontrolü, test uygulamaları ve dağıtım stratejilerinin sağlamlığı hakkında endişeleri artırdı, özellikle birçok kuruluş için siber güvenlikteki kritik rolleri göz önüne alındığında."
    ],
    "points": 108,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721438368
  }
]
