[
  {
    "id": 41012443,
    "title": "Mapeei quase todas as mortes no trânsito dos EUA no século 21",
    "originLink": "https://roadway.report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012443",
    "commentBody": "",
    "originSummary": [
      "A Nationwide Vision-Zero Map é uma nova iniciativa destinada a eliminar fatalidades no trânsito e lesões graves nas estradas.",
      "Este mapa fornece uma visão abrangente dos dados de segurança no trânsito em todo o país, ajudando a identificar áreas de alto risco e a implementar medidas de segurança direcionadas.",
      "A iniciativa faz parte de uma estratégia mais ampla chamada Visão Zero, que foi adotada por várias cidades e países para melhorar a segurança viária por meio de abordagens baseadas em dados e engajamento comunitário."
    ],
    "commentSummary": [
      "Um mapa abrangente de quase todas as mortes no trânsito nos EUA no século 21 foi criado, com usuários sugerindo um mapa de calor para identificar pontos críticos de fatalidades.",
      "Discussões destacaram imprecisões de dados do banco de dados FARS da NHTSA, incluindo problemas com relatórios policiais e sistemas de relatórios estaduais.",
      "Usuários debateram o impacto do design das estradas na segurança, defendendo ruas mais estreitas e medidas de acalmia de tráfego, e discutiram o equilíbrio entre a segurança nas estradas e a eficiência do tráfego."
    ],
    "points": 681,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1721431006
  },
  {
    "id": 41016768,
    "title": "Pesquisador encontra falha no site da a16z que expôs alguns dados da empresa",
    "originLink": "https://www.kibty.town/blog/a16z/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016768",
    "commentBody": "",
    "originSummary": [
      "A pesquisadora de segurança descobriu uma vulnerabilidade no subdomínio da a16z crypto, revelando informações sensíveis como chaves AWS e conteúdos de banco de dados.",
      "As credenciais expostas incluíam acesso à AWS, Salesforce, Mailgun e a um banco de dados contendo Informações Pessoais Identificáveis (PII).",
      "A pesquisadora não recebeu uma recompensa por encontrar falhas devido à divulgação pública após não conseguir encontrar um método de contato privado, o que consideraram injusto."
    ],
    "commentSummary": [
      "A pesquisadora identificou uma vulnerabilidade no site da a16z que expôs dados da empresa, mas não recebeu recompensa por bug devido à divulgação pública após tentativas de contato privado terem falhado.",
      "A ocorrência gerou debates sobre divulgação responsável, práticas de segurança das empresas e a ética da caça de bugs não remunerada.",
      "Críticas foram direcionadas à a16z por não compensar o pesquisador, destacando as responsabilidades tanto das empresas quanto dos pesquisadores de segurança na gestão de tais descobertas."
    ],
    "points": 461,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1721485998
  },
  {
    "id": 41013004,
    "title": "Garage: Armazenamento de Objetos Distribuído de Código Aberto",
    "originLink": "https://garagehq.deuxfleurs.fr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013004",
    "commentBody": "",
    "originSummary": [
      "Garage é um serviço de armazenamento de objetos distribuído de código aberto projetado para auto-hospedagem, oferecendo redundância ao replicar dados em três zonas.",
      "Os principais recursos incluem implantação leve e eficiente, versatilidade em vários datacenters e resiliência a falhas de rede e hardware.",
      "Suporta hardware heterogêneo, implementa a API Amazon S3 para compatibilidade e é financiado por NGI POINTER, NLnet / NGI0 Entrust e pelo programa de pesquisa e inovação Horizon 2021 da União Europeia."
    ],
    "commentSummary": [
      "Garage é um sistema de armazenamento de objetos distribuído de código aberto que os usuários estão adotando em vez do Minio devido ao melhor desempenho com arquivos pequenos e replicação.",
      "Os principais recursos incluem melhorias significativas de desempenho, baixo uso de memória e CRDTs (Tipos de Dados Replicados sem Conflito) para consenso distribuído.",
      "As licenças do projeto são AGPL e ele visa oferecer uma solução de armazenamento flexível e auto-hospedada, com discussões em andamento sobre recursos de conformidade e comparações com outros sistemas de armazenamento como SeaweedFS, IPFS e Tahoe-LAFS."
    ],
    "points": 389,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1721436031
  },
  {
    "id": 41012193,
    "title": "Dados de múltiplos satélites mostram um vazamento recorde de metano devido a um estouro de poço",
    "originLink": "https://pubs.acs.org/doi/10.1021/acs.estlett.4c00399",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012193",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Dados de múltiplos satélites identificaram um vazamento recorde de metano devido a um estouro de poço, destacando que as emissões de metano relacionadas ao petróleo e gás são significativamente subnotificadas pela indústria.",
      "Methano tem um potencial de gás de efeito estufa 20 vezes maior que o do CO2 ao longo de 100 anos, tornando alguns caminhos de produção piores do que o carvão em termos de impacto climático.",
      "A ocorrência no Cazaquistão destaca a necessidade de políticas climáticas mais rigorosas e medição precisa para abordar vazamentos de metano, que são agravados por agências reguladoras enfraquecidas e infraestrutura obsoleta."
    ],
    "points": 303,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1721428945
  },
  {
    "id": 41014941,
    "title": "Typst: Uma alternativa fácil de aprender para LaTex",
    "originLink": "https://github.com/typst/typst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014941",
    "commentBody": "",
    "originSummary": [
      "Typst é um novo sistema de composição tipográfica baseado em marcação, fácil de usar, projetado para ser tão poderoso quanto o LaTeX, com marcação integrada, funções flexíveis, script integrado e tempos de compilação rápidos.",
      "Os compiladores e a CLI (Interface de Linha de Comando) do Typst estão disponíveis para compilação local de documentos, com um editor online gratuito atualmente em beta público para uma experiência aprimorada.",
      "Os usuários podem se juntar à comunidade Typst no Discord para obter suporte e acessar recursos criados pela comunidade, com oportunidades de contribuir relatando bugs ou sugerindo funcionalidades."
    ],
    "commentSummary": [
      "Typst é apresentado como uma alternativa mais fácil e eficiente em termos de recursos ao LaTeX para a geração de PDFs, com usuários relatando melhorias significativas de desempenho.",
      "A ferramenta é elogiada por seu sistema de templates intuitivo, tornando-a mais acessível para os usuários em comparação com o LaTeX, especialmente para gerar grandes volumes de documentos rapidamente.",
      "Typst está ganhando atenção devido ao seu potencial para simplificar a redação acadêmica e a geração de documentos regulatórios, embora atualmente falte alguns recursos como saída em HTML e suporte completo ao TeX."
    ],
    "points": 292,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1721463260
  },
  {
    "id": 41010188,
    "title": "IA paga por anúncios – o ponto de inflexão mini do GPT-4o",
    "originLink": "https://batchmon.com/blog/ai-cheaper-than-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010188",
    "commentBody": "",
    "originSummary": [
      "OpenAI lançou o modelo mini GPT-4o, com preço de $0,15 por 1 milhão de tokens de entrada e $0,60 por 1 milhão de tokens de saída, tornando-o mais acessível e inteligente do que o GPT-3.5 Turbo.",
      "As baixas custas do GPT-4o mini permitem a criação de conteúdo gerado por IA que pode ser totalmente sustentado por receita de anúncios, potencialmente transformando a criação de conteúdo online.",
      "Por exemplo, gerar uma postagem de blog com o GPT-4o mini custa $0,00051525, enquanto a receita de anúncios por visualização de página pode ser em torno de $0,0026, resultando em um lucro líquido de aproximadamente $0,002 por visualização de página."
    ],
    "commentSummary": [
      "As discussões destacam preocupações sobre o futuro do conteúdo na web, sugerindo que o conteúdo gerado por IA pode em breve dominar, levando a um ciclo de treinamento de IA com base em saídas de IA.",
      "Há um debate sobre a qualidade do conteúdo atual da web, com alguns argumentando que grande parte dele já é material de SEO (Otimização para Motores de Busca) de baixa qualidade, e a IA pode agravar esse problema.",
      "A conversa aborda a dificuldade de distinguir entre texto gerado por humanos e por IA, levantando questões sobre a autenticidade e originalidade das interações e conteúdos online."
    ],
    "points": 276,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1721417319
  },
  {
    "id": 41016290,
    "title": "No Uptime Hosting (2006)",
    "originLink": "https://nouptime.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016290",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "No Uptime Hosting é um site satírico, oferecendo humoristicamente serviços de hospedagem desatualizados e impraticáveis, como aceitar arquivos em disquetes e suportar sistemas operacionais obsoletos como o OS/2 Warp.",
      "A fonte de código HTML do site está intencionalmente cheia de erros e práticas desatualizadas, como declarações de doctype misturadas, tags PHP brutas e tags de fechamento ausentes, adicionando camadas à piada.",
      "A comunidade encontra humor na absurdidade das ofertas de serviços e no design intencionalmente ruim do site, com muitos comentários destacando os elementos nostálgicos e cômicos."
    ],
    "points": 210,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1721481660
  },
  {
    "id": 41009942,
    "title": "Jamais Atualize Nada",
    "originLink": "https://blog.kronis.dev/articles/never-update-anything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41009942",
    "commentBody": "",
    "originSummary": [
      "A matéria apresenta uma visão controversa contra atualizações frequentes de software, destacando as interrupções e o consumo de recursos que elas causam.",
      "Ele sugere uma abordagem mais estável, usando exemplos como o Lazarus IDE e os pacotes estáveis do FreeBSD, para reduzir a necessidade de atualizações constantes.",
      "A autora defende a desaceleração do ritmo das atualizações, focando na estabilidade a longo prazo e em mudanças que não quebrem a compatibilidade, para facilitar a manutenção e reduzir a carga cognitiva dos desenvolvedores."
    ],
    "commentSummary": [
      "Antes da internet, as atualizações de software eram infrequentes e caras, tornando o software com bugs um problema significativo.",
      "A internet facilitou atualizações mais fáceis, levando as empresas a promover atualizações frequentes e usar os clientes como testadores, resultando em software menos estável.",
      "Há um debate entre priorizar versões de suporte de longo prazo (LTS) para estabilidade versus a tendência da indústria de atualizações frequentes em detrimento da qualidade."
    ],
    "points": 175,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721416068
  },
  {
    "id": 41015731,
    "title": "Os banheiros públicos estão desaparecendo e isso é uma catástrofe cívica",
    "originLink": "https://psyche.co/ideas/public-toilets-are-vanishing-and-thats-a-civic-catastrophe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41015731",
    "commentBody": "",
    "originSummary": [
      "Os banheiros públicos estão desaparecendo, levando a uma crise cívica, afetando particularmente indivíduos com problemas de saúde e grupos marginalizados.",
      "Guido Corradi, um pesquisador de psicologia, destaca o péssimo estado dos banheiros públicos em nações ocidentais afluentes, ressaltando seu impacto na saúde pública e na dignidade humana.",
      "Estudos indicam que indivíduos pobres, menos educados e mulheres enfrentam mais encontros negativos com banheiros públicos, ressaltando a necessidade de melhorar as instalações e campanhas de conscientização pública."
    ],
    "commentSummary": [
      "A desaparição de banheiros públicos nos EUA levou a problemas significativos de acessibilidade, forçando as pessoas a dependerem de estabelecimentos comerciais para acesso a sanitários.",
      "Embora o Comitê para Acabar com os Banheiros Pagos na América tenha conseguido proibir os banheiros pagos, nenhuma medida foi tomada para substituí-los por banheiros públicos gratuitos.",
      "In alguns estados como a Flórida, as empresas são obrigadas a ter banheiros públicos, mas o acesso é frequentemente restrito aos clientes, destacando a necessidade de uma infraestrutura de banheiros públicos melhorada."
    ],
    "points": 155,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1721475434
  },
  {
    "id": 41013159,
    "title": "Doom no Playdate",
    "originLink": "https://devforum.play.date/t/doom-on-playdate/852",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013159",
    "commentBody": "",
    "originSummary": [
      "Uma versão inicial de Doom foi portado com sucesso para o Playdate, um console de jogos portátil.",
      "A desenvolvedora enfrentou desafios significativos com makefiles, compiladores e problemas de linker, particularmente referências ausentes na libc, que foram resolvidos ajustando as opções do linker e modificando o SDK do Playdate.",
      "A partir de agora, o jogo roda tanto no simulador quanto no hardware real, permitindo que o desenvolvedor se concentre no controle do jogo, na apresentação e na otimização."
    ],
    "commentSummary": [
      "O console portátil Playdate está rodando Doom, gerando discussões sobre a otimização de sua tela usando várias técnicas de dithering para melhor clareza visual.",
      "Os usuários estão debatendo os méritos de diferentes métodos de dithering, como Atkinson e dithering ordenado, e referenciando outros jogos como Return of the Obra Dinn para inspiração.",
      "As Playdate usa um LCD de Memória Sharp, que oferece altas taxas de atualização e baixo consumo de energia, embora alguns usuários desejem que tivesse uma luz de fundo para melhor usabilidade."
    ],
    "points": 140,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1721437831
  },
  {
    "id": 41010458,
    "title": "A União Europeia deve continuar financiando software livre",
    "originLink": "https://pad.public.cat/lettre-NCP-NGI",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010458",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "A União Europeia é incentivada a aumentar o financiamento para software livre, pois as contribuições atuais são mínimas em comparação com os esforços comerciais.",
      "A criação de um novo modelo de financiamento pode ser necessária para fomentar um ecossistema de software livre próspero, já que o impacto da NLnet é limitado em comparação com grandes empresas como o Google.",
      "A discussão gira em torno da eficácia do financiamento governamental para projetos técnicos e da posição da UE na indústria tecnológica."
    ],
    "points": 136,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1721419023
  },
  {
    "id": 41017077,
    "title": "CrowdStrike debacle fornece um mapa das vulnerabilidades americanas para adversários",
    "originLink": "https://www.nytimes.com/2024/07/19/us/politics/crowdstrike-outage.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41017077",
    "commentBody": "",
    "originSummary": [
      "A falha em uma atualização de software causou um colapso digital na sexta-feira, afetando aeroportos, hospitais e emissoras de TV, destacando a fragilidade das redes interconectadas.",
      "A ocorrência foi devido a erro humano, não a um ataque de um estado-nação, e envolveu o software da CrowdStrike, que é destinado a neutralizar ciberataques.",
      "Este evento destaca a necessidade de melhorar a resiliência digital, apesar dos esforços contínuos do governo dos EUA e do setor privado para aprimorar a cibersegurança."
    ],
    "commentSummary": [
      "A ocorrência envolvendo a CrowdStrike expôs vulnerabilidades na infraestrutura crítica americana, provocando debates sobre o uso de sistemas operacionais (SO) que necessitam de atualizações frequentes de segurança.",
      "Especialistas estão sugerindo alternativas como Linux ou OpenBSD, que são percebidas como oferecendo melhor segurança em comparação com o Windows, amplamente utilizado por razões históricas e práticas.",
      "A ocorrência enfatiza a necessidade de recursos de segurança integrados nos sistemas e levanta preocupações sobre as implicações mais amplas para a segurança nacional e a resiliência da infraestrutura."
    ],
    "points": 128,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1721488699
  },
  {
    "id": 41014089,
    "title": "Os links encurtados do Google deixarão de funcionar no próximo ano",
    "originLink": "https://www.theverge.com/2024/7/19/24201734/google-url-link-shortening-service-shut-down-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014089",
    "commentBody": "",
    "originSummary": [
      "Os links encurtados do Google (goo.gl) deixarão de funcionar após 25 de agosto de 2025, resultando em um erro 404 para todos esses links.",
      "Começando em 23 de agosto de 2024, os links goo.gl exibirão uma página intermediária avisando os usuários sobre o encerramento iminente.",
      "Google aconselha os desenvolvedores a atualizar os links afetados para evitar interrupções, observando que o serviço goo.gl foi inicialmente encerrado em 2019 com uma recomendação para mudar para Firebase Dynamic Links, que também foi descontinuado."
    ],
    "commentSummary": [
      "Serviço de encurtamento de URL do Google encerrará operações no próximo ano, causando frustração entre os usuários que dependem dele para redirecionamentos.",
      "Críticos destacam o padrão do Google de descontinuar serviços, atribuindo a decisão aos custos de manutenção e políticas internas.",
      "Usuários sugerem alternativas como AWS para redirecionamentos e propõem soluções mais simples ou terceirização para manter o serviço funcional."
    ],
    "points": 120,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1721450175
  },
  {
    "id": 41011779,
    "title": "Acadêmicos chocados após T&F vender acesso às suas pesquisas para a IA da Microsoft",
    "originLink": "https://www.thebookseller.com/news/academic-authors-shocked-after-taylor--francis-sells-access-to-their-research-to-microsoft-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41011779",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Acadêmicos estão frustrados com a Taylor & Francis por vender acesso às suas pesquisas para a IA da Microsoft, argumentando que pesquisas financiadas com recursos públicos deveriam ser acessíveis gratuitamente para maximizar seus benefícios.",
      "Céticos afirmam que cobrar pelo acesso cria barreiras e impede o progresso científico, enfatizando a importância da atribuição adequada e o direito moral ao crédito.",
      "A situação destaca a tensão contínua entre o acesso aberto e os modelos tradicionais de publicação, que frequentemente lucram com pesquisas financiadas publicamente."
    ],
    "points": 111,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1721426035
  },
  {
    "id": 41013198,
    "title": "Tecnical Details on Today's Outage",
    "originLink": "https://www.crowdstrike.com/blog/technical-details-on-todays-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013198",
    "commentBody": "",
    "originSummary": [
      "Em 19 de julho de 2024, a CrowdStrike lançou uma atualização de configuração de sensor para sistemas Windows, causando falhas no sistema e telas azuis (BSOD) devido a um erro lógico, que foi corrigido em aproximadamente 1,5 horas.",
      "A questão afetou os clientes que utilizavam o sensor Falcon para Windows versão 7.11 e acima, que estavam online entre 04:09 UTC e 05:27 UTC, devido a um Arquivo de Canal problemático 291 projetado para avaliar a execução de named pipe.",
      "Os sistemas que executam Linux ou macOS não foram impactados, e uma análise da causa raiz está em andamento para prevenir problemas futuros."
    ],
    "commentSummary": [
      "CrowdStrike sofreu uma interrupção significativa devido a um arquivo de configuração malformado, causando a falha dos sistemas Windows com a Tela Azul da Morte (BSOD) e loops de inicialização.",
      "A questão surgiu de uma atualização direcionada a pipes nomeados maliciosos, que inadvertidamente levou os próprios sistemas da CrowdStrike a se bloquearem, destacando a falta de procedimentos adequados de teste e implementação.",
      "Este incidente levantou preocupações sobre o controle de qualidade da CrowdStrike, práticas de teste e a robustez de suas estratégias de implantação, especialmente dado seu papel crítico na cibersegurança de muitas organizações."
    ],
    "points": 108,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721438368
  }
]
