[
  {
    "id": 41012443,
    "title": "Kupetakan hampir setiap kematian lalu lintas di AS pada abad ke-21",
    "originLink": "https://roadway.report",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012443",
    "commentBody": "",
    "originSummary": [
      "Visi-Zero Peta Nasional adalah inisiatif baru yang bertujuan untuk menghilangkan kematian lalu lintas dan cedera parah di jalan raya.",
      "Map ini memberikan gambaran menyeluruh tentang data keselamatan lalu lintas di seluruh negeri, membantu mengidentifikasi area berisiko tinggi dan menerapkan langkah-langkah keselamatan yang ditargetkan.",
      "Inisiatif ini merupakan bagian dari strategi Vision-Zero yang lebih luas, yang telah diadopsi oleh berbagai kota dan negara untuk meningkatkan keselamatan jalan melalui pendekatan berbasis data dan keterlibatan komunitas."
    ],
    "commentSummary": [
      "Kartografi komprehensif dari hampir setiap kematian lalu lintas di AS pada abad ke-21 telah dibuat, dengan pengguna menyarankan peta panas untuk mengidentifikasi titik-titik rawan kematian.",
      "Diskusi menyoroti ketidakakuratan data dari database FARS milik NHTSA, termasuk masalah dengan laporan polisi dan sistem pelaporan negara bagian.",
      "Pengguna memperdebatkan dampak desain jalan terhadap keselamatan, menganjurkan jalan yang lebih sempit dan langkah-langkah penenangan lalu lintas, serta membahas keseimbangan antara keselamatan jalan dan efisiensi lalu lintas."
    ],
    "points": 681,
    "commentCount": 383,
    "retryCount": 0,
    "time": 1721431006
  },
  {
    "id": 41016768,
    "title": "Peneliti menemukan cacat di situs web a16z yang mengekspos beberapa data perusahaan",
    "originLink": "https://www.kibty.town/blog/a16z/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016768",
    "commentBody": "",
    "originSummary": [
      "Kemudian seorang peneliti keamanan menemukan kerentanan di subdomain a16z crypto, yang mengungkapkan informasi sensitif seperti kunci AWS dan isi database.",
      "Kredensial yang terekspos termasuk akses ke AWS, Salesforce, Mailgun, dan basis data yang berisi Informasi Identitas Pribadi (PII).",
      "Peneliti tidak menerima hadiah bug karena pengungkapan publik setelah gagal menemukan metode kontak pribadi, yang mereka anggap tidak adil."
    ],
    "commentSummary": [
      "Seorang peneliti mengidentifikasi kerentanan di situs web a16z yang mengekspos data perusahaan tetapi tidak menerima hadiah bug bounty karena pengungkapan publik setelah upaya kontak pribadi gagal.",
      "Insiden tersebut telah memicu perdebatan tentang pengungkapan yang bertanggung jawab, praktik keamanan perusahaan, dan etika perburuan bug tanpa bayaran.",
      "Kritik telah diarahkan kepada a16z karena tidak memberikan kompensasi kepada peneliti, menyoroti tanggung jawab baik perusahaan maupun peneliti keamanan dalam menangani penemuan semacam itu."
    ],
    "points": 461,
    "commentCount": 187,
    "retryCount": 0,
    "time": 1721485998
  },
  {
    "id": 41013004,
    "title": "Garage: Penyimpanan Objek Terdistribusi Sumber Terbuka",
    "originLink": "https://garagehq.deuxfleurs.fr/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013004",
    "commentBody": "",
    "originSummary": [
      "Garage adalah layanan penyimpanan objek terdistribusi sumber terbuka yang dirancang untuk self-hosting, menawarkan redundansi dengan mereplikasi data di tiga zona.",
      "Fitur utama meliputi penerapan yang ringan dan efisien, fleksibilitas di berbagai pusat data, serta ketahanan terhadap kegagalan jaringan dan perangkat keras.",
      "Itu mendukung perangkat keras heterogen, mengimplementasikan API Amazon S3 untuk kompatibilitas, dan didanai oleh NGI POINTER, NLnet / NGI0 Entrust, dan program penelitian dan inovasi Horizon 2021 Uni Eropa."
    ],
    "commentSummary": [
      "Garage adalah sistem penyimpanan objek terdistribusi sumber terbuka yang diadopsi pengguna dibandingkan Minio karena kinerja yang lebih baik dengan file kecil dan replikasi.",
      "Fitur utama mencakup peningkatan kinerja yang signifikan, penggunaan memori yang rendah, dan CRDTs (Conflict-free Replicated Data Types) untuk konsensus terdistribusi.",
      "Proyek ini berlisensi AGPL dan bertujuan untuk menawarkan solusi penyimpanan yang fleksibel dan dapat di-hosting sendiri, dengan diskusi yang sedang berlangsung tentang fitur kepatuhan dan perbandingan dengan sistem penyimpanan lain seperti SeaweedFS, IPFS, dan Tahoe-LAFS."
    ],
    "points": 389,
    "commentCount": 104,
    "retryCount": 0,
    "time": 1721436031
  },
  {
    "id": 41012193,
    "title": "Data multisatelit menggambarkan kebocoran metana yang memecahkan rekor dari ledakan sumur",
    "originLink": "https://pubs.acs.org/doi/10.1021/acs.estlett.4c00399",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41012193",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Data multisatelit telah mengidentifikasi kebocoran metana yang memecahkan rekor dari ledakan sumur, menyoroti bahwa emisi metana terkait minyak dan gas secara signifikan kurang dilaporkan oleh industri.",
      "Methana memiliki potensi gas rumah kaca 20 kali lipat dari CO2 selama 100 tahun, membuat beberapa jalur produksi lebih buruk daripada batu bara dalam hal dampak iklim.",
      "Insiden di Kazakhstan menekankan perlunya kebijakan iklim yang lebih kuat dan pengukuran yang akurat untuk mengatasi kebocoran metana, yang diperburuk oleh lembaga pengatur yang melemah dan infrastruktur yang usang."
    ],
    "points": 303,
    "commentCount": 210,
    "retryCount": 0,
    "time": 1721428945
  },
  {
    "id": 41014941,
    "title": "Typst: Alternatif yang mudah dipelajari untuk LaTex",
    "originLink": "https://github.com/typst/typst",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014941",
    "commentBody": "",
    "originSummary": [
      "Typst adalah sistem typesetting berbasis markup yang baru dan ramah pengguna, dirancang untuk sekuat LaTeX, dengan markup bawaan, fungsi yang fleksibel, skrip terintegrasi, dan waktu kompilasi yang cepat.",
      "Kompiler dan CLI (Command Line Interface) Typst tersedia untuk kompilasi dokumen lokal, dengan editor online gratis yang saat ini dalam versi beta publik untuk pengalaman yang lebih baik.",
      "Pengguna dapat bergabung dengan komunitas Typst di Discord untuk mendapatkan dukungan dan mengakses sumber daya yang dibangun oleh komunitas, dengan kesempatan untuk berkontribusi dengan melaporkan bug atau menyarankan fitur."
    ],
    "commentSummary": [
      "Typst dipresentasikan sebagai alternatif yang lebih mudah dan lebih efisien sumber daya dibandingkan LaTeX untuk menghasilkan PDF, dengan pengguna melaporkan peningkatan kinerja yang signifikan.",
      "Alat ini dipuji karena sistem templating yang intuitif, membuatnya lebih mudah diakses oleh pengguna dibandingkan dengan LaTeX, terutama untuk menghasilkan dokumen dalam jumlah besar dengan cepat.",
      "Typst mendapatkan perhatian karena potensinya untuk menyederhanakan penulisan akademik dan pembuatan dokumen regulasi, meskipun saat ini masih kekurangan beberapa fitur seperti output HTML dan dukungan penuh untuk TeX."
    ],
    "points": 292,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1721463260
  },
  {
    "id": 41010188,
    "title": "AI yang didanai oleh Iklan – titik infleksi mini GPT-4o",
    "originLink": "https://batchmon.com/blog/ai-cheaper-than-ads/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010188",
    "commentBody": "",
    "originSummary": [
      "OpenAI telah meluncurkan model mini GPT-4o, dengan harga $0,15 per 1 juta token input dan $0,60 per 1 juta token output, menjadikannya lebih terjangkau dan cerdas dibandingkan GPT-3.5 Turbo.",
      "Biaya rendah dari GPT-4o mini memungkinkan pembuatan konten yang dihasilkan oleh AI yang dapat sepenuhnya didukung oleh pendapatan iklan, yang berpotensi mengubah pembuatan konten online.",
      "Misalnya, menghasilkan sebuah posting blog dengan GPT-4o mini memerlukan biaya $0.00051525, sementara pendapatan iklan per tampilan halaman bisa sekitar $0.0026, menghasilkan keuntungan bersih sekitar $0.002 per tampilan halaman."
    ],
    "commentSummary": [
      "Diskusi tersebut menyoroti kekhawatiran tentang masa depan konten web, dengan menyarankan bahwa konten yang dihasilkan oleh AI mungkin segera mendominasi, yang mengarah pada siklus pelatihan AI berdasarkan output AI.",
      "Ada perdebatan tentang kualitas konten web saat ini, dengan beberapa orang berargumen bahwa banyak di antaranya sudah merupakan materi SEO (Search Engine Optimization) berkualitas rendah, dan AI mungkin memperburuk masalah ini.",
      "Percakapan tersebut menyentuh kesulitan dalam membedakan antara teks yang dihasilkan oleh manusia dan AI, yang menimbulkan pertanyaan tentang keaslian dan orisinalitas interaksi dan konten online."
    ],
    "points": 276,
    "commentCount": 220,
    "retryCount": 0,
    "time": 1721417319
  },
  {
    "id": 41016290,
    "title": "Tidak Ada Waktu Aktif Hosting (2006)",
    "originLink": "https://nouptime.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41016290",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Tidak Ada Uptime Hosting adalah sebuah situs web satir yang dengan humor menawarkan layanan hosting yang usang dan tidak praktis, seperti menerima file dalam disket dan mendukung sistem operasi yang sudah ketinggalan zaman seperti OS/2 Warp.",
      "Kode sumber HTML situs tersebut sengaja diisi dengan kesalahan dan praktik usang, seperti deklarasi doctype campuran, tag PHP mentah, dan tag penutup yang hilang, menambah lapisan pada lelucon.",
      "Komunitas menemukan humor dalam absurditas penawaran layanan dan desain situs web yang sengaja dibuat buruk, dengan banyak komentar yang menyoroti elemen nostalgia dan komedi."
    ],
    "points": 210,
    "commentCount": 68,
    "retryCount": 0,
    "time": 1721481660
  },
  {
    "id": 41009942,
    "title": "Tidak Pernah Memperbarui Apa Pun",
    "originLink": "https://blog.kronis.dev/articles/never-update-anything",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41009942",
    "commentBody": "",
    "originSummary": [
      "Artikel tersebut menyajikan pandangan kontroversial terhadap pembaruan perangkat lunak yang sering, menyoroti gangguan dan konsumsi sumber daya yang mereka sebabkan.",
      "Kemudian, ini menyarankan pendekatan yang lebih stabil, menggunakan contoh seperti Lazarus IDE dan paket stabil FreeBSD, untuk mengurangi kebutuhan akan pembaruan yang konstan.",
      "Penulis menganjurkan untuk memperlambat laju pembaruan, dengan fokus pada stabilitas jangka panjang dan perubahan yang tidak merusak untuk memudahkan pemeliharaan dan mengurangi beban kognitif pengembang."
    ],
    "commentSummary": [
      "Sebelum internet, pembaruan perangkat lunak jarang terjadi dan mahal, sehingga perangkat lunak yang bermasalah menjadi masalah yang signifikan.",
      "Internet memfasilitasi pembaruan yang lebih mudah, mendorong perusahaan untuk sering melakukan pembaruan dan menggunakan pelanggan sebagai penguji, yang mengakibatkan perangkat lunak menjadi kurang stabil.",
      "Ada perdebatan antara memprioritaskan versi dukungan jangka panjang (LTS) untuk stabilitas versus tren industri pembaruan yang sering dengan mengorbankan kualitas."
    ],
    "points": 175,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721416068
  },
  {
    "id": 41015731,
    "title": "Toilet umum semakin menghilang dan itu adalah bencana sipil",
    "originLink": "https://psyche.co/ideas/public-toilets-are-vanishing-and-thats-a-civic-catastrophe",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41015731",
    "commentBody": "",
    "originSummary": [
      "Toilet umum semakin menghilang, menyebabkan krisis sipil, terutama mempengaruhi individu dengan masalah kesehatan dan kelompok yang terpinggirkan.",
      "Guido Corradi, seorang peneliti psikologi, menekankan kondisi buruk toilet umum di negara-negara Barat yang makmur, menyoroti dampaknya terhadap kesehatan masyarakat dan martabat manusia.",
      "Studi menunjukkan bahwa individu yang miskin, kurang berpendidikan, dan wanita mengalami lebih banyak pertemuan negatif dengan toilet umum, menekankan perlunya perbaikan fasilitas dan kampanye kesadaran publik."
    ],
    "commentSummary": [
      "Lenyapnya toilet umum di AS telah menyebabkan masalah aksesibilitas yang signifikan, memaksa orang untuk bergantung pada bisnis untuk akses ke kamar kecil.",
      "Meskipun Komite Untuk Mengakhiri Toilet Berbayar di Amerika berhasil melarang toilet berbayar, tidak ada langkah yang diambil untuk menggantinya dengan toilet umum gratis.",
      "Dalam beberapa negara bagian seperti Florida, bisnis diharuskan memiliki toilet umum, tetapi akses sering kali dibatasi hanya untuk pelanggan, menyoroti kebutuhan akan infrastruktur toilet umum yang lebih baik."
    ],
    "points": 155,
    "commentCount": 214,
    "retryCount": 0,
    "time": 1721475434
  },
  {
    "id": 41013159,
    "title": "Doom di Playdate",
    "originLink": "https://devforum.play.date/t/doom-on-playdate/852",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013159",
    "commentBody": "",
    "originSummary": [
      "Versi awal Doom telah berhasil diporting ke Playdate, sebuah konsol game genggam.",
      "Kembangkan menghadapi tantangan signifikan dengan makefile, compiler, dan masalah linker, terutama referensi yang hilang di libc, yang diselesaikan dengan menyesuaikan opsi linker dan memodifikasi Playdate SDK.",
      "Permainan sekarang berjalan baik di simulator maupun perangkat keras sebenarnya, memungkinkan pengembang untuk fokus pada kontrol permainan, presentasi, dan optimasi."
    ],
    "commentSummary": [
      "Konsol genggam Playdate menjalankan Doom, memicu diskusi tentang mengoptimalkan tampilan menggunakan berbagai teknik dithering untuk kejernihan visual yang lebih baik.",
      "Pengguna sedang memperdebatkan kelebihan dari berbagai metode dithering, seperti Atkinson dan ordered dithering, serta merujuk pada game lain seperti Return of the Obra Dinn untuk inspirasi.",
      "The Playdate menggunakan LCD Memori Sharp, yang menawarkan kecepatan refresh cepat dan konsumsi daya rendah, meskipun beberapa pengguna berharap perangkat ini memiliki lampu latar untuk kemudahan penggunaan yang lebih baik."
    ],
    "points": 140,
    "commentCount": 35,
    "retryCount": 0,
    "time": 1721437831
  },
  {
    "id": 41010458,
    "title": "Uni Eropa harus terus mendanai perangkat lunak bebas",
    "originLink": "https://pad.public.cat/lettre-NCP-NGI",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41010458",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Uni Eropa didorong untuk meningkatkan pendanaan bagi perangkat lunak bebas, karena kontribusi saat ini sangat minim dibandingkan dengan upaya komersial.",
      "Kebutuhan akan model pendanaan baru mungkin diperlukan untuk mendorong ekosistem perangkat lunak bebas yang berkembang, dengan dampak NLnet yang terbatas dibandingkan dengan perusahaan besar seperti Google.",
      "Perdebatan berpusat pada efektivitas pendanaan pemerintah untuk proyek-proyek teknis dan posisi Uni Eropa dalam industri teknologi."
    ],
    "points": 136,
    "commentCount": 33,
    "retryCount": 0,
    "time": 1721419023
  },
  {
    "id": 41017077,
    "title": "Kegagalan CrowdStrike memberikan peta jalan tentang kerentanan Amerika kepada para musuh",
    "originLink": "https://www.nytimes.com/2024/07/19/us/politics/crowdstrike-outage.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41017077",
    "commentBody": "",
    "originSummary": [
      "Bug pembaruan perangkat lunak menyebabkan kerusakan digital pada hari Jumat, memengaruhi bandara, rumah sakit, dan stasiun TV, menyoroti kerapuhan jaringan yang saling terhubung.",
      "Insiden tersebut disebabkan oleh kesalahan manusia, bukan serangan negara, dan melibatkan perangkat lunak CrowdStrike, yang bertujuan untuk menetralkan serangan siber.",
      "Peristiwa ini menekankan perlunya peningkatan ketahanan digital, meskipun ada upaya yang sedang berlangsung oleh pemerintah AS dan sektor swasta untuk meningkatkan keamanan siber."
    ],
    "commentSummary": [
      "Kejadian CrowdStrike telah mengungkapkan kerentanan dalam infrastruktur kritis Amerika, memicu perdebatan tentang penggunaan sistem operasi (OS) yang memerlukan pembaruan keamanan yang sering.",
      "Para ahli menyarankan alternatif seperti Linux atau OpenBSD, yang dianggap menawarkan keamanan lebih baik dibandingkan dengan Windows, yang banyak digunakan karena alasan historis dan praktis.",
      "Insiden tersebut menekankan pentingnya fitur keamanan bawaan dalam sistem dan menimbulkan kekhawatiran tentang implikasi yang lebih luas bagi keamanan nasional dan ketahanan infrastruktur."
    ],
    "points": 128,
    "commentCount": 181,
    "retryCount": 0,
    "time": 1721488699
  },
  {
    "id": 41014089,
    "title": "Link pendek Google akan berhenti berfungsi tahun depan",
    "originLink": "https://www.theverge.com/2024/7/19/24201734/google-url-link-shortening-service-shut-down-support",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41014089",
    "commentBody": "",
    "originSummary": [
      "Link pendek Google (goo.gl) akan berhenti berfungsi setelah 25 Agustus 2025, yang mengakibatkan kesalahan 404 untuk semua link tersebut.",
      "Mulai 23 Agustus 2024, tautan goo.gl akan menampilkan halaman interstisial yang memperingatkan pengguna tentang penutupan yang akan datang.",
      "Google menyarankan para pengembang untuk memperbarui tautan yang terpengaruh guna menghindari gangguan, mencatat bahwa layanan goo.gl awalnya ditutup pada tahun 2019 dengan rekomendasi untuk beralih ke Firebase Dynamic Links, yang juga telah dihentikan."
    ],
    "commentSummary": [
      "Google's URL shortening service akan berhenti beroperasi tahun depan, menyebabkan frustrasi di antara pengguna yang mengandalkannya untuk pengalihan.",
      "Kritikus menyoroti pola Google yang sering menghentikan layanan, mengaitkan keputusan tersebut dengan biaya pemeliharaan dan kebijakan internal.",
      "Pengguna menyarankan alternatif seperti AWS untuk pengalihan dan mengusulkan solusi yang lebih sederhana atau outsourcing untuk menjaga layanan tetap berfungsi."
    ],
    "points": 120,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1721450175
  },
  {
    "id": 41011779,
    "title": "Akademisi terkejut setelah T&F menjual akses ke penelitian mereka kepada Microsoft AI",
    "originLink": "https://www.thebookseller.com/news/academic-authors-shocked-after-taylor--francis-sells-access-to-their-research-to-microsoft-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41011779",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "Akademisi merasa frustrasi dengan Taylor & Francis karena menjual akses ke penelitian mereka kepada Microsoft AI, berargumen bahwa penelitian yang didanai publik seharusnya dapat diakses secara gratis untuk memaksimalkan manfaatnya.",
      "Kritikus mengklaim bahwa mengenakan biaya untuk akses menciptakan hambatan dan menghalangi kemajuan ilmiah, menekankan pentingnya atribusi yang tepat dan hak moral untuk mendapatkan kredit.",
      "Situasi ini menyoroti ketegangan yang terus berlanjut antara akses terbuka dan model penerbitan tradisional, yang sering kali mendapatkan keuntungan dari penelitian yang didanai publik."
    ],
    "points": 111,
    "commentCount": 80,
    "retryCount": 0,
    "time": 1721426035
  },
  {
    "id": 41013198,
    "title": "Detail Teknis tentang Gangguan Hari Ini",
    "originLink": "https://www.crowdstrike.com/blog/technical-details-on-todays-outage/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41013198",
    "commentBody": "",
    "originSummary": [
      "Pada 19 Juli 2024, CrowdStrike merilis pembaruan konfigurasi sensor untuk sistem Windows, yang menyebabkan kerusakan sistem dan layar biru (BSOD) karena kesalahan logika, yang diperbaiki dalam waktu sekitar 1,5 jam.",
      "Masalah ini mempengaruhi pelanggan yang menggunakan sensor Falcon untuk Windows versi 7.11 dan di atasnya, yang online antara pukul 04:09 UTC dan 05:27 UTC, karena File Saluran 291 yang bermasalah yang dirancang untuk mengevaluasi eksekusi named pipe.",
      "Sistem yang menjalankan Linux atau macOS tidak terpengaruh, dan analisis akar penyebab sedang berlangsung untuk mencegah masalah di masa depan."
    ],
    "commentSummary": [
      "CrowdStrike mengalami pemadaman signifikan akibat file konfigurasi yang salah bentuk, menyebabkan sistem Windows mengalami crash dengan Blue Screen of Death (BSOD) dan boot loop.",
      "Masalah ini berasal dari pembaruan yang menargetkan pipa bernama berbahaya, yang secara tidak sengaja menyebabkan sistem CrowdStrike sendiri memblokir diri mereka sendiri, menyoroti kurangnya pengujian dan prosedur peluncuran yang memadai.",
      "Insiden ini telah menimbulkan kekhawatiran tentang kontrol kualitas CrowdStrike, praktik pengujian, dan ketahanan strategi penerapan mereka, terutama mengingat peran kritis mereka dalam keamanan siber bagi banyak organisasi."
    ],
    "points": 108,
    "commentCount": 111,
    "retryCount": 0,
    "time": 1721438368
  }
]
