[
  {
    "id": 37726539,
    "title": "Az óceáni mikroműanyagok nagy részét a gumiabroncsok pora alkotja",
    "originLink": "https://www.thedrive.com/news/tire-dust-makes-up-the-majority-of-ocean-microplastics-study-finds",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37726539",
    "commentBody": "",
    "originSummary": [
      "Egy nemrégiben készült tanulmány kimutatta, hogy az óceánban található mikroműanyagok többsége gumiabroncsporból származik, ami károsíthatja a tengeri élővilágot és potenciálisan az emberi egészséget is.",
      "A tanulmány azt is megállapította, hogy a gumiabroncsok porából származó kibocsátás még magasabb az elektromos járműveknél (EV-k) a súlyuk és a nagy nyomatékuk miatt.",
      "A szabályozó hatóságok a gumiabroncsok és fékek kibocsátására vonatkozó szabványok bevezetésével kezelik ezt a problémát, miközben a gyártók alternatív gumiabroncs-összetételeket és a részecskekibocsátás felfogására szolgáló módszereket kutatnak."
    ],
    "commentSummary": [
      "A beszélgetés több, a közlekedés környezeti hatásával kapcsolatos témát tárgyal, kiemelve a gumiabroncsok porát, mint az óceánba kerülő mikroműanyagok jelentős forrását, valamint az autóalapú szállítás káros hatásait a levegő és a felszín szennyezésére.",
      "Megvizsgálja a személygépkocsi nélküli élet lehetőségét és előnyeit a külvárosi területeken, megkérdőjelezi a külvárosi infrastruktúra fenntarthatóságát, és megvizsgálja a különböző energiaforrások, különösen az elektromos járművek (EV-k) környezetre gyakorolt hatását.",
      "A megbeszélések egyedi szempontjai közé tartozik a pitypang mint fenntartható gumiforrás felhasználása a gumiabroncsgyártáshoz, a személygépkocsik és a tömegközlekedés közötti vita, a súlyalapú adók és az üzemanyag-hiányos járművekkel kapcsolatos aggodalmak."
    ],
    "points": 641,
    "commentCount": 529,
    "retryCount": 0,
    "time": 1696172461
  },
  {
    "id": 37729160,
    "title": "Bing ChatGPT kép jailbreak",
    "originLink": "https://twitter.com/literallydenis/status/1708283962399846459",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37729160",
    "commentBody": "",
    "originSummary": [
      "A szerzőnek sikerült értelmeznie egy captcha-t a Bing segítségével a vizuális kérések módosításával.",
      "A posztjukban képernyőmentéseket is mellékeltek, amelyek a captcha Bing általi megjelenítését mutatják.",
      "Ez egy érdekes felhasználási esetet jelent a Bing azon képességére vonatkozóan, hogy megértse és értelmezze a captcha képeket."
    ],
    "commentSummary": [
      "A párbeszéd a mesterséges intelligencia nyelvi modellekkel kapcsolatos témák egész sorát öleli fel, beleértve a korlátokat, a lehetséges veszélyeket és a parancsoknak való engedelmeskedés képességét.",
      "Olyan fogalmak kerülnek megvitatásra, mint az LLM-ek (Large Language Models - nagy nyelvi modellek) feltörése, a manipulációjuk a social engineering segítségével, valamint az LLM-ek kívánt viselkedéshez való igazításának nehézsége.",
      "Az etikai kérdések, a magánélet védelmével kapcsolatos aggályok, a fokozott átláthatóságra és biztonsági intézkedésekre vonatkozó felhívások, valamint a sci-fivel való párhuzamok szintén a vita részét képezik, megvilágítva a mesterséges intelligencia nyelvi modellekkel kapcsolatos összetettséget és kockázatokat."
    ],
    "points": 397,
    "commentCount": 196,
    "retryCount": 0,
    "time": 1696186284
  },
  {
    "id": 37733036,
    "title": "Viszlát egész számok, helló UUIDv7",
    "originLink": "https://buildkite.com/blog/goodbye-integers-hello-uuids",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37733036",
    "commentBody": "",
    "originSummary": [
      "A Buildkite kiadott egy frissítést, amely egy új terméket, nevezetesen a Login Blog Supportot és kulcsfontosságú fejlesztéseket vezet be, az UUIDv7 beépítésével az adattároláshoz, mint elsődleges kulcs.",
      "Az UUIDv7, egy egyedi azonosító rendszer, amelyet a szekvenciális és az UUID kulcsok előnyös tulajdonságai miatt használnak. Az azonosítóba időbélyeget kódol, ami javítja az adatbázis teljesítményét, kiküszöböli az összehangolt azonosítógenerálás szükségességét és egyszerűsíti az alkalmazási logikát.",
      "A vállalat azt fontolgatja, hogy a fejlesztést a legnagyobb Postgres-adatbázisuk megosztásával bővíti, és a jövőben esetleg az UUIDv8-at használja, annak ellenére, hogy a tárolási kapacitás az általános előnyök miatt csak minimálisan növekszik."
    ],
    "commentSummary": [
      "A viták az UUID-ok (Universally Unique Identifiers, azaz univerzálisan egyedi azonosítók) elosztott rendszerekben való használatára összpontosítanak, a biztonságukról és gyakorlatiasságukról alkotott vélemények megoszlanak, és olyan alternatívákra tesznek javaslatokat, mint a Cuid2 és az UUIDv4.",
      "A véletlenszerű azonosítók hatása a rendszer teljesítményére, az adatbázisok megosztása, valamint az adatlokalitás és a lekérdezések hatékonysága közötti kapcsolat szintén beszédtéma lett, ami jelzi az elosztott rendszerek tervezésének és optimalizálásának összetettségét.",
      "Végül a beszélgetés az UUID-ok különböző változatait, mint például az UUIDv7, ULID-ok és KSUID-ok, azok előnyeit és korlátait, valamint az egyedi azonosítók GIS (földrajzi információs rendszer) alkalmazásokban való használatát vizsgálja, kiemelve a rövidebb azonosító ábrázolások szükségességét."
    ],
    "points": 350,
    "commentCount": 183,
    "retryCount": 0,
    "time": 1696211099
  },
  {
    "id": 37725778,
    "title": "Az Influxdb átváltott a Go-tól a Rust-ra",
    "originLink": "https://old.reddit.com/r/rust/comments/16v13l5/influxdb_officially_made_the_switch_from_go_rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37725778",
    "commentBody": "",
    "originSummary": [
      "Az InfluxDB, egy nyílt forráskódú idősoros adatbázis, szinte az összes kódját (99,5%) átállította a Go programról a Rustra a nagyobb teljesítmény, a jobb hibakezelés, az egyidejűség és a más nyílt forráskódú alkalmazásokkal való jobb integráció miatt.",
      "A körülbelül 3 évig tartó átdolgozás célja az volt, hogy megfeleljen az olyan követelményeknek, mint a korlátlan kardinalitás, a továbbfejlesztett analitikai lekérdezések, valamint az SQL és a nagyobb ökoszisztémákkal való kompatibilitás.",
      "A Rustra való áttérés jelentős teljesítményjavulást eredményezett az InfluxDB új verziójában a felhőkörnyezetükben, a beszélgetések kiterjednek a fejlesztési folyamatra, a DataFusion lekérdezőmotor használatára, valamint a TimescaleDB-vel és a ClickHouse-zal való összehasonlításra is."
    ],
    "commentSummary": [
      "Az InfluxDB, egy idősoros adatbázis, megkezdte az átállást a Go programozási nyelvről a Rust nyelvre, ami a felhasználók érdeklődését és a szoftverek átírásának előnyeiről szóló vitákat váltotta ki.",
      "Néhány felhasználó az InfluxDB-vel kapcsolatos skálázási problémák miatt alternatív adatbázisokra, például a TimescaleDB-re és a ClickHouse-ra váltott, míg mások a TimescaleDB előnyeit, például a HA-t, a biztonsági mentéseket és a kezelést dicsérik.",
      "Az InfluxDB v3 fejlesztése ellenére az InfluxDB v1 továbbra is széles körben használatos az egyszerűsége és kompatibilitása miatt. A Rusztra való áttérésről szóló döntést a potenciális teljesítménynövekedés és a Rust fordító motiválta, ami a fejlesztők és az InfluxData csapat körében egyaránt szkepticizmussal és optimizmussal találkozott."
    ],
    "points": 313,
    "commentCount": 148,
    "retryCount": 0,
    "time": 1696167096
  },
  {
    "id": 37729964,
    "title": "A DMARC megismerése és tesztelése",
    "originLink": "https://www.learndmarc.com",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37729964",
    "commentBody": "",
    "originSummary": [
      "A \"DMARC tanulása és tesztelése\" konzol vizuálisan ábrázolja az e-mail kiszolgáló kommunikációját, és oktatja a felhasználókat az SPF (Sender Policy Framework), DKIM (DomainKeys Identified Mail) és DMARC (Domain-based Message Authentication, Reporting, and Conformance) rendszerekről.",
      "A felhasználók egy e-mail küldésével kezdhetik egy kijelölt címre, és lehetőségük van e-mailek meghamisítására, véletlenszerű példák betöltésére, DMARC-ismeretek tesztelésére és e-mail fejlécek beillesztésére.",
      "A platform garantálja, hogy a felhasználó e-mail címét kizárólag a DMARC beállításának ellenőrzésére használja, és nem tárol felhasználói adatokat."
    ],
    "commentSummary": [
      "A fórumbeszélgetés kiemeli a DMARC erősségeit és gyengeségeit egyaránt az e-mail hamisítás elhárításában, a résztvevők szerint a BIMI növelheti a biztonságot és vizuális logókat adhat a megbízható levelezéshez.",
      "Az SPF és a DKIM az e-mail hamisítással szembeni érzékenységét emelik ki, és a DMARC a sikeres hitelesítésükre támaszkodik, ami párbeszédet eredményez a kockázatkezelésről és az e-mail hitelesítési iparági szabványok javításáról.",
      "Bár a beszélgetés olyan témákat is érintett, mint az Apple \"Hide My Email\" szolgáltatása, az e-mail hibák, az elavult JavaScript kód, valamint az olyan protokollok, mint a TLS és az SSL jelentősége, a középpontban az e-mail biztonság növelése állt a hamisítással szemben."
    ],
    "points": 306,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1696190331
  },
  {
    "id": 37729163,
    "title": "12.000 éves élethű emberi szobrot tártak fel",
    "originLink": "https://arkeonews.net/new-discoveries-in-gobeklitepe-and-karahantepe-a-human-sculpture-with-a-realistic-facial-expression-found-in-karahantepe/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37729163",
    "commentBody": "",
    "originSummary": [
      "A törökországi Göbeklitepe és Karahantepe történelmi lelőhelyeken új leletek kerültek napvilágra, amelyek további betekintést nyújtanak az őskori művészetbe és az ősi településekbe.",
      "Göbeklitepe-ben egy festett vaddisznószobrot fedeztek fel, amelyről úgy vélik, hogy az első festett szobor a korszakból.",
      "Karahantepében egy élethű, realisztikus arckifejezésű emberi szobrot tártak fel, amely egy korábbi ásatáson felfedezett domborművet tükröz."
    ],
    "commentSummary": [
      "A régészek a törökországi Göbekli Tepe-ben egy 12 000 éves szobrot fedeztek fel, amely megkérdőjelezi az emberi civilizáció kezdetének hagyományos felfogását.",
      "A felfedezés azt jelzi, hogy a bonyolult műalkotások korábban is létezhettek, mint azt jelenleg gondolják, ami vitákat indít el az emberi civilizáció gyökereiről.",
      "A helyszínen nemrégiben felfedezett egyéb leletek, mint például kő megalitok és további szobrok, mélyebb betekintést engednek az ősi művészetbe és kultúrába, vitákat váltva ki az őskor meghatározásáról és a kormeghatározási módszerek pontosságáról."
    ],
    "points": 294,
    "commentCount": 165,
    "retryCount": 0,
    "time": 1696186290
  },
  {
    "id": 37728642,
    "title": "Rendben, lefuttatok egy regressziós elemzést, de nem leszel boldog tőle.",
    "originLink": "https://www.natesilver.net/p/fine-ill-run-a-regression-analysis",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37728642",
    "commentBody": "",
    "originSummary": [
      "A szerző úgy véli, hogy a nyilvános vitákban nagyobb súlya van az egyszerűsített elemzéseknek, amelyek a jelentős általános igazságokra összpontosítanak.",
      "A vita az államok pártállása, a COVID-19 oltási arányok és a halálozási arányok közötti összefüggés körül forog.",
      "Az elemzés azt mutatja, hogy a COVID-19 halálozási arányok közötti eltérés nagy részét az életkor és a vakcinázási arányok teszik ki a különböző államok között."
    ],
    "commentSummary": [
      "A megbeszélések a COVID-19 pandémiával kapcsolatos témák széles skáláját ölelték fel, mint például a védekezési intézkedések hatékonysága, a kórházi kapacitás, a politika hatásai, a pandémia által kiváltott szorongás és az állatállományra gyakorolt lehetséges hatása.",
      "A diskurzus ellentétes nézeteket és véleményeket emelt ki, amelyek között szerepelt a szkepticizmus és bizonyos kérdések alulértékelése, a megbízható adatok szükségességének hangsúlyozása, bizonyos témák nyílt megvitatásának nehézsége, valamint a konkrétabb kutatások és egészségügyi beruházások támogatása.",
      "Hangsúlyozza annak fontosságát, hogy a COVID-19 számtalan, a társadalomra gyakorolt hatásáról - különösen az egészségügyi ellátás és a szakpolitikai válaszok tekintetében - világos megértést és nyílt párbeszédet folytassunk."
    ],
    "points": 291,
    "commentCount": 270,
    "retryCount": 0,
    "time": 1696183468
  },
  {
    "id": 37724538,
    "title": "A Mozilla kapuzárási pánikja az úttörőből a Google furcsa szomszédjává változtatta a céget",
    "originLink": "https://www.theregister.com/2023/09/29/mozilla_asleep_at_wheel/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37724538",
    "commentBody": "",
    "originSummary": [
      "A teljesen nyílt forráskódú Firefox böngészőjéről és jelentős biztonsági kutatásairól ismert Mozillát az innováció hiánya és az elszalasztott lehetőségek miatt kritizálják.",
      "A szervezet a jelentések szerint elhagyott néhány értékes technológiát, és nem tudott kihasználni másokat, ami arra ösztönözte, hogy jobban odafigyeljen a power felhasználókra, és megkülönböztesse magát a versenytársaktól, például a Chrome-tól.",
      "A szerző arra bátorítja a Mozillát, hogy élesítse fel az elfeledett üzenetküldő kliensét, a Thunderbirdöt, és visszaemlékezik a múlt olyan befolyásos találmányaira, mint a Rust programozási nyelv és az eredeti Netscape webböngésző."
    ],
    "commentSummary": [
      "A megbeszélések középpontjában a Mozillát, a Firefoxot és a tágabb értelemben vett technológiai iparágat érintő különböző kérdések állnak, beleértve a Mozilla és a Google Chrome közötti versenyt, valamint a csökkenő piaci részesedéssel kapcsolatos aggodalmakat.",
      "Vita folyik a különböző webböngészők érdemeiről, viták a vezetői fizetések szervezetekre gyakorolt hatásáról, és találgatások a Mozilla szerepéről a Rust és a Thunderbird kapcsán.",
      "A beszélgetések között szerepelnek a Rust és a Go programozási nyelvek összehasonlítása, a Google versenyellenes gyakorlatának kritikája, valamint a Firefox használhatóságának, teljesítményének és reklámblokkoló képességeinek megvitatása a Chrome-hoz képest."
    ],
    "points": 280,
    "commentCount": 290,
    "retryCount": 0,
    "time": 1696156042
  },
  {
    "id": 37725498,
    "title": "A DALL-E 3 már nyilvánosan elérhető a Bingben",
    "originLink": "https://www.bing.com/images/create/?ref=hn",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37725498",
    "commentBody": "",
    "originSummary": [
      "A Bildersuche Image Creator a DALL-E segítségével mesterséges intelligencia (AI) technológia segítségével képes képeket generálni szöveges input alapján.",
      "Az eszköz a Microsoft Bing platformján érhető el, és használatával a felhasználók elfogadják a Microsoft Jutalmak és a Bing Image Creatorral együtt járó feltételeket.",
      "Az eszköz felhasználói a Microsoft Rewards és a Bing Image Creatorral kapcsolatos értesítéseket kapnak e-mailben."
    ],
    "commentSummary": [
      "A diskurzus középpontjában a DALL-E 3 áll, egy képgeneráló modell, amely most elérhető a Bing-en, és néhány vita a Discorddal szembeni használatáról, valamint az esetleges skálázhatósági és környezeti hatásbeli problémákról.",
      "A felhasználók felfedik a Bing és a ChatGPT iránti preferenciáikat, és megkérdőjelezik a Microsoft stratégiáit és tulajdonjogát az OpenAI-ban, miközben a tartalombiztonsági irányelveket is figyelembe veszik.",
      "Az AI fordítórendszerek elemei, a képgeneráló képességek, valamint a Bing Chat és a ChatGPT közötti különbségek szintén a megbeszélés részét képezték."
    ],
    "points": 273,
    "commentCount": 149,
    "retryCount": 0,
    "time": 1696165036
  },
  {
    "id": 37725530,
    "title": "A pulzárok, nem a sötét anyag magyarázza a Tejútrendszer antianyagát",
    "originLink": "https://bigthink.com/starts-with-a-bang/pulsars-dark-matter-milky-way-antimatter/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37725530",
    "commentBody": "",
    "originSummary": [
      "A NASA Fermi-műholdja felfedezte, hogy a Tejútrendszer középpontjából származó antianyag-részecskék bősége valószínűleg pulzároknak köszönhető, nem pedig sötét anyagnak, ahogy azt korábban feltételezték.",
      "A pulzárok, amelyek relativisztikus sugárzásaik és gyorsan mozgó anyaguk révén anyag-antianyag párokat hoznak létre, megkérdőjelezik azt a korábbi nézetet, hogy az antianyag forrása a sötét anyag.",
      "A tanulmány a Fermi műhold által készített legfrissebb, nagy felbontású, nagy energiájú kozmikus térképet használta fel, ami jelzi, hogy további vizsgálatokra van szükség a sötét anyag megfoghatatlan természetének megértéséhez."
    ],
    "commentSummary": [
      "A központi vita a sötét anyagra és annak a különböző csillagászati jelenségek magyarázatában játszott lehetséges szerepére összpontosít, jelezve a tudományos elméletek összetettségét és sokszínűségét.",
      "Felvetődik, hogy a pulzárok okozhatják az antianyagot a Tejútrendszerben, ami új perspektívát nyit az antianyag természetével és eredetével kapcsolatban.",
      "A párbeszéd hangsúlyozza a meglévő modellek korlátait és a sötét anyaggal kapcsolatos további kutatások szükségességét, kitérve a fénysebességre, az alternatív elméletekre és a bevált tudományos elméletekbe vetett bizalom jelentőségére is."
    ],
    "points": 230,
    "commentCount": 115,
    "retryCount": 0,
    "time": 1696165228
  },
  {
    "id": 37728990,
    "title": "A tiniket éjjel-nappal elárasztják a telefonos felszólítások, derül ki a kutatásból",
    "originLink": "https://www.nbcnews.com/health/health-news/teens-inundated-phone-prompts-day-night-research-finds-rcna108044",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37728990",
    "commentBody": "",
    "originSummary": [
      "A Common Sense Media jelentése aggodalmát fejezi ki a gyermekek és tinédzserek által naponta, többek között iskolaidőben és éjszaka kapott nagy mennyiségű értesítés miatt.",
      "A tanulmány kiemelte, hogy a 11 és 17 év közötti korosztály fele naponta legalább 237 értesítést kap, sőt egyesek 24 órán belül akár 5000-et is.",
      "A jelentés arra hívja fel a figyelmet, hogy az iskoláknak és a szülőknek segíteniük kell a gyermekek képernyőidő- és telefonhasználatának kezelésében, mivel az értesítések folyamatos áramlása potenciálisan hatással lehet a kognitív képességekre, a memóriára és a figyelemfelkeltésre."
    ],
    "commentSummary": [
      "A fő gondot az okostelefonokon a különböző alkalmazásokból érkező túlzott és irreleváns értesítések okozta kellemetlenségek jelentik, és a felhasználók frusztráltak a kontroll és a testreszabási lehetőségek hiánya miatt.",
      "Szigorúbb szabályozásra van szükség az alkalmazásfejlesztők számára, valamint harmadik féltől származó alkalmazások használatára a nem kívánt értesítések szűrésére.",
      "A megbeszélések rávilágítottak a gyermekek okostelefonjain megjelenő értesítések kezelésének kihívására és a túlzott technológiahasználat mentális egészségre gyakorolt lehetséges negatív hatásaira is."
    ],
    "points": 210,
    "commentCount": 313,
    "retryCount": 0,
    "time": 1696185356
  },
  {
    "id": 37724737,
    "title": "Soha ne mondj nemet, de ritkán mondj igent (2011)",
    "originLink": "https://longform.asmartbear.com/say-yes/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37724737",
    "commentBody": "",
    "originSummary": [
      "A szerző hangsúlyozza a figyelemelterelés elkerülésének és az elsődleges célokra és célkitűzésekre való koncentrálásnak a fontosságát.",
      "Ennek ellenére hangsúlyozzák az új lehetőségekre és ötletekre való fogékonyság fontosságát.",
      "Személyes tapasztalataikat osztják meg azzal kapcsolatban, hogy óvatosan minősítették jóváhagyásaikat, hogy megbizonyosodjanak arról, hogy azok összhangban vannak-e célkitűzéseikkel, és javasolják, hogy olyan javaslatok elfogadásának feltételeit határozzák meg, amelyek pozitívan átalakíthatják az üzleti tevékenységet."
    ],
    "commentSummary": [
      "A cikk azt tanácsolja, hogy a potenciális ügyfeleknek ritkán mondjunk igent, és tartsuk fenn az átláthatóságot a munkaköri korlátozásokkal kapcsolatban.",
      "Óva int attól, hogy magas árcédulát ragasszunk olyan munkákra, amelyekhez nincs tapasztalatunk vagy érdeklődésünk, mivel ez elégedetlen ügyfeleket eredményezhet.",
      "A hozzászólók szerint a jobban fizető, nem kívánatos feladatok elfogadása orvosolhatja az időhiányt, és hivatkoznak egy külön cikkre, amely az ügyfelek elégedettségének kiegyensúlyozását célzó hatékony tárgyalási stratégiákról szól."
    ],
    "points": 197,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1696158104
  },
  {
    "id": 37727129,
    "title": "A WFH jelentősen növelte a fogyatékkal élők munkaerő-piaci részvételét.",
    "originLink": "https://thehill.com/opinion/technology/4228100-does-working-from-home-damage-productivity-just-look-at-the-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37727129",
    "commentBody": "",
    "originSummary": [
      "A cikk a távmunka termelékenységre gyakorolt hatásait vizsgálja, és megállapítja, hogy a hibrid munkamodellek enyhe termelékenységjavulást eredményezhetnek, míg a teljesen távmunka kissé kedvezőtlen hatással lehet, hacsak nem kezelik megfelelően.",
      "A munka otthonról történő modell azonban jelentősen csökkentheti a vállalatok rezsiköltségeit, és ezáltal növelheti a nyereségességet.",
      "A cikk több tanulmányt és adatot emel ki, amelyek alátámasztják a távmunka termelékenységre és költségmegtakarításra gyakorolt pozitív hatását."
    ],
    "commentSummary": [
      "Az otthoni munkavégzés (WFH) foglalkoztatási lehetőségeket teremtett a fogyatékossággal élő személyek számára, lehetővé téve számukra, hogy újra bekapcsolódjanak a munkaerőpiacra.",
      "Viták folynak a WFH kereskedelmi ingatlanokra gyakorolt hatásáról és jelentőségéről, valamint arról a javaslatról, hogy ha a technológiai dolgozók elhagyják a városokat, akkor lakásokká alakítsák át őket.",
      "Aggodalmak merültek fel a társadalombiztosítási hivatal iránymutatásaiból és az online álláspályázatokból eredő elfogult gyakorlatok miatt, amelyek gyakran kérnek személyes adatokat annak ellenére, hogy ígérik, hogy azokat nem használják fel diszkriminációra."
    ],
    "points": 193,
    "commentCount": 50,
    "retryCount": 0,
    "time": 1696175702
  },
  {
    "id": 37728016,
    "title": "Az EU rákényszerítheti a hardvergyártókat, hogy készítsenek működő illesztőprogramokat Linuxhoz?",
    "originLink": "https://old.reddit.com/r/linux/comments/16wv53f/could_the_eu_force_hardware_manufacturers_to_make/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37728016",
    "commentBody": "",
    "originSummary": [
      "Az Európai Unió (EU) olyan rendeletek bevezetését fontolgatja, amelyek előírják a hardvergyártók számára, hogy a Linux, a népszerű nyílt forráskódú operációs rendszer számára teljesen működőképes illesztőprogramokat készítsenek.",
      "A vélemények megoszlanak arról, hogy miként lehetne a legjobban biztosítani a meghajtóprogramok elérhetőségét a Linux számára, a törvényi előírásoktól kezdve a meghajtóprogramok nyílt forráskódúvá tételén át az adókedvezmények felajánlásáig.",
      "A viták a nyílt forráskódú hardverrel kapcsolatos kihívások, a nyílt dokumentáció követelménye, a javíthatóság, valamint a magánélet védelme, a költségek, a piaci hatás és az innováció közötti egyensúly körül forognak. A vélemények megoszlanak azzal kapcsolatban, hogy szükség van-e uniós beavatkozásra ebben a kérdésben."
    ],
    "commentSummary": [
      "A vita középpontjában a technológiai ágazatban a szoftver- és hardvercégek szétválasztását célzó szabályozás alkalmazásának lehetősége áll.",
      "Az ilyen szabályozások célja a verseny elősegítése és a szállítói bezártság megakadályozása, bár aggályok merültek fel azzal kapcsolatban, hogy ezek az intézkedések hogyan befolyásolnák a felhasználói élményt és az innovációt.",
      "A vita szempontjai között szerepelnek a nyílt szabványok, az olyan technológiai óriások, mint az Apple és a Microsoft, az eszközkompatibilitás, a hardver-szoftver integráció és a kormányzati szerepvállalás. További pontok közé tartozik a javításhoz való jog és a hardvergyártókra vonatkozó szabályozás következményei."
    ],
    "points": 186,
    "commentCount": 273,
    "retryCount": 0,
    "time": 1696179992
  },
  {
    "id": 37725261,
    "title": "A MyPowerbank feltöri a Santander kerékpárokat, hogy a londoni hajléktalanok feltölthessék telefonjaikat",
    "originLink": "https://www.dezeen.com/2023/09/29/mypowerbank-hacks-santander-bikes-homeless-charge-phones/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=37725261",
    "commentBody": "",
    "originSummary": [
      "Luke Talbot tervező kifejlesztette a MyPowerbankot, egy hajléktalanoknak szánt hordozható telefontöltőt. A készüléket a kölcsönzött kerékpárokhoz lehet csatlakoztatni, és hátrafelé történő pedálozással lehet táplálni.",
      "A MyPowerbank a Transport for London Santander kerékpárjainak láncára illeszkedik. A pedálozás során keletkező energiát az akkumulátorok tárolják, és 25 perc pedálozással a telefon teljesen feltölthető.",
      "Talbot célja, hogy véglegesítse a tervezést a gyártáshoz, és egy jótékonysági vagy civil szervezettel együttműködve terjessze a töltőket a hajléktalanok között, akik gyakran nem férnek hozzá megbízható töltőforrásokhoz."
    ],
    "commentSummary": [
      "A MyPowerbank nevű londoni projekt a Santander kerékpárjait alakította át, hogy a hajléktalanok feltölthessék telefonjaikat.",
      "A kezdeményezés vitát váltott ki a megvalósíthatóságáról és hatékonyságáról, és rávilágított arra, hogy a hajléktalanok számára is szükség van elérhető telefontöltési lehetőségekre.",
      "A vita hangsúlyozta a hajléktalanság szélesebb körű társadalmi következményeit és az alacsony jövedelműek küzdelmeit."
    ],
    "points": 183,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1696163057
  }
]
