[
  {
    "id": 39205020,
    "title": "Sonsuz El Sanatları: Doğa Unsurlarını Kolaylıkla Yaratın ve Sıralayın",
    "originLink": "https://neal.fun/infinite-craft/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39205020",
    "commentBody": "",
    "originSummary": [
      "Uygulamanın konsepti su, ateş, rüzgar ve toprak gibi elementleri sürükleyerek manipüle etmeyi içeriyor.",
      "Uygulama ayrıca zamana göre bir sıralama özelliği de içeriyor.",
      "Bu uygulama, kullanıcıların farklı öğelerle etkileşime girmesine ve bunları zamana dayalı bir sıralama sistemine göre düzenlemesine olanak tanır."
    ],
    "commentSummary": [
      "Konuşma, kullanıcıların yeni öğeler veya kavramlar oluşturmak için öğeleri birleştirmelerine olanak tanıyan bir oyun veya web sitesine odaklanmaktadır.",
      "Katılımcılar oyunla ilgili deneyimlerini, kullanılan yapay zeka modellerini tartışıyor ve oyunu geliştirmenin yollarını öneriyor.",
      "Kombinasyonlar hakkında farklı görüşler vardır; bazıları bunları saçma bulurken diğerleri yaratıcılığı ve yeniliği takdir etmektedir. Diğer benzer oyunlardan ve arayüzün geliştirilmesine yönelik önerilerden de bahsedilmektedir."
    ],
    "points": 913,
    "commentCount": 423,
    "retryCount": 0,
    "time": 1706715268
  },
  {
    "id": 39210507,
    "title": "Evrenden Daha Büyük PDF'ler Oluşturmak: Adobe Acrobat'ın Sınırlarını Keşfetmek",
    "originLink": "https://alexwlchan.net/2024/big-pdf/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39210507",
    "commentBody": "",
    "originSummary": [
      "Yazar, PDF belgeleri için maksimum boyut sınırını araştırıyor ve Adobe Acrobat'ın 381 kilometreye 381 kilometrelik bir sınır belirlediğini tespit ediyor.",
      "Yazar, PDF'lerin iç yapısını keşfediyor ve sayfa boyutunu ve kullanıcı birimini değiştirerek daha büyük PDF'ler oluşturmak için bunları manuel olarak nasıl düzenleyeceğini öğreniyor.",
      "Ancak, kullanıcı birimi değerinin yaygın olarak kullanılmadığı ve çoğu PDF belgesi için pratik etkileri olmayabileceği belirtilmektedir. Yazar, tüm evrenden daha büyük olduğunu iddia eden bir PDF oluşturur, ancak bunun gerçek dünyada herhangi bir önemi olmayabilir."
    ],
    "commentSummary": [
      "Makale ve yorumlar PDF dosyalarının faydaları, sınırlamaları ve güvenlik endişeleri gibi çeşitli yönlerini ele alıyor.",
      "Doğru sıfır sayısı, milyon ve milyar arasındaki ayrımlar ve PDF standartları gibi konularda teğetler ortaya çıkıyor.",
      "Tartışmalar ayrıca Google Maps, Windows'ta baskı sorunları, Umberto Eco'nun eserleri ve evrenin ölçeği gibi çeşitli konulara da değiniyor. Sohbet, bir PDF'in boyutunu Almanya ile karşılaştırarak ve ülkenin tarihsel kör noktalarını tartışarak sona eriyor."
    ],
    "points": 479,
    "commentCount": 81,
    "retryCount": 0,
    "time": 1706741267
  },
  {
    "id": 39205676,
    "title": "Y Combinator CEO'sunun çevrimiçi atıp tutması tehditlere ve polis raporlarına yol açtı",
    "originLink": "https://missionlocal.org/2024/01/y-combinator-ceo-garry-tans-online-rant-spurs-threat-to-supe-police-reports/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39205676",
    "commentBody": "",
    "originSummary": [
      "Y Combinator CEO'su Garry Tan, yedi San Francisco denetçisinin yavaş yavaş ölmesini dilediği bir sosyal medya paylaşımı nedeniyle eleştirilere maruz kaldı.",
      "Müfettişler evlerine tehdit mektupları almış, bunun üzerine ikisi polise şikayette bulunmuştur.",
      "Tan daha sonra özür diledi ancak bu olay kamu görevlilerinin güvenliği ve ifade özgürlüğünün sınırları hakkında bir tartışmanın fitilini ateşledi."
    ],
    "commentSummary": [
      "Konuşma, Y Combinator CEO'su Garry Tan'ın sarhoşken yaptığı atıp tutmalar, saldırgan tweetler ve tehditler de dahil olmak üzere tartışmalı eylem ve açıklamaları etrafında dönüyor.",
      "Tartışmalar ifade özgürlüğünün sonuçlarını, CEO'ların rol ve sorumluluklarını ve onlarda gelişebilecek potansiyel olumsuz özellikleri inceliyor.",
      "Sohbet aynı zamanda siyasi bağlantılar, teknoloji endüstrisinin imajı, medya kapsamı ve stokastik terörizm kavramını da ele alarak zorunlu oylama, sansür ve hükümet içindeki güç dinamikleri hakkında tartışmalara yol açıyor."
    ],
    "points": 418,
    "commentCount": 526,
    "retryCount": 0,
    "time": 1706718376
  },
  {
    "id": 39208213,
    "title": "GPT-4'e rakip olabilecek yeni açık kaynaklı yapay zeka modeli sızdırıldı",
    "originLink": "https://venturebeat.com/ai/mistral-ceo-confirms-leak-of-new-open-source-ai-model-nearing-gpt-4-performance/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39208213",
    "commentBody": "",
    "originSummary": [
      "Açık kaynak yapay zeka topluluğu, Parisli bir yapay zeka şirketi olan Mistral'den sızdırılan \"miqu-1-70b\" adlı açık kaynak büyük dil modelinin (LLM) keşfiyle çalkalanıyor.",
      "Sızdırılan model, LLM görevlerindeki etkileyici performansıyla dikkat çekti ve OpenAI'nin GPT-4'üne rakip olma veya onu geçme potansiyeline sahip.",
      "Sızdırılan model başarılı olursa, OpenAI'nin abonelik katmanlarına önemli bir rekabet oluşturabilir, ancak OpenAI GPT-4 Turbo ve GPT-4V ile hala bir avantaja sahip."
    ],
    "commentSummary": [
      "Bir yapay zeka şirketi olan Mistral'in CEO'su, GPT-4 ile rekabet eden yeni açık kaynaklı yapay zeka modellerinin sızdığını kabul etti.",
      "Kullanıcılar, test ve üretim amaçlı çeşitli niceleme formatlarının yanı sıra ollama/llama.cpp programını, Mistral'in OpenAI'ye kıyasla performansını ve bağlam ve çıktı için belirteçlerin kullanımını tartışıyor.",
      "Konuşmada ayrıca dil modellerinde büyük bağlam boyutlarının sınırlamaları, GPT-4 eğitiminin maliyeti ve yetenekleri, Mistral'in pazardaki konumu, yapay zeka modellerinde önyargı ve değerlendirmeyle ilgili endişeler, Mixtral'in performansı, dil modellerinin filigranlanması ve \"açık kaynak\" tanımı ve yanlış kullanımı da ele alınıyor."
    ],
    "points": 343,
    "commentCount": 231,
    "retryCount": 0,
    "time": 1706729534
  },
  {
    "id": 39204918,
    "title": "The Far Side Comics: Günlük güncellenen klasik mizah taşları",
    "originLink": "https://www.thefarside.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39204918",
    "commentBody": "",
    "originSummary": [
      "Mizahıyla tanınan Far Side çizgi romanları, klasik seçkilerle her gün güncelleniyor.",
      "Karikatürler, karınca dünyasındaki garip anlar ve Alfred Hitchcock'un \"The Birds\" filmine bir selam gibi bir dizi komik durumu ele alıyor.",
      "Günlük güncellemelere ek olarak, koleksiyon önceki günün çizgi romanlarını, çizgi roman koleksiyonlarını ve diğer karikatüristlere ve karikatürlere referansları içerir."
    ],
    "commentSummary": [
      "Bu tartışma forumuna katılanlar Gary Larson'ın \"The Far Side\" adlı çizgi romanına duydukları hayranlığı paylaşıyor ve en sevdikleri çizgi romanlar ve Larson'ın eserinin kültürel önemi hakkında sohbet ediyorlar.",
      "Tartışma, Larson'ın yakın zamanda çizime dönüşü, paleontoloji üzerindeki etkisi ve bulmacalara katılımı da dahil olmak üzere çeşitli diğer konulara uzanıyor.",
      "\"The Far Side\" ve teknoloji endüstrisi arasındaki bağlantı, Larson'ın karakterlerinde bulunan benzersiz çizim tarzı ve mizahla birlikte keşfediliyor."
    ],
    "points": 339,
    "commentCount": 127,
    "retryCount": 0,
    "time": 1706714826
  },
  {
    "id": 39206529,
    "title": "Sega Yapay Zeka Bilgisayarı: Nadir ve Etkili Sistemin Açığa Çıkarılması",
    "originLink": "https://www.smspower.org/SegaAI/Index",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39206529",
    "commentBody": "",
    "originSummary": [
      "1986'dan kalma nadir ve belirsiz bir sistem olan Sega AI Computer, romlarının, veri dökümlerinin, taramalarının ve fotoğraflarının yayınlanmasının ardından ilgi konusu haline geldi.",
      "Yapay zeka yetenekleriyle eğitim amaçlı tasarlanan bilgisayar, öncelikle Japon okullarına satıldı ve sınırlı bir sürümü oldu.",
      "Sega AI Computer gelecekteki Sega platformlarını etkilemiştir ve artık MAME aracılığıyla taklit edilebilmektedir. Game Preservation Society ve SMS Power! gibi kuruluşlar bu sistemin korunmasında ve araştırılmasında etkili olmuştur ve devam eden koruma çabalarını desteklemek için bağışlar teşvik edilmektedir."
    ],
    "commentSummary": [
      "Konuşmada Sega AI bilgisayarı, Sega yapımı bir projektör ve Sega konsolları için nostalji gibi Sega ile ilgili birçok konu tartışılıyor.",
      "Sega Master System'in popülerliğini, retro oyun donanım ve yazılım tasarımını ve Dreamcast'in teknolojik ilerlemelerini araştırıyor.",
      "Konuşmada ayrıca oyunların teknoloji üzerindeki etkisinden ve 1986'daki yapay zeka kışından da kısaca bahsediliyor."
    ],
    "points": 256,
    "commentCount": 47,
    "retryCount": 0,
    "time": 1706721768
  },
  {
    "id": 39208673,
    "title": "Blogumu Neden IPFS'den Sunucuya Taşıdım?",
    "originLink": "https://neimanslab.org/2024-01-31/why-i-moved-my-blog-ipfs-to-server.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39208673",
    "commentBody": "",
    "originSummary": [
      "Yazar, bloglarını IPFS'den (Gezegenler Arası Dosya Sistemi) geleneksel bir sunucuya taşıma kararlarını açıklıyor.",
      "IPFS ile kişisel düğümler yerine ağ geçitlerine güvenmek ve tarayıcılarda içerik güncelleme ve kullanılabilir hale getirme zorlukları gibi zorluklarla karşılaştılar.",
      "Yazar, IPFS'nin potansiyeline hala inanmasına rağmen, kişisel bloglama ihtiyaçlarını karşılamadığını fark etti."
    ],
    "commentSummary": [
      "IPFS (Gezegenler Arası Dosya Sistemi), uygulama geliştirme ekosistemlerinde bir tartışma konusudur ve kullanıcılar dosyaları barındırmak için kararlılığını ve güvenilirliğini övmektedir.",
      "IPFS ile ilgili kaynak tüketimi ve ölçeklenebilirlik sorunları konusunda bazı endişeler dile getirilmektedir.",
      "Konuşmada ayrıca alternatif merkezi olmayan depolama çözümleri ve isim çözümlemesi için blok zincirinin sınırlamaları ele alınıyor, web sitelerini barındırmak ve dosya paylaşmak için merkezi olmayan teknolojilerin kullanılmasının faydaları ve zorlukları vurgulanıyor."
    ],
    "points": 251,
    "commentCount": 137,
    "retryCount": 0,
    "time": 1706731622
  },
  {
    "id": 39204314,
    "title": "Makaronlar: Token Tabanlı Kimlik Doğrulamada Geliştirilmiş Güvenlik ve Esneklik",
    "originLink": "https://fly.io/blog/macaroons-escalated-quickly/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39204314",
    "commentBody": "",
    "originSummary": [
      "Makaronlar, yetkilendirmeyi kısıtlamak için uyarı adı verilen taleplerle birlikte HMAC imzalı taşıyıcı belirteçleri kullanan bir tür güvenlik belirteci sistemidir.",
      "Uyarıların sıralanması önemli değildir ve bir talebin başarılı olması için tüm uyarıların geçmesi gerekir.",
      "Makaronlar, kullanıcı tarafından düzenlenebilir ve JIT tarafından oluşturulmuş belirteçlere izin vererek basit taşıyıcı belirteçlerin güvenlik açıklarını giderir.",
      "Genel bulut platformları için izin sistemlerinde uygulanabilir ve birinci ve üçüncü taraf uyarıları için kullanılabilir.",
      "Üçüncü taraf uyarıları ile belirteçlerin oluşturulması ve doğrulanması için kod uygulaması da tartışılmaktadır.",
      "Makaronlar Fly.io gibi platformlarda ve çalışan sunucular için token tabanlı kimlik doğrulama sistemlerinde kullanılır.",
      "Genel olarak, Makaronlar gelişmiş güvenlik, esneklik ve farklı kimlik sağlayıcılarını bir araya getirme olanağı sunar."
    ],
    "commentSummary": [
      "Makaronlar, çeşitli sistemlerde kullanılan bir tür kimlik doğrulama ve yetkilendirme mekanizmasıdır.",
      "Konuşma, makaron kullanımının avantaj ve dezavantajlarının yanı sıra sınırlamalarını ve farklı sorun alanları için uygunluğunu vurgulamaktadır.",
      "Google'ın makaronlar için patent sahibi olması, açık kaynak kullanımlarını dava etmeme iddialarına şüpheyle yaklaşılmasına yol açıyor.",
      "Alternatif kimlik doğrulama belirteç sistemleri ile birlikte makaron kullanımının uygulanması ve zorlukları tartışılmaktadır.",
      "Konuşmada kısaca makaron (kimlik doğrulama mekanizması) ile makaron (yemek ikramı) arasındaki karışıklıktan ve bunların kökenlerinden bahsediliyor.",
      "Ele alınan diğer konular arasında token güvenliği, erişim kontrolü, dokümantasyon ve Fly platformu yer almaktadır."
    ],
    "points": 244,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1706711959
  },
  {
    "id": 39206731,
    "title": "Teknik Mülakatlarda ChatGPT: Hile Yapmaya Karşı Bir Uyarı",
    "originLink": "https://interviewing.io/blog/how-hard-is-it-to-cheat-with-chatgpt-in-technical-interviews",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39206731",
    "commentBody": "",
    "originSummary": [
      "Teknik görüşmelerde ChatGPT kullanımının hile üzerindeki etkisini inceleyen bir deney.",
      "Çalışma, ChatGPT kullanan adayların tespit edilmeden hile yapabileceğini ortaya çıkararak sektörde endişelere yol açtı.",
      "Orijinal ve özelleştirilmiş mülakat sorularının hile yapılmasını önlemede etkili olduğu görülmüştür ve şirketler gerçek mühendislik becerilerini değerlendiren ilgi çekici sorular oluşturmaya teşvik edilmektedir."
    ],
    "commentSummary": [
      "Yapay zeka, özellikle de ChatGPT, kodlama iş görüşmelerinde kullanılıyor ve bu da adilliği ve etkinliği konusunda bir tartışmaya yol açıyor.",
      "Bazıları bunun sahtekârlık veya hile olduğunu savunurken, diğerleri bunu pratik ve dürüst bir yaklaşım olarak görüyor.",
      "Tartışma, yapay zeka araçlarının problem çözme becerilerini doğru bir şekilde değerlendirip değerlendiremeyeceği ve dış referanslara ve açık kaynaklı projelere izin verilip verilmeyeceği etrafında yoğunlaşıyor."
    ],
    "points": 193,
    "commentCount": 362,
    "retryCount": 0,
    "time": 1706722509
  },
  {
    "id": 39209814,
    "title": "DeepSeek Coder: Zahmetsizce Kod Yazan Yapay Zeka Modeli",
    "originLink": "https://deepseekcoder.github.io/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39209814",
    "commentBody": "",
    "originSummary": [
      "DeepSeek Coder, hem İngilizce hem de Çince kod ve doğal dil işleme için tasarlanmış bir yapay zeka dil modelidir.",
      "Çeşitli model boyutlarında gelir ve kodlama kıyaslamalarında güçlü performans göstermiştir.",
      "DeepSeek Coder açık kaynak kodludur ve araştırma ve ticari amaçlar için serbestçe kullanılabilir ve kullanım talimatları web sitelerinde bulunabilir."
    ],
    "commentSummary": [
      "Tartışma, kod eşleme, yeniden düzenleme ve hata izleme gibi görevler için ChatGPT, Bard, ollama ve DeepSeek gibi yapay zeka kodlama araçlarının ve hizmetlerinin kullanımına odaklanıyor.",
      "Bazı katılımcılar olumlu deneyimler yaşarken, diğerleri sınırlamalarla karşılaştı ve tekrarlayan görevler için bir Langchain kurulumu veya yardımcı pilot ile Geri Alım-Artırılmış Üretim (RAG) kullanma gibi önerilerde bulundu.",
      "Kodlamada yapay zekanın geleceği araştırılmış, doğruluk ve insan uzmanlığının önemi ile ilgili endişeler vurgulanmıştır. API spesifikasyonları, kod oluşturma modelleri ve farklı YZ modellerini kullanmanın ölçeklenebilirliği ve zorlukları da tartışılmaktadır. Yapay zeka destekli çeşitli kodlama araçları ve hizmetleri arasında performans, kullanım kolaylığı ve belirli yeteneklere dayalı karşılaştırmalar yapılmaktadır."
    ],
    "points": 182,
    "commentCount": 45,
    "retryCount": 0,
    "time": 1706737420
  },
  {
    "id": 39204622,
    "title": "RavenDB'nin ACID İşlemleri Mercek Altında: Tutarsız ve Kafa Karıştırıcı Davranışlar Ortaya Çıktı",
    "originLink": "https://jepsen.io/analyses/ravendb-6.0.2",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39204622",
    "commentBody": "",
    "originSummary": [
      "Dağıtık bir belge veritabanı olan RavenDB'nin ACID işlemlerini desteklemesi ve bu garantileri karşılamadaki tutarlılığı endişelere yol açmıştır.",
      "Testler, kayıp güncellemeler, kırık okumalar ve tutarlılık modeli ihlalleri gibi güvenlik hatalarını ortaya çıkararak RavenDB'deki işlemlerin ve oturumların davranışı hakkında soru işaretleri yarattı.",
      "Kullanıcılara işlemlerini yeniden değerlendirmeleri, testler yapmaları ve uygulama değişmezlerinin korunduğundan emin olmaları tavsiye edilir. RavenDB, güvenlik özellikleri hakkında daha net bilgiler sağlamalı ve pazarlama materyallerinden yanlış iddiaları kaldırmalıdır. İşlemlerin ve oturumların sınırlarının yanı sıra hata toleransı, ikincil indeksler ve çapraz shard işlemleriyle ilgili endişeleri netleştirmek için daha fazla araştırmaya ihtiyaç vardır. Ağ bölümleri RavenDB'nin performansını etkileyebilir."
    ],
    "commentSummary": [
      "RavenDB kullanıcıları, eski okumalar, kayıp yazmalar ve rastgele veri kaybolması ile ilgili sorunlar bildirmiş ve bazılarının SQL Server veya MartenDb gibi diğer veritabanlarına geçmesine neden olmuştur.",
      "Tartışma, veritabanlarında çoğaltma, atomik taahhüt ve eşzamanlılık kontrolü gibi konulara değiniyor ve yazar, yalnızca çoğaltmaya güvenmenin en iyi çözüm olmayabileceğini öne sürüyor.",
      "Havacılık endüstrisinde görülen güvenlik kültürü ve mühendislik disiplini eksikliği, veritabanı alanıyla karşılaştırıldığında, RavenDB gibi veritabanlarının doğruluğu, dayanıklılığı ve karmaşıklığı konusunda endişelere yol açmaktadır."
    ],
    "points": 182,
    "commentCount": 63,
    "retryCount": 0,
    "time": 1706713451
  },
  {
    "id": 39209469,
    "title": "Comcast, Yanıltıcı İddiaların Ardından \"Xfinity 10G Network\" Marka Adını Bırakacak",
    "originLink": "https://arstechnica.com/tech-policy/2024/01/comcast-to-stop-calling-entire-network-10g-as-name-is-ruled-misleading/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=39209469",
    "commentBody": "",
    "originSummary": [
      "Comcast, \"Xfinity 10G Network\" marka adını, yanıltıcı olduğuna karar verilen bir temyiz başvurusunu kaybetmesinin ardından kullanmayı bırakacak.",
      "\"10G\", mevcut kablo ağlarından daha hızlı olan potansiyel 10Gbps geniş bant bağlantılarını ifade etmektedir.",
      "Ulusal Reklam İnceleme Kurulu (NARB), Comcast'in 5G ağlarına kıyasla üstün hız iddiasının desteklenmediğine karar vererek, kafa karışıklığını vurguladı ve 5G kablosuz ağları etrafındaki aldatmacaya karşı çıktı."
    ],
    "commentSummary": [
      "Comcast, \"10G Ağı\" hakkındaki aldatıcı iddiaları nedeniyle eleştirildi ve bunları durdurmayı kabul etti.",
      "Müşteriler ve eleştirmenler Comcast'i kötü hizmet ve yanlış vaatlerde bulunmakla suçlarken, şikayetler fatura sorunlarından hizmet iptalinde yaşanan zorluklara kadar uzanıyor.",
      "ABD genişbant pazarındaki rekabet eksikliği, yüksek fiyatlar ve yüksek hızlı seçeneklerin sınırlı bulunabilirliği konusunda endişelere yol açmıştır. Bazıları, daha hızlı ve daha uygun fiyatlı internet hizmetleri için potansiyel bir çözüm olarak topluluk tabanlı telekomünikasyon şirketlerini önermektedir."
    ],
    "points": 176,
    "commentCount": 105,
    "retryCount": 0,
    "time": 1706735413
  }
]
