[
  {
    "id": 41612154,
    "title": "صنفرة واجهة المستخدم",
    "originLink": "https://blog.jim-nielsen.com/2024/sanding-ui/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41612154",
    "commentBody": "",
    "originSummary": [
      "يصف المؤلف عملية التطوير التكرارية الخاصة بهم، مشبهاً إياها بالنجارة، حيث يقومون بالبناء والاختبار والتعديل حتى يصبح البرنامج سلساً وخالياً من المشاكل.",
      "تحدٍ حديث تضمن محاذاة خيارات الراديو باستخدام فليكس بوكس، حيث كانت هناك فجوة بين زر الراديو والتسمية تمنع التبديل؛ تم حل هذه المشكلة بإزالة الفجوة وإضافة حشوة إلى التسمية.",
      "يؤكد على أهمية الاختبار الشامل والتنقيح لضمان تجربة مستخدم سلسة، مشيرًا إلى أن المشكلات الصغيرة يمكن أن تؤثر بشكل كبير على قابلية الاستخدام العامة."
    ],
    "commentSummary": [
      "تسلط المناقشة الضوء على تحدي معالجة مشكلات واجهة المستخدم البسيطة في بيئات التطوير الرشيق، حيث غالبًا ما تظل هذه المشكلات غير مُبلَّغ عنها وغير مُعطاة الأولوية.",
      "هناك جدل حول ما إذا كانت منهجيات أجايل تتجاهل بطبيعتها هذه الإصلاحات الصغيرة أم أن الأمر يتعلق بمشكلة ثقافية أوسع داخل الشركات التي تعطي الأولوية للإنتاج السريع على حساب الجودة.",
      "يجادل بعض المشاركين بأن التواصل المباشر بين المطورين والمستخدمين يمكن أن يحسن جودة المنتج بشكل كبير، لكن هذا غالبًا ما تعيقه الهياكل والعمليات الإدارية."
    ],
    "points": 921,
    "commentCount": 295,
    "retryCount": 0,
    "time": 1726947380
  },
  {
    "id": 41614490,
    "title": "لقد سرقوا صوتي باستخدام الذكاء الاصطناعي",
    "originLink": "https://www.jeffgeerling.com/blog/2024/they-stole-my-voice-ai",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41614490",
    "commentBody": "",
    "originSummary": [
      "اتهم جيف جيرلينج شركة Elecrow باستخدام نسخة مقلدة بصوت الذكاء الاصطناعي الخاص به في مقاطع الفيديو الخاصة بهم دون موافقته، وهو ما يجده مقلقًا نظرًا لعلاقتهما الجيدة السابقة.",
      "لقد أكد على أهمية عدم استخدام صوت شخص ما دون إذن، واقترح توظيف فنانين صوتيين أو التعاون مع صانعي المحتوى بدلاً من ذلك.",
      "جيف غير متأكد من متابعة الإجراءات القانونية بسبب التكاليف وغياب سابقة قانونية واضحة لاستنساخ الصوت بواسطة الذكاء الاصطناعي بدون إذن، وقد اتصل بشركة Elecrow لحل المشكلة."
    ],
    "commentSummary": [
      "تم استنساخ صوت أحد مستخدمي يوتيوب باستخدام الذكاء الاصطناعي، مما أثار مخاوف بشأن إساءة استخدام الذكاء الاصطناعي لإنشاء محتوى مزيف وقد يكون ضارًا.",
      "تسلط المناقشة الضوء على المخاوف من استخدام الذكاء الاصطناعي للتحريض على العنف أو تدمير السمعة، خاصة في المجتمعات التي تكون فيها العواقب شديدة على التجديف أو الانتهاكات الأخلاقية المتصورة.",
      "تشمل المناقشة وجهات نظر حول ما إذا كان جعل أدوات الذكاء الاصطناعي أكثر سهولة يمكن أن يساعد الجمهور على أن يصبح أكثر تشككًا في المحتوى الرقمي، مقابل الاحتمال المتزايد للضرر بسبب سهولة إنشاء أدلة مزيفة واقعية."
    ],
    "points": 464,
    "commentCount": 350,
    "retryCount": 0,
    "time": 1726976950
  },
  {
    "id": 41612984,
    "title": "ماذا حدث لمنصات الكمبيوتر اليابانية؟",
    "originLink": "https://www.mistys-internet.website/blog/blog/2024/09/21/what-happened-to-the-japanese-pc-platforms/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41612984",
    "commentBody": "",
    "originSummary": [
      "في عصر 16 بت، كان لدى اليابان ثلاث منصات حاسوبية رئيسية: PC-98 من NEC، وFM Towns من Fujitsu، وX68000 من Sharp، وكانت PC-98 هي الأكثر شعبية.",
      "أدى الانتقال إلى نظام ويندوز إلى تراجع هذه المنصات حيث أصبحت إما أقل تميزًا أو غير متوافقة مع نظام التشغيل الجديد، في حين أن تحول سوق الألعاب إلى أجهزة الكونسول ثلاثية الأبعاد قلل من أهميتها بشكل أكبر.",
      "على الرغم من تراجع منصاتهم الفريدة، انتقل صانعو الكمبيوتر اليابانيون إلى إنتاج أجهزة الكمبيوتر الشخصية التي تعمل بنظام ويندوز القياسي، مما مكنهم من البقاء بشكل أفضل من نظرائهم الغربيين مثل كومودور وأتاري."
    ],
    "commentSummary": [
      "أثرت الأزمة الاقتصادية الآسيوية عام 1997 بشكل كبير على منصات الحواسيب الشخصية اليابانية، بما في ذلك معالج SuperH من شركة هيتاشي، مما أدى إلى شراكة مع شركة ميتسوبيشي لتشكيل شركة رينيساس.",
      "واجهت شركة Renesas صعوبات في مواصلة تطوير SuperH وفي النهاية حولت تركيزها إلى تصاميم جديدة.",
      "انخفض سوق أجهزة الكمبيوتر اليابانية بسبب مشاكل توافق البرمجيات، والضغوط الاقتصادية، وزيادة المنافسة من المعايير العالمية والشركات الغربية."
    ],
    "points": 249,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1726956361
  },
  {
    "id": 41615102,
    "title": "Nextcloud: تطبيقات السحابة مفتوحة المصدر",
    "originLink": "https://nextcloud.com/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41615102",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Nextcloud Hub 9، ويتميز بأدوات مدمجة مثل الملفات، والمحادثة، وبرامج المجموعة، والمكتب لتعزيز التعاون والتحكم في البيانات.",
      "توفر المنصة حلاً مستضافًا ذاتيًا مع خيارات قابلة للتخصيص والتوسع، لتلبية احتياجات مختلف القطاعات بما في ذلك القطاع العام، والمؤسسات، والتعليم.",
      "تشمل الميزات الجديدة مساعد ذكاء اصطناعي محلي لتوليد المحتوى وتلخيص البريد الإلكتروني، مما يؤكد التزام Nextcloud بالخصوصية والامتثال."
    ],
    "commentSummary": [
      "يتلقى Nextcloud، وهو منصة تطبيقات سحابية مفتوحة المصدر، مراجعات متباينة من المستخدمين، حيث يشيد البعض بوظائفه بينما ينتقده آخرون بسبب تعقيده ومشاكل الترقية.",
      "يبلغ المستخدمون عن تجارب متنوعة، تتراوح بين التشغيل السلس والتحديثات السهلة إلى الترقيات الكارثية التي تؤدي إلى فقدان البيانات، مما يبرز أهمية النسخ الاحتياطية والإدارة الحذرة.",
      "محاولة المنصة تقديم مجموعة واسعة من الميزات تؤدي إلى نقاشات حول ما إذا كان ينبغي عليها التركيز على الوظائف الأساسية لتحسين الموثوقية والأداء."
    ],
    "points": 236,
    "commentCount": 198,
    "retryCount": 0,
    "time": 1726987821
  },
  {
    "id": 41614663,
    "title": "Flappy Bird لنظام أندرويد، فقط بلغة C، أقل من 100 كيلوبايت",
    "originLink": "https://github.com/VadimBoev/FlappyBird",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41614663",
    "commentBody": "",
    "originSummary": [
      "نجح مطور في إنشاء نسخة مقلدة من لعبة Flappy Bird بلغة C لنظام أندرويد، حيث حقق حجم ملف APK أقل من 100 كيلوبايت، وهو حجم صغير بشكل ملحوظ لمثل هذه اللعبة.",
      "استُلهم المشروع من جهد مماثل في لغة C# وتضمن التغلب على تحديات تتعلق بنشاط Android Native وحجم ملف APK.",
      "شملت التطبيقات التقنية الرئيسية استخدام OpenSLES لتشغيل الصوت، وupng لفك تشفير الصور، وOpenGL ES 2 مع المظللات للرسم."
    ],
    "commentSummary": [
      "قام مطور بإنشاء نسخة مقلدة من لعبة Flappy Bird لنظام أندرويد باستخدام لغة C فقط، حيث أن حجم التطبيق بالكامل أقل من 100 كيلوبايت.",
      "يُظهر المشروع الإمكانية لإنشاء تطبيقات عالية الكفاءة وصغيرة الحجم، مما يتناقض مع الاتجاه السائد للتطبيقات الكبيرة والمتضخمة.",
      "تسلط المناقشة الضوء على التحديات التقنية والتحسينات المتعلقة بتقليل حجم التطبيق، مثل تقليل عدد الأسطر البرمجية وإدارة الموارد بكفاءة."
    ],
    "points": 229,
    "commentCount": 99,
    "retryCount": 0,
    "time": 1726979977
  },
  {
    "id": 41617431,
    "title": "تم إصدار Hy 1.0.0، لهجة Lisp الخاصة بلغة Python",
    "originLink": "https://github.com/hylang/hy/discussions/2608",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41617431",
    "commentBody": "",
    "originSummary": [
      "تم إصدار Hy 1.0.0، وهي لهجة Lisp للغة Python، بعد ما يقرب من 12 عامًا من التطوير، مما يمثل علامة فارقة هامة.",
      "Hy مدمج في بايثون، مما يسمح بالتكامل والاستخدام السلس داخل مشاريع بايثون.",
      "ستركز التحديثات المستقبلية على إصلاح الأخطاء، والتوافق مع إصدارات بايثون الجديدة، ودعم الميزات الجديدة دون كسر كود Hy 1.x.y الحالي."
    ],
    "commentSummary": [
      "تم إصدار Hy 1.0.0، وهي لهجة Lisp للغة Python، مما يسمح للمستخدمين بمزج كود Python وHy، وينتج في النهاية شيفرة بايت Python.",
      "المترجم مكتوب بلغة بايثون، يدعم نظام الاستثناءات في بايثون، لكنه يفتقر إلى توزيع مستقل، مما يدفع إلى مناقشات حول توثيق أوضح وتوافق الأدوات.",
      "يقدّر المجتمع التزام المشروع طويل الأمد والعناصر الطريفة، حيث يشارك المستخدمون تجاربهم ومشاريعهم باستخدام Hy."
    ],
    "points": 227,
    "commentCount": 46,
    "retryCount": 0,
    "time": 1727016182
  },
  {
    "id": 41613628,
    "title": "WP Engine ليس ووردبريس",
    "originLink": "https://wordpress.org/news/2024/09/wp-engine/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41613628",
    "commentBody": "",
    "originSummary": [
      "تعد WP Engine كيانًا منفصلًا عن WordPress، على الرغم من العلامة التجارية التي قد توحي بغير ذلك، وتستفيد من هذا الالتباس.",
      "تعطّل WP Engine نظام المراجعات في ووردبريس بشكل افتراضي لتوفير التكاليف، مما يضر بسلامة محتوى المستخدم ويتعارض مع وعد ووردبريس بحماية البيانات.",
      "يُنصح العملاء بالمطالبة بما لا يقل عن 3 مراجعات التي تسمح بها WP Engine أو النظر في مزودي استضافة بديلين للحفاظ على معايير أعلى داخل نظام WordPress البيئي."
    ],
    "commentSummary": [
      "انتقد مات مولينويج، الرئيس التنفيذي لشركة أوتوماتيك، شركة WP Engine لعدم مساهمتها في مشروع ووردبريس مفتوح المصدر على الرغم من تحقيقها إيرادات مشابهة لأوتوماتيك.",
      "ادعى موظف في WP Engine أن الإدارة تمنع المساهمات في ووردبريس بسبب أهداف مؤشرات الأداء الرئيسية وتم فصله لاحقًا، مما أدى إلى تصعيد المشكلة.",
      "تسلط الجدل الضوء على التوترات بين مبادئ المصدر المفتوح والممارسات التجارية المدفوعة بالربح، حيث تُتهم WP Engine بالاستفادة من ووردبريس دون تقديم شيء للمجتمع."
    ],
    "points": 213,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1726964185
  },
  {
    "id": 41614795,
    "title": "من الصعب التوصية باستخدام Google Cloud",
    "originLink": "https://ashishb.net/programming/google-cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41614795",
    "commentBody": "",
    "originSummary": [
      "تشهد Google Cloud تغييرات كبيرة، بما في ذلك إغلاق Google Container Registry (GCR) في عام 2025، ليتم استبداله بـ Artifact Registry (GAR) الأكثر تكلفة.",
      "يواجه المستخدمون صعوبات وعمليات تستغرق وقتًا طويلاً في نقل مشاريعهم من GCR إلى GAR، مما يزيد من الإحباط.",
      "على الرغم من تفوق Google Cloud في الهندسة وتجربة المستخدم، فإن التغييرات المتكررة والاضطرابات تجعل من الصعب التوصية بها مقارنة بـ AWS وMicrosoft Azure."
    ],
    "commentSummary": [
      "تاريخ جوجل كلاود في إيقاف الخدمات، مثل Google Domains، جعل المستخدمين حذرين ودفع الكثيرين للانتقال إلى بدائل مثل Cloudflare أو AWS Route 53.",
      "التغييرات المتكررة في واجهات برمجة التطبيقات والدعم الفني الضعيف للعملاء هي مشكلات كبيرة تساهم في تصور عدم موثوقية جوجل، على الرغم من امتلاكها لحلول تقنية متفوقة.",
      "غالبًا ما يتم تفضيل AWS وAzure على Google Cloud بسبب استقرارهما وتركيزهما الأفضل على العملاء، على الرغم من عيوبهما الخاصة."
    ],
    "points": 205,
    "commentCount": 144,
    "retryCount": 0,
    "time": 1726982488
  },
  {
    "id": 41611965,
    "title": "مستشعر ثاني أكسيد الكربون من إنفينيون يراقب جودة الهواء الداخلي",
    "originLink": "https://www.allaboutcircuits.com/news/infineons-co2-sensor-precisely-monitors-indoor-air-quality/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41611965",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يعد مستشعر ثاني أكسيد الكربون الجديد من إنفينيون فعالًا لمراقبة جودة الهواء الداخلي ولكنه أقل أداءً في الهواء الطلق مقارنةً بمستشعرات NDIR البصرية.",
      "تعتبر مستشعرات NDIR الصوتية الضوئية، مثل مستشعرات إنفينيون، حساسة للتغيرات في درجة الحرارة والضوضاء ذات التردد المنخفض، مما يجعلها أقل موثوقية في البيئات الخارجية.",
      "تُفضل أجهزة الاستشعار البصرية NDIR لأداء ثابت في الهواء الطلق، مما يبرز تحديات المعايرة والاعتبارات البيئية اللازمة لمراقبة دقيقة لثاني أكسيد الكربون."
    ],
    "points": 169,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1726945730
  },
  {
    "id": 41612049,
    "title": "ما هي الجسيمات؟ (2020)",
    "originLink": "https://www.quantamagazine.org/what-is-a-particle-20201112/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41612049",
    "commentBody": "",
    "originSummary": [
      "لقد تطور فهم الفيزيائيين للجسيمات من كونها أجسامًا نقطية إلى مفاهيم أكثر تعقيدًا مثل الدوال الموجية المنهارة، والإثارات الكمومية للحقول، وتمثيلات مجموعات التناظر.",
      "تصف ميكانيكا الكم ونظرية الحقل الكمومي الجسيمات على أنها موجات وإثارات للحقول، مع خصائص تُحدد بواسطة مجموعات التناظر مثل مجموعة بوانكاريه.",
      "تقترح النظريات الحديثة، بما في ذلك نظرية الأوتار وفرضية \"الشيء من الكيوبت\"، أن الجسيمات قد تكون أوتارًا مهتزة أو هولوغرامات للكيوبتات، بينما يسعى علماء الأمبليتود إلى تبسيط تفاعلات الجسيمات لفهم أعمق."
    ],
    "commentSummary": [
      "تدور المناقشة حول الطبيعة المعقدة للجسيمات في ميكانيكا الكم، مما يتحدى النظرة التقليدية للجسيمات ككرات صغيرة ويقدمها كإثارات في الحقول.",
      "يُعتبر مصطلح \"جسيم\" مضللًا؛ ففي نظرية الحقل الكمومي (QFT)، يُفهم الجسيم بشكل أفضل على أنه تجريد رياضي أو إثارة في الحقول، وليس كجسم مادي.",
      "تسلط المحادثة الضوء على الجدل المستمر وغياب الإجماع بين الفيزيائيين حول الطبيعة الأساسية للجسيمات والحقول، مما يعكس الفهم المتطور في الفيزياء الحديثة."
    ],
    "points": 156,
    "commentCount": 133,
    "retryCount": 0,
    "time": 1726946434
  },
  {
    "id": 41617663,
    "title": "\"لا أريد أن أموت.\" كان بحاجة إلى رعاية صحية نفسية. وجد شبكة أشباح.",
    "originLink": "https://www.npr.org/sections/shots-health-news/2024/09/21/nx-s1-5120543/mental-health-care-parity-insurance-ghost-network",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41617663",
    "commentBody": "",
    "originSummary": [
      "واجه رافي كوتينيو تحديات كبيرة في الوصول إلى الرعاية الصحية النفسية من خلال تأمينه من أمبيتر بسبب \"شبكة الأشباح\" من مقدمي الخدمات غير المتاحين.",
      "على الرغم من المحاولات المتعددة من قبل رافي ووالدته باربرا للعثور على معالج، واجهوا العديد من العقبات، مما أدى إلى تدهور الصحة النفسية وزيارات المستشفى.",
      "تؤكد تحقيقات ProPublica على القضايا النظامية في الوصول إلى الرعاية الصحية النفسية، حيث تساهم الأخطاء والتأخيرات في شبكات التأمين في وفاة رافي المأساوية عن عمر يناهز 36 عامًا بسبب مضاعفات تتعلق بالإفراط في الشرب."
    ],
    "commentSummary": [
      "رجل يبحث عن رعاية صحية نفسية وجد أن العديد من مقدمي الخدمات المدرجين من قبل تأمينه إما غير متاحين أو خارج الشبكة، وهي مشكلة شائعة تُعرف باسم \"شبكة الأشباح\".",
      "غالبًا ما تفشل شركات التأمين في الحفاظ على أدلة دقيقة، مما يعقد جهود المرضى في العثور على الرعاية ويسبب ضغوطًا كبيرة وأعباء مالية.",
      "يقترح البعض القضاء على الوسطاء في التأمين الصحي أو اعتماد نظام دافع واحد لمعالجة هذه الكفاءات، على الرغم من أن مقدمي الخدمات المتكاملة مثل كايزر بيرماننتي يواجهون تحديات في خدمات الصحة العقلية."
    ],
    "points": 139,
    "commentCount": 75,
    "retryCount": 0,
    "time": 1727018477
  },
  {
    "id": 41613722,
    "title": "عشرون عامًا من توليف الترددات داخل برنامج Ableton Live",
    "originLink": "https://roberthenke.com/technology/operator.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41613722",
    "commentBody": "",
    "originSummary": [
      "يحتفل روبرت هينك بالذكرى العشرين لأول جهاز توليف برمجي من Ableton، وهو Operator، من خلال مشاركة رؤى ونصائح وحزمة إعدادات مسبقة مجانية.",
      "تم تطوير Operator في عام 2004، وصُمم لتحقيق كفاءة في استخدام وحدة المعالجة المركزية وسهولة في البرمجة، ويتميز بعناصر مبتكرة مثل الوقت العالمي، والتحكم في النغمة، والتركيب الإضافي.",
      "تستخدم تقنية التوليف بالترددات (FM synthesis)، التي ابتكرها جون تشاونينغ في الستينيات، مذبذبات الموجة الجيبية لإنشاء أصوات معقدة، وتختلف عن التوليف الطرحي بعدم حاجتها إلى المرشحات."
    ],
    "commentSummary": [
      "كان لتقنية التوليف FM في برنامج Ableton Live، وخاصة من خلال مكون Operator، تأثير كبير على مدى العشرين عامًا الماضية، مما أثر على العديد من تقنيات VST (تكنولوجيا الاستوديو الافتراضي).",
      "يُشيد بتصميم العرض الجلسة مقابل عرض الترتيب الفريد للبرنامج بعمقه وواجهة المستخدم (UI) الخاصة به.",
      "تُحتفى مساهمات روبرت هينك، إلى جانب عروضه الحية وورش العمل التي يقدمها، لتأثيرها الكبير على مجتمع إنتاج الموسيقى."
    ],
    "points": 139,
    "commentCount": 21,
    "retryCount": 0,
    "time": 1726965753
  },
  {
    "id": 41614126,
    "title": "تحويل PDF إلى MD بواسطة LLMs – استخراج النصوص/الجداول/وصف الصور بواسطة GPT4o",
    "originLink": "https://github.com/yigitkonur/swift-ocr-llm-powered-pdf-to-markdown",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41614126",
    "commentBody": "",
    "originSummary": [
      "تم تطوير واجهة برمجة تطبيقات بايثون مفتوحة المصدر باستخدام GPT-4 للتعرف الضوئي على الحروف (OCR) في ملفات PDF، وتتميز بالمعالجة المتوازية والتعامل مع الدُفعات.",
      "تحول واجهة برمجة التطبيقات ملفات PDF إلى Markdown وتضيف تسميات توضيحية للصور، مما يظهر قدرتها من خلال معالجة الصفحات المعقدة بنجاح من وثائق أبولو 17 التابعة لناسا.",
      "المشروع متاح على GitHub، والمطور يسعى للحصول على ملاحظات من المجتمع."
    ],
    "commentSummary": [
      "تم تطوير خدمة API بلغة بايثون باستخدام GPT-4o للتعرف الضوئي على الحروف (OCR) في ملفات PDF، وتتميز بمعالجة متوازية والتعامل مع الدفعات، وتحويل ملفات PDF إلى تنسيق ماركداون ووصف الصور بالتعليقات التوضيحية.",
      "تم اختبار المشروع على وثائق أبولو 17 التابعة لناسا، وهو مفتوح المصدر على GitHub، لكن المستخدمين يبلغون عن مشكلات تتعلق بالاتساق والهلوسة في نماذج اللغة الكبيرة (LLMs)، مما يشير إلى أن التعرف الضوئي التقليدي على الحروف (OCR) قد يكون أكثر موثوقية للإنتاج.",
      "تُلاحظ الحلول بفعاليتها من حيث التكلفة، مع توفير مقارنات مفصلة لاستخدام الرموز والتكاليف."
    ],
    "points": 138,
    "commentCount": 54,
    "retryCount": 0,
    "time": 1726970738
  },
  {
    "id": 41614567,
    "title": "هل تقوم Cloudflare بتعطيل ملفات SVG الخاصة بي؟",
    "originLink": "https://www.lloydatkinson.net/posts/2024/stupid-problems-require-stupid-solutions-cloudflare-is-breaking-my-svgs/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41614567",
    "commentBody": "",
    "originSummary": [],
    "commentSummary": [
      "يبلغ المستخدمون عن مشكلات في عرض SVG (الرسومات المتجهة القابلة للتطوير) عند استخدام Cloudflare، خاصة مع الأطر المستندة إلى React مثل Astro وRemix.",
      "تبدو المشكلة متعلقة بعملية البناء التي لا تقوم بتحويل السمات من camelCase إلى hyphen-case، ولكنها ليست منتشرة على نطاق واسع وفقًا لموظفي Cloudflare.",
      "تقوم شركة كلاودفلير بالتحقيق في المشكلة بنشاط، ويُشجَّع المستخدمون على تقديم تفاصيل حساباتهم لإجراء المزيد من الاختبارات وحل المشكلة."
    ],
    "points": 133,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1726978307
  },
  {
    "id": 41612665,
    "title": "تهدف حوسبة التدفق إلى تعزيز وحدات المعالجة المركزية بوحدات المعالجة المتوازية",
    "originLink": "https://spectrum.ieee.org/parallel-processing-unit",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=41612665",
    "commentBody": "",
    "originSummary": [
      "قدمت شركة Flow Computing تقنية جديدة تسمى 'وحدات المعالجة المتوازية' (PPUs) التي تدعي أنها تجعل وحدات المعالجة المركزية أسرع بمئة مرة.",
      "تهدف هذه الابتكار إلى تعزيز أداء الحوسبة بشكل كبير من خلال الاستفادة من المعالجة المتوازية، التي تتيح تنفيذ مهام متعددة في وقت واحد.",
      "لقد حظي الإعلان باهتمام كبير نظرًا لإمكانيته في إحداث ثورة في سرعات وكفاءة وحدات المعالجة المركزية، مما يجعله تطورًا ملحوظًا في صناعة الحوسبة."
    ],
    "commentSummary": [
      "تقترح حوسبة التدفق دمج 'وحدات المعالجة المتوازية' (PPUs) مع وحدات المعالجة المركزية (CPUs) لتجنب أوقات انتظار البيانات، مما يعزز كفاءة المعالجة المتوازية.",
      "هذا المفهوم، الذي يذكرنا بالتقنيات السابقة مثل المعالجات المتعددة والخلايا المعالجة، يواجه تحديات في توازي المهام ولكنه يظهر وعدًا مع الشبكات العصبية.",
      "تناقش المقارنة بين وحدات المعالجة المتوازية (PPUs) والتقنيات الحالية مثل وحدات معالجة الرسومات (GPUs) وXeon Phi، مع التركيز على الإمكانيات والتعقيدات في دمج المعالجة المتوازية الحديثة."
    ],
    "points": 124,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1726952667
  }
]
