[
  {
    "title": "KCL, 지속 가능한 상품 포장재 가치 체인 구축을 위한 다자간 MOU 체결",
    "originLink": "http://www.kharn.kr/news/article.html?no=23605",
    "originBody": "",
    "originSummary": [
      "한국건설생활환경시험연구원(KCL)는 WWF 한국, 한국포장재재활용조합(KPRC), 그리고 세 소매 회사들과 함께 지속 가능한 제품 포장 가치 사슬 구축을 위한 다자간의 협의를 위한 양해각서(MOU)에 서명했습니다.",
      "이들 당사자들은 친환경 포장 기술 서비스를 제공하고, ESG 관리를 지원하며, 관련 업체에 판매를 촉진하겠다는 계획입니다. 특히 KCL은 포장재의 친환경성과 지속 가능성을 평가하는 지침을 마련할 계획입니다.",
      "이마트, 롯데 쇼핑, 홈플러스와 같은 소매 업체들은 친환경 포장의 사용을 확대하고 공급 업체들에게 동일하게 요구할 것을 약속했습니다. 이번 협정의 주요 내용에는 지속 가능한 포장 기준 설정, 친환경 포장 개선 사례 찾기와 연구, 그리고 반응형 연구 프로젝트를 촉진하는 것이 포함됩니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국건설생활환경시험연구원(KCL), WWF Korea, 한국포장재재활용협동조합(KPRC), 그리고 세 대형 유통업체들이 지속가능한 제품 포장가치 사슬을 구축하기 위한 협력에 관한 MOU를 체결했습니다.",
      "해당 협약에 따라 참여 당사들은 친환경 포장기술 서비스를 제공하고, ESG 경영을 지원하며, 관련 기업들에게 판매를 활성화하게 할 것입니다. 또한 KCL은 포장재의 친환경성 및 지속가능성을 평가하는 기준을 수립할 계획입니다.",
      "유통업체들(E-Mart, 롯데쇼핑, 홈플러스)은 친환경 포장재의 사용을 확대하고 공급업체들에게 그러한 변화를 촉구할 것입니다. 협약의 주요 내용에는 지속가능한 포장 기준 제정, 친환경 포장 개선 사례의 발굴과 연구, 그리고 적극적인 연구 프로젝트를 진행하는 것이 포함되어 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "포장재 재활용협동조합, 지속가능한 포장재 사용 증진 위해 대형 유통사와 협력",
    "originLink": "http://www.geconomy.co.kr/news/article.html?no=280300",
    "originBody": "",
    "originSummary": [
      "한국 포장재 재활용협동조합이 세계자연기금 한국 사무소, 이마트, 롯데마트, 홈플러스와 함께 제품 포장의 지속 가능한 사용을 증진하기 위해 협력하겠다고 밝혔습니다.",
      "이 계획은 제품 포장의 지속 가능한 표준을 개선하고, 선도적인 지속 가능한 포장 사례를 분석하며, 우수 제품 모니터링 및 홍보를 촉진하고, 적절한 연구 프로젝트를 수행하는 것을 포함합니다.",
      "이 계획의 목표는 제품 포장의 지속성을 공통 목표로 설정하고 자발적 협력 체제를 구축하는 것입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국 포장 재활용 협동조합은 제품 포장의 지속 가능한 사용을 강화하기 위해 세계 야생 동물 기금 한국 지부, 이마트, 롯데마트, 홈플러스와 한국 기술표준원과 협력하였습니다.",
      "이 프로젝트는 지속 가능한 제품 포장에 대한 표준 개선, 선도적인 지속 가능한 포장 사례 분석, 우수 제품 모니터링 및 홍보 촉진, 그리고 반응형 연구 프로젝트를 진행하는 것을 포함합니다.",
      "목표는 제품 포장의 지속 가능성을 공동 목표로 채택하기 위한 자발적 협력 체제를 구축하는 것입니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "흡음·충격 흡수 기능 갖춘 바닥포장재와 내구성 탁월한 도로포장재 바인더, KCC 신제품 출시",
    "originLink": "https://www.news1.kr/articles/?5225604",
    "originBody": "",
    "originSummary": [
      "KCC는 다양한 바닥재료에 적합한 소음 및 충격 흡수 기능이 있는 바닥 바인더와 내구성 및 탄성이 향상된 도로 포장재용 바인더 두 가지 새로운 제품을 출시했습니다.",
      "친환경 재료로 만든 바닥 바인더는 실내외 다목적 시설 및 아동 놀이 공간에 이상적이며, 도로 포장재용 바인더는 도로 소음과 운전 성능을 줄입니다.",
      "또한 도로 포장재용 바인더는 침투형 콘크리트 바닥에 사용될 때 도시 수자원 순환 문제를 해결하는데 도움이 될 것으로 보입니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "KCC가 다양한 바닥재료에 적합한 소리와 충격 흡수 기능을 가진 바닥 바인더 및 향상된 내구성과 탄성을 제공하는 도로 포장 바인더 두 가지 신제품을 출시했습니다.",
      "친환경 재료로 만든 바닥 바인더는 실내외 다목적 시설 및 어린이 놀이 공간에 이상적입니다.",
      "또한 도로 포장 바인더는 도로 소음 및 주행 성능을 줄이고, 침투 콘크리트 바닥에 사용될 때 도시 수 환경 문제 해결에 도움이 될 것으로 예상됩니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "강원조달청, 춘천 세원산업 방문 및 민생현장 소통 강화",
    "originLink": "https://www.kado.net/news/articleView.html?idxno=1212797",
    "originBody": "",
    "originSummary": [
      "기사에서는 정치부터 지역 행사에 이르기까지 한국의 실시간 뉴스를 다루는 이야기를 제공합니다.",
      "민주당 검찰관의 탄핵에 대한 이원석의 발언, 이수형의 재임명, 발달 장애 라이프사이클 지원에 대한 토크 콘서트, 철사가 검출된 피자 퀘사디아의 리콜등에 대해 언급하였습니다.",
      "또한 강원개발공사의 850% 부채 비율에 대한 해결책 모색, 춘천에서 장애인의 기본 이동권 요구, 춘천 검찰청과 춘천 피해자 센터 간의 회의, 강원도 내 전문콜리지의 두 번째 모집 그리고 남이섬이 2023년 대한민국 독서대상에서 수상한 사항 등이 기사에 포함되어 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한 기사에서는 정치부터 지역 행사에 이르기까지 다양한 주제의 한국의 실시간 뉴스를 다루고 있습니다.",
      "이에는 민주당 검사 탄핵에 대한 이원석의 인용문, 이수형의 재임명, 발달 장애 생애주기 지원을 위한 토크 콘서트, 그리고 알선채 선물들에 발견된 와이어로 인한 피자 퀘사디아의 리콜 등이 포함됩니다.",
      "추가로, 강원개발공사의 850% 부채 비율에 대한 솔루션 추진, 청운헌에서 장애인의 기본 이동권 요구, 청소년 검찰청과 청소년 피해자 센터 간의 회담, 강원도에서의 전문 대학 제2차 모집 등 다른 뉴스도 포함되어 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "한진, 아시아 스타 어워즈 2023 '에코 패키지' 카테고리에서 친환경 완충재 '그린와플'로 수상",
    "originLink": "http://www.gyotongn.com/news/articleView.html?idxno=349335",
    "originBody": "",
    "originSummary": [
      "한진은 그들의 친환경 충격 흡수 패키지 재료 '그린 와플'을 활용하여 '아시아 스타 어워즈 2023'의 '에코 패키지' 부문에서 수상하였습니다.",
      "이 제품은 환경 친화적이며 우수한 기능을 가진 것으로 평가받았으며, 종이 재료로 만든 또다른 친환경 물류 재료인 어셈블리 박스와 함께 판매되고 있습니다.",
      "한진은 최근에 ESG(환경, 사회, 지배구조) 통합 평가에서 A 등급을 획득하였습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한진이 생태적 패키지' 분류에서 '아시아 스타 어워드 2023'을 수상했습니다. 이런 수상은 한진의 친환경 충격 흡수 재료인 '그린 와플' 때문입니다.",
      "이 제품은 저번 년도 11월에 한진이 출시한 것으로 상품을 상자에 고정하는 역할을 합니다. 그린 와플은 환경 친화적이며, 뛰어난 기능으로 평가 받았으며, '어셈블리 박스'라는 다른 환경 친화적인 물류 재료와 함께 판매되고 있습니다.",
      "한진은 최근에 ESG (환경, 사회, 지배구조) 통합 평가에서 A 등급을 취득했습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "무림 P&P의 '무해' 종이물티슈, 2023 서울카페쇼 '최우수 지속가능 브랜드' 수상",
    "originLink": "https://biz.chosun.com/industry/company/2023/11/09/7W26QU4FENCTJH3L3CCEF6UOZI/",
    "originBody": "",
    "originSummary": [
      "무림P&P의 '무해' 종이 물티슈가 2023년 서울 카페쇼 공식 시상식 '엑셀런스 어워즈'에서 '최고의 지속 가능한 브랜드'로 선정되었습니다.",
      "이 종이 물티슈는 생분해 가능한 100% 천연 펄프로 제작되었고, 논위븐이나 폴리에스터와 같은 합성 섬유를 사용하지 않아 친환경적입니다.",
      "패키지는 친환경 수성 코팅 종이 패키지인 'Neofore Flex'를 사용하여 별도 배출 후 재활용이 가능합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "MuRim P&P의 'Moohae' 종이 물티슈가 2023 서울 카페 쇼의 공식 시상식인 'Excellence Awards'에서 '최고의 지속 가능한 브랜드'로 선정되었습니다.",
      "100% 자연 펄프(생분해 가능한)로 만들어진 이 종이 물티슈는 합성 섬유인 논원과 폴리에스터를 사용하지 않아 친환경적입니다.",
      "또한 포장재로는 분리 배출 후 재활용이 가능한 친환경 수성 코팅 종이 패키지인 'Neofore Flex'를 사용하였습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "이병철 강원지방조달청장, 세원산업과 민생현장에서 비즈니스 확장 논의",
    "originLink": "https://news.nate.com/view/20231109n35891?mid=n1101",
    "originBody": "",
    "originSummary": [
      "정부 공무원인 이병철과 바닥 커버링 회사 세원산업의 비즈니스 확장에 대한 논의를 포함한 다양한 주제에 대한 뉴스 업데이트가 제공되었습니다.",
      "이번 뉴스에서는 특히 여성이 운영하는 비즈니스에 주목하였습니다.",
      "디테일한 요약은 번역 문제로 인해 어려웠습니다. 그러나, 업데이트의 다른 부분은 엔터테인먼트 산업에 초점을 맞추고 있습니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "본 뉴스 업데이트에서는 정부 공무원인 이병철과 바닥청소 커버링 회사인 세원산업 간의 비즈니스 확장 토론에 대해 이야기하고 있습니다.",
      "특히, 여성이 운영하는 기업에 특별히 주목하고 있습니다.",
      "다른 업데이트 내용들은 엔터테인먼트 산업에 중점을 두고 있습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  },
  {
    "title": "무림P&P의 '무해 종이물티슈', 2023 서울카페쇼 엑셀런스 어워드 '최고의 지속가능 브랜드' 선정",
    "originLink": "http://www.biztribune.co.kr/news/articleView.html?idxno=296288",
    "originBody": "",
    "originSummary": [
      "한국의 펄프, 종이 및 신소재 회사인 Moorim P&P가 100% 천연 펄프 생분해 섬유인 'moohae' 종이 물티슈로 2023년 서울 카페쇼 우수상의 지속가능성 분야 최고 상을 수상했습니다.",
      "672개 참여 제품 중에서 '최우수 지속 가능성' 브랜드로 선정된 moohae 종이 물티슈는 100% 천연 펄프로 만든 진정한 생분해 종이 섬유를 특징으로, 일상 생활에서의 지속 가능성을 제공합니다.",
      "이번 인증은 Moorim P&P가 2020년에 그들의 친환경 종이 컵 'NeoFore CUP'으로 이기고 두 번째 우수상을 받는 것입니다. Moorim은 천연 생분해 성 원자재를 사용하여 합성 섬유를 대체하고 미세 플라스틱 worries 없이 사용할 수 있도록하는 지속 가능한 혁신을 자랑합니다."
    ],
    "commentBody": "",
    "commentSummary": [
      "한국의 종이 및 새로운 재료 회사 Moorim P&P가 100% 천연 펄프 생분해 섬유인 '무해' 화장지로 2023 서울 카페 쇼 우수상 지속가능성 부문에서 최고 상을 수상하였습니다.",
      "672개 참가 제품 중 '최우수 지속가능성' 브랜드로 선정된 무해 화장지는 100% 천연 펄프로 만든 진정한 생분해 섬유이며, 일상생활에서 지속 가능성을 제공합니다.",
      "이 인정은 Moorim P&P에게 2020년 친환경 종이컵 'NeoFore CUP'을 이용한 승리에 이어서 두 번째 우등상이며, 식음료 산업과 환경 필요성을 모두 충족시키면서도, 합성섬유를 대체하는 천연 생분해 원료를 사용하여 마이크로 플라스틱에 대한 걱정 없이 사용할 수 있다는 것을 과시했습니다."
    ],
    "downloadMethod": "",
    "retryCount": 0,
    "time": 1699538167541
  }
]
