[
  {
    "id": 40639506,
    "title": "Apple, Gelişmiş Aygıt İçi ve Sunucu Yapay Zeka Modelleriyle Apple Intelligence'ı Tanıttı",
    "originLink": "https://machinelearning.apple.com/research/introducing-apple-foundation-models",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40639506",
    "commentBody": "",
    "originSummary": [
      "Apple, 2024 Dünya Çapında Geliştiriciler Konferansı'nda iOS 18, iPadOS 18 ve macOS Sequoia'ya entegre edilen ve metin iyileştirme ve görüntü oluşturma gibi görevler için üretken modeller içeren kişisel bir zeka sistemi olan Apple Intelligence'ı tanıttı.",
      "Apple, kullanıcı verilerini korumak için aygıt üzerinde işlemeyi ve Özel Bulut İşlemeyi kullanarak kullanıcı yetkilendirmesine, gizliliğe ve verimli model performansına odaklanan sorumlu yapay zeka geliştirmeyi vurguluyor.",
      "Sistem, hız ve verimlilik için optimize edilmiş modellerle verimli eğitim için AXLearn çerçevesini kullanır ve göreve özgü performans için adaptörler adı verilen özel sinir ağı modülleri içerir."
    ],
    "commentSummary": [
      "Apple'ın Aygıt Üzerinde ve Sunucu Temel Modellerini duyurması karışık tepkiler aldı; eleştirmenler bunları mevcut yapay zeka tekniklerini yeniden paketlemekle suçlarken, destekçiler yerleşik teknolojilerin iyileştirilmesini ve yaygınlaştırılmasını övdü.",
      "Tartışma, Apple'ın çığır açan araştırmalara odaklanmak yerine \"Apple Silicon\" ve \"AirPort\" gibi mevcut teknolojileri rafine etme ve yaygınlaştırma stratejisini vurguluyor.",
      "Spekülasyonlar, Apple'ın silikon uzmanlığından yararlanarak bir yapay zeka çipi ile sunucu çipi pazarına girebileceğini öne sürerken, yüksek fiyatlandırma, temel modellerde minimum RAM ve sıkı ekosistem kontrolü konusundaki tartışmalar devam ediyor."
    ],
    "points": 862,
    "commentCount": 462,
    "retryCount": 0,
    "time": 1718055731
  },
  {
    "id": 40639606,
    "title": "Apple'ın Özel Bulut İşlemi iOS ve macOS için Yapay Zeka Gizliliğini ve Güvenliğini Geliştiriyor",
    "originLink": "https://security.apple.com/blog/private-cloud-compute/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40639606",
    "commentBody": "",
    "originSummary": [
      "Apple'ın Özel Bulut İşlemi (PCC), güvenlik ve gizliliğe güçlü bir şekilde odaklanarak iPhone, iPad ve Mac'e gelişmiş üretken yapay zeka modelleri sunuyor.",
      "PCC, uçtan uca şifreleme, geçici işleme ve istek meta verilerini anonimleştirme yöntemlerini kullanarak kullanıcı verilerinin gizli kalmasını ve Apple personeli tarafından bile erişilememesini sağlar.",
      "Apple, PCC'nin üretim yazılımını güvenlik araştırmaları için kamuya açık hale getirerek bağımsız doğrulamayı destekleyecek ve kamu güvenini koruyacak."
    ],
    "commentSummary": [
      "Apple'ın özel bulutunda yapay zeka verilerinin gizliliğine ilişkin tartışma, açık kaynaklı, merkezi olmayan sistemler ile Apple'ın üçüncü taraf denetimleri ve özel donanım da dahil olmak üzere sağlam gizlilik önlemlerini karşılaştırıyor.",
      "Eleştirmenler, Google ve OpenAI gibi rakiplerinin güçlü iç güvenliğini kabul etmelerine rağmen Apple'ın şeffaflığını ve potansiyel arka kapılarını sorguluyor ve doğrulanabilir güvenlik için GrapheneOS gibi kar amacı gütmeyen alternatifler öneriyor.",
      "Endişeler arasında Apple'ın reklamlar için veri toplaması, güçlü şifreleme ihtiyacı, minimum veri kaydı ve devlet müdahalesi riskleri yer alırken, ağ altyapısının karmaşıklığı ve izole makineler ile bulut tabanlı sistemler arasındaki dengeler vurgulanıyor."
    ],
    "points": 567,
    "commentCount": 306,
    "retryCount": 0,
    "time": 1718056387
  },
  {
    "id": 40648470,
    "title": "Öncü Bilgisayar Bilimcisi ve Transgender Aktivist Lynn Conway 85 Yaşında Hayatını Kaybetti",
    "originLink": "https://en.wikipedia.org/wiki/Lynn_Conway",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40648470",
    "commentBody": "",
    "originSummary": [
      "Lynn Conway (1938-2024), modern işlemcileri ve mikroçip tasarımını önemli ölçüde geliştiren öncü bir bilgisayar bilimcisi ve elektrik mühendisiydi.",
      "Ayrımcılığa maruz kalmasına ve geçiş yaptığı için 1968'de IBM tarafından kovulmasına rağmen Xerox PARC, DARPA ve Michigan Üniversitesi'nde kayda değer bir kariyere sahip oldu ve \"VLSI Sistemlerine Giriş\" adlı etkili ders kitabının ortak yazarlığını yaptı.",
      "Conway aynı zamanda önde gelen bir transseksüel hakları savunucusuydu ve 2020'de özür ve IBM Yaşam Boyu Başarı Ödülü de dahil olmak üzere çok sayıda ödül alarak hem teknoloji hem de transseksüel hakları alanında kalıcı bir miras bıraktı."
    ],
    "commentSummary": [
      "Öncü bir bilgisayar bilimcisi ve transseksüel aktivist olan Lynn Conway, ardında ilham ve direnç dolu bir miras bırakarak hayata veda etti.",
      "Cinsiyet geçişi nedeniyle IBM tarafından kovulmasına rağmen Conway kariyerini yeniden inşa etti ve VLSI (Çok Büyük Ölçekli Entegrasyon) tasarımında önemli bir figür haline geldi, etkili \"VLSI Sistemlerine Giriş\" ders kitabının ortak yazarlığını yaptı ve çığır açan bir VLSI Tasarım Kursu verdi.",
      "Onun mirası özellikle Onur Ayı'nda, baskıya karşı süregelen mücadeleleri ve transfobik tepkilere rağmen çalışmalarının ve aktivizminin kalıcı etkisini vurgulaması açısından önem taşımaktadır."
    ],
    "points": 465,
    "commentCount": 69,
    "retryCount": 0,
    "time": 1718124251
  },
  {
    "id": 40646061,
    "title": "RP2040: Raspberry Pi'nin Mühendisler için Uygun Maliyetli, Çok Yönlü Mikrodenetleyicisi",
    "originLink": "https://dgroshev.com/blog/rp2040/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40646061",
    "commentBody": "",
    "originSummary": [
      "RP2040, Raspberry Pi tarafından tüketici elektroniğine yerleştirilmek üzere tasarlanmış çok yönlü bir mikrodenetleyicidir.",
      "Diğer üreticilerin aksine, Raspberry Pi sadece tek bir model sunarak geliştirmeyi basitleştiriyor ve geniş bir destek topluluğunu teşvik ediyor.",
      "Yaklaşık 70 sent fiyatıyla iki çekirdek, 30 GPIO pini, geniş dahili RAM ve verimli IO işlemleri için benzersiz bir PIO çevre birimine sahiptir ve maliyet, işlevsellik ve destek dengesi nedeniyle mühendisler arasında favori haline gelmiştir."
    ],
    "commentSummary": [
      "Bir kullanıcı, PlatformIO aracıyla ilgili sorunlar, daha basit modül formatı ve kapasitif dokunmatik için daha iyi GPIO pin özellikleri nedeniyle RP2040'tan ESP32-S3 mikrodenetleyicisine geçti.",
      "RP2040 uygun fiyatı, mükemmel dokümantasyonu ve benzersiz Programlanabilir I/O (PIO) özelliği nedeniyle övülürken, yüksek güç tüketimi ve çevre birimlerinin eksikliği nedeniyle eleştirildi.",
      "ESP32, daha düşük ADC'lere sahip olmasına ve büyük projelerde performans sorunları yaşamasına rağmen entegre Bluetooth ve Wi-Fi özellikleriyle öne çıktı."
    ],
    "points": 286,
    "commentCount": 207,
    "retryCount": 0,
    "time": 1718113189
  },
  {
    "id": 40643207,
    "title": "POV-Ray 30. Yılını Yeni Beta Sürümü ve Eğitici IDE Kampanyası ile Kutluyor",
    "originLink": "http://www.povray.org/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40643207",
    "commentBody": "",
    "originSummary": [
      "Persistence of Vision Raytracer (POV-Ray), özelleştirilebilir kaynak kodu ile 3D grafikler oluşturmak için ücretsiz, yüksek kaliteli bir araçtır.",
      "Önemli güncellemeler arasında POV-Ray v3.8.0'ın beta sürümü, DKBTrace yaratıcısı David K. Buck tarafından bir eğitim IDE'si için bir Kickstarter kampanyası ve POV-Ray'in 30. yıldönümü yer alıyor.",
      "Site bir sunucu çökmesinden kurtuldu, wiki ve forumlarını restore etti ve white_dune 3D editöründe POV-Ray dışa aktarma gibi yeni özellikleri duyurdu."
    ],
    "commentSummary": [
      "Bir Hacker News kullanıcısı POV-Ray ile ışın izlemeyi öğrendiği 25 günlük deneyimini paylaşarak erken dönem bilgisayar grafikleri ve 386 ve 486 işlemciler gibi eski sistemlerde programlama hakkında nostaljik tartışmaları ateşledi.",
      "Kullanıcılar uzun render sürelerini, donanım yükseltmelerini, POV-Ray ve VistaPro gibi yazılımları kullanmayı ve C ve Turbo Pascal gibi dillerde programlamayı anımsadılar.",
      "Konuşmada ayrıca Blender gibi modern araçlar, 3D renderın evrimi ve büyük teknoloji ve ekonomik modellerin inovasyon ve kaynak tahsisi üzerindeki etkisi ele alınarak POV-Ray ve ilk internet topluluklarının kalıcı etkisi vurgulandı."
    ],
    "points": 271,
    "commentCount": 147,
    "retryCount": 0,
    "time": 1718087804
  },
  {
    "id": 40641361,
    "title": "Noam Chomsky Tıbbi Olaydan Sonra İletişim Kuramıyor veya Yürüyemiyor",
    "originLink": "https://www.independent.co.uk/arts-entertainment/books/news/noam-chomsky-health-update-tributes-b2559831.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40641361",
    "commentBody": "",
    "originSummary": [
      "95 yaşındaki dilbilimci ve siyasi aktivist Noam Chomsky, geçen yıl Haziran ayında geçirdiği tıbbi bir olaydan bu yana sağlık durumunda ciddi bir gerileme yaşadı ve iletişim kuramaz ve yürüyemez hale geldi.",
      "Eski asistanı Bev Stohl, Chomsky'nin olaydan bu yana kamuoyu önüne çıkmadığını ve bir daha da çıkmayacağını doğruladı.",
      "Anma törenlerinde Chomsky'nin nezaketi, adaletsizlikle mücadeleye adanmışlığı ve Gazze çatışmasıyla ilgili tartışmalarda yokluğu hissedilen önemli etkisi vurgulanıyor."
    ],
    "commentSummary": [
      "Noam Chomsky, konuşma yetisini kaybetmesine rağmen zihinsel olarak keskinliğini koruyor ve genç izleyicilerle aktif olarak etkileşime girerek siyaset ve bilişsel bilim alanındaki etkisini sürdürüyor.",
      "Rusya'nın Ukrayna'yı işgali ve Jeffrey Epstein ile geçmişteki etkileşimleri de dahil olmak üzere jeopolitik konulardaki görüşlerinin yanı sıra Amerikan müdahaleciliği ve Kamboçya soykırımı gibi tarihi olaylara ilişkin duruşu nedeniyle eleştirilere maruz kalıyor.",
      "Metin, Chomsky'nin doğuştan gelen dilbilgisi teorilerini büyük dil modellerinin (LLM) işleyişiyle karşılaştırıyor ve İsrail-Filistin çatışması, NATO ve ABD dış politikası hakkındaki tartışmalı görüşlerini ele alarak Chomsky'nin kışkırttığı kutuplaşmış tepkileri vurguluyor."
    ],
    "points": 268,
    "commentCount": 225,
    "retryCount": 0,
    "time": 1718069975
  },
  {
    "id": 40646658,
    "title": "Norveç, Avrupa'nın En Büyük Nadir Toprak Metalleri Yatağını Açarak Çin'e Olan Güveni Azalttı",
    "originLink": "https://www.cnbc.com/2024/06/11/norway-discovers-europes-largest-deposit-of-rare-earth-metals.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40646658",
    "commentBody": "",
    "originSummary": [
      "Norveç, Fen Karbonatit Kompleksi'nde 8,8 milyon metrik ton nadir toprak oksit içeren Avrupa'nın en büyük nadir toprak metalleri yatağını keşfetti.",
      "Bu bulgu, elektrikli araçlar ve rüzgar türbinleri için çok önemli olan ve Avrupa'nın Çin'e bağımlılığını azaltma potansiyeli taşıyan 1,5 milyon metrik ton mıknatısla ilgili nadir toprak elementini de içeriyor.",
      "Keşif, Nadir Topraklar Norveç için bir dönüm noktasıdır ve Avrupa'nın nadir toprak talebini 2030 yılına kadar yurt içinde karşılama hedefiyle uyumludur ve madenciliğin o zamana kadar başlaması beklenmektedir."
    ],
    "commentSummary": [
      "Norveç'in Avrupa'nın en büyük nadir toprak metalleri yatağını keşfetmesi, kaynak dağılımı ve yönetimi konusunda karışık tepkilere yol açtı.",
      "Tartışmada Norveç'in tarihi ve coğrafi bağlamı, etkin kaynak yönetimi ve çevresel kaygılar ile Çin ve Rusya ile jeopolitik dinamikler de dahil olmak üzere nadir toprak madenciliğinin daha geniş etkileri vurgulanmaktadır.",
      "Nadir toprak elementleriyle ilgili yanlış anlamalar ele alınmakta, bu elementlerin bolluğu ve çıkarılmalarıyla ilgili zorluklar vurgulanmaktadır."
    ],
    "points": 209,
    "commentCount": 197,
    "retryCount": 0,
    "time": 1718116594
  },
  {
    "id": 40645983,
    "title": "Slop: Düşük Kalitede Yapay Zeka Tarafından Üretilen İçeriğin Yükselişi ve Çevrimiçi Platformlar Üzerindeki Etkisi",
    "originLink": "https://www.nytimes.com/2024/06/11/style/ai-search-slop.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40645983",
    "commentBody": "",
    "originSummary": [
      "\"Slop\" terimi, sosyal medya, sanat, kitaplar ve arama sonuçları da dahil olmak üzere çeşitli çevrimiçi platformlarda düşük kaliteli, istenmeyen yapay zeka tarafından oluşturulan içeriği tanımlamak için ortaya çıkmıştır.",
      "Terim, Google'ın Gemini yapay zeka modelini ABD arama sonuçlarına entegre etmesinin ardından ilgi görmeye başladı ve ilk kullanıcı memnuniyetsizliğine ve yanlış adımlara yol açtı.",
      "Uzmanlar bu tür içeriklerin bilgiyi kesin cevaplar olarak sunarak eleştirel düşünmeyi engellediği konusunda uyarırken, savunucular \"slop\" gibi terimlere sahip olmanın modern yapay zeka kullanımına ilişkin toplumsal söylem için gerekli olduğuna inanıyor."
    ],
    "commentSummary": [
      "\"Slop\" terimi, yapay zekanın içerik kalitesi ve toplumsal refah üzerindeki etkisine ilişkin endişeleri yansıtan düşük kaliteli, genellikle yapay zeka tarafından oluşturulan içeriğe atıfta bulunur.",
      "Eleştirmenler, yapay zekanın ekonomik teşvikler ve reklam karları tarafından yönlendirilen düşük kaliteli içeriğin seri üretimini sağlayarak sorunu daha da kötüleştirdiğini savunuyor.",
      "Tartışma, içerik oluşturmanın geleceği ve yapay zekanın hem oluşturma hem de özetlemeyi yönetme potansiyeli ile ilgili endişelerle birlikte, düşük çaba gerektiren insan içeriği ile yapay zeka tarafından oluşturulan materyal arasında ayrım yapmanın zorluğunu vurgulamaktadır."
    ],
    "points": 191,
    "commentCount": 193,
    "retryCount": 0,
    "time": 1718112730
  },
  {
    "id": 40638386,
    "title": "Entomoloji Derneği Konferansında Kurumsal Etki Endişeleri Artırıyor",
    "originLink": "https://usrtk.org/bees-neonics/entomological-society-america-corporate-partners/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40638386",
    "commentBody": "",
    "originSummary": [
      "2023 Entomological Society of America (ESA) toplantısında, özellikle Corteva Agriscience gibi zirai ilaç şirketlerinin önemli kurumsal sponsorlukları göze çarptı.",
      "Arı sağlığı ve iklim değişikliği gibi kritik konulardaki tartışmalara rağmen, Corteva tarafından üretilen ve arı kolonilerinin azalmasıyla bağlantılı bir pestisit olan neonikotinoidler hakkındaki araştırmaların oldukça seyrek olması, bilimsel söylem üzerindeki kurumsal etkiye dair endişeleri artırdı.",
      "Eleştirmenler, kurumsal katılımın ESA'nın bütünlüğünü tehlikeye atabileceğini iddia etse de, kuruluş kapsayıcılığını ve bilimsel bakış açılarının çeşitliliğini savunuyor."
    ],
    "commentSummary": [
      "Büyük bir konferansta tartışmalı pestisit araştırmalarında düşüş yaşanması, akademide kurumsal sponsorluğun etkisine ilişkin tartışmaları alevlendirdi.",
      "Eleştirmenler, kurumsal finansmanın araştırma önceliklerini çarpıttığını ve daha az kârlı çalışmaları bastırdığını savunurken, destekçiler bunun faydalı işbirliğini teşvik ettiğine inanıyor.",
      "Tartışma, endüstri katılımı ile bilimsel dürüstlük arasındaki gerilimin altını çiziyor ve kurumsal etkiyi azaltmak için federal bilim finansmanının artırılmasını savunuyor."
    ],
    "points": 188,
    "commentCount": 77,
    "retryCount": 0,
    "time": 1718050593
  },
  {
    "id": 40640927,
    "title": "Günlük Taahhütler: Üretkenliği ve Ekip Görünürlüğünü Artırma",
    "originLink": "https://maxleiter.com/blog/ship-every-day",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40640927",
    "commentBody": "",
    "originSummary": [
      "Yazar, iş yerinde büyük özellikler veya hata düzeltmeleri olmak zorunda olmayan günlük somut katkılar yapılmasını öneriyor.",
      "Faydaları arasında dopamin patlaması, ekibiniz için daha fazla görünürlük, artan ilerlemenin teşvik edilmesi ve etkileyici bir GitHub profili yer alır.",
      "Katkılar arasında dokümantasyon veya triyaj, uzaktan çalışmada izolasyonla mücadeleye yardımcı olma ve günlük memnuniyet sağlama da yer alabilir."
    ],
    "commentSummary": [
      "Yazılım geliştirmedeki \"her gün bir şey gönder\" yaklaşımı, kaliteyi potansiyel olarak düşürdüğü ve hızlı, yansıtıcı olmayan iterasyonlar yoluyla yüzeysel üretkenliği teşvik ettiği için eleştirilmektedir.",
      "Eleştirmenler, taahhüt serileri gibi ölçütlere odaklanmanın yanıltıcı olabileceğini, endişeye neden olabileceğini ve yazılım istikrarını olumsuz etkileyebileceğini savunarak, anlamlı çalışmanın genellikle daha fazla zaman gerektirdiğini öne sürüyor.",
      "Tartışma, üretkenliğe dengeli bir yaklaşımı savunmakta, keyfi ölçütler yerine kaliteyi, tutarlı artan ilerlemeyi, etkili iletişimi ve sürekli motivasyon için dahili dokümantasyonun ve yaratıcı projelerin değerini vurgulamaktadır."
    ],
    "points": 185,
    "commentCount": 122,
    "retryCount": 0,
    "time": 1718065705
  },
  {
    "id": 40639628,
    "title": "Açık İletişimde Ustalaşmak: Vicky Zhao'nun Etkili Stratejilerinden İpuçları",
    "originLink": "https://iandanielstewart.com/2024/06/09/engage-your-audience-by-getting-to-the-point-using-story-structure-and-forcing-specificity/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40639628",
    "commentBody": "",
    "originSummary": [
      "Makale, Vicky Zhao'nun fikirlerin net bir şekilde ifade edilmesine ilişkin videosundan esinlenen iletişim stratejilerini vurgulamaktadır.",
      "Temel teknikler arasında net bir ana noktayla başlamak, 3 satırlık bir hikaye yapısı kullanmak ve belirli ifadeler ve Via Negativa yöntemi ile spesifik olmak yer alır.",
      "Bu yöntemler, iletişimin açık, ilgi çekici ve kesin olmasını sağlayarak yazma, okuma, düşünme ve karar verme süreçlerini geliştirmeyi amaçlamaktadır."
    ],
    "commentSummary": [
      "Tartışma, özlü iletişim ve yapılandırılmış hikaye anlatımı yoluyla etkili izleyici katılımını vurgulamakta ve ana noktadan başlamak ile geleneksel hikaye yapıları gibi farklı yaklaşımları karşılaştırmaktadır.",
      "Netlik ve hızlı karar alma için STAR (Durum, Görev, Eylem, Sonuç) gibi çerçeveler kullanarak net sunumların önemini vurgulamaktadır.",
      "Sohbet, kısalık ve açıklık arasındaki dengenin, ilgi çekici sunum tarzlarının rolünün ve kahramanın yolculuğu gibi hikaye anlatma tekniklerinin etkinliğinin altını çiziyor ve nihayetinde katı yapılar yerine gerçek duygulara ve kişisel sese değer veriyor."
    ],
    "points": 185,
    "commentCount": 64,
    "retryCount": 0,
    "time": 1718056513
  },
  {
    "id": 40643167,
    "title": "Gleam V1, Type-Safe BEAM Entegrasyonu ile Geliştiricileri Neden Kazanıyor?",
    "originLink": "https://christopher.engineering/en/blog/gleam-overview/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40643167",
    "commentBody": "",
    "originSummary": [
      "Makale, Mart 2024'te Gleam V1'in piyasaya sürülmesinden sonra BEAM'de tip güvenli bir dil olan Gleam'i yeniden ziyaret eden ve statik yazımından etkilenen bir yazılım mühendisi olan Chris'i vurgulamaktadır.",
      "Gleam'in temel özellikleri arasında etiketli birlikler, desen eşleştirme ve JavaScript'in karmaşıklığının aksine geliştirmeyi basitleştiren bir derleyici ve CLI ile sağlam bir tip sistemi bulunmaktadır.",
      "Gleam'in BEAM ekosistemi ile entegrasyonu ve hataya dayanıklı yazılım oluşturmak için OTP'nin yanı sıra JavaScript'e aktarma yeteneği, JavaScript geliştiricileri için cazip hale getiriyor; makale ayrıca bir Gleam web çerçevesi olan Lustre'yi de tanıtıyor."
    ],
    "commentSummary": [
      "Gleam, minimalist tasarımı ve üretken özellikleriyle bilinen BEAM sanal makinesi için tasarlanmış tip güvenli bir dildir.",
      "Elixir'in aksine Gleam, statik tip sistemine uyum sağlamak için temel ilkelleri yeniden uygular, basitlik, etiketli argümanlar ve entegre araçlar sunar.",
      "Gleam'in OTP'si (Open Telecom Platform) Erlang veya Elixir'e göre daha az olgunlaşmış olsa da, ergonomik tasarımı ve Vue gibi projelerle potansiyel entegrasyonu nedeniyle gelişmekte ve takdir edilmektedir."
    ],
    "points": 177,
    "commentCount": 79,
    "retryCount": 0,
    "time": 1718087389
  },
  {
    "id": 40638764,
    "title": "Yeni Çerçeve, Mikroskobik Etkileşimlerden Büyük Ölçekli Düzenin Nasıl Ortaya Çıktığını Açıklıyor",
    "originLink": "https://www.quantamagazine.org/the-new-math-of-how-large-scale-order-emerges-20240610/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40638764",
    "commentBody": "",
    "originSummary": [
      "Philip Ball tarafından kaleme alınan makale, çok sayıda mikroskobik etkileşimden büyük ölçekli örüntülerin ortaya çıktığı ortaya çıkış kavramını ve bunun için birleşik bir bilimsel teori geliştirmenin zorluğunu tartışıyor.",
      "Fernando Rosas'ın da aralarında bulunduğu araştırmacılar, ortaya çıkan yapıların kriterlerini belirlemek için hesaplama mekaniğini kullanarak yeni bir çerçeve önerdiler ve karmaşık sistemlerin alt düzey detaylardan bağımsız olarak hiyerarşik seviyelerde kendi kendine organize olduğunu öne sürdüler.",
      "Çalışma, makro düzeyde öngörülebilirlik ve kontrolün ayrıntılı mikro durum bilgisi ile geliştirilmediğini gösteren bilgisel kapanma kavramını tanıtmakta ve evrenin yapısını, nedenselliği ve özgür irade tartışmasını anlamak için etkilerini araştırmaktadır."
    ],
    "commentSummary": [
      "Makale, Crutchfield'in sonlu olmayan belleğe sahip sistemlerdeki durum geçişlerini modellemek için yeni bir yöntem olan ve sonlu durum makinelerinin sınırlamalarını ele alan Epsilon makine formalizmini tanıtmaktadır.",
      "Melanie Mitchell, Crutchfield ve Cosma Shalizi'nin çalışmaları ve Stuart Kauffman'ın \"The Nature of Computation\" ve Mark Newman'ın \"Networks\" gibi kitapları da dahil olmak üzere karmaşık sistemler hakkında temel kaynaklar önermektedir.",
      "Tartışma, makro ve mikro süreçler arasındaki etkileşimi, heterarşi kavramını ve Gregory Chaitin'in teorilerine ve Solomonoff-Kolmogorov-Chaitin çerçevesine atıfta bulunarak bilgi teorisine dayanan disiplinler arası çalışmanın önemini kapsamaktadır."
    ],
    "points": 166,
    "commentCount": 37,
    "retryCount": 0,
    "time": 1718052124
  },
  {
    "id": 40642801,
    "title": "İngiliz İkili Ev Yapımı \"Kısa Mesaj Blaster\" Kullanarak SMS ile Kimlik Avı Yapmaktan Tutuklandı",
    "originLink": "https://www.theregister.com/2024/06/10/two_arrested_in_uk_over/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=40642801",
    "commentBody": "",
    "originSummary": [
      "İngiliz polisi, binlerce sahte mesaj göndermek için ev yapımı bir \"kısa mesaj patlatıcısı\" kullanan SMS tabanlı bir kimlik avı (smishing) kampanyasına karışan iki kişiyi tutukladı.",
      "Şüpheliler, alıcıları kandırmak için bankaları ve resmi kuruluşları taklit ederken, kimliği tespit edilen bir şüpheli, Huayong Xu, suçlandı ve mahkemeye çıkarıldı.",
      "Şebeke operatörleri, Ofcom ve Ulusal Siber Güvenlik Merkezi'nin (NCSC) dahil olduğu soruşturma, şüpheli mesajların 7726'ya bildirilmesinin önemini vurgulamaktadır."
    ],
    "commentSummary": [
      "İki İngiliz, Yazılım Tanımlı Radyo (SDR) ve açık kaynaklı yazılımla inşa edilmiş ev yapımı bir baz istasyonu kullanarak SMS ile kimlik avı yaptıkları gerekçesiyle tutuklandı.",
      "Makalede, bu tür sistemlerin oluşturulmasının kolaylığı ve telefon sağlayıcılarının şüpheli metinleri 7726 (SPAM) gibi numaralara bildirmek de dahil olmak üzere anti-spam önlemleri ele alınmaktadır.",
      "Konuşma, özellikle Londra'nın merkezi gibi yüksek riskli bölgelerde olmak üzere şehirlerde spektrum izlemenin karmaşıklığına ve çeşitli yetkililerin katılımına dikkat çekiyor."
    ],
    "points": 154,
    "commentCount": 131,
    "retryCount": 0,
    "time": 1718084413
  }
]
