[
  {
    "id": 38498109,
    "title": "Vytvorenie malého objemového displeja: Urob si sám s LED maticou a strojom Pick & Place",
    "originLink": "https://mitxela.com/projects/candle",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38498109",
    "commentBody": "",
    "originSummary": [
      "Autor úspešne zostrojil malý objemový displej pomocou maticovej dosky s LED diódami a stroja pick and place.",
      "Vysvetlia svoje rozhodnutia o výbere mikrokontroléra a batérie pre projekt.",
      "Autor sa podrobne venuje montáži, zapojeniu a softvérovému nastaveniu prototypu, ako aj výzvam, ktorým čelili v súvislosti s nabíjačkou batérií a vykresľovaním animácií.",
      "Poskytujú návrhy na budúce vylepšenia a ponúkajú zdrojový kód na GitHube."
    ],
    "commentSummary": [
      "Článok a diskusia sa zameriavajú na objemové displeje, mikroLED, holografickú technológiu a displeje s perzistentným videním (POV).",
      "Účastníci sa podelia o svoje skúsenosti, výzvy a návrhy na zlepšenie týchto projektov.",
      "V porovnaní s týmito technológiami sa náhlavné súpravy pre virtuálnu/rozšírenú realitu považujú za vhodnejšiu možnosť skutočnej 3D vizualizácie."
    ],
    "points": 1228,
    "commentCount": 139,
    "retryCount": 0,
    "time": 1701519785
  },
  {
    "id": 38503486,
    "title": "Odmietnutý ako nie skutočný inžinier: Mýtické schopnosti nestačia",
    "originLink": "https://twitchard.github.io/posts/2019-05-29-not-a-real-engineer.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38503486",
    "commentBody": "",
    "originSummary": [
      "Autor spomína, že dostal e-mail, v ktorom bola zamietnutá jeho žiadosť o zamestnanie v oblasti inžinierstva.",
      "Používajú metaforický opis seba samého ako mýtickej bytosti s pôsobivými vlastnosťami.",
      "Ako dôvod, prečo neboli vybraní, sa uvádza, že neboli považovaní za dostatočne technicky zdatných."
    ],
    "commentSummary": [
      "Článok sa zaoberá procesom prijímania softvérových inžinierov a zameraním sa na technické zručnosti na úkor iných dôležitých vlastností.",
      "Autor tvrdí, že zručnosti ako podnikanie a marketing sú často podceňované, ale sú kľúčové pre úspech v inžinierstve.",
      "Článok poukazuje na frustráciu kvalifikovaných uchádzačov o zamestnanie, ktorí sa cítia odmietnutí kvôli veľkému dôrazu na technické schopnosti."
    ],
    "points": 244,
    "commentCount": 34,
    "retryCount": 0,
    "time": 1701561903
  },
  {
    "id": 38500906,
    "title": "Spievanie deťom pomáha učiť sa jazyk prostredníctvom rytmu a tónu",
    "originLink": "https://www.theguardian.com/science/2023/dec/01/singing-to-babies-is-vital-to-help-them-understand-language-say-scientists",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38500906",
    "commentBody": "",
    "originSummary": [
      "Podľa štúdie Cambridgeskej univerzity je spievanie bábätkám dôležitým faktorom pri učení sa jazyka.",
      "Výskum naznačuje, že dojčatá spočiatku rozumejú jazyku skôr prostredníctvom rytmu a tónu než prostredníctvom jednotlivých zvukov.",
      "Štúdia spochybňuje presvedčenie, že spracovanie fonetických informácií je primárnym aspektom učenia sa jazyka, a naznačuje, že dyslexia a vývinové poruchy jazyka môžu súvisieť s vnímaním rytmu."
    ],
    "commentSummary": [
      "Dojčatá chápu jazyk prostredníctvom rytmu a tónu, nie jednotlivých zvukov, čo spochybňuje potrebu \"detskej reči\" pre rozvoj jazyka.",
      "Jazyková deprivácia môže brániť osvojeniu si jazyka, ale pokiaľ deti nie sú deprivované alebo zneužívané, rozvíjajú sa ich jazykové schopnosti normálne.",
      "Rodičovské stratégie nie sú jediným faktorom, ktorý ovplyvňuje vývoj jazyka dieťaťa; svoju úlohu zohrávajú aj individuálne skúsenosti a genetické rozdiely."
    ],
    "points": 202,
    "commentCount": 82,
    "retryCount": 0,
    "time": 1701543028
  },
  {
    "id": 38498688,
    "title": "GQL: Dopytovací jazyk pre súbory Git",
    "originLink": "https://github.com/AmrDeveloper/GQL",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38498688",
    "commentBody": "",
    "originSummary": [
      "GQL je dotazovací jazyk, ktorý sa podobá jazyku SQL a umožňuje priamo vyhľadávať v súboroch .git, čím sa eliminuje potreba samostatnej databázy.",
      "Ponúka celý rad operácií vrátane výberu, agregácie, filtrovania a zoraďovania.",
      "Jazyk GQL nerozlišuje veľké a malé písmená a má podobnú syntax ako jazyk SQL. Softvér je vydaný pod licenciou MIT."
    ],
    "commentSummary": [
      "Príspevok sa zaoberá používaním jazyka GQL, nástroja na analýzu údajov pre úložiská git, a naznačuje potrebu používateľsky prívetivejších analytických dotazov.",
      "Diskutuje o potenciálnych výhodách a nevýhodách dotazovacieho jazyka podobného jazyku SQL pre systém Git a prezentuje zmiešané názory na jeho užitočnosť.",
      "Rieši sa zámena medzi jazykmi GQL a GraphQL, ako aj alternatívne rozhrania a zdokonalené prístupy k jazyku SQL."
    ],
    "points": 189,
    "commentCount": 57,
    "retryCount": 0,
    "time": 1701526008
  },
  {
    "id": 38498775,
    "title": "Porovnanie správy pamäte, bezpečnosti a prijatia: Ada vs. Rust",
    "originLink": "https://old.reddit.com/r/rust/comments/17miqiu/is_ada_safer_than_rust/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38498775",
    "commentBody": "",
    "originSummary": [
      "V príspevku na Reddite v subreddite o programovacom jazyku Rust sa uvádzajú pravidlá a usmernenia pre odosielanie príspevkov spolu s diskusiou o rozdieloch medzi jazykmi Ada a Rust.",
      "V príspevku sa hľadajú postrehy od osôb so znalosťami oboch programovacích jazykov so zameraním na témy, ako je správa pamäte, bezpečnostné funkcie, výkon a miera prijatia jazyka Ada v rôznych odvetviach.",
      "Komentáre a diskusia osvetľujú silné stránky, obmedzenia a vyhliadky programovacieho jazyka Ada a Rust do budúcnosti."
    ],
    "commentSummary": [
      "Diskusia na Reddite sa zaoberá bezpečnosťou, funkciami a aplikáciami programovacích jazykov, ako sú Ada a Rust.",
      "Ada je chválená pre svoj silný typový systém a kontrakty, zatiaľ čo Rust je chválený pre svoje zameranie na zamedzenie chýb v prístupe do pamäte.",
      "Medzi skúmané témy patria závislé typy, integrácia knižníc jazyka Rust s jazykom Ada, pomoc umelej inteligencie pri písaní dôkazov, jazykové modely a používanie inteligentných ukazovateľov v jazyku Rust.",
      "Dôkladne sa skúmajú obmedzenia a vhodnosť rôznych jazykov pre aplikácie kritické z hľadiska bezpečnosti a reálneho času.",
      "Diskusia poskytuje protichodné názory na efektívnosť a užitočnosť rôznych programovacích jazykov."
    ],
    "points": 159,
    "commentCount": 102,
    "retryCount": 0,
    "time": 1701526954
  },
  {
    "id": 38500065,
    "title": "Optické káble \"počujú\" hlasné cikády, ponúkajú novú metódu monitorovania hmyzu",
    "originLink": "https://www.wired.com/story/cicadas-are-so-loud-fiber-optic-cables-can-hear-them/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38500065",
    "commentBody": "",
    "originSummary": [
      "Vedci zistili, že optické káble dokážu zachytiť zvuk cikád, čo by mohlo viesť k novej metóde monitorovania populácie hmyzu.",
      "Pomocou distribuovaného akustického snímania (DAS) môžu výskumníci analyzovať svetlo odrážajúce sa od lasera vystreleného cez káble a zistiť tak poruchy spôsobené hlasnými zvukmi alebo seizmickou aktivitou.",
      "Táto technika by mohla entomológom umožniť diaľkové monitorovanie cikád a zhromažďovanie údajov o veľkosti a umiestnení ich populácie pomocou už dnes hojne využívaných optických káblov. Monitorovanie tichších druhov hmyzu pomocou DAS však môže byť náročnejšie."
    ],
    "commentSummary": [
      "Optické káble sa dajú využiť ako senzory na detekciu ohybov a zhromažďovanie informácií o nich v aplikáciách, ako je detekcia narušenia a monitorovanie vibrácií.",
      "Na meranie odrazov v optických kábloch sa bežne používajú optické reflektometre v časovej oblasti (OTDR), ale presnosť týchto meraní môže ovplyvniť neistá rýchlosť kábla.",
      "K neistote rýchlosti káblov môžu prispieť rôzne faktory, ako napríklad rýchlosť krútenia káblov, ktoré ovplyvňujú presnosť technológie snímania."
    ],
    "points": 156,
    "commentCount": 58,
    "retryCount": 0,
    "time": 1701537074
  },
  {
    "id": 38502340,
    "title": "Správa o chybe: Problém s prihlásením pomocou kľúča FIDO2 na office.com cez Firefox",
    "originLink": "https://bugzilla.mozilla.org/show_bug.cgi?id=1824831",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38502340",
    "commentBody": "",
    "originSummary": [
      "Podľa hlásenia o chybe majú používatelia problémy s prihlasovaním na stránke office.com pomocou prehliadača Firefox s kľúčom FIDO2.",
      "Úroveň závažnosti chyby je uvedená ako nízka a spoločnosť Microsoft bola o probléme informovaná.",
      "Chyba zostáva nevyriešená a prebiehajú snahy o jej odstránenie, pričom viacerí používatelia potvrdili, že problém pretrváva. V správe o chybe sa tiež uvádza, že systémy overovania spoločnosti Microsoft sú zložité a nekonzistentné."
    ],
    "commentSummary": [
      "Používatelia sú frustrovaní z prihlasovacieho systému spoločnosti Microsoft vo Firefoxe a majú podozrenie na protisúťažné správanie a zámerné blokovanie zo strany spoločnosti Microsoft.",
      "Sťažnosti sa týkajú nedostatočného zabezpečenia kvality a technickej podpory zo strany spoločnosti Microsoft, ako aj problémov s navigáciou a kompatibilitou s niektorými prehliadačmi.",
      "Diskutuje sa o tom, či by spoločnosť Microsoft mala naďalej podporovať menšinové prehliadače, ako je Firefox, pričom niektorí zdôrazňujú inkluzívnosť, zatiaľ čo iní diskutujú o prijatí reťazca používateľského agenta prehliadača Chrome, aby sa predišlo problémom s kompatibilitou."
    ],
    "points": 151,
    "commentCount": 71,
    "retryCount": 0,
    "time": 1701553525
  },
  {
    "id": 38504134,
    "title": "Predvolené správanie Clangu spôsobuje problém so spúšťaním binárnych súborov na pôvodnom Pi B+",
    "originLink": "https://rachelbythebay.com/w/2023/11/30/armv6/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38504134",
    "commentBody": "",
    "originSummary": [
      "Autor sa delí o svoje skúsenosti s používaním jazyka clang na kompiláciu programov v jazyku C++ na Raspberry Pi B+.",
      "Binárne súbory zostavené pomocou Clang nie je možné spustiť na systéme B+ kvôli zmene predvoleného správania.",
      "Autor identifikuje riešenie zadaním cieľovej architektúry, ale kladie si otázku, prečo táto zmena predvoleného správania zostala nepovšimnutá, a naznačuje, že staršie modely Raspberry Pi sa už bežne nepoužívajú."
    ],
    "commentSummary": [
      "Diskutovalo sa o problémoch s kompatibilitou kompilátora Clang a pôvodného Raspberry Pi B+ kvôli jeho staršiemu jadru ARM1176.",
      "Chyba v kompilátore LLVM bola vyriešená zadaním cieľa ako armv6.",
      "V rozhovore sme sa dotkli aj problémov s podporou starého hardvéru v distribúciách Linuxu, koncepcie slobodného softvéru a emulácie ARM64 na x86_64 pomocou QEMU a Docker. Správna konfigurácia predvoleného obrazu pre kontajner Toolbox bola zdôraznená ako kľúčová."
    ],
    "points": 144,
    "commentCount": 48,
    "retryCount": 0,
    "time": 1701569241
  },
  {
    "id": 38499375,
    "title": "Excalidraw: Nástroj s otvoreným zdrojovým kódom na kreslenie ručne kreslených schém",
    "originLink": "https://github.com/excalidraw/excalidraw",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38499375",
    "commentBody": "",
    "originSummary": [
      "Excalidraw je virtuálna tabuľa s otvoreným zdrojovým kódom na vytváranie ručne kreslených diagramov a drôtových schém.",
      "Medzi funkcie patrí nekonečné plátno, prispôsobiteľné nástroje, podpora obrázkov a end-to-end šifrovaná spolupráca.",
      "Aplikácia Excalidraw.com ponúka podporu PWA, spoluprácu v reálnom čase a funkcie local-first, zatiaľ čo balík Excalidraw npm poskytuje ďalšie funkcie. Projekt je sponzorovaný a integruje sa s rôznymi platformami a službami."
    ],
    "commentSummary": [
      "Excalidraw je populárny kresliaci nástroj s otvoreným zdrojovým kódom, ktorý je známy svojimi funkciami na spoluprácu, používateľsky prívetivým rozhraním a ručne kresleným štýlom.",
      "Široko sa využíva na rozhovory o návrhu systémov a vzdialenú spoluprácu, najmä v začínajúcich firmách, ktoré oceňujú jeho jednoduchosť a zameranie na návrh.",
      "Spoločnosť Google Cloud dokonca vyvinula nástroj na vytváranie diagramov architektúry založený na Excalidraw a používatelia odporúčajú podobné nástroje, ako sú DrawIO a Mermaid."
    ],
    "points": 139,
    "commentCount": 29,
    "retryCount": 0,
    "time": 1701531946
  },
  {
    "id": 38499824,
    "title": "Odhaľovanie temných vzorov: Rozpoznávanie a prevencia manipulácie s UX",
    "originLink": "https://dodonut.com/blog/10-dark-patterns-in-ux-design/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38499824",
    "commentBody": "",
    "originSummary": [
      "Temné vzory sú manipulatívne taktiky, ktoré používajú spoločnosti v dizajne UX na oklamanie a zneužitie používateľov vo svoj prospech.",
      "Identifikujú sa bežné typy temných vzorov a skúma sa ich zneužívanie ľudskej psychológie na dosahovanie zisku.",
      "V článku sa zdôrazňuje význam transparentnosti, kontroly používateľov a etických postupov pri navrhovaní, aby sa zabránilo temným vzorom a udržala sa dôvera a angažovanosť používateľov."
    ],
    "commentSummary": [
      "Tmavé vzory v dizajne UX majú negatívny vplyv na používateľskú skúsenosť, ako sa uvádza v tomto článku a vlákne komentárov.",
      "Uvádzajú sa príklady temných vzorov, ktoré používajú spoločnosti ako LinkedIn a Adobe, spolu so stratégiami, ako sa im vyhnúť alebo ich podkopať.",
      "V rozhovore sa zdôrazňuje význam etiky v technologickom priemysle a frustrácia spôsobená určitými rozhodnutiami v oblasti dizajnu."
    ],
    "points": 124,
    "commentCount": 55,
    "retryCount": 0,
    "time": 1701535250
  }
]
