[
  {
    "id": 38785468,
    "title": "5 év óta az első új amerikai atomreaktor megkezdi működését a Vogtle erőműben",
    "originLink": "https://www.eia.gov/todayinenergy/detail.php?id=61106",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38785468",
    "commentBody": "",
    "originSummary": [
      "A Georgia Power Georgia állambeli Vogtle atomerőművében megkezdődött egy új atomreaktor kereskedelmi üzemeltetése, 2016 óta az első az Egyesült Államokban.",
      "A 3. blokknak nevezett reaktor kapacitása 1114 MW, és egy másik reaktor, a 4. blokk is csatlakozik hozzá, amely várhatóan 2024 márciusában kezdi meg működését.",
      "A Vogtle erőmű lesz az ország legnagyobb atomerőműve, amint mindkét új reaktor üzembe áll, és hozzájárul a szén-dioxid-kibocsátás csökkentéséhez az energiaszektorban."
    ],
    "commentSummary": [
      "Az összefoglaló áttekintést nyújt az atomerőműveket, a megújuló energiaforrásokat, a költséghatékonyságot, a biztonsági aggályokat és az energiatermelés jövőjét megvitató beszélgetésről.",
      "Rávilágít az olyan energiaforrások, mint az atomenergia, a napenergia és a szélenergia kihívásaira és előnyeire, beleértve az olyan tényezőket, mint a költségek, a hatékonyság és a környezeti hatások.",
      "A beszélgetés olyan témákat is érint, mint az uránbányászat, a megújuló energia tárolási megoldásai, az atomenergia kormányzati támogatása, az építési késedelmek és a különböző országok szerepe az energiatermelésben."
    ],
    "points": 695,
    "commentCount": 627,
    "retryCount": 0,
    "time": 1703704777
  },
  {
    "id": 38786581,
    "title": "A Shinjuku állomás belső tereinek 3D-s feltérképezése",
    "originLink": "https://satoshi7190.github.io/Shinjuku-indoor-threejs-demo/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38786581",
    "commentBody": "",
    "originSummary": [
      "A Földügyi, Infrastrukturális, Közlekedési és Idegenforgalmi Minisztérium kidolgozott egy ellenőrzési térképet a Shinjuku állomás körüli beltéri területekre.",
      "A térkép több emeletet és gyalogoshálózatot fed le, részletes információkat nyújt az állomáson belüli helyszínekről.",
      "A kezdeményezés célja, hogy javítsa a navigációt és a megközelíthetőséget az állomáskomplexumon belül."
    ],
    "commentSummary": [
      "A fórumbeszélgetések a japán vasútállomásokon való navigálás különböző aspektusairól szólnak, mint például személyes tapasztalatok, játékjavaslatok és a metrórendszerek kialakítása.",
      "A felhasználók olyan témákat is megvitatnak, mint a kapszulahotelekben való tartózkodás, utazási ajánlások és a Japánban élő expatok kihívásai.",
      "A fórumon olyan speciális témákról is szó esik, mint az egyes vasútállomásokon való navigáció, a metrórendszer megértésének nehézségei, valamint a 3D-s vizualizációk és modellek használata."
    ],
    "points": 628,
    "commentCount": 150,
    "retryCount": 0,
    "time": 1703710204
  },
  {
    "id": 38781941,
    "title": "A NY Times beperelte az OpenAI-t és a Microsoftot szerzői jogok megsértéséért",
    "originLink": "https://www.theverge.com/2023/12/27/24016212/new-york-times-openai-microsoft-lawsuit-copyright-infringement",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38781941",
    "commentBody": "",
    "originSummary": [
      "A New York Times pert indított az OpenAI és a Microsoft ellen, azzal vádolva őket, hogy engedély nélkül használták fel az újság több millió cikkét a nyelvi modellek képzéséhez.",
      "A Times azzal érvel, hogy ezek a mesterséges intelligenciával működő modellek közvetlenül versenyeznek a tartalmával, ami bevételkieséshez vezet, és károsítja az olvasókkal való kapcsolatát.",
      "A kiadvány több milliárd dolláros kártérítést követel, és azt akarja, hogy a bíróság tiltsa el az OpenAI-t és a Microsoftot attól, hogy a tartalmát felhasználja a mesterséges intelligencia modelljeiben. Más hírügynökségek, például a BBC, a CNN és a Reuters szintén blokkolták az OpenAI webkúszóját, míg egyes kiadványok, köztük a Politico és az Associated Press megállapodtak abban, hogy engedélyezik tartalmaik felhasználását az AI-tréninghez."
    ],
    "commentSummary": [
      "A The New York Times beperelte az OpenAI-t és a Microsoftot szerzői jogok megsértése miatt, ami kérdéseket vet fel a szerzői jogvédelem alatt álló anyagok nyelvi modellek képzéséhez történő felhasználásával kapcsolatban.",
      "Az OpenAI-t kritizálják, hogy nem ismeri el megfelelően a tartalomkészítőket, és vita folyik a tisztességes felhasználásról az algoritmusok képzésében.",
      "A vita olyan témákat érint, mint az adatvédelem, az egészségügyi adatok felhasználása, a szerzői jogok védelme, az alkotók kompenzációja, valamint a hagyományos hírszervezetekre és a nyílt forráskódú gépi tanulásra gyakorolt hatás."
    ],
    "points": 551,
    "commentCount": 804,
    "retryCount": 0,
    "time": 1703685501
  },
  {
    "id": 38782954,
    "title": "A svájci gólyák felemelkedése és bukása: A jódhiány feletti győzelem: A jódhiány diadala",
    "originLink": "https://www.lrb.co.uk/the-paper/v45/n23/jonah-goodman/a-national-evil",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38782954",
    "commentBody": "",
    "originSummary": [
      "A 20. század elején a golyva és az ezzel kapcsolatos betegségek igen elterjedtek voltak Svájcban, ami a nyak duzzanatát okozta, és jelentős egészségügyi és gazdasági következményekkel járt a családok számára.",
      "A golyva okát a jódhiányban találták meg, és a megoldást a jódozott só bevezetése jelentette, bár ez kezdetben ellenállásba ütközött.",
      "A jódozott só bevezetése Svájcban a golyva arányának jelentős csökkenését eredményezte, de az érintettek eredményeit beárnyékolta Dr. Eugen Bircher ellenállása."
    ],
    "commentSummary": [
      "A cikk és a hozzászólások különböző témákat érintenek, többek között a golyva, a jódpótlás, a jódozott só, a fluorid, a közegészségügyi kezdeményezések és a svájci egészségügy történelmi kérdései.",
      "A hozzászólásokban a jódhiányról, a beavatkozások előnyeiről és kockázatairól, a jód szerepéről a pajzsmirigy és más egészségi állapotokban, a jódozott sóval kapcsolatos vitákról, a víz fluorizálásával és a védőoltásokkal kapcsolatos vitákról, valamint a golyva és a kretenizmus történetéről Svájcban.",
      "A beszélgetések hangsúlyozzák a jód jelentőségét a közegészségügyben, valamint a további kutatás és megértés szükségességét ezeken a területeken."
    ],
    "points": 521,
    "commentCount": 234,
    "retryCount": 0,
    "time": 1703691261
  },
  {
    "id": 38784073,
    "title": "\"Triangulációs\" kampány Backdoors iPhone-ok és feltárja a titkos Apple hardver funkciót",
    "originLink": "https://arstechnica.com/security/2023/12/exploit-used-in-mass-iphone-infection-campaign-targeted-secret-hardware-feature/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38784073",
    "commentBody": "",
    "originSummary": [
      "A \"Triangulation\" kampány négy éven keresztül számos iPhone-t célzott meg és tett tönkre, köztük a moszkvai székhelyű Kaspersky biztonsági cég alkalmazottainak tulajdonában lévőket.",
      "A támadók egy nyilvánosságra nem hozott hardverfunkciót használtak ki, hogy soha nem látott hozzáférést szerezzenek, és kémprogramokat telepítettek, amelyek érzékeny adatokat továbbítottak a támadók által ellenőrzött szerverekre.",
      "Az Apple azóta befoltozta a kampány által kihasznált négy kritikus nulladik napi sebezhetőséget, de a memóriavédelem megkerülésére használt titkos hardverfunkciót az Apple M1 és M2 CPU-iban is megtalálták, ami aggodalmat kelt más Apple készülékek biztonságával kapcsolatban.-"
    ],
    "commentSummary": [
      "A hackerek egy 4 éves kampányt hajtottak végre iPhone-ok ellen, fejlett kihasználási technikákat alkalmazva, és végül egy nem dokumentált hardveres GPU-regiszteren keresztül megkerülték a memóriavédelmet.",
      "A kampányt bemutató cikket az olvasók elismeréssel fogadták világos és átfogó magyarázatáért.",
      "Számos cikk jelent meg, amelyek mélyreható technikai információkat és elemzést nyújtanak a műveletről."
    ],
    "points": 406,
    "commentCount": 5,
    "retryCount": 0,
    "time": 1703697354
  },
  {
    "id": 38790597,
    "title": "Számellenőrzés optimalizálása if utasításokkal Pythonban és Assemblyben",
    "originLink": "https://andreasjhkarlsson.github.io//jekyll/update/2023/12/27/4-billion-if-statements.html",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38790597",
    "commentBody": "",
    "originSummary": [
      "A szerző azt a problémát vizsgálja, hogy egy szám páros vagy páratlan-e, nagyszámú if utasítás segítségével.",
      "Egy Python program segítségével olyan C programot generálnak, amely képes kezelni ezt a problémát 8 bites, 16 bites és 32 bites egész számok esetén.",
      "A méretnövelés során azonban korlátokba ütköznek a fordító és a futtatható fájl mérete miatt.",
      "E korlátozások leküzdésére kézzel írnak x86-64 assembly kódot, és létrehoznak egy függvényt, amely ellenőrzi, hogy egy 32 bites szám páros vagy páratlan.",
      "A program bizonyítottan hatékony és képes számok széles skáláját kezelni."
    ],
    "commentSummary": [
      "A vitafolyamat különböző programozási témákat érint, például az if utasítások használatát, a kód teljesítményének optimalizálását, a metaprogramozást és a kódgenerálást.",
      "A különböző programozási nyelvek hatékonyságát, a memóriakezelést és a mesterséges intelligencia programozásra gyakorolt lehetséges hatását is tárgyalja.",
      "A beszélgetés humoros, szkeptikus és személyes anekdotákat is tartalmaz, hogy magával ragadó és átélhető legyen."
    ],
    "points": 372,
    "commentCount": 117,
    "retryCount": 0,
    "time": 1703743891
  },
  {
    "id": 38783112,
    "title": "Háromszögelés művelet: Nulla-napos sebezhetőségeket kihasználó iOS támadási láncot fedeznek fel a kutatók.",
    "originLink": "https://securelist.com/operation-triangulation-the-last-hardware-mystery/111669/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38783112",
    "commentBody": "",
    "originSummary": [
      "A kutatók bemutatták az \"Operation Triangulation\" című támadási lánccal kapcsolatos eredményeiket, amely az iOS 16.2-ig terjedő iOS-verziókra irányul.",
      "A támadás nulladik napi sebezhetőségeket használt ki, köztük az Apple ADJUST TrueType betűtípus utasításában lévő távoli kódfuttatási sebezhetőséget, valamint egy JavaScript exploitot, hogy átvegye az irányítást a készülék felett és kémprogramokat futtasson.",
      "A támadók az Apple által tervezett SoC-ken egy ismeretlen hardveres funkciót használva megkerülték a hardveralapú memóriavédelmet, kihasználva a GPU koprocesszorhoz kapcsolódó ismeretlen MMIO blokkokat és bizonyos regisztereket a hardveres funkciók és megszakítások vezérlésére."
    ],
    "commentSummary": [
      "A fejlett kutatási képességekkel rendelkező hackerek az iPhone-ok ellen irányuló, \"Operation Triangulation\" néven ismert potenciális támadásról beszélnek, amely egy egyéni hash-funkciót és nulladik napi sebezhetőségeket használ fel a reklámok követésére és a felhőalapú iPhone-szolgáltatások észlelésére.",
      "Az Apple-nél a bennfentes részvételére vonatkozó spekulációk a hardveres interfész biztonságával és egy hátsó ajtó jelenlétével kapcsolatos aggodalmakat vetnek fel, és az Apple chipjeinek és az ARM tervezésének sebezhetőségét vizsgálják.",
      "A megbeszélések az iPad képességeiről, az SMS-üzenetekről és az Apple-nek az eszközök biztonságának javítására irányuló erőfeszítéseiről, valamint a webböngészők sebezhetőségéről, az üzenetküldő alkalmazások biztonságáról és a hackertámadások kockázatairól szólnak. Kiemelésre kerülnek az Apple biztonsági intézkedéseivel kapcsolatos aggályok, az eszközök sebezhetőségei és a fokozott védelmi stratégiák szükségessége."
    ],
    "points": 372,
    "commentCount": 332,
    "retryCount": 0,
    "time": 1703692075
  },
  {
    "id": 38782944,
    "title": "Hogyan győzött a Combat a csótányháborúban: a hanyatlástól az újjáéledésig",
    "originLink": "https://www.theatlantic.com/podcasts/archive/2023/11/cockroach-bait-invention-combat/676167/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38782944",
    "commentBody": "",
    "originSummary": [
      "Az 1980-as években a Combat nevű csótányirtó szer sikeresen csökkentette a csótánypopulációt, különösen a kormányzati épületekben.",
      "A kutatók olyan új csalogatószert hoztak létre, amely hatékony a hagyományos rovarölő szereknek ellenálló csótányok ellen.",
      "A csótányok számának csökkenése ebben az időszakban egybeesett a hidegháború végével, ami a nukleáris háborúval kapcsolatos aggodalmakat jelképezte. Most a csótányok a csalétkekkel szembeni ellenállóképességüknek köszönhetően visszatérőben vannak."
    ],
    "commentSummary": [
      "A megbeszélések a kártevők elleni védekezéssel kapcsolatos témák széles skáláját ölelik fel, beleértve a csótányok, poloskák, hangyák, szúnyogok és bolhák elleni védekezési módszereket.",
      "Viták folynak a különböző termékek és vegyszerek hatékonyságáról, valamint a kártevőirtási módszerekhez kapcsolódó kockázatokról és kihívásokról.",
      "A beszélgetések kitérnek a tisztaság fontosságára, a vegyi anyagok emberre gyakorolt lehetséges mellékhatásaira, valamint a természetes megoldások használatára az ipari növényvédő szerekkel szemben."
    ],
    "points": 306,
    "commentCount": 219,
    "retryCount": 0,
    "time": 1703691209
  },
  {
    "id": 38782678,
    "title": "ChatGPT bővítése: Strukturált adatok kihasználása API-val",
    "originLink": "https://minimaxir.com/2023/12/chatgpt-structured-data/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38782678",
    "commentBody": "",
    "originSummary": [
      "A cikk az OpenAI ChatGPT modelljének és a strukturált adatoknak a használatát vizsgálja.",
      "Tárgyalja a fizetős ChatGPT API előnyeit a modell kimenetének vezérléséhez és az olyan technikákat, mint a prompt engineering.",
      "A cikk kiemeli a Pydantic könyvtár használatát a JSON-sémák generálására és a strukturált adatokkal való munkára, kitérve különböző témákra, mint például a függvényhívás, az egymásba ágyazott sémák, az Union tipizálás és a rendszerkiírások fontossága."
    ],
    "commentSummary": [
      "Az összefoglaló a ChatGPT használatával kapcsolatos különböző témákat tárgyal, beleértve a strukturált adatok támogatását, a függvényhívó API-val és a JSON móddal kapcsolatos problémákat, valamint a hibaválasz nyelvtan hatékonyságát.",
      "Szó esik a JSON generálásáról a modellel, a különböző modellek teljesítményéről az OpenAI API-ban, a prompt engineeringgel kapcsolatos aggályokról és az utolsó kenet adásáról a katolicizmusban.",
      "Az összefoglaló kitér a problémamegoldó megközelítések hatékonyságára, az LLM és a jailbreak technika használatára, a GPT funkciók korlátaira, a tippek adásának hatékonyságára, a ChatGPT nemdeterminisztikus jellegére, a személyes tapasztalatokra és a modell fókuszban tartására a funkcióhívó üzemmódban."
    ],
    "points": 276,
    "commentCount": 85,
    "retryCount": 0,
    "time": 1703689759
  },
  {
    "id": 38788326,
    "title": "Valetudo: Csak helyi működés vákuumrobotok számára nyílt forráskódú szoftverrel",
    "originLink": "https://valetudo.cloud/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38788326",
    "commentBody": "",
    "originSummary": [
      "A Valetudo egy nyílt forráskódú szoftver, amely megszünteti a felhőfunkciók szükségességét a vákuumrobotoknál, lehetővé téve a kizárólag helyi működést.",
      "A Sören Beye által kezelt Valetudo jelentős felhasználói bázisra tett szert, és kiterjedt dokumentációt, valamint egy Telegram-csoportot kínál a támogatáshoz.",
      "Az Apache-2.0 licenc alatt álló Valetudo ösztönzi a kód láthatóságát és módosítását, így a felhasználóknak tulajdonjogot és ellenőrzést biztosít eszközeik felett."
    ],
    "commentSummary": [
      "A Valetudo egy nyílt forráskódú projekt, amely firmware-t készít robotporszívókhoz, lehetővé téve a magánélet megőrzését.",
      "A felhasználók sikerről számoltak be a Valetudo használatával, és nagyra értékelik a különböző vákuummárkákkal való kompatibilitását.",
      "A különböző vákuummodellek előnyeiről és hátrányairól, valamint a felhőalapú támogatással és az adatvédelmi kérdésekkel kapcsolatos aggodalmakról, különösen a kínai vállalatokkal kapcsolatban, viták folynak.",
      "A felhőalapú porszívókról eltérőek a vélemények: egyesek értékelik a kényelmet és az automatizálási funkciókat, míg mások aggodalmukat fejezik ki az ellenőrzés hiánya és a potenciális biztonsági kockázatok miatt."
    ],
    "points": 270,
    "commentCount": 91,
    "retryCount": 0,
    "time": 1703721084
  },
  {
    "id": 38788273,
    "title": "Nincs biztonságos iOS: A Chrome for iOS sérülékenysége aggodalomra ad okot",
    "originLink": "https://joshua.hu/apple-ios-patched-unpatched-vulnerabilities",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38788273",
    "commentBody": "",
    "originSummary": [
      "Az Apple még mindig biztosít biztonsági frissítéseket a régebbi készülékekhez, például az iPhone 6S-hez, de ezek csak bizonyos biztonsági problémákat kezelnek.",
      "A Google Chrome Blink renderelőmotorjában található sebezhetőség, amely a rendszerfájlokat felfedheti, a Chrome for iOS-ben is jelen van.",
      "Az iOS legújabb verziójában található sebezhetőség kihasználása lehetővé teszi a támadók számára, hogy ellopják a belső rendszerfájlokat, beleértve a kapcsolati adatokat, a hívás- és SMS-előzményeket, a böngészési előzményeket és a cookie-kat.",
      "Az Apple válasza arra utal, hogy csak akkor javíthatják a régebbi iOS-verziók sebezhetőségeit, ha azokat aktívan kihasználják.",
      "Ez aggályokat vet fel a régebbi készülékek iOS biztonsági frissítéseinek hatékonyságával kapcsolatban."
    ],
    "commentSummary": [
      "A cikk egy olyan sebezhetőséget tárgyal az iOS-ben, amely adatszivárgáshoz vezethet, és amelyet még nem javítottak ki.",
      "Rávilágít az Apple mérnökeivel való kommunikáció kihívásaira a hibajelentésekkel kapcsolatban.",
      "A Google Pixel telefonok és az iPhone SE modellek összehasonlítása a frissítési támogatás és a megfizethetőség szempontjából.",
      "Hangsúlyozzák az életciklus végét jelentő operációs rendszerekkel és biztonsági frissítésekkel kapcsolatos egyértelmű kommunikáció fontosságát.",
      "Megemlítik a régebbi eszközök támogatásával és biztonsági frissítéseivel kapcsolatos vitákat, valamint a biztonsági támogatás megszüntetésének etikai kérdéseit.",
      "Röviden szó esik a Spotify árazásáról az iOS-en a webhez képest, valamint a Linux futtatásának lehetőségéről Apple-eszközökön."
    ],
    "points": 245,
    "commentCount": 132,
    "retryCount": 0,
    "time": 1703720622
  },
  {
    "id": 38788360,
    "title": "Visszafejlesztett vonatbefolyásoló rendszer: [37c3 Esemény]",
    "originLink": "https://streaming.media.ccc.de/37c3/relive/12142",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38788360",
    "commentBody": "",
    "originSummary": [
      "A 2023-as 37c3-as rendezvényen egy előadást tartanak a vonatvezérlő rendszer visszafejtéséről egy meghibásodás elemzése céljából.",
      "Az előadás az elemzés műszaki és nem műszaki szempontjait egyaránt tárgyalja, és betekintést nyújt a modern vonatok működésébe.",
      "Az előadás több formátumban és nyelven is letölthető lesz a könnyű hozzáférés érdekében."
    ],
    "commentSummary": [
      "Egy lengyelországi hackercsoport olyan szoftverzárakat fedezett fel a Newag által gyártott vonatokban, amelyek célja az volt, hogy megakadályozzák a harmadik fél műhelyek által végzett javításokat.",
      "A zárakat valószínűleg versenyellenes okokból vezették be, megakadályozva a versenyt a javítási piacon.",
      "A hackerek a firmware különböző verzióit is felfedezték, a zárási algoritmus különböző változataival, valamint egy potenciálisan gyanús GSM-CAN-híddal együtt, amely távvezérlésként szolgálhat hátsó ajtóként."
    ],
    "points": 240,
    "commentCount": 24,
    "retryCount": 0,
    "time": 1703721397
  },
  {
    "id": 38787892,
    "title": "Nyílt forráskódú Rem: Forradalmi megoldás a számítógépes tevékenység helyi rögzítésére az Apple szilícium eszközein",
    "originLink": "https://github.com/jasonjmcghee/rem",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38787892",
    "commentBody": "",
    "originSummary": [
      "Az Apple Silicon eszközökön végzett összes számítógépes tevékenység helyi rögzítésének koncepcióját nyílt forráskódú megoldásként javasolják.",
      "Ez az elképzelés a számítógépes interakció forradalmasítását célozza azáltal, hogy a magánélet és a biztonság előtérbe helyezi, és biztosítja, hogy semmilyen információ nem hagyja el a laptopot.",
      "A javaslat szerint még a Sentry, egy népszerű felügyeleti eszközbe való bejelentkezés is a személyes adatok kiszivárgását kockáztatja."
    ],
    "commentSummary": [
      "A beszélgetés a számítógépes tevékenységek rögzítésére és elemzésére szolgáló eszközök és technikák fejlesztése és megvitatása körül forog.",
      "A hangsúlyt az adatvédelemre és a biztonságra helyezzük, valamint feltárjuk a technológia lehetséges alkalmazásait és korlátait.",
      "További témák közé tartozik az OCR technológia használata, a hibák azonosítása, a hibaelhárítás, valamint a QBASIC és a bat/cmd szkriptek említése."
    ],
    "points": 229,
    "commentCount": 95,
    "retryCount": 0,
    "time": 1703717782
  },
  {
    "id": 38789411,
    "title": "A minőség romlása: A Look Into Eldobható termékek",
    "originLink": "https://walterkirn.substack.com/p/generation-junk",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38789411",
    "commentBody": "",
    "originSummary": [
      "A cikk rávilágít az általunk vásárolt termékek minőségének romlására, személyes anekdotákat hoz fel példaként a gyorsan meghibásodó vagy tönkremenő készülékekről és háztartási cikkekről.",
      "A szerző feltárja az ilyen tapasztalatok okozta csalódottságot és csalódást, és tárgyalja a környezeti hatásokat, valamint a jövőre vonatkozó felfogást.",
      "A tervezett elavulás lehetséges szerepe és a minőségromláshoz hozzájáruló gazdasági tényezőkről alkotott eltérő vélemények is szóba kerülnek."
    ],
    "commentSummary": [
      "Szóba kerül az a vélekedés, hogy a termékek egyre kevésbé tartósak, annak ellenére, hogy az adatok azt mutatják, hogy a modern autók valójában megbízhatóbbak.",
      "Az olyan tényezők, mint például a vállalatok rövid távú nyereséget helyeznek előtérbe, és a hibás termékek elfogadása a fiatalabb generációk által, hozzájárulnak a csökkenő tartósságba vetett hithez.",
      "A beszélgetések olyan témákat érintenek, mint a régi autók és készülékek megbízhatósága, a fogyasztási cikkek minőségének és javíthatóságának romlása, a jó minőségű bútorok elérhetősége és ára, valamint a termékminőséggel kapcsolatos ismeretek megszerzésének fontossága."
    ],
    "points": 225,
    "commentCount": 295,
    "retryCount": 0,
    "time": 1703731452
  },
  {
    "id": 38782482,
    "title": "A magas rövidlátás növekvő aránya Tajvanon és az ázsiai országokban: A vakság egyik vezető oka",
    "originLink": "https://www.wired.com/story/taiwan-epicenter-of-world-myopia-epidemic/",
    "originBody": "",
    "commentLink": "https://news.ycombinator.com/item?id=38782482",
    "commentBody": "",
    "originSummary": [
      "A rövidlátás (rövidlátás) aránya Tajvanon és a világ más részein is növekszik olyan tényezők miatt, mint az életmódbeli változások és a szabadban töltött idő korlátozottsága.",
      "Ian Morgan professzor kutatása szerint a több időt a szabadban töltött idő csökkenti a rövidlátás kockázatát.",
      "Tajvan programokat hajtott végre a rövidlátás kezelésére, de a COVID-19 világjárvány megzavarta ezeket az erőfeszítéseket. A lehetséges megoldások közé tartoznak az üvegfalú osztálytermek és a vörös fényterápia."
    ],
    "commentSummary": [
      "Az összefoglaló a rövidlátást, a látást befolyásoló állapotot tárgyaló megjegyzések és válaszok összeállítása.",
      "A résztvevők megosztják személyes tapasztalataikat, és feltárják a rövidlátással kapcsolatos lehetséges okokat, kezeléseket és tényezőket.",
      "A vita olyan kapcsolódó témákat érint, mint a retina leválása, a floaterek és az urbanizáció hatása a szem egészségére."
    ],
    "points": 217,
    "commentCount": 158,
    "retryCount": 0,
    "time": 1703688757
  }
]
